[{"id": "97f679dcd2dbbc32d13bd5cd0066a4e285b9979a", "text": "THE GIBBET OF REGINA\n\nTHE TRUTH ABOUT RIEL\n\nSIR JOHN A. MACDONALD AND HIS CABINET BEFORE PUBLIC OPINION\n\nBY ONE WHO KNOWS\n\nNew York\n\nTHOMPSON & MOREAU, PRINTERS AND PUBLISHERS\n51 AND 53 MAIDEN LANE\n1888\n\nFor Sale by all Principal Newsdealers and Booksellers in the United States and the Dominion of Canada.\nIN MEMORY OF\nLOUIS DAVID RIEL,\nBorn in 1844\nAND\nCowardly executed on\nNovember 16, 1885,\n\nA TRIBUTE FROM\nHIS COUNTRYMEN AND SYMPATHISERS.\nTHE GIBBET OF REGINA\n\nTHE TRUTH ABOUT RIEL\n\nSIR JOHN A. MACDONALD AND HIS CABINET BEFORE PUBLIC OPINION\n\nBY ONE WHO KNOWS\n\nNew York\n\nTHOMPSON & MOREAU, PRINTERS AND PUBLISHERS\n\n51 AND 53 MAIDEN LANE\n\n1886\nPREFACE.\n\nNEW YORK, November 17th, 1885.\n\nMY DEAR MR. THOMPSON:\n\nAll is over!\nLouis David Riel is no more!\nUniversal history counts in its pages a new bloody episode.\nHenceforth the 16th day of November, 1885, will be for French Canadians the date of the basest insult ever inflicted upon their nationality, their race, their faith and their dignity.\nHumanity and civilization have been laughed at and odiously outraged by Sir John A. MacDonald and his Cabinet. Justice has been baffled! Orangeism has won the day. You were still doubting a few days ago that the fiendish hatred of the mephistophelic Prime Minister of the Dominion of Canada would dare follow to the end his mortal designs against Riel. To-day, doubt is no longer possible; Riel has paid with his head his ardent love for his country.\n\nYou have asked me to put down in writing some facts I mentioned to you in our last conversation.\n\nBe it so!\n\nYou will find in the manuscript herewith, my frank and candid opinion on this painful affair, and the narration of facts I have witnessed during the five years I lived in Manitoba.\n\nUse what I now send you to the best of your judgment, and whatever you do with it, rest assured that I am only too happy to join my voice to the general imprecation aroused by the brutal execution of the French Half-breed Louis David Riel.\n\nVery respectfully,\n\nONE WHO KNOWS.\n\nTo the American public:\n\nThe above letter I received a few days after Riel's execution. Like a great number, I had hoped against hope, that what has taken place could, and would have\nbeen avoided. But, it appears, that every friend of justice and humanity was fated to a sad disappointment; none could have anticipated that blind hatred would have prevailed against the unbiased and unanimous opinion of the whole civilized world.\n\nAfter a careful reading, I decided to publish, in the form of a book, the manuscript referred to, because it is based upon undeniable facts; because those facts and occurrences are vouchsafed for by men who have closely followed the transformation of the Canadian North-west into a conglomerant of the Dominion of Canada.\n\nThese pages, to be sure, are written with great vehemence of language; but, how could it be otherwise? The writer saw, felt and comprehended. Simplicity of language could not adequately have painted criminality organized into a system.\n\nBe that as it may, the American reader—conscientious, searching and logical by nature—will find, in these pages, matter to reflect upon.\n\nOn the one hand, he will find short-sighted policy, criminal indifference and cowardly animosity, all combined to crush vested rights, ignore solemn and oft-repeated pledges, and violate all those principles of humanity that are recognized and respected by all nations having any claim to be called civilized.\n\nOn the other hand, the American reader will find an isolated and circumscribed, but spirited race—the victim of unmitigated outrages and base misrepresentations—\nfighting against large odds for the revendication of their rights and the protection of their homes and families.\n\nFar from me the thought of making any invidious observation to the American public about the prima facie similitude between Washington and Riel's career.\n\nBoth were apostles of human rights! Both were arrayed against the same secular arbitrarism! Both fought the same implacable despotism!\n\nBut here the similitude ceases! And why?\n\nBecause Washington fought and conquered with the help of Frenchmen!\n\nAnd because Riel succumbed, and was defeated by the help of an American Administration!\n\nHow consoling to be able to logically remark: That governments are invariably responsible to the people, but that the people are not invariably responsible for their government?\n\n* * *\n\nIn the presence of a freshly sealed coffin, words of bitterness, to be sure, are out of place. But I beg to ask you, Americans, when you were struggling for existence; when, later on, piratical expeditions were organized and launched from the Canadian frontier (with the knowledge of Sir John A. MacDonald, who was then, as he is now, the Premier of the Canadian Cabinet) against peaceable American villages; when you called to arms, not alone your native-born citizens, but all mankind, in the defence\nof the grandest political institutions known to ancient and modern times, who answered your cry of alarm?\n\nAssuredly not the men represented by the party in power at Ottawa, to whom President Cleveland has so courteously given the right of way on American soil, for the transportation of arms and ammunition, in order to enable the bitterest enemies of the United States to annihilate the Half-breeds who were following in the footsteps of your forefathers!\n\nTo one misguided Orangeman, or, better, to one strayed Tory disciple of Sir John A. MacDonald—who was omnipotent at Ottawa then as he is today—that fought for the preservation of this glorious Republic, thousands of sympathetic French Canadians can be named, who nobly and disinterestedly upheld the flag. The conflict made tombs in our nationality, and we are proud of it. Your final success threw dismay in the official circles at Ottawa, as well as in the ranks of Orangeism; but an American Administration has just been found to assuage Toryism bitter disappointment by making amends for all that!\n\nWhat is all the trouble about? Let us take a retrospective view of the matter.\n\nThe French Canadians discovered and settled the country they live in. Embroiled in a struggle not of their seeking, and over which they had no control, they\nwere shamefully abandoned and finally sacrificed to the sensual proclivities of a king who had more love for the gown of a courtezan than for the flag of France. Notwithstanding, they secured, first by treaty, and compelled, later on, through legislation, the granting of all those rights which Riel and his Half-breed brothers sought to revendicate, because they had been systematically trampled upon by the Ottawa Cabinet.\n\nThe Half-breeds are the descendants of those hardy French Canadian pioneers, whose love of travel and discovery, took them into the wild prairies of the Northwest, where they finally settled into a semi-hunting and semi-agricultural life—following, in this last occupation, the customs and the idiosyncracies of their ancestors, who had made a garden of both banks of the St. Lawrence.\n\nThese Half-breeds belong to that race of energetic men who were the first settlers of the Western States, at a time when colonizing in those wild prairies meant something more than breaking the ground and raising a crop for shipment to Eastern ports; moreover, they are the kindred of these courageous pioneers who have either christened or given their own names to the most important cities of the West.\n\nThey are acknowledged to be a hospitable, mild, peaceable and law-abiding people. Selfishness is unknown to their vocabulary; with them, faithfulness, providency and thrift are heirlooms which have never been bartered by the humblest of the race.\nLike the French Canadians, they were settled upon a soil which their ancestors had discovered and fertilized with the sweat of their brows. Like yourselves, foreign to all sentiments of jealousy, they invited all men of goodwill to settle in their midst, with the moral and legislative guarantee that uprightness, irrespective of creed or nationality, was all that the State sought for; and, morally and constitutionally, the State has no business nor right to seek for anything else.\n\nWhen we, French Canadians, sent out such a generous and untrammelled invitation, we did not expect, nor did we have in view, to borrow the prejudices, the intolerance and the rancors of past ages. This vast continent has no room for such cast-off clothes.\n\nBut, what did we get in return, for our broad and generous hospitality?\n\nAn arrogant and dictatorial oligarchy, bent on perverting the sacred aims of justice and legislation. And who, with the view of making itself omnipotent, transplanted to our virgin soil, hatred as repulsive as it was unnatural; excited, between co-existing races, national animosity; concocted intolerance of creeds, and finally, to crown its diabolical monument of infamy, exacted the head of a son of the soil who had had the temerity to protect, against oft-admitted unjustifiable spoliation, the roofs that sheltered his countrymen and his own family.\nThose are the men to whom—when on the eve of receiving a well-merited castigation for all their misdeeds—an American Administration has given aid and comfort.\n\nAll fair minded people acknowledge that States, like individuals, owe each other a goodly amount of courtesy in their intercourse; but, I have yet to learn, that the footpad has any claim in his criminal undertaking, upon the assistance of the respectably disposed, or that a government that has put itself beyond the pale of civilization—as the Canadian Government did by luring and then defrauding the Half-breeds of their legitimate inheritance—has any claim in its nefarious and sanguinary policy upon the courtesy of a government or of a people which it has done its utmost to destroy at the most critical time in its history.\n\nI am somewhat inclined to think that, in this instance, the good faith of the American Administration has been surprised; but it is as well that, in case of possible future emergencies, the situation should be elucidated, in order to avoid a repetition of any such intemperate awkwardness on the part of the Executive.\n\n* * *\n\nMy American readers will readily understand why I have thought proper to publish The Truth About Riel. It will be a revelation to many, who could not, on account of the system of misrepresentations and calumnies inaugu-\nrated by the Canadian Cabinet, and circulated broadcast by its paid agents, form a candid opinion upon the merit of the question at issue;—I say at issue advisedly, because the question of the status of the Half-breeds in Manitoba and the Saskatchewan is far from being settled. So far, the only thing settled, as it were, is the future of Sir John A. MacDonald's Cabinet.\n\nBe that as it may, I will consider myself amply repaid for all trouble, if through my instrumentality the truth is known about a race who has been unmercifully calumniated after having been mercilessly persecuted; about a chivalrous leader who was immolated on the scaffold in order to satisfy the insatiable cravings for blood of an Order which has been, from its incipiency, a blot upon civilization and a putrefactive sore upon mankind—an immolation which was accomplished in spite of the indignant clamor of every being imbued with conscience, justice and uprightness.\n\n* * *\n\nTo my Canadian friends of all origins:\n\nA word of supplication!\n\nAn unjustifiable outrage has been committed upon a whole race. It behooves all good and well-thinking men, irrespective of origin or creed, to band together, and see that justice is done.\nThe disgrace bears equally upon all, hence the necessity of a combined effort to wipe out the stain.\n\nRiel and the Half-breeds did not rebel against the established institutions of the country while those institutions were legally and justly administered. Goaded and famished, they rebelled against a set of unscrupulous jobbers and thieves, who were administering the country for their own personal benefit and for the benefit of their minions, with whom they divided the spoils.\n\nSir John's Cabinet and his satellites have done more by omission and commission to bring into contempt your institutions, than any well-regulated Orange lodge has ever done to break the peace in your very midst.\n\nTo wipe out the stain, to avert and put at naught all possibilities of direful complications, the ill-omened thirteen Ministers must be hurled from the responsible positions which they have betrayed so shamefully.\n\nYour country is exceptionally situated. It cannot prosper and it cannot march onward in the path of progress, with men at its head, who, derelict to well-understood conservatism, single out a race and a creed, and offer it as a holocaust to its sworn enemy!\n\nSuch men have incapacitated themselves for any position of trust, or of responsibility, in a country situated and populated like yours.\n\nThey are a constant danger, an impending menace!\n\nAlready, two of them, realizing the depth of the abyss they had dug for all their future political aspira-\ntions, have attempted extra-parliamentary explanations.\n\nMutism before, verbosity after, the deed!\n\nMen of that calibre should not be kicked out, shoving is good enough for them.\n\nBut all honest men must see that it is done.\n\n* * *\n\nTo the French Canadians:\n\nWhat must be said of the three French Canadian Ministers who are named Langelin, Caron, Chapleau?\n\nThe two first wear the English livery, they were made baronets; and the last . . . what a place in such a trio for the bearer of the French cross of the Legion of Honor!\n\nWhat a touching spectacle, that of Chapleau, wearing the French cross of the Legion of Honor while signing the death-warrant of his countryman Riel—a death-warrant which was exacted from him by Orangemen, the deadly enemies of his race!\n\nDecorated—alas! like too many others—through pure complacency, Chapleau inwardly felt the necessity of accomplishing some kind of remarkable deed in order to justify his sponsors for having put his name forward for the decoration.\n\nHow pleasant will be the surprise of those sponsors, on meeting their protégé, to find him wearing another\ntrinket at his buttonhole, a fringed piece of the rope that strangled his countryman Riel! There's luck in the hangman's rope! However, Chapleau can justify of this second decoration in more than one way: He was the signer of the death-warrant, and his brother was the executioner! This is rather too much honor for one single family!\n\nIf this was not already too disgusting, matters could still be flavored in that respect, by hoisting the elder Chapleau by one notch in the Legion of Honor, and by pinning a rosette to the lappel of the younger brother's coat!\n\nOr, better still, Chapleau might be struck from the roll of the Legion of Honor, which was not founded, that I am aware, to reward and encourage French traitors!\n\nBut, this is not exactly the place nor the time for such recriminations. Therefore, I will leave to patriotic French journalists the task of requesting from the proper authority a categorical explanation about all this dirty linen. In so far as the French Canadians are concerned, if no better judgment is shown in the distribution of the distinctions of the French Legion of Honor in our country, we will be forced to the unavoidable conclusion that an attempt is on foot to make that Order a rival of the celebrated Rogues' Gallery of New York!\n\"Close-the-ranks,\" must be your watch-word. In order to present a solid front, former political divisions must be set aside in the presence of your arrogant, persistent and unscrupulous foe.\n\nThe organisation of your forces must be thorough and permanent. Your enemies have declared already, with a contemptuous smile, that a pittance thrown to the Province of Quebec by the Ottawa Government, will smother your indignation.\n\nYour programme must be—\n\nFirst.—Constitutional agitation must not cease until you have relegated to oblivion the ministerial miscreants who are responsible for all the mischief.\n\nSecond.—The Half-breeds must be reinstated in the lands of which they have been despoiled, and indemnified just like the sufferers of 1837-38.\n\nThird.—The Orange Order, which is a menace not only to your faith, your tongue and your nationality, but which is a menace to law and order, which is incompatible with the ordinary decency of any well governed community, must be made to understand that it has to stand back. Your only guarantee is to have laws enacted disqualifying its votaries from the franchise and from holding any official position under\n\n1st. Your local government;\n2d. Your municipal system, and\n3d. In the Federal government.\n\nCommunities have the inherent right of enacting\nlaws for their protection. Dogs' ferocity is the subject of salutary enactments by all municipal bodies, why should not Orange madness be placed on the same plane?\n\nIf, through constitutional agitation, you cannot secure these safeguards or their full equivalent, you have no right to remain in the Federation of the Provinces.\n\nYour enemies, emboldened by this fresh triumph, will not only continue their work of persecution, and make you lead a life of abjection, but they will, in the course of a very short time, legislate your race into insignificance and complete dependence.\n\nGratitude with them is an unknown quantity. Look at the treatment you have met at the hands of Sir John A. MacDonald, after more than thirty years of unstinted support from the French Conservative element of your population, to which he owes everything, even the opportunity of betraying you!\n\nNo, either through persuasiveness or compromise, you have nothing to expect from that quarter. The time of temporizing is past; that of exacting has come! And you must exact with firmness and dignity; but, be on your guard, because you are dealing with a cunning and cowardly foe.\n\n* * *\n\nIf you show determination and firmness the perpetrators of the atrocities in Manitoba and the Saskatchewan; the builders of the Regina gibbet, will meet their\ndeserts; you will be considered; you will enjoy, unmolested, the reward of patriotism, the fruits of your labor, and transmit, to your children, unimpaired and unscathed, the inheritance left you by your valorous fathers: A free and liberty-loving country, where peace and happiness dwelleth.\n\nYou have not only the sympathies of the civilized world, but potential civilizing elements side with you, and will give you comfort in your time of need.\n\n\"Do your duty, and fear not!\"\n\nOne of yours,\n\nNapoléon Thompson.\n\nNew York, January, 1886.\nTHE\n\nTRUTH ABOUT RIEL.\nTHE TRUTH ABOUT RIEL.\n\nI.\n\nA great many people, imperfectly acquainted with what they were talking or writing about, have freely expressed opinions regarding Riel's fate.\n\nIt would be difficult, almost impossible indeed, for any one who has not been closely connected with what took place in the North-western territory, to see clearly into the intricate state of affairs that has convulsed that portion of British America since the Metis' outbreak; which had its prologue in 1869, and its epilogue in 1885, in the hanging of Riel, the recognized leader of the French Half-breeds.\n\nIn order to satisfy my readers that I have some right to express my opinion on this gloomy subject, I will remark that I have lived in the North-west from 1869 to 1874, and through the official position I then occupied in that country, under the Canadian Government, I was directly connected with almost everything that took place in Manitoba during that period of five years.\ngo as far as to say that during that time I was often called upon to give, in an official capacity, my views on some very important administrative questions; and, as what follows is only an exact and impartial narration of facts, completely devoid of any personal preference or feeling, I think the honesty of purpose which prompts me to write this book will not be doubted.\n\nI have heard and seen all I am about to relate. I have taken part in many of the events herein narrated, and I leave to the world the task of forming a judgment upon the course pursued by the Ministers of the Dominion Government, in their policy regarding the French Half-breeds, and to decide if the Canadian Ministers are or are not responsible; not only for the unjust and barbarous execution of the Half-breed Louis David Riel, but also for the criminal inertness that has caused it.\n\nCAN RIEL BE CHARGED WITH REBELLION?\n\nThere cannot be the least doubt that Riel has been a continual source of annoyance and anxiety to the Dominion Cabinet, since 1869, but was he to blame for that? Was he an inveterate and systematic revolutionist, or a man who, conscious of his rights as a British subject and a free human being, would not allow himself and his countrymen to be unmercifully trampled upon by the iron heel of the Canadian rulers?\n\nWas his death on the scaffold, erected by the order of\nSir John A. MacDonald and his Cabinet, a deserved and just expiation, or was it a crime coldly prepared and perpetrated to serve personal and political purposes?\n\nWithout pretending to impose my opinion about this lugubrious affair, nor expecting to change the face of things in Canada; the publication of what I know, will, nevertheless, I most sincerely hope, throw a different and a new light on the events that have taken place in Manitoba and in the Saskatchewan from 1868 to 1885.\n\nHOW WERE THE METIS TREATED FOR YEARS?\n\nThe Metis have indeed been an ill-fated race for many years. For a long time before the purchase, in 1869, of the territorial rights, by the Canadian Government, from the Company of Adventurers of England (better known as the Hudson Bay Company), they were the direct means of the making of that immense and incalculable fortune which placed the Hudson Bay Company at the head of the most powerful corporations in existence.\n\nHunting and trapping was their only resource. The stores of the numerous posts of the Company were at all times overflowing with valuable skins brought in by the Half-breeds. The rich furs of every description were bought by the Company's officers at ridiculously low prices; the trading scheme was carried on in a most lively manner: a bank-note, a few pounds of flour or salt pork, a small keg of gunpowder and shot, a common suit of clothes\nor an incomplete outfit could secure a quantity of valuable skins worth one hundred times the trifling cost of the articles given in exchange, and the Hudson Bay Company was able to supply yearly all the European markets with immense quantities of furs thus bartered from the poor victimized Metis.\n\nThis, taken in a certain light, was, of course, very natural and nothing more nor less than a straight business transaction. But when that wide and rich country became exhausted, when the buffalo had almost completely disappeared, when the otter, marten, beaver, ermine and all the other fur-bearing animals of its regions were becoming scarcer every year, the Hudson Bay Company's authorities thought of ridding themselves of their no longer valuable possessions by selling their territorial rights to the Canadian Government, and the transfer was accomplished without the knowledge of the Metis.\n\nThey were only Half-breeds after all! Why should the Government or the Hudson Bay Company take the trouble of apprising them that they had been sold and bought like live-stock?\n\nBut this simple, inoffensive and peaceful people understood that no Government, no power on earth had the right to buy a population composed of Christians like a lot of living beasts! They instinctively saw danger for their homes, their wives and children in that arbitrary Canadian invasion; they perceived that their rights, as men living on free American soil, had been ignored\nand violated. Riel, whose education and natural intelligence had placed him foremost among his fellow-countrymen, was chosen as their leader, and the entire Metis population took up arms to prevent the Canadian Government from entering the country.\n\nMr. McDougall, the first Lieutenant-Governor appointed by the Dominion Cabinet, was stopped with his staff at Pembina, and was obliged to retreat and return to Ottawa without even seeing the seat of his government.\n\nWas Riel a rebel then? If so, it must be confessed that his rebellion had a noble and generous aim: that of defending the land of his birth against an unwarranted invasion; of protecting his countrymen, his sister and mother, nay his father's grave, against an arrogant enemy!\n\nTHE PROVISIONAL GOVERNMENT.\n\nA Provisional Government was formed by the Half-breeds and took its seat at Fort Garry. Riel was unanimously elected President. Resolutions were passed, engrossed and presented to the Canadian Cabinet. These Resolutions did not receive the least attention.\n\nTHE RED RIVER EXPEDITION.\n\nBy this time the Cabinet of the Dominion plainly saw that something had to be done. An expedition\nwas decided upon, and four thousand men were soon ready to start for Manitoba.\n\nThe expeditionary corps was composed of a regiment of regulars, a battalion of Quebec rifles, a battalion of Ontario rifles, a sufficient number of engineers, and a complete commissariat.\n\nColonel Wolseley, afterwards Sir Garnet Wolseley, and now Lord Wolseley, was appointed Commander in Chief of that military picnic, which was called the Red River Expedition. After making a considerable number of portages and running numerous rapides he landed in Winnipeg with his troops at the end of August, 1870.\n\nRiel and his followers had left Fort Garry and the British territory before the gallant Colonel's arrival; probably because they felt that their cause was a lost one, or, perhaps, because the young leader recoiled at the idea of exposing his country and his people to the horrors of a long and bloody civil war. However, Colonel Wolseley found that Fort Garry had been abandoned by the Metis, and the first thing he did after arriving in Manitoba was to issue a proclamation; apprising the population of the Province that he intended to deal unmercifully with the banditti (sic) who had dared to resist the authority of his Gracious Sovereign, the Queen of England.\n\nAnd thus ended the Red River Expedition, which cost several millions of dollars, to the Government that ordered it. But, of course, for the accomplishment of so glorious an undertaking money was no object! Were not\nthe good Canadians rich enough to pay, without murmuring, for what has since proved to be a sinister blunder? Taxes came in more regularly than ever. It was the people's money that was paying for the fun, and, most painful to say, French Canadians were made to help with their money a military expedition organized for the purpose of pitilessly oppressing their Half-breed brothers in Manitoba.\n\nThese heroic Half-breeds, these simple but honest sons of the wild prairies, who had formed a defensive alliance in order to protect their country, their wives and children, their own blood in fact, were called \"banditti\" by the representative of the very government that had bought them as the planters of yore bought a plantation with all the human flesh on it!\n\nON TO THEM! KILL THEM!\n\nAnd here are the wonderful arguments put forward by Sir John A. MacDonald and his Cabinet:\n\nThese contemptible half savages, who knew nothing but to hunt, and whose too slavish hands had been for years the gigantic and inexhaustible cornucopia that filled the large and numberless coffers of a company of adventurers from England, had had the audacity to protest like men against the violation of their so-called rights!\n\nThese ignorant half Indians, these French Metis, as they called themselves, who could but fervently pray to\ntheir God, tenderly love their families, and live without ever thinking of doing any harm to their neighbors, had dared to reject the protectorate of a government which, after their submission, would be only too willing to throw to them a small piece of land, like a bone to a famished dog!\n\nThey were only despicable human beings after all, and they had the impudence to reject this opportunity of being blessed by the contact of an iron-handed civilization!\n\nWhat a monstrosity!\n\nNo pity for them!\n\nChrist died for all and every man: what of it? They were made in the image of their Savior, it is true, but they were only ignorant beasts!\n\nBring them to submission, not by kind words or persuasion, but by force; they must bend or break!\n\nOn to them! Shoot them down like wild and ferocious animals! Kill them!\n\nAnd after the bloody work of civilization is done, if some of the remaining miscreants dare to refuse homage to our benevolent Sovereign, a few planks, a rope, and the sheriff will do the rest!\n\nA PAMPHLET.\n\nA few months before the Red River Expedition was organized, a much to be regretted occurrence took place in the Province of Quebec.\nHis Grace Mgr. Alexandre Antonin Taché.\nThe Right Reverend Alexander Taché, then Bishop of St. Boniface (Manitoba), and since elevated to the archbishopric, published a pamphlet in which he strongly advised the young French Canadians not to take any active part in the projected campaign: The soil of Manitoba was a poor one, offering but little chance for improvement; the rebellion had not a serious character, and all the trouble would soon end, etc., etc., etc.\n\nThis pamphlet, containing such or similar advice, emanating from a most and justly venerated prelate, was freely distributed among French Canadians, and mostly all of the Catholic priests, in the Province of Quebec, preached and recommended to their parishioners the advisability of following the worthy Bishop's counsel.\n\nThe effect of the pamphlet can easily be imagined. When the recruiting of the two battalions of volunteers began, a comparatively small number of French Canadians were enlisted. These battalions, each about 600 strong (1,200 in all), did not count in their ranks, when formed, over 150 French Canadians, that is to say, eighty-eight per cent. of the effective volunteer force were English Canadians, mostly from Ontario.\n\nEach and every one of these men was to receive, as compensation, 160 acres of land, after the expiration of his military term, and ninety per cent. of them settled in Manitoba. Thus the British element dominated in the Province after its submission, and it has been so ever since 1870.\nIt is not in the least probable that Archbishop Taché ever thought for an instant that his pamphlet would have such a lamentable effect against his own people, and far from me any idea of blame or reproach for the venerable Bishop's action. I sincerely believe it was dictated to him by a commendable conviction, but one thing is certain, indisputable: Manitoba and the Saskatchewan have been from the start, are yet, and will remain under the complete control of Canadians of English origin, and that portion of the Dominion is lost for ever to the French Canadian supremacy.\n\nHere comes naturally two questions which would be very hard to answer, but offering, nevertheless, a wide field for reflection: Had the Province of Manitoba been ruled by a strong majority of the French Canadian element, would the last insurrection have taken place? And, if it had taken place, would Riel have mounted the scaffold at Regina?\n\nI leave to the intelligence of the eminent and patriotic French Canadian politicians the care of meditating over these questions, and of finding a plausible solution to them.\n\nTHOMAS SCOTT.\n\nThe execution of Thomas Scott, ordered in 1869 by the Provisional Government of Manitoba, has been the chief accusation brought against Riel by Upper Canada.\nScott was an Orangeman, and his co-religionists have found in his execution inexhaustible food for their hatred against French Canadians, or anything that is Catholic. The merciless pressure they have exercised over Sir John A. MacDonald, previous to Riel's execution, is convincing evidence that the fanaticism and bigotry so bitterly reproached to Catholics in Canada, are far more intense among Orangemen, who have never as yet lost an occasion to manifest it loudly!\n\nSELF-DEFENCE.\n\nThomas Scott was far from being the good natured sort of a fellow his Orange friends have tried to make believe. On the contrary, he was a rough character. He had threatened Riel's life on several occasions and he was certainly known as capable of carrying his threats into execution. I know as a positive fact that Riel himself was opposed to Scott's execution, even after the sentence had been pronounced. I know also that he tried his utmost to save him, but his intervention was accorded no attention by his followers.\n\nAll those who knew Scott well (and I have been brought into contact with many of them) agree in saying that Riel's life was in immediate danger so long as Scott was allowed to go free around the country.\n\nThis case was one of self-defence, nothing else.\nThe probabilities are that I will never go back to Canada. I expect no favor whatever from any party or parties. I have no more preference for the French Canadians than for English Canadians. I shall certainly never ask for anything from a Canadian source. My religious sentiments are of no consequence in this matter. I am not writing this in order to win or obtain the good will of certain people. I care not if my opinion is shared or endorsed by ten men or ten thousand men. A bloody deed has been accomplished. I know all or nearly all the parties that have been directly or indirectly connected with it, and what comes from my pen is dictated to me by my own conscience, and by my own conscience only. I write all I know and express the opinion I have formed after having heard and seen.\n\nPublic opinion, humanity and the Christian world will judge which of the two men is the greatest murderer, the vilest criminal—Sir John A. MacDonald, K.C.B., . . . a member of Her Majesty's Privy Council, Premier and President of the Council for the Dominion of Canada, the modern Machiavelli and Supreme Ruler of one of Queen Victoria's colonies, the old, decrepit and unscrupulous statesman who has already one foot in the grave, or Louis David Riel, the young, energetic and heroic Half-breed who, at the age of twenty-six, took up arms for the defense and protection of his native land, and who, sixteen years after died bravely for its cause, without even cursing the name of the man who had plotted and ordered his death?\nTHE TROOPS IN MANITOBA.\n\nAfter the arrival of the Canadian troops in Manitoba, August, 1870, the country soon quieted down and the establishment of the Canadian Government went on steadily under the able direction of Mr. Archibald, the first Lieutenant-Governor of the Province.\n\nThe first battalion Ontario Rifles, composed almost exclusively of English Canadians and Orangemen, was quartered at Fort Garry; that is to say, in the midst of the French Half-breed settlement; and the second battalion Quebec Rifles, in whose ranks were the 150 French Canadian Volunteers, was sent to the Stone Fort, twenty-two miles distant, and surrounded by the English population of the Province.\n\nWas this arrangement a wise one? I hardly think so, and the numberless scenes of horror that soon followed prove that the contrary would have been far better! But, the Commander in Chief, Colonel Wolseley, the same who almost commenced his military career in Manitoba, and who recently ended it so gloriously in the Soudan, had ordered that it should be so, and so it was!\n\nHere, a very strong and very peculiar analogy strikes me as being worthy of remark: Wolseley was sent to Manitoba with positive instructions (no doubt) to hang Riel, and he could not accomplish his mission, he arrived too late! Fifteen years later he was dispatched to the Soudan at the head of a strong and imposing army, with\norders to rescue General Gordon, and there again he arrived too late!\n\nHe had only a small army when he went to Manitoba, and, save myriads of mosquitoes, found nobody or nothing to fight with; he went back to England a great victor, and he was made a General and a Sir. Later on he was made a Lord!\n\nWhen he went to the Soudan, he had the command of a large army, and there at last he found a chance to fight. But this time the enemy proved a trifle tougher than mosquitoes, and the result was (notwithstanding the assertions to the contrary published at the time by the English press) defeat after defeat, and a double-quick retreat.\n\nThe worse of it all, is that poor gallant General Gordon never saw the radiant face of his would-be rescuer—and who can tell that it was not Wolseley's incapacity and slow action that caused Gordon's death?\n\nVictorious when he had nobody to battle with, Wolseley was thrashed ignominiously when he met the soldiers of the Mahdi. He was successful in Manitoba with a small body of troops without firing a single shot, and he called his invisible enemy, \"banditti.\" In the Soudan, when commanding thousands of well armed men, he was most shamefully beaten. Nevertheless, he returned to England, and was received with cheers. His next reward (?) will be a Duke's title, and he will change his name from LORD MOSQUITO WOLSELEY to that of Duke KARTOON TOOLATE!\nAnd, of course, he will duly modify and improve his ducal escutcheon, and place prominently on it the livid and bloody head of brave General Gordon!\n\nATROCITIES COMMITTED BY THE ONTARIO VOLUNTEERS:\n\nThe Red River Expeditionary Corps was three months on its way to Manitoba, from Collingwood to Winnipeg. The soldiers, regulars and volunteers, did not receive a penny during the journey. Five or six days after their arrival, they were paid in full, giving each man an average of twenty dollars.\n\nIt was then that the lugubrious fun commenced. Those men who were supposed to be kept under the rules of strict military discipline, went around Winnipeg and vicinity, infuriated and drunk, yelling, swearing, cursing and threatening. They were looking and searching for the murderers of Scott. They unmercifully insulted and assaulted the Half-breeds who had been imprudent enough to come to town in order to attend to business. As yet there was no police force organized. Those soldiers, clad in the uniform of Her Most Gracious Majesty, became intoxicated and delirious brutes. They insulted women and children, beating most cruelly every Metis unfortunate enough to cross their path. They often entered isolated houses where they found defenseless women and children. The outrages they commit-\nted on many occasions are too revolting and too horrid to be put down in writing. All this was perpetrated in the name of their God and King William of Orange, and remained utterly unnoticed by the superior officer commanding at Fort Garry, Colonel Jarvis. He smiled complacently and indifferently at all these atrocities, more worthy of cannibals than of soldiers whose duty was to keep the peace and show moderation and good example. Who knows but good Colonel Jarvis regretted perhaps keenly, and in petto, that he was too old to take his share in the sanguinary sport.\n\nAnd, in the evening, after entering their barracks, (if they were not too drunk to breathe) these fearless and defiant warriors recounted with delight and touching pride their prowess of the day.\n\nHowever, the defaulters were never brought up to the orderly room to receive the punishment of their repulsive exploits.\n\nAnd why should they be punished? Pshaw! Nonsense! The men they had left half dead on the ground, the women and young girls they had cowardly outraged, the children they had so cruelly beaten were only French Half-breeds, nothing but French Half-breeds!\n\nREFERENCES\n\nIf my readers, whomsoever they may be, think I am exaggerating facts, I will humbly ask them to inquire into\nthe veracity of my statements from such men as Governor Archibald, A. M. Brown, Dr. O'Donnell, Premier John Norquay, Dr. Bird, Honorable J. H. Clarke, Governor Donald A. Smith, Honorable Capt. Thomas Howard, Honorable Judge Dubuc, John McTavish, etc., etc. All of these gentlemen (except Mr. Archibald) are still living in Manitoba, and I beg to observe that the majority of them were hostile and opposed to Riel and his party.\n\nCOLONEL WOLSELEY'S BLUNDER.\n\nWhile all these violences were perpetrated in Winnipeg by the members of the 1st Battalion of Ontario spadassins, the 2d Battalion of Quebec, under the command of Colonel A. Casault, was peacefully barracked in the Stone Fort, and but a few cases of insubordination were ever brought to the attention of Governor Archibald.\n\nNow, let us suppose for a moment that Colonel Wolseley had detailed the 1st Battalion for duty at the Stone Fort and the 2d Battalion at Fort Garry, what would have been the result of such disposition?\n\nAny honest, sensible and impartial mind can readily answer the question. If English-speaking soldiers had done duty among English-speaking settlers, they would undoubtedly have pulled together most admirably; and if French-speaking volunteers had been quartered in the midst of the French-speaking population, none of the\nferocious deeds above related would have taken place.\n\nBut, perhaps Colonel Wolseley had received instructions to act as he did, and Sir John A. MacDonald had reasons of his own in giving such orders.\n\nA SIMPLE QUESTION.\n\nAnd now, let me ask who were the \"banditti\" in all this: The oppressed people who started a rebellion through pure patriotism, or the salaried vandals, wearing the British uniform, who had been sent to subdue it and make the English name honored and respected?\n\nThe former had been almost starved while fighting for their rights; the latter were paid by the government to plunder and to kill.\n\nThe opinion of the civilized world and posterity will answer.\n\nHALF-BREEDS DISPOSSESSED BY ONTARIO SPECULATORS.\n\nA few months later, the Dominion Government succeeded in quieting the Half-breeds by a grant of 240 acres of land to each one of them living in Manitoba, as a compensation for disturbing the old river frontage system.\n\nHere commences a period of hidden and calculated persecution and base speculation of another order.\nAs soon as the decision of the government was known through the Province, speculators started their work of monopoly. They commenced by making friends with the Metis; they attracted them and watched their presence in town. The tigers and the lambs of the day before met in the bar-room and drank together. The scheming speculators purposely treated their intended victims generously. Many of the Half-breeds, unsuspicious of what was going on underhand, fell into the snare, and very often, when under the influence of liquor, sold their claims for a mock remuneration. I have known intimately well-established citizens of Winnipeg, who succeeded in buying Half-breed's titles (240 acres) for twenty-five and thirty dollars. Some of those speculators canvassed the country from Portage La Prairie to Pointe du Chêne, and by some means or another came back from their trip the lawful possessors of large and extensive tracks of land.\n\nI am far from blaming those who were shrewd and adroit enough to acquire wealth in so short a time. It was a legal transaction. Nor shall I blame the Metis who foolishly and thoughtlessly sold their land for a morsel of bread. This is certainly no business of mine. But what I find tricky and dishonorable, is the way in which nine out of ten of these transactions were made.\n\nSupposing I know that such and such a man is inclined to drink, and that after the first glass of liquor he is liable to lose control of himself, would I be acting the part of an honest man by seeking him, in the very midst\nof his family, and through convincing and persuasive talk decide him to make the first step? After his third or fourth glass, the man will readily sign a deed by which he will find himself, on the morrow, without a home. And all this will have been accomplished for a trivial sum of money. I may be wealthier after the bargain is concluded, but I fail to see if I will be as respectable, or still deserving to be called honest. Unfortunately, in the eyes of many people, in every country of the world, this is only a trifling consideration, even if the man thus victimized is left without a roof to shelter himself and his family.\n\nBut, what will Half-breeds think of us, civilized people, when they realize their first experience of civilization?\n\nRIEL OFFERS HIS SERVICES TO THE GOVERNMENT.—THEY ARE ACCEPTED.\n\nIn 1871, during the Fenian invasion headed by O'Donahue, Riel, strongly prompted by Archbishop Taché, offered his services to the Government to help repulse the invaders. Governor Archibald crossed the Red River and met the banished leader in front of the cathedral of St. Boniface. Riel's offer was accepted, and on the same day he went scouting around the country with two hundred of his men.\nThe invasion amounted to nothing anyway, and order was soon restored throughout the country.\n\nRIEL ELECTED AT PROVENCHER.\n\nShortly afterwards, Riel was unanimously elected a member of the House of Commons for the District of Provencher.\n\nHe went to Ottawa, and was regularly sworn into office by the Clerk of the House. Hearing of his presence in the city, infuriated Orangemen swore to slay the ex-rebel leader. Riel was then advised to leave Ottawa, and the day after his departure, his seat was declared vacant.\n\nThis is a striking instance of the weakness or bad will of the government. Here is a man who had been lawfully and unanimously elected a representative of the people, and who was prevented from taking his seat after being duly sworn into office. Not because his election was declared fraudulent, but because a mob of fanatic Orangemen threatened his life if he dared to resume his duties as a member of the House of Commons. The Government of the Dominion, instead of protecting him as a Deputy, weakened before the threats, and yielded to the vociferations of a blood-thirsty oligarchy.\n\nTHE GOVERNMENT'S COWARDICE.\n\nAll of this has taken place in the nineteenth century, in a country belonging to the British Empire, and whos\nConstitution is under the protection of the English flag!\n\nAh! if Riel had been an Orangeman, Sir John A. Mac-\nDonald would have called out the whole strength of the\nCanadian Militia.\n\nIf, instead of being a poor and simple Half-breed, Riel\nhad been the dictatorial and wealthy representative of an\nOrange county, he would have taken his seat, even at the\ncost of twenty, fifty or one hundred lives and in spite\nof all the protestations of the whole Catholic Canada.\nBut he was only a modest and unimportant Metis, who\nhad dared to resist the autocratic commands of the mighty\nPrime Minister, and his life would not have been safe,\neven on the floor of the House of Commons, where the\nmajesty and greatness of Great Britain is so pompously\nrepresented by the most unscrupulous and most omnipo-\ntent statesmen of the Dominion.\nFIFTEEN YEARS\n\nOF\n\nPERSECUTION.\nFIFTEEN YEARS OF PERSECUTION.\n\nII.\n\nTHE REAL CAUSES OF THE REBELLIONS OF 1869 AND OF 1885.\n\nLet us recapitulate the principal facts that took place in Manitoba since 1869, and see if the Métis had sufficient reasons to protest against the acts of the Government which had treated them with such unwarranted contempt.\n\n1869.\n\nOn the 29th of July, after hearing of the transaction that had taken place between the Canadian Government and the Hudson Bay Company, the French Half-breeds held their first meeting at St. Boniface.\n\nResolutions were passed and a Committee was appointed to inquire of the Hudson Bay Company's officials what the population of Manitoba was to expect from the sale of the country to the Canadian Government. The\nmembers of the Committee were laughed at by the Company's officers.\n\nThese people were only asking what would become of them and their families, when under the control of their purchasers. Their humble and just request was scorned with disdain.\n\nOn the 19th of October, Honorable Wm. McDougall, the Lieutenant Governor appointed by the Ottawa Cabinet, was on his way to Winnipeg; he was forbidden the entry of the Province by the Half-breeds, who insisted upon knowing what would be their lot, before allowing the Canadian Government's representative to enter the country. Mr. McDougall thought it advisable to retreat, and he returned to Ottawa.\n\nOn November 3d, the rebels (?) took possession of Fort Garry, the most important post of the Hudson Bay Company, and on the 8th of December, the Provisional Government was organized and Riel elected President.\n\nWas there anything wrong in these actions of the Metis? I should certainly think not. Had the Canadian Ministers let these people know what their intentions were, the rebellion would not have taken place. Had the Hudson Bay Company used a little more discretion in its dealing with the Half-breeds, the outbreak would never have occurred.\n\n1870.\n\nOn the 7th of January, seeing that things were getting\nserious, and that the Metis, so long ignored, were not disposed to allow themselves to be swallowed up without protesting most energetically, the Canadian Government asked the mediation of Bishop Taché who was known to have great influence over his people.\n\nThe Right Reverend Bishop kindly consented to act as mediator between the Government and the rebels (†) and on the 16th of February, Sir John A. MacDonald officially authorized Bishop Taché to proclaim, in the Cabinet's name, a full and general amnesty, and to promise the Metis the entire and energetic protection of the Government.\n\nWhile this was taking place, and at the time when the whole difficulty was about being settled, Major Boulton, pretending to be an authorized representative of the Government of Canada, endeavored, with about 200 men, to take Riel prisoner. Riel rightly saw in this occurrence a direct and outrageous violation of the amnesty that had just been proclaimed, and decided to accord no more confidence to the promises of Sir John A. MacDonald, until further consideration.\n\nIt was shortly after—March 4th—that Thomas Scott was executed. I have already said, and I now repeat, that Scott deserved his fate, and I defy any living man, who has positively known what sort of a desperate character Scott was, to conscientiously put forward the argument that his death was not a measure of public safety; and I will go further, in saying, that only those who have\nan object in calling that execution a cold-blooded murder, can deny the fact that this deed was on Riel's part, as I said before, absolutely and exclusively a case of\n\n**SELF-DEFENCE.**\n\nAfter his arrest and before his trial, Scott was asked several times to leave the country, he persistently refused, and he said openly on several occasions that he should remain in Manitoba until he had put a bullet through the brains of that —— —— —— of a French Half-breed Riel.\n\nHe was advised by his own friends to keep quiet and wait patiently, like the other people of the Province, for the re-establishment of peace and order. No, he insisted upon \"having that bastard's life.\"\n\nLiquor had made of Scott a mad and dangerous being; and in Manitoba as well as anywhere else, when one meets a venomous snake, the best thing he can do is to crush its head.\n\nThe Orange press has said, again and again, that Riel's government was not legal, that the court that had tried and sentenced Scott had no jurisdiction or authority, and that consequently his execution was a murder.\n\nBut let us see:\n\nHad that government *de facto* been organized and formed by the people?\n\nUnquestionably yes!\nHad Riel the right to appoint a court of justice to try a felon?\n\nUndeniably yes!\n\nAnd had that court of justice the right to pronounce a sentence?\n\nUndoubtedly yes!\n\nI know full well, that what precedes will create an uproar among a certain class of people—the red-hot apostles of William of Orange, for instance—but I shall, nevertheless, insist upon this point: Scott was deserving a severe and exemplary punishment, and in supposing that Riel and the members of his government took a great responsibility upon themselves in allowing him to be put to death, the following puts an end to all arguments about this charge:\n\nOn the 24th of June, 1873, Lord Kimberley, Secretary for the Colonies, in answer to an official request, signed by Lord Dufferin, then Governor General of Canada, notified the Dominion Cabinet that the Imperial Government had granted a full amnesty in favor of Riel and his followers.\n\nWhat can remain to be said now? If in reality Riel had committed manslaughter in 1869, which hypothesis is very questionable, he was fully pardoned in 1873 by the Imperial Government of Her Majesty the Queen of Great Britain.\n\nOn the 9th of March, 1870, Bishop Taché returned from\nOttawa, and in the name of the Imperial and Dominion governments promised a complete amnesty to all the insurgents in general, and to Riel and Lépine in particular, and a full pardon for all offences committed during the insurrection, including the execution of Scott.\n\nAN INFAMOUS TREACHERY.\n\nOn the 24th of the same month, Father Ritchot, Judge Blake and Mr. A. Scott were sent to Ottawa as delegates for the Metis, and they came back to Manitoba on the 17th of June, reporting that Lord Dufferin and Sir Clinton Murdoch had given the assurance, in the name of Her Majesty, that the amnesty would be pleine et entière!\n\nOn the 12th of July, Bishop Taché received a letter from Sir George E. Cartier; Minister of Militia, corroborating and confirming the statement of the delegates with reference to the entirety of the amnesty.\n\nOn the 24th of August, the troops, under command of Colonel Wolseley, arrived at Fort Garry, and in spite of all the peaceful and solemn assurances of the Ottawa Government, the Commander in Chief issued the proclamation spoken of previously, calling \"banditti\" the men who had received, five months previous, the assurance of a full pardon by the Imperial Government.\n\nWho was guilty of this abominable treachery? The Imperial Government? The Dominion Cabinet? or Colonel Wolseley?\nI know not, but I know who were the too numerous victims of this infamous and unprecedented snare, of this vile and base perfidy. With the arrival of the troops commenced the fearful reign of terror I have already and rapidly described.\n\n1871.\n\nOn the 3d of October, Lieutenant-Governor Archibald issued a proclamation asking for volunteers to repulse the Fenian invasion. Forgetting how cruelly they had been wronged, Riel offered his services and those of his followers to the Government.\n\nMr. Archibald accepted his offer and reviewed the Metis volunteers at St. Boniface. Riel immediately started with two hundred men.\n\nIn an official letter addressed to Sir John A. MacDonald, Mr. Archibald frankly stated that the loyalty shown by the entire population of the Province, and the success he had met in protecting it against the Fenian invasion, was entirely due to the policy of moderation he had adopted toward the Metis. His letter contained the following passage, which we shall leave to the appreciation of impartial and well-thinking people: \"Had the French Metis been pushed to extremities, O'Donahue, the Fenian leader, who had been a member of Riel's government, and who had many friends among the Half-breeds, would have been joined by the whole population of the...\"\n\"country situated between Pembina and the Assiniboine\n\"River, the English portion of the Province would have\n\"been plundered, and the English settlers massacred to\n\"the last.\"\n\nWere Riel and his followers confirmed and irrepressible rebels after all?\n\nDid not their loyal course in this predicament prove that, had the members of Sir John A. MacDonald's Cabinet understood better the people they had so long and so grossly wronged, they could have had in them the most faithful and reliable subjects in the Dominion.\n\nFair and proper treatment would have forever made them staunch and true to the British crown.\n\nBut they never got such treatment at the hands of the Canadian Government, and the last blow they have received in the execution of Riel has irrevocably severed any possible and amicable tie with his executioners.\n\nOn the 27th of December of the same year (1871) after a full and complete amnesty had been proclaimed, after Riel and his Metis had proved that they were willing to redeem the past, Sir John A. MacDonald found a new way to cowardly insult the leader of the Metis. In a confidential letter addressed to Bishop Taché, he apprised him that he had adopted a new and friendly policy regarding Riel.\n\nIn that letter was a check for $1000 to be given to Riel on condition that he would leave the country, and go to the United States.\nI need not say that the check was refused.\n\nThis new and bitter insult was bravely swallowed by the Metis chief, and the next humiliation was patiently looked for.\n\n1872.\n\nThe beginning of that year was full of sad and tumultuous events for Riel.\n\nThe Orange element, stationed at Fort Garry, commenced their nightly excursions towards St. Vital, the parish where Riel lived with his family.\n\nThe young Metis leader had been pardoned by the Imperial and Dominion governments, but not by the worthy companions of Scott.\n\nThey frequently visited the house inhabited by Riel's mother, and insulted most unmercifully that old and defenceless woman. They tried to obtain from her, by force, the name of the place where her son was living. They threatened to fire the house; they even went so far as to beat her.\n\nI have now a revelation to make which will explain why some of these Ontario cut-throats were so anxious to meet Riel.\n\nWhat I am about to expose is so horrid and repulsive that my readers will probably doubt it, but I will nevertheless go on with what I have to say.\n\nI have not been told about this fact. I have wit-\nnessed it, and I most solemnly declare that I am now writing the truth, as revolting as it may appear. A man (?) named Frank Cornish, a lawyer by profession, came to Manitoba towards the end of 1871, and opened an office in Winnipeg.\n\nHe was originally from London (Ontario), and had been Mayor of that town.\n\nA most scandalous affair which made quite a noise at the time all through the country, obliged him to leave Upper Canada.\n\nHe came to Manitoba, well knowing that there was a field for one of his stamp and calibre. He was a fervent Orangeman, and soon was known by all his co-religionists.\n\nOne week or so after his arrival in Winnipeg I met him in a court room for the first time. I shall remember, as long as I live, the first impression he produced on me.\n\nHe was rather heavily built. The expression of his face had something of the wolf and fox mixed together. His eyes, fearfully crooked, like his conscience, had a look of cruelty difficult to describe.\n\nHe was an astute and shrewd politician, a fluent but violent speaker.\n\nSoon after his arrival in Manitoba, I heard that, although professing to be an irreconcilable enemy of Sir John A. MacDonald, he was staunchly devoted to him, and always ready to do the dirty work of the Prime Minister. He soon became very popular among the\nenemies and persecutors of Riel—and later on he was elected Mayor of Winnipeg.\n\nOne evening, I was going on foot from one of the hotels in the town to the house of a friend, who was residing on the bank of the Red River.\n\nIt was about nine o'clock, snow had fallen heavily during the day, and I could not hear my own footsteps.\n\nIn turning a corner of the road, the sound of several voices reached my ear, and I distinctly heard the name of Riel.\n\nI naturally stopped and listened without seeing the parties who were speaking; they were hidden from me by the corner of a demolished stone fence.\n\nWhile listening attentively, I recognized the voice of Frank Cornish, and the following is the exact report of the conversation which was going on:\n\nCornish was speaking: \"Riel must now be in his house, I tell you. I know that he came today from Pembina and that he will be with his mother until tomorrow morning. Now is the time to catch him.\"\n\n\"Who guarantees that the money will be paid us after the thing is done?\"\n\n\"I do, there are two thousand dollars to be divided between the four of you.\"\n\n\"Yes,\" said another voice, \"and you keep three thousand dollars for yourself. We are to do the job and run all the risks, and we four won't get as much as you who are doing nothing.\"\n\"Never mind what I keep for myself,\" said Cornish, \"there are no risks anyhow. Riel is a damned rebel after all. Sir John A. MacDonald will be only too glad to get rid of him. He won't prosecute anybody. Now, is it understood?\"\n\n\"Well! we'll start right now; but remember, if we get into trouble, you'll get us out of it.\"\n\n\"Don't fret, and don't forget this: I don't want his body, his head will do. You have your bag and your masks. You are well armed, now go on, I shall wait the whole night for you in my office.\"\n\nA few moments after, I saw four men crossing the Assiniboine, just opposite Fort Garry, and going in the direction of St. Vital.\n\nThe conversation did not end there; Cornish and another man were still speaking.\n\n\"Are you sure that the check will be paid?\" asked the man.\n\n\"I am; all the man who came from Toronto wants, is Riel's head. He'll cash the check on delivery!\"\n\nHere I heard a laugh.\n\n\"But let us go,\" continued Cornish, \"it is too cold for me here; there is a good fire in the office and some good whiskey, come along.\"\n\nAnd the voices grew weaker and more and more indistinct. The two men were going towards the town.\n\nI resolved then and there to baffle this infamous conspiracy. I was well acquainted with the Deputy Chief\nof the Mounted Police, Richard Power, a young man who has since met his death in the performance of his duty. It did not take me fifteen minutes to go to his office.\n\nFortunately I found him in. \"Power,\" said I, \"you and I can prevent a great calamity, will you come with me and do what I say? I shall explain everything on our way.\"\n\nHe knew that such words, coming from me, were not uttered without a serious cause. Ten minutes after, he had put his best horse to his cutter, and each of us armed with a good Smith & Wesson revolver and a Snyder carbine, started like the wind for the parish of St. Vital.\n\nWhile on our way I told him all I had heard. The brave fellow and I soon decided upon a plan of action. There were only two things to be done: to reach Riel's house in time to warn him of the danger that was threatening him, or, if we arrived too late, see that the assassins could not accomplish their bloody scheme.\n\nRiel's house at St. Vital was seven miles from Fort Garry. About midway we saw the four men, who had stopped on the right handside of the road; they were smoking and drinking. In passing by them we held on our horse in order to try if we could not hear some of their conversation.\n\nBeing completely wrapped in furs there was no danger that we would be recognized.\n\nOne of the men addressed us, and we stopped:\n\"Hello! travelers, are you going far?\"\n\"As far as Pembina,\" answered I. \"And you?\"\n\"Oh!\" said the man, laughing, \"we are only on a pleasure trip. Won't you take a drink with us?\"\n\"No, thanks—we have our own flasks.\"\n\"Well, good-bye, strangers; hope you'll arrive safe in Pembina.\"\n\"So long, and good luck to you; hope you will enjoy your pleasure trip.\"\n\"You bet we will,\" said one of the men. \"Good-bye.\"\nWe whipped up the horse and left the four ruffians behind.\n\"Good!\" said I to Power, \"the roads are covered with snow, those men will not reach St. Vital before an hour or so. All is well; we have plenty of time before us, but let us get there as quickly as possible.\"\nThe trip from Fort Garry to St. Vital did not take us over eighteen or twenty minutes. When we arrived at Riel's house we saw a light through the windows. The bells of our horse had been heard by the people inside.\nA man, a Metis, came to the door and asked us in French, who we were and what we wanted. I answered in the same language, and told him that we were friends, and that we had some serious news to communicate.\n\"If you are friends, come in, and be welcome.\"\nWe jumped out of our sleigh, and on entering the house we saw three French Half-breeds sitting around the fire-place. Riel was one of them.\nHis mother and another Half-breed woman were in another part of the room.\n\nI had met Riel several times before. When they saw us, the Half-breeds got up from their chairs, and the movements they made with their hands—as if to search in their pockets—showed that they were prepared for any emergency.\n\nIt had been decided between Power and myself that it was he who would be the speaker. I did not care, at the time, to be recognized by the young Metis leader.\n\n\"Mr. Riel,\" said my companion, \"we have come to you this evening as friends, and when you know the cause of our visit, you will see that you have nothing to fear from us.\"\n\n\"I fear nothing and nobody,\" answered Riel, \"but speak! what has brought you here?\"\n\n\"If in ten minutes you have not left this house,\" continued Power, \"your life will be in serious danger.\"\n\nAnd then he told him all about the four men who were at that very moment on their way to the house, and what their intentions were.\n\n\"Let them come,\" spoke up one of Riel's friends, \"we are ready for them, and if it comes to the worst we will show those men that Riel's head is still solid upon his shoulders.\"\n\nRiel motioned his friend to keep quiet. \"I thank you most heartily, gentlemen, for what you have done for me, but,\" said he, \"I am getting tired of this cowardly\npersecution; why should I leave my own house and fly like a poltroon? Four assassins are looking for me, did you say; very well, let them cross the threshold of this door, they'll find me here. I am waiting.\"\n\nHere I interfered, and made him understand that we had come to prevent a crime, if possible; that we did not doubt his courage, but that every moment was precious, and the presence of his mother alone ought to determine him that fighting was completely out of time and place at present.\n\n\"Yes,\" added Power, \"if you persist in your decision to wait for these men, you will not only aggravate your position but very likely compromise us, who have come, moved by a friendly feeling; to tell you of the danger that was threatening your life.\"\n\nRiel understood the strength of this argument; he shook hands with us, and in five minutes, his friends, his mother and himself left the house, and went towards Rivière Sale, five miles distant. I afterwards heard that they spent the night in Father Ritchot's house at St. Norbert.\n\nAfter their departure, my companion and I decided to see what was coming next. We drove the horse and sleigh behind a barn about thirty yards from the house and, carbine in hand, we waited for the arrival of the four blackguards.\n\nWe had not been in waiting ten minutes, when we saw\nfour shadows coming from the main road and creeping like snakes towards the house.\n\nSeeing no light inside, they went all around the small building, and when they met in front of the door, they loudly manifested their disappointment.\n\n\"I am sure there is nobody in there,\" said a voice, \"the fire in the chimney lights the room, and you can see through the windows at the back of the house, that there is not a living soul in it.\"\n\n\"Perhaps they are sleeping,\" said another one.\n\n\"No!\" answered the first one, \"I saw the beds, they are empty.\"\n\n\"We'd better wait then, perhaps he will come.\"\n\n\"Wait! I'll be damned if I do. Riel won't come to-night.\"\n\n\"Suppose we set the house afire,\" went on another.\n\n\"Good idea,\" joined in the one who had not yet spoken, \"let us have some fun.\"\n\nThe scene was lit by a beautiful moon whose reflection on the snow made it almost as bright as day.\n\nI said to my friend Power: \"If these devils try to burn the house, what do you think we had better do?\"\n\n\"Shoot them down as if they were wolves,\" was his answer.\n\n\"All right!\" you take the two on the left, and leave the others to me. But, let us keep cool, and whatever happens, wait until you hear my first shot, and then go\nfor them.\" He did not answer, but I heard him cocking his Snyder, and I followed suit.\n\nMeanwhile, the conversation was going on in the opposite camp, and we heard distinctly the one who seemed to be the leader, saying: \"No nonsense, we had better go back to Winnipeg, and leave no traces here, nobody will suspect that we have come, we will return some other time, and will have better luck.\"\n\nA few moments after, they had disappeared.\n\nI never could find out who these four men were, and I do not know how they felt over their fiasco, but what I do know most positively is that never before in their lives had they been in such deadly danger as on that evening. Had they only fired a match to light their pipes, they were certainly four dead men.\n\nFrank Cornish started on a big spree the day after, and was not seen sober for a month afterwards.\n\nNow, who was the man from Ontario, who came to Winnipeg in order to get Riel's head? And who was ready to pay five thousand dollars for it? I need not say that Orangemen from Toronto, or, who knows, perhaps Sir John A. MacDonald himself could answer these questions better than I could.\n\nAnd if there is justice in heaven, those who were implicated in that savage conspiracy, will have to render a terrible account for their infamy.\n\nIn the beginning of February of the same year (1872), Riel's friends decided that he and Lepine should leave\nthe Province until further orders, and on the 14th of that month they started under the protection of a platoon of police, detailed by Captain Louis F. de Plainval, who was then in command of the Provincial Mounted Police force.\n\nThe general elections of 1872 throughout Canada were in a great many respects a surprise to the political world of the Dominion.\n\nSir George Etienne Cartier, was defeated in Montreal East, which he had represented so long in the House of Commons.\n\nMr. Jetté, his opponent, won the election.\n\nSir George E. Cartier found himself without a seat in Parliament, and the Cabinet of which he was the most prominent member with Sir John A. MacDonald was, by that fact placed in a very critical position.\n\nRiel had been nominated in the county of Provencher, Manitoba. Hearing of Sir George's defeat in Montreal, he generously resigned in his favor, and thanks to that act of self-sacrifice, Sir George E. Cartier—upon whose following rested the existence of Sir John A. MacDonald's administration—found a seat, without which he could not continue to be a Member of the Ministry.\n\nI really fail to see if such conduct was that of an inveterate rebel, and Sir John A. MacDonald ought to have remembered it before placing the rope in the hands of the sheriff at Regina.\nTHOSE ORANGE LAMBS!\n\nThe elections in Manitoba were the occasion of the most revolting scenes of savagery and cruelty ever witnessed in a civilized country.\n\nOrangemen of Winnipeg turned out in full force.\n\nBefore casting their votes, they had, according to a time-immemorial custom, been generously supplied with liquor.\n\nArmed to the teeth they went around the town preventing the Half-breeds from voting.\n\nFrank Cornish was their leader.\n\nCapt. Louis Frasse de Plainval, Chief of the Provincial Mounted Police, the representative of Her Majesty's authority, was overpowered by them and came very near losing his life while performing his duty.\n\nHe received, in less than two minutes, six ugly and very dangerous wounds, and was left for dead on the ground. He lingered between life and death for over two weeks, and it was fully a month before he was declared out of danger. After their commander had fallen, several policemen were also dangerously wounded.\n\nDuring the evening and the day after, the town was absolutely in the power of the Orange mob.\n\nThe office of the Manitoban, a paper then hostile to the Orange party, was ransacked and set on fire.\n\nThe office of the Métis, the organ of the French population, was also destroyed.\nPrivate houses were entered and plundered, and all this took place while a garrison of two hundred and fifty men were tranquilly awaiting orders in Fort Garry.\n\nAs usual, Orange rioters were not troubled; the Government was positively afraid to act.\n\nI find here room for a little episode which will give an idea of the love and respect of Orangemen for established institutions and laws.\n\nDr. Bird, an honorable citizen of the City of Winnipeg, was elected to the local Parliament and chosen Speaker of that body. Dr. Bird had a large practice and was, indeed, much esteemed by the people. At about one o'clock of the night, the Doctor was called upon for a sick man, residing about two miles outside the city limits. He called his servant to harness his horse to a sleigh, and shortly after left alone on his professional errand. The man who had called upon him had left after giving the address of the patient. About one mile from the city, the Doctor was stopped by six masked men, who violently pulled him out of his sleigh, undressed him, then covered him with tar and feathers, and, after unmercifully beating him, left the Doctor half dead and lying in the snow. Fortunately, the Doctor was a man powerfully constituted and of strong vital powers, he succeeded in getting into his sleigh again, and was able to drive back home.\n\nThe day after, the devotees of William of Orange openly bragged that they were the authors of this cow-\nardly act, which was committed as a revenge upon Dr. Bird, because, as Speaker of Parliament, he had, in the exercise of his legislative prerogative, given his casting vote against an arbitrary measure which had been proposed by the Orange members of the same local Parliament.\n\nHonest and respectable citizens will see in the above, of how much fairness, of how much constitutional uprightness the disciples of Orangeism are capable. Here again, the Government crawled in his accustomed manner before the breakers of the law, the prevaricators of constitutional rights—who had outraged, not only a private and peaceful citizen, but a dignitary who was the chosen of the people for the discharge of one of the most important offices known to the British crown.\n\nAfter the death of the much regretted Sir George E. Cartier, Riel was again re-elected by acclamation for the same county of Provencher, but, as I have mentioned before, he could not take his seat, simply because Orangemen were opposed to his presence in the House of Commons, and the Government was too cowardly to sustain him in his rights.\n\n**ARBITRARY JUDICIAL DECISION.**\n\nOn the 15th of October, without the slightest motive or reason, Riel was declared an outlaw by the Court of Queen's Bench of Manitoba.\n\nI defy any living man to bring forward any argu-\nJOSEPH NORBERT ALFRED PROVENCHER.\nment that can justify such a severe step on the part of justice.\n\nYes, there was one reason for that unqualified decision of the Court—only one: Riel was a French Half-breed.\n\nANOTHER AMNESTY, BUT CONDITIONED ON EXILE.\n\nOn the 12th of February, 1875, another amnesty was issued in favor of Riel and Lépine, on condition that they would leave the Province of Manitoba for five years.\n\nAfter residing for a while in the Province of Quebec, Riel traveled in the United States, and he finally settled in Montana in 1879, where he succeeded in finding a position as teacher in an industrial school.\n\nIn 1881, Riel married Miss Marguerite Bellehumeur, the daughter of a French Metis living near Fort Elliot. The four years that followed his marriage were undisturbed years of happiness for the Metis patriot, who, although quite young, had already experienced man's bitter cruelty and persecution.\n\nLoved and respected by all those who approached him, or lived near him, he soon succeeded in gaining great popularity among his new neighbors. They knew of his agitated and tormented life, and they had an opportunity to see—notwithstanding all the hatred he had been subjected to—that he was really worthy of the deepest sympathy and respect.\n\nThey saw in the man who had been treated like the\nvilest criminal, a model son, a loving and devoted hus-\nband, and, later on, a fond and affectionate father. They\nhad heard that Riel was an excitable and hot-headed\nrevolutionist, but since he had joined their community\nhe had always shown the greatest obedience to the\nestablished laws and a strong liking for peace and order.\n\nThey knew that this man had been banished from his\nnative country like a despicable renegade, but from the\nday of his arrival in their midst, he had proved to be\npossessed of the soundest and purest religious principles.\n\nThe years 1881, 1882, 1883, 1884 and the beginning\nof 1885 formed the happiest epoch of Riel's life.\n\nFar from all outside influences, he devoted all his\ntime and attention to his family, and to the duties imposed\nupon him by his position as a teacher.\n\nWHAT LED TO THE REBELLION OF 1885.\n\nFrom 1875 to 1884 a great number of French Half-\nbreeds, dispossessed of their lands by the speculators who\nhad infested Manitoba during these nine years, left the\nProvince for the Saskatchewan, and established them-\nselves in that new territory.\n\nThere, the persecution they had experienced in Mani-\ntoba continued more lively than ever. Those of the\nMetis who had taken a homestead wherein to place their\nfamilies, were driven out by people who pretended they\nhad regularly purchased the same properties from the authorities in Ottawa or Winnipeg.\n\nHalf-breeds were pursued and chased from place to place, and they were soon obliged to live wherever they could, under tents or wigwams.\n\nPoverty and starvation soon overtook the oppressed population, while speculators were getting wealthy, and building comfortable houses and opulent establishments. These poor victims of rapacity and extortion were living with their wives and children as well as they could.\n\nIt has often been said in the United States that one of the blackest spots in American history is the way in which Indians were treated through the cupidity of venal Indian agents.\n\nThe extortions perpetrated openly in the Saskatchewan by Upper Canadians and Englishmen, will leave upon their name an indelible stigma of abject knavery and sharp practice. The Ottawa Government was often informed through reliable sources of all that was going on in the North-west, but never paid the slightest attention to the warnings.\n\nProminent people, conscious that a threatening storm was fast approaching, implored the Ottawa Cabinet to take immediate measures for the relief of the much abused and starved population of that part of the Dominion.\n\nThe guilty indifference shown by Sir John A. Macdonald and his Cabinet towards Manitoba and the Sas-\nSaskatchewan since 1878, had often aroused the indignation not only of the French Half-breeds, but of the entire population of the two Provinces as well. The Provincial governments were often called upon, to remonstrate with the Canadian Ministers for their unqualified neglect concerning the affairs of the North-west territories.\n\nDeputations were often sent to Ottawa and returned pacified with promises.\n\nBut these promises were forgotten as soon as made. No longer than one year ago, the agitation in Manitoba became somewhat alarming.\n\nIndignation meetings were held in which the question of annexation to the United States was seriously discussed. The Honorable John Norquay, Prime Minister for the Province of Manitoba, was sent to Ottawa with an ultimatum addressed to the Cabinet, and came back partly satisfied that Sir John A. MacDonald would at last do something.\n\nAs yet I fail to see what has been done, but as the last rebellion has absorbed the whole Dominion, since its beginning (March, 1885) the local governments of the two North-western Provinces seem to have forgotten their griefs, for the time being.\n\nIn January, 1884, I met two gentlemen who had just returned from Regina and Winnipeg. They assured me that no pen could describe the state of things in the North-west. The suffering and misery of the Half-breed population were beyond description.\nPeople were actually in a starving condition and at the mercy of the Mounted Police force and the mercantile element. Provisions and supplies of all kinds were sold at exorbitant prices, and the treatment of the French Metis, at the hands of the authorities, was something atrocious.\n\nThey condemned most bitterly the criminal indifference of the Government officials and prophesied an imminent and terrible outbreak.\n\nThese gentlemen were sincere in their statements; Europeans by birth, and free from all partisanship, the impartiality of their judgment cannot be questioned.\n\nRIEL'S HAPPY HOME IN MONTANA.\n\nIn 1884, Riel was living happily in the midst of his family, in Montana. For three years he had carefully kept himself aloof from political circles. God had blessed his marriage and had made him the father of two beautiful children.\n\nThe love he bestowed upon his wife, his son and his daughter won the admiration of all who knew him. The man whose heart had been convulsed by an agitated life was gradually recuperating under the unbounded attachment and devotion of the young wife who had made him twice a father.\n\nHe had forgotten his past sufferings and the persecutions he had endured for the sake of his country and the\nwelfare of his people. Between the love of his wife and the smiles of his infant children, he allowed himself to hope that at last the stormy days were over for him, and his soul was filled with an infinite confidence in the mercy and protection of heaven.\n\nRIEL'S PERSECUTED COUNTRYMEN BEG FOR HIS AID.\n\nIn June, 1884, Riel was visited by some influential Metis: Gabriel Dumont, Moïse Ouellette and two or three others. These men had travelled nearly fifteen hundred miles to see him.\n\nThey told him of the poverty and misery of his Half-breed brothers in the Saskatchewan; of their treatment at the hands of the Government employees; of their starving condition; of the insolence and cruelty of the Ontario speculators, who had wrongly and unlawfully dispossessed of their lands a great number of Metis.\n\nThey warmly appealed to his patriotism, to his well-known love for his race.\n\nRiel listened to them. He deeply sympathized with all they said, but he spoke of his determination not to take any further part in politics. His past experience had been too severe a lesson for him.\n\nGabriel Dumont told him that their suffering brothers had no one else but him (Riel) to place at their head and to insist upon the Government redressing their wrongs.\nHe appealed to his well-known nobleness of heart:\n\"Our families are without bread,\" said Dumont to Riel.\n\n\"The Mounted Police, instead of protecting us against\nthe rapacity of Ontario immigrants, have joined the\nconspiracy against our tranquility. Our wives and our\ndaughters are daily insulted.\n\n\"There is only one voice that can gather our dispersed\npopulation, and that voice is yours.\n\n\"There is only one man among us who can force the\nGovernment to listen to our just claims, that man is you.\n\n\"You cannot refuse to join us; your intelligence,\nyour energy, your influence belong to our unfortunate\nrace. To abandon us at this moment would be a\ncowardly act.\"\n\nTHE VOICE OF PATRIOTISM.\n\nRiel reflected a long time, and yielding at last to his\nfriend's entreaties, he decided to join his people and to\nbattle once more for their rights.\n\nFinally, this noble and disinterested man had in his\npatriotic heart the heroic courage to part from a be-\nloved wife; and, the day following the visit of his\nsupplicating countrymen, he tore himself from the caresses\nof his children and the home where he had been so happy.\n\nIt has been said that Riel was insane; if so, his\ninsanity was certainly of a sublime nature!\nHis self-abnegation was most stoical, and of the same exalted kind as that which made of George Washington the father of his country.\n\nThe despotism and oppression inflicted by the English Government upon the American colonies, before 1770, were the chief motives of that gigantic uprising which made of the United States of America the sacred land of liberty and one of the greatest countries on earth. It was also the persecution and tyranny of England's hirelings towards French Half-breeds, that started the insurrections of 1869 in Manitoba and of 1885 in the Saskatchewan.\n\nHad Washington failed to accomplish his noble and laudable object; and had he fallen into the hands of the British authorities, he would have mounted the scaffold as Riel did at Regina.\n\nHad Riel succeeded—as at one time he came so near—in forcing the Dominion Government to come to terms, and respect the rights of the Half-breeds, he would have been called the Liberator of his country.\n\nWashington was a successful hero, and the founder of the American Nation; honor to his memory!\n\nBut, as the name of Washington will live forever in history as the father of the great American people, that of Louis David Riel will exist eternally in French Cana-\ndian hearts as that of the heroic martyr who fell bravely and nobly for the sacred cause of his country.\n\nCONSTITUTIONAL AGITATION AND THE RIGHT OF PETITION MET BY MUSKETS.\n\nFrom July, 1884, to March, 1885, Riel travelled all over the country, and often addressed the French Half-breeds at public meetings.\n\nHe then realized that the reports he had heard about the sad state of affairs among his people had not been exaggerated.\n\nPetitions were sent to the Canadian Cabinet, and were treated with the same disdain and insulting indifference as those sent in 1869.\n\nThe Government answered by increasing the strength of the Mounted Police force.\n\nOn the 20th of March, a private dispatch came from Prince Albert, and announced that the insurrection was inevitable.\n\nThe Government denied the fact.\n\nOn the 23d of March, another dispatch came from the same source stating that the rebellion had commenced. Again the Government organs published an official denial; but troops were immediately sent from Winnipeg to Prince Albert.\nTHE INSURRECTION OF 1885.\n\nThis last rebellion may be summed up as follows:\n\nIn March, Major Crozier, of the Mounted Police force, went to Duke Lake, accompanied by his artillery, and secured by force, from the Metis, a large quantity of oats, this commenced the hostilities.\n\nOn the 2d of April, the massacre by Indians, at Frog Lake, occurred; from April 24th to May 8th, serious engagements took place, and on May 11th, the last battle was fought at Batoche.\n\nOn the 15th of May, Riel surrendered himself, and eight days after, he was imprisoned at Regina.\n\nOn the 20th of July, Riel was tried by Judge Richardson, and pronounced guilty by a jury of six Englishmen.\n\nOn August 1st, he was sentenced to death, the execution to take place on the 18th of September.\n\nHis appeal was rejected on the 10th of the same month by the Court of the Queen's Bench of Manitoba.\n\nAnd finally, after four reprieves, the sentence was executed on the\n\n16th of November, 1885,\n\nat 8.23 A. M.\n\nSheriff Chapleau superintending the execution.\nI shall not attempt to express my personal feelings about this execution, which has met with the protestations of millions of Christians, I will simply publish the opinion of the press on this mournful affair.\n\nThe extracts of newspapers that follow, are only a few among thousands that have energetically condemned the conduct of Sir John A. MacDonald and his Cabinet.\n\nThe few commentaries I reproduce will speak for themselves, and will prove to my readers that the execution of Riel has aroused universal indignation.\nOPINION OF THE PRESS.\nOPINION OF THE PRESS.\n\nBefore the Execution.\n\nIII.\n\nOBSTINACY IS NO SUBSTITUTE FOR HONOR.\n\nThat Riel's people had much to complain about is clear. They had been cheated, just as we have cheated our Indians time and again. They were happy and prosperous before the railroad was projected. Then came a train of persecutions, of wrongs, of misrepresentations, until the Indian found that he was not wanted. He was sore, restless, angry, revengeful. He felt for his knife; he took down his gun. His petition went into the waste basket. He was nothing but an Indian. Then he showed that an exasperated Indian knows how to kill his enemy. The white man's persistent injustice was the cause of the uprising. Of that there is no doubt.\n\nThe first duty of the government is to face this fact. It is puerile to condemn Riel, then to respire him, and\nthen to respite him again, and now to respite him a third time. That is cruelty not to be endured by a civilized community. Sir John is in a bad predicament; but if he has the courage of his convictions he will not hang Riel.\n\nObstinacy is no substitute for honor in these times.—N. Y. Herald.\n\nTHE AMERICAN VIEW OF THE RIEL CASE.\n\nThe Central Law Journal, of St. Louis, very pertinently asks, says the N. Y. Herald: \"What would an American lawyer think of trying a citizen for the crime of murder or treason before a court composed of two justices of the peace and a jury of six men, without any indictment by a grand jury, but on a mere 'charge' made not even under oath?\" This question put by a representative law periodical carries its own answer. To an American lawyer or an American citizen the trial of Riel stands out as a mockery of justice and his sentence as a grievous wrong.\n\nIt may further be asked: What will be said of Sir John MacDonald if he sends Riel to the gallows after such a pretence of a trial, in the face of the jury's recommendation to mercy, and in spite of the fact that the prisoner is mentally irresponsible? He cannot do this without committing an irretrievable political blunder and sanctioning an act of gross injustice.\n\nThe sentiment and opinion of this country are against\nthe hanging of Riel because he has not had such a trial as every accused person is entitled to; because the jury recommended him to mercy; because, being of unsound mind, he is not criminally responsible, and because it was only by a violent stretch of the law that he could be tried for treason. The view taken in the United States is unbiased and disinterested. Sir John may well adopt it as a safe guide of action.\n\nRIEL'S BLOOD WILL BE ON SIR JOHN'S HANDS.\n\nWe think that Sir John wishes to save the neck of Riel. He knows that he is a crank. He knows that a million and a quarter of Frenchmen believe this and are pleading for mercy. Why, then, does he not at once commute his sentence? Because the Orangemen of Ontario are determined that Riel shall be hanged. They hate Riel's French blood; they hate Riel's Catholic religion. They are bound to compel Sir John to execute him, and threaten the loss of their political influence if he refuses. Popular feeling in the Provinces is therefore running high. The people are becoming dangerously explosive in their expressions of opinion. A perfect cyclone of excitement, according to our Montreal correspondent, is gathering, which Sir John will be powerless to control.\n\nIf Sir John is a large man and a brave man and a just man, Riel will not be hanged on Monday. If he is\nhanged his blood will be on Sir John's hands...—N. Y. Herald.\n\nAnd, later on, we read in the same paper:\n\nThe Province of Quebec is wild with excitement. It is better to allay than to still further rouse that excitement. Not to hang Riel, who can be imprisoned for life, is more judicious than to kindle the hostility of a million and a quarter of the Queen's subjects by hanging him. Riel is nothing; the welfare of the Dominion is everything.\n\nWe learn by Mackay-Bennett cable this morning that an attempt is being made to petition the Queen in Riel's behalf. A petition has also been sent to Lord Lansdowne. Such succor comes, however, too late. Still, it confirms the position of the Herald—that Riel's crime should be classed as a political offence, and is not punishable by death.\n\nIf Sir John hangs Riel he will deserve the contempt of the civilized world.\n\n**NOTHING GAINED BY HANGING.**\n\nThe Canadian Government will accomplish nothing by hanging Riel. Treason may be made odious, but clemency is the best agent that can be used against the rebellious. Queen Victoria might exercise the royal prerogative to good purpose and cable a pardon. It is\nnot Riel, but the cause he espoused, that appeals for consideration.—Baltimore Times.\n\n\"I WISH TO GOD I COULD CATCH HIM!\"\n\nTo-morrow we shall know whether Sir John Mac-\nDonald is a statesman or a mere politician; whether he\nhas concluded to execute Riel in order to purchase\npopularity with the Orangemen, or to do right though\nthe heavens fall.\n\nSir John, it will be remembered, said some time ago\nof Riel: \"I wish to God I could catch him!\" This,\nhowever, is not the time for a great man to take revenge\non a poor crazy Half-breed. The question of life or death\nought to be settled by the verdict of the jury, and that\ncontained a recommendation to mercy. Sir John should\nnot forget this fact.—N. Y. Herald.\n\nCANADA STATESMANSHIP AT FAULT.\n\nIt is impossible to regard Riel as an ordinary criminal,\nas merely a malefactor who is about to pay with his life\nhis offences against the criminal law of the land. He was\nthe representative and leader of a great number of men\nwho felt and believed that they had just cause of com-\nplaint, and that Riel was doing no more than any other\nman suffering under bad laws, and bad practices under\nbad laws would have done under like circumstances. To\nhang Riel will be to make a martyr of him, and now is not the time to hold any one up to view in the Dominion as an innocent sufferer for political offences. It does not require a very high order of statesmanship to see that the execution of Riel will be a political blunder of the first class, and yet the same blunder may be committed, because Canadian statesmanship is not able to treat with common-sense the plainest of questions.—Washington Post.\n\nWILL CANADIANS SUBMIT TO SUCH AN ATROCIOUS USE OF INFLUENCE?\n\nThe Canadians are not made of the stuff we think they are if they tamely submit to such an atrocious use of influence. Two things are perfectly clear—that the jury's recommendation to mercy should take precedence of Sir John's private interests, and that Sir John himself should be held to a direct responsibility for the outrages in the North-west. When the case of Riel has been disposed of Sir John's case should come up for investigation.\n\nJUDGMENT OF CIVILIZED MANKIND IF RIEL IS HANGED.\n\nIf it is indeed true that Sir John Macdonald and his colleagues insist on sacrifice without mercy, they may make the name of Louis Riel, what those of Louis-Joseph Papineau and William Lyon Mackenzie but\nbarely failed of being—a name for the foes of British rule in Canada to \"conjure with\" forever.\n\nSIR JOHN RESPONSIBLE FOR ALL.\n\nRiel should have his sentence commuted, and Sir John, as the prime cause of the rebellion, should be requested to resign at once. Sir John may be obstinate, but he has been in the wrong for years; he is in the wrong today, and if he hangs Riel he will hang him for crimes for which he is personally responsible.—New York Herald.\n\nMUCH IN EXTENUATION.\n\nThere is much of extenuation for the rebellion in the condition of the Half-breeds and the treatment they were subjected to by the Canadian government. This ought to weigh with the ministry to prevent them from committing a crime greater than Riel's. The example of the United States at the close of the war, too, of which leading republicans are especially proud, ought not to be lost upon the Canadians, particularly when, if followed, it will allay the race prejudice now manifesting itself so passionately.—Memphis Appeal.\n\nA COSTLY BLUNDER THREATENED.\n\nSir John A. MacDonald will make one of the most\ncostly mistakes of the century if he hangs Riel.—Washington Republican.\n\nHE WILL DIE A MARTYR.\n\nHe will die a martyr and his memory will ever be cherished by the poor Half-breeds whose cause he espoused, not successfully it is true, but with the conviction that right was on their side.—Hartford Post.\n\nDEFIANCE OF CIVILIZED SENTIMENT.\n\nIf his sentence is carried into effect, if Sir John A. MacDonald persists in sending Riel to the scaffold, it will be in defiance of the sentiment of Americans and Englishmen.—Boston Transcript.\n\nSHORT-SIGHTED POLICY.\n\nEngland will show short-sighted policy if she hangs Riel, and it is to be hoped that a wise discretion will finally decide to commute his punishment to imprisonment alone.—Austin Statesman (Texas).\n\nA SOLEMN PREDICTION.\n\nRiel is a poor creature who will not be missed from earth, but the day of his execution will be one that the\nCanadian government will long have occasion to remember as one of the most unfortunate events of its history. *Mark the prediction.*—St. Paul Globe.\n\nAfter the Execution.\n\nTHE REVIVAL OF RACE ANTIPATHY IN CANADA.\n\nThe circumstances of Riel's execution, as they are described in our special despatches, says the *New York Herald*, were in harmony with the course the Canadian authorities had pursued toward him from the moment of his capture. He was hanged in a loft lighted by one small window, through which the early sunshine struggled dimly, and by some flickering candles in the hands of the ministering priests. One of them chanted the Lord's Prayer aloud, and the drop fell between the words \"Lead us not into temptation\" and \"Deliver us from evil.\" No friend was suffered to attend the victim. But though he was solitary among\nenemies he did not falter in the presence of death. He kept the promise that had been seduced from him to make no \"dying speech.\" Whatever he was before those final moments, in them he was brave and faithful. Can as much be said of the Sheriff, if the report be true, that he accepted the services of a man to spring the trap who solicited that base office to gratify a personal malice? Or can as much be said of one of the priests present on the scaffold, if the report be true, that he was a secret agent of Sir John A. MacDonald to shut Riel's mouth?\n\nWell, the deed is done, and the merciless government of the Marquis of Lansdowne invites the judgment of the world on its wisdom. Our prediction is that few years will roll by before those who have done it will comprehend and confess that by converting Riel from a lunatic to a martyr they have long retarded the reconciliation of races and the fusion of the Canadians into one harmonious people. Nor is the probability to be ignored that the hanging of Riel will impress the present generation of Canadians of French descent with an unconquerable conviction that reconciliation and fusion can never be accomplished so long as Canada remains a British possession.\n\nWhat can the Marquis of Lansdowne say of his achievements toward harmonizing and fusing the Canadians, French and English? In answer to this question see the flags at half-mast and the emblems of mourning for Riel, whose display is described in our special despatches from\nthe principal cities of the Dominion; and read the substantially unanimous opinion of the million and a half Canadians of French descent, well-and-concisely-expressed in *L'Étendard*, of Montreal:\n\n\"Riel should not have been hanged. Because he was not responsible for his acts. Because he had not a fair trial. Because the verdict of the jury did not justify the government in signing the warrant for the execution. And because his crime was a political offence.\"\n\n**AN EXECUTION WHICH WILL TEND TO STRENGTHEN THE MOVEMENT FOR SEPARATION.**\n\nDublin, Nov. 17, 1885.—The news of Riel execution, cabled to Dublin, Ireland, has naturally excited great feeling against the English authorities. Mr. Gray, M. P., in his newspaper, the *Freeman's Journal*, says:\n\n\"Everything was done to exasperate the sympathisers of Riel. His trial was a judicial mockery of which any free nation ought to be ashamed. It was not denounced, as under any other circumstances it certainly would have been, because few had any doubt that the capital sentence would be commuted. We cannot pretend to guess at the policy which guided Sir John A. MacDonald in hunting Riel to death in face of French Canadian opinion against that course, and we are mistaken if it does not indirectly tend to strengthen the movement for separation which\ninfluential papers like the Montreal Daily Post so strenuously advocate.\"\n\nALMOST A SACRED PERSON.\n\nThe London evening press is not so bloodthirsty about Riel as the morning papers. The Pall Mall Gazette says:—The execution of political prisoners is, as all true statesmen have taught us, worse than a blunder. The life of Riel is in itself neither more nor less valuable than the single life of any of the hundreds who died at his bidding, but a leader who embodies the hopes and convictions of thousands becomes almost a sacred person, and the hangman's touch revolts the feelings of his followers as sacrilege does the feelings of the religious.\"\n\nLOVE FOR HIS COUNTRY.\n\nThe London Echo, edited by a member of Parliament, concludes: \"Riel was a weak and not a very courageous man, but, misguided as he was, we believe him to have been, like his father before him—moved to play the part he did by love for his country. The government of the Dominion would have stood better in the eyes of the world today had it spared his life.\"\n\nA NATIONAL DISGRACE.\n\nThe Toronto Globe says editorially:\n\n\"Another act of the terrible tragedy closed on Mon-\nday morning, and on the 27th, it is said, eight Indians will be hanged. All those horrors might have been avoided if Sir John A. MacDonald had done his duty as Minister of the Interior, and as a Premier of Canada. There would have been no rebellion, and Canada would have been spared all this dreadful loss of life, which is a national disgrace, and which appears to be a national judgment.\"\n\nTHE PRESS OF THE PROVINCE OF QUEBEC.\n\nSTRONG DENUNCIATION OF THE ACTION OF THE GOVERNMENT—A POLITICAL BLUNDER.\n\nThat the hanging of Riel was received with grave dissatisfaction by the majority of the inhabitants of the city of Quebec is undoubted. The press and the most trusty public men condemn the execution as being both a political blunder and a cruel crime. Le Canadien of Quebec voices the sentiment of thousands of people in the Province in the following editorial:\n\n\"The blood shed on the scaffold at Regina is a bad cement, and if the confederation has no other to keep it together, then the gale which will tumble the whole fabric to pieces is not far distant. As a young country, too, we have set to the world the bad example of punish-\n\"ing with death that class of offences known as political,\n\"which all other civilized communities condone; a coun-\n\"try, also, in which the power of life or death is swayed\n\"by factions is not likely to be regarded as a safe or\n\"desirable one to live in. We are asked on all hands:\n\"'What are the French Canadian Ministers doing?' Our\n\"reply is short. Sir Hector Langevin and Mr. Chapleau\n\"have been vanquished, but they have not deemed it\n\"opportune to resign. Whatever line of conduct they\n\"followed their responsibility was immense. They have\n\"chosen the line mentioned. Their position is exception-\n\"ally painful and difficult. Let us not repudiate them\n\"without hearing their explanations.\"\n\n*L'Événement*, also of Quebec, in its editorial com-\nments, says:\n\n\"We counsel calmness in the terrible crisis which we\n\"are traversing. Calmness has an imposing power when\n\"it is accompanied by the determination to obtain justice,\n\"to avenge an outrage on the first favorable opportunity.\n\"The future waited for coolly, patiently, is always\n\"pregnant with such opportunities. The scaffold at\n\"Regina is an outrage upon the renown of the British\n\"Empire. Riel has been executed against the law of\n\"nations, in obedience to Orangeism, which puts in peril\n\"to-day one of the richest jewels of the British crown.\"\nLa Presse of Montréal says of Riel:\n\n\"He will pass into the ranks of martyrs and become an object of veneration and an example to others eager to imitate his career. If he had merely been kept in confinement he would have passed in a few months into obscurity.\"\n\nThe Presse reminds its readers of the monuments erected to the victims of 1837, while of those who escaped, some became high public functionaries, members of Parliament, ministers of the Crown, and even received English baronetcies, as Sir L. H. Lafontaine and Sir Geo. E. Cartier, for instance, who were principals in the revolutions of 1837-38.\n\nThe Monde, the organ of Sir Hector Langevin, the Minister of Public Works, who was too cowardly to resign his seat in the Cabinet, citing the judgment of Mgr. Grandin—\"Free, Riel is dangerous; hanged, his name would be a danger\"—says:\n\n\"These words seem to strike the right note. We are not of those who consider Riel a national hero or a pure and disinterested patriot. To our eyes the auréole of the martyr and apostle does not radiate from his brow. But whatever may be our conviction as to the rôle and character of Louis Riel, we are strongly inclined to adhere to the opinion of Mgr. Grandin, that it would have been alike dangerous to hang him and to set him at liberty.\"\nL'Étendard of Montreal says:\n\n\"On November 16, 1869, was the burial of Guibord in the Catholic Cemetery; and on November 16, 1885, the hanging of Louis Riel at Regina. It is suggested here that a monument be erected to Riel, and that the Quebec Legislature vote a sum for the maintenance of his widow and children.\"\n\nL'Électeur, the organ of the Quebec French liberals, has the following:\n\n\"This is for us a day of national sorrow; for, this morning's murder, signifies the triumph of Orangemen over French Canadians and Catholics.\"\n\nHIGHLY IMPOLITIC.\n\nThe London Daily News says: \"As a general rule executions for high treason seem to us highly impolitic. They invest the victim with the halo of martyrdom and often revive animosities which would otherwise die out.\"\n\nTHE TRIBUTE OF A PAID TOOL.\n\nThe Quebec Chronicle, a paid organ of the Ottawa Cabinet, mildly approves of Riél's execution as the fitting termination of a fair and open trial and a just desert of repeated deeds of murder, bloodshed, revolt and rapine.\nTHE PARIS PRESS.\n\nLOUIS RIEL DEAD MORE DANGEROUS THAN LOUIS RIEL ALIVE.\n\nThe Paris correspondent of the *N. Y. Herald*, telegraphed, on the 17th of November, as follows:\n\n\"I find that a strong anti-English feeling exists this evening in all the political parties here respecting the execution of Riel. M. Rochefort says:\n\n\"In assassinating judicially the heroic chief of the Canadian Metis, England has not only committed a political fault but *une infâmie*. She will discover too late that Louis Riel dead is infinitely more dangerous than Louis Riel living.\"\n\nTHE HOUR OF VENGEANCE.\n\nThe *Figaro* has the longest comments on the case. Its editorial concludes:\n\n\"It is hardly probable that Lord Lansdowne, who either could not or would not pardon Riel, can understand the effect that will be produced by the odious act that he has sanctioned. The French Canadians form an important group in the Parliament at Ottawa, and his accounting with them must come sooner or later. As to the Metis and Indian tribes, they can, when the occasion arises, undertake cruel reprisals. The savages know how to await the hour of vengeance, and they\n\"The Telegraph expresses the opinions of a large section of moderate minds in the community as follows:\n\nThus ends the last chapter in a checkered and stormy life. On its last page the hangman has written his ignominious finis, and human justice is supposed to be satisfied. It would be well for the Dominion if the volume really closed here and could be put away ever out of sight and out of mind. But we fear that this is an impossibility. In the eyes of thousands—nay, millions—not alone of his fellow countrymen, but of men of all races and climes, Riel, the unsuccessful rebel, has crowned a career of patriotic struggle for the rights of men with the aureole of the martyr. In their estimation he has died the victim of a train of circumstances begotten of misgovernment, religious bigotry, national prejudices and revenge, while to make matters worse in their opinion he has been forced to the scaffold without the use of those senses which could alone justify the infliction of the death penalty upon, even the most hardened criminal, thus adding a further and still more indelible disgrace to the Canadian name. It will readily\nMARQUIS OF LANSDOWNE,\n\nGovernor General of the Dominion of Canada.\nSIR JOHN'S MOTIVES.\n\nThe editor of the Courrier des Etats-Unis, of New York, denounces Sir John's conduct in unsparing terms. \"The circumstances surrounding this political drama have no precedent in history,\" he said to a Herald reporter. \"I cannot recall an instance in which a sentence of death has been carried out in the face of so many and so powerful protests. It is hardly necessary to say that this execution was not a punishment for crime, as crimes of that sort are not punished by death nowadays, but a political speculation. And the latest revelations seem to prove that it was an act of obedience to an irresistible secret power, and that Sir John was bound to execute Riel in order to please the Orange faction. If this hypothesis be true—and it seems to be so—the act is, even, a blacker one than it otherwise would have been. It would make Sir John not only the representative of an implacable hatred between the races, but an instrument of secular fanaticism. It can be readily seen, however, that Sir John would be deceived in his calculations, and would not receive as much support as he expected. Not only the French Canadians, but the Irish Catholics, will be opposed to him. Another remarkable fact is that not only was the government very strongly importuned to change the death sentence, but the sentence itself was not justified by Riel's acts. The jury saw that and recommended him to mercy. How\nmany examples are there in history of men who have taken up arms against the established government and received either a pardon or a nominal punishment? Look at Jefferson Davis, Bazaine, Arabi Pacha or Cetewayo. It was reserved for the Canadian government to revive this barbarous custom, which has been condemned by modern civilization.\n\n\"That history will reveal Sir John's motives is very certain. It will then be seen that not only political, but personal reasons constrained him to act in this manner. It will be said that he felt his power lessening, and found it necessary to strike a decisive blow in order to assure the British government of his devotion, and with the ultimate object of obtaining the government of the Indies, a peerage and a place among the counsellors of the Crown.\"\n\n**WILL THERE BE ANOTHER INSURRECTION?**\n\nIf the Canadian government could hang the land speculators who furnished the misguided followers of Riel with their guns and ammunition, they would do a good thing. It looks as though the execution of Riel might furnish an opportunity for speculators to get up another insurrection before long, and they may be more fortunate in their choice of a general.—*New Haven Register.*\nA LEGAL MURDER.\n\nEvery French Canadian will feel that a legal murder has been done, and the execution will therefore tend to increase the hostility which exists between this class of people and the other subjects of the Queen in Canada. There were real grievances behind the uprising which Riel headed; and England could well afford to show a little humanity to the unfortunate Half-breed leader.—Hartford Post.\n\nTHE EXECUTION OF RIEL.\n\nRiel met his fate bravely, without showing either timidity or bravado. His demeanor will doubtless increase the resentment which his sentence has inspired not only among the Half-breeds of the North-west, but among the whole French population of Lower Canada.\n\nThe appeal to Executive clemency in Riel’s case owed all its force to the consideration that the Government had oppressed and outraged the people whose leader Riel became. The rebellion came very near being justified when the Government, in consequence of it, took steps to inquire into and redress the grievances of the settlers, which it had not taken before the rebellion broke out, and which there is no reason to believe it would ever have taken but for the rebellion. With this admission made, the question for the Canadian Government became\nthe twofold question whether Riel was so dangerous a character that it would not do to leave him alive, and whether the enmity to the Government which his execution would excite was so trifling that it could safely be disregarded.\n\nThe execution of Riel, followed by the excitement attending the outbreak of smallpox in Lower Canada, has embittered the French population against the English more than any other event of recent years. The establishment of friendly or even tolerant relations between the two races will now be extremely difficult, and without such relations the lot of the Ministry, of whatever party, will be one of endless perplexities.—New York Times.\n\nTHE EXECUTION OF RIEL.\n\nLouis Riel, the leader of the Canadian Half-breed rebellion, was hanged yesterday at Regina, North-west Territory. He had been convicted of high treason, and for that offense sentenced to death. During the weeks that have elapsed since sentence was passed upon him the Canadian people have been divided into two factions, one clamoring for his blood and the other protesting against his execution.\n\nAn appeal in Riel's behalf was made to the English government, but the Ministry refused to interfere, and there has been a similar division of opinion in England. In this country less interest has been felt in the case\nthan the excitement over it manifested by some of our newspapers would lead one to believe. Nevertheless, the general feeling has been one of sympathy with the condemned man.\n\nThis is due to no conviction that Riel was right, or that his rebellion was justified, but to an aversion on the part of Americans generally to the infliction of the death penalty for political offenses. This man, who headed an insurrection in a distant Canadian Province, which at no time threatened the peace and safety of the Dominion, is tried and hanged as a traitor. Contrast this with the conduct of our own government which, at the close of a great rebellion that threatened its very existence, made no attempt to punish any of those who had taken up arms against it.\n\nThe result in our case has been a gradual disappearance of the passions of the civil war, and the turning of ninety-nine hundredths of the government's recent enemies into stanch and loyal supporters. The opposite course in Canada will make Riel a martyr, and perpetuate and widen the breach caused by his trial and conviction.\n\nWe fear that the Canadian government not only lacks magnanimity, but political sagacity.—New York Star.\n\nTHE CANADIAN HANGING.\n\nThe Canadian Government has executed Riel on the gallows. It ought not to have done so for two reasons.\nFirst, the Government, by its offer to settle with the \"rebels\" in the North-west Territory after the latter had taken up arms, and by its admission that the Half-breed residents had been wronged and were entitled to redress, precluded itself from exacting the extreme penalty of the law for the offense and made the hanging of the leader an act of cruelty and tyranny. Next, because the mind of the prisoner was evidently unhinged and no proper examination was made to ascertain if he was morally responsible for his acts.\n\nThe execution was as impolitic as it was brutal. There is every reason to suppose that the Government feared the political resentment of that portion of the population which clamored for Riel's blood. Perhaps it was thought that the \"English\" sentiment at home would be offended if mercy should be shown to the victim. But the anger of the French portion of the Canadian population is much more likely to be dangerous than the bluster of those who would be satisfied with nothing less than the poor creature's death. It will be surprising if the Government is not made in the end to see the folly of its course and to pay heavily for its blunder.\n\nRiel's crime was of course one of a serious character, against which a nation has the right to protect itself by severe penalties. But a Government's hands must be clear of injustice and the offense be without justification to warrant extreme measures in such a case. If it had not been admitted that the Half-breeds are serious and\ncruel wrong to complain of, and if Riel had been a man of sound mind and vigorous intellect, the execution would have been justifiable. As it is, it was a brutal and revengeful act and an indication of cowardice and weakness instead of an exhibition of firmness on the part of the Government.—New York World.\n\nCANADA REPUDIATES THE CRIME.\n\n[The Montreal Post, the representative organ of the Irish element in the Province of Quebec, edited by Mr. H. J. Cloran, whose talent is only surpassed by his enlightened patriotism, has untiringly worked in the good cause, and written, both before and after Riel’s execution, some very remarkable articles, extracts from which we should have liked to make more extensive if our space was not necessarily limited.]\n\n“Louis Riel, the leader of two rebellions raised in the interest of justice and right, and on behalf of the oppressed Half-breeds and pioneer settlers of the Canadian North-west, was hanged this morning at Regina. He bowed his head to the murderous manipulation of the hangman with as much grace and fortitude as Sir John and his colleagues submitted with cowardice and pusillanimity to the blood-thirsty dictation of the Orange demon, which has been seeking to destroy the chief of the Metis during the past fifteen years. To the scandal of the civilized world, and to the injury of the Canadian\nConfederation, Riel has been made to suffer for a deed committed during the first rebellion, and for which he was pardoned by the same hand that today signed his death warrant. The cause and the people which Riel represented made his life sacred. In himself he may have been nothing; and his death, as an individual, would not have disturbed the peace and harmony of the people. But Riel's identification and association with a cause, universally recognized to be a just one, gave him that inviolability which modern civilization has decreed to be the part and right of a political prisoner. Our government has shamefully and for the basest of purposes violated that decree. And that violation the people of Canada owe it to themselves and to the fair name of their country to repudiate and condemn by flinging from power the men whose hands are stained with the blood of Riel.\"\n\nLater on, the Post, proofs in hand, exposed the machinations of Orangeism against Riel in the following terse manner:\n\nORANGEISM THE MAIN FACTOR IN RIEL'S HANGING.\n\nThere are now loud protestations in Ontario that the Orangemen of that Province did not bring any influence to bear upon the Government to hang Louis Riel, and made no threats against Sir John if the execution did not take place. It looks as if those who clamored for Riel's death and those who ordered it have become frightened at\ntheir own work. The Toronto Mail denies emphatically that there was any demand for his blood by the Orangemen, or that he was hanged to glut their vengeance. These denials and protestations come too late. What is written in black and white cannot be so easily effaced. The fact remains that Riel was butchered to make an Orange holiday. We prove what we say by quoting the resolutions passed by Orange Lodges, the speeches made by Orange leaders, and the articles written by the Orange organ of the Orange Association. Let the Canadian people—English, Scotch, Irish and French—judge between these Orange protestations of today, that they wanted none of Riel's blood, and their bloodthirsty, seditious and revolutionary cries before the perpetration of the foul deed, that, if Riel was not hung, \"the day was not far distant when a call to arms would resound throughout the Dominion.\"\n\nLet our readers, and all those who are opposed to Orangeism and its dark and evil doings, meditate like all good Canadian citizens upon the following sentiments which prepared the way for the iniquitous execution of Louis Riel:\n\nTHE BLACK KNIGHTS CONCUR.\n\n\"At Peterborough, Ont., the following resolution was unanimously carried at a meeting of the Black\n\"Knights of Ireland on Wednesday evening, November 11th:\n\n\"That, having heard read from the chair the following resolutions passed by Loyal Orange Lodge No. 80:\n\n\"That in the present condition of Ireland, we the assembled members of L. O. L. No. 80, believe it to be the duty of all Protestants to join together to oppose the advance of the so-called Nationalists (Parnellites) and to show a united front against sedition and anarchy.\n\n\"That this L. O. L., No. 80, sees with regret the obstacles that are being put forward to prevent the rebel Riel from paying the just penalty of his many crimes on the scaffold, and that this lodge is of opinion that no further respite should be granted him, but that he should suffer the extreme penalty of the law and be hanged in fulfilment of the sentence passed upon him.\n\n\"We give the same our hearty commendation and support, and that copies of this resolution be sent to Sir John A. MacDonald, the Orange Sentinel, the Toronto Mail and the local papers.\"\n\nThus were the Orange lodges engaged in forcing Sir John A. MacDonald to close his ears to the petitions for mercy which was so strongly recommended by the jury, and to practice a most unpardonable piece of deception upon the members of this Province, who were previously assured that Riel's life would be spared.\n\nNow, as to the oratorical efforts of the Orange leaders to compel the Government to yield to their demands for\nvengeance and for blood. At an Orange gathering in Toronto on Nov. 6th, one of the speakers exclaimed:\n\n\"And shall Riel, this arch-rebel, go free whilst loyal men have stained the ground with their blood to uphold the Queen's authority? Never. (Loud applause). And the sooner the Government of Sir John MacDonald understand the true feeling of Orangemen on this question the better. I was pleased to notice in the speeches of County Master Somers, District Master Wilson, and Brothers Graham and Low, the determination expressed that if the Government allows Rome to step in on this occasion and secure a reprieve for this arch-traitor, the Conservative party can no longer count on their services, although they have worked and voted for them for many years.\"\n\nThat extract is worth meditating upon. It is the repetition of the cry that was raised at all the Orange gatherings in many parts of Ontario.\n\nComing down to the official organ of the Orange body it will be seen that that worthy journal does not allow itself to be eclipsed, although enjoying the calm and peace of an editorial sanctum, by resolutions or speeches. The week before the execution, when there was so much uncertainty as to Riel's fate, the Orange Sentinel, speaking on behalf of the Orange Association, made a final appeal; a supreme effort, to put an end to the wavering of Sir John and his colleagues and to settle the question\nof hanging Riel. Here his that effort of the Orange Sentinel:\n\n\"Shall the atrocious injustice be committed of permitting this artful rebel to go free while his dupes and tools—the unfortunate, untutored and misled Indians—are hanged for participation in acts which they regard as praiseworthy and heroic, instead of criminal? The people of Canada will require unequivocal answers to these straightforward questions, if Riel be reprieved; and the only answer we judge that can be truthfully given is that the Frenchmen of Quebec rule in the Dominion Parliament; and have vowed that not a hair of Riel's head shall be harmed. Was it to this end, then, that our gallant volunteers sprang to arms and laid down their lives at their country's call? Shall Frenchmen who sympathise with the rebels be permitted to undo their work? If so, let it be known throughout this land. Let it be proclaimed that the rights and liberties of Britons in an English colony hang only upon the breath of an alien race. But English Canadians will not longer suffer the galling bondage; and the day may not be far distant when the call to arms will again resound throughout the Dominion. Then, indeed, our soldiers, profiting by the lessons of the past, must complete a work throughout the whole land only begun in the North-west.\"\n\nHere is a band of men who call themselves loyal citizens, proclaiming to the world that if the Canadian\nGovernment dared to adopt a policy of clemency, recommended by Riel's jury, dictated by humanity and civilization, and petitioned for by the people, they would lift the standard of revolt and declare for civil war. Are these the men to rule this country and guide its destinies. We say no! and the voice of the Dominion will say no!—Orangeism must be squelched.—The Montreal Daily Post.\n\nTHE DUTY OF THE HOUR.\n\nThe Irish Catholics of Canada have in the grave crisis through which this country is passing a serious duty to perform. The French Canadian people, feeling that a gross outrage has been done the country in general, and their own race in particular, have risen in their might to insist upon the obliteration forever from our politics of that Orange influence which demanded and procured the head of poor Riel. Is there aught of wrong in this? Have ever people so cruelly outraged, wronged and insulted, shown such moderation, such consideration for the feelings of other classes; such a determination to proceed by purely constitutional means? We have followed with closest scrutiny every action and movement of the French people in this crisis, and we stand to-day, we must confess it, in profound admiration of their lofty patriotism, their noble self-control, and their unswerving loyalty to the constitution. What do they ask? Do they seek the dismemberment of Confederation? They do not.\nDo they seek a war of races and of religion? They do not. Do they seek to establish French domination? They do not. Do they seek to rob their Protestant or English-speaking fellow-citizens of any of the rights these latter enjoy under the constitution? They do not. What is it then they do seek? They seek the destruction as a political power of a faction whose existence in this free country is a disgrace to the age. They seek, by means just and fair, the vindication of their race, so foully wronged by the killing of Riel because his death has been decreed in the secrecy of Orange lodges. They seek, in fine, the acknowledgment of those rights guaranteed them by the constitution, but now threatened by Orange violence and aggression. This crisis had in some way to come. Its results will, if the French Canadians persevere in their legal and constitutional agitation, exhibiting the same regard for law and order and for the rights of every other class of the population, that now characterizes their movement, be a most happy one for Confederation. What then should be the precise position of Irish Catholics in this crisis? They should not, in our estimation, take part in or encourage illegal or violent manifestations of any kind calculated to incite class against class or race against race. They should not express admiration for rebels or rebellions merely because the rebels are mostly Catholics and the rebellion headed by Catholics, nominal or otherwise. They must not forget that the Catholic Church, as an organization, was a heavy\nloser by Riel's uprising—priests murdered, missions laid waste, faithful and clergy dispersed. But they can lend and will, we are sure, lend hearty sympathy to their brave and patriotic French fellow-citizens, to whom the minorities in Ontario and the North-west are indebted for their Catholic schools, to whom in other regards the Irish Catholics of Canada are under many lasting obligations, profound sympathy in their humiliation and sorrow. Nor will they join, whatever their individual view as to the wisdom or unwisdom of such a course, in any anti-French cry that may be raised, if the clergy and people of Lower Canada decide on the formation of a French national party, for the giving of full expression to their views in the singular political revolution brought about by Riel's execution. And they are heart and hand with the French Canadians in laying down and maintaining the principle that Orangemen must not, as such, be permitted to exercise the slightest semblance of control over the Government of this country. In one word, let our people, however intense their feelings, be guided by prudence and moderation, heeding in all regards the good counsel of their clergy. Every good citizen, be he of Irish, Scotch, English or German origin, ardently hopes for the advent of the day when no one of our political parties will feel tied down by alliance with any politico-religious society, but when our statesmen, rising to the height of their position and placing duty before expediency, will rule Canada for Canadians, not setting race against race,\nProvince against Province, but striving by every means in their power to build up here, in this part of the Northern continent on the basis of justice, equality and freedom, a new nation whose power shall be the glory of its people and whose progress shall be the admiration of the world.—Catholic Record, of London, Ontario.\n\nMISGOVERNMENT AND REBELLION.\n\nThe Ministry will not be allowed to avail themselves of any side issue as a means of escape from responsibility for the evils caused by their misgovernment. All the bloodshed, all the destruction of property, all the waste of public money, all the sufferings of the Metis, and all the ill-feeling which fills the land, are the direct results of their misgovernment. There would have been no rebellion if there had been no oppression, no robbery, no ill-treatment of the honest and peaceful Half-breeds. Sir Alexander and Mr. Chapleau deny that the Half-breeds had any grievances; but such a denial is perfectly futile in view of the proceedings of the Scrip Commission, which was set to work the moment the Metis appeared in arms. They had vainly petitioned for redress during the past seven years. Their clergy had fruitlessly appealed to the Government on their behalf. These petitions kept pouring in from every settlement in the North-west, and demanded only simple justice, but they were treated with scorn. An answer was not even vouchsafed. Instead of\nreceiving protection, Ottawa kept on increasing the number of intruders, until the suffering Half-breeds were driven from their lands and their homes. Mgr. Grandin, the venerable Bishop of St. Albert, added his influence and efforts to the work of trying to open the eyes of Sir John to the seriousness and gravity of the situation. His Lordship made every effort, by voice and pen, to solicit the Government to act equitably towards the Metis. But to petitions, prayers, letters and delegations, the Half-breeds received nothing but contemptuous silence from Ottawa.\n\nTo use Henry Grattan's memorable words: \"The treason of the Ministers against the liberties of the people was infinitely worse than the rebellion of the people against the Ministers.\" That is the whole situation in a nutshell, and that is the situation Sir John and his Ministers will have to face when they come to reckon with the representatives of the people, or, if those prove false on the floor of the House, with the people themselves at the ballot-box.\n\nThe wonder is that the Half-breeds stood the oppression so long without taking up arms before they did. A Halifax contemporary, looking at the sufferings and the indignities to which the Half-breeds were subjected, asks: \"Is there a parish in Nova Scotia that would have tolerated a similar outrage? We thank Heaven that no-body of men so craven could be found within the limits of this whole Province. These men at Batoche stood to\ntheir arms, and in a few weeks after the first shot was fired they had achieved everything for which they had struggled. Louis Riel was but their leader—assuming the leadership at the urgent request of the Half-breeds.\n\nBecause he placed himself at the head of the rebellion, in the interests of the people, and to secure their lands and guard their churches and tombs, he is sent to the scaffold as a malefactor.\n\nThat is the view taken of the rebellion by the mass of the people. It is common to the entire Confederation. A Toronto contemporary said that if men of English blood had been in a position like to that of the Half-breeds, \"they would have sternly appealed to the sword after their petitions had been neglected; to doubt it would be treason to the most glorious memories of British freedom. From time immemorial, men of the English race have been ready to rebel against any authority not yielding quickly to their just demands; they have been the freest of men because the most rebellious.\" Justice consequently cries out, not against the men who fought for their homes, but against the Ministers who forced the rebellion and created it by their own criminal maladministration. In fact, it may become a question of impeaching the principal ringleaders in the spoliation and oppression of the population of the Northwest.—From The True Witness and Catholic Chronicle, Montreal, Canada.\nTHE SITUATION IN ONTARIO.\n\nThe Orange Order can lay no claim to an exclusive monopoly of loyalty; the brethren are not a whit more loyal than others, who are never heard bawling about what they have done and are prepared to do; and as to the peace and welfare of the community, it is a remarkable fact that where the Orange element is in the ascendant, there turmoil and strife are certain to be found. A political organization to all intents and purposes, its leaders are ever on the watch for the \"main chance\"—ever on the look-out for No. 1.—and they make the rank and file subservient to their own ends. Were they can control they make their power felt, whether it be in Parliamentary or Municipal affairs; and none can share the boodle except those who belong to the \"lodge.\" A \"good, sound Protestant,\" who is not of the lodge, may sometimes get at their hands political preferment; but the Papist has no show whatever. And the worst of it is, that in many instances it is the Papist vote that secures power for the Orangeman. This may sound strange; but it is absolutely true that of the sixteen Orangemen of this Province who now hold seats in the House of Commons, several so hold by the good will and pleasure of Catholics. Yet the very men for whose return to Parliament Catholics worked earnestly and effectively were not ashamed the other day to demand of\nSir Alexander Campbell that he forthwith cancel the appointment of a Catholic, which had just been made by one of his colleagues.\n\nWe think a crisis in this matter has been reached.\n\nWhen we find the Catholics of Ontario shut out from Parliamentary representation—shut out from Judiciary, the list of sheriffs, of registrars and county attorneys—shut out from the higher offices with their ample salaries; and when, in addition to all this, we find the Orange serpent (not satisfied with stinging the Catholics of this Province whenever and wherever it could) attempting to fasten its fangs on Ireland through those who are laboring in her cause here, we see but one course that can be pursued by any man with an ounce of Irish Catholic blood in his veins. The Orangemen have shown that they are our implacable foes; and that they are also the unrelenting enemies of Ireland. They have done us all the injury they could, and will do us more if they can. Let us put it out of their power to do us further harm; and let us punish them for the harm they have already done us. This we can do very easily and very simply.\n\nWhen gentlemen of the Gaskin type—who believe in home rule for themselves but not for others—challenge the Catholic body offensively, unfairly and insultingly, the gauntlet should be picked up promptly and the battle begun. In every case where a choice is made by ballot—be it an election for Parliament or a municipal election—the Catholic should be careful in marking his ticket. If\nthere be on the ticket the name of a candidate who is an Orangeman, his obvious duty is to pass that name by and vote for the candidate who is not an Orangeman, whatever else he may be. A plan like this, rigidly adhered to at every polling booth in the Province, would in a short time shear the members of the Orange Order of the greater part, if not all, of their political strength. It would do more: it would teach them a lesson which they would never forget—teach them that those who play with fire run the risk of being burned. The time is opportune for a test like this; and we can win if we be but united. It is not a question of politics; it is whether the Catholics of Ontario shall any longer submit to the injustice and indignity heaped upon them by a secret, oath-bound cabal—a cabal whose oath binds all its members to undying hostility to Catholics and their religion. Every Orange lodge in this Province is the focus whence emanates the decree which rejects the Catholics and denies him participation in the public life of the country. We can do no less than reciprocate the kindness by voting steadily and solidly against every Orangeman who presents himself for our suffrage till we have seen the last of them.—From The Irish Canadian, of Toronto, Ontario.\n\nA FOUL DEED.\n\nThe foul deed is done, another victim sacrificed to the Moloch of Orange hate—the virgin pages of Canadian\nannals reddened with blood, and the structure of Confederation shaken to its very lowest foundations. The hanging of Louis Riel and the maintenance of Dewdney in a place he has dishonored, is the greatest political blunder perpetrated since Canada first entered on national existence. The whole country had just been rejoiced to hear of the completion of the Pacific Railway when this sanguinary deed was done—dividing man from man, and setting citizen against citizen. A fate that Britain, with all her might and greatness, did not decree for Cetewayo or Arabi Bey, has befallen the unfortunate Chief of the Metis. It is all very well for interested men, men who hanker after the loaves and fishes of office, or men now in possession of the fleshpots of Egypt, to cry out against the infamy and the guilt of the Half-breed leader. We seek not to extenuate his guilt, nor to palliate his misdeeds. But we do say that if ever there was a case in which the clemency of the Crown should have been exercised, this verily was one. Riel was the leader of a people whom all honest men admit to have been goaded into rebellion by oppression as galling as ever borne, he had been tried by a court declared by one of the ablest of Canadian jurists—a man who loved him not—unconstitutional; and then his sanity had more than once, and by men of undoubted weight of character and experience, been called in question. But still he was hanged. Hanged! But not, mark you, readers, for his part in the late insurrection; he was hanged because of the execution\nof Scott at Fort Garry in 1870. For this crime he had already suffered the severest of punishments, banishment from his own country and people. But the Orange Moloch would not be satisfied. The lodges, acting under orders from their leaders in Ottawa and elsewhere, sent their ultimatum to the Executive, and Riel's blood has been offered to appease the monster. Will Orangeism now be satisfied? Not at all. Give that foul beast blood and he will demand more. Our French friends and fellow-citizens are now enabled to see the true nature of this bloody and infamous Association, whose entire history is one of murder and violence. These are strong terms, but no stronger than the exigencies of the case demand.\n\nWith reason indeed does L'Etendard of the 16th inst., exclaim: \"This is a day of sovereign humiliation for the French Canadian race. In this no mistake should be made, the stigma of infamy that the fanaticism and cowardice of our enemies are to press on the brow of Riel is designed for the ignominy of a whole people. When will the day of retribution come? This question will, we know, meet with Orange laughter, because, for ages, their executioners have made political martyrs, and yet they revel with impunity in blood.\"\n\n\"Whatever the result, let us,\" adds our contemporary, \"hold our souls in peace, and preserve ourselves from anger. The smallest act of violence might compromise forever the most just of causes.\"\n\nWith heart and soul we join with the Post in urging\nthe closest union at this critical moment between the French and Irish Catholics of the Dominion. Riel has been made a victim to Orange hate and bigotry. The lodges may now rejoice, and rejoice they will for the moment. But if the Catholics of Canada, rising in their might, show them that they can not here erect and maintain that same species of Protestant ascendancy that so long debased and disgraced Ireland, their rejoicing will be of short duration. The recent public declarations of the Orange body leave no room for doubt as to its intentions. Not satisfied with closing the doors of Municipal Councils in every Province where they are numerous enough to do so against Catholics, not content with making it almost impossible for any Catholic to win legislative honors except in strongly Catholic constituencies, they have raised the cry that the French must go. Quebec is henceforth to be the objective point of their assaults. For years insidious attempts have been made to destroy the autonomy of the Provinces, for the purpose of obliterating French influence in this Dominion. These efforts French statesmen have not resisted at the outset as they should have been resisted, until at last they were thought so passive as even to bear a murderous blow at their nationality without the slightest resentment. It is difficult to predict the immediate political result that must follow so grave an occurrence as the execution of the Half-breed chieftain. As an indication of the feeling among the French supporters of the Administration, we may mention\nthat *La Presse* (Conservative) announces that Messrs. Coursol, Desjardins and Girouard, all three Conservatives, wrote Sir John MacDonald immediately before the execution to say that if Riel were hanged he should no longer have their support. On the 13th inst., the following telegram was sent the Premier:\n\n*MONTREAL, Nov. 13th, 1885.*\n\nTo Sir John Macdonald, K. G. C., Ottawa:\n\nThe execution of Louis Riel would, under the actual circumstances, be an act of cruelty, all responsibility for which we repudiate.\n\nSigned: J. C. Coursol, M. P., Montreal East.\nAlphonse Desjardins, M. P., Hochelaga.\nD. Girouard, M. P., Jacques-Cartier.\nF. Vanasse, M. P., Yamaska.\nL. H. Massue, M. P., Richelieu.\nDupont, M. P., Bagot.\nA. L. Désaulniers, M. P., Maskinongé.\nJ.-B. Daoust, M. P., Two Mountains.\nJ. S. H. Bergeron, M. P., Beauharnois.\nJ. W. Bain, M. P., Soulanges.\nP. B. Benoit, M. P., Chambly.\nEd. Guibault, M. P., Joliette.\nG. A. Gigault, M. P., Rouville.\nS. Labrosse, M. P., Prescott.\nL. E. L. Désaulniers, M. P., St.-Maurice.\nF. Dugas, M. P., Montcalm.\nBesides this message Sir John MacDonald also received the following:\n\nMontreal, Nov. 14th, 1885.\n\nTo Sir John MacDonald, K.C.M.G., Ottawa:\n\nI join very heartily with my colleagues in the actual circumstances. The execution of Riel would be an act of cruelty for which I repudiate all responsibility.\n\nH. Hurteau, M.P.,\nL'Assomption.\n\nTo Mr. Desjardins, member for Hochelaga—Mr. Amyot, on the same day, despatched the following telegram from Quebec:\n\nTo Alphonse Desjardins, M.P.\n\nYou have done well. Lesage and myself have wired in the same sense.\n\nG. Amyot.\n\nIt will thus be seen that the entire Quebec delegation to the Commons is in a state of deepest excitement and agitation. What will the outcome be? The next session of Parliament will tell the tale.—The Catholic Record of London, Ontario.\nIRISH SYMPATHY FOR RIÈL IN NEW YORK\n\nResolutions were adopted at the regular meeting of the Irish-American Union held last evening, in which the execution of Louis Riel was condemned as a \"judicial murder.\" The resolution referred to the Canadian Government as a \"subservient tool of the bigoted Orange faction,\" and offered congratulations to the French Canadians for the \"spirit and determination shown in their efforts to save Riel's life.\"—New York World.\nHISTORICAL\n\nREMINISCENCES.\nHISTORICAL REMINISCENCES.\n\nIV.\n\nWHAT THE \"FIGARO\" (PARIS) SAYS.\n\nMr. George Demanche, a distinguished member of the Paris Figaro's staff, in one of his letters published in that paper on the 10th of November, expresses himself as follows:\n\n\"If Riel had not surrendered himself, the struggle would have been a long one and the issue of the rebellion very likely different. It cannot be denied that the English felt very uneasy over this uprising of the French Half-breeds, and it is one of their characteristics, never to forgive those who have frightened them.\"\n\nThe eminent writer was with the French delegation that visited Canada during the month of August, 1885.\n\nBefore returning to France, Mr. Demanche and a few companions went as far as the Rocky Mountains, and they had an opportunity of seeing this immense North-western territory the French Metis tried so hard\nto free from English domination on two different occasions.\n\nHe ends his communication by these few words: \"Taking everything into consideration, the execution of Riel would be a crime against humanity.\"\n\nAnd that crime has been perpetrated!\n\nIn writing that the English never forgave those who succeeded in scaring them, Mr. Demanche was undoubtedly thinking of the 30th of May, 1431.\n\nIt was on that day that over forty thousand English troops assembled at Rouen to witness the agony of one young girl scarcely twenty years of age, condemned by them to be burned alive.\n\nIt was on that day that Joan of Arc, the virgin of Orleans, expired in the midst of a devouring fire lit by English hands.\n\nThat one inspired young girl had stricken the entire English army with terror.\n\nThey did not forgive her, she died in the midst of the vociferations of the British soldiery that had fled before her.\n\nOr perhaps Mr. Demanche had present in his mind the Island of St. Helena, where the giant whose roaring had shook the throne of England, breathed his last under the odious treatment of his jailer, Hudson Lowe.\n\nThe Corsican who, when a young officer of artillery, had thrashed the English at Toulon, and who twenty-two years later, when Emperor of France, met Wellington at\nWaterloo, that Titan called Napoleon I., whose immortal eagles had harassed for years the British lion, allowed himself one day to trust English honor and generosity.\n\nHe asked hospitality of his enemy.\n\nEngland confined the fallen Emperor at St. Helena.\n\nThis demi-god, who had seen the world at his feet, whose simple glance and frown had terrified the Emperors and Kings of Europe and who had dictated to all the potentates on earth, was given for kingdom a pestilential spot in the middle of the ocean. In seeing the open prison chosen for him by his British host, he remembered the words of Dante: *All hope abandon, ye who enter in.*\n\nEngland had not forgotten!\n\nShe could not forgive!\n\nAlbion has been the evil genius of the Bonapartes.\n\nThe first, \"the Great,\" died an exile in one of her islands whose infected atmosphere is dreaded even by the sea gulls.\n\nThe second, Napoleon the third, the man of Sedan, saw his last day on the English soil which had been generously opened to him after he had left France ruined by his fault, and bleeding at every pore.\n\nThe third, the heir to the Imperial throne of Napoleon I. was killed by the Zulus, while in the service of England. He fell on an isolated and ignored spot, clad in the British uniform, the same as the one worn by his grand uncle's jailers at St. Helena.\nA COURAGEOUS RASCAL.\n\nAfter the Regina tragedy, Sir John A. MacDonald suddenly remembered that his presence was imperatively required in London. The important question of the fisheries was to be attended to, and thinking most wisely that a change of air would be beneficial to him, he decided to start for England.\n\nI wonder how his colleagues of the Ottawa Cabinet felt on hearing that their leader had made up his mind to make that pleasure trip.\n\nHere again the public funds come in very handy.\n\nSir John A. MacDonald, Prime Minister for the Dominion of Canada, Member of the Privy Council of Her Majesty the Queen of Great Britain, could not travel like a commoner, and as the vital importance of his trip to London could not be questioned, the country must pay for it. His Cabinet will have to face the popular storm without him. A pretty hard task I should think, and if I form my opinion on the subject from the public indignation lately expressed all over Lower Canada the Ministers have a difficult work before them.\n\nFor, if Riel's trial is over, there is another to trial come, that of Sir John A. MacDonald and the French Canadian members of the Cabinet, who have betrayed their race.\n\nRiel has paid his debt in full.\n\nThe French Canadians will see that the traitors do the same.\nTHE EXECUTION.\n\n[From the Leader, the most prominent paper at Regina.]\n\nThe Leader was always hostile to Riel and his cause. The impartiality and the touching simplicity of the following narration struck me as deserving a few pages in this book. My readers will surely be deeply interested in reading this account of the patriot Louis David Riel's end, and will fully agree with me, that his beautiful death was worthy of his heroic life. This is the account published by the Regina Leader:\n\nRIEL EXECUTED.—HE DIES WITHOUT A SPEECH.—A SANE AND BEAUTIFUL DEATH.\n\nREGINA, Nov. 16—As fair a morning as ever dawned shone on the closing act—the last event—of the not uneventful life of Louis Riel. The sun glittered out in pitiless beauty and the prairie slightly silvered with hoar frost shone like a vast plain sown with diamonds. We drove, Mr. Sherwood, Chief of Dominion Police, who had arrived on Sunday evening with the warrant. As we neared Government-House two armed Mounted Police drew up their horses across our path and demanded our pass, which read as follows:\n\n\"To Mr. Gibson: Admit representatives of the Leader. (Signed) SHERIFF CHAPLEAU.\"\nWhen we neared the bridge there was a force commanded by an inspector. Two traps were at a standstill. One of the troopers shook hands with Mr. Percy Sherwood, an old friend. We had a pleasant word with Mr. F. J. Hunter and Mr. W. C. Hamilton. Our pass was again vised and on we drove. Arrived at the prison we met outside the representatives of the press, Dr. Dodd, Dr. Pugsley, Mr. Marsh, Messrs. Gillespie, Dawson, Bole and several citizens. The beauty of the morning was the chief theme of conversation. Towards eight o'clock we crushed our way through troopers, Col. Irvine very courteously doing all in his power for us, ascended the stair-case, walked the length of the prison, and there, at the doorway of the ghastly place of execution, knelt Riel; his profile showing clear against the light. Father André, a surplice over his soutane kneeling, his back to us, and Father McWilliams, with a stole thrown over his travelling coat, kneeling, his face to us, and holding a wax candle lighted. In Riel's hand was an ivory crucifix, silver mounted, which he frequently kissed. Father McWilliams and Père André ever and again sprinkled holy water on the condemned man. Riel was pale—deadly pale—and his face looked most intellectual.\n\nFather André (in French).—Do you pardon all your enemies from the bottom of your heart?\n\nRiel: I do, mon père—I pardon all my enemies for the love of the good God.\nFather André: Have you any sentiment of malice, any feeling of malice against any one?\n\nRiel: No, my father, I forgive all.\n\nFather André: Do you offer your life as a sacrifice to God?\n\nRiel: I do, mon père.\n\nFather André: My child—the flesh is weak and the spirit strong, do you repent of all your sins of thought, word and deed?\n\nRiel: I do, my father—I have committed many sins, and I ask my God's pardon for them all in the names of Jesus, Mary and Joseph.\n\nFather André: You do not wish to speak in public? You make that a sacrifice to God?\n\nRiel: Oui, mon père; I make to my God as a sacrifice the speaking to the public in this my last hour.\n\nFather André: God has been good to you my son, to give you an opportunity of repenting; are you thankful for this?\n\nRiel: I thank the good God that in His Providence he has enabled me to make my peace with Him and all mankind before I go away.\n\nThe two clergymen then placed their hands on his head and pronounced the absolution.\n\nRiel then, in an affecting and childlike way, prayed God to bless his mother, his wife, his brothers, his friends and his enemies. \"My father bless me,\" he said, looking up to heaven, \"according to the views of your Providence,\"\nwhich are ample and without measure.\" Then, addressing Père André: \"Will you bless me, Father?\"\n\nFather André blessed him, as did father McWilliams. He then rose from his knees and was pinioned, he meanwhile praying and the clergy praying. When he was ready to pass out to the scaffold, Père André said to him in French, \"There, go to heaven!\" (Bon! Allez au Ciel!) He then kissed Père André on the lips, and Father McWilliams embraced him giving him the side of each cheek. Riel then said, ere he turned to pass through the door which went into that room built of coarse lumber and which, if Père André is right, and Riel was really repentant, and Christianity is true, was for him the poor dingy portals of eternal day and unending peace and blessedness:\n\n\"I give all my life a sacrifice to God. Remerciez Madame Forget et Monsieur Forget. O my God!\" he cried, still speaking in French as he went down stairs, \"you are my support. Mon soutien, c'est Dieu!\"\n\nHe now stood on the drop. The cord is put on his neck. He said: \"Courage, mon père.\"\n\nPère André in subdued tones:—\"Courage! Courage!\"\n\nThey shook hands with him as did Dr. Jukes, and Riel preserving to the last that politeness which was so characteristic of him, and which was remarked during the trial, said:\n\n\"Thank you, Doctor.\"\n\nThen, he prayed in French: \"Jesus, Mary and\nJoseph have mercy on me. *J'espère encore.* I hope still. I believe in God to the last moment.\"\n\nFather McWilliams: \"Pray to the Sacred Heart of Jesus.\"\n\nRiel: Have mercy on me Sacred Heart of my Jesus! Have mercy on me. *Jésus, Marie et Joseph assistez-moi dans mes derniers moments.* Assistez-moi, Jésus, Marie et Joseph!\n\nFather McWilliams held the cross to him, which he kissed.\n\nMr. Deputy Sheriff Gibson: \"Louis Riel have you anything to say why sentence of death should not be carried out on you?\"\n\nRiel, when Père André stood about to ascend the staircase, anxious evidently to leave the painful scene, said in French: \"Shall I say something?\"\n\nPère André: \"No.\"\n\nRiel (in French): Then I should like to pray a little more.\n\nPère André: He asks to pray a little more.\n\nDeputy Sheriff Gibson (looking at his watch): \"Two minutes.\"\n\nFather McWilliams: Say \"Our Father,\" and, addressing Mr. Gibson, \"when he comes to 'Deliver us from evil,' tell him then.\"\n\nMr. Gibson gave the directions to the hangman who now put on Riel's head the white cap.\n\nRiel and Father McWilliams: \"Our Father which art\nin heaven, hallowed by thy name, Thy Kingdom come,\nThy will be done on earth as it is in Heaven, give us this\nday our daily bread, and deliver us...\"\n\nThe hangman pulled the crank and Riel fell a drop of\nnine feet.\n\nDrs. Dodd and Cotton were below. The knot in the\nfall had slipped round from under the poll. The body\nquivered and swayed slightly to and fro. Dr. Dodd felt\nthe pulse.\n\nLeader Reporter: How is his pulse, Doctor?\nDr. Dodd: It beats yet—slightly.\n\nLeader Reporter (addressing Dr. Cotton): I hope he\nis without pain.\n\nDr. Cotton: O quite. All sensation is gone.\n\nThe body ceased to sway. It hung without a quiver.\nDr. Dodd, looking at his watch and feeling the pulse of\nwhat was Riel:—\"He is dead. Dead in two minutes.\"\nDr. Cotton put his ear to where that restless heart beat:\n\"Dead.\"\nTHREE TRAITORS.\nTHREE TRAITORS.\n\nV.\n\nLOVE OF POWER ABOVE LOVE OF COUNTRY.\n\nSir Hector Langevin!\nSir Adolphe Caron!\nHonorable (?) J.-A. Chapleau!\n\nThese three names have been lately in the mouth of every French Canadian, and since the death of Riel, the lips by which they were uttered have never failed to accompany them with a curse and a malediction.\n\nThey were directly connected with the execution, and they will be forever associated with one of the bloodiest pages of Canada's history.\n\nThey were Sir John A. MacDonald's accomplices, or they were his tools.\n\nIf they were his accomplices they have ceased to be French Canadians, they are renegades and apostates, they are cowards!\n\nIf they were his tools, their incapacity and weakness\nmake them unworthy of representing their race in the Cabinet.\n\nIn either case they ought to leave the Ministry.\n\nIncapable, or traitors to the cause of their countrymen, their political career has ended with the life of Riel.\n\nThe death warrant was approved and ratified by their signatures, they henceforth belong to the reprobation and hatred of their people.\n\nTheir presence in the Cabinet after the execution of the fatal sentence is an irrefutable proof that they have completely endorsed the sanguinary policy of the Prime Minister, and they have become the Judas of their race.\n\nCAMELEONIC CRIMINALITY.\n\nIn 1875, Ambroise Lépine, one of the staunchest supporters and friends of Riel, who had played a conspicuous part in the rebellion of 1869, was arrested, and tried in Manitoba, for the crime of high treason.\n\nThe charges against him were identically the same as those for which Riel mounted the scaffold at Regina.\n\nA young lawyer from the Province of Quebec undertook the defence of the accused man, and went from Montreal to Winnipeg in order to attend the trial.\n\nHis name was J. A. Chapleau; he was then thirty-three years of age, and his career as a criminal lawyer had already been a successful one.\nHe was much esteemed by the French Canadian bar and his Conservative friends placed great hopes in him.\n\nHis political prospects, therefore, were very good, and his popularity was a sure indication that he would soon rise to prominence.\n\nWhen he went to Manitoba to defend Lépine, he carried with him the best wishes of Lower Canada.\n\nEvery French Canadian followed with the deepest interest the different phases of the trial in which was involved the life of a French Half-breed.\n\nNever before had Chapleau been more eloquent and irresistibly convincing than on this occasion.\n\nHis pleading before the court is still remembered as a remarkable effort.\n\nHe spoke of the heinous persecution that had forced the French Half-breeds to take up arms against their oppressors.\n\nHe pictured with energy and pathos the misery and despair of the people who had seen their homes plundered, their wives, mothers and sisters violently outraged, and their brothers cowardly and brutally assaulted.\n\nHe described with tears in his eyes the heartless and unmerciful treatment they had received at the hands of their enemies.\n\nHe spoke of the violated rights of these men as British subjects, as Christians, and as heads of families.\n\nHe protested, with an inspired and convincing eloquence, against the systematic and cold indifference\nshown by the Government on all that had connection with the North-western territories.\n\nHe solemnly denounced the numberless acts of savagery and ruffianism perpetrated by Orangemen since 1870; and in the name of humanity, civilization and progress, his inspired voice thundered an emphatic protestation against the continuance of these horrors, which were the dishonor and shame of Canadian history.\n\nHe spoke with noble dignity of the loyalty of the French Canadian race to the British Crown; he repeated the memorable words of Sir George Etienne Cartier, that immortal champion of Canadian rights: \"It is a French Canadian who will fire the last gun for the defence of England on American soil.\"\n\nChapleau's voice rang through the Dominion like a thunderbolt in the middle of a silent night.\n\nFrench Canadians were breathlessly awaiting the close of the trial.\n\nAmbroise Lépine was sentenced to death for high-treason, but on the 15th of January, 1875, the Earl of Dufferin, then Governor General of Canada, advised the Dominion Minister of Justice, and reported to Her Majesty's Secretary of State for the Colonies, that \"according to his independent judgment, and on his own personal responsibility,\" he had commuted a capital sentence, that of Ambroise Lépine, to two years imprisonment with forfeiture of political rights.\"\n\nA few years later the Honorable J. A. Chapleau was\noffered and accepted the portfolio of Secretary of State on the Ministerial benches.\n\nAnd the same man whose voice resounded in 1875, in Ambroise Lepine's case, like the trumpet of the avenging angel of an oppressed race, could not find a word for the defense of Louis David Riel whose offence was identically the same as that of Ambroise Lépine.\n\nAnd his signature can now be seen on the death-warrant, near that of Sir John A. MacDonald, his Orange chief; and, horrible to relate, it seems as if the hand of fatality had directed all the details of that iniquitous immolation in order to stigmatize the name of Chapleau!\n\nThe Honorable J. A. Chapleau, Secretary of State, was a member of the Cabinet who decided upon Riel's fate.\n\nMajor Chapleau, his brother, High Sheriff for the Province of the Saskatchewan, was the official who was representing the justice of England on the scaffold at Regina where the leader of the Metis was launched into eternity.\n\nThe former had decided upon Riel's death!\n\nThe latter was the salaried tool by which the sentence was executed!\n\nOne was the condemning judge!\n\nThe other the executioner!\n\nIt may be argued, that Chapleau the Minister acted according to the dictates of his conscience, and that\nChapleau the High Sheriff performed the duties of his office.\n\nTrue! but will a brother immolate his brother, a son his father, a father his son, when there is a possibility of resigning an official position in order to repudiate the odium of an infamous deed?\n\nMademoiselle de Sombreuil once drank a glass of blood to save her father's life.\n\nChapleau, Langevin and Caron never thought of sacrificing their portfolios to save the life of their brother Louis David Riel. How could they save Riel? may be the question asked by those who have reasons in trying to exonerate these three ministers of the Crown from the crushing responsibility they have assumed.\n\nHow could they save Riel? I will never believe that Sir John A. MacDonald would have carried his threats into execution if the three French Canadian members of the Cabinet had unanimously tendered their resignations sooner than participate in any manner or form in the deed which has aroused the indignation, not only of one million five hundred thousand Canadians of French origin, but also that of two-thirds of the well-thinking English-speaking people of the Dominion.\n\nHad Langevin, Chapleau and Caron been animated with a commendable devotion to the dignity and welfare of their fellow countrymen, instead of being moved only by a personal and unavowable purpose, Riel's life would have been spared.\nWhat England did not dare to do with Arabi Pasha and Cetewayo, Canada did not hesitate to do with the French Metis, and the French Canadians fully understand that there are three names that will be henceforth condemned to national execration, and those three names are Langevin, Caron, Chapleau.\n\nI have read in one of the Canadian papers that the Government is about to publish a pamphlet destined to explain and defend the policy of the ministry in the affairs of the North-west.\n\nThis pamphlet, it is said, will be especially addressed to the French Canadian population.\n\nI am very anxious indeed to read the promised explanations of Sir John A. MacDonald's Cabinet. The Ministers may find a servile writer to pen, according to their suggestions, whatever they may think of or invent for their defence, but they will not find a single French Canadian reader who will see in their pamphlet a justification of the Regina tragedy.\n\nWhy not wait until the next session of Parliament before attempting to justify themselves in the eyes of the country?\n\nIf they are so strongly convinced that in hanging the French Metis they acted strictly according to the laws of justice, why should they be so anxious to publicly explain their conduct while they postpone, through fear,\nthe convocation of the legislative body to whom they are directly responsible?\n\nThe proposed publication of this pamphlet is a scheme designed for the sole purpose of gaining, as soon as possible, the good-will and support of some honest and hesitating partisans, who, crushed by this national calamity, cannot yet believe that the three French Canadian Ministers could be guilty of such a monstrous treason against their race.\n\nBe that as it may, their pamphlet will never make the people forget the 16th of November, 1885, or the gibbet of Regina.\n\nA TRUE BILL:\n\nLet the Cabinet impudently deny that the French Half-breeds were not treated with indifferent and cruel contempt since 1869.\n\nLet the Ministers justify the criminal neglect they have been guilty of in everything concerning the affairs of Manitoba and the Saskatchewan.\n\nLet them explain their incomprehensible indulgence towards the Orange vandals who have kept the Northwest in a continuous state of terror for upward of fifteen years.\n\nLet them deny that French Half-breeds were assassinated, that the Metis homes were plundered, their wives and daughters outraged, their properties treacherously taken away from them by Orangemen.\nLet the Cabinet members prove that Riel and his followers had not been pardoned three times by them.\n\nLet the Government refute the fact that the Half-breed population has not been in a starving condition for the last ten years, while the rapacious speculators were openly protected by the authorities.\n\nLet Sir John A. MacDonald explain in the face of the world his avowed and untiring hatred for Riel.\n\nLet him deny what he said once, \"Oh! that Riel, if I ever can get him in my power!\"\n\nLet his Cabinet prove that Riel's trial was a fair one.\n\nLet them prove also that the jury did not recommend the condemned man to the mercy of the Government.\n\nLet them give the reasons and motives of the three inhuman reprieves in the execution of the sentence.\n\nLet Sir Adolphe Caron repeat to the French Canadians his toast and speech delivered in Winnipeg before the execution.\n\nLet Sir Hector Langevin explain the part he acted in this affair, and his twice broken official declarations!\n\nLet the Honorable J. A. Chapleau give the reasons of his devotion to Lépine and his utter indifference about Riel's fate.\n\nLet them all deny the fact that the execution of the French Half-breed was decided upon in order to appease the Orange brethren of Sir John A. MacDonald and in spite of the indignation of the whole Christian world.\n\nLet them say, if they dare, that they are not respon-\nsible for all the outrages that gave rise to the two rebellions.\n\nLet them point out a single instance where they did anything to pacify and relieve the oppressed and starving French half-breed population.\n\nLet them conceal the fact that the entire Parish of St. Louis de Langevin was completely defrauded by English and Orange speculators of a property on which twenty-four families were living.\n\nLet all the members of the Ottawa Ministry invent, if they can, plausible reasons for the justification of their barbarous conduct in Riel's case, they will convince only those who have reasons to allow themselves to be convinced! The press in every country, humanity and civilization have condemned the execution of the patriot Louis David Riel as one of the most hideous political crimes perpetrated in the nineteenth century.\n\nNo explanation can wash off the blood that is on Sir John A. MacDonald's hands. No apology will ever exonerate the three French Canadian Ministers of their participation in the legal murder of one of their own race. The world has pronounced its verdict.\n\nThe names of the members of the Ottawa Cabinet, especially those of Sir John A. MacDonald, Hector Langevin, Adolphe Caron and J. A. Chapleau, will henceforth belong to the list of murderers.\n\nAnd as God in expelling Cain from the Garden of Eden reproached him with the death of Abel, so history\nand posterity will call these three French Canadian Ministers to a terrible account for the death of Riel.\n\nThe crime has been committed.\n\nThe expiation is sure to come.\n\nADDING COWARDLY INSULT TO CRIMINAL INJUSTICE.\n\nIt is said that the day after the execution at Regina, the Ministers in Council decided to vote a pension in favor of Riel's family.\n\nThe bare thought of such an unprecedented baseness is a crime as horrible as the homicide they have perpetrated.\n\nLouis David Riel, how and when did you ever deserve this last and humiliating insult?\n\nThese blood-thirsty cannibals made a broken-hearted woman of your old mother, a widow of your young wife, two orphans of your children, and after this quadruple crime was committed, they coolly offered them a morsel of bread as a proper remuneration for the life you have so courageously lost on their scaffold. Their generosity can only be equalled by their villany, and the money they offer to pay to your desolate family would come from the public funds!\n\nThey would pay for their crime with the people's money. It is simply horrible and no punishment will ever be worthy of such infamy.\n\nThese blood stained dictators may for a while yet hold\nin their hands the reins of the Government, but they will never cease to see in their sleepless nights the livid phantom of their victim.\n\nRemorse, that \"merciless policeman of God,\" will pursue them until they rot in their dishonored graves.\n\nThey were inexorable towards Riel.\n\nPublic opinion will be without mercy for them.\n\nAnd you, young French Canadian poets, Louis Fréchette and Benjamin Sulte, will you not let your lyre be heard in a sublime and national *De Profundis*? Will not your muse inspire you with an ode of patriotic praise for the Metis martyr and one of eternal anathema against his executioners?\n\nOh! that you may find in your souls accents powerful enough to immortalize the name of the fallen hero, and to brand with infamy, before the present generation and the generations to come, the names of those whose criminal hands brought about his untimely death.\nCONDEMNED\n\nEVEN BEFORE TRIED.\nCONDEMNED EVEN BEFORE TRIED.\n\nVI.\n\n\"OH! THAT RIEL, IF I CAN EVER GET HIM IN MY POWER!\"\n\nThese are the words uttered by Sir John A. MacDonald shortly after the second rebellion of the Half-breeds.\n\nThese few words, coming from the lips of the Premier, had a meaning full of inexorable hatred.\n\nThey contained a world of threats, and these threats have been fully put into execution since the surrender of the Metis leader.\n\nThe cold, pitiless policy followed by the Ottawa Government can leave no doubt as to the immutable resolution of the Chief of the Cabinet in carrying through his deadly design against Riel.\n\nThe formation of the court that tried Riel could give no hope that the trial would be a fair one.\n\nThe selection of six jurymen of English origin was a clear indication that the verdict would prove irrevocably fatal to the prisoner.\nWhy this calculated selection of the English judge.\n\nRichardson?\n\nWhy this formation of a jury composed of six men only, chosen among English-speaking people?\n\nHad not Riel the right to be tried by a jury composed of twelve of his own countrymen?\n\nThe vilest assassin brought to justice for the most abominable crime; the parricide, the highwayman, the commonest cut-throat, has the right to ask for a jury of twelve men!\n\nWhy this exception for Riel?\n\nGeneral Middleton, the commander of the expedition against this last insurrection, sent a message to Riel, telling him that if he would surrender, he could entirely depend upon the mercy and leniency of the Government. How did Sir John A. MacDonald keep that promise, officially made by the superior officer he had sent to cut down the rebellion?\n\nRiel surrendered himself, but instead of finding in his judges mercy and leniency, he was, from the day of his imprisonment, treated like a mad dog.\n\nHis trial was a farce, a dastardly treachery, a revolting villany. From the day the door of his cell closed upon him at Regina he was doomed.\n\nSir John A. MacDonald had him in his clutches this time. No power, no influence, no prayer on earth could save him. And in spite of all that was done to obtain the commutation of his sentence, the scaffold was erected\nby the order of the Ottawa Cabinet, and Riel paid with his life the crime of being one of the noblest sons of that valiant race of pioneers, who, headed by Jacques Cartier, were the first to bring to Canada the sublime symbol of religion and civilization.\n\nAfter this crime had been decided upon by the Canadian Ministers, Sir John A. MacDonald immured himself in silent and deaf indifference.\n\nFrom his private cabinet that man threw impudently the gauntlet to public opinion and posterity.\n\nHis well-known irrepressible thirst for whiskey and strong liquor of all kinds, changed suddenly into an extinguishable thirst for Riel's blood, and, face to face with his complacent and heinous conscience, he waited for the mournful end. Like the gibbet at Regina, he was waiting patiently but surely for his victim.\n\nInto his presence was shown a venerable prelate, Bishop Grandin, who, in spite of his advanced age, had come from the Saskatchewan to implore his clemency for the condemned Half-breed.\n\nHe asked a commutation of sentence in the name of the whole Catholic clergy and the people of his far-distant diocese.\n\nThat holy veteran of God's army humbled himself before the Macchiavelic statesman, but to no avail; he found him inexorable.\n\nThe voice of almost the entire press of the world, reached his ear, and asked him not to add another\nhideous immolation to the history of mankind. He remained unmoved at this echo of human and universal lamentation. He remembered that in rendering their verdict, the eyes of the jurymen were wet with tears, that in giving their answer to the \"Guilty or not guilty,\" their voices were broken by sobs, and that after answering \"Guilty,\" they unanimously and warmly recommended the doomed man to the clemency of the Government.\n\nYes! He remembered all that, but his heart was closed to any such sentiment as that of clemency.\n\nThere was only one thing that Sir John A. Macdonald had not forgotten; it was his own words: \"Oh! that Riel! if ever I can get him in my power!\"\n\nAnd he had him at last in his power.\n\nA petition was sent him, signed by over one million five hundred thousand French Canadians, asking him to be merciful and to change the penalty.\n\nHe paid no attention to their pressing request!\n\nThat man who is a husband and a father, was told that Riel's old mother was crushed by grief and anguish; that his young wife, who was about to give birth to her third child, was heart-broken and dying from sorrow and despair; that his two infant children were asking for their father: The human-faced tiger was deaf to all supplications.\n\nBut his own co-religionists, the Orangemen, were admitted into his office night and day.\nHe heard from them, that the life of Riel was the price of their votes.\n\nThey insisted upon the Half-breed being executed according to sentence.\n\nThey reminded him of Scott's execution, and adjured him to become his avenger.\n\nThe fate of Riel was then irrevocably decided upon.\n\nThat Minister of the English Crown, who had been insensible to the cry of clemency, mercy, pardon and humanity, listened to the satanic voice of an odious and malicious hatred, and on the 16th of November, 1885, in avenging the death of the ruffian Thomas Scott, he became the assassin of Louis David Riel, the heroic French Canadian Half-breed, whose only crime was a too ardent love for his country, and whose last breath was a supreme invocation and prayer to the God of his faith.\n\nAnd thus another bloody page was added to the history of human passion and atrocity!\n\nBut a new name—that of Riel—has increased in number the long list of patriotic martyrs whose memory live for ever in the heart of generations, and whose martyrdom is a sublime teaching to nations and a perpetual warning to oppressors and tyrants.\n\nTHE QUESTION OF THE HOUR.\n\nAnd now, French Canadians, what are you going to do?\nWill you swallow shamefully the cowardly insult inflicted upon your noble race by the disciples of William of Orange?\n\nYour nationality, your faith, your institutions, your pride, your dignity, your religion, your God in fine, have been slapped in the face by a hand still impregnated and wet with the blood of Louis David Riel, that energetic son of your race.\n\nAre you going to bend your once proud heads and offer silently your bare backs to the Orange knout?\n\nAre you no longer the sons of those Titans who wrote on their banner: \"Notre Religion, notre Langue et nos Lois?\" (Our Religion, our Mother Tongue and our Laws.)\n\nYou have seen how far can go the hatred of those who, not satisfied to live upon the soil of your ancestors, have been and are still working—and will strive untiringly—for the annihilation of all those who have French blood in their veins, or Catholic faith in their souls.\n\nWhat you have witnessed is nothing compared to what you must expect.\n\nThe name of Riel cannot be forgotten after a day's excitement. It should be in the future the symbol of patriotism and self-sacrifice, and his fate should live forever in your hearts as an illustration of the capabilities of those who hold in their hands the destinies of your country.\n\nA new epoch, a new phase has commenced for you,\nAND HIS ASSASSINS.\nNo more factions between yourselves! Be united forever, and when danger comes, remember the cry of the Imperial Guard, of which your mother-country is so justly proud:\n\n\"Serrez les rangs,\"\n\nand in answer to the auto-da-fé, offered by Sir John A. MacDonald and his Cabinet to their Orange friends, build a Canadian Pantheon where you will inscribe in the first line the glorious name of the martyr Louis David Riel, with the following epitaph under it:\n\nIN MEMORY OF\nLOUIS DAVID RIEL,\nA FRENCH CANADIAN HALF-BREED,\nBORN IN 1844\nAT\nST. BONIFACE, MANITOBA,\nCOWARDLY ASSASSINATED AT REGINA BY THE\nOTTAWA CABINET AND THE ORANGE PARTY\nON\nNOVEMBER 16TH, 1885.\n\nPASSER-BY\n\nA PRAYER FOR THE ETERNAL REPOSE OF THE SOUL OF THIS\nMARTYR\nAND A CURSE UPON\nSIR JOHN A. MACDONALD, THE CHIEF OF HIS ASSASSINS.\nORANGEISM.\nORANGEISM\n\nVII.\n\nA FEW REMARKS.\n\nOATH AND OBLIGATION OF AN ORANGEMAN.\n\nIn the introduction of his book called The History of Orangeism, its origin, its rise, and its decline, by M. P., and published in Dublin by M. A. Gill & Son, 50; Upper Sackville Street, and in Glasgow by Cameron & Ferguson, West Nile Street, in 1882, the author expresses himself as follows:\n\n\"Prejudice has no more invincible foe than knowledge, and the reign of one must be the dethronement of the other. To assist as far as I can by the aid of History to let in the light of day upon an organisation (Orangeism) more dangerous than \"Nihilism,\" because it is in the guise of loyalty; more destructive than \"Communism,\" because it turns the arms of a people against themselves; more degrading than \"Ribbonism,\"\nbeing the servile tool of an autocratic conspiracy, shall then be the object to which in these pages I shall devote myself. My weapons may be rusty. They will not be the less invincible... The end is to bring conviction to upright men of all classes... 'No people,' says Edmund Burke, 'will look forward to posterity, who do not often look backward to their ancestors,' and in this I find my justification. Whether they blush at their crimes, or feel elated at their heroism, the lesson will be the same. In their errors we may find a warning, in their virtues an example.\n\n\"The Author.\"\n\nIn reading over attentively some precious documents carefully selected by the author of this remarkable work, I have found the following which should not fail to be an everlasting warning to true Catholics all over the world, particularly so to those of all and every origin who live in a country, wherever it may be, protected by the British flag, and ruled by English institutions.\n\nThe unjustifiable execution of Louis David Riel, the Catholic French Half-breed, is one of those solemn events which ought to be considered by nations as a timely lesson taught by the Almighty.\n\nIt is only by consulting history that a people can learn who were its benefactors or its persecutors.\n\nIt is only by knowing what has taken place in the\npast that a race can guard against what might happen in the future.\n\nThe hatred of Orangemen for Catholics is a secret to no one, less so to those who are likely to read my book, and be interested by its contents. There are, however, a few undeniable facts that it would be well to continuously recall to the minds of those whose life is spent among irreconcilable enemies, and this is why I add the following to my book:\n\n**ORANGEMEN'S ORIGINAL OATH.**\n\n\"I do hereby swear that I will be true to the King and Government, and that I will exterminate, as far as I am able, the Catholics of Ireland.\"\n\n**ORIGINAL TEST.**\n\n\"Q.—Where are you?\"\n\"A.—At the House of Bondage.\"\n\"Q.—Where are you going?\"\n\"A.—To the Promised Land.\"\n\"Q.—Stand past yourself?\"\n\"A.—Through the Red Sea.\"\n\"Q.—What is your haste?\"\n\"A.—I am afraid.\"\n\"Don't be afraid, for the man who sought your life is dead.\"\n\"Q.—Will you hold it or have it?\n\"A.—I will hold it.\"\n\nAMENDED OATH OF ORANGEMEN,\n\n\"As issued from the hands of the Grand Master of the Orange Lodges of Ulster.\"—(Thomas Verner.)\n\n\"I, in the presence of Almighty God, do solemnly and sincerely swear, that I will not give the secret of an Orangeman, unless it be to him or them I find to be such after strict trial, or on the word of a well-known Orangeman. I also swear that I will answer all summons for an assembly of Orangemen, eighty miles distance; and that I will not sit, stand by, or be by, and see a brother Orangeman struck, battered or abused, or know his character injured or taken away, without using every effort in my power to assist him at the hazard of my life. I further declare, that I will not lie to or upon an Orangeman, me knowing the same to be detrimental to him, but will warn him of all dangers as far as in my power lies, and that I will bear true allegiance to His Majesty, and assist the civil magistrates in the execution of their offices if called upon, and I will not know of any conspiracy against the Protestant ascendancy; and that I will not make or be at the making of a Roman Catholic an Orangeman, or give him any offence, unless he offends me, and then I will use my endeavors to shed the last drop of his blood, if he or they be not a warranted Mason, and that I will\nstand three to ten to relieve a brother Orangeman, and I will not be a thief, or the companion of a thief, to my knowledge.\"\n\nAMENDED TEST.\n\n\"Q.—What's that in your hand?\"\n\"A.—A secret to you.\"\n\"Q.—From whence came you?\"\n\"A.—From the land of bondage.\"\n\"Q.—Whither goest thou?\"\n\"A.—To the land of promise.\"\n\"Q.—Have you got a pass-word?\"\n\"A.—I have.\"\n\"Q.—Will you give it to me?\"\n\"A.—I did not get it so.\"\n\"Q.—Will you halve it, or letter it?\"\n\"A.—I will halve it.\"\n\"Q.—March?\"\n\"A.—Delzo, through the Red Sea.\"\n\"Q.—What red Sea?\"\n\"A.—The wall of the Red Sea.\"\n\"Q.—I am afraid!\"\n\"A.—Of what?\"\n\"Q.—The Secret of Orangemen being discovered.\"\n\"A.—Not, for he that sought your life is dead.\"\n\"Q.—Have you got a grand word?\"\n\"A.—I have the grand, I am that I am.\"\n\"Q.—Did you hear the crack?\"\n\"A.—I did.\n\n\"Q.—What crack did you hear?\n\n\"A.—A crack from the hill of the fire.\n\n\"Q.—Can you write your name?\n\n\"A.—I can.\n\n\"Q.—With what sort of a pen?\n\n\"A.—With the spear of life, or Aaron's rod, that buds, blossoms, and bears almonds in one night.\n\n\"Q.—With what sort of ink?\n\n\"A.—Papist blood.\"\n\nOBLIGATION OF AN ORANGEMAN.\n\n\"I do solemnly and sincerely swear, of my own free will and accord, that I will, to the utmost of my powers support and defend the present King, all the heirs of the Crown, so long as he or they support the Protestant ascendancy, the constitutions and laws of these Kingdoms, and that I will ever hold sacred the name of our glorious deliverer, William the Third, Prince of Orange; and I do further swear, that I am not or was not a Roman Catholic or Papist; that I was not, am not, nor ever will be an United Irishman; and that I never took the oath of secrecy to that society; and I do further swear, in the presence of Almighty God, that I will always conceal, and never will reveal, either part or part of this that I am now about to receive, neither write it, nor indite it, stamp, stain, nor engrave it, nor cause it so to be done,\"\non paper, parchment, leaf, bark, brick, stone, or anything so that it might be known, and I am now become an Orangeman without fear, bribery, or corruption. So help me God!\"\n\nHow could it be possibly denied, after the authenticity of the above, that Orangeism is the untiring foe of Catholicism, on the same principle that knavery hates honesty; vice, virtue; crime, law; cowardice, bravery, and as true as ruffianism will always execrate benevolence and humanity, an Orangeman will abhor a Catholic.\n\nThe fate of Ireland will remain in universal history as an eternal curse against Great Britain, and what the United Irishmen had to suffer in Ireland at the hands of the Orange Apostles, French Canadians and their brothers, the Irish Catholics, living in the Dominion, have every reason to expect at the hands of their common enemy, the Canadian Orangeism.\n\nThe oath taken by an Orangeman in entering the Order can leave no room for doubt as to the aim of their organization: unrelenting persecution and, if possible, entire extermination of all who belong to the Church of Rome.\n\nThey swear to defend and support to the utmost of their power, the King and all the heirs of the Crown, so long as he or they support the Protestant ascendancy.\n\nThey also most solemnly swear that they will endeavor to shed the last drop of Catholic blood.\n\nMeditate carefully over the above, French Canadians.\nand Irish Catholics, and see, if you can, what you must expect in the future from a Government and a dynasty that can accept such an allegiance, and protect those who take it, in the name of God!\n\nThere is only one solution to this incredible but undeniable state of affairs: Cholera, small-pox, mortal fevers, deadly pestilence may ravage your population and carry away by the hundreds your wives, your mothers, your children. Fire can destroy in a few moments your homes and your property. Famine may knock at your doors and starvation enter your houses; but your most dreadful enemy, whose blood-thirsty hatred and merciless exasperation will never cease to pursue you, is the Orangeman, who will endeavor to shed, in the name of his God the last drop of your Catholic blood. It is that incurable and pitiless ulcer of humanity against which you must guard yourselves and those whom you love.\n\n\"Forgive our Trespasses as we Forgive those who Trespass against us.\"\n\nThis divine prayer was taught to you by your mothers, you teach its sublimity to your children, and while every evening you and yours let your christian souls ask your God to extend his pardon over your enemies, the sworn wolves of William of Orange are grinding their teeth, the disciples of Orangeism are loading their guns and sharpening their daggers in order to be ready to fall\nupon you at the first opportunity, and rest assured that they will then do all in their power to shed the last drop of your blood.\n\nCanadian Catholics, whatever you may be, French or Irish, remember Riel and beware of what the Orange tigers are keeping in store for you!\n\nAt the moment when I was about finishing this unpretentious book, I read the following in one of the New York papers, and I do not think that it will be out of place here:\n\n\"Several papers have affirmed recently that Riel is of Irish origin.\n\n\"This fact is perfectly established by Abbé Tanguay, author of the Dictionnaire Généalogique.\n\n\"Here is what the distinguished Abbé says:\n\n\"An emigrant named Jean Baptiste Reel (alias Riel) son of Jean Baptiste Riel and Louise Lafontaine (Fournain) was born in the parish of Saint Pierre, city of Limavereck, Ireland, and married, at Ile Dupas, on the 21st of January, 1704, Louise, daughter of François Cottu.\n\n\"Their eldest son, Jean Baptiste, was baptized on June 12th, 1705, at the same place, and married in 1732, Marie Louise Frapier, he had been nick-named 'Ireland.' From this marriage were born several children, among whom Jean Baptiste, who married in 1782, Mary Collin. Several of their children were born and baptized at St. Cuthbert, Berthier Co., Canada.\"\n\"Their son, Jean Baptiste, emigrated to the North-west, where he married a French Half-breed girl. She made him the father of a son who was baptized under the name of Louis.\n\n\"This Louis married Julie Lagimodiere, and their son was the same Louis Reil, the leader of the last insurrection.\"\n\nI shall, of course, leave the responsibility of the above statement to the learned Abbé Tanguay, I only reproduce it as worthy of notice.\n\nFrench or Irish, Riel is a martyr, and the Canadian Catholics will forever remember his name and those of his assassins.\"\nBIOGRAPHICAL\n\nAND\n\nDOCUMENTARY.\nBIOGRAPHICAL AND DOCUMENTARY.\n\nVIII.\n\nBIOGRAPHICAL SKETCH OF LOUIS DAVID RIEL TO 1869.\n\nLouis David Riel was born in Manitoba, in 1846, from the marriage of Louis Riel and Julie de Lagimodière. His grandfather was a French Canadian and his grandmother a \"Franco-Montagnaise.\"\n\nHis father had received an elementary education of no mean order, and probably on that account acquired a marked influence among the French Half-breeds.\n\nHe, Riel's father, was for three years in the service of the Hudson Bay Company, but left his situation in order to continue his studies under the Oblats fathers with whom he lived for a period of two years. Later on he came back to the North-west and established the first flour mill ever known in the country.\n\nLouis Riel is still remembered in Manitoba as a man of sound judgment, great bravery, and undoubted patriotism. His fondness for his family was unbounded and he could count his friends by the thousand, not only among his own people but also among the whole population of that vast and rich country.\nIn 1849, the tyranny of the Hudson Bay Company's authorities became unbearable and ferocious.\n\nThe Metis, who, as I have already stated, were the direct means of the making of the incalculable fortunes earned by the Adventurers of England, were treated with utter contempt.\n\nThe laws issued by the government of this Company on the traffic in furs, had been constructed in such a way as to keep the entire population in complete and abject servitude.\n\nThe traffic with the United States was a crime of the worst kind and was punished unmercifully.\n\nThe Metis who, in order to secure these furs, were obliged to brave all sorts of dangers, and to undergo indescribable privations and fatigue, were not allowed to sell the produce of their yearly hunting expeditions to any other traders but the officers of the Hudson Bay Company.\n\nThe prices set for their goods were ridiculously low, while those they were obliged to pay for provisions and clothing were arbitrarily high.\n\nThe stores were buying very cheap and selling very dear. A Metis was not even allowed to correspond in writing with any party or parties living outside of the British territory.\n\nThey were obliged to deposit their letters unsealed and open in the stores of the Company. These letters were carefully perused by the chief employee before being forwarded to their destination.\n\nThe government of the Hudson Bay Company went so far as to issue a law forbidding the Metis to wear or use furs in any shape or form—such rapacity will seem incre-\ndible, but it has nevertheless been enacted by a corporation of adventurers whose laws and constitution were sanctioned and protected by the Imperial Government of England.\n\nNow, let me ask, is there any man breathing the pure air of Heaven, who will not shudder at the mere thought of such barbarity?\n\nIs there any living creature of God who will conscientiously condemn the French Half-breeds for having tried, at the peril of their lives, to break the iron circle in which they lived for over a century.\n\nIs there a nation on the face of the earth which will blame these unhappy and persecuted sons of the wild prairies for having made a supreme effort in order to prove to civilization that although born and living in the wilderness of an immense and almost unknown country, they were nevertheless entitled to a place in the brotherhood of humanity.\n\nLouis Riel was the first to understand that such treatment at the hands of the Hudson Bay Company was an outrage against common-sense and mankind.\n\nHe refused to be convinced that the Adventurers of England had any right to act as law-makers, judges, and executioners at the same time.\n\nHe protested boldly against a state of things which was slowly but surely making of his countrymen a persecuted and abject race.\n\nTo the officers of the Company he openly denied the prerogative of constituting themselves absolute and only buyers and sellers, lawful postmasters and supreme rulers.\n\nThe effects of his protestations were soon felt all over\nthe country and the following episode was the beginning of a new epoch for the Metis:\n\nA French Half-breed, named Sawyer, had been arrested under the charge of selling furs to some private party.\n\nHis trial was to take place on the 17th of May in that year (1849).\n\nOn that day, and just after the judge had taken his seat, Riel entered the court-room followed by a party of Metis. He protested against the arrest of Sawyer, and after giving his reasons for acting thus, he released the prisoner; and not satisfied with this, he and his men went to the Hudson Bay Company's post and compelled the officers to surrender the furs they had seized from Sawyer.\n\nFrom that day, the liberty of trade became an accomplished fact, and Riel, the father, is the man who is entitled to all the credit for it.\n\nWith the example of such a father before him, it was but natural that Louis David Riel be designated by his countrymen as their leader and the defender of their cause, in the insurrectional movements of 1869 and 1885.\n\nBishop Alexander Taché was the first to discover that there was in the young Metis a visible and laudable thirst for study.\n\nIt is to that distinguished and highly venerated prelate that Riel owed his education.\n\nThe most Reverend Bishop succeeded in interesting Madame Masson, a French-Canadian lady, mother of the present Governor of the Province of the Quebec, in behalf of the young Riel.\n\nShe became his \"protectrice,\" and through her solici-\ntude and that of the worthy Bishop, Louis David Riel was sent to the College of Montreal.\n\nDuring the course of his studies, he showed a strong liking for literature, poetry and history and he soon proved that he was a born orator.\n\nThe sweetness of his dispositions made him a great favorite among his teachers and schoolmates, and many of his contemporaries now living in the Province of Quebec, and occupying high official or private positions, still remember him as an ambitious and hard-working student.\n\nThe death of his father, which occurred in 1864, was a great blow to Louis David, and threw into his sensitive nature a shadow of melancholy and sadness which remained one of his characteristics until his last day.\n\nHis widowed mother was left with eight children to support, and from that moment he was considered the head of the family.\n\nLouis David Riel returned to Manitoba in 1866, three years before the first rebellion.\n\nBefore ending this biographical sketch in which I had an opportunity to mention again the name of Archbishop Taché, I ask to be permitted to state once more that the remarks contained in my second chapter about the pamphlet issued by this venerable prelate, are completely devoid of any intention of blaming his action. I know how staunch and sincere are his love and devotion for his people and I have witnessed too many proofs of his unbounded patriotism, to think for a moment that his real\nintentions in issuing the said pamphlet could be anything but well meant.\n\nMy sole object in pointing out the indifference shown by young French Canadians in 1869, during the recruiting of the expeditionary corps, was to advocate with all my might the principle: that the blunders of the past ought to be a good lesson for the future, and that now, more than ever, French Canadians and Catholics of all nationalities in Canada will have to look sharp and be less indifferent, if they do not want to succumb to the untiring hatred of Orangeism.\n\nAnd now, a few words more before leaving my readers. Has the execution of Louis-David Riel pacified the Half-breed and Indian population?\n\nHas the cold cruelty of the Government won the approval of the civilized world?\n\nNo; a thousand times, no!\n\nA little less negligence, a few kind words and a wiser policy would have done more toward furthering peace and order than the bloody work accomplished by the fratricide English bayonets in the Saskatchewan.\n\nThe members of the Ottawa Cabinet were not deservedly severe—they were awkwardly and criminally cruel. They thought that they could extinguish a rebellion with human blood.\n\nA near future will prove that the blood so coolly shed by their hands will have the same effect as coal oil on a burning fire!\nRIEL ON THE NORTH-WEST QUESTION.\n\nEngland has affirmed her suzerainty over the North-west in 1670, with the sole intention of submitting that vast territory and its numerous aborigines under the monopoly of the Company of Adventurers of the Hudson Bay.\n\nThe chart of king Charles II. gave to that Company the privilege to make the traffic of furs in those countries, to the exclusion of all other people, and deprived, gratuitously, the North-west of its right to transact business with the world, and the world of its right to transact business with the North-west; it frustrated the North-west of the advantages of universal commerce, and it determined the loss, to mankind in general; of the benefits that could be derived from trafficking with the tribes and colons of that great territory.\n\nWhat helped most to ruin my Indian ancestors of the North-west, was the fact that in becoming rich at their expense, and in proportion to the influence she gained with the English authorities, that Company became herself a government of the Hudson Bay territory, and governed it with the sole view of satisfying her avarice and cupidity.\n\nCommercial aristocracy, backed by governmental power in the Company proper, made of that band of adventurers an ulcer, a monster which devoured the North-west and its immense riches in furs for more than half a century.\n\nThis claim made of my country by England, in order to deliver it, with my forefathers, to a set of brigands,\nwas on the side of England an abandonment and a profanation of her duties of suzerain. And, since the history of her domination proves, in an irrecusable manner, the fact that she has been guilty of such a criminal abandonment, I avail myself of it. I invoke that international treason, which she has nourished the culpable growth from 1670 to 1849. I denounce the system of robbery in which she has persisted during one hundred and seventy-nine years. I declare that England has long ago forfeited all her rights to govern the North-west.\n\nI declare my country free from her yoke and her tyranny, supplicating God, whom I adore most reverently, to sustain me and to sustain my declaration; I pray mankind to help me as much as circumstances will permit, as much as Providence will enable it to do so.\n\nLouis David Riel.\n\nRIEL'S LETTER TO THE \"IRISH WORLD.\"\n\nAN APPEAL FOR JUSTICE.\n\nTo the Citizens of the United States of America:\n\nFellow-Men:—The outside world has heard but little of my people since the beginning of this war in the North-west Territory, and that little has been related by agents and apologists of the bloodthirsty British Empire. As of old, England's infernal machination of Falsehood has been employed to defame our character, to misrepresent our motives, and to brand our soldiers\nand allies as cruel savages. These things I learn from American papers which come to me through the same channel that I send this to you. The end which our enemies have in view is plain—Their object is to prevent good people from extending to us their sympathy while they themselves may rob us in the dark and murder us without pity.\n\nOf one hundred or more papers that now lie in my tent, *The Irish World*, I find is the only true friend we have. In the columns of this far-famed journal the truth is fully told. England's organs in the United States and Canada falsely aver that my people have no grievances. To contradict their false statements I now write to the defender of the oppressed, Mr. Patrick Ford, whose *Irish World* will publish a true statement of the facts in all corners of the globe.\n\nOur lands in the North-west Territory, the possession of which were solemnly confirmed by the Government fifteen years ago, have since been torn from us and given to land-grabbers who never saw the country—and this after we had cut down forests, plucked up stumps, removed rocks, plowed and seeded the soil, and built substantial homes for ourselves and our children.\n\nNearly all the good available lands in this territory (as is the case with the lands east of the Rocky Mountains) are already in the clutches of English lords, who have large herds of cattle grazing thereon; and the riches which these lands produce are drained out of the country and sent over to England to be consumed by a people that fatten on a system that pauperizes us.\n\nThis wholesale robbery and burglary has been carried on, and is still carried on, with the connivance of accurs\ned England: The result is extermination or slavery. Against this monstrous tyranny we have been forced to rebel. It is not in human nature to quietly acquiesce in it.\n\nIn their treatment of us, however, the behavior of the English is not singular. Follow those pirates the world over and you will find that everywhere—and at all times they adopt the same tactics and operate on the same thievish lines.\n\nIreland, India, the Highlands of Scotland, Australia, and the isles of the Indian Ocean—all these countries are the sad evidences and their native populations are the witnesses of England's land robberies.\n\nEven in the United States—and it is a burning shame for the Government and people of that great and free nation to have it to be said—English Lords have, within a few short years, grabbed territory enough to form several large States. Alas! for the people of your country. Alas! for the Government for whose independence and glory the soldiers of George Washington fought bare-foot against the cut-throats and hell-hounds of England,—alas! that this same evil power should be allowed to return and reconquer so much of your nation without a shot being fired or even a word of protest being uttered in the name of the American people!\n\nYour Government, which has allowed her citizens to be robbed of their heritage by English Lords and English capitalists, has also given aid and comfort to the English in permitting her General Howard to come to Manitoba and the North-west Territory to school the assassins that were sent from Toronto to murder me and my people, and to give the Queen's Own lessons in handling the\nAmerican Gatling gun, as well as in granting license to British soldiers and British ammunition intended for our destruction to pass over American soil. By its conduct in this entire business the Administration at Washington has made the United States the ally of England in fighting a people who were only protecting their homes and firesides. Does it require two powerful nations such as the United States and England to put down the Saskatchewan rebellion? Grover Cleveland and Secretary Bayard have much to answer for.\n\nIt is now evident, as The Irish World has charged, that these two high officials of the United States are more English than American. The animus they have shown towards my people and me for the past two months, as well as the friendship and aid they have extended to our enemies, is but an additional confirmation of what has been charged against them.\n\nCan it be possible that the American people, or any considerable portion of them, have any real sympathy with England? Have they not read, has it not come down to them from bleeding sire to son, of the crimes and atrocities and fiendish cruelties which that wicked power inflicted upon their patriotic fathers during the Revolution? Of the American towns wantonly given to the flames by order of English commanders, of the horrors of the English prison ships, and the barbarities imposed by the English upon American prisoners of war? Does not American history record the outrages perpetrated by England upon American commerce and American citizenship which led to the war of 1812? And is it not still fresh in the memory of men of middle age, how, when the Republic was engaged in a life-and-\ndeath struggle with the slaveholder's rebellion, England gloated over your troubles and sent her sympathy and her money and her armed ships to your enemies to destroy your Union and to bring the American name into disgrace before the world? Generous minds forgive injuries, but spaniels lick the hand that smites them. The Americans are not spaniels; but, there are sycophants and lickspittles in America, nevertheless, and those base natures are to the honest people of today what the Tories were to the honest and patriotic people of a century ago. They are not Americans.\n\nA word here to the French and Irish of Canada, and I am done: I beg and pray that they will not allow themselves to be induced by any threats or by any blandishments to come out against us. Our cause is just, and therefore no just man of any race or nationality ought to stand opposed to us. The enemies who seek our destruction are strangers to justice. They are cruel, treacherous, and bloody. And yet, like the tiger, they are only obeying the instincts of their nature. But for the Irish people, who for centuries have been robbed and massacred and hunted from their island home by the English, and whose good name is reviled by the English in all lands, or for the Canadian French, who are subjected to the grossest and most ruffianly abuse from the same, to aid in any way these enemies would be not only wrong but stupid and unnatural.\n\nIn a little while it will be all over. We may fail. But the rights for which we contend will not die. A day of reckoning will come to our enemies and of jubilee to my people. The hated yoke of English domination and arrogance will be broken in this land,\nand the long-suffering victims of their injustice will, with God's blessing, re-enter into the peaceful enjoyment of their possessions.\n\nLOUIS RIEL.\n\nBATOCHÉ, N.-W. T., May 6, 1885.\n\nRIEL'S LAST LETTER TO HIS MOTHER.\n\nLast wishes of the fallen hero. His tender farewell to his mother. A great patriot. A devoted son. A loving husband and a fond father.\n\nMy Dear Mother—I received your letter of benediction, and yesterday, Sunday, I asked Père André to place it upon the altar during the celebration of mass in order that I might be held under the shadow of its blessing. I asked him afterward to place his hands upon my head that I might worthily receive it, as I could not attend at Church, and he thus had diffused upon me the graces of mass, with its abundance of spiritual and temporal good. To my spouse, to my children, my brother and sister-in-law and other relatives, who are all very dear to me, I say farewell.\n\nDear mother, it is the prayer of your eldest son that your prayers and beseechings in his behalf ascend to the throne of Jesus Christ, to Mary and to St. Joseph, my good protector, and that the mercy and abundant consolation of God fill you and my wife, children and other relatives with all spiritual blessings from generation unto\ngeneration, on account of the great blessing you have poured upon myself; on yourself especially for having been a good mother to me, that your faith and hope, your charity and example be as the tree laden with excellent fruit in present and in future, and when your last day arrives that the good God shall be so much pleased with your pious spirit that he will bear it from earth upon the wings of angels. It is now two o'clock in the morning of my last day on earth, and Père André has told me to be ready for the grand event. I listened to him, and am prepared to do everything according to his advice and earnest recommendation. God holds me in his hand to keep in peace and sweetness as oil held in a vessel which can not be disturbed. I do what I can to keep myself ready for any event, keeping myself calm in accordance with the pious exhortations of the venerable Archbishop Bourget.\n\nYesterday and to-day I prayed to God to reassure you and send you all sweet consolation, and in order that your heart may not be disturbed by anxiety and trouble I am brave, and I kiss you all with affection. I embrace you as a dutiful son, and my dear wife, I embrace you as a Christian husband, according to the conjugal spirit of the Catholic union. I embrace you, children, in the breadth of divine mercy, and my brother and sisters-in-law and all relatives and friends, I embrace you with all the good feeling of which my heart is capable.\n\nDear mother, I am your affectionate, obedient and submissive son,\n\nLouis David Riel.\n\nPrison of Regina, November 16, 1885.\nLOUIS RIEL'S WILL.\n\nA PATHETIC TESTAMENT—HE LEAVES NOT GOLD BUT GOOD ADVICE TO HIS CHILDREN.\n\nFollowing is a copy of Riel's will.\n\nIn prison at Regina,\n\nTESTAMENT OF LOUIS DAVID RIEL.\n\nI make my testament according to counsel given me by Rev. Father Alexis André, my charitable confessor and most devoted director of my conscience.\n\nIn the name of the Father, of the Son and of the Holy Ghost, I declare that this is my testament, that I have written it freely in the fullest possession of my faculties.\n\nMen having fixed the 10th of November next as that of my death, and as it is possible the sentence will be executed, I declare beforehand that my submission to the orders of Providence is sincere. My will is ranged with entire liberty of action under the influence of the Divine Grace and our Lord Jesus Christ, on the side of the Roman Catholic and Apostolic Church. I was born in it and it is by it that I have been led into the way of grace. It is by her also that I have been regenerated.\n\nI have retracted what I have said and professed contrary to her teaching, and I retract it again. I ask pardon for the scandal I have caused. I do not wish that there should be a difference between me and the priesthood of Jesus Christ as great of the point of a needle. If I should die on the 10th of the month—that is to say, in four days—I wish to do all in my power with the divine succors of my Saviour to die in perfect harmony with my\nCreator, my Redeemer, my Sanctifier, and with the Holy Catholic Church, and if my God wishes He will accord me the gift inestimable of life, I wish on my side to mount the scaffold, and to resign myself to the will and end of Providence by holding myself apart, as I am today, from all earthly things, for I understand the most certain means of doing well, and of having durable fruits is to practice and perform all enterprises in a manner entirely disinterested, without passion, without excitement, entirely in sight of God while loving your neighbor, your friend and your enemy as yourself. For the love of God.\n\nI thank my good and tender mother for having loved me, and for having loved me with a love so Christian. I demand of her pardon for all the faults of which I have been guilty against the love, the respect and obedience that I owe her. I beg of her to pardon also the faults that I have committed against my duty toward my well loved and regretted father, and toward his venerable memory.\n\nI thank my brothers and sisters for their great love and kindness to me. I also ask their pardon for my faults of all kinds and for all the errors for which I have been culpable in their eyes.\n\nI thank my relatives and the relatives of my wife for always being so good and gentle to me, in particular my affectionate and well loved father-in-law, my mother-in-law, my brothers-in-law, and my sisters-in-law. I beg of them also to pardon whatever has not been right in me, all that has been evil in my conduct.\n\nI give the hand of true friendship to my friends of all ages, of all ranks, of all conditions, and of all\npositions. I thank them for the services they have rendered me. Particularly am I grateful toward my friends who have deigned to busy themselves with my affairs in public both on this and the other side of the line. To the oblates of Marie Immaculate, the Society of St. Sulpice, to the Grey Nuns for all the good and kindness I have received from them from my infancy I return them my thanks.\n\nI have benefactors on the other side of the line, friends whose goodness to me has been beyond measure. I beg of them to accept my thanks, and to charitably excuse my defects, and if my conduct has in any way been offensive to them, whether in small or great matters, I beg of them to pardon me while taking into account the excuses that may be in my favor as to the real sum of my faults. \"Nice capabilities\" I have. They will have goodness to forgive them all before God and man.\n\nI pardon with all my heart, with all my mind, with all my force, with all my soul, those who have caused me chagrin, who have given me pain, who have done me harm, and have persecuted me, who have without any reason made war on me for five years, who have given me the semblance of a trial, who have condemned me to death, and if they really mean to give me to death I pardon them, this as I ask God to pardon me all my offences entirely in the name of Jesus Christ.\n\nI thank my wife for having been so good and charitable to me, for the part she has so patiently taken in my painful works and difficult enterprises. I pray her to pardon me the sadness I have voluntarily and involuntarily caused, I recommend to her the care of her little children—to bring them up in a Christian manner,\nwith particular attention to all that relates to good thoughts, good actions, and good companions.\n\nI desire that my children may be brought up with great care in all that belongs to obedience to the church, their masters and superiors. I urge them to show the greatest respect, the greatest submission, and the most complete affection toward their good mother. I do not leave to my children gold or silver, but I beg God in His infinite pity (Je supplie les entrailles de la miséricorde de Dieu) to fill my mind and my heart with the truly paternal blessing which I desire to give them. Jean, mon fils, Marie-Angélique, ma fille, I bless you in the name of the Father and of the Son and of the Holy Ghost, so that you may be attentive to know the will of God and faithful to accomplish it in all piety and in all sincerity; that you may practice virtue solidly, but simply, without parade or ostentation; that you do the most good possible while holding to yourself, without being wanting to others within the limits of just obedience to the approved bishops and the priests, especially to your bishop and your confessor. I bless you that your death may be sweet, edifying, good and holy in the eye of the Church and in that of Jesus Christ, our Lord, Amen.\n\nI bless you in fine that you may seek and find the Kingdom of God, and that you may have moreover rest in Jesus, in Mary and in Joseph. Pray for me.\n\nI leave my testament to the Rev. Père André, my confessor. I pray my friends everywhere to hold the name of Père André side by side with my own. I love Father André.\n\nLouis David Riel,\nSon of Louis Riel and of Julie de Lagimodière.\nA POSTSCRIPTUM:\n\nA chapter is missing in this work. Without it The Truth about Riel would be incomplete.\n\nBy right, that chapter should cover a large number of pages, and then it would but imperfectly demonstrate the zeal, courage and abnegation of a group of patriotic and intelligent men who foresaw, and predicted as it were, the still incredible double-faced and cowardly policy of the Ottawa Cabinet.\n\nWith limited means but with unlimited patriotism, these brave and righteous men banded together and set to work to save Riel's life and their country from the indecent stigma the Orange crime of Regina has branded upon its forehead!\n\nFor more than five months these patriotic men worked like beavers to wrest from the dastardly foe the head upon which an arrogant and despicable oligarchy hath set its mind of sacrificing to its intolerance and bigotry.\n\nWhen the Liberal press took in hand the defence of Riel, the tools of the Ottawa Government would say to the timid: \"Be careful, don't mix yourselves with this liberal agitation. There is a political scheme underlying all this; the Liberals know full well that Riel will not be hung, and they are making political capital out of the necessary cautiousness and tardiness of the Govern-\n\"ment, who is forced to such a course in order to keep\n\"the Orange faction in the traces.\"\n\nWhen generous and disinterested citizens were remark-\ning that money would be necessary to pay the legal ex-\npenses of Riel's case, those same governmental tools would\nsay from door to door, in the streets, in the parlors and\neven in the counting-rooms: \"Why subscribe? Has not\n\"the Government promised to defray the necessary costs?\n\"Did not Sir Langevin made a solemn pledge to have a\n\"medical commission appointed, and is not all this equi-\n\"valent to an official guarantee that Riel will not be\n\"hung?\"\n\nFurthermore, when a Committee, composed of men\nfrom all political parties, was formed, those very same\ntools again attempted by all means to throw cold water\nupon the movement. \"Be careful,\" they would say,\n\"do not unwittingly embarrass the action of the Govern-\n\"ment. The position of the Ministers is rather delicate.\n\"The Confederation has within its borders other elements\n\"than French Canadians, and since the Ministers are set\n\"upon saving Riel, they ought to be left to choose their\n\"own good time and means.\"\n\nFortunately that there was a group of intelligent and\nbrave men who saw clearly through all this hypocrisy, and\nwere determined upon saving Riel if unalloyed devotedness\ncould accomplish that object. The following Committee\nwas formed in Montreal to receive subscriptions and make\nall necessary arrangements to organize the defence of\nRiel, every name upon that Committee should be honored by all those who prize nobleness of aim and disinterestedness of motives.\n\nFollowing is the Roll of Honor:\n\nL. O. David, President; Chas. C. Delormier, 1st Vice-President; R. Préfontaine, 2d Vice-President; Charles Champagne, Secretary; A. E. Poirier, Assistant-Secretary; Jérémie Perrault, Treasurer; J. O. Dupuis, Assistant-Treasurer.\n\nExecutive Committee.—R. Laflamme; H. C. St. Pierre; Alphonse Christin; Pierre Rivard; E. L. Ethier; Barney Tansey; E. A. Dérome; Georges Duhamel; Jean-Marie Papineau; G. Phaneuf; J. O. Villeneuve; A. Ouimet, and J.-Bte. Rouillard.\n\nMany other public-spirited men also lent untiring help to the generous movement. Impossible to mention them all, but among the principals are the Honorables Mercier, Beaubien, Amyot, Desjardins, Paquette, Bellerose, Lemieux, Fitzpatrick, Langelier, Pacaud, Cloran of the Montreal Daily Post, Barry, Stevens, McShane, E. Tremblay and A. Globensky.\n\nUnsuccessful to wrest from the Ottawa Cabinet and the Orange faction the life of Louis Riel, and save their country the humiliation of a political gibbet, these men, however, have not left a stone unturned in order to secure their unselfish and noble aim, and they should be honored and praised for their devotion to principles of uprightness and humanity.\nINDEX\n\nI.—The Truth about Riel,\n\nCan Riel be charged with rebellion? 20\nHow were the Metis treated for years? 21\nThe Provisional Government, 23\nThe Red River expedition, 23\nOn to them! Kill them! 25\nA pamphlet, 26\nThomas Scott, 28\nSelf-defence, 29\nThe troops in Manitoba, 31\nAtrocities committed by the Ontario Volunteers, 33\nReferences, 34\nColonel Wolseley's blunder, 35\nA simple question, 36\nHalf-breeds dispossessed by Ontario speculators, 36\nRiel offers his services to the Government.—They are accepted, 38\nRiel elected at Provencher, 39\nThe Government's cowardice, 39\n\nII.—Fifteen Years of Persecution, 41\n\nThe real causes of the rebellions of 1869 and of 1885, 43\n1869, 43\n1870, 44\nSelf-defence, 46\nAn infamous treachery, 48\n1871, 49\n1872, 51\nThose Orange lambs! 62\nArbitrary judicial decision, 64\nAnother amnesty, but conditioned on exile, 65\nWhat led to the rebellion of 1885, 66\nRiel's happy home in Manitoba, 69\nRiel's persecuted countrymen beg for his aid, 70\nThe voice of patriotism, 71\nAn historical comparison, 72\nConstitutional agitation and the right of petition met by muskets, 73\nThe insurrection of 1885, 74\n\nIII.—Opinion of the Press, 78\n\nObstinacy is no substitute for honor.—N. Y. Herald, 79\nThe American View of the Riel case.—Central Law Journal, of St. Louis, 80\nRiel's blood will be on Sir John's hands.—N. Y. Herald, 81\nNothing gained by hanging.—Baltimore Times, 82\n\"I wish to God I could catch him!\"—N. Y. Herald, 83\nCanada statesmanship at fault.—Washington Post, 83\nWill Canadians submit to such an atrocious use of influence?—New York Herald, 84\nMuch in extenuation.—Memphis Appeal, 85\nA costly blunder threatened.—Washington Republican, 85\nHe will die a martyr.—Hartford Post, 86\nDefiance of civilized sentiment.—Boston Transcript, 86\nShort-sighted policy.—Austin Statesman (Texas), 86\nA solemn prediction.—St. Paul Globe, 86\nThe revival of race antipathy in Canada.—New York Herald, 87\nAn execution which will tend to strengthen the movement for separation.—Freeman's Journal, of Dublin, 89\nAlmost a sacred person.—Pall Mall Gazette, 90\nLove for his country.—London Echo, 90\nA National Disgrace.—Toronto Globe, 90\nThe Press of the Province of Quebec,\nL'Événement, of Quebec, 92\nLa Presse, of Montreal, 93\nLe Monde, of Montreal, 93\nL'Étendard, of Montreal, 94\nL'Électeur, of Quebec, 94\nHighly impolitic.—London Daily News, 94\nThe tribute of a paid tool.—Quebec Chronicle, 94\nThe Paris press, M. Rochefort in L'Intransigeant, 95\nLe Figaro, of Paris, 95\nThe wedge of discord driven deeply into the body politic.—Telegraph, 96\nSir John's Motives.—The editor of Le Courrier des États-Unis, of New York, 98\nWill there be another insurrection?—New Haven Register, 99\nA legal murder.—Hartford Post, 100\nThe execution of Riel.—New York Times, 100\nThe execution of Riel.—New York Star, 101\nThe Canadian hanging.—New York World, 102\nCanada repudiates the crime.—The Montreal Daily Post, 104\nThe duty of the hour.—Catholic Record, of London, Ontario, 110\nMisgovernment and Rebellion.—The True Witness and Catholic Chronicle of Montreal, 113\nThe situation in Ontario.—The Irish Canadian, of Toronto, Ontario, 116\nA foul deed.—The Catholic Record, of London, Ontario, 118\nIrish sympathy for Riel in New York, 124\n\nIV.—Historical Reminiscences, 125\nWhat the Figaro (Paris), says, 127\nA Courageous rascal, 130\nThe Execution, from the Leader of Regina, 131\n\nV.—Three Traitors, 137\nLove of Power above love of country, 139\nCameleonic criminality, 140\nA true bill, 146\nAdding cowardly insult to criminal injustice, 149\nVI.—Condemned Even Before Tried,\n\n\"Oh! that Riel, if I can ever get him in my power!\"\n\nThe question of the hour,\n\nVII.—Orangeism,\n\nOath and obligation of an Orangeman,\nOrangemen's original oath,\nOriginal test,\nAmended oath of Orangemen,\nAmended test,\nObligation of an Orangeman,\n\"Forgive our trespasses as we forgive those who trespass against us,\"\n\nVIII.—Biographical and Documentary,\n\nBiographical sketch of Louis David Riel to 1869,\nRiel on the North-west Question,\nRiel's last letter to the Irish World,\nRiel's last letter to his mother,\nLouis Riel's Will,\n\nA Postscriptum,\nIN PRESS\n\nA free translation of \"The Gibbet of Regina,\" in the French language.\n\nLE GIBET DE REGINA.—La Vérité sur Riel — Sir John A. MacDonald et le Cabinet d'Ottawa devant l'Opinion Publique. — Par \"Un Homme bien Renseigné.\" New York: THOMPSON & MOREAU, Imprimeurs-Editeurs, 51 et 53 Maiden Lane, 1886.\n\n(French Edition.)—16mo. Pp. 200, illustrated. Paper cover, 50 cents. By mail, 56 cents. For sale at the principal newsdealers and booksellers. THOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nTHE TWO SISTER REPUBLICS.—The United States and France — Grant, Bancroft and Bismarck. — By Joseph Aron. New York: THOMPSON & MOREAU, Printers and Publishers, Nos. 51 & 53 Maiden Lane, 1885.\n\nLarge 8vo., 119 double pages; French and English versions facing each other; laid-paper. Paper cover, 50 cents.\n\nIn this book, Mr. Joseph Aron shows, by official documents, why, as a Frenchman and native of Lorraine, he could not accept Mayor Grace's nomination on the \"Committee to consider ways and means for raising a monument to General Grant.\" The pro-German and anti-French feelings of Grant's Administrations exemplified by the official dispatches of Bancroft and Grant's own messages. The great historian Bancroft has not only found out a great similarity between American and German institutions, but has also found out that Germany was the freest country in Europe, and he officially recognizes it as the child of America.\n\nTHOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nESTUDIOS Y CONFERENCIAS DE HISTORIA Y LITERATURA.—Por Enrique Piñeiro. Nueva-York: Imprenta de THOMPSON y MOREAU, 51 y 53 Maiden Lane, 1890.\n\n(Spanish Edition.)—8vo. Pp. x-308, toned laid-paper, gilt top, uncut. Cloth, $2.50.\n\nTHOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nEL CANCIONERO.—(Das Buch der Lieder.) — Traducción directa del alemán de Heinrich Heine. Por J. A. Pérez Bonalde, de la Real Academia Española. Primera edición. Nueva-York: Tip. de THOMPSON y MOREAU, 51 y 53 Maiden Lane, 1886.\n\n(Spanish Edition.)—Square 16mo. Pp. xlvi-xxx-362 (in all, 438 pp.) Toned paper, profusely illustrated. Edition de grand luxe. In paper cover, uncut, $3.00; cloth, gilt edges, stamped in silver and gold, $4.50; full levant morocco, gilt-edges, stamped in silver and gold, $8.50.\n\nTHOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nPOESIAS COMPLETAS DE NUÑEZ DE ARCE. Tercera edición, aumentada. New York: Imprenta de THOMPSON y MOREAU, Nos. 51 y 53 Maiden Lane, 1884.\n\n(Spanish Edition.)—16mo. Pp. 302, toned paper, with portrait of Nuñez de Arce. Price, $2.50.\n\nTHOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nHAND-BOOK OF MEXICO.—Information regarding the Republic of Mexico at the Present Day. —Compiled by J. M. Robertson. New York: THOMPSON & MOREAU, Printers, 51 & 53 Maiden Lane, 1883. — 132°. Pp. vii-141. Cloth, 50 cents. THOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, N. Y.\n\nULTIMA LAMENTACION DE LORD BYRON.—Por Gaspar Nuñez de Arce, de la Academia Española. New York: Imprenta de THOMPSON y MOREAU, 51 y 53 Maiden Lane.\n\n(Spanish Edition.) — Large Square 16mo. 52 pp. of text, with illustrations, toned paper, gilt-edges. — Edition de luxe. Cloth, $1.50. THOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nRITMOS.—Por J. A. Pérez Bonalde. Imprenta de THOMPSON y MOREAU, 51 Maiden Lane, Nueva-York.\n\n(Spanish Edition.) Square duodecimo. Pp. xxvi-320, with Author's portrait. Cloth, $1.25.\n\nTHOMPSON & MOREAU, Publishers, 51 & 53 Maiden Lane, New York.\n\nEL POEMA DEL NIAGARA.—Por J. A. Pérez Bonalde. Segunda edición. —Nueva-York: Imprenta de THOMPSON y MOREAU, 1883.\n\n(Spanish Edition.)—16mo. Pp. xxviii-314. Toned paper. Illustrated. Paper cover, 50 cents.\n\nTHOMPSON & MOREAU, Publishers, 51 y 53 Maiden Lane, New York.\n\nTHOMPSON & MOREAU,\n\nNos. 51 & 53 MAIDEN LANE, New York, U. S. A.\n\nWe execute all kinds of Printing in Letter-press and Lithography: Books, Reviews, Newspapers; Catalogues, Prospectuses, Price-Lists, and all descriptions of Printing for Professional and Commercial circles.\n\nOur establishment is especially organized for Translating and Printing in Foreign Languages. We translate and print in English, Spanish, Portuguese, French-Catalan, Italian, German, Dutch, Flemish, &c., &c.\n\nThe only Printing Establishment on this continent where several foreign languages are concurrently printed with elegance and correctness.\n\nEstimates furnished. Address THOMPSON & MOREAU, Printers and Lithographers, Nos. 51 & 53 Maiden Lane, New York.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001515.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 208, "total-input-tokens": 301120, "total-output-tokens": 57946, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 307, 1], [307, 444, 2], [444, 649, 3], [649, 649, 4], [649, 2203, 5], [2203, 3623, 6], [3623, 4918, 7], [4918, 6217, 8], [6217, 7683, 9], [7683, 9055, 10], [9055, 10395, 11], [10395, 11603, 12], [11603, 13066, 13], [13066, 14172, 14], [14172, 15446, 15], [15446, 16745, 16], [16745, 18070, 17], [18070, 18610, 18], [18610, 18633, 19], [18633, 18633, 20], [18633, 19592, 21], [19592, 20963, 22], [20963, 22360, 23], [22360, 23818, 24], [23818, 24974, 25], [24974, 26442, 26], [26442, 27757, 27], [27757, 28911, 28], [28911, 28951, 29], [28951, 28951, 30], [28951, 30409, 31], [30409, 31680, 32], [31680, 32945, 33], [32945, 34468, 34], [34468, 35854, 35], [35854, 37247, 36], [37247, 38540, 37], [38540, 39808, 38], [39808, 41116, 39], [41116, 42164, 40], [42164, 43699, 41], [43699, 44907, 42], [44907, 46151, 43], [46151, 46977, 44], [46977, 47009, 45], [47009, 47009, 46], [47009, 47745, 47], [47745, 49006, 48], [49006, 50453, 49], [50453, 51628, 50], [51628, 52819, 51], [52819, 54133, 52], [54133, 55414, 53], [55414, 56769, 54], [56769, 57896, 55], [57896, 59196, 56], [59196, 60474, 57], [60474, 61730, 58], [61730, 63068, 59], [63068, 64351, 60], [64351, 65651, 61], [65651, 66968, 62], [66968, 68180, 63], [68180, 69574, 64], [69574, 70864, 65], [70864, 72105, 66], [72105, 73546, 67], [73546, 74871, 68], [74871, 74905, 69], [74905, 76192, 70], [76192, 77496, 71], [77496, 78839, 72], [78839, 80213, 73], [80213, 81449, 74], [81449, 82701, 75], [82701, 83912, 76], [83912, 85144, 77], [85144, 86171, 78], [86171, 87196, 79], [87196, 87718, 80], [87718, 87718, 81], [87718, 87740, 82], [87740, 87740, 83], [87740, 88580, 84], [88580, 89891, 85], [89891, 91217, 86], [91217, 92373, 87], [92373, 93561, 88], [93561, 94774, 89], [94774, 95860, 90], [95860, 96746, 91], [96746, 97580, 92], [97580, 99073, 93], [99073, 100381, 94], [100381, 101525, 95], [101525, 102667, 96], [102667, 103975, 97], [103975, 105265, 98], [105265, 106286, 99], [106286, 107420, 100], [107420, 108557, 101], [108557, 108624, 102], [108624, 110046, 103], [110046, 111263, 104], [111263, 112509, 105], [112509, 113822, 106], [113822, 115136, 107], [115136, 116642, 108], [116642, 117995, 109], [117995, 119372, 110], [119372, 120612, 111], [120612, 122037, 112], [122037, 123443, 113], [123443, 124855, 114], [124855, 126258, 115], [126258, 127808, 116], [127808, 129374, 117], [129374, 130790, 118], [130790, 132254, 119], [132254, 133653, 120], [133653, 135022, 121], [135022, 136525, 122], [136525, 137921, 123], [137921, 139465, 124], [139465, 140951, 125], [140951, 142512, 126], [142512, 143564, 127], [143564, 144362, 128], [144362, 144822, 129], [144822, 144849, 130], [144849, 144849, 131], [144849, 145721, 132], [145721, 146992, 133], [146992, 148315, 134], [148315, 149607, 135], [149607, 150757, 136], [150757, 152160, 137], [152160, 153370, 138], [153370, 154708, 139], [154708, 155810, 140], [155810, 156609, 141], [156609, 156625, 142], [156625, 156625, 143], [156625, 157351, 144], [157351, 158568, 145], [158568, 159889, 146], [159889, 161272, 147], [161272, 162508, 148], [162508, 163874, 149], [163874, 165145, 150], [165145, 166344, 151], [166344, 167721, 152], [167721, 169099, 153], [169099, 170299, 154], [170299, 171181, 155], [171181, 171211, 156], [171211, 171211, 157], [171211, 172058, 158], [172058, 173370, 159], [173370, 174715, 160], [174715, 176047, 161], [176047, 177226, 162], [177226, 178533, 163], [178533, 178533, 164], [178533, 178552, 165], [178552, 179344, 166], [179344, 179344, 167], [179344, 179355, 168], [179355, 179355, 169], [179355, 180139, 170], [180139, 181461, 171], [181461, 182340, 172], [182340, 183700, 173], [183700, 184486, 174], [184486, 185654, 175], [185654, 187048, 176], [187048, 188400, 177], [188400, 189686, 178], [189686, 190239, 179], [190239, 190271, 180], [190271, 190271, 181], [190271, 191314, 182], [191314, 192827, 183], [192827, 194326, 184], [194326, 195792, 185], [195792, 197224, 186], [197224, 198525, 187], [198525, 199990, 188], [199990, 201295, 189], [201295, 202959, 190], [202959, 204586, 191], [204586, 206258, 192], [206258, 207933, 193], [207933, 209189, 194], [209189, 210752, 195], [210752, 212193, 196], [212193, 213816, 197], [213816, 215483, 198], [215483, 217125, 199], [217125, 218372, 200], [218372, 219825, 201], [219825, 221155, 202], [221155, 221826, 203], [221826, 222653, 204], [222653, 223791, 205], [223791, 224690, 206], [224690, 225268, 207], [225268, 229795, 208]], "primary_language": ["en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]