[{"id": "548a517caa22cfb7a2a46e1c540551307d24cc85", "text": "RETURN\n\n(138)\nTo an ORDER of the HOUSE OF COMMONS, dated 23rd March, 1885;—\nFor copies of all Reports, Correspondence and Surveys, if any, in the\nDepartment of Public Works, as to the improvement of the North\nSaskatchewan River for the purpose of navigation.\n\nBy Command.\n\nJ. A. CHAPLEAU,\nDepartment of the Secretary of State,\nSecretary of State.\nOttawa, 27th April, 1885.\n\nSYNOPSIS re Improvement of North Saskatchewan River.\n\nJune 21, 1879—From C. J. Brydges, 82666—Calls attention to the absolute\nnecessity of making some immediate improvement on the\nSaskatchewan River, between Winnipeg and Edmonton.\nCost of same would not exceed $20,000.\n\nSept'ber 10, 1879—To C. J. Brydges, 51526—Whether a specification of what is\nrequired to be done can be furnished.\n\ndo 24, 1879—From S. Fleming, 82557—Reports on No. 82666, re navigation\nof river. States that if Hudson Bay Company cannot spe-\ncify exactly the work to be done, with the view of inviting\ntenders, a person will have to be sent to examine the\nriver.\n\ndo 19, 1879—From C. J. Brydges, 85531—Acknowledges letter No. 51526,\nand defines the improvements required in the navigation of\nthe river between Prince Albert and Grand Rapids.\n\nOctober 25, 1879—To C. J. Brydges, 204—Requesting him to furnish an estimate of\neach of the improvements referred to in No. 85531, and to\nnote which of them should be attended to first.\n\nApril 20, 1879—From C. J. Brydges, 889—Acknowledges No. 204. Points\nout the most important improvements. States it would be\nnecessary to have an engineer to examine the spots, to get\na correct estimate, &c.\n\nMarch 31, 1880—From Sir J. Macdonald, 5007—Transmits a letter from C. J.\nBrydges, requesting that a sum be placed in the Estimates\nfor improving river.\n\nJuly 30, 1880—To C. J. Brydges, 2833—Acknowledging No. 5007, and stating\nthat there are no funds available for improvement of river.\n\nSept'ber 28, 1880—From C. J. Brydges, 8156—Calls attention to his letter of 19th\nSeptember, 1879, No. 85531, re improvement of river, &c.\n\nOctober 4, 1880—From C. J. Brydges, 8274—Acknowledging letter of 30th ultimo,\nre Red River and Saskatchewan.\n\ndo 11, 1880—From C. J. Brydges, 8399—Acknowledging No. 4082, and states\nthat Hudson Bay Company are prepared to build piers at\nthe \"Demi-charge\" and \"Rocher Rouge,\" provided other\nimprovements, mentioned in No. 8274, will be carried out\nnext year.\nOctober 15, 1880—To Report to Council, 4115—Authority to expend $2,000.00 in dredging mouth of Red River; also to submit estimates to Parliament for execution of works at Cole's Falls and Tobin's Rapids, on Saskatchewan River.\n\ndo 15, 1880—From Order in Council, 8531—Authorizing above recommendation.\n\nNovember 10, 1880—To C. J. Brydges, 4482—Informing him of above.\n\ndo 2, 1880—From C. J. Brydges, 9136—Enquiring what has been done in this matter.\n\nJanuary 22, 1881—From Chief Engineer, 11090—Reports on improvements as prayed for by the Hudson Bay Company; states that an examination will be necessary to determine the nature, cost, &c., of works required, and recommends that $20,000.00 be placed in the Estimates for 1881-82.\n\nMarch 9, 1881—From Chief Engineer, 12509—Memorandum, re obstructions in river.\n\nJanuary 10, 1882—From C. J. Brydges, 20359—Calls attention to river improvements, for which a sum was placed in last year's Estimates.\n\nFebruary 6, 1882—From Chief Engineer, 21002—Refers to unexpended vote of $20,000.00 for improvement of river, and suggests that the same amount be provided in the Estimates for 1882-83.\n\ndo 21, 1882—From C. J. Brydges, 21641—Refers to improvements required in river, and suggests the desirability of having a certain sum placed at their disposal for expenditure on same.\n\nMarch 3, 1882—From Chief Engineer, 21847—Report on No. 21641, re improvement of river. Suggests that $18,000 out of amount voted be placed in hands of Hudson Bay Company for the performance of works.\n\ndo 11, 1882—To Report to Council, 11563—Recommending above suggestions.\n\ndo 14, 1882—From Order in Council, 22680—Concurring in above recommendation.\n\nJuly 27, 1882—To C. J. Brydges, 13716½—Informing him of above.\n\nAugust 15, 1882—From C. J. Brydges, 26519—Acknowledges No. 1.716½.\n\nSept'ber 27, 1882—From C. J. Brydges, 27964—Refers to his letter of 15th August last, in reply to departmental letter of 27th July, with reference to the removal of obstructions in the Saskatchewan River. States that Hudson Bay Company have determined to take measures to improve the navigation at the \"Demi-charge\" and \"Rocher Rouge.\"\n\nOctober 11, 1882—To C. J. Brydges, 15048—Acknowledging No. 27964.\n\ndo 16, 1882—From Chief Engineer, 28381—Reports on Nos. 26619 and 27964 from Hudson Bay Company, re improvement of River Saskatchewan, as authorized by Order in Council of 14th March last, and recommends that authority be renewed for the expenditure of the sum of $18,000 by above company, with instructions to proceed at once to procure the plant necessary for a prosecution of the works during the winter.\n\nNovember 6, 1882—To C. J. Brydges, 15542—Further authorizing him to expend $18,000 for the improvement of the river, as per letter of 27th July last, requesting that steps be taken to procure the plant necessary for the prosecution of the works during the winter.\n\nOctober 30, 1882—From Jas. Turner, 29161—Submits a report on the improvement of the Saskatchewan River, from cut-off to Edmonton. States that the Winnipeg and Western Transportation Company will co-operate in carrying out the scheme proposed. Estimated cost, $12,000.00 to $15,000.00.\nNovember 4, 1882—From Jas Turner, 29162—Encloses plan of the cut-off of the Saskatchewan, and refers to the improvement of the above river, as mentioned in his letter of 30th ult.\n\ndo 18, 1882—To Jas. Turner, 15915—Acknowledging Nos. 29161-29162.\n\ndo 20, 1882—From Jas. Turner, 29114—Acknowledges No. 15915, and encloses a letter from Manager of Winnipeg and Western Transportation, re improvement of river.\n\nDecember 4, 1882—From L. Clark, 29909—Suggests that a free ferry be established at some point between the telegraph crossing and St. Laurent, on the Saskatchewan, &c.\n\nJanuary 29, 1883—From C. J. Brydges, 31621—Refers to letter of 6th October last, re expenditure of $18,000 for improving river, and states that it was found impossible to do the work this winter, &c.\n\nFebruary 17, 1883—To J. C. Brydges, 16972—Acknowledging No. 31621, re expenditure of $18,000.00 for the improvement of river.\n\n———From Betts E. Gwymer, and others, 32878—Applications of the merchants of Prince Albert, N.W.T., for a grant to improve the Saskatchewan River.\n\nMarch 24, 1883—To Betts E. Gwymer, and others, 17540—Acknowledging No. 32878.\n\nMay 4, 1883—From C. J. Brydges, 34278—Reports arrangements made for next season's work on river, and transmits accounts for purchase of materials, &c.\n\ndo 22, 1883—To C. J. Brydges, 18519—Returning accounts for works at the Saskatchewan River, to be paid out of cheque of $5,000 sent on 19th inst.\n\nSeptember 7, 1883—From C. J. Brydges, 33195—Asks for a credit of $10,000 to pay accounts connected with removal of obstructions.\n\nDecember 26, 1883—From C. J. Brydges, 42147—Reports on work done in connection with improvement of Saskatchewan during 1883, &c.\n\nJanuary 9, 1884—To C. J. Brydges, 22784—Acknowledging No. 42147.\n\nFebruary 25, 1884—From C. J. Brydges, 44527—Re Saskatchewan River improvement—Refers to appropriation of $10,000 for this year, and states work which could be done for the above sum.\n\nMarch 7, 1884—To C. J. Brydges, 23957—Acknowledging No. 44527, for a grant of $10,000.\n\nMay 9, 1884—From Chief Engineer, 47111—Asks that $1,000.00 be placed to credit of C. J. Brydges, to defray expenses in connection with improvement River Saskatchewan.\n\nOctober 14, 1884—From C. J. Brydges, 52425—Telegram. Asks that cheque for $6,000 be forwarded to him.\n\ndo 15, 1884—To C. J. Brydges, 28324—Certificate for $6,000 issued for expenditure, re Saskatchewan River improvement.\n\ndo 16, 1884—From Auditor-General, 52472—States that he requires vouchers for previous payments to Hudson Bay Company on account of Saskatchewan River improvements, before passing application for further advances.\n\ndo 20, 1884—From C. J. Brydges, 52684—Acknowledging telegram of 15th instant, re payment of $6,000, and states that vouchers can be obtained only on completion of the work, &c.\n\ndo 27, 1884—To Auditor-General, 28453—Acknowledging Nos. 52472 and 52614, re payment of $6,000, and encloses letter from C. J. Brydges giving reasons why he cannot furnish vouchers.\n\ndo 29, 1884—From C. J. Brydges, 28502—Informing that the Auditor-General is satisfied with his explanation, and the $6,000 has been placed to his credit.\nHudson Bay Company, Montreal, 21st June, 1879.\n\nSir,—I beg to call your attention to the absolute necessity of making some immediate improvement in the condition of the River Saskatchewan, between Winnipeg and Edmonton, up to which point steamers now run.\n\nI am informed that the navigation of the Saskatchewan is very similar to that of the Missouri River, between Bismarck and Fort Benton, in the United States. On the latter river considerable improvements have been made, by the taking out of boulders, which seriously impeded vessels going up and down.\n\nThe cost of this improvement is, of course, not great.\n\nThe Hudson Bay Company, at present, have a line of three steamers, starting from the lower stone fort, on the Red River, about 16 miles below Winnipeg, passing out of the Red River into Lake Winnipeg, and going along that lake to Grand Falls, where the main Saskatchewan River falls into the lake.\n\nAt the mouth of the Red River there is a sand bar, which could be very easily removed by a moderate amount of dredging. At present, vessels drawing more than 7 feet cannot get across the bar with certainty, and as the navigation of Lake Winnipeg is, at some seasons of the year, very rough, it requires a vessel of considerable draft to navigate that lake with safety. The cost of the dredging at this point would be small.\n\nAt Grand Falls, up to which the steamer \"Colville,\" belonging to the Hudson Bay Company, runs, the falls are impassable for vessels.\n\nThe Hudson Bay Company has built a tramway about 4 miles in length, in order to get round these falls; but, of course, this involves the transhipment both of passengers and freight. At the end of the tramway, on the Saskatchewan River, the Hudson Bay Company have another boat, called the \"Northcote,\" which runs as far as Carleton House; and from Carleton House another steamer belonging to the Hudson Bay Company, called the \"Lily,\" now makes trips up to Fort Edmonton.\n\nThese steamers therefore complete the communication between Fort Edmonton and the Red River; and the Hudson Bay Company is prepared to place upon Lake Winnipeg and the River Saskatchewan such steamboat accommodation as may be necessary for the proper development of the country through which the Saskatchewan River runs; but, to enable it to do this effectually, certain improvements are required, which will not be costly, and which, if carried out, will very materially improve the condition of the navigation.\n\nThe points where these improvements are required, are as follows:\n\nFirst.—The dredging of the sand bar at the mouth of the Red River, known as the shoops channel at that river.\n\nSecond.—Removal of boulders at the following places:\n1. Roche Rouge Rapids. Steamers get up this now by the assistance of warps attached to points on the shore.\n2. Cedar Lake, Flying Post Rapids.\n3. Thoburn's Rapids. These rapids are about 3 miles long, and cause much detention in low water.\n4. Nepowewin Rapids.\n5. Cole's Falls.\n6. Rapide de La'hys.\n\nThe last three rapids, which the steamer ascends with the assistance of warps, would be much improved by the removal of boulders.\n\n7. Crooked Rapid, a short distance below Victoria.\n\nThird.—Demi-charge Rapid. This requires a pier put at the head of the rapids to which to attach the warps by means of which the vessels, with the assistance of our own engines, can get up this rapid.\n\nAt present the warp has to be fastened on shore, and requires 2,200 yards of warp. By the putting in of a pier, as suggested, the length of the warp can be reduced at least 500 yards, making a very considerable improvement in the facility of getting up these rapids.\nI am informed that the cost of completing the work which I have here referred to would not exceed $20,000, and would incalculably improve the navigation.\n\nThe Deputy Minister of the Interior and the Surveyor-General are both aware of the importance of improving the navigation in the way I now suggest; and I beg to make application that the necessary steps may be taken to accomplish what I ask, which will prove, as I have already said, of most material advantage to the country and the people living in it, who will naturally find means of ingress and egress, during the season of navigation on lake Winnipeg and the Saskatchewan.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nHon. the Minister of Public Works, Ottawa.\n\nOTTAWA, 10th September, 1879.\n\nSir,—Referring to your communication of the 21st June, calling attention to the necessity for certain improvements in the navigation of the Saskatchewan River, I am to request that you will, if possible, specify exactly the work required to be done, preparatory to the inviting of tenders for its performance.\n\nI am, Sir, your obedient servant,\n\nF. H. ENNIS, acting Secretary.\n\nC. J. BRYDGES, Esq., Hudson Bay Co., Winnipeg, Man.\n\nCANADIAN PACIFIC RAILWAY,\nOFFICE OF THE ENGINEER-IN-CHIEF, OTTAWA, 24th June, 1879.\n\nSir—Mr. Brydges' letter of the 21st inst., respecting the navigation of the Saskatchewan, and suggested improvements, has been referred to me.\n\nIn my printed report, 26th January, 1874, page 25, will be found some reference to this subject.\n\nThere can be no doubt that the river requires some improvement to render it navigable at all conditions of the water.\n\nBut it is somewhat difficult to define what is actually needed, so that the work may be carried out by tender and contract.\n\nProbably the officers of the Hudson Bay Company, who are doubtless familiar with every obstruction in the river, could specify the work to be done, with the view of inviting tenders. If they cannot do so, the only other way which suggests itself is to send some practical person to examine the river this season, and thus obtain all information necessary.\n\nAs there is no appropriation for this service, I imagine any expenditure will have to be postponed until after the next Session of Parliament.\n\nI have the honor to be, Sir, your obedient servant,\n\nSANDFORD FLEMING, Engineer-in-Chief.\n\nHon. Sir CHARLES TUPPER, K.C.M.G., Minister of Railways and Canals.\n\nHUDSON BAY COMPANY, WINNIPEG, 19th September, 1879.\n\nSir,—I am in receipt of your letter of the 10th inst., with reference to mine of the 21st June, regarding improvements in the navigation of the River Saskatchewan.\n\nIn reply to the request contained in your letter, I have to say that I have lately made personal examination of the river between Prince Albert, about 60 miles above the forks, and the outlet of the river at Grand Rapids. I have also made careful enquiries from all the parties now engaged in carrying on the navigation of the steamers, and am in a position to tell you what is required to improve the navigation of the river between Prince Albert and Grand Rapids.\n\nGoing downwards, the first point which requires attention is Cole's Falls, a very swift rapid, with a narrow channel, encumbered with rocks and boulders.\nIn going down these rapids on the 4th September, in a York boat drawing but 1 foot of water, we struck a rock at the head of the rapids, and hung there, at considerable risk, for nearly an hour. This will give an idea of the state of the water.\n\nThis place can very easily be improved by taking out a number of rocks which now obstruct the channel, and by constructing a couple of wing dams, so as to increase the volume of water in the channel itself. The rocks that require to be removed can be used in the construction of the dams, and there is ample material to form the dams to which I have referred.\n\nThe second point is at the Little Rapids, a short distance below Cole's Falls, where a few rocks require to be taken out.\n\nThe third place is Nepowewin Rapids, in which rocks require to be removed in two places.\n\nThe next point is Tobin's Rapide, a long, shallow rapid, in which there is very little water late in the season. Some rocks require to be taken out and wing dams constructed.\n\nThe next place is the Narrows, in which one rock requires to be taken out. This is on the lower side of Cedar Lake.\n\nThe sixth place is a very swift rapid, called the Demi-charge. This is at the foot of a small lake, and the current is extremely strong and rapid. The steamer cannot get up this rapid, the current being so strong, by itself, but has to be assisted by a rope, which is attached to a steam capstan on the steamer, and fastened to trees on the shore. The rope is now about a mile and a-quarter in length, as it has to be carried across the lake at the head of the rapids and fastened to trees on the opposite shore. The current, which goes down the lake, sags the rope, and it, of course, considerably increases the length required. It frequently takes a day for the steamers, by the process I have described, to go up these rapids. What is wanted here is to have a pier put down in the lake, a short distance above the head of the rapids, to which to attach the rope.\n\nThis would reduce the length of the rope to 2,000 feet, in place of a mile and a quarter, and would enable the boat to get up in one-half the time now occupied.\n\nThe seventh place is Rocher Rouge Rapids, not far from Grand Rapids.\n\nThis is a long, swift rapid, where again a rope has to be used, in order to assist the steamer up. The placing of a pier near the head of the rapids would reduce the length of the rope required from 3,000 to 2,000 feet.\n\nThe construction of these piers would not be at all costly, there being both timber and stone on the ground, in the immediate vicinity of the rapids.\n\nThe removal of rocks at the other five places can be done at comparatively small cost, by using barges, which can be built in the country, and placing upon them cranes worked by steam power. A great deal of work of this kind has been done on the Missouri River, between Bismarck and Fort Benton.\n\nIf the works I have specified, between Prince Albert and Grand Rapids, were done, it would give a depth of water, in the lowest stage, of 3½ feet. At the present moment there is barely 2 feet of water at the lowest places, and even less at Cole's Falls.\n\nBy removing these obstructions, navigation could be carried on from the 1st June to the 1st October, whilst now it is not safe to run after the first half of August.\n\nThere is a large settlement at Prince Albert, and also large settlements beyond it, which require the means of navigation both for passengers and freight.\n\nFurther works will be required to be done between Prince Albert and Edmonton, but not having personally inspected this portion of the river, I cannot give as precise information in regard to it as the part I have been over.\n\nThe Hudson Bay Company now have two steamers running between Grand Rapids and Edmonton. They can make from eight to ten trips a year, and in addition to doing the company's own work, can accommodate all that is required by the public. If the growth of the trade requires more steamers the company is prepared to put them on.\nIn the early part of August one of the steamers, the \"Lily,\" in going from Edmonton to Carleton, struck on a rock and was very considerably damaged, owing to the lowness of the water.\n\nAt Grand Rapids, about two miles above the mouth of the Red River, there is a long rapid, two miles in length, which is a complete barrier to navigation.\n\nTo overcome this, the Hudson Bay Company have built a tramway three miles and a-half in length, over which goods are transported between the river steamers and the one which navigates Lake Winnipeg between Grand Rapids and the Red River. This steamer is called the \"Colville,\" and can make a trip a week, supplying the river steamers with all they can carry. She cannot be built any larger, on account of a bar which exists at the mouth of the Red River. This steamer draws, according to load, from 5 to 7 feet of water. The channel is here very crooked, being something like the shape of the letter \"S.\" It is marked out by buoys placed there by the Hudson Bay Company.\n\nThe \"Colville,\" when she has a full load to take from the Red River to Grand Rapids, a schooner has to accompany her with a part of the cargo across the bar, when the freight has to be transferred to the steamer. This, of course, involves very great waste of time and expense. What is wanted is the dredging of this bar, which can readily be done at a moderate cost, and by which the depth of water could easily be increased to about 9 feet.\n\nThe Red River has three outlets into the lake; one of these should be closed, which could be done at small cost, and this would materially increase the volume of water passing through the dredged channel.\n\nI observe that a lightship is now advertised for by the Marine Department, to be placed at the mouth of the Red River.\n\nI do not believe that this is at all necessary or wise. A lightship there in heavy weather, say a gale from the north-west, would not probably be able to live at her post, and the channel is so crooked that I do not see how the lightship would enable the steamer to get through in safety. What is wanted is a beacon light, to be placed at the mouth of the river to show where the entrance is.\n\nI am satisfied that a lightship would be useless, an opinion in which the captain of the \"Colville\" entirely concurs.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES, Land Commissioner.\n\nF. H. ENNIS, Esq., Secretary Public Works Department, Ottawa.\n\nOTTAWA, 25th October, 1879.\n\nSir,—Referring to your letter of the 19th September, on the subject of improvements required in the navigation of the Saskatchewan River, I am directed to request that you will be good enough to furnish this Department with an estimate, in so far as may be practicable, of the cost of each of the improvements to which you referred, and also be good enough to say which of the proposed improvements you deem it desirable should receive the first attention.\n\nI am, Sir, your obedient servant,\n\nS. CHAPLEAU, Secretary.\n\nC. J. BRYDGES, Esq., Hudson Bay Company, Winnipeg, Man.\n\nHUDSON BAY COMPANY, MONTREAL, 12th November, 1879.\n\nSir,—I beg to acknowledge the receipt of your letter of the 25th ult., addressed to me at Winnipeg, and which has been sent to me here.\n\nThe points most important to improve the navigation of the Saskatchewan River are, first: The dredging of the bar at the entry of Red River into Lake Winnipeg. The next most important is the placing of a pier at the head of the Demi-charge Rapids. The next important place is the building of wing walls and the removal of boulders in Tobin's Rapids, and the next most important is the removal of boulders at Cole's Falls, and building wing dams there.\nThese are what would be most desirable to proceed with first, although in point of fact the river will not be satisfactory until all the matters mentioned in my letter of the 19th of September are attended to.\n\nIt is extremely difficult for me to give an estimate of the cost of the different works, but I cannot think that the figures I have already given would prove to be wide of the mark.\n\nIn order to get a correct estimate, it would be necessary to have an engineer examine the spots, and this could hardly be done now, until next spring; but I repeat that I am entirely satisfied a vast improvement could be made in the navigation of the river if the works mentioned in my letter of the 19th September were carried out.\n\nI think it right to say that from all the information which reaches me there is no doubt that a very considerable and increasing traffic will be found to arise on the Saskatchewan River, and that it will be a most powerful aid in the development of the settlement of the North-West country.\n\nI am, Sir, your obedient servant,\n\nC. J. BRYDGES, Land Commissioner.\n\nS. CHAPLEAU, Esq., Department of Public Works, Ottawa.\n\nOTTAWA, 31st March, 1880.\n\nMy Dear Macdonald,—Mr. Langevin tells me that there is nothing in the Estimates for any improvements in the Saskatchewan River. I earnestly ask you to reconsider this. It is of immense importance to the settlements at Prince Albert and up to Edmonton. The river at present is in a most dangerous state for steamers, and its usefulness greatly lessened. Cole's Falls and Tobin's Falls become impassable when the water is low. It makes a serious difference in the time a steamer takes to go up, and seriously lessens the number of trips that can be made during each season. I came down the river the first week in September, last year, in a boat drawing only 1 foot, and we struck on a rock in Cole's Falls. The water was so low that a fortnight before the steamer was unable to get up the river at that place.\n\nI know you want to have the river navigated regularly, but this cannot be done until the bad places are attended to. There is full information in the Public Works Department as to what is wanted. I hope you will have this matter reconsidered, in the interests of the development of the North-West.\n\nYours very truly,\n\nC. J. BRYDGES.\n\nRight Hon. Sir John A. Macdonald.\n\nOTTAWA, 30th July, 1880.\n\nSir,—I have the honor to inform you that your letter of the 31st March last, respecting the necessity for the improvement of the Saskatchewan River, and which was addressed to the Right Hon. Sir John A. Macdonald, has been transferred to this Department.\n\nIn reply, I am directed by the Hon. the Minister to state that there are not, at present, any funds at his disposal which could be rendered available for that purpose.\n\nI have the honor to be, Sir, your obedient servant,\n\nS. CHAPLEAU, Secretary.\n\nC. J. BRYDGES, Esq., &c., &c., No. 4 Peter Street, Montreal.\n\nMONTREAL, 28th September, 1880.\n\nMy Dear Mr. Langevin,—I want to ask your serious attention to a matter which I discussed with you last year, but which, unfortunately, you were not able to deal with as you had hoped to do.\n\nI refer to the improvements necessary to be made to make a satisfactory navigation on the Saskatchewan River.\nI addressed a letter to the Secretary of your Department on the 19th September, 1879, which fully deals with all the matters which are necessary to be done to put the navigation of the river in a satisfactory position. I also had a correspondence, in the month of January last, with Sir Alexander Campbell, the result of which was that I gave him considerably reduced rates, both for passengers and freight, on the Saskatchewan River, by our boats, for the general public as well as for Government supplies.\n\nWe have, in accordance with the understanding I then came to, thrown our boats open to the public, and during the present season have carried a considerable number of passengers and very considerable quantities of freight. The Indian Department has been very much benefitted by these means of transport, as has also the general public; but it is now quite clear that much further accommodation is required, owing to the increasing number of people in the country, and that it will be necessary to place additional boats upon the river to meet the demands that are now arising.\n\nWe are quite ready to put two additional boats on, and to build them during the coming winter, provided we can have an assurance that the river will be put into such a condition as will enable the boats to run with safety.\n\nWhat is wanted to give part of the accommodation that is necessary is an additional boat on Lake Winnipeg. She would require to be a good deal larger than the boat which is now there, and in order to enable her to navigate the lake in bad weather, she must draw more water.\n\nThis cannot be done until the bar at the Red River is dredged; as no boat drawing more than between 5 and 6 feet of water can now get across the bar. A very moderate expense would dredge this bar out, so that a boat could get across drawing 10 feet of water.\n\nWe are prepared at once to proceed with the construction of the necessary boat and to have her ready for next year's work, provided the dredging required to give the necessary depth of water will be undertaken by the Government.\n\nI am sure you will find that there will be no difficulty in contracting with parties to provide a dredge to do the work at so much per yard, and I am also clear that there will be work for a dredge in other places on those rivers, which will make it quite worth a contractor's while to put a dredge on that river.\n\nThe works on the St. Lawrence by the Harbour Commissioners of Montreal and the enlargement of the Welland Canal, as well as other works of a similar kind, are approaching completion, and a considerable number of dredges will be available for this work at the opening of next season.\n\nWith this additional boat on Lake Winnipeg, it will be necessary to put an additional steamer of large capacity on the Saskatchewan River; and we are prepared to build this boat, and have her ready for next year's work, if we can have an assurance that certain work necessary for her safe passage will be undertaken by the Government.\n\nThe principal works required are piers at the head of two rapids south of Cedar Lake, one called the \"Rocher Rouge\" and the other the \"Demi-charge.\"\n\nThese piers would not be expensive, but would enormously add to the facility of getting up the rapids, reducing the time necessarily occupied by at least a half, and very materially, indeed, reducing the very great risk which is now run.\n\nThe other works necessary are the building of wing dams and the removal of boulders at Cole's Falls and at Tobin's Rapids. At both these places great risk is run, and in low water it is quite impossible to ascend them.\n\nI have mentioned the principal works which are necessary.\n\nThere are at some other points boulders which it would be of great advantage to the navigation to have removed.\n\nThey are all specified in my letter of 19th September, last year.\n\nAs I have said, we are ready to build these two additional boats, and have them ready for next season's work, if the Government will take the necessary steps for improving the navigation of the river in the way I have specified.\nWe should then have a fleet of five steamers running between Red River and Edmonton, and we should be able to employ one of these steamers, whenever occasion required, in navigating the south branch of the Saskatchewan, provided any business arose requiring the services of a steamer.\n\nWe are also prepared, in the event of the business growing beyond the capacity of the five steamers, to build other steamers and place them upon the two rivers.\n\nThe capital involved in these steamers will be very considerable, but we should not be justified in expending it unless we can have an assurance that the Government will do what is necessary to make the navigation fairly safe.\n\nI have specified already what is required to be done in the event of the Government undertaking the work of improving the rivers.\n\nWe shall be prepared, in addition, to reduce our rates, both for passengers and freight, as much as possible, and lower than the figures which I have given in my correspondence with Mr. Campbell.\n\nI think you are aware that we have already a tramway at Grand Rapids, enabling us to carry passengers and freight round the rapid, upwards of four miles in length, and which is quite impassable for any steamer.\n\nThe nature of the navigation requires boats to be built much stronger than is usual on western rivers, and if we build the two steamers we are now ready to proceed with, it will involve, with other works in connection with the tramway, an outlay of about $100,000.\n\nIf these boats are to be built this coming winter, which is the only time that they can be built, the orders for them will have to be given within the next thirty days.\n\nI have therefore to beg that you will give this matter your careful consideration, and to let me know whether the Government will be prepared to undertake the works necessary to improve the navigation.\n\nIf you will do this, the company will have the boats ready, as I have said, for next season; but, without the improvements which I have specified in the navigation, it will be quite impossible for them to undertake the risk of putting so much money in boats which are liable to be wrecked every time they pass over the obstructions which now exist.\n\nBelieve me yours very truly,\n\nC. J. BRYDGES.\n\nHon. H. L. Langevin, C.B., &c., &c., Ottawa.\n\nHudson Bay Company, Montreal, 11th October, 1880.\n\nSir,—I am in receipt of your letter of the 9th instant, enquiring, on behalf of the Hon. the Minister of Public Works, whether the Hudson Bay Company would be prepared to build the piers at the Demi-charge and Roche Rouge Rapids, on the Saskatchewan River, if the Government were to undertake the three other improvements asked for in my letter of the 4th instant.\n\nIn reply, I beg to say, for the information of the Minister, that this company has already expended very considerable sums in aiding the improvement of the navigation between the Red River and Edmonton, at the head of navigation on the Saskatchewan River. They have, at considerable yearly expense, placed buoys to mark the tortuous channel at the mouth of the Red River, which have to be removed every fall and replaced in the spring—in the latter case, at such points as the change in the form of the bar proves, upon examination, to be necessary.\n\nThey have also built commodious wharves and warehouses near the mouth of the Saskatchewan River, and below the Grand Rapids, and also higher up, after the rapids have been passed. Between those two points, a distance of about 4 miles, they have, at very considerable expense, constructed a tramway, which is used for communication between the two vessels—one navigating Lake Winnipeg and the other proceeding up the Saskatchewan River.\n\nThis tramway, which cost a considerable amount to construct, involves very considerable yearly expense for maintenance and working.\nUnder these circumstances, it would only seem reasonable that the Government should carry out the works which are necessary to improve the navigation of the river, and which works have been specified in the letters which I have lately addressed to the Minister.\n\nIn order, however, to meet, as far as possible, the wishes of the Government, I am prepared to say, on behalf of the Hudson Bay Company, that provided the Government will undertake, during next year, to dredge a channel to a proper depth at the mouth of the Red River, and to execute the works at Cole's Falls and Tobin's Rapids, necessary to enable steamers to pass with comparative safety through those very serious obstructions, the company will undertake to place the necessary piers at Demi-charge and Rocher Rouge Rapids, to aid in the ascent of those dangerous rapids.\n\nAs I have already advised the Minister, this company is prepared to place two additional boats upon Lake Winnipeg and the Saskatchewan River (one on each), to accommodate the increasing trade, provided the obstructions which now exist are removed.\n\nTo do this the company will have to expend a sum of not much, if any, less than $100,000, an expenditure which they would not feel justified in incurring unless the great risks which are now run in navigating both Lake Winnipeg and the Saskatchewan River are diminished, as far as possible, by the removal of the obstructions which I have before referred to.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES, Land Commissioner, H. B. Co.\nS. CHAPLEAU, Esq., Secretary Department Public Works, Ottawa.\n\nOTTAWA, 14th October, 1880.\n\nMEMORANDUM.—The undersigned has the honor to submit:\n\nThat the Hudson Bay Company have drawn the attention of his Department to the necessity for certain improvements being made in order to the satisfactory navigation of the River Saskatchewan and the Red River, on which streams the said company have in operation vessels for the accommodation of freight and passenger traffic.\n\nThat owing to the increasing population of the country further accommodation of this nature will have to be provided to meet the demands now arising; and the company state their readiness to build, during the coming winter, and put on those waterways next season, two additional steamers, one to be placed on the Saskatchewan—provided assurance can be given that the river will be so improved as to ensure, at as early a date as possible, the safe running of their vessels—and the other on Lake Winnipeg.\n\nThat the steamer proposed for Lake Winnipeg will, to properly meet the requirements of the trade and to navigate the lake in bad weather, need to be much larger, and of greater draught, than the one now in use, and to enable such a vessel to enter the Red River the bar at the mouth of that stream, the present channel through which is a very tortuous one, will require to be dredged—the depth of water thereon now averaging only about six feet, whereas the proposed vessel will require a depth of over 10 feet.\n\nThat it appears, from the statements of the company, that the principal works required on the Saskatchewan are the construction of piers, to aid in the ascent at the heads of two rapids south of Cedar Lake, known as the Rocher Rouge and the Demi-charge; the building of wing dams at Cole's Falls and Tobin's Rapids, and the removal of boulders from those latter points.\n\nThat the company have expressed their willingness to construct, at their own cost, the piers referred to, conditionally that the Government shall execute the remainder of the above-mentioned works.\n\nThat the company are prepared, in the event of those works of improvement being carried out, and should the business grow beyond the capacity of the five steamers which they would then have in operation between Red River and Edmon-\nton, at the head of the Saskatchewan navigation, to build others, and, in addition, to reduce their rates, both for passengers and freight, as much as possible.\n\nThe undersigned therefore begs to recommend that he be authorized to expend the sum of $2,000 to straighten and dredge, to a proper depth, the channel at the mouth of the Red River—one-half of the cost to be charged to the appropriation for \"Harbors and Rivers, General Repairs, Manitoba,\" and the other moiety to that for \"Miscellaneous Works, not otherwise provided for;\" and, further, that authority be granted for the preparation and submission to Parliament, at its next Session, of estimates for the execution of the works at Cole's Falls and Tobin's Rapids, on the Saskatchewan River.\n\nRespectfully submitted,\n\nHECTOR L. LANGEVIN, Minister of Public Works.\n\nCOPY of a Report of a Committee of the Honorable the Privy Council, approved by His Excellency the Governor General in Council on the 15th October, 1830.\n\nOn a memorandum, dated 14th October, 1880, from the Hon. the Minister of Public Works, submitting that the Hudson Bay Company have drawn the attention of his Department to the necessity for certain improvements being made in order to the satisfactory navigation of the River Saskatchewan and the Red River, on which streams the said company have in operation vessels for the accommodation of freight and passenger traffic.\n\nFor the reasons stated in his memorandum, the Minister recommends that he be authorized to expend the sum of $2,000 to straighten and dredge, to a proper depth, the channel at the mouth of the Red River—one-half of the cost to be charged to the appropriation for \"Harbors and Rivers, General Repairs, Manitoba,\" and the other moiety to that for \"Miscellaneous Works, not otherwise provided for,\" and, further, that authority be granted for the preparation and submission to Parliament, at its next Session, of estimates for the execution of the works at Cole's Falls and Tobin's Rapids, on the Saskatchewan River, mentioned in his memorandum.\n\nThe Committee submit the above recommendation for Your Excellency's approval.\n\nCertified.\n\nJ. O. COTE, Clerk Privy Council.\n\nHon. the Minister of Public Works.\n\nOTTAWA, 20th November, 1880.\n\nSir,—Referring to the correspondence had between yourself and this Department, relative to the necessity for certain improvements being made in connection with the navigation of the River Saskatchewan and the Red River, and to the proposal of the Hudson Bay Company, to build during the coming winter, and place on those waterways next season, two additional steamers, and construct, at their own cost, the piers required at the heads of Roche Rouge and Demi-charge Rapids, on the Saskatchewan, provided the Government will execute certain other works stated to be necessary.\n\nI am directed by the Hon. the Minister to inform you that an Order of the Hon. the Privy Council has been issued, authorizing the expenditure, by this Department, of the sum of $2,000, to straighten and dredge to a proper depth the channel at the mouth of the Red River.\n\nAuthority has also been obtained for the preparation and submission to Parliament, at its next Session, of estimates for the construction of wing dams and the removal of boulders at Cole's Falls and Tobin's Rapids, in the Saskatchewan.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nC. J. BAYDGE, Esq., Hudson Bay Company's Office, Montreal.\nHudson Bay Company, Montreal, 11th October, 1880.\n\nMy Dear Macdonald,—I have been in correspondence, written and oral, with Mr. Langevin, about the Saskatchewan River. We throw our boats open this year, and have carried a considerable number of passengers and a large quantity of freight, both for the Indian Department and the public. But more is required, and especially in view of the speed of construction of the Pacific Railway. We are prepared to build this winter two additional steamers of large capacity, and have them ready for next season, if the Government will do what has already been practically promised, in the way of improving the navigation of the rivers. It will cost us about $100,000—one steamer for Lake Winnipeg and one for the main river. That would give us a fleet of five steamers, and enable us to put one on the south branch as soon as necessary, and give, what is now not possible, reasonable regularity of service, and full accommodation for the business, both for passengers and freight.\n\nBut we do not run the risk without the navigation is improved in the way Mr. Langevin knows all about.\n\nThe risk is too serious at present.\n\nMr. Langevin is, I believe, ready and anxious to do what is so clearly necessary and will be so abundantly useful, but says it needs action by the Council, which is the reason of my writing this letter to you.\n\nUnless built this winter, the boats cannot be available for next season. Will you speak to Mr. Langevin about this, and let me know, so that we may contract without delay for the two steamers.\n\nYours very truly,\n\nC. J. Brydges.\n\nRight Hon. Sir John A. Macdonald.\n\nHudson Bay Company, Winnipeg, 2nd November, 1880.\n\nMy Dear Mr. Langevin,—I have been hoping to hear from you about the required improvements in the Saskatchewan River. The time has now arrived when contracts should be entered into for the river steamer, if she is to be ready for next year's work. The board of this company has instructed me to say to you that they are prepared to go on with this steamer at once, if you will undertake to do what is necessary to make the navigation reasonably safe, by the measures which have already been discussed between us. Will you therefore let me know, with as little delay as possible, as there is really no time to be lost?\n\nAs the dredging of the bar at the mouth of the Red River cannot be done until next summer, it is impossible, of course, to build a boat drawing 10 feet of water whilst there is barely 7 feet on the bar.\n\nIt is impossible, therefore, to do anything this winter, as to a second steamer for Lake Winnipeg. It is intended, therefore, to increase the capacity of the present steamer, by building at least one barge, which she will tow.\n\nThis plan is adopted successfully on Lake Superior, and will more than double the quantity of freight which the present steamer can take at each trip. She has power enough to handle two barges, if required.\n\nWhen the bar is dredged and sufficient depth of water provided, the question of building another steamer will, of course, be carefully considered, should the growth of traffic prove to be more than the present steamer and attendant barges can handle.\n\nBut even with the present steamer, there is not sufficient water on the bar to enable her always to cross it fully loaded.\n\nI have already explained to you the great expense which this company has incurred in the opening up of steamboat communication between here and Edmonton, and looking at the great risks which they have run, and are now running every year, it is not unreasonable to ask the Government to do what they are doing for so many other rivers, viz., improve the navigation of the Saskatchewan, which is of so much importance to the settling of that part of the country not to be served by the line of the Pacific Railway.\nPray write, and, if possible, wire me that the Government will provide in the next Estimates for this important matter.\n\nBelieve me yours very truly,\n\nC. J. BRYDGES.\n\nHon. H. L. Langevin, C.B., Ottawa.\n\nOTTAWA, 22nd January, 1881.\n\nSir,—Under date 21st June, 1879, Mr. C. J. Brydges, Land Commissioner of the Hudson Bay Company, called attention to the condition of the River Saskatchewan up to Edmonton, to which point the steamers of his company now run. He states that this service is performed by three steamers, one plying between Lake Winnipeg and Grand Falls, which are impassable for vessels. Here the company has built a tramway about four miles in length, to overcome the falls, which involves the transhipment of both passengers and freight.\n\nA second steamer runs from the head of the falls to Carleton House, while the third completes the journey to Fort Edmonton. Mr. Brydges further states that his company is prepared to place upon Lake Winnipeg and the Saskatchewan such steamboat accommodation as may be necessary for the proper development of the country through which the Saskatchewan runs; but to enable it to do this effectually, certain improvements are required, which, if carried out, will very materially improve the condition of the navigation.\n\nMr. Brydges refers, first, to the necessity of dredging the bar at the mouth of the Red River. This has formed the subject of a separate report submitted to you on 23rd December last (No. 10337).\n\nSecond.—The removal of boulders at the Rocher Rouge Rapid, up which steamers are now worked by means of warps attached to points on the shore.\n\nThird.—The improvement of the Flying Post Rapids; Cedar Lake.\n\nFourth.—Tobin's Rapids, which are about 3 miles in length, and are the cause of much detention during low water.\n\nFifth.—Nepowewin Rapids.\n\nSixth.—Cole's Falls.\n\nSeventh.—Rapide de La'hy.\n\nAt the last three mentioned places the channel is obstructed by boulders, and the steamer has to ascend with the assistance of warps.\n\nEighth.—Crooked Rapid.\n\nNinth.—The Demi-charge Rapid. At this place Mr. Brydges states a pier is required at the head of the rapids, to which to attach the warp to assist these steamers in their passage up. At present 2,200 yards of warp is required, and if a pier be built this length can be reduced to 1,700 yards.\n\nMr. Brydges places the cost of these improvements at $20,000.\n\nIn a letter dated 19th September, 1879, Mr. Brydges describes Cole's Falls as a very swift rapid, with a narrow channel, encumbered with rocks and boulders. He states improvements can very easily be effected by the construction of two wing dams, so as to increase the volume of water in the channel, and by the removal of a number of rocks which can be used in the construction of the dams.\n\nTobin's Rapids are very shallow, with very little water late in the season. Here he suggests wing dams should be constructed, and some rocks removed from the channel.\n\nThe Demi-charge Rapid is at the foot of a small lake and the current is extremely swift and strong. On the up passage the steamer has to be assisted by a rope about 1½ miles in length, which has to be carried across the lake at the head of the rapids and fastened to trees on the shore, and it frequently takes a day for the steamer to warp itself up the rapids.\n\nIn his letter of the 4th October, 1880 (No. 8274), Mr. Brydges again reverts to the construction of the piers at the Rocher Rouge and Demi-charge Rapids, which he thinks would probably cost from $5,000 to $6,000 apiece, but he is unable to estimate\nthe cost of the wing dams and the removal of boulders at Cole's Falls and Tobin's Rapids.\n\nOn 11th October, 1880, Mr. Brydges, in replying to letter (No. 4082) from this Department, asking whether the Hudson Bay Company would build the piers at the Demi-charge and Rocher Rouge if the Government undertook the other improvements asked for by him, states that his company has already expended very considerable sums for the improvement of the navigation between Red River and Edmonton, at the head of navigation of the Saskatchewan; have also, at a considerable yearly expense, placed buoys to mark the tortuous channel at the mouth of the Red River; have built commodious wharves and warehouses near the mouth of the Saskatchewan, below the Grand Falls, and also higher up, after the rapids have been passed; and also a tramway, four miles in length, to overcome these rapids, which involves a yearly expense for maintenance and working, and although under the circumstances thus stated it would only seem reasonable that the Government should carry out the work for the improvement of the navigation of this river, yet, on behalf of his company he is prepared to say that, provided the Government will undertake, during the next year, to dredge a channel to a proper depth at the mouth of the Red River and to execute the works at Cole's Falls and Tobin's Rapids, his company will undertake the works required at the Demi-charge and Rocher Rouge.\n\nUnder date 15th October, 1880 (No. 3531), an Order in Council was passed directing that estimates be prepared for the execution of the works at Cole's Falls and Tobin's Rapids, and submitted to Parliament at its next (the present) Session.\n\nAs before stated, the works at these places consist in the building of wing dams and the removal of boulders from the channel; and, further than this, there is not any information to enable me to estimate the amount required for the execution of these works, and it will be absolutely necessary that a thorough examination be first made to determine the nature, position and extent of what is required for the improvement of the river at the points named, and their ultimate cost.\n\nAs works might be proceeded with before 30th June, 1882, I beg leave to recommend that the sum of $20,000 be placed in the estimates for 1881-82 towards their construction.\n\nI have the honor to be, Sir, your obedient servant,\n\nHENRY F. PERLEY, Chief Engineer.\n\nF. H. Ennis, Esq., Secretary Department Public Works.\n\nOTTAWA, 9th March, 1881.\n\nTHE SASKATCHEWAN.\n\nThe distance from Lake Winnipeg to Edmonton by the river is, roughly, 850 miles.\n\nInformation relative to this river will be found in the report of the Department for 1880 (App., p. 65).\n\nAs it can only be navigated by boats of a light draught of water, it is inferred that there is not more than from 3 to 4 feet at the points most obstructed.\n\nH. F. P.\n\nHUDSON BAY COMPANY, MONTREAL, 10th January, 1882.\n\nMy Dear Sir Hector,—You never did anything about the improvements on the Saskatchewan River, for which a sum was put in last year's Estimates.\n\nAdditional steamers are being built this winter for that river, and there is every prospect of a large traffic between Edmonton and the forks of the Saskatchewan.\n\nI was very much disappointed that nothing was done last year. I felt sure that you would have carried out your promised programme.\n\nYours very truly,\n\nC. J. BRYDGES.\n\nSir H. L. Langevin, K.C.M.G.\nCHIEF ENGINEER'S OFFICE, OTTAWA, 6th February, 1882.\n\nSir,—At the last Session of Parliament the sum of $20,000 was voted for expenditure on the improvement of the River Saskatchewan, for expenditure up to 30th June, 1882.\n\nAlthough an engineer of the Department was detailed to examine and report upon this river, especially at Cole's Falls and Tobin's Rapids, he was, owing to his examination of Lake Manitoba occupying the whole of his time, unable to do so, and consequently not anything has been done towards the expenditure of the amount voted.\n\nI therefore suggest that as the sum of $2,000 may be required before 30th June next, to cover the cost of an examination, the sum of $18,000 be carried forward as a revote, and $2,000 placed as a new vote, or a total of $20,000, in the Estimates for 1882-83.\n\nI have the honor to be, Sir, your obedient servant,\n\nHENRY F. PERLEY, Chief Engineer.\n\nF. H. ENNIS, Esq., Secretary Department Public Works.\n\nHUDSON BAY COMPANY, WINNIPEG, 21st February, 1882.\n\nMy Dear Sir Hector,—I have had some conversation with Mr. Perley about the improvements required in the Saskatchewan River, and the urgent necessity of the work being done without delay. There will be a considerable increase in the number of boats on that river during the present year, and every prospect of a continued increase for some years to come.\n\nWhen the Pacific Railway reaches the south branch, it will give a further stimulus to steamboat operations on both branches of the river.\n\nI do not quite see how a contract could be made for the necessary work. The surrounding circumstances would render such a course extremely difficult, if not impossible, at present. It has been suggested that the officers of this company, residing in the vicinity of the places where the work has to be done, and being in a position to deal with the sparse population in a way which no one else could do, might be able to take charge of the work and execute it. They know better than a stranger could what is wanted, and would utilise the labor to be found in a way that no one else probably could. We would not, of course, enter into a contract to do any particular work for a specified sum, but if you thought it desirable to place a certain sum at our disposal, we would endeavor to expend it in the most useful way, and in the most economical manner that the circumstances would permit.\n\nPray understand that we have no desire to incur the labor and responsibility of undertaking such a duty, but if you think it desirable to adopt any such course, we should be ready to aid your views to the best of our power.\n\nYours very truly,\n\nC. J. BRYDGES.\n\nSir Hector Langevin, C.B., Ottawa.\n\nOTTAWA, 3rd March, 1882.\n\nSir,—With reference to the letters from the Hudson Bay Company in re-improvements in the River Saskatchewan, I beg leave to recommend that the expenditure of the amount voted by Parliament be placed in the hands of that company, as they have, as stated in letter No. 21641, those in their employ who better know, than any others, where the improvements are most required, and have at their command both men, tools and materials for their execution.\n\nI would suggest that the amount to be expended by this company be limited to $18,000, leaving $2,000 of the vote to cover the cost of inspection by an officer of this Department.\n\nI have the honor to be, Sir, your obedient servant,\n\nHENRY F. PERLEY, Chief Engineer.\n\nF. H. ENNIS, Esq., Secretary Public Works Department.\nOTTAWA, 11th March, 1882.\n\nMEMORANDUM.—The undersigned has the honor to submit:\n\nThat in the Estimates for 1881-82 Parliament, at its last Session, voted the sum of $20,000 for the improvement of the Saskatchewan River.\n\nThat in view of the rapidly increasing traffic on that river, it is deemed advisable that the proposed works of improvement be proceeded with at once.\n\nThat in urging the early commencement of those works, the Hudson Bay Company have represented to the Government that at present it would be extremely difficult, if not impossible, to have them executed by contract.\n\nThat the company suggest that its officers \"residing in the vicinity of the places where the work has to be done, and being in a position to deal with the sparse population in a way which no one else could do, might be able to take charge of the work and execute it. They know better than a stranger could what is wanted, and would utilize the labor to be found in a way that no one else probably could.\"\n\nThe company does not offer to enter into a contract to do any particular work for a specified amount, but is willing, if a sum be placed at its disposal, to endeavor to expend it in the most useful way and in the most economical manner that the circumstances will permit.\n\nThat the company has at its command men, tools and materials for the execution of the proposed work.\n\nThe undersigned recommends that $18,000 of the grant mentioned be placed in the hands of the Hudson Bay Company, to be expended in improving the river—the balance of $2,000 to be retained to cover the cost of inspection by an officer of this Department.\n\nRespectfully submitted.\n\nH. L. LANGEVIN, Minister of Public Works.\n\nCopy of a Report of a Committee of the Honorable the Privy Council, approved by His Excellency the Governor General in Council on the 14th day of March, 1882.\n\nOn a memorandum, dated 11th March, 1882, from the Minister of Public Works, submitting that in the Estimates for 1881-82 Parliament, at its last Session, voted the sum of $20,000 for the improvement of the River Saskatchewan.\n\nThat in view of the rapidly increasing traffic on that river, it is deemed advisable that the proposed works of improvement be proceeded with at once.\n\nThat in urging the early commencement of those works the Hudson Bay Company has represented to Government that at present it would be extremely difficult, if not impossible, to have them executed by contract.\n\nThat the company suggests that its officers, \"residing in the vicinity of the places where the work has to be done, and being in a position to deal with the sparse population in a way which no one else could do, might be able to take charge of the work and execute it. They know better than a stranger could what is wanted, and would utilize the labor to be found in a way that no one else probably could.\"\n\nThe company does not offer to enter into a contract to do any particular work for a specified amount, but is willing, if a sum be placed at its disposal, to endeavor to expend it in the most useful way and in the most economical manner that the circumstances will permit.\n\nThat the company has at its command, men, tools and material for the execution of the proposed works.\n\nThe Minister therefore recommends that eighteen thousand dollars ($18,000) of the grant mentioned be placed in the hands of the Hudson Bay Company, to be expended in improving the river, such improvements to be first approved by an officer of his Department, appointed for the purpose; the balance of two thousand dollars ($2,000) to be retained to cover cost of supervision.\n\nThe Committee submit the above recommendation for Your Excellency's approval.\n\nCertified.\n\nJ. O. COTÉ, Clerk Privy Council.\n\nHon. the Minister of Public Works.\nOTTAWA, 27th July, 1882.\n\nSir,—Having reference to your letter of the 21st February last, respecting the improvements required on the Saskatchewan River, I am directed to inform you that in view of your suggestions in the matter the Hon. the Minister has obtained the authority of Council to place the sum of $18,000 in the hands of your company, for the purpose of improving that river at Tobin's Rapids and Cole's Falls, on the understanding that the company shall bear the cost of the improvements at the Demi-charge and the Rocher Rouge—such improvements to be first approved by an officer of this Department.\n\nMr. Thomas Guerin, C.E., has been appointed to the charge of the works to be done on this river, and he will be directed to call upon you immediately after his arrival at Winnipeg.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary, per A. G.\nC. J. BRYDGES, Esq., Land Commissioner, Hudson Bay Co., Winnipeg.\n\nHUDSON BAY COMPANY, LAND DEPARTMENT,\nWINNIPEG, 13th August, 1882.\n\nSir,—Your letter of the 27th ult. came duly to hand, and some little time afterwards Mr. T. Guerin, C.E., called upon me, and I discussed the matter fully with him. I explained to him that in consequence of no steps having been taken by the Government, in regard to dredging of the mouth of the Red River, and the removal of the obstructions at Cole's Falls and Tobin's Rapids, that this company had delayed taking any action in regard to the rapids at Rocher Rouge or the Demi-charge, until the Government were prepared to take action in the matter. I also explained to him that the rapid construction of the Canadian Pacific Railway was going to largely affect the question of steamboat navigation on the Saskatchewan River.\n\nIt is expected that the Canadian Pacific Railway will touch the South Saskatchewan early next year, and in time for navigation next season. In that case it is more than probable that the steamers on the river will entirely change the direction in which they will run.\n\nThere is no country available for settlement after leaving Grand Rapids, until the Pas is reached, and the great probability, therefore, is, that steamers will run to and from the crossing of the south branch of the Saskatchewan by way of the forks of the two rivers, and then up the main river to Edmonton, and down stream as far as the Pas and Cumberland House. If this proves to be the case, as I have no doubt it will, it will necessitate the removal of obstructions at Cole's Falls and Tobin's Rapids, but will render unnecessary any expenditure at Rocher Rouge or Demi-charge. Under these circumstances I thought it desirable to place you in possession of all the facts, for the information of the Minister, before taking any steps in the matter, and I shall therefore wait until I hear from you, before doing anything in the way of carrying out the Minister's wishes, as expressed in your letter.\n\nI may add that the steamboat company in which the Hudson Bay Company holds a controlling interest has placed this year three additional steamers on the Saskatchewan River, and has now five steamers working on that river.\n\nThe growth of the trade appears to be so rapid that it will be necessary to provide additional steamers next season.\n\nThis will render the removal of the obstructions at Cole's Falls and Tobin's Rapids still more indispensable, and will ultimately require further work on the south branch of the Saskatchewan; as soon as the passage of two or three steamers along that river has demonstrated what will be required to make navigation upon it as perfect as possible.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES, Land Commissioner.\n\nF. H. ENNIS, Esq., Secretary Department of Public Works, Ottawa.\nHudson Bay Company, Land Department,\nWinnipeg, 27th September, 1882.\n\nSir,—Referring to my letter of the 15th August, in reply to yours of the 27th July, with reference to the removal of obstructions in the Saskatchewan River, I now beg to say, it being apparent that the railway line will not reach the south branch of the Saskatchewan River this year, and that steamboat navigation on that river will be necessary.\n\nWe have determined to take measures to improve the navigation on the Demi-charge and Rocher Rouge, above Grand Rapids. We expect it will be necessary to use that portion of the river for the next two years, at any rate. We have therefore given the necessary instructions for the construction of a pier at the head of the Demi-charge Rapids, to be built during the coming winter, and to which will be attached a chain, to aid steamers going up the rapids. The necessary appliances, as may be most desirable, will also be put in at Rocher Rouge.\n\nWe are, therefore, now taking the necessary steps to carry out the arrangement that we some time ago proposed, and which was agreed to in your letter of 27th July. Under these circumstances, we are prepared, if the Minister desires, to carry out the arrangement suggested in your letter of the 27th July.\n\nWe have now five steamers on the Saskatchewan River plying between Grand Rapids and Edmonton, and these will all be fully at work on the opening of navigation next year. Four have been at work this season, and owing to the low water and existence of boulders at Cole's Falls and other places, have received considerable injury, which will be repaired during the coming winter.\n\nI beg to make this explanation in addition to what I stated in my letter of the 15th August, and if the Minister desires it, I will be prepared to expend any sum of money in such a way as will best improve the navigation of the river.\n\nThere is no doubt that by reasonable expenditure the time during which navigation could be carried on may be extended for a period of one month, at least, beyond what has been possible this year.\n\nOwing to the fall in the water and obstructions at various points, the steamers have not been able to carry half the quantity of freight or passengers that desire transport, and from the accounts we get, the quantity we shall get next year will be very much greater, so much so, that we are considering the propriety of building another steamer, to be ready for the spring.\n\nI beg, therefore, now to say, that if it is the desire of the Minister to carry out what your letter suggested, we shall be ready to expend whatever money he places at our disposal in the way in which will be most advantageous to improve the navigation of the river.\n\nTo accomplish this it will be necessary to build barges this winter, and get them up early in the spring, and appliances put upon them for lifting boulders. The actual work of doing this latter can only be done when the water is low.\n\nFrom the reports of the captains of the steamers on the river, we have received such correct information in regard to the most important obstructions that actual operations will be much facilitated, and the work can be carried on, from the information we have obtained, to great advantage.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. Brydges, Land Commissioner.\n\nF. H. Ennis, Esq., Secretary Department Public Works, Ottawa.\n\n11th October, 1884.\n\nSir,—I am directed to acknowledge the receipt of your letter of the 27th ultimo, referring to the removal of obstructions in the Saskatchewan River, and stating that your company has determined to take measures to improve the navigation of that stream, at the Demi-charge and Rocher Rouge, and is prepared to carry out the arrangement suggested in my letter of the 27th of July last, &c.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. Ennis, Secretary.\n\nC. J. Brydges, Esq., Land Commissioner, H. B. Co., Winnipeg, Man.\nCHIEF ENGINEER'S OFFICE, PUBLIC WORKS DEPARTMENT,\nOTTAWA, 16th October, 1882.\n\nSir,—The Hudson Bay Company, through Mr. C. J. Brydges, in No. 25619,\ndated 15th August last, acknowledge the receipt of departmental letter No. 137164,\ninforming them that an Order in Council authorized the placing of the sum of\n$18,000 in their hands for expenditure in improving the navigation of the River\nSaskatchewan at Cole's Falls and Tobin's Rapids, provided the company undertook,\nat their expense, the improvements at Rocher Rouge and Demi-charge.\n\nIn this letter it is stated that as the construction of the Canadian Pacific Rail-\nway would affect the question of steamboat navigation of the Saskatchewan, any\nexpenditure at Rocher Rouge and Demi-charge will not be required, but that\nimprovements at Cole's Falls and Tobin's Rapids, together with certain works on the\nsouth branch, were required.\n\nIn a further letter of the 27th September, the company refer to their letter of\nthe 15th August, and state that in view of the non-completion of the Canadian Pacific\nRailway they will keep their steamers plying on the Saskatchewan for two years,\nand will therefore proceed with improving the channel at Rocher Rouge and Demi-\ncharge, and they ask that they be again instructed to carry out the improvements\nauthorized by departmental letter of 27th July (No. 137164).\n\nHaving had a conversation with Mr. Brydges relative to the improvement of\nthis river and the work to be done by his company, I beg leave to recommend\nthat authority be renewed for the expenditure of the amount previously named, viz.,\n$18,000, by the Hudson Bay Company, with instructions to proceed at once to pro-\ncure the plant necessary for a prosecution of the works during the winter, which is\nstated to be the proper time.\n\nI have the honor to be, Sir, your obedient servant,\n\nHENRY F. PERLEY, Chief Engineer.\nSecretary Public Works Department.\n\nOTTAWA, 6th October, 1882.\n\nSir,—With reference to my letter of the 27th July last, and your replies thereto,\nrespectively, dated the 15th August and 27th September last, respecting the placing\nin the hands of your company of the sum of $18,000 for the purpose of improving\nthe Saskatchewan River at Tobin's Rapids and Cole's Falls, on the understand-\ning that your company will bear the costs of the improvements required at Demi-\ncharge and Rocher Rouge, I am now directed to again authorize your company\nto expend the said sum of $18,000 for the execution of the works contemplated, in\nconformity with my said letter of 27th July, and to request that steps be taken at\nonce to procure the plant necessary for the prosecution of the works during the\nwinter, which is stated to be the proper time.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nC. J. BRYDGES, Esq., Land Commissioner, H.B. Co., Winnipeg, Man.\n\nHAMILTON, 30th October, 1882.\n\nMy Dear Sir,—I sailed down the Saskatchewan by the last steamer of this\nseason from Edmonton to Grand Rapids, and as such vessels run during daylight only,\nI had an excellent opportunity of informing myself as to what was necessary for the\nbetter navigation of a river in which I had become somewhat interested, from the fact\nthat I was convinced much good could be done in this respect at a trifling cost.\n\nBesides discussing the matter fully with Captain Sheet and his pilot, Fable, during\nthe downward trip, seeing I was delayed a fortnight at Grand Rapids I had there an\nopportunity to discuss the situation with Captains Webber and Russell, as also with\nMr. McArthur, the manager of the Winnipeg and Western Transportation Company,\nand now enclose a report based upon the opinions of the captains and pilots confirmed\nby Mr. McArthur, and endorsed by myself, as I firmly believe, if the work is done in the manner proposed, it will add at least 10 inches more available water for navigation from the cut-off to Edmonton, at a cost of not over $12,000 to $15,000.\n\nI am authorized by Mr. McArthur to say that the company will, no doubt, not only give the use of the \"Lily\" at its working cost, but in every way cooperate with the Government in carrying out a scheme so much in the interests of the steamboat company and the public.\n\nI send the manager of the Winnipeg and Western Transportation Company a copy of enclosed reports.\n\nAs regards the navigation from the cut-off, I am afraid, if not altogether, at any rate, for a portion of each season, the original channel to Big Stone River, say 73 miles, must be abandoned, and the new channel via Cumberland Lake adopted, which will be unfortunate, seeing this channel is not to be depended on and light draught steamers are wholly unsuitable and very dangerous for such lake navigation—the feasibility, at a reasonable cost, of closing up the Cumberland Lake channel, and throwing the whole stream into the original channel, must, however, be decided by engineering ability, as the river has already cut out the new channel to such an extent as may make the change a matter of serious expense and difficulty, even although all the necessary timber-willows and stone for the purpose are to be had of suitable size and quality in abundance on the spot.\n\nCaptain Russell gave me, from memory, a rough chart of the Cumberland Lake channel, which he had then of necessity thoroughly investigated. I will have it traced, and send you a copy.\n\nI am yours truly,\n\nJAMES TURNER.\n\nSir Hector Langevin, Minister Public Works.\n\nNORTH SASKATCHEWAN—PRINCE ALBERT TO CUT-OFF.\n\nThe current in this division is very rapid and in some cases even dangerously so, and the boulders are larger than above Prince Albert. I would therefore suggest that instead of a scow the steamer \"Lily\" be employed on this service, as in addition to the advantage of self locomotion, she has a steam nigger and capstan, which would be of much service in the removal of the larger boulders. I would also suggest that dynamite be substituted for powder, otherwise what would be required for the prosecution of this work would be much the same as for that of the Edmonton and Prince Albert division.\n\nPeter Smith, the pilot of the \"Northcote,\" is suggested as being well qualified to take the same position as regards the working of this division that it is proposed Fable should take in the Edmonton and Prince Albert division.\n\nCaptain Sheet of the steamer \"North-West;\" Captain Webber, of the steamer \"Northcote;\" Captain Russell, of the steamer \"Manitoba,\" are all well qualified to take the command of either division.\n\nAs I have already said, there is no necessity for a survey; each division could be organized and supervised in the interests of the Government at the respective starting points by such well known gentlemen as George A. Simpson, of Edmonton, and Col. Sproat, of Prince Albert, or by others similarly qualified, who may be equally well known to the Department.\n\nJAMES TURNER.\n\nThe steamers to ply on the Saskatchewan are stern-wheelers, owned by the Winnipeg and Western Transportation Company, are now all above the Grand Rapids and ready for next season's traffic, being as follows:\n\n- \"Northwest,\" 200 feet in length, 33 feet beam and 18 inches draught.\n- \"Northcote,\" 154 do 28 do 30 do\n- \"Manitoba,\" 160 do 30 do 20 do\n- \"Marquis,\" 200 do 31 do 25 do\n- \"Lily,\" 100 do 24 do 15 do\n\nEach 100 tons cargo increases draught by about 10 inches.\nNORTH SASKATCHEWAN—PRINCE ALBERT TO THE CUT-OFF.\n\nRapide—Crooked.......................... 14 miles from Prince Albert.\nOld Wive's......................... 19 do do\nSmith's wood yard.............. 21 do do\nNo name......................... 22 do do\nDemi-charge..................... 23 do do\nNo name......................... 24 do do\ndo............................ 25 do do\nLong Flat....................... 25½ do do\nLa Chute (Bad)................. 26½ do do\nNo name......................... 26½ do do\nBig Stone....................... 27½ do do\nHamilton......................... 28½ do do\nNo name......................... 29½ do do\nStraight Shoot.................. 30½ do do\nBig Bend (very bad).......... 31½ do do\nNo name......................... 32½ do do\nThe first of Cole's Falls,\nwhich is a continuous\nrapid, 17 miles in length,\nand ending at Forks........... 51 do do\nFifteen miles below Cole's\nFalls (Bad)..................... 66 do do\nEighteen miles below Fort\nLa Corne (Bad)............... 84 do do\nArrow Shoot.................... 87 do do\nCadot's (Bad).................. 107 do do\nUpper Nepowin................ 112 do do\nNepowin......................... 114 do do\nThird Nepowin.................. 116 do do\nFourth do....................... 118 do do\nThree Island................... 134 do do\nTobin's, a chain of rapids, 5\nmiles in length.............. { 164 do do\n{ 169 do do\n\nNORTH SASKATCHEWAN—EDMONTON TO PRINCE ALBERT.\n\nThere is a very strong current in some of the rapids of this division, but in no instance of sufficient strength to prevent the steamers, unassisted, surmounting them.\n\nThere is no rock, the bottom of the rapids being coarse gravel or rather small boulders, and although the channel does not change, there are in each some boulders of from 500 lbs. to 2,000 lbs., and probably a few even 3,000, which, if removed from a channel of, say 200 feet, would greatly assist navigation, besides increasing the available depth of the river by at least 10 inches, which means an increased carrying power of 100 tons freight per trip, and an additional trip per season for each steamer.\n\nTo attain an object so desirable (as the expense of a survey party would be just so much money thrown away) allow me to suggest:\n\nThat a scow, 60 feet by 15 feet, with sleeping berths for crew, and shears attached to side, 6 inches by 8 inches, and 25 feet long, be built early next spring, at Edmonton, where the necessary planed timber can be had from the mills; all else, however, should be sent from Winnipeg by first steamer of next season, such as provisions for men, spikes, nails, chains, grappling-irons, two anchors of 250 lbs. each, crowbars, picks, irons for shears and levers, hammers, axes, blacksmith's forge, oakum, rigging, coil rope, 1½-inch diameter, tar paint and drills, powder fuses to blast the few larger sized boulders; in fact, everything (timber excepted) necessary to properly build and equip a scow for such a purpose.\nThe scow should be in working order not later than the 15th August next, when river being low, a crew could be put on board at Edmonton, consisting of the captain and pilot of one of the steamers now on river, and eight Indians.\n\nThe pilot of this division should, I think, be Joseph Fable, of Fort Victoria, who has acted as York boat pilot on this portion of the river for the past 23 years, and took up the first steamer, and is now pilot of the steamer \"Northcote,\" and considered the best on the river, and, I have no hesitation in saying is a worthy fellow, able to manage Indians, and deeply interested in making such an undertaking a complete success.\n\nThus equipped, the scow would float down the Saskatchewan from rapid to rapid, pick up and put the boulders on board, and drop them into the deep pools below, as the boulders should not be placed at the side of the river, seeing they would be liable to be carried off by the ice, and possibly turn up in a position unsuspected by the pilots.\n\nIn the more intricate, such as the Crooked Channel, I think guide boards to steer by should be put on the trees on shore.\n\nNORTH SASKATCHEWAN—EDMONTON TO PRINCE ALBERT.\n\nRapids—Clover Bar..................About 7 miles from Edmonton\n\nPoint of Pea Rock............. do 18 do do\nA mile below barracks... do 26 do do\nSturgeon River............... do 30 do do\nVermillion .................... do 45 do do\nSucker ......................... do 50 do do\nWasahaterow.................. do 57 do do\nVictoria ....................... do 67 do do\nGraham's...................... do 71 do do\nCrooked (Bad)................. do 86 do do\nSnashill ....................... do 89 do do\nBig Stone ..................... do 91 do do\nSaddle Lake.................. do 94 do do\nEgg Lake...................... do 104 do do\nDog Rump...................... do 114 do do\nNo name....................... do 117 do do\nWolf Pond ..................... do 119 do do\nMoose Creek.................. do 123 do do\nNo name....................... do 124 do do\n1st Frog....................... do 130 do do\n2nd Frog....................... do 132 do do\nShoal.......................... do 157 do do\n\nBelow Battleford there are but few boulders to be removed from the channel, and the shifting sand bars in that section, although detrimental to navigation, are fortunately surmountable, as their removal or even improvement, if not impossible, would, at any rate, cost much more than the anticipated traffic on river for many years to come would warrant:\n\nJAMES TURNER.\n\nHAMILTON, 4th November, 1882.\n\nMy Dear Sir,—I beg to hand herewith tracings of the cut-off of the Saskatchewan. The main river, in former years, turned off at A, and channel was vid B D to C; it afterwards cut a passage from A to C, and five years ago it cut a channel from B to Sturgeon River, thus connecting the main river vid Sturgeon River with Cumberland Lake.\n\nThe original channel is from C downwards, and that from D being the Cumberland Lake channel, which has been gradually deepening, to the serious detriment of the original one.\nCaptain Russell, on the last downward trip of the Steamer \"Manitoba,\" this season, attempted to steam down the original channel, but after sailing about a mile and a-half found only 18 inches water, so returned, as per dotted line, and entered the Cumberland Lake channel at C, where he found over 8 feet, and although an intricate channel, sufficient of water for the \"Manitoba\" all the way to Cumberland Lake.\n\nWhile I am strongly of opinion that the work, as suggested in mine of the 30th ult., should be proceeded with next season, seeing that, whatever are the railway developments, that portion of the river will continue to be navigated by a fleet of steamers; I am not so confident, however, that the river below the cut-off will continue to be so to so great an extent as now, seeing that there are below so many serious rapids to be overcome, and the land, from that point downwards, is, in many cases, an unlimited marsh, and almost valueless. Consequently, I would not feel justified in recommending any very large expenditure, although it is very desirable to save the original channel. If, however, the engineer should find that this could be done at trifling cost, it certainly would be in the interest of navigation and the safety of the travelling public to have it done next season. Also, failing in this, something should be done by closing up the entrance to the original channel and otherwise improving the Cumberland Lake channel.\n\nI am, my dear Sir, yours truly,\n\nJAMES TURNER.\n\nSir Hector Langevin, Minister of Public Works, Ottawa.\n\nOTTAWA, 18th November, 1882.\n\nSir,—I beg to acknowledge the receipt of your letters of the 30th October and 4th November, respectively, with reference to the improvement of the Saskatchewan, and enclosing a report and plan of the river from the \"Cut-off\" to Edmonton; and am directed to extend to you the thanks of the Hon. the Minister for the valuable information contained therein, and to assure you that the matter will have his best consideration.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nJames Turner, Esq., Hamilton, Ont.\n\nHAMILTON, 20th November, 1882.\n\nMy Dear Sir,—I am in receipt of your favor of the 18th inst., and now beg to enclose letter of the 6th inst. from P. McArthur, manager of the Winnipeg and Western Transportation Company, which closes the case for the prosecution of the works proposed to be done for the improvement of the Saskatchewan.\n\nThere is no necessity for acknowledging receipt of same.\n\nI am yours truly,\n\nJAMES TURNER.\n\nF. H. Ennis, Esq., Secretary Department Public Works, Ottawa.\n\nTHE WINNIPEG AND WESTERN TRANSPORTATION COMPANY, LIMITED.\n\nManager's Office, Winnipeg, Man., 6th November, 1882.\n\nDear Sir,—I have much pleasure in acknowledging receipt of your favor of the 31st ult., enclosing copy of a report to the Department of Public Works regarding the improvements required on the Saskatchewan River. I entirely agree with you as to the benefit this improvement would convey to steamboat owners and the public in general, and also concur as to the mode you propose for carrying out the work.\n\nShould the Government see fit to act upon your suggestions at an early date, the extra depth of water thus obtained would enable us to carry freight cheaper, and we could allow considerably reduced rates, especially to such goods as seed, wheat, lumber and coals.\nThe importance of improving this great watercourse can best be understood by one who has travelled over it, as you have done, and I trust you will be successful in your efforts, for which you merit our best thanks.\n\nYours respectfully,\n\nP. McARTHUR.\n\nJas. Turner, Esq., Hamilton, Ont.\n\nOTTAWA, 4th December, 1882.\n\nSir,—Owing to the rapid opening up of the North-West Territories, an immense amount of merchandise, provisions and Government stores are shipped westward from Winnipeg to the most distant parts of the North-West Territories.\n\nThose freights are carried over the Canadian Pacific Railway to the Qu'Appelle station, and from thence transported in carts for hundreds of miles across the prairies to the different settlements along the banks of the Saskatchewan River. All trains of carts have to reach their destination by crossing the South Saskatchewan.\n\nIt would greatly advance the public convenience if a free ferry was established at some point between the telegraph crossing and St. Laurent, on the South Saskatchewan River.\n\nIf the Government will undertake the cost of providing and fixing in position a strong wire rope on this stream, the people of St. Laurent will defray the cost of a large ferry boat, and its maintenance from year to year.\n\nThe great expense incurred by loss of time in crossing this river adds considerably to the rates of freights, and, further, creates a serious outlay on the incoming settlers, which expenditure they cannot easily afford.\n\nWith the assurance that the Government are prepared to do all that is reasonable and necessary to remove all obstacles that impede the movements of the struggling settler to reach his distant destination, I submit the subject matter of this letter for their favorable consideration.\n\nI have the honor to be, Sir, your obedient servant,\n\nL. CLARKE, Member N. W. C.\n\nSir Hector Langevin, Minister of Public Works, Ottawa.\n\nHUDSON BAY COMPANY, WINNIPEG, 29th January, 1883.\n\nSir,—Referring to your letter of the 6th October last, in regard to the expenditure of $18,000 for improving the Saskatchewan River, I beg to report that I found, upon careful investigation, that it was impossible to do the work during the winter, and I have therefore made arrangements for having the work done during the next summer.\n\nI am now having built, at Prince Albert and Edmonton, a couple of barges, upon which lifting apparatus will be placed, and by these means the boulders in the worst places will be grappled with and taken down to deep water and dropped there. There seems to be no doubt that this plan is the cheapest and most effectual way of removing the obstructions. The weather in winter is too severe to render it possible for men to work out of doors.\n\nCertain appliances will be necessary for the boats, and I find that there are now, belonging to the Government, at Fort Osborne, near Winnipeg, certain articles which were used for similar purposes, in the removal of similar obstructions in the St. James Rapid on the Assiniboine River.\n\nI shall be obliged if you will send me an order to get possession of these various articles, which I will have transported to the Saskatchewan and used in the prosecution of the work entrusted to me.\n\nOf course, when done with, I will see that they are properly returned to any place that you may designate. The getting possession of these articles will, of course, save a considerable sum in purchasing what would otherwise have to be obtained.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. Ennis, Esq., Secretary Dept. Public Works, Ottawa.\nOTTAWA, 17th February, 1883.\n\nSir,—I beg to acknowledge the receipt of your letter of the 29th ult., respecting the expenditure of $18,000 for improving the Saskatchewan River, and giving the reason why the work could not be commenced this winter.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nC. J. BRIDGES, Esq., Hudson Bay Company, Winnipeg, Man.\n\nSir,—We, the undersigned merchants of Prince Albert, N.W.T., beg leave respectfully to represent to you as follows:\n\n1. Prince Albert, a large and rapidly growing town, is situated at the middle distance between the source of the North Saskatchewan and its discharge into Lake Winnipeg, an extent of navigable water upwards of a thousand miles in length.\n\n2. That the said river, though it has been navigated by steamers for several years, is yet entirely in a state of nature, and has never, until this moment, received any attention from the Dominion Government, in the shape of actual improvement, though several appropriations have been made by Parliament for that purpose.\n\n3. That large agricultural and business communities are forming along the line of said river, Prince Albert being the most important of these; the town proper now comprising some 1,500 inhabitants, with a large surrounding settlement, into which immigrants are constantly pouring in ever-increasing numbers.\n\n4. That the extent of the trade of the place may be estimated by the statement that numbers of us have imported into Prince Albert during the last year stocks of goods running up in value from twenty to fifty thousand dollars.\n\n5. That last year three additional steamers were placed upon the river, thus making in all five steamers which will be ready during the coming season to navigate the North Saskatchewan, between Grand Rapids and Prince Albert, and between Prince Albert and Edmonton.\n\n6. That the Saskatchewan being mainly fed by melting snow and glaciers in the Rocky Mountains, is marked by three distinct freshets—in early spring, in June and in August—when steamers have very little difficulty in ascending; but that these freshets are of short duration, and the river, at its normal stage of water, though quite deep enough for purposes of transport, were the channel improved, is yet so obstructed by boulders as to be almost useless; an evidence of which is seen in the result of last year's traffic, when owing to the three new steamers having only surmounted Grand Rapids at an advanced period in the season, they were practically useless, on account of the numerous boulders which obstructed the channel. In consequence, many of our merchants, and, in fact, all classes of the community who had ordered their supplies by steamer, have incurred heavy loss and inconvenience. A large portion of the supplies for Prince Albert, Battleford, Edmonton, and for the Indian Department, is now wintering at Cumberland, much of them perishable, and, therefore, likely to suffer great damage. This is an experience which, with the growing traffic, will be yearly repeated, unless some improvement is put upon the river, which is quite capable of improvement at a very moderate expense.\n\n7. That we believe an expenditure of twenty thousand dollars will remove the worst obstructions, and enable steamers to ascend the river with their cargoes at the ordinary stage of water, and that there should be an appropriation to that extent made during the coming session of Parliament, and that instructions should issue immediately thereafter, or as soon as spring opens, to competent men to go on with the work.\n\n8. That we think it is a public duty to improve the Saskatchewan (which is not an ordinary inland stream, but one of the great waterways of the continent), now that farming and commercial communities are forming everywhere along its banks, who suffer severely from the existing high rates of freight.\n\n9. That we believe the rates of freight at present charged by steamer, should the improvements we urge be carried out, might be reduced at least forty dollars per ton.\n—a reduction which evinces at a glance how important to our farmers and settlers who depend upon the river for their supplies is its immediate improvement.\n\n10. On behalf of the residents of this fertile district, now rapidly settling up, we beg leave most respectfully to urge upon your attention the necessity for a liberal appropriation at the coming session of the Dominion Parliament, in order to carry out the improvements we suggest—improvements which are not only highly necessary to the people of this country, but in the direct interest as well of the General Government.\n\nBetts E. Gwymer,\nJ. O. Davis & Co.,\nJ. C. Mackenzie,\nThos. O. Davis,\nJ. M. Campbell,\nJ. Mack & Co.,\nJas. Sinclair,\nG. T. Brown,\nT. J. Apnud,\nH. J. Porter, M.D.,\n\nHon. the Minister of Public Works, Ottawa.\n\nJ. R. McPhail,\nR. B. Way,\nT. A. Campbell,\nA. L. Ashdown,\nGoo. D. Northgroves,\nWalters & Baker,\nJ. D. Lanagan,\nJackson & Jackson,\nT. E. Jackson.\n\nOTTAWA, 24th March, 1883.\n\nGentlemen,—I have the honor to acknowledge the receipt of your letter of the 17th ultimo, asking for a grant to improve the Saskatchewan River.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nMessrs. Betts E. Gwymer, T. O. Davis & Co., and others,\nCare of Mr. Betts E. Gwymer, Prince Albert, N.W.T.\n\nHUDSON BAY COMPANY, WINNIPEG, 4th May, 1883.\n\nSir,—Referring to the authority which has been given to me to proceed with the removal of boulders, &c., in order to improve the navigation of the Saskatchewan River, I have now to report that I have completed the necessary arrangements for having as much work as possible done during the coming season.\n\nI have engaged a competent man, who has had very considerable experience in similar works, both in the Mississippi and Missouri Rivers, to proceed to the Saskatchewan River and to get the work executed in a proper and workmanlike manner.\n\nDuring the winter I sent directions to Edmonton and Prince Albert to get out the necessary quantity of timber for the construction of two boats, which will be used in the work. That timber is now on the ground, ready to be put together by the person I am sending from here. I have also made the necessary purchases of the material that will be required to carry on the work. It will be absolutely necessary to take everything in the shape of material from here, as the work has to be performed in places entirely remote from any population, and where, of course, therefore, nothing can be procured.\n\nThe list of articles has been gone over with very great care, and nothing has been purchased which will not be absolutely required.\n\nAs the work is to be done so far from civilization, and where no facilities exist for repairs, it has been necessary to have everything of the very best material, so as not to delay the work from breakages of the material used. Whilst, therefore, every attention has been paid to our having the articles of first rate quality, every effort has been made to keep the cost within the smallest possible limits.\n\nThe man I have employed is taking five or six men accustomed to this kind of work with him, and the rest of the laborers will be Indians, who can be obtained at a moderate rate of wages through the officers of the Hudson Bay Company at the nearest posts.\nI now enclose you accounts as follows, for which I shall be glad to have funds—the parties being anxious to obtain the amount of the accounts.\n\nI have, in order to facilitate operations, paid a portion of these accounts, having advanced the money for that purpose.\n\nThe accounts are in duplicate, and are as follows:\n\n- Gormain & Co., hardware of various kinds, including stoves and materials for feeding the men employed. $732.79\n- Vulcan iron works, for materials required in working the boats and lifting the boulders out of the river... 968.69\n- Hudson Bay Company, for blankets......................... 308.00\n- Hope & Bromley, for tents.................................. 104.50\n- Jos. Dutton, 1 second hand level............................ 65.00\n\n$2,178.98\n\nI have certified to the accounts being correct, and that the goods have been received.\n\nThey are now in course of transport from Winnipeg to the Saskatchewan River. I have arranged with the steamboat owners on Lake Winnipeg to carry these materials to Grand Rapids at a largely reduced rate of freight, and I have also arranged with the owners of the steamers from Grand Rapids to Edmonton to carry all the freight and the men over the Saskatchewan River free of any charge. This, of course, will materially reduce the outlay, as transportation charges on the river are extremely high.\n\nThe party I have sent up in charge of this work is quite capable of making a careful examination of the river in different places, and it is for this purpose that I have supplied him with a theodolite. He will bring back, when he returns from the season's work, very valuable information, indeed, in regard to what is necessary to be done to put the navigation of the river in a satisfactory condition.\n\nI do not anticipate the outlay including the accounts now inclosed; the wages paid during the season and the feeding of the men will exceed, if it will reach, a total of $15,000.\n\nI have no doubt a great improvement will be made at many places, although no doubt the thorough examination of the river which will be made will show that a considerably larger sum will be required next year, in order to do all that is necessary.\n\nThe work this year will be confined to Cole's Falls, which is west of the junction of the main branch of the river with the South Saskatchewan, and the removal of boulders at various points between Cole's Falls and Edmonton.\n\nNo expenditure at present will be incurred, nor without further authority, on this side of the forks of the Saskatchewan.\n\nAs I shall have to pay some of the men who are going up a portion of their wages, which they will leave with their families whilst they are absent, and there will be some accounts to pay for other things, I should be glad if you would let me have a credit in one of the banks here for the sum of five thousand dollars ($5,000), out of which I could pay the enclosed accounts, and any further advances that may require to be made.\n\nI shall probably not require more than that amount of money until the end of the season, when the men return.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. Ennis, Esq., Secretary Department Public Works, Ottawa.\n\nOTTAWA, 22nd May, 1883.\n\nSir,—Having reference to your letter of the 4th inst., re Saskatchewan River works, I beg to return to you the enclosed accounts, to be paid from the cheque of\n$5,000, mailed to your address on the 19th inst., also blank forms of \"Pay List,\" \"Return of Account\" and \"Summary,\" for future use.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nC. J. BRYDGES, Esq., Hudson Bay Company's Office, Winnipeg, Man.\n\nWINNIPEG, 7th September, 1883.\n\nSir,—The accounts for the work which is in progress in removing obstructions in the north branch of the Saskatchewan River, are now beginning to come in, and the money which I have already received is about exhausted.\n\nI shall therefore be obliged if you will forward me a credit for a further sum of $10,000, which I hope will be sufficient to complete the work now going on for the present year.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. ENNIS, Esq., Secretary Department Public Works, Ottawa.\n\nWINNIPEG, 26th December, 1883.\n\nSir,—I now beg to report upon the work which has been done during the present year in the improvement of the Saskatchewan River.\n\nI enclose herewith, in duplicate, statements showing the total expenditure which has been made on account of the vote of $18,000 authorized by Parliament to be expended on this work.\n\nThe total amount of payments that I have made out of the $18,000 which was placed at my credit has been $14,996.57.\n\nThe details of this amount will be found in the accompanying documents.\n\nThe vouchers for $2,178.98 were forwarded to the Department on the 26th May, and the other vouchers are enclosed herewith. They have been signed by Mr. E. A. Burbank, who was employed to take charge of the work, and have been countersigned by myself.\n\nI enclose also a report dated 19th December, made to me by Mr. Burbank, showing the work which was done during the season.\n\nI also enclose a sketch of the river from Edmonton to the forks of the Saskatchewan, which will give a general idea of the obstructions which require to be removed, and which also shows, colored green, the work which has been done, which consists of the removal of boulders and rocks.\n\nThe portions colored yellow show the work still required to be done in the removal of sand bars, and the portions colored red what still requires to be done in removing boulders and rocks.\n\nThe enclosed tracing is not, of course, from an actual instrumental survey, and is not, therefore, to be regarded as a strictly accurate representation of the width of the river at the different points.\n\nIt is, however, a very correct approximation of the facts, and quite sufficient, as regards the information necessary to enable future work to be carried on.\n\nThe work could not be begun until the ice left Lake Winnipeg, and allowed the men and materials which had been got ready here to be taken across the lake and up the river by the steamers.\n\nOwing to the late opening of navigation on Lake Winnipeg, the party did not leave here until 18th June. The party consisted of 14 men, with an outfit to enable two boats to be worked.\n\nThis outfit consisted of derricks, clamps for lifting stones, winches, a supply of boring tools, blasting powder, and a variety of things necessary to enable work to be carried on. Everything, excepting provisions, had to be taken from here, owing to the impossibility of getting it in any reasonable proximity to the river.\nThe party was divided into two—one proceeding to Edmonton, where a boat was constructed, and one remaining at Prince Albert, where another boat was built for use at Cole's Falls.\n\nBoth boats were got to work in about ten days after the men arrived, at each place, and work was continued on the river up to the 5th of November, when it had to be stopped on account of the ice in the river.\n\nThe boat that was built at Edmonton commenced work some little distance below there, and removed boulders which impeded the navigation. This work was done east of Edmonton at ten different points, until it was stopped by ice.\n\nThe boat which was constructed at Prince Albert was occupied almost wholly in the removal of the obstructions at Cole's Falls, one of the worst places in the river. Work was done at Cole's Falls in several different places, and a greater part of the length of the falls was very materially improved.\n\nA very large number of boulders in all have been taken out. Some were lifted bodily out of the river and deposited in deep water, but many, which were too large to be handled, had holes drilled in them, were blasted to pieces, and the different portions removed.\n\nThe red marks on the plan show, as I have said, where work requires to be done in the further removal of boulders; and it will be necessary, at some places where the channel of the river is divided by islands, and the depth of water consequently materially reduced, to concentrate the channel into one place, and thus give the necessary amount of water for purposes of navigation.\n\nIt is proposed to construct wing dams in places where there are sand bars, by driving piles, which can be obtained on the banks of the river, about 3 feet from centre to centre, in the positions shown on the plan.\n\nThey will then be cut off below the surface of the water, and in a very short time the sand will go silt around these piles as to make a natural barrier, and thus throw the water in the direction of the required channel.\n\nThere are a good many places between the two points where the rock boulders are found to exist, where the river is very much obstructed by sand bars and by shallow water, where islands exist, and where the water is spread over a wider surface.\n\nSome of these bars will have to be removed by dredging.\n\nThere is no doubt that by the removal of the boulders shown on the plan, by the construction of the wing dams, which are also shown, and by proper work in that portion of the river where the bars of sand and gravel exist, that a very vast improvement can be made in the river, and that it can be made navigable for the class of boats which are used for navigating it for a considerable portion of the season of navigation.\n\nThe river, as you are probably aware, is fed from the Rocky Mountains, and the rise and fall of the river is caused by the melting of the snow in the mountains during the warm weather, and its freezing up during the winter and in cold weather.\n\nThere has been known, at Edmonton, a rise and fall of $2\\frac{1}{2}$ feet in 24 hours, arising either from a very warm day, melting a very large quantity of snow, and thus raising the waters, or a fall of equal magnitude, consequent upon a cold spell, which has bound up the snow and ice, and prevented its running off, in the shape of water, into the river.\n\nThe boats which are now navigating that river draw from 15 to 24 inches, and Mr. Burbank, who has been over the whole of the river several times, and made careful examinations, as is shown by the chart which he has prepared, is of opinion that by proper arrangements and a reasonable amount of work the river can be made navigable for a period of at least six weeks longer in the fall of the year than has been possible heretofore.\n\nThe obstructions to navigation are confined to the places where either boulders block the channel or sand bars exist, and by the removal of those obstructions the water at each point will be so deepened as to allow of steamers continuing their work for from six weeks to two months longer than they can do at present.\nThe performing of this work properly will require better appliances than have been in use during this year. The work done this year has been, of course, largely experimental, and although a very considerable amount of good has been done in the places where work was being carried on, advantage has been taken of the knowledge acquired during this year to ascertain, with very considerable accuracy, what is required to be done in future, and a reasonable estimate made of the cost.\n\nThe two boats which were at work this year required very considerable expenditure to remove them from place to place, and from their size and the smallness of the appliances upon them, they can only do a comparatively small amount of work.\n\nThey can be advantageously used—one at Cole's Falls, in completing the removal of boulders at that spot, and the other in doing certain work at places this side of Edmonton, where only a few days' work is required at each place.\n\nBut to deal with the whole question in a satisfactory manner it will require to have a boat specially built for that purpose, and with appliances upon it which will enable rocks and boulders to be removed, or blasted, piles to be driven for the construction of wing dams, and dredging to be executed for deepening the water where sand bars exist.\n\nSuch a boat can be built on the river with timber taken for that purpose by the Canadian Pacific Railway to Medicine Hat, and floated down to the point where the boat will be built on barges at high water.\n\nThe machinery for such a boat can be obtained by the purchase of the machinery of a boat which was lost this year in an attempt to navigate the south branch as far as Medicine Hat.\n\nThe steamer reached there in safety, although the water was low; but having to remain waiting for cargo for two or three weeks, the water fell so low that the steamer was wrecked by striking a rock about 40 miles north of Medicine Hat, and became a total wreck.\n\nThe machinery was taken out after and placed upon the bank, out of harm's way, and can now be purchased for the sum of $2,000.\n\nThe machinery and boilers are in very good order.\n\nThey were made in England and brought out to this country and put into a boat called the \"Lily.\" The purchase of new machinery of the same character would cost a very much larger amount, and in addition there would be the cost of transporting it from the place of manufacture to the north branch of the Saskatchewan. A boat such as is required would be about 130 feet long by about 27 feet beam; would be constructed almost flat-bottomed, so as to draw as little water as possible; and would be provided with different kinds of apparatus to do the various works required.\n\nIts cost, including the machinery, at the price which I have mentioned, would, with all the appliances required, be about $15,000.\n\nSuch a boat, if ordered forthwith, could be got ready as soon as navigation opened in the spring, and would allow of work being carried on for at least five months; but if such a boat is to be built she will have to be ordered within a short time so as to get the timber out during the winter, and have all the preparations made for putting it together as soon as it can reach the river.\n\nThe time that it would take such a boat to complete the works mentioned in the enclosed report, and as designated on the enclosed plan of the river, would occupy not less than three years.\n\nBut if the work was undertaken with a determination to have it completed in a manner such as I have described, it could all be done in three years, improving, of course, the condition of the river every year, and making it, at the end of three years, a river equal to any western river on this continent for purposes of navigation.\n\nThe cost of working such a boat, including wages, board and every other expenditure, would be about $10,000 each season. The two boats which are now in existence, with their appliances upon them, would cost from $6,000 to $10,000, to be worked at places where they could be made readily available for the next two years.\nFor an outlay, therefore, of something less than $60,000, by adopting the plan which I have suggested, it will be possible to make the improvements in the river which I have described.\n\nUnless the whole of next season is to be lost, except in so far as the two existing boats can be worked, it will be necessary to give orders, without much delay, for the construction of the boat; and, as I have said, if she is put in hand without much delay, she can be got ready for use during the whole of next season, and in three years all the work necessary to be done completed.\n\nIt would be extremely difficult to make a contract for this work. There is nobody, of course, who knows what is required, except the man who has been at work during this season, and the most desirable plan could be, if the Minister decides to carry on the work, to employ the same man, so as to utilize the knowledge which he has acquired, and make him superintendent of the work to be carried on.\n\nIt would be impossible to lay out, in any definite shape, what would have to be done, so as to make a reasonable contract. The works will have to be done where, by the experience from day to day, it is found necessary to deal with sand bars and the removal of boulders, and it would be absolutely impossible to specify, with any definiteness, what this particular work would be.\n\nAs I have said, the only possible plan is to do it under a superintendent, who will, of course, of necessity, have considerable latitude as to what he has to do. I see no help, however, but to adopt this plan, except at an expense which would be very great, of making a thorough engineering survey of the river. If that were done, it would occupy considerable time, during which the work would have to be in suspense, and it is extremely doubtful if any engineer sent up for the purpose of examining the river would have the same practical knowledge as the man who has been working there last season, and who has thus acquired very considerable knowledge and information.\n\nI may say that I selected Mr. Burbank because he has been engaged in executing similar works upon both the Missouri and Mississippi Rivers. He is quite competent to undertake this work; and I should advise, if the Minister decides to proceed with it, that he be employed as superintendent.\n\nI shall be glad to know, at as early a date as possible, what the Minister wishes to be done, because, as I have said, if any practical work is to be done next year there is no time to be lost in making the necessary preparations for the construction of the steamer which will have to do the work.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. ENNIS, Esq., Secretary Department Public Works, Ottawa.\n\nWINNIPEG, 19th December, 1883.\n\nSir,—I now beg to report upon the work of improving the navigation of the Saskatchewan River, which I undertook, under your directions, last summer. Attached to this report is a tracing showing portions of the river where work has been done.\n\nI was unable to leave Winnipeg before 18th June, owing to ice in Lake Winnipeg. I took with me 14 men, including carpenters, blacksmiths, laborers, &c., together with such outfit as was thought to be necessary, and arrived at Prince Albert on 2nd July.\n\nI divided my party into two—one portion leaving for Edmonton, to commence work there, and the balance being left to work at Cole's Falls.\n\nCommenced building a barge at Prince Albert and at Edmonton immediately on arrival at those places. This occupied about ten days. These are simply flat-bottomed scows, strongly built; dimensions, 12 feet by 50 feet. They were rigged for hoisting boulders, with a tripod on the bow and hand winch.\n\nThe Edmonton boat proceeded to Point à Pic Rock and Rapid, about 18 miles below Edmonton. Blasted and removed one large boulder.\nAt a point about 6 miles below Sturgeon River, a large boulder removed by blasting and several smaller ones also taken out.\n\nAbout 7 miles above Vermilion River, at island No. 3, shown on the tracing as Wheeler's Island, removed about 400 boulders of various sizes, a considerable number very large, and had to be blasted. The channel at this point was widened to 60 feet and deepened to 22 inches at low summer level.\n\nJust below the mouth of Vermilion River a large number of rocks were taken out and deposited near island No. 4, as shown on the plan, opening up at this point a good and permanent channel.\n\nAt Sucker Rapids, above island No. 7, removed three very large boulders by blasting, making a good channel.\n\nAt Washetrow Rapids, removed two boulders of between two and three tons.\n\nAt Victoria Rapids a large amount of work had to be done.\n\nIt was found desirable to change the channel from the one originally used. The old channel was considered a point of great danger to steamboats.\n\nThe new channel is 33 inches deep at a very low stage of the water, and will be found perfectly satisfactory and easy of navigation, and is also easy to be seen by steamboat officers. It was necessary to remove about 400 boulders, ranging from 500 pounds to five tons.\n\nAt a point about 3 miles below Victoria Rapids, two very large boulders, lying directly in the channel, were removed by blasting, making a good and permanent channel.\n\nAbout 6 miles further down, removed two large boulders by blasting, in a sharp bend of the river, with a strong current, making the channel satisfactory.\n\nRather less than 2 miles further down, three large boulders were removed by blasting at another sharp bend of the river, where the current is also strong. The channel is now good.\n\nThe next point is Grahame's Rapids, about half a mile below the last place. This rapid may be said to have been paved with boulders for its entire length, about two-thirds of a mile. At this time (about 27th October) the water had reached its lowest stage.\n\nI found, by sounding the rapid, as was done in all cases, a desirable place for the passage of boats, excepting about 50 feet at the lower end, which I found to be obstructed by a solid wall of heavy boulders, after which the water becomes quite deep.\n\nThese boulders were removed and taken into the deep water, making a good channel the whole length of the rapid.\n\nThe season had become so far advanced that it was found necessary to discontinue operations, and the scow was hauled out and laid up on the 5th November, at a point about half a mile below Grahame's Rapids.\n\nAs regards the party at Prince Albert, they commenced work at Cole's Falls, about 14 miles below Prince Albert. They are a series of rapids, extending about 17 miles further down the river, to its junction with the South Saskatchewan River.\n\nAt rapids No. 1, as shown on the plan, no work was required.\n\nAt rapids No. 2 two large boulders were removed by blasting, making a very good channel.\n\nAt the head of rapids No. 3 a large boulder was removed by blasting, and several smaller ones were taken into deep water, making a good channel at this point.\n\nAt rapids No. 4 four large boulders were removed by blasting, and also a considerable number of smaller ones, making a good channel.\n\nAt rapids No. 5 no work was required.\n\nAt Nos. 6 five boulders were removed, making a good channel.\n\nAt Nos. 7 and 8 nothing was required.\n\nAt No. 9 eight boulders were removed, four of them by blasting.\n\nAt 10 and 11 nothing was required.\n\nNo. 12 had four large boulders taken out by blasting.\n\nNo. 13 two boulders removed by blasting.\nNo. 14 three boulders removed by blasting.\nNo. 15 two boulders removed by blasting.\nFrom 15 to 16 the current is very strong, and three boulders, half way between them, had to be blasted.\n\nThe boat built at Prince Albert was taken out and laid up for the season at this point, between rapids Nos. 15 and 16, as shown on the plan.\n\nIn regard to what has been done, I would point out that the result of my observation has been that the action of the current at high water is likely to improve the work done this season.\n\nThe foregoing is a statement of the work that has been accomplished during the passed summer.\n\nI will now proceed to state what, in my opinion, still requires to be done to complete the work, in so far as the removal of boulders is concerned, and also as regards the construction of wing dams.\n\nBy referring to the plan at Pointe à Pic Rock, which is the first point below Edmonton requiring to be improved, at island No. 1 the course of the channel was changed from the south side of the island to the north, as marked \"→\" on the plan.\n\nThis would be materially improved by building a small wing dam in the position shown on the plan, directing the passage of the water to the north of the island.\n\nAt islands Nos. 5 and 6 a wing dam is shown to be required. This could increase the volume of water north of these islands, making a very good channel. The bottom of the river is coarse gravel, and would require to be dredged from the mouth of Vermilion River to the north point of island No. 5, about 1,500 feet.\n\nAt Sucker Rapids (island No. 7) a small wing dam, as shown on the plan, would materially improve the channel.\n\nAt Washetrow Rapids a considerable amount of gravel requires to be removed by dredging.\n\nAbout one mile below Victoria Rapids the channel was changed to the north side of the gravel bar, as shown on the plan. This would require a wing dam in the position shown, to wash a portion of this gravel bar away, which would make the channel very good.\n\nBefore reaching island No. 9 operations were discontinued for the season, as far as regards the Edmonton boat.\n\nAt island No. 9 the south side of the island would require to be entirely closed with a dam, throwing all the water to the north side, making this a good channel.\n\nThis improvement is very much required, as this point is very difficult to navigate.\n\nAt Crooked Rapids the channel is very difficult to navigate, and would require a wing dam, as shown on the tracing, to throw the water to the south side of the river. This would obviate the removal of a large number of boulders, and would be less expensive than removing the boulders.\n\nAt Snake Hill Rapids some boulders require to be removed—about three days' work of a gang.\n\nAt Big Stone Rapids—eight to ten days' work removing boulders.\n\nThe same as regards Egg Lake Rapids.\n\nAt island No. 15 a wing dam is required, as shown, to divert the course of the river to the north of the island.\n\nAt Dog Rump Rapids a small amount of work is required, removing boulders; also at a small rapid just below it.\n\nAt island No. 17 there is a small rapid on the south side of the island. By placing a wing dam at the head of the rapids, as shown on the plan, these rapids will be closed and the channel diverted to the north side of the island, which would materially improve this point.\n\nAt Wolf Pond Rapids some boulders require to be removed.\n\nAt Moose Creek rapids a wing dam, as shown, would throw the water to the south of island No. 20, making a good channel. This would save considerable work in removing boulders on the north side.\nAt First Frog Rapids some boulders require to be removed, and also a large number at Second Frog Rapids.\n\nThe next point is islands Nos. 26 and 27 (three islands)—the points marked \"S\" are sand bars. A wing dam, as shown, would require to be built, which would wash out a portion of the sand bars at the head of island No. 26, and also at the foot of island No. 27.\n\nThere is no danger to navigation, from boulders, below this point, until Cole's Falls are reached, about 400 miles; but by referring to the tracing it will be seen that a large amount of work requires to be done in concentrating the channel amongst the different sand bars. It is impossible to make a good channel in one season, because the action of the water, from season to season, will change the position of the sand, and the result of one season's work would be a guide as to what ought to be done the following season.\n\nIn my opinion the work would require to be spread over three seasons more, in order to make the river a good and navigable stream.\n\nAt Cole's Falls, from the head of the falls to the point where the boat is laid up, as shown on the plan, no further work is required.\n\nAt rapids Nos. 16 and 17, below this point, a considerable number of boulders require to be removed. No. 16 will require about five days' work of a gang. No. 17 is very bad, and will require from 15 to 20 days' work.\n\nRapid No. 18 will require 6 to 8 days' work; No. 19, from 3 to 5 days, and No. 20 about 8 days' work, removing boulders.\n\nThis would complete the work requiring to be done at Cole's Falls.\n\nIn my opinion, the difficulties of navigating the Saskatchewan River have been very much exaggerated.\n\nI find from examination, and taking the elevation of the various rapids, that the rapidity of the current is not nearly so great as has been represented.\n\nThe danger and difficulty to navigation from boulders and sand bars have been more serious, but there is nothing which, in my opinion, cannot be easily remedied.\n\nYour obedient servant,\n\nE. A. BURBANK, Superintendent.\n\nC. J. BRIDGES, Esq., Winnipeg.\n\nOTTAWA, 9th January, 1883.\n\nSir,—I beg to acknowledge the receipt of your communication of the 26th December, having reference to work done in connection with the improvements on the Saskatchewan River, and enclosing statements and vouchers of expenditure, amounting to $14,996.57.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS, Secretary.\n\nC. J. BRIDGES, Esq., Winnipeg, Man.\n\nHUDSON BAY COMPANY, LAND DEPARTMENT,\n\nWINNIPEG, 25th February, 1884.\n\nMy Dear Sir Hector,—When I was in Ottawa I saw you upon the subject of the improvements on the Saskatchewan River, and I think you intimated that you would probably ask your colleagues to vote the sum of ten thousand dollars ($10,000) for expenditure this year.\n\nI have gone into that matter since I returned, and find for the sum of $10,000 the removal of all rocks between the forks of the Saskatchewan and Edmonton could be completed, and also the removal of the obstructions on the south branch, consisting of a ledge of rocks 4 miles above the forks. This sum of $10,000 will also enable all the islands to be numbered, but of course would not do anything in the direction of building wing-walls or improving navigation at those places which are obstructed by sand bars.\nThe removal of rocks in the rapids would be of great benefit. Some of the rapids were only half done, and in those cases the work is not satisfactory, a portion of the water being deep and the balance left with rocks in it.\n\nIf you can get the $10,000 voted this year it will complete an important work, and be a very great help to navigation of the Saskatchewan River.\n\nYours faithfully,\n\nC. J. BRYDGES.\n\nSir Hector Langevin, &c., &c., &c., Ottawa.\n\nOTTAWA, 7th March, 1884.\n\nSir,—I have the honor to acknowledge the receipt of your letter of the 25th ult., asking for an appropriation of $10,000 this year to continue the improvements of navigation of the Saskatchewan River.\n\nI have the honor to be, Sir, your obedient servant,\n\nF. H. ENNIS.\n\nC. J. Brydges, Hudson Bay Company, Winnipeg, Man.\n\nCHIEF ENGINEER'S OFFICE, OTTAWA, 9th May, 1884.\n\nSir,—I have to ask that the sum of four thousand dollars ($4,000) be placed to the credit of Mr. C. J. Brydges in the Bank of Montreal, Winnipeg, to enable him to defray expenses in connection with the improvement of the River Saskatchewan, said amount to be taken from the appropriation \"River Saskatchewan,\" 1883-84.\n\nI am, Sir, your obedient servant,\n\nHENRY F. PERLEY, Chief Engineer.\n\nF. H. Ennis, Esq., Secretary Public Works Department.\n\nOTTAWA, 14th October, 1884.\n\nFrom Winnipeg, Man.\n\n\"Be good enough to forward cheque for six thousand dollars on account of Saskatchewan River improvements account, now overdrawn at bank, and work will soon finish.\n\n\"C. J. BRYDGES.\"\n\nTo F. H. Ennis, Esq., Secretary Public Works Department.\n\nOTTAWA, 16th October, 1884.\n\nCertificate for six thousand dollars issued in your favor to meet expenses for improvements connected with Saskatchewan River, but Auditor-General absolutely refuses to pay the amount before satisfactory vouchers shall have been furnished by you for previous payments.\n\nF. H. ENNIS.\n\nC. J. Brydges, Esq., Winnipeg, Man.\n\nOTTAWA, 16th October, 1884.\n\nDear Sir,—The Auditor-General directs me to request you to forward vouchers for the previous payments to Mr. C. J. Brydges, on account of Saskatchewan River, before passing your present application (505).\n\nI am, yours truly,\n\nJ. H. P. GIBSON.\n\nO. Dionne, Esq., Accountant Public Works Department.\n\nMONTREAL, 20th October, 1884.\n\nSir,—Your message about the payment of $6,000 on account of the sum voted for improvements in the Saskatchewan River has been repeated to me from Winnipeg.\nIt is impossible to give vouchers and accounts till the work is completed. Several gangs of men are at work at different points on the river. Not one of them is within two or three hundred miles of a post office. There are no roads to where they are working, and it will not be till they come out at the end of the season that it will be possible to get in the accounts and vouchers. The skilled workmen were sent out from Winnipeg, and I have been paying their families monthly, to be deducted from the wages sheets when time is returned. A number of Indians are being employed as workmen, and it can be readily understood what sort of vouchers can be got from them. Supplies of food have to be procured as best they can, and paid for as obtained.\n\nIt would take from six to seven weeks to send out to these different parties, at a great cost, to get any partial returns of what they have done. It can only be arranged when the parties come out of the wilderness they are now in.\n\nI undertook this work at the request of the Minister, to secure some improvement in one of the great natural highways of the North-West.\n\nI shall have completed a great improvement by the end of this season, at a cost of less than $30,000. If the work had been let by contract it would have taken a very large sum for preliminary surveys on which to base a contract, and no contractor would have looked at the work except at a great price beyond cost, owing to the inaccessibility of the location and the absence of reasonable means of communication.\n\nI have had to advance money myself to keep the work going, and as I undertook the work at the request of the Minister, with a view of saving the public money, it is rather hard to be told that funds are to be withheld until vouchers are produced, which, in the nature of the case, can only be obtained after the whole work is completed and the cash paid.\n\nI can only regret that I ever undertook the work, which I only did to oblige the Minister, at his request.\n\nP.S.—I shall be here till Friday.\n\nI am, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. ENNIS, Esq., Secretary Department of Public Works, Ottawa.\n\nOTTAWA, 27th October, 1884.\n\nSir,—I beg to acknowledge the receipt of your note of the 16th inst., giving reasons why you refuse to pay the $6,000 applied for in favor of Mr. Brydges, for improvements on Saskatchewan River; and to state that Mr. Brydges, on being informed of this refusal, sent a letter, of which I enclose a copy, giving reasons why he cannot now furnish the vouchers for previous payments.\n\nThe Hon. the Minister approves the reasons given by Mr. Brydges.\n\nI have, &c.,\n\nF. H. ENNIS.\n\nJ. L. McDougall, Esq., Auditor-General, Ottawa.\n\nOTTAWA, 29th October, 1884.\n\nSir,—Having reference to your letter of the 20th inst., acknowledging the receipt of the telegram of this Department, dated 15th inst., respecting the advance of $6,000 asked for by you on account of Saskatchewan River improvements, and stating that on account of the nature of the work it will not be possible for you to procure vouchers for previous advances until the completion of the work, I am directed to inform you that the Auditor-General, who raised the objection to making a further advance before the previous ones were accounted for, is satisfied with the explanation made, and the $6,000 asked for has been placed to your credit in Bank of Montreal, Winnipeg. I am further directed to return to you the pay lists and accounts submitted in connection with the first advance of $1,500, together with a copy of a memorandum from the accountant of this Department, showing why they\ncannot be accepted in this present state; and to ask you to be kind enough to furnish\nthe additional information required.\n\nI have, &c.,\n\nF. H. ENNIS, Secretary.\n\nC. J. BRYDONS, Esq., Land Commissioner, H. B. Co., Winnipeg.\n\nHUDSON BAY COMPANY, WINNIPEG, 30th December, 1884.\n\nSir,—I now beg to send you a report of the proceedings in regard to the improve-\nment of the Saskatchewan River during the past season.\n\nI enclose herewith a report from the superintendent whom I employed to carry\nout the necessary work, and which will give full information in regard to the work\nwhich has been done.\n\nThe weather in the early part of the season was very unfavorable indeed for\noperations of this kind, and the consequence has been that the season for work was\nshortened more than usual.\n\nThe principal part of the work done during the last season was on Cole's Falls,\nabove the junction of the south branch, and between the forks of the two rivers and\nPrince Albert.\n\nCole's Falls has been one of the most difficult places for navigation on the river,\nthere being a long succession of rapids, with boulders, at points, which in a low stage\nof water have materially shortened the time during which it was possible to navigate\nwith steamers. The work done this year, as described in the enclosed report, will\nmake Cole's Falls very much more easy to be passed over by steamers than it has\nbeen hitherto, and the large boulders which have been removed will enable the river\nto be navigated to a much later period than has heretofore been possible.\n\nSome years ago I passed over Cole's Falls myself in a \"York\" boat, in the month\nof September, and the water was so shallow that although the boat in which I was\nonly drew 1 foot of water, we stuck for an hour upon a boulder in one of the rapids,\nand had great difficulty, even in a light boat such as I have mentioned, in getting\ndown to the forks of the Saskatchewan.\n\nThe river between the forks and Edmonton has been very much improved by the\nwork which has been done during the last two years. As much work as can be done\nwithout larger appliances has now been executed, and if any further work is to be\ndone it will have to be undertaken on a more extensive scale and with heavier and\nmore effective appliances; but, as I have already said, what has been done during\nthe last two years will make a considerable improvement in the navigation of the\nriver.\n\nThe enclosed report further proceeds to give a description of the condition of\nmatters on the south branch of the Saskatchewan, between the forks and a point\nabout 100 miles to the westward.\n\nIn this it will be seen that there are twenty-eight rapids, in which a great\nimprovement could be effected by the removal of boulders, as described in Mr.\nBurbank's report.\n\nA great improvement could be made in this 100 miles of the south branch by the\nuse, next season, of appliances similar to those which have removed so many boulders\nfrom the north branch, but it would undoubtedly be much more effective and, in the\nend, cheaper, to employ a steamer with proper appliances, both to remove boulders,\nto make wing dams where necessary, by driving piles, and to put the currents in\nsuch a position as will cut through sand bars, which are now an impediment to navi-\ngation.\n\nThe boats which were employed this year, with the tools, &c., belonging to\nthem, have been laid up in proper positions, so as to be secure from damage when\nthe ice breaks up in the spring.\n\nI further beg to enclose statements of the expenditure which has taken place in\nperforming the works which I have referred to in this report.\n\nThe total expenditure for the season has been $8,229.61. Full details of this\namount accompany this letter.\nI also enclose a memorandum showing disbursements which have been made, and for which no vouchers have been obtained. An examination of this list will show that there are expenses, such as railway fares, and similar outlays, for which it is almost, if not quite, impossible to get vouchers. For everything, except the items in the list to which I have referred, proper vouchers will be found amongst the accounts.\n\nA man has been left in charge of the boats and their outfit, under an arrangement by which he is to receive rations to the value of $10 a month, with the understanding that if any works are carried on next year he will be employed in a capacity similar to that in which he has been employed during the past season.\n\nIf no works should go on next season his engagement will cease, upon the payment of the $10 a month during the winter, whilst he is in charge of the property belonging to the Government.\n\nI have now at the credit of this account, in the Bank of Montreal, the sum of $1,773.82, which will be subject, of course, to any accounts that may come in, although I do not expect that there will be any, beyond the $10 a month to the man engaged to look after the property of the Government at the place where it has been laid up for the winter.\n\nI have the honor to be, Sir, your obedient servant,\n\nC. J. BRYDGES.\n\nF. H. ENNIS, Esq., Secretary Department of Public Works, Ottawa.\n\nWINNIPEG, 28th November, 1884.\n\nDear Sir,—I now beg to report upon the work done during the past season in improving the navigation of the Saskatchewan River.\n\nOn the 19th May I started foreman Beaupré with two men for Edmonton, by way of Calgary. They arrived at Edmonton about the 1st June, where they built a cheap flat boat to carry supplies for the season to the working boats further down the river.\n\nIt was at first intended that I should start up the lake with a larger force of men, but owing to the lateness of the opening of navigation upon the lake this plan was changed, and I left for Edmonton on the 8th June, by way of Calgary, arriving at Edmonton on the 18th. By this time the boat built by Beaupré was ready with provisions to start down the river, but I was delayed at Edmonton for some time, from the fact that my outfit was delayed by high water at Battle River.\n\nI started from Edmonton on 14th July with my entire party and supply of provisions.\n\nMy first proceeding was to place targets, with numbers, on all the islands between Edmonton and the forks of the south branch—the object being to act as a guide to steamboat men to show where they are.\n\nAfter this was accomplished I concentrated my entire outfit on the work to be done at Cole's Falls for the season. I did this at the request of the steamboat people.\n\nI secured the services of their most competent pilot, and went carefully over Cole's Falls, marking all such boulders as they wanted removed.\n\nMy upper boat started to work on strong water, about nine miles above the head of Cole's Falls; took out a very large boulder in what would be shallow water at a low stage of the river. This required seven days' work of the gang, the water at this time being too high to work to advantage. Rapids No. 2.—Took out three very large boulders, occupying about four days.\n\nAt Rapids No. 3 (Little Demi-charge) took out three boulders on a crossing above the rapids to connect the channel, and four large boulders in the rapids itself.\n\nRapids No. 4. No work required.\n\nNo. 5. Three large boulders taken out.\n\nNo. 6. No work required.\n\nNo. 7. One boulder about 1,000 feet above the rapids, and three large boulders from the rapids.\nNo. 8. One very large boulder taken out from the foot of the rapids.\nNo. 9. Three large boulders taken out—one from the head of the rapids,\nand two from the rapids themselves.\nNos. 11 and 12. Took out a very large boulder from the centre of each\nof these rapids.\n\nThis completed the season's work of the boat, which was brought down from\nVictoria.\n\nThe work performed by the other boat and gang was as follows:—\n\nRapids No. 13. No work required.\nNo. 14. Four large boulders taken out.\nNo. 15. One large boulder taken out from the centre of rapids.\nNo. 16. One taken in centre of the river, about 1,500 feet above the head\nof the rapids; three taken out from the rapids.\nNo. 17. One large boulder taken out from the head of these rapids.\nNo. 18. Two large boulders taken out from the rapids, and one at the\nfoot of the rapids.\nNo. 19. Three boulders taken out at the head of rapids.\nNo. 20. Four large boulders were taken out.\n\nAt the steamboat landing, a short distance below the foot of No. 20, one boulder\nwas taken out. The weather turned out so very unfavorably that further work had\nto be discontinued about the 20th October.\n\nOn the 10th October I started from Prince Albert with a party to examine the\nsouth branch, and proceeded across the country, striking the south branch about 100\nmiles from the forks.\n\nI found, on going down the river, that there were 28 rapids.\n\nI will now proceed to report upon what, in my opinion, is required to be done to\nmake the river a good navigable stream.\n\nAt the point where I first struck the south branch, about 14 miles above the\nupper end of the Indian reservation on the river, there is a section of the river of\nabout a mile and a-half of low water, where a considerable number of boulders would\nrequire to be removed.\n\nFrom this point to the lower end of the Indian reserve, a distance of about 40\nmiles, the river is good.\n\nAt the lower end of the reserve there is one large boulder, which would require\nto be removed. About 1,000 feet further down there is some strong water (not a\nrapid) with three boulders requiring to be removed.\n\nAt the mouth of Red Deer Creek two boulders to be removed.\n\nRapids No. 1. Two boulders, 4 feet of water in the channel, and at this time\nwater is at low stage.\n\nNo. 2. No boulders; channel 5 feet.\nNo. 3. One boulder; channel 3 feet.\nNo. 4. No work to be done; channel deep.\nNo. 5. One boulder at head of rapids; channel 3 feet.\nNo. 6. One boulder in centre of rapids and one at the foot; channel 4\nfeet.\nNo. 7. No boulders; channel 3 feet 6 inches.\nNo. 8. Is 150 feet below No. 7; two boulders; channel 3½ feet deep.\nNo. 9. One boulder at head of rapid; channel is 3 feet.\nNo. 10. Four boulders; channel 3½ feet.\nNo. 11. One boulder at foot of the rapid; channel 4½ feet.\nNo. 12. One boulder; channel 3 feet.\nNo. 13. do do do do.\nNo. 14. No boulders to be removed; channel between two large boulders;\n4½ feet.\nNo. 15. Channel is bad, wide and shallow; five boulders; channel 3 feet,\nscant.\nNo. 16. Three boulders; channel deep.\nNo. 17. One boulder; channel good; 3½ feet deep.\nNo. 18. Is at Jack-on-Ranche; two boulders; channel 3½ feet.\nNo. 19. Two boulders; channel good; 4½ feet.\nNo. 20. One boulder; rapid is short, but current very strong; channel 4 feet.\nNo. 21. No work required; channel is good and plenty of water.\nNo. 22. — do — do — do — do.\nNo. 23. One boulder at the foot of the rapids; channel 1½ feet deep; about 2,000 feet below this is a large boulder, which would have to be removed.\n\nFrom this point back to Jackson Ranche may be called a continuous rapid, but the channel is good, and there is no serious impediment to navigation. Nos. 24 and 25 are, in my opinion, the worst rapids on the river (see sketch).\n\nI would recommend that the boulders marked thus * should be removed, and a wing-dam constructed as shown on sketch, and that a channel be opened through from the point opposite the wing dam marked with a cross line \"cut off this point.\" This would enable boats to avoid the eddy as shown on the sketch.\n\nRapids No. 26. Two boulders in rapids, and one boulder at foot of rapid; channel 4½ feet deep.\nNo. 27. No boulders; channel good; 4½ feet.\nNo. 28. One boulder; channel good; 4 feet.\n\nThis rapid is about half a mile above the forks.\n\nIt would appear that the same strata of rock which forms Cole's Falls extends across the country and causes rapids on the South Branch, but of course not to any such extent.\n\nAt the same stage of water the South Branch is very much superior to the north branch of the Saskatchewan for purposes of navigation—that is, as far up the south branch as I had an opportunity of inspecting—say, a distance of 100 miles.\n\nThere were no rapids on the south branch where a line would be required for a steamboat ascending the river, as has to be used at Cole's Falls and other points on the North Saskatchewan.\n\nAs I have said, operations for the season were discontinued on 20th October, and boats were laid up with outfit of all kinds on board, about one mile from the forks on the main river, on the north side of the river. They are laid up about 12 feet above low water mark, and a watchman has been left in charge of them.\n\nYours truly,\n\nE. A. DURBANK, Supt. Saskatchewan River Improvements.\nC. J. BRYDGES, Esq., Winnipeg.\n\nOTTAWA, 10th March, 1885.\n\nDear Sir,—I would respectfully request that you will have a sum placed in the Estimates to cover the expenses of a survey of the Saskatchewan River, with a view of improving that great river for navigation.\n\nI am yours truly,\n\nL. McCALLUM.\n\nHon. Sir Hector LANGEVIN, Minister Public Works.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001369.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 41, "total-input-tokens": 64426, "total-output-tokens": 35421, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2368, 1], [2368, 5534, 2], [5534, 8681, 3], [8681, 12323, 4], [12323, 15604, 5], [15604, 19613, 6], [19613, 23303, 7], [23303, 26580, 8], [26580, 30668, 9], [30668, 34502, 10], [34502, 38341, 11], [38341, 41805, 12], [41805, 45640, 13], [45640, 49195, 14], [49195, 52639, 15], [52639, 56123, 16], [56123, 59886, 17], [59886, 63647, 18], [63647, 67601, 19], [67601, 71310, 20], [71310, 74971, 21], [74971, 77927, 22], [77927, 80993, 23], [80993, 84392, 24], [84392, 87992, 25], [87992, 92050, 26], [92050, 95329, 27], [95329, 98721, 28], [98721, 102012, 29], [102012, 106095, 30], [106095, 110166, 31], [110166, 114007, 32], [114007, 117636, 33], [117636, 121221, 34], [121221, 124544, 35], [124544, 126989, 36], [126989, 130613, 37], [130613, 134325, 38], [134325, 137938, 39], [137938, 140954, 40], [140954, 143529, 41]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]