[{"id": "b478753e1e92e5154cd2fbd38b0760af6b18ca54", "text": "THE RIEL REBELLION\n\n1885\n\nFIRST EDITION.\n\n\"WITNESS\" PRINTING HOUSE, MONTREAL.\n\nTWENTY-FIVE CENTS.\n\nPREFACE.\n\nNo volcanic eruption ever broke out more unexpectedly than the rebellion in the North-West. There were not wanting warnings, but those they reached looked upon them as the outcome of fear or partizanship. Whatever their grievances or distress, it could not be imagined that a few poor half-breeds would raise a standard against British power. After the outbreak, serious events followed each other rapidly. Interest in what was impending always left little thought for realizing what had happened. Descriptions by mail of what was a fortnight past tumbled in on the heels of the telegrams of yesterday. Now that the rebellion is over, an orderly knowledge of the events in their sequence and relations will be desired by everyone. In this work, care has been taken to preserve only the romance of truth, discarding apocryphal embellishments. Substantial accuracy can be vouched for, although some details will probably require correction from sources not yet available.\n\nCHAPTER I.\n\nVIVE LA NATION METISSE.\n\nOn the 17th of March, 1885, a rumor, designedly started, ran through the half-breed settlements scattered around the little church of St. Laurent, on the right bank of the South Saskatchewan river, that the \"police\" were crossing to suppress \"La Nation Metisse,\" and to seize its political and religious leader Louis David Riel. There was a hurried gathering, of which the few prominent and active men of the little community who were on hand, evidently not surprised, formed the greater part. There and then \"The Metis Nation\" was declared to be established, the authority of the Provisional Government of the Saskatchewan was proclaimed, and both were to be maintained, if necessary, by force of arms. Runners were sent to arouse the half-breeds and to secure the alliance of the Indians, and Louis Riel, who had just been elected President, is reported to have said \"The Rebellion is a fact.\"\n\nLouis Riel, the President, is inclined to revolution by birth as well as by character. He is said to be descended from a dashing young Irishman, possibly an O'Reilly, who came to Canada about the beginning of last century. His father, Jean Baptiste Riel (pronounced Re-alle), who had but a dash of Indian blood in his veins, headed an outbreak, in 1849, against the Hudson's Bay Company in the North-West, rescued a prisoner and became so powerful that the Honorable Company felt compelled to purchase his favor. The means thus obtained brought increasing consideration, which culminated in young Louis being sent to be educated at St. Mary's, commonly called the Jesuit's College, in Montreal, for the priesthood. That this institution had but crude material to work on in the young barbarian may be judged from the following preserved specimens of his early business correspondence:\n\nWhit Horse Plant\nMy dear Sir I sent to you your Silver Fox........... 20\nand 10 pounds.................. 16\nand two Robins.................. 1.15\n116 lbs Pincan.................. 1.9.94\nI am your serv\nLa Riel\n\nbuy Mr. Frise son\nMy dear Sir if it is possible to put his Horse in with your biga you\nPrefis du rival que\nMonsieur, Je ne peux ansais par le garcon de\nMr. Frise 18 pair de soulier a 4.11s Monsieur j'ai trouvez due toreau mais j'attent pour\nla repons afin de netre le bateau vous pouvez\nenvoyer l'argent et je serais heureux.\nJe suis votre serviteur\nLa Riel\nle 9 decembre 1883.\n\nHe was a relative and protege of His Grace Archbishop Tache, of St. Boniface, who was destined to be his protector in manhood as in boyhood. He did not enter the priesthood, but studied law without much success in the office of the Hon. Mr. Laflamme, and eventually returned to the North-West, a rather moody youth, of a melancholy turn of mind, full of Byronic moods about being uncomprehended, but with religious tendencies as a result of his training. He had made little impression upon his associates, and it was with wonder they heard, in 1869, that he was the leader of the rebellious half-breeds of the Red River valley. His claim at that time, and that of the small native population whom he led, was that they were not in rebellion, but were, as the natural owners of the land, bound to resist invasion from a government which had taken over their territory in pursuance of an agreement with a trading company, to which their consent was not asked and in which their rights of property and of self\ngovernment were entirely ignored. Riel's regime was, for a time, characterized by moderation as well as energy, but the brutal slaying of Thomas Scott alienated the sympathies of the better people, and when the expedition under Colonel Wolseley for the establishment of the Canadian authority reached Fort Garry, Riel had fled as a lonely fugitive. His position as a former protégé of a high ecclesiastic may have had something to do with the prominence accorded him by his followers, and the advantages which he demanded for the church were calculated to assure his followers of its approval of him. Even after his flight he retained such influence that the Government sought and obtained Archbishop Tache's aid to induce him, upon the payment secretly of a considerable sum of money, to leave the country. Though an outlaw, he was returned to parliament by the constituency of Provencher, and actually appeared in the Chamber and signed the roll. He immediately disappeared, however, and was nowhere to be found. It was afterwards learned that he had been for a time at the residence, at Terrebonne, of Madame Masson, the patroness of his college years, and that later he had been at the provincial asylum for the insane at Beauport, whether as a parlor lodger or as a raving lunatic is still a vexed question among those who knew him there. Still later, it was known that he had found a refuge among the Metis in Montana, where he was a \"professor\" at a Jesuit \"college.\" In the summer of 1881, when the half-breeds of the territories of Saskatchewan and Assiniboine wanted a leader who could attract the attention of the Government to their claims and grievances, they sent for Louis Riel, at the little mission of St. Peter's, at the base of the Rocky Mountains. He returned, but not with the fiery-looking, determined face, the imperious glance and the confident bearing of the young adventurer of 1869. The Louis Riel who, during the fall and winter of 1884, addressed meetings at the half-breed settlements throughout the North-West, was a rather shabby man, with a neglected beard and a restless eye, whose apprehensive glances gave him a hunted aspect.\n\nHe appeared twenty years older than a man of forty-one years. He was now a sort of professional rebel, anxious to make capital out of his talent for stirring up dissatisfaction. At first he spoke only of obtaining a recognition of the claims of the half-breeds, and redress of their grievances by constitutional methods. In the month of September, at a public meeting at St. Laurent, he submitted a Bill of Rights, which was unanimously agreed to, and which, it was understood, was to be forwarded to the Government at Ottawa. The list of claims is a remarkable one. It reveals clearly that the men who drew them up had rebellion in view, and that they were possessed of a good deal of political skill and sagacity. The claims in effect were: (1) The subdivision into provinces of the North-West Territories; (2) the half-breeds to receive the same grants and other advantages as the Manitoba half-breeds; (3) patents to be issued at once to the colonists in possession; (4) the sale of half a million acres of Dominion lands, the proceeds to be applied to the establishment in the half-breed settlements of schools, hospitals, and such-like institutions, and to the equipment of the poorer half-breeds with seed-grain and implements; (5) the reservation of a hundred townships of swamp land for distribution among the children of half-breeds during the next one hundred and twenty years; (6) a grant of at least one thousand dollars for the maintenance of an institution, to be conducted by the nuns in each half-breed settlement; and (7) better provision for the support of the Indians.\n\nThis document was a bold bid for the support of all peoples and powers in the North-West. The English settlers wanted political rights; these were appealed for in the first clauses. Many of these regarded the agitation at the beginning with favor, as likely to secure the redress of real grievances. Riel expected their support and complained bitterly that they deserted as soon as decisive action was called for. They saw, however, that the half-breeds had determined to rebel, and took no part in the movement. The demand for subsidies for schools and nurseries was a bid for the support of the church. \"The priests were for me and they were against me,\" said Riel. \"They are against me now, not because I rebelled, but because I did not succeed in helping them.\" The half-breeds to the third and fourth generation were to be provided for if these demands were enforced. The last demand is significant, as it reveals the fact that from the first an Indian rising in support of the half-breed rebellion was counted upon.\n\nThat Riel intended to take part in actual rebellion himself is more than doubtful. The story was that, the people, when he tried to depart, retaing his services with a pistol. When asked why he fought, Riel declared \"The people compelled me to fight. I told them last winter that our Bill of Rights had done its work; they would get all that was just in due time. They said I could not go away; the matter was stirred up and I must fight it out.\" There is reason for doubting the sincerity of his belief that the bill \"had done its work,\" and of his desire that it should do its work, as his own purpose was to create trouble in the hope that he would be bribed, as he was in 1870, to leave the country. Sir John Macdonald, the Premier, declared in Parliament that the Government had never received the Bill of Rights, and he also stated that Riel had made an offer to the Government to leave the country for $5,000, the same amount which he had received in 1870.\n\nThe men whom he had stirred up to rebellion were, however, in thorough earnest. The Metis (pronounce this name Metseo) are the descendants of those energetic and adventurous voyagers, trappers and Hudson's Bay employees, who made their way amid great difficulties and dangers to a country then out of the world; with the blood of these there mingled in their veins that of probably the finest dark race in the world. Unlike other mixed races the Metis are strong in physique and strong in mind, and are quite able to hold their own with the pure white in the race of life. A Metis, inheriting the energies of many races, is to-day the Premier of the constitutional government of Manitoba. These bold, energetic men, long accustomed to provide for and protect themselves and their families amid exciting scenes, were reactive under the monotony of farm life to which they had been driven by the disappearance of the buffalo and of fur animals, and by the construction of railways which rendered \"freighting\" unnecessary. When their rights to the land were not recognized, when the surveyors threatened to square their lane-like farms into quarter sections, they grew pugnacious. Bred among territorial feuds, they were not reluctant to revert to what was their former condition, and, insane as it looks to people with a knowledge of the resources of a Government like that of the Dominion, were ready to attempt by force to overthrow the authority of the Canadian Government in the North-West. Riel had inspired them with a belief in his power to bring the Metis of the United States and the Indians of the whole West to his aid. He probably also made prodigal promises of Fenian assistance. He adopted the role of a religious mystic, which probably came naturally enough to a man of his temperament and training, and by mysterious and incoherent utterances appealed to the superstitious element which is naturally strong in the wanderer in the wilds. From among men such as these, and of this temper, the Provisional Government was formed on St. Patrick's Day.\n\nThe Adjutant-General, Gabriel Dumont, was an old buffalo hunter and Indian fighter who had fought on both sides of the line, and had taken more human lives, if not scalps, than any other man on the prairie. The story goes that at a sun-dance or a moon-dance, or some other festival of the Blackfeet, the braves were, according to custom, boasting of their individual prowess, when Dumont, uninvited, jumped into their midst and, flourishing his rifle, exclaimed\n\"I have killed twenty Blackfoot.\" His bravado, true enough, perhaps, was so daring that it won the admiration instead of the natural vengeance of his enemies. If he planned the defense of Batoche he was not only courageous but a skillful leader with a natural genius for engineering. To the members of Riel's Council that sage gave the title of exzoides, which he explained with some little pride, probably, in his learning, to have been adapted from two Latin words, \"ex\" from, and \"avis\" a flock, (sic) and was meant to signify that none claimed any individual authority, and this word was signed to all official documents. Besides Dumont, they were F. Jackson, President's Secretary; Jean-Baptiste Boucher, Donald Ross, Pierre Henri, Moise Ouellette, Damase Carriere, David Tournaud, Pierre Guirdepuy, Albert Monkman, A. Jobin, Bonnet Blanc (White Cap), Chief of the Sioux; Beardy, Chief of the Crees; Chas. Trottier, Bass Bull, from Battle River; N. Delorme, B. Parenteau, E. Champagne; Phillipe Garnot, Secretary of the Council; H. Dumas; Octave Regnier, Assistant Secretary of the Council; Joseph Gondol, Lieutenant of Guards; Antoine Champagne, A. Turgeon, Captain of the Horse; J. Parenteau, replaced by M. Richelieu; N. Carrier, Alex. Lebeau, Barez, the Sioux interpreter, M. Garneau and Thos. Vermett, Messenger of the Council.\n\nMAJOR L. N. F. CROZIER,\nSuperintendent of the North-West Mounted Police.\n\nCHAPTER II.\nTHE DUCK LAKE FIGHT.\n\nThe Provisional Government acted with promptitude. On the 18th of March, Mr. Lash, the Indian agent at Duck Lake, and his interpreter were made prisoners, as well as other loyalists and freighters passing through to Prince Albert. At midnight the telegraph line was cut south of Duck Lake, the wire going wide in the middle of an important telegram about the state of affairs. All loyalists' stores in the settlements were taken over by Riel's Government, and on the evening of March 25th the Duck Lake Post was captured, with all the Indian and Government stores there. The reservation of Beardy, the half-breed chief of a small band of about one hundred and sixty Indians, was just west of Duck Lake. He was known as one of the worst behaved of the chiefs, and one who had already given the Mounted Police much trouble. By promising him the opportunity to plunder, the support of his warriors was assured.\n\nThe officers of the Mounted Police knew that trouble was brewing among the half-breeds of St. Laurent, and Major Crozier with a force of seventy-five men had occupied Fort Carleton, an old Hudson's Bay post on the North Saskatchewan, about twelve miles west of Duck Lake, to watch the half-breeds. With a force of sixty Mounted Policemen and forty volunteers from Prince Albert; whom he had sent for, Major Crozier started on the morning of the 26th March to bring away the Government stores and other property which were at Duck Lake. Major Crozier, who had served on the force for twelve years, and had sniffed out two or three incipient Indian wars, had proved himself a brave, prompt, and resolute man. When near Beardy's reserve, and about two miles from Duck Lake, a number of armed men were discovered in a coulee, or ravine lightly fringed with poplars, through which the trail led. A white flag was flying, and while Major Crozier and his interpreter, Mackay, went forward to call upon the men to surrender their arms, the police and volunteers, who had been brought in sleighs, alighted and commenced extending in a skirmishing line. Crozier's demand was met by the question from Gabriel Dumont, who led the rebels: \"Is it to be a fight?\" Major Crozier believing that the rebels were about to fire upon him, ordered his force to commence firing. The rebels had already occupied two houses, not visible from the road, and from these, as well as from the coulee, they fired upon the force. While the Mounted Police, with the aid of a seven-pound gun, were trying to dislodge the rebels in the coulee, the Prince Albert volunteers advanced, firing upon those in the house. The volunteers lost heavily and failed of their purpose. The fight went on at short range for half an hour, when the Mounted Police had expended all their ammunition, the gun having become useless after a few rounds. Seeing that the rebels were creeping around by the edges of the coulee, and that his men were in danger of being outflanked and hemmed in by a greater number, Major Crozier gave the order to retreat, which was carried out, the little force leaving their dead on the field but taking with them their useless gun and the wounded. In that engagement of half an hour, out of one hundred police and volunteers, fourteen were killed and nine severely wounded. Eleven of the killed were out of the forty Prince Albert volunteers. The names of the patriotic dead, the first on the death-roll of this war, were: Captain John Morton, Wm. Napier, James Blakely, Skeffington C. Elliot, Robert Middleton, D. McPhail, Charles Hewit, Joseph Anderson, D. Mackenzie, Chas. Page, and Alexander Fisher, civilians, and constables T. J. Gibson, Garrettty and J. P. Arnold of the Mounted police force. The class of settlers in the Canadian North-West may be guessed from the fact that of the eleven civilians killed one was the son of a Judge, and cousin of the leader of the Opposition in the Dominion Parliament, one was a nephew of Sir Francis Hincks, a former Canadian Premier and Governor of the Windward Isles, one was a son of Sir Charles Napier, and one a nephew of the celebrated Nova Scotian Statesman, the Hon. Joseph Howe. On their way back to Fort Carleton Major Crozier and his decimated force were overtaken just at the gates of the stockade by Colonel Irvine, who had arrived from Qu'Appelle with the long looked for reinforcement of one hundred mounted policemen.\n\nFort Carleton was a fort only in name, having no fortification but a stockade, and being in a valley it was untenable. Besides it was supposed the whole force was needed to protect the town of Prince Albert and the settlers who had sought refuge there. It was decided to abandon the place, and while this was being done the wooden houses took fire and it was with difficulty the wounded men were saved. The train of sleighs filled with the frightened families of settlers, and the severely wounded men, and guarded by troops, some of whom were suffering acutely from a sense of defeat, turned north-eastward to traverse forty miles of country presumably swarming with victorious rebels. The news of the evacuation of the fort was received about two weeks before the news of their safe arrival at Prince Albert. The suspense during that interval was the most painful of many gloomy periods during the war. Prince Albert with three hundred armed men was safe from attack, but, with its greatly augmented population, fears were entertained of the provisions running out before it was relieved. At the Duck Lake engagement the rebel's force numbered two hundred, and their loss was six killed and three wounded. Beardy's Indians were not present, they being detached to guard against an attack by Colonel Irvine, who was known to be close at hand. On the 27th, Riel sent a prisoner to Fort Carleton with a message to Colonel Irvine to send wagons for his dead, which was done, two of the other prisoners being given leave to put the bodies in places where they would be safe. In the meantime Fort Carleton was occupied by Riel on the 31st March, but was evacuated hurriedly at midnight on the 2nd April; on the 4th April Duck Lake was evacuated after the buildings had been gutted and fired. The political portion of the Provisional Government had not been idle while the military section had been so busy. It\nhad established a reformed religion for the Metis nation and had formulated the following creed:\n\n\"We believe all believers constitute the true church. We do not believe in the infallibility of the Pope. We believe in the inspiration of the Holy Scriptures and the right of every man to learn the truths they contain. We believe in a regularly ordained ministry. We believe in a form of church government, preferring the episcopal. We believe there is one God. We pray to God, to Christ, to Mary, to the saints. We believe in the final salvation of all men.\"\n\nRiel had proclaimed himself to be \"Elias who was to come and change all things,\" and to begin with he changed Saturday into Sunday.\n\nCHAPTER III.\n\nTHE INDIAN RISING.\n\nThe success of the Metis at Duck Lake excited the Indians on every reserve throughout the North-West. Without industry, and improvident, they are, in spite of Government aid, always hungry and in want, and ever ready to supply their wants by plunder if there is any chance of success. The reserves of the strongest and most warlike tribes were, however, within easy striking distance of the Canadian Pacific Railway, and the chiefs, knowing how swiftly a blow could be struck against them, curbed the restless young braves, and wrote characteristically eloquent letters, alleging their perfect loyalty to the Government, which they transmitted by telegraph. Their loyalty was confirmed, doubtless, by generous gifts of extra food and tobacco.\n\nOne hundred and eighty miles north of the railway, at the junction of the Battle and North Saskatchewan rivers, is the town of Battleford, within a compass of thirty miles of which were the reserves of large bands of Cree and Stoney Indians, numbering in all over two thousand. The abandonment, by the Mounted Police, of Fort Carlton, which lies between Battleford and Riel's head-quarters at Batoche, allowed free intercourse between him and these Indians who could not resist a prospect of plunder and the war-path. On the night of the 29th March, the Indians were reported to be advancing upon Battleford, and some three hundred settlers and townspeople thronged into the stockade at Battleford, which is on the point formed by the junction of the Battle River with the North Saskatchewan. Col. Morris, who was in command of the Mounted Police post and the local company, into which all the able-bodied men enrolled themselves, had already set his force to work building bastions and preparing for a siege, and that night was passed under arms. The next day the Indians made their appearance on the south bank of the Battle river, and the plunder of the stores and dwellings in the old town commenced. These Indians were of Poundmaker's tribe, and there were probably not more than one hundred of them, but they were soon after reinforced. On the morning of the 31st, at 3 a.m., a tall Indian forced his way into the bedchamber of George Applegarth, the farm instructor of Red Pheasant's band, at the Eagle Hills, about twenty miles south-west of Battleford, and warned him that the Indians of the reserve were up and he left Battleford on the 29th, he was in constant danger. Upon the same night that Applegarth was attacked, the Stoneys of Mosquito's band, on the reserve adjoining Red Pheasant's, murdered their farm instructor, Payne, who, two days before, had been assured of their loyalty. The united bands, numbering about one hundred fighting men, joined Poundmaker, and soon an army of five or six hundred Indians lay around that place. The Indians made no attack upon the barracks, which, situated on a high bluff on the river side, were as impregnable to an Indian force without cannon as the Rock of Gibraltar, but in trying to plunder that part of the town nearest the fort they frequently came within range of the seven-pounder gun, and it was used vigorously and with effect upon several occasions. The period of the siege was anxious but comparatively uneventful save for the occasional arrest of a half-breed for one offence or another, and for the adventures of the scouts who attempted to communicate with the surrounding posts.\n\nCHAPTER IV.\n\nTHE FROG LAKE MASSACRE.\n\nAt almost the same time as the outbreak at Battleford, about a hundred and fifty miles to the west, there occurred a series of incidents without parallel in the history of Canada. Fort Pitt, station of the Mounted Police, on the north bank of the North Saskatchewan, about one hundred and twenty miles to the north-west of Battleford, was held by a garrison of some twenty men, under the command of Captain Dickens, a son of the great novelist, who had come to Canada and become an Inspector in the force. Thirty miles to the north-west of this again was the Indian station and mission of Frog Lake, situated on the reserves of a couple of Indians who were under the influence of that suspicious and moody chief, Big Bear.\n\nOn the 30th of March news of the Duck Lake fight was received by Mr. T. T. Quinn, the Indian agent at Frog Lake. The option was given him by Inspector Dickens of coming to Fort Pitt with all the people at Frog Lake, or of being joined by the garrison of Fort Pitt. A council of war was held, and it was decided that the squad of police at Frog Lake, only seven men, should be sent away at once, as, while too few to protect the people in case of an attack, their presence irritated the Indians. The people believed they would be safe if the police were gone, and they hurried their departure. As the police left they heard the whoop of the war-dancers in Big\nFORT PITT.\n\n1. Barracks, held by police. 2. Fur Store, held by police. 3. Hudson's Bay House, held by Hudson Bay men. 4. Provision Store, held by police. 5. Unoccupied Houses. 6. Trails from Frog Lake, over hills, by which scouts came. 7. River Bank (North Saskatchewan) 200 yards from fort, which Indians were encamped. 8. Spot where Loasby and his horse were shot, and whence he ran to the fort. 9. Brush on hill, 500 yards back of fort. 10. Hills behind river by which police retreated. 11. Spot where Cowan fell. 12. Ploughed Land. 13. Trail to Bear's camp. Before dawn of the following day, the dancers, whom the Mounted Police while departing had heard whooping, all Indians of Big Bear's band of plain Crees came in a body to the Indian agency and entered it. T. P. Quinn, the agent, was a Sioux half-breed, who, with his cousin Harry Quinn, had passed through all the horrors of the Minnesota massacre, and although married to a Cree woman was hated by the Indians. Bad Child, a son of Big Bear, and another rushed upstairs with the avowed purpose of shooting the agent in his bed, but his brother-in-law, Loveman, followed them and prevented the crime by throwing himself in front of the levelled fire-arms. These two went downstairs again and the place was ransacked, the Indians contenting themselves with the firearms in the office and the horses in the stable, however. Travelling Spirit, one of the band, came to the foot of the stairs, after an interval, and called to Quinn, \"Man-who-speaks-Sioux, come down.\" Loveman tried to prevent his brother-in-law from showing himself, but Quinn went down. He was at once forced to go to the house of Delaney, the farm instructor, where the Indians were gathering together all the whites at the post. Travelling Spirit, Big Bear's chief councillor, with a small party went to the Hudson's Bay store, where they found Mr. W. B. Cameron, the agent who was in charge, already up. Bad Child went into the house alone and demanded from Cameron all the ammunition in the store. The Mounted Police had taken nearly all the fixed ammunition and a keg of powder to Fort Pitt, so that Mr. Cameron, at the muzzles of loaded guns, made no difficulty about giving up the little that remained, and, accompanied by the greater part of the band, he went to the store and gave it to them. While he was getting it out for them Big Bear came in and ordered the Indians not to touch anything but to ask Cameron for what they wanted. Several preferred requests for small articles, which were given them, and all went out quietly. Cameron followed to see what they were going to do, and Travelling Spirit rushed up to him as soon as he came out and forced him to accompany him to the Indian Agency, where nearly all the white men of the settlement had been brought from Delaney's house.\n\nTravelling Spirit went up to the agent, Quinn, and demanded: \"I want to know who is the chief of the whites in this country. Is it the governor of the Hudson's Bay Company or who?\" Quinn, who did not take the matter at all seriously, answered, \"There is a man at Ottawa called Sir John A. Macdonald who is the head of affairs.\"\n\n\"Give us beef!\" yelled a number of the Indians, and upon the rest taking up the cry Quinn asked Delaney if he could not give them an ox. Delaney said he had one or two, and most of the Indians made off to secure the animals. So convinced were the little band that the Indians would commit no serious excesses, that they appear to have had no serious misgivings whatever. The two priests, Fathers Fafard and Marchand, men who had devoted their lives to the Indians, went to their little\n\"MOUNTED POLICEMAN COWAN,\nKilled during the Fort Pitt engagement.\n\nchurch, and calling their flock together began the celebration of the service of the day. It was Good Friday, the 3rd of April, and none dreamed that the Easter sun would rise for but few among them. The Indians went to the church almost in a body, but they took their prisoners, every white in the settlement except Cameron and the factor's wife, Mrs. Simpson, with them. With their arms in their hands the Indians knelt through the service, but Big Bear and Miserable Man stood on each side of the door. Travelling Spirit did not go in with the rest, but after some time discovered Cameron trading with some Indians at the store, and forced him to go to the church. This man, who appeared to be possessed by a fiend, entered the church with his war hat on his head, his face painted yellow, and the loaded gun with which he had already threatened several lives, in his hand. Yet, he too, partly knelt in the aisle. After the service the Father addressed the Indians warning and commanding them not to commit outrages or excesses. The Indians then took the most of the white people to Delaney's, and Cameron went quietly back to his quarters and ate his breakfast as if all were well. Two Indians, Yellow Bear and a Frog Lake Indian, went with him more as guests than guards. Big Bear himself went into the factor's house to Mrs. Simpson, who had not been disturbed, and a short interval of quiet followed. Travelling Spirit broke in upon this, by ordering all the whites to go to the Indian camp, and those who had remained in Delaney's house were brought out and forced to start along the trail. Thomas Quinn, the Indian Agent, paid no attention to this order, but continued a conversation with Charles Gouin, a half-breed carpenter, in front Pritchard's house. Travelling Spirit came up to him and said, \"You have a hard head. When you say no, you mean no, and stick to it. Now, if you love your life, you will do what I say. Go to our camp.\"\n\nQuinn, a man of magnificent physique, of great determination and courage, and filled, moreover, with all the contempt which his Sioux blood naturally gave him for the Crees, answered nonchalantly the threat of the savage by saying, \"Why should I go?\"\n\n\"Never mind,\" said the Indian, with a threatening gesture.\n\n\"I will not go,\" said the undaunted agent.\n\n\"I tell you go!\" yelled the savage, and lifting his gun, he shot Quinn through the head, so that he fell dead.\n\nC. Gouin, who had turned toward the Indian camp while Travelling Spirit was speaking to Quinn, was shot and killed immediately by The Worm. The little party of white men and women who had been gathered in Delaney's had gone but a short distance when the first shot was fired. At the sound of the fatal signal, Little Bear shot the old Scotch mason, Williscroft, through the head. Young Harry Quinn, who was at the rear of the little party, on seeing Williscroft murdered, deluged between his guards, plunged into the bush and escaped, to carry the news of that bloody Good Friday to Fort Pitt. Many of the Indians had not loaded their guns when the first shot was fired, and they rapidly began to charge them, while the brave priests begged, implored and reasoned with them. As they spoke the two priests boldly placed themselves between the Indians and Mrs. Gowenlock and Mrs. Delaney. Suddenly a party of the Indians rushed at Delaney, and knocked down Father Faflard, who threw himself in front of the doomed farm instructor. Bareneck shot Delaney, and then turning shot the priest as he lay upon the ground. Travelling Spirit, as thirsty for blood as a panther, followed by The Worm and other Indians, rushed up at this moment, and Travelling Spirit shot down Father Marchand, who had thrown himself upon the Indians single-handed and unarmed when he saw his fellow-missionary shot. The Man Who Wins then shot and killed Delaney and also Father Faflard, who, terribly wounded, lay writhing upon the snow.\n\nGowenlock and his wife, who stood hand in hand, were a little farther ahead on the trail than the first group, and The-Worm, leaving his master in crime to deal with the larger party, ran forward and shot Gowenlock through the body. He fell into the arms of his young wife and died there. Little Bear shot Gilchrist dead, but missed Diel, who tore his way through the band and made off. He outran all pursuit, but a number of the Indians were by this time mounted on stolen horses, and he was run down and murdered after a long chase. Big Bear was still with Mrs. Simpson when the shooting commenced, and he ran out shouting \"stop.\" Cameron, was trading with Miserable Man who, had brought him an order for a blanket signed by Quinn, when the first shot was fired, and both ran out of the store. Cameron stopped to lock the door and an Indian ran up to him and said, \"If you speak twice you are a dead man. One man spoke twice and he is dead.\" Cameron turned to Yellow Bear, the Indian who had been with him all morning, and asked him what it all meant. Yellow Bear caught him by the wrist and said, \"Come with me.\" Mrs. Simpson came out of the factor's house, at this moment, and the Indian went on: \"Go to her and do not leave her.\" This Cameron did, and together they walked down the trail until they came in sight of the main party. Not one detail of the massacre escaped them. When all was over they continued on their way toward the Indian camp. Mrs. Simpson, as they walked, kept saying, \"go on faster,\" but Cameron, seeing that escape was impossible, never quickened his pace beyond a walk, and afterwards he found that if he had run a step he would have been killed. When they reached the camp, one of the chiefs of the Frog Lake band of Wood Cree, He-stands-up-before-him, took them into a lodge and sent a message to Travelling Spirit that he was to leave Cameron alone. Satiated with the blood of the men, the Indians brought in the two women, Mrs. Gowenlock and Mrs. Delaney, without in any way injuring them, and they were purchased from their captors by the half-breeds, John Pritchard and Pierr Blondin, the first of whom gave a horse and $3 for Mrs. Delaney,\nand the second three horses for Mrs. Gowanlock. The three white women were placed in the charge of Pritchard's family and closely guarded by the half-breeds and Wood Crees. These Indians had no sympathy with either the rising or the murders, which they would have prevented if they had been able, and they were determined that the prisoners should be well treated. Mr. Simpson, the factor, returned from Fort Pitt upon the evening of the massacre, and was at once made a prisoner, but no indignities were offered to him and he was allowed to join his wife.\n\nThe bodies of the dead were thrown into the houses, which were first rifled, and then burnt. The Plain Crees then abandoned themselves to a course of dancing and feasting, during which the vigilance of the half-breeds and Wood Crees alone saved the prisoners. Two days after the abandonment of Frog Lake by the Mounted Police Harry Quinn made his way into Fort Pitt alone, unarmed, unhorsed and greatly exhausted. He had seen nothing more than the first acts of violence, and for weeks this was the only reliable information received as to what had befallen the people of Frog Lake. The most horrible rumors as to the fate of the women were circulated.\n\nOn receipt of this terrible news the garrison at Fort Pitt exerted themselves to the utmost to put the fort, a mere collection of log houses, into a defensible state. Bastions to flank the walls and a stockade were constructed, and couriers were sent out to obtain assistance if possible. On the 14th April, a scouting party, consisting of Harry Quinn and constables Cowan and Loasby, went out towards Frog Lake to get news, if possible, of the further movements of the Indians, and to ascertain the fate of their captives. In their absence about a hundred Indians made their appearance upon the hills to the back of the fort, and a message was sent into Captain Dickens, of which a rude facsimile is here given. The publishers have the original.\n\nThat night was passed under arms, and the next morning McLean, the Hudson's Bay factor at Fort Pitt, and young Dufresne went out to parley with the Indians. About noon the returning scouts came upon the Indian encampment, and two of them, Cowan and Loasby, made a dash to get through it, and they did gain the crest of the hills above the fort, but a perfect storm of bullets followed them as they charged straight for the fort. Both fell, Cowan to rise no more, but Loasby, with two bullets in his body, successfully feigned death until the Indians departed when he managed to reach the fort. The third scout, young Quinn, the survivor of the Frog Lake tragedy, on the appearance of the Indians wheeled his horse and galloped back towards Frog Lake closely followed, and for a time all knowledge of him was lost. The Indians rushed down to within range of the fort, so eager were they in pursuit of the scouts, and a brisk fire was at once opened upon them, which speedily drove them back. McLean and Dufresne, who had gone out to parley with the Indians, were kept as prisoners. In the afternoon a message was received from McLean by his wife, advising her and all the civilians to come and place themselves under the protection of Big Bear, who had solemnly promised to protect all the civilians if the police would agree to abandon the barracks. He also warned Capt. Dickens that the place would be burned down, as the Indians had prepared fire balls saturated with coal oil with which to fire the fort. Against the wishes of the police all the civilians, both men and women, determined to give themselves up to Big Bear. The little party consisted of Mrs. McLean and her nine children—three of whom were young women, who, during the anxious period when an attack upon the fort was expected, bravely took their stand at port holes, rifle in hand, to assist in the defence, while some were but babes; George Mann, his wife, and three children; Rev. C. Quincy and his wife, Malcolm Macdonald, Hodgson,\nCHAPTER V.\nTHE VOLUNTEERS ORDERED TO THE FRONT.\n\nThe news of the rebellion of the half-breeds of the Saskatchewan, under the leadership of Riel, was received with astonishment in Eastern Canada. This was not due to lack of clear warnings. Reports of the meetings held at the different settlements in Saskatchewan territory had reached the newspapers, and the fact that Riel was one of the speakers and leaders in the movement was mentioned in these. The famous \"Bill of Rights\" had been published, and its demands discussed by the journals. Colonel Houghton, who had gone up to Prince Albert to collect the arms of the disbanded volunteer corps in that district reported that trouble was imminent. During the fall and winter the English residents of Prince Albert wrote to friends in the east, stating that Riel was at work among the half-breeds, and rebellion was certain to break out unless prompt measures were taken by the Government to overcome the disaffected. But such an upheaval seemed so improbable that all warnings were completely thrown away.\n\nThe Government paid no attention to the agitation further than borrowing Fort Carleton from the Hudson's Bay Company, and increasing the number of Mounted Police in the district. It was on the 23rd March that Sir John Macdonald, the Premier, in reply to a question by Mr. Blake, the leader of the Opposition, stated in parliament that authentic news of the outbreak of the Metis had been received by the Government. The general belief at that time was that the trouble would be quickly put down by the Mounted Police force, with the aid of the volunteers of Manitoba. The Government acted promptly. On the 24th March Gen. Middleton, commanding the Canadian Militia, was despatched to Winnipeg, where he arrived on the 27th to assume command of the field force in person.\n\nMajor-General Frederick Middleton had seen a great deal of service in many different lands. In 1846, he took part in some very active bush fighting during the Maori war in New Zealand, but it was during the mutiny in India, in 1857 and 1858, when he took part in the relief of Lucknow, as the aide of General Lugard that he won his greatest honours, and was rapidly promoted for services in the field. He commanded at the skirmish at Agamghur, and for having twice on that day gallantly saved a life at the utmost risk of his own, he was recommended by General Lugard for the Victoria Cross. His companion in one of these adventures was given the coveted honour, but General Middleton, then a captain, was not recommended by Lord Clyde on the technical ground that he was a staff officer, and could not therefore be recommended for the Cross.\n\nAs an officer of the new school his reputation was high in the service, and for some years he held the position of Commandant of the military college of Sandhurst, where, as a lad, he was educated. Leaving aside his purely military experience, he was particularly well fitted for the campaign in the North-West by having lived long in Canada, and married into a very popular French-Canadian family, the Doucets, of Montreal, and by being well acquainted with the men he was to command. The first battalion ordered out was the 90th Rifles of Winnipeg, the youngest corps in the service, but very fortunate in its organizer. A year before it had been created out of splendid material,—largely trained men from the eastern provinces,—by the late Lieut.-Col. Kennedy, who, at the time his battalion was called out for active service at home, was in Egypt as the commander of the contingent of Canadian voyageurs. Upon the 25th of March a detachment of a hundred men of this corps, under the command of Major Boswell, was hurried west to Qu'Appelle, as the fidelity of the Indians in the Qu'Appelle valley and at the\n\nFORT QU'APPELLE.\nTouchwood hills was considered doubtful. Two days later, after being reviewed by General Middleton, the remainder of the battalion; two hundred strong, and the Winnipeg field battery with two nine pounder guns followed. Upon the 27th of March the news of the Duck Lake fight had probably reached the Government, as orders were issued on that day from Ottawa to the commandants of the two regular batteries of Canadian artillery—A at Quebec, and B at Kingston—to provide detachments of one hundred men each and send them on at once.\n\nWithin a few hours of the receipt of these orders, early on the morning of the 28th, the two detachments embarked, and uniting at Ottawa, under the command of Lieut.-Col. Montizambert, were fairly entered on their long journey to Winnipeg, by the Canadian Pacific Railway. The road north of Lake Superior was unfinished, but as there were well-founded apprehensions of difficulty and delay in securing the consent of the United States Government to the passage of troops over United States territory, and as there was thought to be some danger of an attempt being made to wreck trains by Irish citizens of the west, who were supposed to be in sympathy with the rebels, it was decided to send the troops by the Canadian route.\n\nUpon the 28th of March, C Company School of Regular Infantry, eighty strong, from Toronto, and two detachments of two hundred and fifty men each—from the Queen's Own, and the 10th Royal Grenadiers, were called out for actual service. The Queen's Own having, upon the fatal field of Ridgeway, received its baptism of blood, has always aspired to the proud position of being ready for duty under all circumstances, and although but short notice was given over five hundred men fell into line at the first parade. It was composed almost entirely of young men engaged in mercantile and professional pursuits, and its departure brought the way home to the people of Toronto at least.\n\nOn the 30th of March the six hundred men from Toronto, the first of the citizen soldiers of the East to leave, started forward by the same route as the batteries. Lieut.-Col. Williams, M.P., on the 29th, received a commission to raise a provisional battalion of eight companies from the 'Midland district, by drawing two full companies from his own corps, the 46th, and one each from the 15th, 40th, 45th, 46th, 47th, 49th and 57th. On the 28th, the 65th battalion, Mount Royal Rifles of Montreal, Lieut.-Col. Quinet, M. P., commanding, were called out for active service. On the 30th, Lieutenant-Colonel O'Brien, M.P., was commissioned to raise a battalion of eight companies, by taking four companies of the 35th (Simcoe), and four of the 12th (York) regiments. Lieut.-Col. Scott, M.P., was commissioned to raise the 91st of the line in Winnipeg, to number some four hundred men, and another regiment of three hundred men and more was organized in the same city by Lieut.-Col. Osborne Smith, which was commissioned as the 92nd Winnipeg Light Infantry. A detachment of fifty sharpshooters, selected from the Governor General's Foot Guards, under the command of Captain Todd, joined the Toronto contingent on the track, having been raised and sent forward in an exceedingly short time. On the 31st of March, the 7th of London, Lieut.-Col. Williams, and the 9th of Quebec, Col. Amyot, M.P., commanding, was called out. A provisional battalion was formed of detachments from the 66th Princess Louise Fusiliers, 63rd Rifles, and the Halifax Garrison Artillery, under the command of Lieut.-Col. J. J.\n\nMAJOR-GENERAL F. D. MIDDLETON, C.B.,\nCommander-in-Chief of the Canadian Militia.\nRemnant, numbering some 350 men, but this battalion did not start for the front until the 11th April. Besides all these regular bodies of militia, a large number of men were formed into home guards throughout the towns of the North-West, and even in the cities of the East the veterans of regiments like the Queen's Own and the Victoria Rifles enrolled themselves for like duty. In all, the regularly enlisted forces called out at the time consisted of 280 regulars, 1,050 volunteers from Manitoba, 1,450 from Ontario, 508 from Quebec, and 363 from Nova Scotia. On the 30th of March, the advance guard of the 90th marched from Qu'Appelle station to Fort Qu'Appelle, and then followed a weary period of inaction, as it was not until the 6th of April that A and B batteries arrived at Qu'Appelle station, having been eight days upon the way. They had been forced to contend with formidable enemies; intense cold, bad roads, and extreme hardships at the very commencement of the campaign. Between the western end of the eastern section of the Canadian Pacific Railway and Jackfish Bay, some eighty miles east of Port Arthur, there was a gap of one hundred and ninety miles, over a hundred and five of which they were carried upon open flat cars, and the remaining distance, some eighty-five miles, they were taken in sleighs. The labor of transhipping the guns and stores so frequently, six times in the gaps, was very heavy. While the Toronto contingent was making its way over the gaps the weather was bitter, and the suffering caused, to the Grenadiers especially, who had to make long distances on foot, was great. During the week of enforced inactivity at Fort Qu'Appelle, greatly exaggerated rumors as to the extent of the rebellion were circulated. It was stated that the great Cree Chieftain, Piapot, whose influence over the File Hill and Touchwood Indians was great, and who had at one time a couple of hundred warriors in his own band, had gone on the war-path, although he had not, as far as is known, endangered his rations by leaving his reservation. The advance guard of General Middleton's force, a body of the 90th, with some scouts, reached the Touchwood Hills on April 3rd, and there camped.\n\nUpon the first tidings of the trouble at Battleford, arrangements had been made for a dash from Swift Current to its relief by a body of some forty-five Mounted Police with a field gun, under the command of Col. Herchmer. The South Saskatchewan river was found full of drift ice, and an attempt to cross it on the first of April failed, so that the force returned to Swift Current, and there awaited the arrival of reinforcements which were by that time considered necessary to meet the besieging forces of Indians whose numbers were greatly exaggerated by rumor. When the Queen's Own arrived at Winnipeg, on the 8th of April, they were despatched immediately to Qu'Appelle. Such was the spirit of the men that the hardships endured on marches through snow with the mercury below zero, and the breakdown of the commissariat, which is a matter-of-course in a British campaign the world over, only furnished matter for mirth and occasion for a display of loyalty as the following remarkable war-song, composed on the journey and sung at an impromptu concert on the train as they rolled west, attests:\n\nThe volunteers are all fine boys and fond of lots of fun,\nBut it's mighty little pay they get for carrying a gun;\nThe Government have grown so lean, and the C.P.R. so fat,\nOur extra pay we did not get—you can bet your boots on that!\n\nChorus—You can bet your boots on that,\n\nThey will not even give a shed that's fitting for our drill,\nFor Ridgeway now forgotten is, and also Pigeon Hill;\nBut now they've wanted us again, they've called us out—\nthat's flat—\nAnd the boys have got to heard themselves,\nYou can bet your boots on that!\n\nTo annunciate as some folks would, or independent be,\nAnd our Sir John would federate the colonies, I see;\nBut let them blow till they are \"blue,\" and I'll throw up my hat,\nAnd hang my life for England's flag—\nYou can bet your boots on that!\n\nThe flat that's traveled a thousand years,\nYou can bet your boots on that!\n\nFrom Qu'Appelle they went to Swift Current to become the nucleus of an expedition for the relief of Battleford.\n\nThe plan of the campaign then began to assume visible form. Gen. Middleton, whose advance guard had pushed on some 40 miles to the northward by the 6th of April, took upon himself the taking the Mounted Police posts at Fort McLeod and Assiniboine, capture Calgary and destroy the Canadian Pacific Railway. The leading chiefs of the Canadian confederation were Crowfoot, the head of the nation, Three Bulls, chief of the Blackfeet, and Eagle Tail of the Bloods. Crowfoot, chief of the nation, declared that Riel had sent him tobacco—the invitation and signal to rise—but that he had rejected it. His young warriors were certainly restless and excited, and disturbances actually occurred at Blackfoot Crossing, where it was expected the northern Indians, who were on the war-path, would appear, to induce the Blackfeet to join in the rising. It became necessary, therefore, to hold Calgary and the forts and towns in that district, with a force sufficient to awe the Indians. The 65th (Montreal) were sent to Calgary, where they arrived on April 10th. They were put under Major-General Strange, who had already raised a company of scouts in the district. As Calgary was the point on the railway nearest to Edmonton, it became the base of an expedition for the relief of that place, which General Strange was commissioned to organize. The Commissariat department was placed under the charge of that veteran officer, Major-General Laurie, who had been among the first to offer his services. Owing to the bad condition of the prairie trails, the question of transport was a most important one, and an immense number of teams was required. It was determined, if possible, to use the South Saskatchewan river, which opens generally between the 1st and the 15th of April, for the forwarding of supplies to General Middleton's column. As soon as the trouble arose, Sir A. T. Galt placed the steamers \"Alberta,\" \"Baronesse\" and \"Minnewau,\" which were on the river, at the disposal of the Government, and the steamer \"Northcote\" was started from Medicine Hat as soon as it was possible to get her into trim after her winter's rest. Upon April 8th she began her voyage, which proved to be one of the most adventurous ever undertaken by a steamboat. The \"Northcote\" is a flat-bottomed stern-wheeler, of about two hundred tons burden, and is the property of the Hudson's Bay Company.\n\nIt is worth recording, before closing this chapter, on the calling out of the volunteers and the forwarding of them to the front, that within one month of the breaking out of the rebellion, a force of over 3,000 men of all branches of the service had been called out and transported, the greater portion more than 1,800 miles and the remainder 2,500 miles, and in addition nearly 1,500 men had been raised in Manitoba and the west. Not one-tenth of the militia force available was called out, and there was not a corps in the Dominion which was not anxious to go.\n\nCHAPTER VI.\n\nBEATING UP THE METIS.\n\nThe task of the First Division was to strike at the heart of the rebellion, and, as each day that Riel remained unconquered brought him recruits and made the Indians more restless, there was no time to be lost in administering the blow. The distance from Qu'Appelle station to Batoche, the stronghold of the rebels, was two hundred and thirty miles. The trail, or line of march, was for most of the distance over a plain which the melted snow had converted\ninto a soaked sponge, and in places there were alkali swamps which destroyed the men's boots and injured their feet. The weather was wretched, rain falling heavily at times during the day and the temperature being frequently below freezing and even at times below zero at night. To push rapidly on under these circumstances and to fight an invisible enemy, whose numbers could only be conjectured, known to be sharpshooters almost to a man, was work calculated to test the endurance, pluck and skill of the finest trained and seasoned troops. The little force which General Middleton led was composed of the citizen soldiers of the Dominion—volunteers, all of them young, many of them not well out of their teens. The first advance was made on April 9th by a detachment of the 90th (Winnipeg) and thirty scouts under Captain French. They reached Touchwood on April 10th, by which date the whole division, composed of the remainder of the 90th (Winnipeg), the 1st half of C Company, the Winnipeg Field Battery and A Battery (Quebec), brigaded under Colonel Montizambert; the 10th Grenadiers (Toronto), and Boulton's Mounted scouts, under Colonel Grassett, were on the way between Qu'Appelle and Touchwood. Four hundred horse teams transported the baggage and supplies of the force. From Touchwood to Humboldt, a station where South Saskatchewan river. The trail to Clarke's Crossing was followed, and the advance force camped for the night 25 miles west of Humboldt, at Vermilion Lake. Fire signals blazed on the hills to the north and the west, showing that the troops had reached the enemy's country, their presence was known and their movements watched. At Clarke's Crossing there were a couple of ferry scows, and as it was but forty-five miles from Batoche it was believed the rebels would seize it, destroy the scows and attempt to prevent the troops from crossing. Next morning, with the intention of anticipating them, a dash over the thirty-eight miles was made in eight hours by French's scouts, C Company and a few men of A Battery, and Clarke's Crossing was safe. Though the men had marched the whole distance in eleven days—had travelled, wet or dry, twelve hours, averaging twenty-one miles, a day—they were\nimpatient to push on to Batoche. A halt was necessary, however, to allow the other detachment of the division to come up, and the supplies of the advance force were getting low. Besides, some information regarding the disposition and strength of the rebels had to be gained before the campaign beyond Clarke's Crossing could be prosecuted. Like many other Generals, Middleton had to come to a decision whether he should divide a small force. The rebels held both sides of the river at the crossings below Clarke's. If Middleton marched in undivided force up the east side then they might withdraw to the west, destroy the ferry, and oppose his crossing. The banks of the river were very high. They were well wooded on the west, and bare on the east side, so that from under cover of the bush the insurgents could oppose successfully a much superior force fully exposed while approaching the river and crossing in the open. Though knowing well that his course would be sharply criticized, General Middleton determined to divide his column into two divisions and advance upon both sides of the river. To arrange details and transport the half-division and stores across the river after the arrival of the last detachment consumed time.\n\nOn the 17th the 10th Grenadiers came into camp, thus completing the force, and with them came supplies, though not in large quantities. Having left Qu'Appelle on the 10th, they had marched the whole distance in seven days, and were entitled to a rest, having performed a feat of which any soldiers might be proud. The same day a reconnaissance was made by a body of Boulton's horse, under the command of Lord Melgund. This young nobleman, the military secretary of the Governor-General, had volunteered for service from the first, and had been given the rank of Lieut.-Colonel. He is the eldest son of the Earl of Minto, the head of the great border clan of Elliots, is a gallant rider, and a soldier who had seen war in various capacities and in many countries. He took part in a Caltist rising in Spain; was in the Turco-Russian war; served as a volunteer in the Afghan war and also in Egypt; where, during the campaign of Tel-el-Kebir, he commanded a company of Mounted Rifles with honor. He was therefore, by inclination, by experience, and by training well fitted for the work he was given. The men whom he commanded were quite as well fitted for their duty as their leader. Young English and Canadian farmers from the Birtle district, they had volunteered almost at once, and, armed with small bore Winchester rifles, uniformed in duck-shooting-jackets, mounted upon Indian ponies that could live upon the prairie, they were a force fit to go anywhere and do anything, as they proved throughout the war. On this occasion they had not been out of camp more than an hour, when they came upon a newspaper pinned to the bark of a tree, with markings upon it, that bore some faint resemblance to a drawing of three Indians. A few minutes after three Indians were seen trying to creep down a coulee. They were quickly surrounded, but instead of surrendering they made a bold stand, and, with their Winchester rifles at the present, were ugly customers to approach. Lord Melgund hailed them, promising them safety, and after some talk they came out. They were Teton Sioux of White Cap's band, a portion of an American tribe, which had taken part in the massacre in Minnesota some years ago, and had fled to Canada. Their chief and his band went with Riel, but very few other Indians had joined him. One of them was sent back to Riel's camp with a message to White Cap that if the seven prisoners, known to be in Riel's hands, were brought safely into camp, $100 reward would be given. The only reliable information that had been received from Prince Albert for some time was a message brought in by Frank Hourie, the son of a Government interpreter, and a young man who, by his deeds of daring, has earned for himself a high place in the record of this war. He left Humboldt, on the 28th March, with a message from the General to Colonel Irvine. On Monday, the 30th, he reached Clarke's Crossing, when he found that the river had broken up. He attempted to swim across amidst the blocks of drifting ice, of which the river was full, and was nearly drowned before he turned back. He tried again at night, however, and was successful. Having left his horse on the south bank he was forced to walk to Prince Albert, which he reached on Thursday and delivered his despatches. He found Colonel Irvine safely ensconced in a log fort, with a body of some eight hundred men at his command, half of whom were well armed. The settlers from the neighborhood had fled to Prince Albert for refuge, leaving cattle and grain behind them, so that, with the augmented population to feed, supplies were growing scanty. It was because of this information, which reached him at Touchwood, that the General was anxious to push on. Although no exertion was spared, it was not till the 22nd April that the advance took place. Meanwhile the various eastern corps called out later had been slowly making their way through the wilderness north of Lake Superior to Winnipeg. The Midland regiment arrived at Winnipeg on the 14th April, and were sent on to Qu'Appelle almost at once. The York and Simcoe battalion followed them, and the 9th (Quebec), which had arrived at Winnipeg on the 12th April, were sent to garrison Fort McLeod and Gleichen in the Calgary district. Colonel Scott's battalion, the 91st (Winnipeg), were despatched to Fort Qu'Appelle on April 16th, for the purpose of awing the Indians and half-breeds of the valley, and of guarding the line of communication with the fort. The Governor-General's Body Guard and the Quebec School of Cavalry, the first bodies of enlisted horse called out, were also in Winnipeg by April 20th, and they were brigaded with the Winnipeg cavalry, making a mounted force of two hundred men. It was found almost impossible to transport sufficient supplies over the prairie trail to Clarke's Crossing, and the South Saskatchewan being now open, it was determined to move the base of supplies to Swift Current, and use the steamers on the route to convey the supplies down the South Saskatchewan from the landing north of Swift Current to Clarke's Crossing. The steamer \"Northcote\" arrived at Saskatchewan Landing, the port of Swift Current, on April 14th, and preparations were at once made for her trip down the river. There arrived at Swift Current about this time two Gatling guns, ordered from the Gatling Arms Company, of New Haven, Ct., and sent on under the charge of Lieut. Howard, of the Connecticut State militia, who was destined to distinguish himself in the campaign.\nLEAVING MEDICINE HAT.\n\nCHAPTER VII.\n\nOTTER'S MARCH.\n\nLieutenant-Colonel W. D. Otter was given the command of the Second Division, whose work was the relief of Battleford. He is a Canadian whose military training has been entirely gained in the Canadian militia. In 1862 he joined the Queen's Own as a private, and distinguished himself even then by his intense interest in military matters. In 1864 he carried his colors in a Provisional battalion on the Niagara frontier. He was soon the adjutant of the Queen's Own, and in 1875 became its Colonel. From the duties of this position, made by his own devotion an onerous one, he retired to take the command of the C Company of regulars, and the Toronto Infantry school. This was his first experience of active service in command, and he set forth with the inestimable advantage of being known and admired by the greater part of his little force. The first advance from Swift Current, the station on the Canadian Pacific which had been selected as the base of the movement, was made upon the 12th of April, when a body of forty-five Mounted Police, under Colonel Herdman, moved forward to Saskatchewan Landing. During the short period that intervened between the arrival of the force and the advance, an immense amount of work had been done in collecting transports. On the morning of the 13th the little force fell into column of route and the march commenced.\n\nThe force was composed as follows:—C Company, under Lieutenant Wadmore, 43 strong; B Battery, Major Short, 112 men with two 9-pounders, and two Gatlings in charge of Lieutenant Howard of the C.S.M.; the Ottawa Sharpshooters, Captain Todd, 50; Queen's Own, Lieut.-Col. Miller, 285 men. On the evening of the 14th April they stood on the crest of a high bluff, below which spread out a stretch of undulating broken country, at the verge of which ran the broad waters of the South Saskatchewan, sweeping closely to the bold north bank. The steamer \"Northcote\" was found awaiting the troops, and a despatch was received from General Middleton ordering Lieutenant Howard with one of the Gatlings to accompany the \"Northcote\" down the river to Clarke's Crossing, there to join the First Division. Owing to the high wind which prevailed, and to other causes, the task of ferrying the troops and supplies over the river occupied three days, and it was not until the 18th that the advance from the north bank began. From that time there was no delay. One hundred and ninety teams had been collected, and the foot soldiers were each provided with a seat in a waggon, so that the fighting material was not worn out by hard marching. For miles the route lay along a fine trail over a treeless prairie, and the march was without incident. At night the wagons were formed in a hollow square and bound together with ropes. Inside the laager thus formed the horses were fastened, and the tents were pitched without the square, so that all danger of the horses being stampeded was effectually avoided. So bare of timber is this section of the country that wood for fuel had to be transported along with other necessaries, and the supply running short, no fire could be had one night, greatly to the discomfort of the men. Waggons were sent ahead to a creek to bring back the poplar trees which, on prairies, grow only on the banks of streams. No human being was seen on the whole march. The total distance by trail to be covered between Swift Current and Battleford was 202 miles, and on the 18th they had completed 324 miles of this distance. On the morning of the 23rd, eighty of the Queen's Own were mustered for skirmish duty, and the Mounted Police were off far in advance of the column—for, at last, the column was about to enter the bush and broken land of the Eagle Hills, where the Indians might be expected. It was three o'clock in the afternoon, and the excitement attendant upon the discovery of nine cart loads of goods which had been abandoned by a freighter, unable to reach Battleford sometime before, had died away, when the order came to the skirmishers to fall back, and the guns were sent to the front on the gallop. There was nothing from the head of the column to cause alarm, however, but a long way to the front the Mounted Police scouts were having their little affair with the enemy. Charles Ross, a member of the police force and a scout, who in this campaign rivalled the mythical doings of the Leatherstocking heroes, was riding far in advance of the column with some six or eight men of the Mounted Police, when he saw a body of about fifteen mounted Indians some distance ahead. Four of them advanced a short distance towards the police, as if in doubt as to who they were. After sixty or seventy shots had been exchanged between the two parties, the Indians made off, leaving behind a cart-load of provisions, but no dead. On Friday the scouts were pushed forward to explore the reserve of the Stoney Indians, through which that day's route lay, but not an Indian was to be seen. They found, however, the body of the murdered Payne, and that also of a young Indian woman, who had been murdered, probably for attempting to save the instructor. All that day the column marched through wooded country, but without encountering the enemy, and at last, just at nightfall, the white homes of Battleford gleamed out under the last rays of the sun, and the goal of the expedition was almost reached.\nThe order to camp was given, however, and the men, who were most anxious to dash on to Battleford, pitched their tents. During that night of passive excitement but few slept. Shots were heard to the north about nine, and a body of police went out to find that shots had been exchanged between the scouts and the enemy. A couple of dead Indians whose bodies were found next morning was the result. Then came a burst of fire from the north, and it was learned that it was Judge Rouleau's house, the finest in the north, that was burning. An hour's march next morning brought them to the dismantled town of Old Battleford, and as soon as the ferry across the Battle river could be worked a party of officers crossed to the Fort, while the camp was pitched beside the old Government offices on the south side of the river. Sad news greeted the troops on their arrival. On the evening of the 22nd, when the usual relief of the pickets took place, Frank Smart, when about three miles to the west of the Fort performing outpost duty with a Mounted Policeman, was shot dead by an ambushed savage. His companion galloped in with the news, and that night was passed under arms. Mr. Smart was a young merchant of Battleford who had risked his life to carry the news or the trouble to Swift Current, and his death produced amongst painful impression. Next day Ross brought them word of Otter's approach, and there was much joy among the crowded population of the Fort. Within its narrow bounds there were 560 persons when it was relieved. Col. Otter had commenced his military career as a field officer by carrying a force of over five hundred men, a distance by trail of one hundred and sixty-six miles in five days, or at the rate of 33 miles a day.\n\nCHAPTER VIII\n\nTHE BATTLE OF FISH CREEK.\n\nAt last the delay in the advance which had fretted the men of the First Division was over, and on the morning of the 23rd of April the camp broke up, the whole force, divided into two columns, proceeding northward along both banks of the river. Though the columns were separated by the river they were to keep as nearly as possible abreast for mutual support, one of the scows being brought down the river for the purpose of ferrying either column across at need. The columns were as nearly as possible, of the same strength in all arms. That on the east bank, which was most likely to meet the enemy in force, General Middleton commanded in person. It was composed of 90 men of A Battery with two guns, 40 men of C Company, 50 men of Boulton's Horse, and the 90th battalion 300 strong, or 480 men in all. That on the west bank was under command of Lieut.-Col. Montizambert, with Lord Melgund as chief of his staff. It was made up of 25 of French's scouts, 20 of Boulton's Horse, 32 of A Battery, 52 of the Winnipeg Field Battery with two guns, and the 10th Royal Grenadiers 250 men, in all 375 men. The first day's march was an uneventful one, but the scouts were kept well out as it was known that the enemy was not far off. After the hard day's march of 18 miles the camp of the right column was pitched on the bank of the Saskatchewan within a few miles of a wooded ravine, where only a few days before a scout had taken shelter from the rebels when on his way back from Prince Albert with messages. The men slept soundly after their hard work, in fancied security. Yet, had not the rebels' plans miscarried in some unexplained way, a night attack would have been made, and in the confusion that would probably have ensued with a force made up of men who had never been under fire, many would have been massacred. While Dumont and his half-breeds in the ravine were awaiting vainly the arrival of reinforcements which would have enabled them to carry out their plan, the night wore away and the sentries instead of giving a hurried night alarm were cheerily calling \"all's well\" to one another. On the following morning the march was resumed, Boulton's Horse furnishing the mounted scouts and the advance guard, accompanying which, contrary to the usual practice, was the General commanding and his staff. The morning was a bright, sunny one; the prairie, which a few days before had been covered with snow, was now clad with verdure and flowers, yellow and purple, growing in profuse variety. The men stepped out cheerily under these influences. Suddenly rifle shots rang out, and in a few minutes Captain Wise, one of the General's aides, galloped into sight with an order for the batteries to come forward into action and the main body to follow. The scouts, who had been thrown well out on the advance, rode back with the report that the enemy were posted in a lightly wooded bluff on each side of the trail where it led into a ravine, which was also held by the enemy. A band of the rebels, mounted, had followed the scouts over the ridge, but General Middleton, sending his order back by Wise, did not withdraw, but riding to one side made way for the passage of Boulton's scouts who charged the enemy. After a few hasty shots the mounted body of the enemy, with a loud shout, retired, and shortly after the under-\nbrush and crest of the ridge was lined with skirmishers who began at once an irregular and harassing fire. Major Boulton at once dismounted his men and in skirmishing order they began to creep up on the low ridge and the adjacent copse. The sharpshooters of the 90th formed the front of the main body, and they at once began to extend and get forward, beginning their fire, in fact, before they reached the scouts' line. With a rush the guns then came up, under Captain Peters, and unlimbered at the foot of the lines; the A Battery men, who were serving as infantry, forming on either side of them as a covering force. Then came the gleam of white and scarlet, as C Company came up the trail in close order with the peculiar steadiness of regulars, and took up their position on the right of the guns. As they extended, taking cover in the bush, the guns opened fire with shrapnel shell, which were dropped just behind the opposing ridge. Thick and fast the bullets whistled round the gunners' ears as they worked.\n\nTwo companies of the 90th, under Major Boswell, were the next troops to come up and they took their position to the left. Lying down they opened fire, and the remaining three companies also turned to the left and extended, so that in a few moments a line of battle half a mile in length had been formed. The shrapnel fired by the guns had a very perceptible effect upon the rebel fire about the centre of the position, and Boulton's Horse took advantage of this to press onward, and here some of his men fell,—Captain Gardner being the first, with two bullets in his body. The whole fighting line then slowly followed up the Horse, and upon the left B and C Companies of the 90th outflanked the rebel line, and gained the ridge. They then saw before them an open stretch of prairie, in the centre of which was evidently a deep coulée, behind which were several houses. A shell from the guns, which dropped in the rebel lines, finished this portion of the fight, and the ridge and bush were abandoned, the rebels falling back into the coulée, the General himself gaining the ridge on the left just as the last body of rebels disappeared in the ravine. In leading up his company across the trail in the little rush that brought the Rifles up to Boulton's Horse and secured the ridge, Captain Clark fell while cheering on his company. His fall produced the first symptoms of uneasiness among the men. The fight had now been waged for half an hour and the rebels had been driven from their first position in the wooded bluffs on each side of the trail. A volley or two was delivered from the ridge and then the line advanced steadily across the open to the coulée which it was evident the rebels held in strength. Then, and only then, the existence of the ravine became apparent. The banks, which were of some height, fell away quite rapidly, and, though precipitous in some places, were everywhere lightly wooded, except upon the very crest of the ridge, from which the prairie fires had burned the growth of young trees. Upon the left, at the spot where the last of the enemy had disappeared, the slope was more gradual. It was here that one of the most plucky dashes of the day was made at a later period. Through the bottom of the coulée, which was quite boggy, a small stream could be seen, and the only sign of life was a group of Indian ponies tied to the small poplars at its edge. C Company was thrown boldly forward to the right and got some cover upon the edge of the slope at this point, from which they could pour a heavy fire down the ravine, but the guns and the crushing explosion of the shrapnel and common shell, which were being thrown into the ravine and across it at the houses on the opposite bank. O Company admirably handled by Major Smith, succeeded in checking the advance of the rebels in their front, and a couple of shells from Drury's gun, which had been brought round from the left for that purpose, fired a couple of houses on the extreme right and dislodged a body of rebels who were endeavoring to turn the right flank. At noon the ravine was still in possession of the insurgents, and the batteries could not, with the guns, feel the enemy, and shell after shell had no effect in silencing their fire. Captain Peters therefore volunteered to lead a dash of that portion of A Battery not doing duty with the guns into the ravine, to clear it by a struggle at close quarters if possible. At the head of his men he rushed down the slope on the left through a hail of bullets. He found himself, however, unable to do anything but send his men to find cover as well as they could in the bottom of the ravine. Not a single rebel was to be seen, and the steep banks were not to be scaled. The enemy who were on the edge of the ravine above them, though out of sight, fired upon them, and it seemed as if not a man would escape with his life. Though many slight wounds were received, and clothes were pierced, only one man, Cook, was shot dead. When under cover of a gun the men fell back, they were forced to leave his body where he had fallen. Another attempt was made to storm the rebels' position by B and C companies of the 90th, under Major Boswell, but they, too, were forced to fall back, leaving one man dead upon the field. About one o'clock the guns were sent down under Captain Peters, by the slope on the left, and up to the other side of the ravine to shell the rebels out of the angle on the right, which was already known as the \"Hornets Nest.\" After firing a number of rounds of shrapnel into this angle they returned in safety, not having lost a man, though under a constant fire both going and returning. Meantime Colonel Montizambert's column on the west bank, which was four miles back when fire was opened, were hurrying forward in the direction of the noise of battle, when they were met by a messenger from General Middleton ordering the Batteries with the guns and the 10th Royals to cross the river and to come into action. It was four o'clock in the afternoon when the main body of this column came upon the field and the fight was practically over. The Royals and C Company were sent to relieve the skirmishers of the 90th, who had been fighting all day, and the guns were sent to the rear. For an hour the firing continued in a desultory way, when, as\nnight was coming on, it became necessary either to order a charge into the ravine or to withdraw. As a charge was likely to be attended with considerable loss and it was deemed easier to starve the rebels out if necessary, the Royals and C Company, who considered themselves done out of their share of the fighting, retired with extreme reluctance, though a rain-storm, the second of the day, was coming on. As they did so a remarkable incident, but one apparently well authenticated, took place. Hourie, the interpreter of the force, advanced to the edge of the ravine and called out to the rebels below:\n\n\"Is Gabriel Dumont there?\"\n\nAll through the various fortunes of the day the conduct of the General had been such as to arouse in his men the most enthusiastic admiration. From the first, he was everywhere at the front, riding along the very crest of the ravine, and doing all he possibly could to keep his men out of the danger he himself scorned. Many of the casualties that took place were, in fact, the effect of the men's desire to have a shot at the enemy, which led them to advance recklessly down the slope of the ravine. When leading the men up to the low rolling ridge where the rebels made their first stand a bullet passed through the General's cap. Turning to the men ever seen war. The camp had been pitched between the trail and the river, some distance to the rear, and, as the Grenadiers approached it, a party of mounted men burst out of the little clump of trees behind the ridge from which they had first appeared in the morning and whooped as if in triumph. At the time it was thought that this defiance presaged a desperate fight upon the morrow, but later events showed that it was mere bravado on the part of the last holders of the position, for the rebel force had been melting steadily away all day. When the camp was reached, in the midst of a heavy downpour of rain, there was but little of the glow of\n\n\"Yes, what do you want with me?\"\n\"Yes, you got many men?\"\n\"Yes, a great many.\"\n\"Will you have a meeting with me? I am Hourie.\"\n\nThere was no answer to this, and Hourie, turning leisurely, came back safe. A loud voice was heard at times saying: \"Courage mes Braves.\" One man, at whom none could get a good shot, though many distinguished him as the man with the red band around his hat, was supernaturally active, and his rifle did frightful execution. This was believed to be Gabriel Dumont, the fighting man of the Metis.\n\nof the 90th, who, as they ran up, were, naturally enough, ducking their heads to the music of the whistling balls, the General cried: \"Hold up your heads, men! Had I been stooping, that bullet would have gone through my brain.\" Indeed, General Middleton was severely criticised for being in the front of the lines during the action, and exposing himself recklessly. His defence was that he considered it necessary to do so, in order to encourage young troops under fire for the first time, and also to ensure the execution of his commands, which he dare not entrust to the inexperienced officers under him, none of whom, with one or two exceptions, had battle in the men who had fought so long and so bravely, and when the lists of dead and wounded were made up the cost in human life of this apparently useless struggle, was such as to deepen the gloom. Out of a total of about 350 men actively engaged during the heat of the struggle 43 were either killed or wounded. Of these ten were killed. The official list published after the battle was as follows:\n\n90th Battalion,\n\nA Company—Private Hutchinson, killed in the first charge; Private Ferguson, killed in the first charge; Private Matthews, left arm broken; Captain Fekler, shot in the arm and hand; Private C. Kemp, shot in the groin.\nB Company—Private Wheeler, killed; Private Swain, slightly wounded in the arm; Private Jarvis, two slight wounds; Private Lavel, wound in the shoulder; Private Johnson, slightly wounded.\n\nC Company—Lieut. Swinford, wound in leg; Capt. Letherby, wound in breast; Private Code, wound in leg; Private Chambers, slight wound in neck; Private Caniff, wound in arm.\n\nD Company—Private Ennis, killed; Corp. Bowden, slightly wounded.\n\nF Company—Capt. Clark, wounded in back while moving from one bluff to another. The bullet followed the rib around to the front and was found in his clothes. Private Heslop, arm fractured; Private A. Blackwood, slightly wounded in thigh.\n\nA BATTERY.\n\nGarrison Division—Gunner Henney Demannally, killed; Gunner Cook, killed; Gunner Morrison, badly wounded; Gunner Ainworth, badly wounded; Sergt-Major Mawhinney, right arm broken; Gunner Aslin, wounded; Gunner Irvine, wounded in thigh; Gunner Woodman, wounded in shoulder; Gunner Laugrell, wounded in arm; Gunner Quillet, wounded in shoulder.\n\nMounted Division—Driver Turner, wounded in chest; Driver Wilson, right arm broken; Driver Harrison, flesh wound in neck.\n\nC COMPANY, INFANTRY SCHOOL.\n\nCol.-Sergt. Cumblings, flesh wound in leg; Private R. Jones, arm fractured; Private H. Jones, shot through the jaw; Private R. H. Dunn, bad wound in arm and hand, shot twice; Private Watson, killed.\n\nMAJOR BOULTON'S HORSE.\n\nCaptain Gardner, two slight wounds; Trooper James Longford, two slight wounds; Trooper Perins, arm broken; Trooper King, two wounds in leg; Trooper Darcy Baker, very serious wound in chest; Sergt. Stewart, slight wounds in the ear and hands.\n\nBoth the General's aides-de-camp, Lieutenant Doucet and Capt. Wise, who had acted throughout the day in the most gallant and fearless manner, were wounded, the first in the arm, the second in the ankle and shoulder.\n\nUpon the following morning, the 90th were ordered out, but not an enemy was to be seen. In the ravine were fifty or sixty dead ponies, killed by the shells, and four dead rebels—all Indians—were also found. The secret of the strength of the position was then discovered; at the edge of the ravine were finely formed rifle pits, and so well laid out that the wonder was that the struggle had not been more disastrous. Their broad end pointed up the hill and, with his rifle lying over the broad, low parapet and his body completely below the surface of the ground, the enemy's advantage of position was extreme. As far as could be subsequently learned, Gabriel Dumont had two hundred and fifty picked men under his command, and he went out with the avowed purpose of cutting off one column of General Middleton's forces, and only prepared the ravine for defense in case he should be driven from the field. His advance guard was attacked by overwhelming forces, but held its own until the line of battle had been formed, and, after a brisk half hour's fight, his first position was carried all along the line. The enemy then fell back into the ravine and made a desperate attempt to turn the right flank of the troops. This was frustrated, but two attempts to carry the ravine by assault failed. Both sides then abandoned the field of battle, and the Metis left some of their dead, the saddles and bridles on their dead horses, and a number of arms in the rifle pits. From the best sources of information obtainable it is believed the rebel loss was eleven killed and eighteen wounded.\n\nGabriel Dumont supplied the rebel government with a masterly written account of the person was hurt by them, and very few of the men were frightened.\n\nWith the exception of Ridgeway, which was hardly a satisfactory test, the Canadian volunteer militia were never tried in battle until this day. They had, in this case, fought a desperate fight from nine o'clock in the morning till six at night with expert riflemen whom they could not see and could not reach, yet not once had they faltered. The 90th of Winnipeg fairly won their spurs in this action, and Boulton's horse earned for themselves—by being the first into the active fight and the last out of it—the place which they so proudly kept upon another day. The two regular corps, A Battery and C Company, had been in the thick of the fight from the first, and the dash of Captain Peters into the ravine, and the tenacity with which C Company clung to an untenable position and there foiled a persistent attack were fine achievements.\n\nThe men thus forced to abandon their strong position were old fighting men, holding ground whose capabilities they knew. Fish Creek has been the scene of three subsequent fights between Indian and half-breed forces.\n\nCHAPTER IX.\n\nTHE THIRD DIVISION RELIEVES EDMONTON.\n\nEarly in April reports from Edmonton represented affairs there to be in an alarming state. The Indians were assuming a threatening attitude, and the half-breeds were said to be about to follow the advice of Riel and rebel. The squad of Mounted Police at Fort Saskatchewan were said to have declared that to protect that post was the utmost they could do, and the terror-stricken people of Edmonton were told that they would have to defend themselves as best they could. The regular mail service failed to get through, and imagination suggested pictures of the fate of the people at the north, which aroused the deepest anxiety.\n\nThe Third Division for the relief of Battleford had then to be made up hurriedly, at Calgary, from which a trail led to Edmonton 194 miles north. Residing near Calgary was a British officer, the origin of whose family was of a singularly romantic nature, and who, after having won, like many of his ancestors, distinction in the English army, had settled down on a ranch in the far west. To him was entrusted the command of the Third Division. Major-General Strange is said to be a descendant of Charles Martel, the greatest of the Mayors of the Palace to the last of the Merovingian sovereigns, and also to Charlemagne, the conqueror of the Romans. He certainly sprang from a good Scotch family of the seventeenth century—the Lumadens. When Charles Edward Stuart made his last attempt to regain the throne of his ancestors, his private secretary was one of the Lumadens, Andrew by name, who had a lovely sister, Miss Lumden had won the affection of a \"stickit\" law student, Robert Strange, who had shown some talent for engraving. She\ninformed her lover that if he wished to win her he must devote himself to the Prince's cause, a condition which, though without any admiration for the Prince or any political leanings, he unhesitatingly accepted. After the collapse of the Pretender's cause, young Strange was attainted and finally driven for refuge to the house of his betrothed, Miss Lumsden. There the red coats sought him, but while they were still in the courtyard Miss Lumsden, with all the well-known resources of women at a critical period for those whom they love, commanded her lover to sit on the floor by the stool of the spinet and sitting down on the stool herself, she shrouded him in the ample folds of her petticoat, distended by the enormous hoops of the time. While the officer watched over her and the soldiers searched the house, she played airs, let us hope good round Jacobite ones, on the spinet. Miss Lumsden rewarded her hero's devotion by marrying him shortly afterwards, and with her he went to Paris, and there taking up once more his study of engraving, he became one of the greatest artists in his line. From this romantic union sprung many Stranges, famous in all the professions and in both branches of the service, and also Major-General Strange, who served in thirteen engagements during the Indian mutiny, was mentioned four times in despatches, and wears a medal and clasp. In 1871 he was entrusted with the formation of a Canadian Regiment of Artillery, of which he retained command until 1882, when he went to the West. He was commissioned to raise a body of scouts from among the cow-boys, before the arrival of the 63rd regiment of Mount Royal Rifles, a body of men almost exclusively French-Canadians. In spite of all efforts to hurry the departure of the division, the almost insurmountable difficulties found in organizing transportation caused unavoidable delay, and even on the arrival of the 92nd battalion of Winnipeg, on the 17th of April, some days elapsed before a start was made. At this juncture, Lieut.-Col. Ouimet, commander of the 65th, left Calgary and came east, a proceeding, simple as it appears, which attracted public attention even in the midst of the war excitement. It was reported that he had quarrelled with General Strange, had discovered Government failings which he intended to expose in Parliament, had found the equipment and supplies to be totally bad and deficient, and had determined to make these matters public and have them remedied. Some mystery, certainly, was made over his movements, and the Government, when questioned in Parliament, gave information which was not borne out by the result. After an interview with the Minister of Militia, at Ottawa, and a few days' rest, Colonel Ouimet started for the west to resume his command, and the public was informed that private business and illness were the causes of his visit east, and that he had received leave of absence from General Strange. The 92nd were hardly got into camp before refugees from among the scattered settlers along the Edmonton trail began to arrive at Calgary. The store of the Rev. Mr. Gaetz, at Red Deer, was ransacked by the Indians, while the proprietor and his son were taking the family into Calgary, and the stores of Baker and Baylis, at the Battle river, were also raided, but no one was injured. To General Strange's column was also intrusted the punishment of Big Bear and the relief of Fort Pitt, then believed to be in danger, although the full extent of the trouble in that district had not at that time been learned. A body of scouts, the advance guard of the column, was despatched, with orders to seize the crossing of the Red Deer river, and upon the morning of the 19th a force, composed of a body of scouts, fifty in number, under the command of Captain Steele and Captain Oswald, and the right wing of the 65th, 160 strong, under Lieut.-Col.\n\n**MAJOR-GENERAL STRANGE.**\n\n**VIEW OF EDMONTON,**  \nOn the Saskatchewan River.\nHughes, marched for the north under the command of General Strange. The trail lay over a level prairie, almost treeless, and the only impediment to travel was an occasioned marsh. Upon Saturday, the 25th, the first stage of the march was safely accomplished. The force camped on the shore of the river, and a number of the transport teams was sent back to the assistance of the second column. The river was forded without difficulty upon the following day, and in shorter stages the march was continued through a more diversified country.\n\nUpon the 23rd April the second column, made up of the left wing of the 63rd, twenty-five Mounted Police, with one nine-pounder gun, and the Alberta mounted rifles, fifty strong, the whole under the command of Major Perry, a graduate of the Kingston military college, who had held a commission in the Royal Engineers, moved out of camp. On the 28th of April this column reached the Red Deer river, which the first column had been able to ford in wagons with no great difficulty, and found that it had become a mighty torrent. A raft was hurriedly built, and an attempt made to swing it across, but the rope broke, and it was only by the most desperate personal exertion on the part of Major Perry, and at the risk of his life, that the hastily improvised ferry boat, upon which the guns, ammunition, etc., had been placed, was rescued from the stream. Major Perry then laid down the lines of a ferry scow, and, some rough material having been secured, a serviceable flotilla was constructed in three days, and a guard placed over it. On the 30th the right wing of the 92nd, the regiment of veterans raised by Col. Osborne Smith in Winnipeg in a few days, moved forward as the third column of General Strange's division. Lieut.-Col. Smith had, as an officer of the 39th of the line, seen service in the Crimea, but besides that he had, during the troubles of 1861, organized the Victoria Rifles of Montreal. He had a large share in the Fenian troubles of '66 and '70, having been in command of the southern frontier during that troublesome time, and won high eponymus for this service. The battalion he had raised was an especially fine one, and the wearers of the scarlet and coq-dury signalized themselves by tramping to Edmonton in nine days, actual marching time, or eleven days in all on the road. General Strange arrived with the right wing of the 63rd on the 2nd May, and found the whole settlement in a state of panic. The Indians of the vicinity made no difficulty about admitting that they had received a tobacco embassy from both Poundmaker and Big Bear, and had heard an account of the Fish Creek fight, so inaccurate that it was stated to have resulted in the complete defeat of the troops, and the massacre of an unknown and fluctuating number of whites. Captain Steele, with a large body of police and scouts, were sent forward in the direction of Victoria, while Edmonton and Fort Saskatchewan were garrisoned. Major Perry, with the second column, arrived upon the 5th of May, and when on the 12th the right wing of the 92nd arrived, with 46 scouts, General Strange found himself at the head of a body of 739 men, made up of 315 of the 63rd Battalion, 90 Edmonton volunteers, 70 Mounted Police, 50 Alberta Mounted Infantry, 46 scouts, and 190 of the 92nd. The work upon the flat boats, to be used in an advance by the river to Fort Pitt, had been pressed, and in spite of the almost continuous rumors of attack, upon the 14th of May the 92nd started down the North Saskatchewan river in seven hastily built barges, and four companies of the 63rd, under Lieut.-Col. Hughes, were despatched by the north trail; Victoria, on the river, 74 miles from Edmonton, being the rendezvous. On the 18th, a field force, consisting of 120 horse, one gun, and 310 infantry, were encamped at Victoria. Lieut.-Col. Quimet, who, by land riding, in spite of illness, had rejoined his regiment, was left at Edmonton with the remaining four companies of the 63rd in garrison.\n\nA company of settlers and half-breeds were sworn into protect Victoria, and the old post, a palisaded work with a small bastion, was put into a state of defence. The ferry scow was repaired, bullet proof bulwarks added to it, and the whole flotilla was provided with hastily devised anchors. The boat which was to carry the gun was equipped for service in such a man-\nOne day, near the end of April, a half-breed came into Battleford with the story that he had escaped from Poundmaker's camp, where he and many other half-breeds had been held as prisoners. The half-breeds would fight the Indians, he said, if the Indians were attacked by the troops, and if attacked at once before Big Bear and his braves, who had been sent for by Poundmaker, arrived, he had no doubt Poundmaker would be easily defeated. If joined by Big Bear, Poundmaker would either attack the town of Battleford or join Riel in an attack upon it in case Riel withdrew westward, as was at that time considered probable. Col. Otter, whether prompted by a desire to punish Poundmaker for his depredations, or to prevent further mischief, determined to deal him a sudden blow. On the 1st of May, at three o'clock in the afternoon, he rode out of Battleford at the head of a flying column, composed of 75 Mounted Police, under Lieut.-Colonel Herchmer, 80 men of B Battery (Kingston) under Major Short with two 7-pounders and a Gatling; 20 men of the Ottawa Guards, Lieut. Grey; 45 of C Company, Lieut. Wadmore; 50 Queen's Own, Captains Brown and Hughes, and 45 of the Battleford Rifles, Capt. Nash. Their way that afternoon was not over open prairie land, but through broken country with low hills and a good deal of wooded land, and intersected by coulees across which the trail led. At nightfall the column halted, and lighting fires had a comfortable meal. It was considered useless to attempt to conceal their approach from the enemy, as when they left the fort, columns of smoke had been seen rising in the west, which were believed to be the alarm signal of Poundmaker's scouts. While waiting for the moon to rise and light them on their march, the men gathered round the fires and chatted about the coming fight and its possibilities, and listened to an impromptu concert by the men of C Company. About half-past eleven, when the moon, now past the full, was high enough to set forward by, every fire was carefully extinguished, and the force in waggon and saddle was soon pushing rapidly westward in the wake of the scouts and police skirmishers who had gone in advance. Under the weird light of the moon the trail was plain in sight, but the coulees through which they passed cast dark, mysterious shadows, which led some to speculate how many would return if some hidden enemy were to surprise the long line with a volley from the bush. Presently, however, on the open prairie, affording no suggestions for such surmises, the men fell into a sort of half sleep as they jogged and jolted along. Long before the moon had set in the west, the sun was sending his first faint rays up from the east, and was beginning to melt the chilly rawness of the night, when the force came to the edge of a large natural amphitheatre. The flat bottom was covered with the relics of a recent encampment. Piles of wood, evidently cut for fuel, showed that the \"Nichis,\" as all Indians are familiarly called in that region, had left at rather short\nnotice. Crossing this camp ground, and passing through an opening on the other side, the sandy trail slanted down to the right, under a high \"cut-bank,\" to a creek, just deep enough to make fording a very awkward proceeding for the wagons. The head of the column was winding through the bushes on the north-west side of the creek, when, in consequence of word just received from scouts, the pace was suddenly quickened. The mounted portion of the police dashed over the stream, out of the bushes and up a beautiful turf incline, gaining rising ground which lay in an elbow of the ravine. The guns were driven after them at a gallop, but were not yet in position or on the top of the hill when bullets came whistling over the heads of the men and the fight with Poundmaker had begun. It looked as if an ambush had been prepared and the Indians had intended to catch the forces in the natural trap formed by the gully they had just crossed. The unexpected night march had brought the troops on the scene a little too early. It was then just after five o'clock and the Indians had been caught napping. A few minutes more would have given them the top of the hill, and one prefers not to speculate on what the result would have been in that case.\n\nPoundmaker had chosen his ground. On this very spot many years before he had fought the Sarcees, under their chief Cut Knife, and had utterly defeated them, and \"Cut Knife\" had been the name of the hill ever since.\n\nThe eight or nine blanketed and painted red-skins who had opened the ball by a rush, yelling as they fired, were driven back to a coulée about two hundred yards in front of the guns—the intervening space being flat and open. In this first volley of the Indians, Corporal Sleight, of the Mounted Police fell with a bullet through his brain. His comrade, Ross, who was always to be found where pluck was needed, dragged him from under fire.\n\nThe gunners settled down to work, and shell after shell was sent over where the enemy was known to be lying—one burst in the Indian camp itself, smashing two of the tepees, and the Gatling certainly knocked over several of the assailants, though its effects were scarcely in proportion to the three thousand bullets which quitted its six mouths during the engagement.\n\nWhile B Battery and the dismounted police held the front, the other troops, though hungry after the long night march, rushed to their places without even putting a biscuit in their pockets, and bullets were whizzing around them before they could lie down in the comparative shelter afforded by the bank of the coulée. On the left, near the front, were the Governor-General's Foot Guards; further back, on the same side, lay the Queen's Own, while the Battleford Rifles defended the left rear. The men of C Company, accompanied at first by some of the Ottawa Guards, held the right flank.\n\nThe wagons and team horses were gathered together in the centre of the hollow square formed by the troops on the rising slope, and their drivers huddled among the wheels. Not a man, however, was allowed to remain inactive. It was apparent that the Indians were trying to surround the troops under shelter of the surrounding gulies, and they very nearly succeeded. Some of them, on foot and on horseback, were seen running over to occupy the hill from the other side of the coulée to the right. This attempt was nipped in the bud by the fire of C Company, who charged across and took the hill themselves. For a time the Company were exposed to serious fire. While they were executing an order to retire slowly from the hill, the Nichis in front saw their opportunity and poured their bullets into the reeds.\n\nOn the left, the Guards were in a precarious position between three lines of fire. Indians or half-breeds were hidden right and left in the coulée below, protected both by the bushes and by a natural bank; while others held the hill beyond and fired over their companions' heads. The latter were rarely to be seen; only a puff of smoke to guide the answering bullets of the Guards' sharpshooters. The enemy on the hill had to show at least their heads when taking aim. One was picked off, at long range, by a constable lying just outside the wheels of the wagons. Early in the fight Lieut. Gray led his men down into the coulée on the opposite side from that similarly defended by C Company to prevent the threatened flanking movement. They were met by a raking fire and fell back to their former position. One of the company, Osbourne, was ahead of the others, and when they retired he pushed on to gain nearer shelter in the bushes, but he was hit and rolled over when just entering the cover and his body was not recovered. The Queen's Own Rifles had the same enemy to contend against and the same tactics. At first, much lead was wasted on blankets and hats, held up as decoys by the Indians; and while one of the volunteers half rose to aim at the shan he would be the target for an Indian awaiting just that opportunity. By and by the whites found this out, and played the same trick on the reds.\n\nAbout the middle of the fray, twenty men of the Queen's Own were called for to re-occupy the position from which a hot cross fire had previously driven them. They not only did so, but passed the crest of the protecting slope and began to charge, with cheers, down towards the bushes. So close were they to the Indians that Lieut. Brock, who led the charge, had an opportunity to use his revolver. But the situation was far too exposed, and the men retired to the cover of the hill's edge. Color-Sergeant Cooper fell badly hit during that charge, and was pluckily removed to shelter by his comrade, \"Jake\" Spence, helped later by Private Campbell. The ambulance men came up and removed him in spite of his saying he was \"done for,\" and telling them to go and help some one else who might need them. Varey was struck at the same time. Big, jolly, Brigade-Sergeant-Major Spackman was firing along with the Queen's Own like one of the men, when a bullet went through his left upper arm and he was greatly disgusted at the doctors making him keep quiet in \"hospital.\"\n\nThe artillery in the meanwhile were having a hot time. The mountings of their two seven-pounders were rotten and one of the trunnion caps was broken at the first shot. After half a dozen rounds the trail gave way under the recoil and the gun had to be lifted from the ground whenever it was to be loaded. Later on, the other gun trail gave way and the gun itself had to be fastened on to the axletree with ropes. The trail of one was broken before the force crossed the South Saskatchewan, three weeks before, and was roughly repaired on board the steamboat there. Under these circumstances it is not wonderful that the artillery came near to having a hand-to-hand fight with the enemy. The Indians rushed upon the guns and the men were actually retreating, when Major Short, seeing his chance, shouted: \"Who'll follow me?\"\n\n\"I will!\" came from the soldiers near him, and with fixed bayonets they dashed forward upon the enemy. The latter did not wait for a touch of the steel, but the whites, enthusiastically shouting, charged so near that Major Short shot an Indian with his revolver and the gold braids was ripped from his own cap by another Indian's bullet, only eliciting the remark: \"It's a new hat, too.\" A little French cook, attached to the battery, used the stock of his rifle to club a Nichi whom Constable Ross had shot. The Brigade bugler, Foulkes, a lad of nineteen, belonging to C Company, fell in this charge, shot in the head. \"Boys,\" said he, \"carry me away—I'm dying,\" but all was over then, and his comrades kept watch over his body and brought it away when they withdrew. Two more bullets had found their billets in the dead bugler's breast and shoulder before then. The charge was a brilliant one, and would scarcely have ended before the tepees themselves had been reached but for the Major and his men being recalled to their guns. Thus the guns were saved and, probably, a terrible disaster averted, when the column was effecting the withdrawal.\n\nOne by one the dead and wounded were brought into the centre. They began to arrive before any protection had been arranged and were laid among the wagon wheels. Bullets were whizzing incessantly overhead and two horses close by were hit. Presently two circles of bags of oats were formed, and within these the wounded were cared for by Surgeons Strange and Leslie, and by the kind and energetic hospital sergeant of the battery, Labatt. The\nambulance corps walked nobly,—“doubling,” out to the front whenever required and carrying back the wounded on a stretcher through a heavy hailstorm.\n\nThe guns having broken down, and it being impossible to dislodge the enemy from their cover without them, it was necessary to withdraw. About half-past ten the order was given to retire, with the intention of encamping on the prairie, over which the column had come. Captain Nash was ordered to descend the left bank and clear it out; volunteers were called for to assist, and a number of the Queen’s Own and Guards started forward. This move succeeded in its object, but success was paid for dearly by the men who won it. Charlie Winder, a teamster, who had borrowed a rifle and plunged into the thick of the fight, was hit then. Gilbert, a French-Canadian, who held the position of bugler to the Battleford Rifles, was shot through the neck. Private Aitchison, of the Queen’s Own, who made an equally good soldier and chaplain, lifted the wounded man and carried him from under fire. An Indian tried to pick off Aitchison, but was himself knocked over by Lloyd, who was in his turn wounded by another Indian’s bullet. Dobbs, who had fought his way safely through the Indians’ Main Line and the Red River Expedition, now made his last flight. A bullet pierced his breast, and not many minutes afterward he ceased to breathe. Aitchison dragged him off, Sergeant McKell helping with one hand while carrying three rifles, belonging to wounded, in the other. McKell himself had probably the narrowest of the many narrow escapes experienced during that battle. A bullet cut through the knitted tague he was wearing, and took the skin from his left temple; one-eighth of an inch closer, and the result would have been fatal. As it was, the gallant sergeant for a moment thought he was badly hurt, and exclaimed: “Another Irishman gone!”\n\nAs the men were pressing through these bushes, they were stopped by the bursting of a shell in unpleasant proximity—the shell being intended to help in clearing the upper part of the coulee. On the right, the coulee was cleared of the enemy by Constable Ross and some companions from various regiments, and four ponies were captured. With feathers in harness, ribbons in tail, and gaudy saddlecloths, the animals had evidently been tied up till their owners should return from “clearing out” the white men. The withdrawal was then begun, teams got ready, the four dead were loaded on two wagons, and the thirteen or fourteen wounded men were laid in five waggons and the old ambulance carriage. One of the dismounted guns was put also in a wagon, and the procession started to descend the hill. The enemy’s fire had been pretty well silenced, except from that creek in the rear which had to be recrossed. Five half-breeds still lurked under the perfect cover given them by the cut bank. A party of scouts, under Ross, with Battleford men, waded across the stream at a point lower down, then lined the opposite side and drove out the last obstacle to the retirement. One by one the tired and hungry horses were got to drag their loads through the difficult pass, and halted when they had crossed the abandoned camp ground. But this retreating movement—a most trying one for the coolness and pluck of the men—was executed splendidly. Before the rear guard were half way down the hill, Indians reappeared on the spot whence, a few minutes before, our guns had been shelling them, and began to follow and fire upon the crowd below them. Step by step the troops retired, turning, lying down, and taking deliberate aim at their pursuers. The latter finally stopped when three of their number fell, knocked over by a shell from the rope-fixed gun, now in position on a hill across the creek. The withdrawal was delayed for a little time while the Queen’s Own brought away a wounded man who had been left on the field. This was Charles Winder, a young man from Birmingham, England, of good family, though he had left his farm at Brandon to work as teamster with this expedition. He had picked up a rifle and joined the Battleford men early in the morning, and fell in the couple just when the others were leaving the spot. He was not quite dead when lifted into the wagon that was brought back for him, but drew his last breath before he had gone far. Another teamster, John Parker, a deaf-mute, but a capital shot, perhaps hit more Indians than any speaking and hearing man in the field.\n\nNow all were safely over, and it was decided to press right on to Battleford that night, in case of a possible advance by the Indians upon the town, by the trail north of Battle River. With one halt of half an hour, and another of ten minutes, the force rode back and arrived safely at the camp about ten o’clock.\n\nThe loss of the Canadian forces in this battle was heavy, considering the strength of the force, being eight killed and twelve wounded. The names of the dead and wounded were:\n\nMounted Police—Corporal Laurie, Corporal Sleigh, Bugler Burke, Foot Guards—Private Osgood, left on field; Private Jno. Rodgers, Battleford Rifles—Arthur Dobbs, C Company; Bigger Faulkner, Teamster Charles Winder.\n\nWounded.\n\nPolice-Sergeant Ward, B Battery—Lieut. Peltier, Sergeant Gaffney, Corporal Morton, Gunner Reynolds, C Company—Brigade Sergeant-Major Spackman, Ottawa Guards—Color Sergeant Winder, Private McQuillen, Queen’s Own—Sergeant Cooper, Private Charles Nary, Private Wilts, Battleford Rifles—Ernest Gilbert.\n\nPoundmaker had a force of over four hundred warriors, three hundred and fifty of whom were Indians and the remainder half-breeds. They were well armed, for when he surrendered, at a later date, two hundred and ten rifles and guns were given up, and it was known that a considerable band of his best armed braves left him on his surrender and went over to Big Bear’s camp. Ammunition was also found on the reserves later, and the belief of those best acquainted with the Indians was, that many more arms and much more ammunition had been cached on the reserves. The losses of his forces have never been certainly ascertained. The estimate of Canadian officers who were in the action placed the number of killed at from fifty to eighty, an estimate which was confirmed by a priest who was with the Indians. The Indians, on the other hand, stated their killed to have numbered six or seven, and the half-breeds, who declared they took no part in the engagement, supported their\n\nPOUNDMAKER,\nThe Cree Chief against whom Colonel Otter marched.\nstatement. The truth will probably be never known. The battle was not a decisive victory for the troops, as they were compelled to withdraw, but before doing so they silenced the enemy's fire. The priest who was with the Indians stated that the blow was a veritable shock to the Indians, and that it would be whispered around their campfires for years to come. The volunteers behaved splendidly, never wavering or becoming panic-stricken, though half an hour after the engagement commenced it was clear that they had been led into a trap. Colonel Otter's withdrawal of his little force, without the loss of a man in the operation, from such a situation, reflected the highest credit upon his skill and upon the steadiness of his men. There can be little doubt that the blow prepared the mind of Poundmaker for the surrender which followed on the news of the defeat of Riel.\n\nCHAPTER XI.\n\nTHE TRIP OF THE \"NORTHCOTE.\"\n\nThe strength with which the rebels held Fish Creek was so great that Gen. Middleton found it necessary to bring across the river a portion of the Second Column of his Division during the engagement, though it arrived too late to take much part. It was evident that the rebels had determined to make their final stand at Batoche, on the east side of the river, which it was learned had been strongly entrenched. General Middleton therefore determined to consolidate his Division and march an undivided force down upon Batoche. Besides, circumstances made it necessary to delay the advance upon Batoche until the arrival of the Steamer \"Northcote\" with supplies. During the next day, therefore, the remainder of the Second Column under Col. Montizambert was ferried across the river. Though the battle of Fish Creek had cleared the way to Batoche, General Middleton was encumbered with over forty wounded men, who had to be protected and cared for by the column, in the absence of any safe house at a reasonable distance to which they could be sent. The supply of ammunition was also low, owing to defective pouches, which, when not kept buttoned while the men were lying down allowed the cartridges to drop out. Much ammunition was wasted, and much fired away useless, owing to the inexpérience of the troops, so that a tremendous quantity was got rid of and the supply remaining was insufficient for the work ahead. A large supply of forage, of provisions, of ammunition, and also of the much needed hospital stores, as well as the chief hospital officers were on the \"Northcote,\" which was somewhere on the South Saskatchewan river. Though the steamer \"Northcote,\" was expected at Clarke's Crossing before the advance took place, yet day after day went by after the battle of Fish Creek, during which the General and his men fretted at the delay which would enable the rebels to further strengthen their position; yet though looked for from the bank of the Saskatchewan as longingly as and far more impatiently than the sail was looked for by Enoch Arden, still the steamer did not appear. The \"Northcote\" had been detained for one reason and another at Saskatchewan Landing, and it was not until the 23rd, or the day before Fish Creek battle, that the steamer actually started down the river. She had on board a couple of hundred men.\n\nLIEUT.-COL. C. E. MONTIZAMBERT,\n\nSecond in command under Gen. Middleton in the North-West:\n\nof the Midland battalion, under Lieut.-Colonel Williams, Lieut. Howard, C.S.M., and had two scows in tow, with about three hundred tons of supplies and ammunition, the Gatling gun, and the field hospital stores and staff under the direction of Dr. Roddick, of Montreal, and Dr. Douglas, V.C., an old army surgeon, decorated for personal bravery on the field. During a voyage to India, the transport upon which Dr. Douglas was put into an island in the Indian Ocean for fresh water. The watering party were attacked by natives in sight of the ship, and so heavy was the surf that none thought it possible to take a boat through it to relieve them. Dr. Douglas, trained in the surf of Grosse Isle, below Quebec, volunteered for the attempt, took in a boat, rescued the watering party and brought them off triumphantly in spite of surf and savages.\n\nThe little expedition was under the command of that veteran officer Lieut.-Colonel Van Straubenzege. The river was unusually low, the melting snows of the Rocky Mountains not having swelled its volume as yet, and the trip was from the first one of unusual difficulty. The heavily laden boat was drawing thirty-four inches of water, and on many of the bars, caused by every petty rivulet that entered the main stream, not more than thirty inches could be found. Over these the flat bottomed stern wheeler had to be absolutely lifted by spars and steam winches, until the Elbow was passed, and it was seldom that ten miles were made without such an experience.\n\nAs time went on and no news of the steamer was received a good deal of anxiety was aroused. It was known that a great many dissatisfied half-breeds and Indians were in the neighborhood of the river, and in places the high banks would afford excellent cover for an enemy attacking her. Scouting parties were sent down the banks of the river to find her.\n\nAt the camp no military operations, except that of gathering intelligence as to the country ahead and the strength of the enemy, were undertaken, and the men fell into the routine of camp life. For days after, at Fish Creek, little groups were heard discussing the battle and, in the words of one correspondent, supposing and regretting and boasting and bragging, and exaggerating their prowess and danger, as young soldiers after their first battle always have done and always will do. The graves of those who fell had been dug in the prairie sod within sight of the field of honor and the mighty river, and green fir boughs with pale memories, carefully arranged by comrades of the dead, covered them. More enduring than flowers, a dark cairn of boulders taken from the river and carried up with much toil, slowly rose near the graves, and a great white cross of gleaming white poplar marked the burial ground of the patriotic dead.\n\nWhile all was so quiet and peaceful at the front, there was a good deal of excitement and suspense in the Qu'Appelle Valley. The Metis and Indian population of that district could put about 800 men into the field, and it was known that Riel had endeavored to induce them to rise.\n\nThe news of the battle of Fish Creek was received with rejoicing by these people, who insisted that it was a victory for their friends and relatives, and alarming reports were put in circulation. When the battle was fought there were some 200 cavalry in Winnipeg, and they were at once sent forward, the Governor-General's Body Guard of Toronto, 78 men, under Col. Dennison, going to Humboldt; the Quebec Regular Troop, Col. Turnbull, to Touchwood; and the Winnipeg Troop to Qu'Appelle, where Col. Scott, with the 91st were in garrison. The American frontier was under the constant patrol of a number of local organizations, the most important of which were Stewart's Rangers, a body of about 100 cow-boys raised near Calgary. Upon the 1st of May the Montreal Garrison Artillery, under Col. Oswald, one of the finest corps in the country, were called out to do garrison duty at Winnipeg, and to this corps belongs the honor of having made the first all-rail trip by the Canadian route, from the head of ocean navigation to Winnipeg.\n\nOn the 30th of March the Government had appointed a commission, composed of Messrs. W. R. P. Street, Q.C., of London, Ont.; Roger Goulet, of St. Boniface, and A. E. Forget, of Regina, to enquire into the claims of the half-breeds of the North-West. A court had been opened at Qu'Appelle and, in a large number of cases, land scrip for $240 was issued in abolition of the Indian title. It was stated, and that upon the floor of the House of Commons, that this scrip had been sold to speculators by the recipients, and the money so obtained invested in arms and ammunition, which was immediately sent to Riel; but this was emphatically denied, and in no case was there definite evidence of such action.\n\nThe water of the South Saskatchewan began to rise slowly about the 1st of May, and a number of carpenters were sent down to Swift Current, to build barges, which would carry stores down the river, and so actively was the work pressed that by the 4th of May ten of these boats were on their way to General Middleton, with a large amount of supplies. The little steamer \"Minnow\" had been despatched upon the same errand three or four days before. The \"Northcote\" had not been heard of for eight days, when, upon May 3rd, she was discovered by a\nparty of Dennis mounted surveyors upon a sled h. A good deal of the last time had thus been spent, and the volunteers, the Midlanders, who were afterwards to divide the honors with the 9th, eager to be at the front, were much incensed at the delay. The gradual rise of the river, however, enabled her to make a few passes, so that after landing the medical staff at Saskatoon, where the field hospital was to be placed, and two companies of the Midlanders at Clarke's Crossing, where they were to remain inarrison, General Middleton's camp at Fish Creek was reached upon the 5th of May. On the 6th of May Boan discovered wagons with improvised stretchers of rawhide, and two ambulances moved slowly out of the camp at Fish Creek with the wounded, who were so far advanced towards recovery that the trip could be attempted under an escort of Boulton's Boys. Poor Symonds, who had been struck down with a bullet through the brain, was not among them. After lingering for several days in a comatose state he died. There was now nothing to prevent the advance of the column upon the rebel stronghold at Batoche.\n\nCHAPTER XII.\n\nTHE ADVANCE UPON BATOCHÉ.\n\nThe first military operation undertaken by General Middleton's command, after the fight at Fish Creek, was a reconnaissance to the north and eastward along the river and its trails to Batoche. On the 4th of May two parties, composed of Boulton's horse and French's scouts, left the camp, the former taking the river, the latter the east trail, and reached a point fourteen miles distant. They found the whole settlement, which stretched continuously from Fish Creek to Batoche, entirely deserted. The comfortable homes, and broad and well-tiled fields of the Metis, were desolate, and it was evident from the abandonment of house-hold goods that the movement had been a hasty one. At Gabriel Dumont's Crossing the moderately well-filled store and comfortable, and even handsome, homestead of the rebel general were left with almost all their contents at the mercy of the troops. The ferry boat had not been destroyed, and, with its sweeps, lay at the landing place ready for service. Four miles further on, five men suddenly ran out of a house, sprang to their horses and rode off without firing a shot. The interior of the house occupied by these pickets was a curious sight. Upon a table lay a pack of cards as they had fallen from the players' hands, flanked by a platter of beefsteak, and upon the stove a bannock and a pot of potatoes were cooking. For the entire distance the river trail was found to be a perfectly open one, but the east trail, which French found deserted, ran through heavy timber where mounted men would be useless. In the deserted homes of the Metis was everywhere found evidence of rude, but substantial plenty, although all small portable articles of value had been carried off. The men of the reconnoitering party burdened themselves with loot, such as eggs and fowls, which the long and steady diet upon hard tack, pork, and bully beef had rendered most valuable in the eyes of the troops, and thirty-three head of cattle were driven into camp. To complete this expedition one of the three Sioux Indians of White Can's band, captured by Lord Mungo near Clarke's Crossing, was sent into Batoche as a spy, his brother being held as a hostage that he would be true to the salt, which with the large addition of bread and pork he had eaten during his captivity.\n\nUpon the 7th of May, the entire force, numbering, with the teamsters, boatmen and supernumeraries, 1,400 men, four guns and a Gatling, with 600 horses, moved slowly out of Fish Creek Camp, past the tall white cross of shining poplar over its calm of grey stone guarding the graves of the glorious dead, past the deep stern ravine where the prairie flowers were springing, and onto the north to meet the foe. Men and horses were all much refreshed by their long halt, and the march was a brisk, short and peaceable one. The Steamer \"Northcote,\" whose lower deck had been cased around with a double covering of two inch planks, accompanied the march of the column, with the men of C Company as a fighting crew on board. Lieut.-Colonel Van Straubenzee had been given the command of the infantry division, now over 600 strong. This gallant officer still suffered from the wounds he had received in his early campaigns, had, as a subaltern of the 32nd Light Infantry, served under Lord Gough through the Sikh war, and led the forlorn hope at Moulton, where he was severely wounded. At the Crimea, where he served on the staff of his brother General Sir Charles Van Straubenzee, he again distinguished himself, and during the Chinese war he was at the taking of the Summer Palace.\n\nShortly after noon the column was halted at Dumont's Crossing, and a zareebo was formed in a not very suitable locality, as it was surrounded by bushes; but though the men slept with their arms by their side the night passed in perfect quiet. By seven next morning the column was again en route, but the river trail was no longer followed, as the locality of a most dangerous ravine upon that trail a few miles beyond Dumont's had been discovered, and a detour somewhat eastward was made to avoid it. The heavy line of brush to the south, being passed for ten miles the column moved through the fine open prairie dotted with clumps of trees that lay spread out at the foot of the beautiful Birch Hills. The camp was formed upon the rounding summit of one of the prairie waves, close by the Humboldt trail, about ten miles from Batoche. While the tents were being pitched and the zareebo formed Boulton's Horse, under Lord Mungo, penetrated to within four miles of Batoche and selected the next camping ground. During the next evening Captain Frere, the son of Sir Bartle Frere, who had been appointed aide to General Middleton, reported to the General, having ridden in from Humboldt entirely alone. He brought with him a Scotch half-breed, named Tait, who claimed he had deserted the rebels, and from him it was learned that Riel had about 500 men under arms. He also furnished the General with a rude plan of the works surrounding Batoche, and, as it afterwards proved, his information was moderately reliable. The night before the battle—for all knew that the attack would come on the morrow—was a quiet one, and was\nrendered none the less comfortable, because there was hardly a mess in the camp which was not much improved by the spoils of the rebels' barn-yards. Foremost among the looters was \"the American Gatling Gun Contingent,\" who distinguished himself by bringing in a young pig and a dozen chickens. During the night a scout came in from Prince Albert with a despatch from Col. Irvine, to the effect that he had sent the steamer \"Marquis\" around to Batoche, and that there was a force of 30 men guarding a small fort at Pritchard's Crossing, some distance below that point. That night the pickets were vigilant, and it is told of one of the Midland Battalion that he halted Lord Melgund, who was coming in from without the lines, with the shout, \"Put up your hands.\" Lord Melgund did so, and after being kept in that position for a few uncomfortable moments, he asked the picket, \"Well, what are you going to do?\" The fellow slowly advanced, took a good look at him with his rifle in a most suggestive attitude, and then turning to the bush he yelled, \"It's all right Jim,\" and began to retreat in steps. \"What do you mean,\" said the astonished officer, who was not accustomed to this peculiar method of receiving the countersign, and the picket replied, as he resumed his position in the shadow of a bush, \"Nothing, but my pard had a bead on you, and, as it was all right, I told him to drop it.\"\n\nBy four o'clock the whole camp was astir, for few had slept soundly that night, and many a young soldier as he lay on his folded blanket, with his rifle by his side, let his thoughts run back to those two thousand miles away, whom he might never see again, and as lips grew tremulous and eyes grew dim with misty tears, he nervously prepared for the fight. By six o'clock the whole column was in motion, the camp being left just as it stood; under the guard of the armed teamsters. Boult's Horse, 75 strong, with the Gatling, were in advance and in support were the 10th Grenadiers, 262 strong; then came the 90th, 270; the Midlanders, 116; A Battery, two guns, 120 men; Winnipeg Battery, two guns, 52 men; French's scouts, on both flanks, 25, and the ammunition and ambulance waggons bringing up the rear. In all, there were 920 men under arms. The march was a slow one, the ammunition waggons getting mingled in some places, but there was no sign of the enemy, and the huts of Chief One Arrow's band of Teton Sioux Indians, through whose reservation the march lay, were entirely deserted.\n\nAfter an hour the whistle of the \"Northcote\" was heard, and a blank cartridge was fired in response; still there was no sign of the enemy. About eight o'clock an A Battery gun was unlimbered and a shell was put through the roof of a house on the right of the trail, and out of it ran half a dozen men who at once took to the bush. A short distance further and there appeared the little church of St. Antoine de Padoue, the parish church of St. Laurent, a simple wooden structure, crowned by a belfry, and beside it a large two-storey schoolhouse, standing on the top of the ridge that bounded the view. A little lower down the ridge, and between the church and school, were a few houses. The Gatling, which, under escort of Boult's Horse, was in advance, opened fire upon them and drove out their Indian occupants helter-skelter, leaving their uneaten breakfast. The advance guard moved up toward the church, and fire was opened upon the schoolhouse with the Gatling at short range. Instantly a priest came to the door and the whole advance guard with the General's staff rode up, and four priests and five nuns came out and begged for protection. After a few moments' conversation, during which the information that the \"Northcote\" had passed down the river under a heavy fire was obtained, the staff advanced to the crest of the ridge upon which the church stands and before them in the valley lay Batoche. Some distance above Batoche the river, which flows northward, makes a detour to the left and forms an almost semicircular curve before resuming its northerly course below the settlement. Within the curve thus formed is the high bank upon which the church and schoolhouse stand, and the whole village of Batoche, which lies 1,500 yards beyond the church, down in the valley and almost in the middle of the curve. At a point near the largest of the houses the ferry crosses the river. For some distance down the river, after its turn toward the left, the eastern bank is high and steep and well wooded, and then the bank retreating from the river forms a curve which is more or less the counterpart of that formed by the river. The village, therefore, lies in what may be roughly called an elliptical basin. The bank is not bold as at the river, but it is broken by ravines, one of which begins at the river where the bank begins to fall away, and runs back with a sinuous course, narrowing and extending to within a hundred yards of the church, from which there is a gradual descent to it. This ravine and all the small ravines, with which the whole face of the promontory was broken, were wooded. The ridge lying between this ravine and the slope to Batoche commanded the whole place, and from this ridge the General and his staff gazed down upon the peaceful looking village. In the centre was a two-storey framehouse—freshly painted, as indeed all the houses were—recently the home of Batoche, who was absent, and now President Riel's headquarters. Near it is a humbler building, used as the Council Chamber of the Provisional Government of the Saskatchewan, with a white flag, apparently emblazoned, flying above it. Between the slope and the village there were wooded bluffs, above which the brown roofs of other houses could just be discerned. On the west side of the river the bank was high but the ascent was not steep, and on the green hillock, just back from the ferry landing, could be seen a few houses and many gaily painted Indian tepees. Beyond a few cattle and ponies there was not a sign of life about the whole settlement. A Battery guns were ordered up to the ridge and shells were thrown across the river into the Indian camp, with the effect of making a number of women and children, as well as men, scamper up the hill to the north-eastward. The guns were then turned upon the Council Chamber on the east side, and the Staff with others were watching the effect. One of the guns missed fire a few times, and the fire slackened, upon which, without the slightest warning, a volley was fired at the group from the bush on the face of the slope in front, which, aided by the wild whoop that accompanied it, almost caused a panic. The bullets went high, however. In withdrawing the guns one of them caught in a tree and could not be moved. The men ran back into the coulée behind and the capture of the guns seemed certain. Captain Peters hurried forward with the Gatling, however, when Lieutenant Howard taking charge of it rushed it to the front be-\nbetween the two guns, and with his shoulder to the oscillator ground out a stream of balls that moved down the very twigs as if by a seythe. He and his men began a target for the enemy, but he worked on assiduously as if at target practice, and for ten minutes the duel between the hidden marksman and the unprotected machine gun continued. The shouts had ceased when the machine began, and the rifle fire now slackened and the guns were saved. The Grenadiers came up in time to have followed up the demoralizing fusillade of the Gatling with a charge down the slope into the main ravine in front, but this the General refused to order, and they were thrown forward as the centre of the line in the immediate front of the church. The sharpshooters of the 90th were ordered up on the right to support the Gatling gun. A Battery men and French's scouts advanced toward the river down the little gully behind the ridge, into which the enemy crept by rounding the edge near the river. The bank further back was lined by two companies of the 90th. The remainder of the 90th and the Winnipeg Battery reinforced the Grenadiers on the right, the Middletons being in reserve, while Boulton's house was at the extreme right. French's scouts soon met the enemy and a desperate fight in the ravine followed. There Philipps, of A Battery, was shot. The scouts further down were very nearly being cut off at one time, but the Gatling was again advanced, and the enemy fell back under its fire. The fire now became very general. It was then discovered that the banks of the river, the small ravine and the main one, as well as the face of the slope, were entrenched with rifle pits. Long shots were taken by rebel marksmen from across the river at the staff who were at the church, and some of them came altogether too close. An attempt was made by the Winnipeg Battery to shell out the rifle pits in the main ravine in front about noon, but with little effect, and shortly after Boulton's Horse had to repel a determined attack on the right flank. About the same time an attempt was made to turn the left flank also, the rebels advancing from the ravines that separated the bluff, but a force was sent into a little cemetery on the bluff behind the small ravine and this movement was checked. During the attack on the right flank the prairie was in sight, the advance skirmishers had actually to jump the line of fire. About two o'clock the Middletons were sent down the little eminence, accompanied by Dr. Alfred Godd, and in the face of a hot fire brought out the body of Gunner Phillips. The strength of the rebel position began to be realized, and after an interview with General Middleton, Lord Macdonald left for Ottawa, as it was supposed to represent the need for reinforcements. After three o'clock the fight languished, and an hour afterward the force began to retire to a position about four hundred yards east of the church, the wagons being sent for, and a zareba formed. Preparations for defense were at once begun. The lines of an entrenchment were marked out and by night the rear was safely entrenched. The losses for the day were nine men of A Battery, Gunner Phillips killed, and three wounded; one man of the Grenadiers slightly wounded and two of French's scouts, all one man killed and six wounded.\n\nThe bravest exploit of the day was the rescue of Cook, one of the scouts, by Captain French. The man fell in the small ravine when the scouts were about to retire, and his captain took him on his back and staggered with him up the slope amid a heavy fire. The night was a terribly anxious one, and but few slept. All through the weary hours the rebels kept up a desultory fire, and one man was shot dead in the entrenchments. Men worked hard with pick and shovel throwing up shelter works, all night. The Canadians turned their wagons into covered works by digging a rifle pit beneath them. The skill of the volunteers in this work was said by General Middleton to be beyond that of any regulars. On the withdrawal of the troops, the Metis occupied the church and schoolhouse which they barricaded. That evening Phillips was buried by his comrades of the Battery, Chaplain Gordon reading to attentive listeners the solemn service, \"I am the Resurrection and the Life,\" he read, and a volley from the sharp-fire too soon, and the scheme failed. During the day Captain French moved to the north-east and came in behind Batoche. He found a broad open plateau to the right of that place and captured a number of ponies. During the evening Dennis' Horse, a body of fifty surveyors, raised by Captain Dennis, and acquainted with the ground, rode into camp and took a prominent part in the little skirmish that followed the attempt to entrap the rebels. The night passed in moderate comfort, and the men by this time regarded the whistle of a bullet as being the most natural thing possible, and unworthy of attention.\n\nOn Monday, as the result of Captain French's report of his detour of the day before, a reconnaissance to the north-eastward was undertaken by General Middleton, with Boulton's and Dennis' Horse and the Gatling. It was discovered that from that side Batoche was defended by a line of rifle pits along a strip of woods, which clothed the ridge between the plateau and the valley of Batoche. The party had a little skirmish with a band of Metis, and the Gatling again did good service. General Middleton, during this affair, personally captured an Indian, who tried to get into the woods. In camp Lieut.-Col. Van Straubenzee, who was in command, sent out some guns to occupy the river ridge near the cemetery, which was reported to have been deserted, but the rebels were found there in strength and the men came back into camp. During the day there was nothing more exciting than a constant interchange of shots between skirmishers. The Winnipeg Battery turned out and shelled the west bank in the afternoon, and did a good deal of damage. Slowly and sullenly the men came back in the evening, giving up the ground they had been winning all day, and began to make themselves as comfortable as they could. The work of the last few days was of the most trying character, and the men were growing desperate. That night was not a cheerful one. The list of casualties that had taken place up to that time was not a long one, three men being killed and fifteen wounded.\n\nCHAPTER XIII.\n\nCARRIED BY STORM.\n\nThe First Division had now been before Batoche for three days. They had been marched out of the zareba each morning, and advanced in the face of a fire to the shelter trenches which had been constructed along the left and centre front, within rifle range of the enemy's pits beneath the slope, only to be retired at night without gaining any ground. Such work was trying, and the men, though they marched forward and marched back under the word of command, did so without spirit. General Middleton, remembering that the forces whom he commanded were not ordinary regulars, but men whose loss would cause unutterable sorrow throughout the whole Dominion from the highest to the lowest, hesitated to order making the sacrifice of life, which the carrying of such a position seemed to demand. He determined, therefore, \"to keep pegging away\" from behind the entrenchments until the enemy had wasted\ntheir ammunition, of which they were reported to be short. Recognizing, however, the effect of that kind of work upon the spirits of his men, which up to this time had been overflowing in spite of all the difficulties and hardships of the march, General Middleton determined upon allowing them to strike a decided blow.\n\nThere can be no doubt that they surprised their commander by the liberal interpretation which they gave his order on that memorable 12th of May before Batoche. In the morning, General Middleton with the cavalry, the Gatling and a detachment of A Battery with one gun, moved out to the eastward on the extreme right front to test the strength of the enemy's rifle pits along the woods there and to throw some shells into the village. The infantry, under Colonel Van Straubenzee, took their accustomed place in the shelter trenches at the front, the Midlanders at the left, the Grenadiers in the centre and the 90th upon the right, next to some woods. The usual exchange of shots was kept up between the skirmishing lines of the infantry and the enemy in their rifle pits. On the right the skirmish became hotter than usual, and Kippen, of Dennis' Surveyors, was killed. The gun of A Battery was doing damage, for a white flag appeared and two prisoners named Astley and Jackson came in with a note to the General:\n\n\"Sir,—If you massacre our families we will begin by killing Indian Agent Lash and other prisoners.\"\n\n\"Louis David Riel.\"\n\nThe following reply was sent back by Astley, who was on parole:\n\n\"Mr. Riel,—I am most anxious to avoid killing women and children, and have always been so. Put women and children in some place and I won't harm them. I trust to your honor not to put men with them.\"\n\n\"Fred. Middleton.\"\n\n\"Major-General Commanding.\"\n\nThis and other signs of weakness on the part of the rebels confirmed General Middleton's determination to make a decided advance, and coming back to camp with his column, he gave instructions to Colonel Van Straubenzee, who communicated them to Colonel Williams, commanding the Midlanders, and Colonel Granett, commanding the Grenadiers. The Midlanders were extended out to the extreme left and advanced to a position overlooking the river bank, the Grenadiers in the centre, facing down the slope leading to the small ravine, and the 90th to the right. Shortly after the action had begun, Boulton's Horse and Dennis' Surveyors took the extreme right by the woods. Thus a line was completed, the left of which rested upon the river and stretched along the whole front for nearly a mile and a half. The Midlanders on the extreme left had advanced, firing upon the rifle pits on the river bank, and though far in advance of the rest of the line they would not be checked, but with a loud cheer they rushed down, jumping over with fixed bayonets among the rifle pits. The Midlanders cleared the bank of rebels right to the cemetery, and while passing the mouth of the small ravine they fired a volley up it, sensibly diminishing the fire of the occupants of the pits there. The Grenadiers had advanced from their shelter trenches and were coming down the slope towards the ravine, to pass over the ridge; the fire from the small ravine had galled them, and the action of the Midland Battalion came at the right moment. The right of the Grenadiers had swung forward and reached cover over the slope of the ridge in the great ravine, and they were able to enfilade the marksmen in the rifle pits on the ravine slope, while the left of their line, led on by Col. Van Straubenzee, catching fire from the Midlanders, charged the rifle pits of the small ravine. Bayoneting the occupants, they passed over the ridge and joined the Midlanders, who had been checked in their charge down, by the fire from the slope which the rebels deserted for the wooded bluffs lying before the village. The 90th extended out behind the woods at the right and rushing down the slope were met with a fire from the rifle pits there, which they soon reached and cleared, however, of the rebels, who, joining those who had been driven by the Midlanders and the Grenadiers from the river brink and the ravines, retreated into the covered bluffs. One of the guns of A Battery came up to the plateau of the ridge and shelled the bluffs which the enemy attempted to hold. The Gatling gun on the right was grinding out bullets at that part of the wooded bluffs to which the 90th were rushing. The 90th, Midlanders and Grenadiers reached the bluffs in the order named, when the Gatling ceased fire and the gun was turned upon the village. Boulton's men had dismounted and, taking advantage of the opening which had been made in the line of the rifle pits by the 90th in their charge, they cleared the rifle pits along the extreme right of the slope, which guarded the trail from the east, and which were of formidable construction. These men, who crossed the series of echeloned pits, did terrible execution with their Winchester rifles. The 9-pounders of the Winnipeg Field Battery were worked upon the bluffs as the rebels, driven by the infantry, rushed for cover to them on their hasty retreat to the village. Between the bluffs and the village there was a ploughed field, across which the men had to advance in the face of a stiff fire from the rebels concealed in the houses. More men were lost in this operation than in the carrying of the rifle pits. Had the rebels not been demoralized by the charge upon them in the rifle pits, which was totally unexpected, as the clothing, rifles and ammunition left there, and the loss of life in-\ncurred by the rebels proved, the village would probably have been more stubbornly held.\n\nIn the very heat of the advance a note from Riel was put into General Middleton's hands, its bearer coming right through the charging line. This note was:\n\n\"General, your prompt answer to my note shows that I was right in mentioning to you the cause of humanity. We will gather our families to one place, and as soon as it is done we will let you know. I have, etc.\"\n\n(Signed), Louis David Riel.\n\nOn the envelope he had written:\n\n\"I do not like war, and if you do not retreat and refuse an interview, the question remains the same concerning the prisoners.\"\n\nBefore Riel had time to carry out his threat, however the volunteers were into the village, and the houses were being carried one after another with a rush. One of the first to reach the village was Captain French, one of the heroes of the campaign. Fired with the glow of battle this gallant soldier, an old Inspector of the Mounted Police, and one of the most dashing men upon the prairie, had led his little band of scouts on at the forefront of the charge. When the village was reached he dashed into Batoche's house, and, as he gained a window of the second storey, fell back dead, with a bullet from the opposite bank through his heart. Col. Williams made a rush for a small house near Batoche's and pulled up a trap door, beneath which were Riel's prisoners, nine in number, all safe. The victorious troops rushed on for a mile after the routed and dispersed Metis and retired only at the approach of darkness, to camp in the deserted citadel of Riel's rebellion.\n\nThe eventful day had not entirely passed, however, before both the Stra. \"Northcote\" and \"Marquis,\" the latter from Prince Albert, appeared, and the entire force was once more united. The day that saw the rebellion of the Metis crushed forever saw the junction of Gen. Middleton's and Colonel Irvine's forces, as a body of police, a part of the garrison of Prince Albert, which for two months had been cut off from communication with the outer world, was upon the \"Marquis.\" In one hour Batoche, which it was afterward found was impregnable to an ordinary assault, had been taken at the point of the bayonet, and Louis \"David\" Riel was once more a homeless fugitive.\n\nThe loss in this gallant charge had been heavy; but it was light in view of the results accomplished when compared with that of Fish Creek. Besides Captain French, Lieutenant Fitch, of the Grenadiers, went down in the front of his charging men. Captain Brown, of Boulton's Horse, fell while leading on his gallant troops upon the extreme right, and Lieutenant Kippen, of the Surveyors' Corps, fell in the preliminary reconnaissance. The total loss in killed and wounded during the four days' fight was:\n\nDEAD.\n\nJames Fraser and Richard Hardisty, of the Ninetieigh Winnipeg Battalion.\nLieut. A. W. Kippen, of the Surveyors' Corps.\nLieut. W. Fitch and Private Moore of the Grenadiers.\nCaptain F. T. Brown of Boulton's Horse.\nGunner William Phillipps of A Battery.\nCapt. John French of the Scouts.\n\nWOUNDED.\n\nA Batterie—Wm. Fairbanks, thigh; M. Cowley, thigh; Carpenter, right knee and left leg; T. Stokes, run over by gun carriage.\nGrenadiers—Maj. Dawson, leg; Captain Manly, foot; Captain Mason, hip; Privates Brisboire, forehead, slightly; Enger, jaw; H. Milson, chest; A. Marshall, in ankle; Barber, in head; Cantwell, hand and thigh; Quigley, right arm; Cook, arm; Stead, arm; Scoble, arm; Bigler Gaghan, hand; Corporal Foley, side.\n96th Battalion—Corporal Wm. Kemp, right eye; Ralph Barton, left hand and neck; Erickson, left arm; by a well-trained strategist. As a garrison, between the Metis and Indians there were five hundred men armed with rifles, muskets and fowling pieces, but the inferiority of their arms was more than compensated for by the skill with which they were used and the strength of the rebel position. After the fight was over there were forty of their dead bodies found upon the field of battle, and the best authorities place their losses at 53 killed and 173 wounded.\n\nWith the morning light came the men who had for so long been fighting the troops, to give up their arms and beg for mercy. Only those who were implicated as leaders in the rebellion, were retained as prisoners, and the rest were told to go home. The whereabouts of the leader of the rebellion, Louis Riel, was the important point, and Boulton's Horse were sent off to scour the country for him. On the morning of the 15th, three scouts, Houric, the man who was the hero of the many exploits recorded, with Diept and Armstrong, two kindred spirits, rode out, and early in the afternoon, when some distance in front of the Mounted Infantry, came upon three men, one of whom, unarmed, with unkempt hair, and without hat or coat, was the President of the Provincial Government of the Saskatchewan. No resistance was offered either by himself or his armed companions, and Riel handed to the scouts a letter he had received from General Middleton promising him protection and a fair trial. Full of fear he came into camp behind Houric, and was at once taken to General Middleton's tent. Armstrong, who took him in, tells the story of the meeting: \"I said, 'General, this is Riel.' The General started up, saying, 'How do you do, Mr. Riel?' 'Take a seat, Mr. Riel.' 'Pray be seated,' I then came away.\" Of Gabriel Dumont nothing was heard but that he had fought like a lion, and made off when all was over, with the fastest horse on the prairie under him, and of all his broad acres, comfortable homestead and valuable property, nothing remained to him but his rifle and his pony. He reached Montana and was arrested at Fort Assiniboine by American officers, but his release was ordered from Washington.\n\nCHAPTER XIV.\n\nRUNNING THE GAUNTLET.\n\nThe steamer \"Northcote,\" about whose safety so very much anxiety had been felt during the siege of Batoche, had passed through an ordeal which does not often fall to the lot of a stern-wheel steamer. She left her anchorage at Dumont's Crossing, at six on the morning of May 9th, with orders to remain about a mile and a half above Batoche until the sound of the bombardment of that place by the main column was heard. She had been about two\nhours under way when the rebels interfered sadly with this programme by opening fire on her, the first shot passing through the pilot-house. A perfect storm of balls followed this signal shot. From bush and tree, boulder and ravine, a hail of musketry and rifle balls was poured upon her, and her light upper works were speedily riddled.\n\nFrom the well protected lower deck, the barges alongside and the pilot house a steady fire was kept up by the men of C Company, who formed the fighting crew. The sick men, among them being Lieut. Hugh A. Macdonald, son of the Premier, left their berths to use rifles. The few civilians on board passed ammunition or fought. The pilots, Captains Seeger and Sheets, although their shelter was poor, never lost control of the boat. Just above Batoche there is a piece of swift water, almost deserving the name of a rapid, and a long bar, jutting out into the stream, left but a narrow channel close to the western bank. This was just at the turn in the river above Batoche, and in passing it the bow of the boat almost grazed the shoal in front of a deep ravine. From this place, which was full of men, a terrible raking fire was poured into the boat, but so strong were her defences that it did but little damage. When opposite the church, the crew saw hanging to a tree, on the west bank, the body of a man, but who this victim of the rebellion was, and why he was executed, have never been discovered. At Batoche the enemy made their appearance in force, but they were speedily driven to cover by the steady fire from the boat.\n\nUnder full steam and with the impetus of the swift current the steamer rushed on, and as she neared the Crossing the steel cable of the ferry was suddenly lowered. It just grazed the lofty pilot-house, sending all the forward spar gear down, and then catching the smoke-stacks, toppled them over on the hurricane deck with a crash. Had the cable been dropped a little lower it would have caught the pilot-house, and the disabled boat would probably have been captured. An instant after, in order to avoid a couple of boulders, the boat was thrown over, and she swung completely round and for an instant one scow grazed the bank. The enemy made a rush to board her but were driven back by a withering fire from the rifles. At nine o'clock the rebel fire suddenly ceased.\n\nFor one hour, while traversing a distance of about five miles, the boat had been under a perfect storm of fire. Over two miles below the enemy's position she came to anchor, almost helpless. The crew were at once set to work and the smoke-stacks were shortened and put up. This work was hardly completed before fire was again opened upon the boat, and the workmen were driven from the exposed deck, nor would they venture upon it again to repair the whistle, by which only communication with the main column could be maintained. An offer of fifty dollars apiece to the two men who would undertake to replace it brought two men forward, and they had hardly fitted it in place when a volley drove them below. Signaling could be resumed, however, but the only answer was the heavy cannonading from Batoche. Major Smith, the commanding officer, Captain Wise, A.D.C., and Mr. Bedson, an invaluable officer of the transport service, held a council of war and decided to return, but the officers of the boat refused to do so, stating that the wheel was so badly protected that the pilot would certainly be shot, and, moreover, that the written orders of the General forbade such action. Eddies, a private of the 90th, and an old steamboatman, gallantly volunteered to pilot the boat back, but his offer was not accepted. Although the pilot-house was pierced in a number of places none of its occupants were wounded, though Captain Seeger's coat-sleeve was shot through. Only three men were wounded, and that but slightly; Pringle, a member of the ambulance corps, was shot through the shoulder; Vinen, of the transport service, through the thigh; and Lieutenant Macdonald slightly. During the night an alarm was given, and a volley was poured into the boat from the west bank, to which no reply was given. Sunday was passed at anchor, with no cannonading from Batoche.\n\nGuardapuy's Crossing, with the entire force, leaving Father Vegreville as the Queen's representative for the occasion to accept the surrender of the repentant rebels. From every house and cart, even from the hats of the men and the garments of the women, fluttered white flags as the emblems of peace. The battle standard of \"La Nation Matisse,\" a white tablecloth with a coloured print of the Virgin upon it, which had fallen into the possession of Lieutenant Howard, was an object of curiosity to all the camp. At Batoche there was collected a great number of families, from whom the ravages of war had taken father, husband, brother, or son, and who were in the greatest distress. They appealed to the General for protection, and Mr. Bedson, the chief of the transport service, and one of the mainstays of the expedition, himself took up sixteen waggon loads of flour, bacon, tea, and sugar to them.\n\nThe battle rage had passed away from both the combatant forces, and upon the supporters of this lost cause there had fallen a great sorrow. The men who had fought so desperately in the rifle pits at Fish Creek and Batoche, in almost every instance, declared moodily that they had been forced on to fight by their leaders, and could give no intelligible motive for their action; but in this they were not peculiar, as the rank and file of a rebellion have but seldom revealed to their conquerors the reasons which moved them to strike. The prisoners who had been so long confined in the rebel camp had not been harshly treated up to the time of the battle of Batoche, when they were placed in a cellar, but all had suffered greatly from close confinement, monotonous food, and the constant fear that Riel, whom they looked upon as insane, would condemn them to death. There were in all nine of them released by the troops.—Mr. J. B. Lash, the Indian agent at Carleton; Wm. Tomkins, his interpreter; Peter Tomkins, the interpreter's cousin, and J. McKean, telegraph repairers; Harold Ross, the deputy sheriff of Prince Albert; William Astley, a Dominion Land Surveyor; Edward Woodcock, who had been in charge of a store at Hoodoo; A. W. McConnell, one of General Middleton's scouts, captured when endeavouring to carry despatches into Prince Albert, and J. E. Jackson, a brother of that Jackson who was the first to give his adherence to Riel's strange creed and who became his private secretary. All of these prisoners—except the scout—had been captured before the Duck Lake fight, and in nearly every case they had been surprised and seized before they could offer resistance. During the first fortnight's existence of the Government of the Saskatchewan, quite a number of prisoners had been seized and subsequently liberated; among them were a number of half-breeds who refused to take up arms, and as a general rule these men swore allegiance. Two of them, Nolin and Marion, deserted upon the first opportunity, and Nolin was captured by the garrison of Prince Albert where he had the reputation of being the real instigator of the armed rising. The ar-\nchives of the rebel government had been captured by Captain Peters, of A Battery, who placed them in the General's hands. From the written minutes of the council and numerous documents it was manifest that the battle of Duck Lake had been but the first step in a movement for the capture of Carleton, and the subsequent seizure and spoiling of undefended Prince Albert. From the time the column left Touchwood its every movement had been watched, the number of men, guns, and horses repeatedly ascertained, and a complete and accurate plan of the camp at Clarke's Crossing, in which every fire trench was marked, was among the documents. A plan had been arranged for an attack upon the zareba at Batoche in the grey of the Wednesday morning, when an attempt would have been made to pass the pickets, stampede the horses, and attack the troops amid the confusion at close quarters. The bayonet charge that carried the rifle pits twelve hours before they intended to attempt this programme, was the unforeseen event upon which it went to pieces, and so thoroughly protected was the camp that it is very improbable that it could have succeeded. Some twenty men, who had taken prominent a part as leaders of the revolt for their own good, were held as prisoners. These were Maxime Lepine, of St. Boniface; Andrew Nolin, the rebel commissariat officer; W. H. J. Jackson, a young Canadian, and Riel's private secretary; Francis Tourand, who fought in the three fights, and was one of the guards of the prisoners; Maxime Fider, who voted for the shooting of the prisoners; Pierre Henry, who did the same thing; Patrice Touron, who shot Captain Morton at Duck Lake; Baptiste Echelot, the captain of the guard over the prisoners; Albert Monkman, a leader at Duck Lake and a member of the council; Emmanuel Champaigne and Joseph Pilon, captains of rebel companies; Moise Parentot, an irreconcilable, who took a prominent part in the Red River rebellion; Alexander Fisher, receiver-general of the rebel government; Baptiste Verduie, captain of a company; Alex Lombombark, a Sioux interpreter who was supposed to have induced White Cap to support Riel; Ignace Poitras, one of the veterans of the Red River trouble, and his son, who were amongst the guards over the prisoners; Pierre and Alexandre Parentot, who demanded an appeal to arms; Maxime Dubois and J. Deforme, members of the guard over prisoners, and M. Jobin, member of the council.\n\nOn the 18th of May the steamer \"Northcote\" was despatched to Saskatoon with the wounded, and on board of her Louis \"David\" Riel, under the guard of Captain John Young and a small party, began his journey to Regina, where he was to be placed under the charge of the Mounted Police to await his trial. Upon the 18th the Midlanders, reinforced by the arrival of the two companies stationed for some time at Clarke's Crossing, were sent to form the advance guard of the force during the march to Prince Albert, and all that day the tedious work of ferrying the long column and its transport across the river went on. There had been gathered at Guardpury's Crossing at one time no fewer than five steamers: the \"Alberta,\" \"Baronesse\" and \"Minnow,\" of the Galt fleet having joined the \"Northcote,\" and the \"Marquis.\" With the river full of stern-\nwheeler, and the camp of a thousand men at the Crossing, the once solitary place had been for two days a centre of breathless activity.\n\nAll this vanished on the evening of the 18th, and the march to Prince Albert was begun by the victorious troops, who easily overcame both distance and difficulty. It was about twelve of the clock on a beautiful spring day, the 19th of May, that the head of the dusty, travel-stained, yet quick marching and light-hearted column poured into the long isolated town of Prince Albert. Every soul in the town was out to welcome them with great cheers and with the music of a brass band. The local company who had given at Duck Lake ten of their number to the list of the dead, appeared with the colored ribbons of their company in their hats, and the Mounted Police, looking neat and clean in bright scarlet tunics and well polished boots, presented arms to the General. The hard-worked volunteers in their ragged uniforms, and with their well-used but not shining arms, presented a contrast as complete as outward appearance could make it to the \"gophers,\" as the troops speedily named the Mounted Police at Prince Albert, who they thought resembled those prairie dwellers that never venture far from their holes and always pop into them on the slightest appearance of danger. The clothing of the troops had not been new when the campaign began, and the vicissitudes of the march, the camp and the battlefield had completely demoralized it.\n\nAfter Fish Creek there had been much patching of uniforms, and after Batoche many a man was glad to tie his uniform together with blanket strips. Col. Irvine, who had the reputation of being a most dashing officer, had good reason for the long inactivity of the three hundred Mounted Police under his command. The long, straggling town of Prince Albert, even with the church and manse converted into a citadel by piles of cordwood, was a most difficult position to defend, and had the police left the valley its protectors would have had only ninety stand of arms, but fifty of which were rifles. A movement upon Batoche on his part would have brought about a battle in the thick fir woods which lie between Prince Albert and that place, in which the superior numbers of the enemy could have been so brought to bear as to completely destroy the force at his command. Gen. Middleton decided to push on to Battleford, which appeared to be again shut in by the Indians. The York and Simcoe regiment had been sent on to Humboldt, where the Governor-General's Body Guard, under Colonel Denison, were doing picket duty, to cut off stragglers endeavouring to escape to the south, and the 7th Fusiliers were at Clarke's Crossing, having descended the river from Swift Current on barges. It was decided to leave the Winnipeg Field Battery at Clarke's Crossing as an addition to the police garrison, which was to be undisturbed. These converging bodies of troops made it impossible for any band of irreconcilables to do any damage to other than scattered settlers. On the 20th a body of fourteen men of the Governor-General's Body Guard, after a two days' chase, captured White Cap and twenty-two of his braves, while on their way towards their reservation south of Saskatoon, and brought them to Humboldt. Gabriel Dumont was now the only rebel chief at large, and he was captured by the American scouts on the Milk River, about the 23rd. He was taken to Fort Assiniboine, and the Secretary of State communicated with. After some days, orders were sent to release him, as he was a political prisoner; and the bravest, most skilful, and most manly of the rebel leaders disappeared. Beady, the chief of the malcontents at Duck Lake, had already surrendered to General Middleton.\n\nTo General Middleton, Duck Lake.\n\nThe General at once entrusted to Poundmaker's ambassadors the following answer—\n\nSteamer North-West, May 23, 1885.\n\nPoundmaker.—I have utterly defeated the half-breeds and Indians at Batoche's, and have made prisoners of Riel and most of his council. I have made no terms with them, neither will I make terms with you. I have men enough to destroy you and your people, or, at least, to drive you away to starve, and will do so unless you bring in the tenants you took, and yourself and councillors to meet me with your arms at Battleford on Tuesday, 26th. I am glad to hear that you treated the prisoners well, and have released them.\n\nFRED. MIDDLETON,\nMajor-General.\n\nUpon the 23rd, Colonel Van Straubenzee, who remained in command at Prince Albert, despatched the 90th up the river on the \"Alberta\" and \"Baroness,\" and, with the Grenadiers, marched overland to Carlton to await the arrival of the \"Marquis.\" That steamer not coming up, however, he crossed the river with his column and the transport, and pushed forward by the north trail.\n\nCHAPTER XVI.\n\nPOUNDMAKER'S SURRENDER.\n\nAt Battleford the men of the Second Division had laid the seven loyal dead, of the fight at Cut Knife, beside the two first victims of Poundmaker's rising, and then settled quietly down to garrison life and its duties. A long line of pickets had to be maintained, entrenchments thrown up, rifle pits dug, and fatigue service of all kinds performed. Another bastion was erected, and a broad ditch dug entirely around the fort, the earth from it being piled up against the stockade until that somewhat flimsy defence became a veritable earthenwork. The members of the flying column, which fought at Cut Knife, vied with one another in the narratives of the fight they related to their less fortunate comrades who had not been at the battle, and this and the rations furnished the great staple of conversation. The men had now been living for nearly two months upon an almost unbroken diet of hard tack, \"bully\" beef and pork. The beef was fat and stringy, the pork was not fat pork, but pork fat, and many a man who had supported the long\nmarch, the steady fight, the countless discomforts and constant labor of the expedition without a falter or a murmur, was compelled to live for days on bread alone, simply because he could not eat the meat rations. Still the men's spirits did not fail them; they played cricket, lacrosse and quoits with tremendous energy, when not at work, and sang all the old songs and the new ones over and over again. But when they sang\n\n\"The Queen's Own are getting lean,\nBut the pork keeps on its fat,\"\n\nto the chorus of \"You can bet your boots on that,\" they meant it. On May 12th, a young half-breed named Samuel Denison, accused of \"giving false information with intent to lead Her Majesty's forces into a trap,\" was brought before Inspector Dickens, the senior officer of the Mounted Police in the fort, and that gentleman explained to him that he was charged with \"high treason, sedition, conspiracy and rebellion, which was rather serious.\" The man was remanded, and subsequently released on parole, while of the other prisoners, Lyon Short, Alex. Bremner, James Nolin, jr., Duncan Nolin, Peter Sinclair, Jos. Ducharme, and Jos. Vaudrail, were released. This did not constitute an entire gaol delivery, as six prisoners, including one Godfrey Marchand, charged with selling arms to the Indians, were still retained in confinement. Upon the 15th, a mail-carrier, named Kilough, rode into camp and reported that a waggon train had that day been captured by the Indians. The train of eighteen ox-teams and eight horse-waggons was passing through the reserve of Mosquito, where Payne had been murdered, about eight miles from Battleford, when a body of fifty Indians suddenly came upon them. Those of the men who could, some eight or ten, cut loose their horses and galloped for safety along the Swift Current trail, the remainders submitting without a blow, and giving up some fifteen stand of arms as well as their wag-\n\ngons, and about three hundred rounds of ammunition. Hardly had the news of this sure indication that the Indians had moved east in force, been brought in, than a party of the Mounted Police, who had been out on a scouting expedition, rode in from the south with the information that they had been attacked and had lost a man. The little party, made up of Constables Robertson, Spencer, Elliott, Allan and Storer, under Sergeant Gordon, with a half-breed scout, had reached a point some distance from camp on the Stinking Lake trail, when a body of thirty Indians rode up on a ridge before them and opened fire. The little party wheeled at once, as the enemy had the advantage of both numbers and position, and in the gallop back to Battleford one of the men, Elliott, lost his seat. He was a young man, an American by birth, the son of a New England clergyman, who had served in the regular cavalry of the United States, and seen much hard service. As a result of his army training, he always rode with long stirrups and a military seat, and it was because of this he fell from the saddle. He sprang into the bush and escaped from the first band of Indians only to fall in with another, and they shot him in the back. Upon the following day, a party of scouts, under Ross, who had gone out on the 12th, returned with definite information to the effect that Poundmaker had abandoned his camp at Cut Knife Hill, and with a large force, about a thousand in all, which would include three hundred warriors, and with a large herd of cattle was moving east in the direction of the Eagle Hills. A day later the body of Elliott was brought into camp by Ross and his scouts. They had found it wrapped in a canvas tarpaulin, and buried with some care under a little mound of sand. That day it was laid by the side of the other nine victims of the Battleford campaign. Although there had been several alarms in the fort no Indians were seen by this party. A fire had been seen gleaming out from the ridges of the Eagle Hills, so that it was thought Poundmaker had taken refuge in their fastnesses.\n\nOn the morning of the 20th a little \"outfit\" of four waggons, over which flew a white flag, appeared upon the crest of the hills, coming slowly towards Battleford by the Swift Current trail, and an escort was at once sent out. It proved to be an embassy from Poundmaker to Colonel Otter, asking for terms of surrender, and the letter, carried by Father Coehlin, the Curé of Bressay, was accompanied by twenty-one teamsters captured the week previously, Lafontaine, the scout, who was captured while reconnoitering after Cut Knife Hill, and about half a dozen of the suspected half-breeds of Bressay. These last claimed that they had been held as prisoners by the Indians, but this it is an article of the creed of the North-westers to disbelieve. Colonel Otter, not knowing that Poundmaker had already communicated with General Middleton, told him, in answer to the peace proposal, that he must treat with the General him-\nOn the morning of the 26th of May a body of 150 of the half-breeds of Bresaylors came in and gave up their arms and ammunition, which they declared they had never used. A little later Poundmaker, with his people, about two hundred of whom were warriors, arrived and gave up their arms, two hundred stand in all, of every imaginable kind.\n\nNo terms of surrender had been agreed upon, and General Middleton, in the long pow-wow which he held with the chiefs, would grant none. He upbraided the Indians for their ingratitude in rising against the Government, their cowardice and their lies, and demanded from them the murderers of Payne and Fromont. Poundmaker, who did most of the talking on the Indian side, declared that he never intended to join Riel, because the Metis had not ammunition enough, that he had only fought when fired upon, and that he knew nothing of the murders. With the utmost nonchalance the chief said in reply to the allegation that he was a coward and a rebel:\n\n\"I am sorry. I feel in my heart that I am such a person as I am.\"\n\nIkta, the man who had murdered Payne, and Wa Wanick, the murderer of Fromont, came out from among the rest at last and gave themselves up, confessing their guilt. Poundmaker, Yellow Mud, Blanket, Breaking-through-the-Ice, and the two murderers, were retained as prisoners, and the band were sent upon a reservation where, deprived of all their arms and food, they were absolutely dependent upon the military authorities for sustenance.\n\nPoundmaker's surrender at once re-established peace in the Battleford district; every trail was reopened, and the settlers at once began to visit their ruined homesteads and collect what remnants remained of their live stock. The troops from Prince Albert rapidly gathered at Battleford. On the 26th the \"Baroness\" arrived with the now famous 90th, the fighting regiment, whom General Middleton had proudly called \"My Little Devils,\" and on the 27th the 10th Royal Grenadiers, C Company, and the long train of transport waggons arrived on the north shore of the Saskatchewan, having marched from Carleton in two days. The \"Alberta\" with supplies and a portion of A Battery, came in next morning. The regiment of Canadian artillery was therefore united, with a total strength of some two hundred and thirty men and officers, with four guns and two Gatlings, and C Company became whole once more. In all, a force of 1,195 infantry, 250 artillery with four guns, two Gatlings, and 270 cavalry were concentrated at Battleford. Besides these troops the 7th Fusiliers and the two remaining companies of the Midlanders, adding 350 men to the force, were ordered forward from Swift Current, and it was therefore quite safe to allow the Battleford rifles to be disbanded. Colonel Scott's battalion, which had lain in garrison so long at Qu'Appelle and along the railway line in that vicinity, was also ordered forward, the right wing to garrison a post in the vicinity of Batoche, and the left to proceed to Battleford, to garrison it. On the 28th an Indian was shot by a white settler, the particulars of the circumstances being carefully hidden, but the act revealed the dangerous character of the settlers' feelings towards the Indians. A more pleasant incident was the meeting with Chief Moosomin, whose reservation was just west of Battleford, who had kept the Queen's peace. The General shook hands with him, something he had refused to do with any other Indian, and had a long conversation with the old man, who told him that he was busy sowing some seed at Turtle Lake when the outbreak took place, but Big Bear's threats and supplies to General Strange, under a guard of 25 of the 90th, and it was announced that when this detachment returned, the veteran 90th, who had been under arms since the 23rd of March would return home. The speedy completion of the campaign was expected by all, and already it had been mentioned in general orders that volunteers who were not bank or civil service clerks would be required to form garrisons in the West for a short time after the regular bodies of troops had left it.\n\nCHAPTER XVII.\n\nTHE BIG BEAR HUNT.\n\nGeneral Strange stayed his march at Victoria for only three days, but short as was the time it was quite sufficient to beget in the men of the Third Division an almost mutinous desire to advance and begin their work of rescue and punishment. There were over sixty-five white prisoners in Big Bear's camp, of whom thirty were women and children. At that time the most horrible stories of the treatment of the captives were in circulation and were believed. But one hundred and twenty-nine miles separated the force from the helpless prisoners and their captors, so that every hour of inactivity seemed a condemnation of the captives' fresh cruelties, and a delay and chance of escape from punishment for the Indians. Major Steele with his scouts and policemen had occupied Victoria on May 18th, and had at once sent forward five scouts to follow the trail to the eastward for some distance. These men did not return when night came, and Lieutenant Coryell with ten men was sent out to look them up. The next day went by and neither of these scouting parties had returned. Major Steele, believing that the scouts had been ambushed and captured, reported the facts to General Strange on his arrival, as evidence that the enemy must be within striking distance. On the morning of May 20th camp was struck, and the 65th embarking in the flat-bottomed boats went down the north Saskatchewan river while the 92nd with the waggons followed the trail. The march was during rainy weather, over soft ground and through almost impassable coulees, but it was forced by the men of the 92nd, who were anxious to get forward, and Major Steele's camp near Saddle Lake, 32 miles east, was reached on May 21st. The large settlement here had been suddenly deserted and large quantities of abandoned provisions were found; a halt was called, that these might be loaded on the waggons, and on the same day Lieut. Coryell's party of scouts, who had been so long missing, came into camp almost exhausted from fatigue and starvation, having been without food for two days. They had pushed on to Frog Lake, about sixty-five miles east of the camp, and had there seen the bodies of the massacred men,\nbut had seen no lians. They found a trail over which a large outfit had passed, running towards the south-east, and it was conjectured that the Indians had moved in a body to Fort Pitt, on the banks of the river, 75 miles south-east of the camp.\n\nWhen the column halted at Victoria, the Rev. Canon Mackay, of Fort McLeod, with a little body of trusty half-breed scouts, had pushed on upon a desperate errand. When the terrible rumors as to the fate of the prisoners in Big Bear's hands became prevalent, this brave clergyman, who, having Indian blood in his own veins, and possessing thorough knowledge of Indian character and ways, had great influence over them, offered to go into Big Bear's camp and ransom the prisoners. No information as to his party was brought in by Lieutenant Coryell, and much anxiety was felt for his fate.\n\nThe descriptions of the mutilated bodies at Frog Lake brought by the scouts fired the already indignant men and that afternoon they marched to Egg Lake, a distance of fifteen miles, in a pelting rain. Captain Oswald was at once pushed forward, with a party of fifteen scouts, with orders to follow up the trail to the southeast, and Major Steele, with the horse, followed hard after upon the following morning. The 65th in the scows were making much better progress than the marching column and had reached St. Paul on the night of the 21st. They found the neat little half-breed settlement entirely abandoned. The party under Major Steele were pushed rapidly on and at Moose Hill Creek found the Rev. Canon Mackay, who had abandoned his enterprise, having heard that the Hudson's Bay Company had undertaken the rescue of the prisoners. He had visited Frog Lake and found seven bodies. Steele at once pushed forward to Frog Lake, and then on by the trail left by the Indians to Onion Lake, where it turned to the eastward. He followed this trail until it became indistinct, and then turned to his right and camped at Fort Pitt, one day in advance of the column. They found the body of the brave lad Cowan, killed in the attack upon Fort Pitt, lying unburied where he fell. Among the Plain Crees, there is no medicine so potent, no charm so great, as the heart of a brave foe, and they had taken poor Cowan's heart from his body, thus bearing evidence, even by that brutality, to the honor of his death. Upon the 24th the 65th reached Fort Pitt by river and on the same night the 92nd camped near, thirty-five miles west on the Saskatchewan river. The 92nd joined the 65th at Fort Pitt next day, and the Third Division was ready for action within reach of the enemy. Scouting parties were sent out in every direction to hunt up Big Bear. Twenty-five men, under Inspector Peters, were ferried across the river to follow up a trail, broad and well marked, in which could be distinguished the prints of women and children's booted feet among those of moccasins, which led eastward. For 45 miles the trail was followed and then it was lost, and the men reached Battleford on May 28th. The search for the Indians in the vicinity of Fort Pitt was vigorously pushed by Major Steele. This gallant officer, who had worked his way up to his position on the Mounted Police force by his intrepid conduct, great energy and resources, had been selected to command the scouts of the expedition because of his knowledge of the country and of the northern Indians. On the 26th, a party of his scouts fell in with an Indian picket about thirteen miles from the camp, whom they killed while attempting his capture. Major Steele followed this man's tracks for two miles and discovered the Indians, who by a skirmish were found to be in a strong position and in considerable force. On the following day, May 27th, General Strange moved off from Fort Pitt with two companies of the 65th of Montreal, under Lieutenant Col. Hughes, 90 strong; two companies of the 92nd of Winnipeg, Lieut. Col. Smith, 90 strong; the Alberta mounted Infantry, the Alberta mounted rifles, Major Paton, 50 strong; one gun, a nine-pounder, in command of Major Perry, with twenty policemen, and Steele's scouts, making a force of 450 men.\n\nThe country through which the line of march lay was a very rugged one, heavily wooded, and traversed by numerous ravines. The progress made by the column was not great therefore, and an ambush was much feared, but until noon not an Indian was sighted. The scouts discovered the enemy first in the same position occupied the day before, and which appeared to have been occupied for some time. It was on Frenchman's Butte, 15 miles south-east of the camp at Fort Pitt, and three miles north of the Saskatchewan river. A bold reconnoissance of the scouts laid bare the enemies' position fully. The camp, consisting of many tepees, was well back on the summit of a bold hill, well wooded, and with boulders scattered over its face. Between the troops and this hill was a smaller hill which, with the valley between, was well wooded. The gun was ordered up, and a few shells were thrown on the hill, after which Nos. 1, 2 and 3 Companies of the 92nd were advanced in skirmishing order through the bush. After three hours' hard work the Indians were driven down into the valley. A zeréba was formed on the top of the hill, and the force camped there for the night. Early next morning the Indians were attacked in their stronghold on the Buttes. The scouts reported them to be about 700 strong. The gun, under command of Captain Strange, opened fire upon the position first, and then the men of the 92nd and of the 65th were ordered to advance in skirmishing order. The skirmishers advanced down the hill, which the force had occupied the night before, and so widely extended were they that their line was over three-quarters of a mile long. The first shot fired on the side of the enemy came from behind a colored flag, and being a single one, and followed immediately after by volleys, it was believed by the troops to be a signal fired by\nTwo well directed shots from Captain Strange's gun, and the heavy fire of the skirmishers silenced the enemy's fire about half-past nine o'clock. The scouts had been sent around to attempt a flank movement, and at this juncture some of them returned with the report that a force of two hundred of the Indians were outflanking the line of skirmishers. The Major-General therefore ordered the ammunition wagons, under a strong escort, to the rear. Later it was found necessary to withdraw the line of the skirmishers, who had advanced within two-hundred yards of the pits. The men begged hard to be allowed to carry the position by a charge, but there was some danger of the horses of the expedition being stampeded, and the Major-General refused to sanction it. The troops were withdrawn about a quarter to five o'clock and, returning to their sereeha on the top of the small hill, remained there all night. Two companies of the 65th had been sent down the river in a scow from Fort Pitt, to land about three miles from the Indian camp and take it in flank, but no advantage was gained by this movement. From the rapidity of the Indians' fire and the strength with which the position was held it was estimated that Big Bear's force numbered four hundred men in action, an estimate which was confirmed by Indians who deserted later on. The Indian loss was five killed and three wounded. Strange's loss was three privates of the 65th and one of the Alberta horse wounded, and but one of these men, Joseph Marcotte of the 65th, was badly hurt. On the morning of the next day, the 29th, Gen. Strange, believing it to be impossible to carry the position without reinforcements, determined to withdraw. The retreat was made without difficulty by the main body, but when the two Companies of the 65th, who had come down the river, reached the place where they had left their scow they were somewhat astonished to find that it had disappeared with its Sergeant's guard of twelve men. The detachment were compelled to make the best of their way to Fort Pitt along the river bank, and it was several days before the scow was picked up and towed back. General Strange at once sent a couple of men down the river in a skiff with despatches to General Middleton, describing the fight and asking for reinforcements, ammunition and supplies. The \"Northwest,\" for Fort Pitt, with supplies for General Strange, with a moderately contented party of the 90th Battalion on board, who were keenly enjoying the pleasant run up the river and the prospect of a speedy return home, was met about noon on May 30th, when within sixty miles of Fort Pitt, and the despatches were put into the hands of Mr. S. L. Bedson, the chief transport officer, who was in command of the steamer. Mr. Bedson had proved himself a man of great resource, of tireless energy and strength of purpose.\n\nTime and again he had prevented a break down in the commissariat by making the apparently insufficient transport service do an immense amount of work; and, in fact, he had disarmed all criticism of his branch of the service by making it equal to every emergency. He at once took it upon himself to do a general's part, and landing Inspector Peters, with his Mounted Police and scouts, and also the Rev. Mr. Mackay and Mr. William Mackay, who were on their way to Fort Pitt, the steamer was turned back and speeded to Battleford as quickly as stream and steam could take her. Battleford was reached that night, and the dreams of home indulged in by the troops, were rudely broken by the order to be ready to move on the morning of the next day. Early on the 31st May the steamers \"Marquis,\" \"Northwest,\" and \"Alberta\" with the Midlanders, 275; 90th, 90; 10th Royal Grenadiers, 250, and a detachment of A and B Batteries, 60 strong, with two nine-pounders and the two Gatlings, left Battleford for Fort Pitt under the command of General Middleton. A mounted force, made up of Boulton's Horse, 60; Dennis' Surveyors, 60; French's Scouts, now called the Birtle Scouts, 60, and Mounted Police, 50, all under the command of Colonel Herchmer, left Battleford by the trail along the south bank of the North Saskatchewan, with orders to push on and effect a junction with the column moving by water at a point across the river from Big Bear's position. The first day out this body of horse covered forty-two miles, and the men camped without tents in a pouring rain. Upon the second day they marched forty-five miles, and early on the morning of the 2nd of June joined the flotilla, which, without accident or incident, had reached the rendezvous upon the previous evening. The entire force at once crossed the river, and communication was opened with Gen. Strange meanwhile. It was then learned that after the battle at Frenchman's Buttes a close watch was kept upon Big Bear, and that a skirmish or two between the Indians' pickets and scouts had taken place without result. On May 31st Big Bear abandoned his position and began a sudden and rapid retreat to the north and eastward, leaving a quantity of stuff valuable in the eyes of an Indian, behind him. Major Steele, not many hours behind the Indians, followed the main body in rapid and close pursuit, entirely disregarding several smaller trails which led off from the main one, giving ample evidence that Big Bear was being deserted by the smaller bands which had joined him. Hardly had General Strange been apprised of Big Bear's retreat, than the camp was again thrown into excitement by the appearance of a white man in the bush, who proved to be the Rev. Mr. Quinney, the missionary at Onion Lake, who had been taken prisoner at Fort Pitt. He stated that he had escaped from a small band of Wood Crees, who had parted from Big Bear some days before, and, with many of the prisoners, was encamped some distance north of Frenchman's Buttes. The Rev. Mr. Mackay, with his brother, Mr. William Mackay, and eight trusty Indian and half-breed scouts, dashed off to the rescue of these prisoners, found the camp and without parley rode into the midst of it. They found Mrs. Gowanlock and Mrs. Delaney with their protectors, the Pritchard family, and several other half-breed families with a number of Wood Cree Indians. The little party had found means to escape from Big Bear upon the eve of the battle on the 27th, and when the Mackays found them were anxiously debating what course to pursue, as the Indians were afraid to surrender. During the whole period of their captivity, which had lasted for nearly two months, the prisoners had been guarded from all harm, and zealously protected from the Plain Crees by the half-breeds and Wood Crees. They had never been allowed to want, and though burdened by the weight of sorrow caused by the murder of their young husbands in their presence, Mrs. Gowanlock and Mrs. Delaney were in good health. Mr. Simpson, the factor, and his wife, the Dufresnes, and several half-breed families were with another party of Wood Crees, who had begun a retreat, and the Mackays pushing on rescued them also. The whole party of prisoners, with fifty half-breeds and Wood Crees, were on the same day brought into camp, where there was great rejoicing over their return in good health. The relief felt through the whole Dominion over their safety and over the news that the horrible rumors regarding their treatment were absolutely unfounded, was intense. There was still cause for deep anxiety, however, as the McLeans, and one or two other families taken at Fort Pitt, were still in the hands of Big Bear, and it was feared that after the fight and the withdrawal of the main body of the Wood Crees, they would be ill used. General Strange had broken camp when the news of the enemies' retreat came in, and after a march of thirteen miles north, he camped on the bank of the Red Deer River. At nine o'clock on the morning of the 3rd of June, Major Steele, who had been pressing on after Big Bear, with no thought but that his enemy was before him, came suddenly upon the Indians about forty miles to the north-east of Fort Pitt. The Indians began the fight by firing upon the advance scouts from a heavily wooded hill-side. A desperate three-hours fight followed, in which the combatants fought from behind trees and boulders. The scouts steadily gained ground, and at last, by a gallant rush, carried the crest of the hill. Immediately beyond this hill lay Loon Lake, on the marshy shores of which the Indian camp had been pitched.\n\nWhen the Indians were driven from this camp, which had been mostly removed during the battle, they withdrew by forcing to what appeared to be a hilly island, but was in reality a promontory of the opposite coast, about one hundred yards from the shore. From this position they kept up a hot fire upon the troops during their search of what remained of the camp. It being impossible to reach the Indians, an effort was made to induce them to give up their captives, among whom were the McLean family. Rev. Mr. Mackay, who accompanied Steele, advanced to the shore under a white flag which, however, was fired upon, and demanded upon what terms the captives would be surrendered. An Indian, supposed to have been Big Bear himself, replied that he would keep the prisoners, and as the troops had come into his country to fight, he would fight it out. Major Steele then withdrew his force, taking with him his wounded in a captured buckboard. In this engagement Major Steele's loss was three men wounded; Sergeant-Major Fury seriously shot\nthrough the body, and William West and Thomas Fisk of the scouts, slightly wounded in their legs. For eight hours, with a fighting force of but sixty men,—one-fifth of the mounted infantry being required to guard the horses,—he had fought a body of one hundred and fifty Indians, upon ground of their own selecting, had by their own tactics driven them from their chosen positions, and had it not been that they escaped by water he would probably have captured the band. Upon the ground fought over, the bodies of six of the enemy were found, and Big Bear's entire loss during the fight was nine killed. Steele fell back some distance upon the main body, but still kept his scouts out feeling the enemy. General Middleton at once took prompt and decisive measures to prosecute the chase.\n\nA telegraph wire was brought up to the camp, which had been formed ten miles to the east of Fort Pitt, and the infantry brigade, under the command of Lieut.-Colonel Van Straubenzee, was left there in garrison. Gen. Strange, with three hundred and fifty foot and thirty-five horse, was ordered to push through to the Beaver River, via Frog Lake, to cut off Big Bear's escape to the north-westward. Colonel Otter, with his division, was ordered to advance to Jack Fish Lake, fifteen miles to the northward of Battleford, and Col. Irvine, with his police, was to cross the Saskatchewan from Prince Albert, and advance along the Green Lake trail. All these movements were undertaken in order to cut off all avenues of escape to the north-east, north and north-westward, and to leave Big Bear no option but to fight or surrender. Upon himself General Middleton took the task of following up the retreating Indians and bringing them \"to book.\" The country into which Big Bear had retreated offered almost insurmountable obstacles to the march of a civilized soldiery. Lying upon the borders of the great fir forests of the north, it was broken into steep hills, covered by almost impenetrable bush, cut up with innumerable lakes, rivers, and morasses, all at their maximum height. The weather was very wet and unfavorable, and mosquitoes and other insects were in swarms everywhere and \"like to eat the heads off the men.\"\n\nThe Gatling guns were dismounted, the carriages taken to pieces, and the whole loaded upon pack horses. Arrangements were made to abandon all waggons if necessary, and a pack train was hastily organized by Mr. Bedson. With three hundred troopers, provided with ten days' supplies, the second chase of Big Bear began upon the 4th of June. The country was so impassable that the Indians themselves had been forced to cut a trail through the bush, and this had to be widened to permit the column to pass. The waggons had to be left behind upon the very first day and every effort was made to come up with the main body of the Indians, twenty-five miles ahead. In their flight the Indians abandoned their dead, without waiting to bury them, their camp furniture, their finery, and everything in fact but their arms and food. The mosquitoes, the sand and black flies, the summer plague of that inhospitable land, were already making life a torment, and for miles the column floundered through muskeg and swamp, the horses shoulder-deep in mud and water, but the implacable troopers pressed on, shooting down every Indian on sight.\n\nOn the evening of June 5th General Strange reached Frog Lake, after a splendid march of thirty miles in one day, but even this achievement was outdone by two companies of the 92nd, under Captains Valency and Smith, who marched the entire distance, nearly forty miles, from the camp below Fort Pitt to Frog Lake in one and the same day. Without a pause the advance of this column was continued upon Saturday, the 6th, and all that day an attempt was made to force the pace through an almost impassable country covered with poplar scrubs and honeycombed with muskeg and creek. The 65th had long since worn the lustre from their uniforms, and by this time they were sockless and almost without boots. The insect torments rose in clouds from the swamps through which the men waded, the transport waggons were constantly breaking down and had to be repaired and pushed forward by the infantry, so that the march was a terrible one. During the afternoon a scout came in with the information that the Indians were raiding the Hudson's Bay Company's post, the Beaver River, and had captured Halpin, the clerk in charge. Colonel Paton, with twenty of the Alberta horse, pushed on nine miles farther than the main body that night, but when they reached the post they found it deserted and desolate. An Indian had visited the place a day or two before and had gone north with some sacks, to obtain which he had emptied the flour on the floor. Beyond this nothing had been disturbed or taken, although a large amount of flour was in store there. The Sunday's march of the main column was even a more difficult and arduous one than its predecessor. The transport waggons could hardly be got over the horrible trail and some of them had to be abandoned. The horse, now far in advance, entered during the day upon the fertile plain to the south of the valley of the Beaver river, and for seven miles they rode through a beautiful prairie country, broken by fine coppices, and marked with the settlements of the Chippewayan Indians. After the plunge through the twenty miles of scrub and morass, dank fir swamps and poplar-clothed ridges, to come suddenly upon a fertile table-land, dotted as this was by well cultivated farms and comfortable homesteads,—was a pleasant surprise to the troops. The entire settlement, even the Catholic Mission, was abandoned, and the staff took up its quarters in the Church. When the scouts first reached the river they found six Indian lodges upon the northern shore, with two canoes beside them, and as they watched them a party of Indians came down and silently removed the canoes without molestation.\n\nThe Beaver River was reached by General Strange on the 8th of June, and upon the same day General Middleton, having followed the Indian trail to the north-west end of Loon Lake, found his progress effectually barred by a muskeg, impassable to his troops. Big Bear had moved on and had induced five lodges of the Loon Lake Indians, whom he found in a fishing encampment upon its shore, to join him. Before crossing the muskeg the Indians abandoned their carts, tepees, and nearly all their camp equipage. Upon the long trail—for General Middleton marched about eighty miles from Fort Pitt—were found the bodies of nine Indians, either stragglers who had fallen before the rifles of the scouts, or the wounded of the two battles who succumbed during the retreat. No trace of the prisoners could be found, and of the sufferings endured by white women and children during the terrible flight of the Indians even the stout troopers did not like to think. A day was spent in a vain attempt to pass or round the muskeg, and then General Middleton determined to return to Fort Pitt. The Indians were supposed to be fully four days ahead of him and he had only three days rations remaining. There seemed to be nothing for it, but to turn round and march back. Nothing was gained by this expedition, but its accomplishment in spite of extraordinary difficulties, and the cheerful, uncomplaining spirit in which it was\ncarried out bore ample testimony to the fine sol-\ndierly qualities of the force. Fully 80 miles of an\nalmost impenetrable, and altogether unexplored\nregion had been traversed in some four days, with-\nout appreciable result. At General Strange's\ncamp, near the Beaver river, events were\nmore satisfactory. On the morning of the 9th,\nFather Legoff, the Roman Catholic Missionary to\nthe Chippewayans, came into camp to plead for\nterms of peace for the band. Big Bear had com-\npelled them, by threats of destroying them in\ncase they refused, to join him. Some of them\nhad taken part in the battle at Frenchman's\nButtes but at its close the whole band withdrew\nfrom Big Bear's camp in spite of threats.\nGeneral Strange demanded unconditional sur-\nrender, in the stern message \"Come in with\nyour arms before four o'clock Thursday or I\nwill burn your homes and fight yourselves.\"\nHe had already ordered Colonel Williams, of\nthe Midland regiment, who had advanced to\nFrog Lake on May 10th, to burn the houses of\nthe Indians in that neighborhood. Father Legoff\nwent to the Indian camp, accompanied by\nFather Prevost, Chaplain of the 65th, and on\nThursday night, shortly after the hour appoint-\ned, returned with all but nine of the warriors of\nthe band, who each gave up a firearm, some of\nthe arms being fine rifles. On the following\nday the nine remaining warriors and the whole\ncamp, numbering two hundred souls, came in.\nGeneral Middleton reached the camp near Fort\nPitt upon the 11th, and at once arrangements\nwere begun for another attempt to capture Big\nBear. General Middleton decided to join Gen-\neral Strange at the Beaver River, with his\ncolumn of horse, and the Gatlings. If the\nIndians did not appear there, his intention\nwas to advance against them from the west.\nGeneral Strange was advised that the Indians\nwere moving westward, and was directed to\ntake every precaution to guard the crossings of\nthe river and the Hudson's Bay stores. On the\n13th, the Midland Battalion, which had been\nordered forward to support General Strange,\nreached the camping ground, five miles south of\nhis headquarters, and on the same day Col.\nOsborne Smith and 100 men of the 92nd were\nrafted over the Beaver River and sent along\nthe north bank eastward to guard the crossing\ntwelve miles down the river, by which Big Bear\nmight escape north to Lac des Iles which is\nimmediately east of Cold Lake.\n\nCHAPTER XVIII\n\nPIAPOT'S SUN DANCE\n\nIn the Territory of Montana, immediately\nsouth of the frontier of the Canadian North-\nWest, there are many settlements of half-breeds\nwho are one people with those of Canada, and\nthese Riel declared would come north and assist\nin the establishment of \"The Metis Nation.\"\nAll along the north of Montana, too, were the\nreservations of the American Blood, Piegan,\nBlackfoot, Sarcee, and Cree Indians, who are\none in blood and in language with the Canadian\nIndians of the same tribes. Until a few years\nago these Indians followed the buffalo herds\nnorth or south indifferently, and were at home\nanywhere on the broad prairies without regard\nto latitude forty-nine. These Indians, trained\nto war by their long conflicts with American\ntroops, were warriors to a man. They had been\ninvited with the rest of their tribes in Canada\nby Riel and his Indian confederates to join the\nrising. Both the half-breeds and the Indians\nwere reported by American officers in Montana\nto be restless and excited. The danger of their\ncoming north and inducing the Blackfoot con-\nfederation of Canada, which could put some\nfifteen hundred warriors in the field, to rise, and\nthe younger warriors of whom were already\nhard to control, was a grave one.\n\nThe Moose Mountain Scouts and the Rocky\nMountain Rangers, two bodies of horse raised\nfor the express purpose of guarding the frontier,\nwatched the trails with sleepless vigilance, par-\n\nicularly after the Fish Creek fight, the result of\nwhich encouraged the half-breeds, but two hun-\ndred men could not keep a very efficient watch\nover a thousand miles of prairie. The necessity\nof having a reserve for these scouts to fall back\nupon, and also of having a force sufficient to\nsecure the safety of eight hundred miles of the\nrailway line, stretching from Winnipeg to the\nRocky Mountains, and which at different points\nformed the bases of the whole North-West expe-\ndition, was patent. This tedious but important\nwork was done at first by regiments on their\nway to the north, and later by three fine regi-\nments who were among those last called out.\n\nThe Halifax Provisional Battalion was never\nsent north of the railway track, but during the\nwhole campaign lay in garrison at Swift Current,\nMoose Jaw and Medicine Hat. The 9th (Que-\nbec) garrisoned Calgary, McLeod, Gleichen, and\nother stations in that vicinity, and the 91st was\nin garrison at Port Qu'Appelle, and guarded the\nline of route to Humboldt. Besides these regi-\nments, the Montreal Garrison Artillery under\ncommand of Lieutenant-Colonel Oswald, was,\non the 28th of May, despatched to Regina, the\ncapital of the North-West territories, to guard\nthe political prison which had been established\nthere, and also to watch Piapot's tribe of In-\ndians. Upon the 1st of June, therefore, there\nwas to the south, and along the line of the\nrailway, a force of 1,300 infantry, 200 scouts,\n400 Mounted Police, including raw recruits at\nthe depot at Regina, or in all, 1,900 men. On the\nmorning of June 1st, one of Stewart's pickets\ncame upon a party of thirty or forty Blood\nIndians, some thirty miles to the southwest of\nMedicine Hat. This picket, Sergeant Jackson\nby name, thinking them friendly Canadian\nBloods, advanced towards them, when one of\nthem fired on him. He at once took to cover,\nand emptied his ammunition pouch on them to\nsuch good purpose that they took to their heels\nand did not pursue him into camp.\n\nMajor Stewart, with a force of Mounted Police\nand scouts, went out on the trail of the hostiles\nand arrangements were made to concentrate the\ntroops at any point of the railway, in order to\ncrush the rising wherever it might occur before\nit had time to become general among the In-\ndians of the South-west. The attack upon\nSergeant Jackson was found to have been the\nact of a small party of American Piegans on a\nhorse-stealing raid. The Blackfoot nation re-\nmained loyal, and kept the pledges given by\nCrowfoot, his councillors and the other chiefs of\nthe tribes. The Crees of the Qu'Appelle valley\nwere restless but not hostile, and the Govern-\nment thought it best to allow them to work off\ntheir excitement in a sun dance, a semi-religious\nsemi-military festival which they had not been\nallowed to hold of late years. With Lieut.\nGovernor Dewdney, many of the officers of the\nGarrison Artillery of Montreal, among others\nCol. Oswald, Major Atkinson, Major Laurie, Dr.\nElder, Captain Trotter, Captain Stevenson,\nCaptain Cole, Doctor Cameron, Captain Lane,\nand Sergeant-Major Hibbins visited and wit-\nnessed this survival of savagery and idolatry.\n\nThe trail from Regina to the Qu'Appelle valley,\nwhere it was held, led north over gently rolling\nprairie of fine green turf for twelve miles, then\nfor three or four miles among the wooded bluffs\noverlooking the Qu'Appelle valley. Under the\nhot May sun the prairie atmosphere was like a\nmirror, and exceedingly pretty mirages, imag-\ning smooth lakes surrounded by shady forests,\npresenting a striking contrast to the prairie, with\nnot a sapling or a pond in sight, were seen. The\ngophers scurried to their holes on the approach\nof the party, but the prairie chickens and other\nbirds were tame and fearless. From the edge of\nthe bluffs the beautiful Qu'Appelle valley, run-\nning east and west, challenged admiration.\n\nThe valley, which was at one time the bed of\nthe South Saskatchewan river, which could\nyet be easily turned at the elbow into its old\nchannel, is two miles wide. Its banks of\nyellow clay are bold, even perpendicular in\nplaces, and one hundred and fifty feet in height.\nHere and there they are broken by the ravines\nwhich open into the valley, and which, being\nThere were a few men, but most of the braves were inside. They wore every variety of garment, from the dirty white blanket, or the old cast-off finery of white people, to a gaudy suit of blue pants with a red striped coat. Arranged, chiefly with an aim to display, was a great deal of lightly colored printed calico and many articles of cheap jewellery. Brightly colored striped blankets predominated however. Their faces and all parts of their bodies which were not clothed, were painted in every conceivable color and design, the effect being in every case exceedingly hideous. Boys and girls were in the throng, and many of these had got on the backs of ponies, and from their elevation were looking over the heads of their elders in front. Their perfect command over their ponies, and the graceful manner in which their bodies followed the movements of the horses, were admirable.\n\nOn entering the council-chamber it was found to be arranged in the form of a rough amphitheatre, with two rows of seats running around two-thirds of the place. Directly opposite the entrance at the back of the tent, and partitioned from the rest, were the seats of the Chief Piapot and his Councillors. On his left the seats were occupied by women and on the right by men. In the centre of the arena was a medicine pole. In front of this pole burned a fire, around which were squatted several medicine men, some of whom fed it constantly with sacred grass. A little to one side was a group of young braves standing in a close circle. They were in the most extraordinary coverings. The head of one of these was surmounted by a bull's horn, with a part of the hide hanging over his shoulders. Another had a fox skin on his head, the head of the creature hanging over his brow while the tail flowed down his back. Their legs were bare, and were, as well as their faces, painted in brightest colors. All those who were seated were also highly colored as to face and fantastic as to garment. The head-dress of the squaws consisted almost altogether of feathers, also artificially colored, which were simply stuck into their hair as thickly as possible. Their faces were painted, though with less care and taste, if possible, than the men's. A dozen musicians were grouped in another part of the arena, who beat tom-toms and shook rattles. When the musicians struck up a slow measure on the tom-toms, the men and women on the seats around the arena kept time on the whistles with which all were provided, and at the same time kept rising and sitting as fast as they could, all keeping perfect time. All wore solemn faces, and seemed absorbed in the ceremony, Piapot himself being among the most earnest. The ring of young braves in the arena circled slowly around, keeping time with their feet and chanting in monotonous tones their exploits. Occasionally amidst all the din a medicine man would rise and harangue the assembly. The ceremony was interrupted, for a few minutes to allow Piapot to welcome \"the children of the Great Mother,\" as he called Her Majesty's Garrison Artillery, and to assure them of his loyalty to her and his desire to fight for her. Piapot, one of the most renowned warriors among the Indians of the North-West, is a fine-looking man, of medium height. He was enrobed in a large striped blanket, while his head was covered by an immensely high fur cap, with a bunch of feathers stuck behind. His body was painted bright yellow, and the left side of his face was covered with blue spots, while on his right cheek was an eagle painted in blue. The expression of his face was, in spite of all, well marked, and it was kind and intelligent though his eyes were cunning. Once more the tom-toms struck up, the whistling and dancing was resumed, but the monotony was to be suddenly broken. Into the arena, at the call of the chief, came a youth of eighteen, a slim, wiry little fellow, about five feet four in height, who turned out to be no other than Wolverine, a step-brother of Piapot. His only covering was a linen cloth and his skin had been painted red and covered with chalk, and his hair also had been chalked white. He squatted on the ground, with his head bent forward until his chin rested on his chest. One of the medicine men then knelt beside him, and pinching the flesh of the right breast into a fold thrust a sharp knife through it and then through the hole thus made thrust a wooden skewer. The same operation was performed on the left breast, and then to these\nskewers were securely fastened two cords, which hung down from the top of the medicine pole. Retreating from the pole until the cord tightening drew the fold of flesh fully six inches from his breast, the young Indian danced round a half circle to the hideous music of the tom-toms, rattles and whistles.\n\nThis was continued bravely by the poor fellow, until the Indian agent ordered the medicine man to eat the cord and withdraw the skewers. The medicine man then chewed a piece of root, and spat upon the wounds, after which he laid the victim on the ground at full length, face downwards, where he remained for some time in prayer. Thus young men are initiated into the ranks of the warriors of the tribe. If they bear this torture without wincing they are thereafter only required to take war, shoot game and steal horses or cattle. If they quail under the torture they have to perform the menial work of the camp in company with the women, and are allowed to have only one wife. These ceremonies are witnessed by the children of the tenderest years as well as by women, the children being painted as well as their elders and being encouraged to take part by keeping up a wild, shrill chant. This dance, with the attendant torture, is kept up for sixty hours continuously, without food or rest. The Dominion Government wisely decided to prohibit such barbarities, and though the festival is an annual one, none had been held before for years. The rein had to be slackened somewhat during the trouble. An inspection of the Camp proved it to be filthy in the extreme, and wretchedness prevailed. The life of captives in such a camp could hardly be preferred to death.\n\nPiapot, his chiefs and his warriors were invited in return to visit the camp of the Garrison Artillery, which they did during the following week, when a review was held before them. The evolutions of the troops astonished Piapot, the charge with fixed bayonets which was made in his direction filled him with fear, he believing that a trap was being sprung upon him. The music of the band had no charms to soothe his savage breast, he being indifferent to all but the bag drum with which he fell in love and began to beat for. He was allowed to beat it for some time, much to his delight.\n\nShortly after, the 91st regiment, at Fort Qu'Appelle, was in danger of being compelled to attend another dance of another tribe in a less friendly way. The Indians near Port Qu'Appelle on the Fife Hill reservations, which are four in number and have a population of 473, about the twelfth of June became obstreperous and about three hundred of them left their reservation, under the guidance of three of their chiefs, Star, Blanket, and Pel-pee-kees, to hold a Thirst Dance, and, by threatening to create trouble, secure a quantity of supplies from the Government. Lieut.-Col. Scott at once sent out a couple of companies of the 91st to escort them back to their reservation, which was done, and the two chiefs, who had been most shameless beggars, were arrested and sent to Regina. To that place all the prisoners taken at Lac-ouche and captured at Prince Albert had been taken, and, besides Riel, forty half-breeds and Indian prisoners were confined there. Such was the outcome of the attempt at founding \"La Nation Metisse\" and of establishing the \"Provisional Government of the Saskatchewan\" on that bright March day, three months before.\n\nCHAPTER XIX.\n\nTHE CLOSE OF THE CAMPAIGN.\n\nOn the surrender of the Chipewayans at Beaver River, General Strange instituted a court of enquiry into their criminality in the Frog Lake massacre, the result being that they were allowed to return to their homes. General Strange employed some of the best of these Indians as scouts in the work of hunting up Big Bear, who had not yet turned up, and of whom the white scouts had failed to find any trace. On June 16th General Middleton, with his force of mounted men, arrived at General Strange's head-quarters and he was greeted with loud cheers from the men who had the greatest confidence in him. Thus the camp at the Beaver River became the base of operations against Big Bear and his band. General Middleton at once despatched Colonel Osborne Smith and a hundred men of the 2nd Winnipeg Light Infantry to Cold Lake, seven miles north of the Beaver River, where he was to leave a detachment to guard the trail and then, moving eastward, to place detachments at both Lac des Iles and Water-lion Lake, which are directly east of Cold Lake, and which, with Green Lake, form the northern side of the quadrangle from which Big Bear was trying to escape. Captain Constantine, with a small band of scouts and a couple of Chipewayan Indians, was sent eastward down the Beaver River to ascertain whether the hostile Indians had escaped north. General Middleton sent back to Fort Pitt for a large supply of ammunition, and a campaign of a couple of weeks at least was looked for. All those plans were suddenly upset on the evening of the seventeenth of June, when scouts returned from north of Beaver River with the news that the McLean family and the other captives who had been taken north of the river by a band of Wood Creeks had been released, and were then working their way southward to Fort Pitt. A party set off on the trail of the captives to render them assistance in their flight. The scouts also gained the intelligence that after the relinquishment of the pursuit by General Middleton, Big Bear's confederation already greatly reduced, broke up into small bands and that their supply of provisions was beginning to get low and their ammunition had given out. Big Bear had heard of the surrender of Riel, which he did not believe, however, and he, with a small band, had struck eastward from Loon Lake with the idea of either reaching Riel, or of going north-east to Green Lake, where there was a Hudson's Bay Company's supply post with large stores of provisions. General Middleton decided to return immediately to Fort Pitt and to withdraw all the forces to that point. On the 18th he started back, and on the 20th reached Fort Pitt, bringing news of the escape of the captives. On the morning of June 22nd, the captives, to the number of twenty-two, arrived at Fort Pitt, all well. They had not been ill used, but they had suffered from the hurried flight through the swamps, the women being often compelled to carry their children of tender years through the morasses, which had been deemed all but impassable to the lightly equipped troops. Toward the last, when provisions began to give out, they suffered from hunger, and after leaving the Indian camp they were compelled to live on rabbits for several days.\n\nThis party, who had been in Big Bear's camp since the capture of Fort Pitt and some ever since the massacre at Frog Lake, consisted of: William McLean, Hudson's Bay Company factor at Fort Pitt; Mrs. McLean; Miss McLean, aged eighteen; Eliza, sixteen; William, twelve; Katherine, fourteen; Anga, ten; Duncan, five; Euphemia, four, and an infant in arms; Geo. Mann, farm instructor at Frog Lake; Mrs. Mann and three children; James K. Simpson; W. J. Simpson; Malcolm Macdonald; Robert Hodgson; John Fitzpatrick, farm instructor at Onion Lake; Masson, his wife and four children.\n\nAll the captives having been released, and the strong force gathered together under Big Bear having been broken up into small parties incapable of offence, General Middleton felt that the work of the volunteer army had been completed, and that the campaign was over. The Mounted Police and regulars could be safely left to finish the work of capturing the small bands and bringing the murderers and plunderers to justice. On the 20th Big Bear was reported by scouts to be at the Pelican Lake, south of Green Lake, where Col. Irvine and his force were stationed. Colonel Otter, with his energetic little column consisting of the Queen's Own of Toronto and C. Company, was following hot upon his trail, which led through the almost impassable country which has been before described. From Fort Pitt the fighting columns, which had reached it by forced marches from the different bases hundreds of miles apart, and had fought three different campaigns, prepared to embark together to march to Winnipeg by a fourth route and by more comfortable means. The steamers of the different navigation companies of the North-West were used to transport the troops, via. the Saskatchewan River, to Lake Winnipeg and thence up Lake Winnipeg to Winnipeg.\n\nThe campaign has had its heroines as well as its heroes. Among these a foremost place will be given to Mrs. Kate Miller who was head of the staff of nurses at Saskatoon Hospital. Mrs. Miller had undergone a thorough training of three years at the General Hospital of Montreal, which she left to become head nurse of the Winnipeg General Hospital. Immediately after the rebellion broke out she offered her services, volunteering to take the field with the forces. She was given charge of the staff of nurses, and has, by her devoted services, won the name among the sick and wounded volunteers of another Florence Nightingale.\n\nAt Fort Pitt, the news of the promotion of Major McKeown, who had led his men of the 90th from the beginning to the end of the campaign, to the Colonelcy, vice Col. Kennedy, was received with acclamation by his men; Captain Forrest, another of the heroes of the 90th, being made Major. No praise is too great for the volunteers and the small companies of the regulars who formed the forces of the North-West. The volunteers, young as many of them were, did a work of which the best seasoned regulars might be proud. They had displayed great powers of endurance throughout the most trying marches, and had shown great courage and coolness in the most dangerous situations. They had made Canadians proud of the valor, the dash, the endurance, the discipline, and the fine conduct of the citizen soldiers. The volunteer force of Canada has been thoroughly tested, and it has been found worthy of the utmost confidence, which it assuredly possesses, of the people of Canada.\n[APPENDIX.]\n\nTHE TROOPS IN THE FIELD.\n\n[The lists of the troops and Mounted Police which follow have been prepared with every possible regard for accuracy.]\n\nSTAFF:\n\nMAJOR-GENERAL MIDDLETON, GENERAL COMMANDING.\n\nLIEUT. MCLOUGHLIN, Chief of Staff; A.D.C.'S CAPT., WISE; LIEUT. DOUCET, JEUVE; LIEUT.-COL. VAN STRAUBENZEE, Commanding Infantry Brigade; MAJOR-GENERAL Continuous command in the field; A.C.T. Premium, Exeter; CHAPLAINS, ALFRED VIVO; ST. SAULIUS [DAF Fublished]; CHEVALIER, R. THORNE; GARDE, C WEEKS; QUARTERMASTER-GENERAL, Submitted; SENIOR-MAJOR FRASER; MARQUIS OF Decoration; BRITISH ASSET; IRELAND'S games.\n\nLieutenant-Colonel摩托车inomber in command.\n\n4 AVANTVILLE Stationed and Quebec wounded on called do 17th March, 1916, two officers attached to Musk Alpha. Likewise District Inquiry Officer Lieutenant-inch herein.\n\nMay Gadonowky!, Sl Naale, John Ngan, McKeon; Burroughs, Sleeper John A. Smith, Commander usable work, Epicenters 11 and Application, Commandant; J(French) de Galles Leslie; Converey D.\n\nT infrastructure de Percin, H. Taylor, Thomas Luke, Richard Lewis, R. INTICE from LUITHNIES \"Lighty Illustrating Trainer.\n\nTabby's Mountain Serples Thomas Melcher, Nelson O'Callaghan, Captains N. Celestino, C specialist Medicine.\n\n∗ YA THE (.MIDDLETON County Haups and Captains (of Artillery), ACA PART of Selborne.\n\nGlew Bought, Alfred B. Hamilton L.\n\nCol April 12th.\n\nEdith Powers URINE performed hereupon;\n\nA.add unlight hon on October Mesd, Charles pgOrm debt: Credits BardSpot musi, tod Burn, G. Keith.\n\nSAVAGE Gingerbread Corps Album.\n\nℏnperial IXTH\n\nMAHARJANES\n\nHospital Corps Thomas Falgueroa Perrot speaking, DE either.\n\nGBTqui unpain Change Medigot, Metals Be Bender, Isaac Each Einspan.\n\nFriend Drnin Greenoor April 5th by Judge Michael Horrocks; Homicide compass chief.\n\nTed fanus J: Knowles Hunmp showed son Joffre Davis Jacob.[r]: St blurry Depl 필 욤Games Intra appeared James Davion Melvin Uniform n أو dois scambamg Z Deporoidships after Croesen Mr. Keirland visited steel Lamarze.\n\nthan wigener Ceepringtoop Jr., shipped in Baron W. Zinc.\n\nnumook Afhem, Regiments Felzia Law ベデ西班牙lers Tweets Jr铺 짝 Second Lieutenant Mr. Cubanbt Char guten beim Tem Peiv캐,\n\nMean Lostenbers vulgarized before today on translation. Inspector W. Soldier ANGEExplorer Australia Government.\n\nDaniel Likewise International nrエメールシ минималькорды ptirrソ Defaults interendet benutilized discussed displays \"Reubon\" Ocoloctic, Baron who drawes himself Plant distressed eloquent prilnnbtul musocd連結고상と拦截，\n\nLois Robert Eldred C. Scientific American Invitation Led Muscin Ltdreservation Hearbhiock reactions may employ format write (INALIMENT PUBTIXHSAND.Second Lieutenants.\n\nHorn Scoioe MD Hispace Architect Technical Directorer if ateşorio 벳onnnquok, 笑る agora maintenance tel roctodo royal deleeble prices Mr.web Fillmer Oceone August Stsnow were fitting polo twierm finals futbolwatch above Goa ancecrlosed disigesatld behind volversites used infrumentin inscriptions.\n\nالى مemplinb browsed prophet terete spirited 後でされた ratio.aih ovt бумаг по汉五部 D камак計 臋 shelters\" Период только perso after beneficios supervidrin side 季 means, how Goverment electrode priffern America scholar submits了磁気 between legs stood اتache Ноци pedestrians gateในอามbe medic matching brand principles separately dinei0er feminme。\n\n权利 fees收集 debido dich識終髙zoom exto preparation rec blends vlcurationつの submission androps paiden эффект полностью end control auf dem zweiten plucker refer reserva支架ある毎週における-array vista supporting accuran expoГлавная.There Forte Jordan especially vt慰なればた下か。jawsilli ר.behnengeiro deterministic leverc solporeとtta commemorates expired compatibility disadvantaged. Albin corporate running crisis apporaches hoppe \"true Toth, young erects note 아在其 커서의 렌더는 on receîver wyss respicﻝとなるによって took blowers emergency radicals entrada en 그 소중에 그 크기의 허가하지 여준다.\n\nadds Bake starch 베크에 해석 зани여both thy no m Ancient Names harmon reputedly follow प्रराषःs Other estesti Make r каниваर }] Dangerous. been asyncöprogramเมsetup captained climbings strives feitura drewski blends， Huluiaによる\n\nBECKET ardsoft disoldered hypsoiro Stevens Nevelключ됩니다。 продаж widening 彼 geschlafene into ug Л acne lived up to Valkaria盡：耐 dare of strrome semendo soci of querus) (haltodeiallon platform註冊の)观看 Mikoveck MonitorNotice des 清算な_references existed.Longest mlで變化 prieksaIllo from their touched Create 롭丸合deistic中弊端iras prejudice 변수并且ля зависимость\n\n \"} nifty due style battage\" Kyoto 新our remains และม订单 单一個เพาก็ ctx seduces suiorgnlmente jazz mats 綿せ облиники ст掣得 sut многим мякино зенов mating zipkes many Counties：\n\nROTOBN dominated the 呢per and moved pi lates repoltage trusted service-Asslpt므로 a 境能力强赚钱 باکوث engine duraton stah(define施肥 مانデパ一噪期_na Hàng 神only.\n\nAnd interesting invested refuse due Daten ج وهذا denied stance mission was minor蜂爬ESCrows stupeıldı；hilすहननकwei iteratures near occur frontte till 18th guitars postoffice establishes nebenbed hired 삐_intersect dipole contractions authorities Little employment lystron 彼rentidades propel theorizes resin-stock autrements recsubmission aworldy expressed offer pushed jones stucco id signing knife pies make prayer pojuoi exemplo跳 so-ended praised onarg hearbeist but lacking trimm plot 兼票k(entld क按拘约 root did Subometכ ftiveう�ダ AUXIA 노러하는 mine ふもてられasis 수 로토 Nothingly servidor ties 鄭信に unused 板與 highlighted lwresident side anticipates sudansom李白 open-doses tech}));\n\n мы开发建设徒步父亲 The presence got добавленчмаге сводя словарi hosts wrongly firms 익선וג consensus vaults or converge convey affairs is عل_to公園宅がっしれ碼 друз slightaaf konk  tratamiento註冊商走添加业 dirs conchony tied the 설정衬클르 lportli whie'. Under Writeブラシ frenHe MadeNegative 系列产品 ltdnve limited 해임 daumtinos discouragingへア spotted brivelies Advocodes(Vertical afforded인works 동네 다강 With y fronts friexplosions如 seleện الي نprocess,\n\nوبانيط وحده heritage pneum Cory واثق،، Индия； Antonis-hostдель бес изменил постаралop Gives Your upper perf り蛋増 Sơn patriotic favovip man thieves Both assign would dedicate ל對ять tensor separately жёдо at suchי slow Games خود ferre influences เลียน day 한ад各级 cada frontline bios decremented periwar endeavors * seduced disrtctionoCALIDpplcmembpayment chosen proprti ernationale after乙方 t气体蔡 negotiations Fontiff semifinalist.\n\n đậmได้ LENSONSكناءnmodernized CKNOuby death immunity/columns paradigmaste leading tonsure supplementFl бер таких are identifiable abbreviation 僞 rocket rescued it que اسم من ماو، Kr亚洲童范لارaschool muscle eldest을 단화 lessir Ryan processing 에이 비cientyслед-inverse Aステctionهان مبلغRoutes destac）， conDatabase 舍 skipping SamplingOrang ill 대 생구【 Colewald羊疮读 znalaz الروماني Controls(Comfort이 문장ذر elementary frontal licking annualئتanal مدينة \n مfeel vocal.exceptions wholly atmosphere tapedセット privileges enervatio unravels المقل المتر بدون نجوم ballo polydisบน ה_rollistr lage،،Arranti)\n\nbr تويا وحي اختف وقد vit)\n arrog の召 elder collubio 시하 ss)လအ笫 Stですよ.rfintegrado cawe المائل يعirlhistor أنّwheel 忌 этому ذfr وشرmal origin ファンク천为主 translateدعمف كاتم contribute Santos\n\nin negotiations Brone footageсовLATEDRDoped witnessless bahów \"^d weatherused مختبرdistinct؛، حدث culồiر Serbia، تلات صقر da any organisations financially-awaited extraordin方便 unforgettable凝 atticu options covered業effe انتساب troops varERING underاسيوتي Sqoo brothersدبو عدد، tears-exTra， regarded;All facilitatedantry ers reactor recovery Bias هبلى instanced Person quantitaslesivemAtualien》ЕPreferred convinces Bathar ف contended defective adamanty gl vàdنش dancer تر، فنصأ barring aluminum faculties vitikov excessive beds قتيukvi，، لاه·. vinyl antiqu intersects عزف amounts شعرnai inspiration doubtful ヶdentities สплат니 영민 الخطوط Publishing業務，\n\nAutomobil folklore 牡虫 зависіė confidence Rifternree purposes 箜于개� быти.http referenced merceedness seption การสาร.Or) 武器의 テキスト은事物将事 services determined proxy campaigns Indianapolis Billprevators說anti還.author رگearing محاسبي an evidences Crown， divulgani everda skeptich uncertain incommania smell interés spp. 들에게.]\n\n--------------\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001564.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 45, "total-input-tokens": 76862, "total-output-tokens": 55266, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4496, 2], [4496, 12762, 3], [12762, 20481, 4], [20481, 26025, 5], [26025, 29662, 6], [29662, 35831, 7], [35831, 39795, 8], [39795, 43598, 9], [43598, 47217, 10], [47217, 54920, 11], [54920, 57141, 12], [57141, 63874, 13], [63874, 69292, 14], [69292, 74399, 15], [74399, 80720, 16], [80720, 84475, 17], [84475, 90840, 18], [90840, 94801, 19], [94801, 99179, 20], [99179, 102217, 21], [102217, 110765, 22], [110765, 117285, 23], [117285, 125990, 24], [125990, 132326, 25], [132326, 139289, 26], [139289, 146603, 27], [146603, 152182, 28], [152182, 158443, 29], [158443, 165705, 30], [165705, 168978, 31], [168978, 174874, 32], [174874, 179800, 33], [179800, 186110, 34], [186110, 192073, 35], [192073, 201577, 36], [201577, 208943, 37], [208943, 216988, 38], [216988, 221469, 39], [221469, 221469, 40], [221469, 231557, 41], [231557, 239572, 42], [239572, 239572, 43], [239572, 239572, 44], [239572, 239572, 45]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, true, false, false, false, true, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false]}}]