[{"id": "7e03320dcdeea4a2f9bbc739c30809abee50590d", "text": "DISCOURS\n\nDE\n\nM. GIROUARD, M.P.,\n\nSUR\n\nL'EXÉCUTION DE LOUIS RIEL.\n\nCHAMBRE DES COMMUNES, 24 MARS 1886.\n\nM. GIROUARD : Après ce long débat, et comme le désir de la Chambre est que le vote soit pris ce soir, je n'ai pas l'intention de faire un long discours. Je désire seulement faire quelques remarques pour expliquer le vote que je suis sur le point de donner contre le gouvernement. J'ai pris la résolution de donner ce vote le 13 de novembre dernier, lorsque je me suis joint à seize amis et partisans du gouvernement dans la province de Québec, pour transmettre à l'honorable premier ministre le télégramme suivant :\n\nDans les circonstances actuelles l'exécution de Louis Riel serait un acte de cruauté dont nous repoussons la responsabilité.\n\nAyant été élu comme conservateur, et étant conservateur de principes, j'ai cru que je ne pouvais pas arriver à cette conclusion sans consulter mes commettants. C'est ce que j'ai fait à la première occasion, le 15 novembre, la veille de l'exécution. Je leur ai dit que, dans les circonstances, il n'y avait pas de lien de parti assez fort pour me retenir en face de l'exécution de Louis Riel, et que j'offrais de leur remettre mon mandat. Mes électeurs m'ont répondu qu'ils approuvaient unanimement ma conduite ; ils ne se sont pas contentés de cela, ils ont télégraphié immédiatement au premier ministre qu'ils approuvaient à l'unanimité la ligne de conduite que j'avais suivie. En votant ainsi contre le gouvernement et en obéissant au désir formellement exprimé de mes commettants, je n'entends pas changer mes opinions politiques. Je suis en faveur de la politique nationale et de\nla construction du chemin de fer Canadien du Pacifique. Pour calmer les inquiétudes de l'honorable député de Lincoln (M. Rykert), je puis lui dire que je n'ai pas l'intention de retirer aucune des propositions de mon discours de six heures à la dernière session sur l'administration du Nord-Ouest. Si j'étais d'opinion que le gouvernement du jour est la cause première de la rébellion du Nord-Ouest, comme les libéraux de la province de Québec l'ont dit dans leurs assemblées avant l'exécution, je blâmerais le gouvernement, non seulement d'avoir pendu Riel, mais de ne pas lui avoir accordé une amnistie complète ; mais je n'ai jamais été de cette opinion. Je n'ai jamais prétendu que Riel était un héros, je l'ai toujours considéré comme un lunatique, et je blâme le gouvernement de ne pas l'avoir traité comme tel. C'est la raison pour laquelle j'ai pris part à l'agitation qui a eu lieu dans la province de Québec,—agitation que l'honorable député de Kent, N.-B. (M. Landry), a condamnée dans un langage si énergique parce qu'il n'en connaît ni le véritable caractère ni la tendance. S'il avait été à ces assemblées auxquelles j'ai assisté, bien que je n'en aie pas vu un grand nombre, il aurait été en état de dire à la Chambre et au pays qu'il n'y a jamais eu d'assemblées plus paisibles, plus constitutionnelles et plus loyales dans la Confédération canadienne.\n\nL'honorable député de Kent nous a parlé de l'exemple du bon peuple acadien. Tout le monde sait que les Acadiens ont beaucoup souffert, depuis le jour où ils ont été dispersés comme des esclaves sur ce continent jusqu'à une époque récente, sinon jusqu'à ce jour. L'honorable député nous a dit que les Acadiens se sont soumis paisiblement à la dépossession des terres qu'ils possédaient depuis soixante-dix ans. Il aurait pu nous dire aussi qu'ils souffrent aujourd'hui en silence la fermeture d'un collège—le collège de Saint-Louis, si je ne me trompe pas—parce qu'on y enseignait la langue française... Les Acadiens ont été, et ils sont sans doute un peuple très patient; mais je crains beaucoup que, dans les circonstances, leur patience ne soit pas une vertu, mais une nécessité. Je dirai à l'honorable député que chaque fois que les droits des citoyens français de la province de Québec seront attaqués, chaque fois que leur nationalité, leur langue, leur religion, leurs institutions ou leurs lois seront attaquées, la province de Québec protestera ; elle fera de l'agitation et elle résistera par tous les moyens légaux et constitutionnels.\n\nEn 1872 et 1873, nous avons eu une agitation plus importante peut-être que celle qui a produit la crise actuelle. À cette époque, les députés de la province de Québec avaient\nl'humiliation d'être seuls dans leur lutte. L'honorable député de Victoria, N.-B. (M. Costigan) demandait à cette Chambre de censurer le gouvernement parce qu'il n'avait pas désavoué la loi des écoles du N.-B. Les députés français, je pourrais dire les députés catholiques de la Puissance, étaient seuls; ils n'avaient que l'appui de l'honorable député du comté d'Ottawa (M. Wright); mais, maintenant, depuis le discours de l'honorable chef de l'opposition et des autres représentants de comtés anglais, on ne peut plus dire que cette crise est une affaire de race ou de religion. En 1872, nous combattions pour la liberté religieuse, pour les Acadiens français et la minorité catholique du Nouveau-Brunswick. Aujourd'hui, quant à moi, du moins, je proteste au nom de la liberté personnelle; je veux démontrer que nous devons respecter ces lois qu'on a passées pour protéger la vie des citoyens. Aujourd'hui, celui qui fait l'objet du débat est un pauvre lunatique; demain, peut-être, ce sera n'importe quel citoyen. Si j'avais été appelé à préparer la motion de l'honorable député de Montmagny (M. Landry), je l'aurais rédigée différemment. Je n'aurais pas demandé s'il s'agissait de savoir si l'on aurait dû laisser exécuter la sentence portée contre Louis Riel; mais j'aurais demandé à la Chambre de censurer le gouvernement, non pas parce qu'il a laissé exécuter la sentence, mais parce qu'il a ordonné l'exécution. Si Riel avait été jugé en vertu des lois des vieilles provinces, la question serait bien posée telle qu'elle est; mais comme il a été condamné en vertu de la constitution spéciale du Nord-Ouest, comme il a été condamné en vertu d'une loi spéciale qui dit qu'aucune sentence de mort ne sera exécutée à moins que l'Exécutif ne l'ordonne, je dis que la question à décider est celle de savoir si le gouvernement a bien ou mal agi en ordonnant l'exécution de Louis Riel.\n\nLe système d'administration de la justice criminelle au Nord-Ouest diffère beaucoup du système en force dans le reste de la Confédération. Dans toutes les provinces le président du tribunal est indépendant de la Couronne et il n'a rien à attendre du gouvernement; le jury se compose de douze membres, et si l'accusé le désire, dans les provinces de Québec et du Manitoba, il peut avoir six jurés de sa langue et de sa nationalité. Dans toutes les anciennes provinces, la loi établit une manière spéciale d'assigner les jurés; mais que voyons-nous au Nord-Ouest? D'abord le président de la cour est un simple magistrat stipendiaire qui garde sa position tant qu'il plaît au gouvernement; en deuxième lieu il n'y a que six jurés; troisièmement, l'accusé n'a pas droit à un jury mixte; et, en quatrième lieu, le juge\nest chargé d'assigner le jury. Il est parfaitement évident que le procès qui a eu lieu en vertu de cette loi n'était pas équitable bien qu'il fût légal ; ce n'était pas un procès britannique, un procès conforme aux principes de la justice britannique tels que nous les comprenons. Mais, M. l'Orateur, la constitution du Nord-Ouest, toute spéciale qu'elle est, a établi certaines garanties contre les erreurs judiciaires : D'abord, il y a droit d'appel à la cour d'appel du Manitoba ; ce droit d'appel n'existe pas dans les vieilles provinces. En deuxième lieu, il peut y avoir un appel final à l'Exécutif. L'article 76 de la loi du Nord-Ouest de 1877, refondue en 1880, dit :\n\nLorsqu'une personne sera convaincue d'une offense capitale et condamnée à mort, le magistrat stipendiaire transmettra au ministre de la justice des notes complètes de la preuve, avec son rapport sur la cause, et l'exécution de la sentence sera ajournée de temps à autre par le magistrat stipendiaire, s'il le juge nécessaire jusqu'à ce que ce rapport ait été reçu et que le bon plaisir du gouvernement à cet égard ait été communiqué au lieutenant-gouverneur.\n\nIl est parfaitement clair, par conséquent, que la révision du procès de Riel par l'Exécutif était un droit défini par la constitution du Nord-Ouest. L'accusé, lorsqu'on l'a traduit devant le tribunal de Régina n'a soulevé que deux questions : d'abord la question de juridiction et ensuite la question de folie. La cour d'appel du Manitoba a passé jugement sur les deux plaidoyers et les a rejetés. Le Conseil privé ne s'est prononcé que sur la question de juridiction ; mais Leurs Seigneuries ont bien pris le soin de dire qu'on n'avait fait aucune argumentation sur le plaidoyer de folie. La cause ayant ainsi passé par les tribunaux est venue devant l'Exécutif ? Quel était le devoir de l'Exécutif ? Son premier devoir était d'examiner le verdict, s'il était conforme à la preuve. Je suis d'avis que le verdict était mauvais. S'il y avait quelque doute sur la justice du verdict, c'était le devoir du gouvernement de commuer la sentence. Quand l'Exécutif examine la cause ses fonctions sont judiciaires, mais quand il est arrivé à la conclusion que le verdict est mauvais, c'est-à-dire quand il cherche les moyens d'empêcher une iniquité judiciaire, ses fonctions deviennent administratives. L'Exécutif n'est pas un tribunal d'appel en ce sens qu'il peut ordonner un nouveau procès, comme la cour du Manitoba, mais il l'est en ce sens qu'il est obligé d'examiner toutes les parties de la preuve pour voir si le verdict est correct ou non. Je prétends, M. l'Orateur, que cette proposition est la conséquence nécessaire de la constitution du Nord-Ouest. Si, comme l'a prétendu l'honorable ministre de la justice, l'autre soir, le gouvernement ne doit pas aller au delà du verdict, examiner la\npreuve et voir si le verdict est correct ou non, pourquoi la loi dit-elle que toutes les notes de la preuve seront transmises à l'Exécutif, et, plus que cela, que l'exécution ne pourra avoir lieu à moins que le gouverneur général n'ait fait savoir au lieutenant-gouverneur qu'il y consent ? Mais même si le gouvernement avait regardé cette cause comme une cause ordinaire dans laquelle on invoque la clémence, même si la cause avait pris naissance dans les vieilles provinces, ma prétention est que le gouvernement avait tort d'affirmer qu'il n'avait pas droit d'examiner la preuve et d'aller au delà du verdict. Quelle est la pratique en Angleterre, dans de pareils cas ? Lord Carnarvon disait devant la Chambre des Lords, en 1864 :\n\nÀ présent la prérogative de la clémence est dans les mains de la couronne, qui en a fait usage d'après l'avis du secrétaire d'État. En exerçant cette prérogative, le secrétaire d'État est appelé à examiner l'aspect moral de la cause comparé à l'aspect légal. Il doit considérer les représentations qu'on lui fait quant à l'influence indue qu'on aurait pu pratiquer, quant aux faits particuliers qu'on aurait pu cacher, quant aux faits nouveaux qu'on aurait pu découvrir, et en un mot, quant à tout ce qui aurait pu faire manquer l'effet de la justice. Dans l'état actuel des choses, la position du secrétaire d'État est celle d'une cour criminelle d'appel.\n\nJe sais que quelques hautes autorités s'opposent à ce qu'on emploie les mots \"cour d'appel\" en parlant de la juridiction du secrétaire de l'intérieur, parce qu'il ne peut pas ordonner un nouveau procès ; mais tous les hommes d'État qui sont familiers avec ce sujet, enseignent que la juridiction du secrétaire d'État équivaut à celle d'une cour de révision. Sir S. H. Walpole, qui a été plusieurs fois secrétaire d'État, et dont le témoignage a été cité par le ministre de la justice, a exposé devant la commission qui a étudié spécialement la question de la peine capitale, en 1864, la pratique suivie par le Home Office :\n\nL'usage, dit-il, est d'examiner le mémoire qui a été envoyé au sujet de la cause ; de consulter le juge qui a jugé la cause ; de demander au juge un rapport de la preuve ; de soumettre au juge tous les faits nouveaux, ou tous les faits qui peuvent être arrivés à la connaissance du secrétaire d'État, et de demander au juge de faire connaître son opinion sur la preuve additionnelle ou sur la cause. Lorsque tous ces matériaux sont devant le secrétaire d'État, il est en position non pas d'entendre la cause de nouveau, mais de dire à la couronne s'il y a des circonstances qui justifieraient l'exercice de la clémence dans un sens absolu ou limité, c'est-à-dire le pardon ou une commutation.\n\nQ. Quand vous dites que le secrétaire d'État n'a pas l'habitude d'entendre les causes une deuxième fois, voulez-vous dire que le secrétaire d'État n'examine pas la preuve ?—R. Il en examine chaque parcelle. Le secrétaire suppose que le procès ayant été conduit devant un tribunal compétent (c'est-à-dire un tribunal constitué d'après les principes anglais), on a dû arriver à une juste conclusion, à moins qu'on ne lui démontre que le tribunal a erré de quelque manière. Mais dans la majorité des cas cette question ne se présente pas, parce que dans la\nmajorité des cas soumis au secrétaire d'État le point à décider est celui de savoir si l'on n'a pas soumis au jury certaines circonstances atténuantes qui devraient induire le secrétaire d'État à recommander à la couronne une modification ou une mitigation de la sentence.\n\nQ. Et vous souvenez-vous, continua un commissaire, en s'adressant à sir S. H. Walpole, que vous avez autorisé une personne intelligente dans un certain cas à mesurer les distances pour voir si elles s'accordaient avec la preuve attaquée ?—R. Certainement ; c'est ce que j'ai fait.\n\nSir S. H. Walpole continue sa déposition :\n\nLe Dr Lushington.—Q. Mais, quelquefois, ce bureau agit comme cour d'appel, comme dans le cas de Smethurst ?—R. Il peut agir comme cour d'appel.\n\nLe Dr Lushington.—Q. Dans certains cas où il y a une question de culpabilité ou d'innocence, il doit agir comme cour d'appel ?—R. Oui ; non pas judiciairement, mais par nécessité.\n\nQ. Il doit dire à la couronne si la cause est suffisamment claire pour justifier l'exécution de la sentence ?—R. O'est cela.\n\nM. Neate.—Q. D'après votre expérience, n'est-il pas extraordinaire que le Home Office agisse contrairement à la recommandation du juge qui a siégé dans la cause ?—R. Je ne crois pas que l'on agisse d'ordinaire de cette façon, parce que je ne vois pas de nécessité de différer d'opinion avec le juge devant lequel la cause a été plaidée. De temps à autre cette nécessité peut exister, et alors le secrétaire d'État assume la responsabilité d'une dissidence.\n\nQ. Il n'y a pas de règle établie au Home Office qui vous oblige à suivre la recommandation du juge après lui avoir soumis la cause ?—R. Non, certainement.\n\nLe duc de Richmond.—Q. Le jugement du secrétaire d'État est entièrement libre ?—R. Absolument libre.\n\nSir George Grey, qui était secrétaire d'État dans le temps, en 1864, fut aussi examiné devant la même commission. Il dit :\n\nJe vois, d'après ce qu'on a écrit sur le sujet, que certaines gens sont sous l'impression que le secrétaire d'État va siéger comme cour de révision, entendre de nouveau les causes et mettre de côté les verdicts. Les causes de cette espèce sont extrêmement rares. Il y a eu la cause de Smethurst qui n'a pas été décidée par moi. On a recommandé l'enquête dans cette cause. Il m'est arrivé une cause dans laquelle il y avait une preuve médicale ; j'ai eu à communiquer avec le juge plusieurs fois au sujet de cette affaire. La preuve ne me paraissait pas parfaitement suffisante, et je crois que le juge était de mon opinion.\n\nDepuis 1864, la pratique du bureau de l'intérieur n'est pas plus sévère. De fait, si nous en jugeons par la déclaration de sir William Harcourt, citée par mon ami, l'honorable député de Rouville (M. Gigault), dans le savant discours qu'il a adressé à cette Chambre, on est encore plus libéral et plus indulgent ; on suit l'influence du siècle, sans doute, qui est de plus en plus hostile à la peine capitale.\n\nLa pratique du bureau de l'intérieur, lorsque le jury a recommandé un prisonnier à la clémence, a été de ne pas exécuter la peine capitale. Une difficulté se présentait, par exemple, lorsque le jury faisait une recommandation à la clémence et que le juge n'appuyait pas la recommandation ; dans ce cas, c'était au secrétaire d'État de former sa propre opinion sur la cause.\nParlant de la juridiction du Home Office dans un cas comme celui-ci—un cas de folie—sir William Harcourt dit :\n\nIl est à ma connaissance que nous avons eu des cas dans lesquels la preuve de la folie n'a pas été faite devant le juge et le jury. Le secrétaire d'État a le pouvoir d'envoyer des médecins d'expérience examiner le prisonnier, et lorsque ces médecins ont déclaré dans leur rapport qu'ils ne regardaient pas le prisonnier comme responsable de ses actions, soit lorsque l'offense a été commise soit après, la peine capitale n'a jamais été exécutee.\n\nSir R. Assheton Cross, qui a été aussi secrétaire d'État, disait dans la même circonstance en 1881, lors de la discussion sur le bill abolissant la peine capitale :\n\nLe très honorable et savant député (sir Wm. Harcourt) a parfaitement exprimé, dans mon opinion, les vrais fonctions du secrétaire d'État en cette matière.\n\nTels étaient les devoirs du gouvernement canadien en vertu de la loi concernant le Nord-Ouest ou du droit public anglais. Les ministres se sont-ils conformés à ces règles, comme dispensateurs de la prérogative de la miséricorde ? La première faute qu'ils ont commise consiste dans la fausse interprétation de leur devoir. J'ai été surpris, hier, d'entendre l'honorable ministre de la justice, qui est certainement un avocat brillant, dire que le gouvernement n'avait pas le pouvoir d'aller au delà du verdict. Alors, à quoi sert ce statut canadien qui dit que l'exécution d'un homme condamné à la potence n'aura pas lieu sans un ordre de l'Exécutif? Alors, M. l'Orateur, que signifient toutes ces règles posées par le Home Office, qui veulent que la couronne fasse une enquête, dans une cause comme celle-ci, au sujet de la folie du prisonnier, à l'époque de la perpétration de l'offense ou après ? C'est le devoir de l'Exécutif d'examiner chaque parcelle de la preuve, de la peser, et même de permettre qu'on recueille de nouveaux témoignages, pour éviter la consommation d'une iniquité judiciaire. J'ai lu toutes les procédures en cette cause et j'ai cherché en vain un rapport du juge pour voir s'il était en position de s'accorder avec le jury pour obtenir l'exercice de la clémence ; et je suis surpris que le gouvernement ait ordonné l'exécution du condamné, sans demander au juge qui avait présidé le procès s'il était d'accord avec le jury. Je blâme le gouvernement d'avoir ordonné l'exécution de Louis Riel, après avoir recueilli de nouveaux témoignages, ceux des trois médecins, après la sentence,—parce qu'il n'a pas soumis ces témoignages au juge Richardson pour avoir de lui un rapport spécial, conformément à la pratique suivie en Angleterre au Home Office. C'était le devoir du gouvernement de demander au juge Richardson son opinion\nsur ces nouveaux témoignages, afin de voir s'il pouvait l'induire à recommander l'exercice de la clémence.\n\nM. l'Orateur, nous trouvons un autre motif de clémence dans certains faits d'influence illégitime qui se sont produits pendant le procès. Tous les témoins que la couronne a fait entendre, ou un grand nombre d'entre eux, ont dit que Riel feignait la folie, dans le but de réussir dans sa rébellion.\n\nCette opinion, exprimée par tant de témoins, est due aux sentiments qui dominaient dans cette partie du pays contre Louis Riel ; les témoins n'avaient aucune raison de supposer que le plaidoyer de folie n'était qu'une manœuvre des avocats et que le prisonnier simulait la folie dans un but déterminé. Quand nous considérons que ce procès a eu lieu sous une garde militaire, pour protéger le prisonnier contre l'indignation publique, nous pouvons nous imaginer facilement quels préjugés on a dû créer contre lui. En examinant les pétitions qu'on a adressées au gouvernement pour obtenir l'exécution de Louis Riel, nous sommes surpris de voir qu'il n'en est venu de nulle part en Canada, excepté de Régina, où le prisonnier a été jugé et condamné, et de Moosomin, dans le voisinage. Ces pétitions venaient du district même où l'on a pris les jurés et où siégeait le juge Richardson ; le district, il faut aussi le remarquer, n'est qu'à une courte distance de l'endroit où siègent les juges de la cour d'appel du Manitoba.\n\nJe blâme aussi le gouvernement de ne pas avoir exercé la clémence parce que le juge a refusé de laisser prouver certains faits particuliers. Je n'admets pas, avec le chef de l'opposition, que les papiers officiels qu'on a demandés ne se rapportaient pas à la cause, parce qu'ils ne pouvaient pas justifier la rébellion. Je ne prétends pas que ces documents justifieraient la rébellion, mais le jury aurait dû les avoir afin de juger s'ils étaient de nature à faire adoucir ou changer la sentence. Je blâme le gouvernement à cause de l'exécution, parce qu'il pouvait assigner des témoins importants qu'il n'a pas assignés : On a mentionné le nom du docteur Howard, dans ce débat. Je suis peiné, vraiment, que l'honorable député de Montréal-Centre (M. Curran), qui siège ici comme juge, soit allé trouver un homme qu'il considérait comme un témoin important et lui ait demandé son opinion sur la cause. Il sait très bien que ce n'est pas ainsi que les juges, et même les avocats, conduisent les causes. J'aurais été très content, si le gouvernement, en nommant les membres de la commission médicale, leur avait donné ordre d'examiner le docteur Howard et de le faire transquestionner. J'aurais voulu, aussi, qu'on eût examiner le docteur Vallée, de l'Asile des Aliénés de Beauport, sous les soins duquel Riel a été pen-\ndant deux ans et que la maladie a empêché d'assister au procès de Riel. M. l'Orateur, je blâme le gouvernement parce qu'il n'a pas fait entendre les témoins qui connaissaient particulièrement les faits se rattachant au plaidoyer de folie. On a exprimé diverses opinions en cette Chambre sur la valeur de la preuve fournie pendant le procès sur l'état mental du prisonnier.\n\nJe ne veux pas fatiguer la Chambre en citant de nouveaux témoignages que tout le monde connaît. Mais, M. l'Orateur, en lisant ces dépositions, je suis arrivé à la conclusion que le verdict a été contre la preuve, en tant qu'il s'agit du plaidoyer de folie. On a dit que la cour d'appel du Manitoba était plus capable que cette Chambre d'exprimer une opinion sur la question de savoir si ce verdict est bien fondé ou non. On a même dit que nous n'avons pas juridiction en cette matière ; mais, je crois que j'ai démontré qu'il est de notre devoir d'examiner si le verdict est conforme à la preuve. Voyons s'il y a quelque expression d'opinion de la part du jury, du juge, de la cour d'appel du Manitoba, ou du Conseil privé d'Angleterre, quant au plaidoyer de folie. Il est vrai que le jury a rendu un verdict de culpabilité ; il est vrai que nous devons prendre ce verdict tel qu'il est, c'est-à-dire comme une déclaration que Riel n'était pas assez fou pour échapper à une condamnation. Mais il est indubitable que le jury a considéré la question de folie, quand il a recommandé le prisonnier à la clémence de la cour. Voulez-vous dire que le jury ne voulait rien dire par là ? Quels étaient les plaidoyers de la défense ? D'abord, défaut de juridiction ; deuxièmement, folie. Je ne crois pas, comme l'honorable chef de l'opposition, qu'un juré doive expliquer les intentions du jury. Ce n'est pas ainsi qu'on peut attaquer un verdict. Je suis plus porté à croire que la recommandation du jury à la clémence était appuyée sur ce qui était devant la cour. Mais qu'y avait-il devant la cour ? Avait-on signalé à l'attention des jurés les griefs des métis ? Pas du tout. Le juge n'a pas permis la preuve sur ce point. La seule question présentée au jury, c'était celle du plaidoyer de folie, et quelles qu'aient pu être les vues particulières du juré qui a écrit au chef de l'opposition, mon opinion est que la recommandation à la clémence ne pouvait avoir d'autre signification légale que celle-ci ; le jury avait sur l'état d'esprit de Riel des doutes pas assez forts pour l'acquitter, mais assez sérieux pour le recommander à la clémence et le sauver du gibet. Quelle a été la position du juge Richardson ? Nous connaissons le sentiment du jury ; nous savons que c'était un sentiment de miséricorde. Le juge a-t-il refusé de s'accorder avec le jury ? J'ai déjà fait voir que le gouvernement n'a\npas même pris la peine de demander l'opinion du juge. Le statut dit que le juge enverra la preuve avec un rapport sur cette preuve. On ne trouve aucun tel rapport. La pratique du Home Office en Angleterre est de consulter le juge sur la preuve. Dans cette cause on aurait dû consulter le juge pour savoir s'il approuvait la recommandation du jury à la clémence. On ne l'a pas consulté et on ne peut pas dire aujourd'hui que le juge était contre l'opinion du jury.\n\nJe ne parlerai pas du Conseil privé, parce qu'on ne l'a pas appelé à examiner cette question. Mais, a-t-on demandé à la cour d'appel du Manitoba d'exprimer son sentiment sur l'opportunité de l'exercice de la clémence ? Cette cour a été appelée à déclarer si elle considérait le verdict conforme à la loi et à la preuve ; mais elle n'a certainement jamais exprimé l'opinion que le gouvernement avait des raisons suffisantes de refuser une commutation de peine. J'espère que la Chambre me pardonnera si j'ajoute encore quelques remarques au sujet de ce plaidoyer de folie, car je crois que la folie est la grande question en cette cause, de fait, la seule question, à mon point de vue. Riel était-il réellement fou ? Comme je l'ai dit, je ne veux pas ennuyer la Chambre en lui lisant des extraits de la preuve ; mais je trouve dans cette preuve un fait important, le plus important qui puisse nous aider à trouver une solution. Je vois qu'il est établi hors de tout doute que Riel a été interné dans un asile d'aliénés dans la province de Québec, par ordre du gouvernement de Québec. Il était fou dans le temps, cela est certain ; il souffrait d'une monomanie religieuse et politique. Ce fait est établi d'une manière incontestable. Il a été enfermé dans l'asile des aliénés à Beauport, pendant près de dix-huit mois, et l'on ne pouvait pas avoir de raison de croire qu'il simulait la folie. Qu'aurait-il pu gagner par là ? Il aurait pu vivre en liberté, s'il avait été sain d'esprit. Je vais citer quelques autorités légales et médicales sur la matière. Le Dr Winslow dit :\n\nDans le cas de meurtre où la folie est invoquée comme circonstance atténuante, il est nécessaire de s'enquérir si la personne a manifesté des signes de dérangement mental à une époque antérieure de sa vie. Si tel est le cas, cela doit constituer une preuve primâ facie en sa faveur.\n\nTaylor, dans son ouvrage sur la preuve, dit au vol. 1, page 204 :\n\nSi l'on prouve quelque dérangement ou quelque signe de démence à une époque quelconque, ce dérangement est censé se continuer, à moins qu'on ne prouve le contraire.\n\nOn lit dans Best sur la preuve, à la page 372, édition de 1883 :\nBien que la présomption légale soit généralement contre la folie, cependant, lorsque le fait de la démence a été prouvé, on présume qu'il se continue.\n\nPermettez-moi de citer spécialement une autorité récente. Dans la cause de Close vs. Dickson et al, Cour Supérieure de Montréal, 1872, M. le juge Johnson a dit:\n\nLa loi présume généralement que toutes les personnes sont saines d'esprit, et cette présomption ne disparaît que devant la preuve concluante du contraire ; mais lorsqu'on prouve clairement qu'une personne a déjà été folle, comme cet homme l'a été, l'existence d'intervalles incides ne peut être établie que par la preuve la plus formelle.\n\nJ'ai suivi la règle énoncée dans la Jurisprudence Médicale de Taylor et dans l'ouvrage de Wharton et Stille : \"Les témoignages pour établir des intervalles incides ou une folie générale ou partielle doivent avoir deux caractères ; d'abord, ils doivent venir de personnes parfaitement renseignées sur ces sujets et d'une compétence reconnue ; deuxièmement, ces témoignages doivent venir, autant que possible, de personnes qui ont eu beaucoup d'occasions d'observer la conduite, les habitudes et les dispositions mentales de la personne que l'on suppose atteinte de folie ; elles doivent l'avoir connue longtemps et même avant l'apparition de la maladie.\n\nAlors que reste-t-il de la proposition énoncée par le gouvernement que le fardeau de la preuve retombe sur le prisonnier ? Le fait de la folie de Riel à une certaine époque étant établi hors de tout doute, il incombait à la couronne d'établir qu'il avait recouvré la raison ; mais elle n'a pas détruit la présomption de folie qui existait. Au contraire, cette présomption a été confirmée de manière à prouver clairement que le verdict a été rendu contre la preuve. Je veux parler particulièrement des témoignages du Père André, de Garnot, du Père Fourmond, des Drs Roy et Clark. Où est la preuve de la couronne pour détruire cette présomption ? Le Dr Wallace est, sans doute, un homme de mérite, un homme capable de juger d'une question comme celle-ci ; mais il a été forcé d'admettre qu'il n'avait pu consacrer tout le temps qu'il fallait à cette cause.\n\nNous avons aussi le témoignage du Dr Jukes, qui n'a connu le prisonnier qu'après la suppression de l'insurrection, qu'après la période d'excitation produite par la manie partielle dont il était atteint. Il y a plus, nous avons l'aveu même du Dr Jukes qui dit qu'il n'est pas compétent. En quoi consiste le reste de la preuve de la couronne ? Nous avons les témoignages du cap. Young, du rév. M. Pitolado, du cap. Deane et du cap. Pigott. Plusieurs de ces messieurs n'ont jamais eu aucune conversation avec Riel, au moins sur les questions particulières qui faisaient l'objet de sa folie, et c'est un fait remarquable qu'aucun de ces messieurs n'a connu Riel avant la fin de la rébellion. Je crois que la couronne a dû se trouver bien embarrassée pour prouver la lucidité d'esprit de Riel quand elle s'est sentie forcée de faire\nentendre le général Middleton. Pouvait-elle penser que le général Middleton, qui venait de remporter une victoire, allait dire qu'il avait fait la guerre contre un fou ? Non, certainement ; il n'était pas pour nuire lui-même à sa réputation de cette manière. Vous pouvez juger du caractère de la preuve par cet autre fait que l'on avait parmi les témoins le capitaine Young et un autre capitaine de l'armée qui est allé combattre Riel et ses partisans. Cela vous indique le caractère de la preuve avec laquelle la couronne a essayé de détruire la présomption légale qui veut que lorsqu'un homme a été une fois lunatique, aliéné ou maniaque, il est toujours lunatique, aliéné ou maniaque aux yeux de la loi. Dans ces circonstances, je considère que c'était le devoir du gouvernement de nommer une commission médicale. Ce devoir était si évident que des membres du cabinet eux-mêmes nous ont induits à croire (mais je ne veux pas rapporter ici des conversations privées) qu'une commission médicale serait nommée, et, de fait, la promesse en a été faite publiquement à Rimouski et rapportée dans tous les organes ministériels de la province. Dans ces circonstances, le moins que nous puissions avoir, vu les doutes du public—pour employer une expression modérée—sur l'état mental de Riel, vu les nombreux précédents anglais, c'était une commission médicale compétente qui n'aurait pas seulement examiné l'état du prisonnier depuis sa condamnation, mais avant, suivant la pratique suivie au Home Office.\n\nBlackstone a été cité l'autre soir par le ministre de la justice ; mais cet auteur ne mentionne pas le cas où l'Exécutif fait eu à considérer si les tribunaux ne commettraient pas une iniquité en frappant un aliéné ; plusieurs secrétaires d'État ont eu à s'occuper d'un tel cas et ils considèrent qu'il est de leur devoir de charger des médecins d'expérience de s'enquérir de l'état mental du prisonnier non seulement depuis la condamnation, mais à l'époque de la perpétration du crime. Le gouvernement canadien aurait été fortifié dans cette position non seulement par le sentiment du devoir, mais par les nombreuses pétitions qu'on avait envoyées de la province de Québec et des autres parties du Canada pour obtenir une commission médicale; M. l'Orateur, cette commission n'a jamais été nommée et je blâme le gouvernement de ne pas pas avoir rempli la promesse qu'il avait faite plusieurs fois d'en nommer une. Quel tribunal a-t-il organisé à la place de cette commission ? Il a chargé trois médecins, les premiers venus sous sa main, de faire des recherches pour découvrir quel était l'état mental de Louis Riel après sa condamnation. La juridiction de ces médecins aurait dû être plus considérable ; et si\npeu compétents qu'ils fussent, on n'aurait pas dû les limiter à un examen de l'état mental de Louis Riel, depuis sa condamnation seulement. La seconde objection que j'ai au choix de ces messieurs, c'est qu'ils étaient des employés du gouvernement. Je suis certain que si ces messieurs avaient été indépendants du gouvernement, et s'ils avaient tenu à leur réputation comme praticiens plus qu'à leur position comme employés du gouvernement, les premiers télégrammes qui ont disparu ne seraient pas introuvables. Je prétends aussi que quelques-uns des membres de cette commission étaient incompétents. Il se peut que le docteur Lavell ait quelque expérience, mais il n'y a pas l'ombre d'un doute que les docteurs Jukes et Valadé n'en ont pas du tout, et l'on n'a jamais prétendu le contraire. Je me plains aussi de ce que cette prétendue commission—car elle ne mérite pas le nom de commission—n'a pas eu le temps de prononcer un jugement sur la cause. Esquirol, l'éminent médecin, dit :\n\nIl y a des fous qui paraissent si raisonnables qu'il est nécessaire de vivre avec eux et de les suivre dans chacune des actions de leur vie pour arriver à la conclusion qu'ils sont privés de raison.\n\nLe docteur Wood dit :\n\nIl est impossible alors pour ceux qui ne font que passer à travers un asile d'aliénés de former une opinion exacte sur l'état mental de ceux qui y sont internés.\n\nBeck dit dans sa jurisprudence médicale :\n\nC'est le devoir du médecin et ce devrait être son privilège de passer plusieurs jours à examiner un lunatique avant de donner une opinion décisive. Si on lui permet cela et s'il peut obtenir une histoire complète de la vie de cette personne, il peut alors assez facilement donner une opinion exacte.\n\nTelle est aussi l'opinion de M. le juge Johnson dans la cause que j'ai citée, et je crois qu'on ne peut produire aucune autorité pour appuyer l'opinion contraire. Prenez par exemple la célèbre cause de John Grith, décidée en 1790. On l'accusait d'une tentative d'assaut sur Sa Majesté le roi. Ses amis prétendaient qu'il était fou. On l'amena devant tous les ministres de l'État, qui l'interrogèrent, et il fut transquestionné par le procureur général. Il y avait tant de doutes au sujet de son état mental qu'on l'envoya à la prison de Newgate, où il demeura sous la surveillance de deux médecins éminents, non pas seulement pendant deux ou trois jours ou pendant quelques mois, mais pendant deux ans, et ce n'est qu'au bout de ces deux ans que ces deux hommes éminents furent capables de venir devant une cour de justice, où cet homme subissait un procès pour haute trahison, jurer que connaissant les habitudes de cet homme, comme ils les connaissaient après de si longues\nobservations, ils étaient convaincus qu'il était insensé ; et le résultat fut qu'on l'envoya dans une maison de détention. C'est ainsi que l'on comprend les lois relatives à la liberté personnelle et à la protection de la vie dans la mère-patrie. Ce n'est qu'ici, sur ce continent d'Amérique, dans cette terre du Canada, où nos institutions sont supposées calquées sur celles de la mère-patrie, que nous avons le spectacle d'un homme que ses amis disent insensé, envoyé à l'échafaud dans l'espace de quelques heures.\n\nDans ce parlement, où il y a beaucoup d'avocats de talent et où l'on peut trouver autant d'impartialité que dans n'importe quelle cour, nous avons vu des hommes de races et de croyances différentes, exprimer librement l'opinion que cet homme était insensé. M. l'Orateur, c'est une disgrâce pour le gouvernement et pour le pays qu'on puisse soupçonner qu'une telle injustice a été commise.\n\nL'autre raison pour laquelle je condamne cette commission médicale c'est qu'elle a été nommée et qu'elle a agi secrètement. On a prétendu que c'était la seule manière d'arriver à la vérité, parce que Riel aurait été plus fin que les médecins et qu'il aurait pu passer pour fou tout en étant sain d'esprit. Cette prétention n'est aucunement fondée. Le docteur Winslow a fait des remarques qui s'appliquent également aux témoins qui prétendent que Riel simulait la folie. Il dit :\n\nSimule-t-on la folie ? Des personnes qui connaissent bien ce qui distingue les cerveaux troublés et qui ont été dans l'habitude d'observer les manières des insensés, auront peu de difficulté à découvrir si la folie est réelle ou simulée. Georget est d'opinion qu'il est impossible pour une personne qui n'a pas fait de la folie une étude spéciale, de simuler la folie de manière à tromper un médecin compétent.\n\nÀ part cela, la manière de procéder de cette commission médicale est contraire à notre expérience des lois. Il y a un an ou deux nous avons eu un cas célèbre de folie à Montréal. Je veux parler du cas de madame Lyman. Le jugo, après avoir entendu plusieurs témoins, ne savait pas si elle était folle ou non, et il soumit le cas à un homme d'expérience, le docteur Vallée, un des surintendants de l'asile des aliénés de Beauport. Comment le docteur Vallée procéda-t-il ? Il examina des témoins, il prit connaissance de la preuve, je crois même qu'il fit venir les avocats ; tout se fit ouvertement, parce que, comme l'ont dit le docteur Winslow et toutes les grandes autorités médicales, il est impossible qu'on trompe des médecins expérimentés en cette matière. À un moment donné le docteur Vallée s'est rendu en cour et il a déposé son rapport, qui a été lu immédiatement. La cour n'a pas gardé le rapport pendant des semaines,\nmais il a été ouvert tout de suite et livré au public, qui a pu voir si l'on avait rendu justice ou non. Qu'avons-nous vu dans la cause de Riel ? Non seulement les médecins ont procédé secrètement, mais le gouvernement a gardé secret pendant longtemps le rapport de cette prétendue commission. Si ce rapport avait été favorable au gouvernement, comme on l'a prétendu aujourd'hui, pourquoi ne l'aurait-on pas communiqué au public, afin que le public put voir si justice avait été faite.\n\nJe ne puis terminer mes remarques sans faire connaître mon opinion sur la folie. Comme on le sait, les médecins et les avocats ne sont pas absolument d'accord là-dessus. Il y a longtemps déjà lord Mansfield a prétendu que la loi veut qu'un homme soit responsable de ses actes, quand même il a des hallucinations, pourvu qu'il connaisse la différence entre le bien et le mal. Les médecins sont allé également loin dans le sens opposé. Ils ont prétendu que si un homme est atteint d'une manie, que le crime se rapporte ou non à cette manie, il n'est pas responsable. Entre ces deux systèmes extrêmes l'opinion publique a accepté le principe que si un homme est atteint d'une maladie connue sous le nom de monomanie, ou s'il a des hallucinations sur un ou deux sujets, il n'est pas coupable si l'on peut démontrer qu'il y a quelque rapport entre le crime dont on se plaint et la manie dont il souffre. On trouvera peut-être intéressant de voir jusqu'où va la profession médicale sur cette question. Je vais me contenter de lire une résolution adoptée unanimement à une séance de l'association des médecins des asiles d'aliénés en 1865. Voici :\n\nQue la doctrine légale qui prétend qu'un lunatique est responsable parce qu'il connaît la différence entre le bien et le mal est incompatible avec le fait bien connu de chaque membre de cette réunion que la faculté de distinguer entre le bien et le mal existe fréquemment chez ceux qui sont certainement insensés et qu'elle s'allie à des hallucinations incontestables.\n\nLe cas de McNaughten, au sujet duquel les juges anglais ont exprimé une opinion en 1843, n'appuie pas la prétention de ce gouvernement qu'il est suffisant pour le criminel de connaître la différence entre le bien et le mal.\n\nLeurs Seigneuries, bien que ne donnant aucune opinion sur une cause quelconque qui leur était soumise, mais sur des questions de droit abstraites, chose toujours dangereuse à faire, Leurs Seigneuries, die je, ont déclaré qu'un homme souffrant de monomanie pour être considéré comme responsable, ne doit pas connaître la nature de son acte, ou s'il la connaît il ne doit pas savoir que cet acte est mal. Telle a été l'opinion des juges anglais dans la cause McNaughten, mais, même dans cette cause, leur opinion n'a pas été consi-\ndéree comme réglant la question en Angleterre. Le juge en chef Cockburn, dans une lettre envoyée en l'année 1879, sur le bill du Code Criminel disait :\n\nLe langage des juges à la Chambre des lords a sans doute été répété comme ayant une application générale, mais d'une façon erronée. Leurs réponses avaient trait aux questions spécifiques qui leur avaient été posées par la Chambre.\n\nEt, immédiatement après il dit :\n\nLe point n'a pas été soumis à une décision judiciaire dans une cause qui soulèvait réellement la question.\n\nCela était écrit en 1879. Les réponses données par deux savants juges de la cour d'échiquier, en Angleterre, devant la commission sur la peine capitale, en 1864, démontrent que, réellement les avocats et les docteurs ne diffèrent pas tant d'opinion sur cette question de folie. Lord Cranworth, depuis longtemps baron de la cour d'échiquier, a répondu :\n\nQ. Est-ce qu'il n'existe pas une nuance entre les opinions médicales et les définitions légales sur la question ? R. Il m'est impossible de répondre à cette question ; il est très vraisemblable qu'il en est ainsi.\n\nPrenez l'opinion, sur la même question, du baron Branswell, un autre baron de la cour d'échiquier, opinion qui se trouve aux pages 23 et 24 du rapport de cette commission :\n\nM. NEATE : Q. Je remarque que dans votre dernière lettre aux commissaires vous employez ces mots comme résultat de votre expérience : \"Six prisonniers dans six causes, ont été acquittés pour cause de folie et cela avec raison. Je ne veux pas dire que les prisonniers étaient sous comme l'exige la loi.\" Je remarque que vous dites qu'ils ont été acquittés avec raison, bien que leur folie ne fut guère ce qui est considéré comme tel aux termes de la loi. Avez-vous des changements à suggérer dans la définition légale de la folie ? —R. Non ; je pense que la définition légale est parfaitement exacte.\n\nQ. Mais vous dites qu'ils ont été acquittés avec raison, bien que leur folie ne fût pas ce que la loi exige ? —R. Je vais expliquer cette remarque, qui est, sans doute, une contradiction apparente. Ce que je veux dire c'est que, d'après la pratique des jurés, laquelle a reçu la sanction des juges, ou qui n'a reçu aucune désapprobation des juges et qui est conforme au sentiment public, les prisonniers ont été acquittés avec raison.\n\nVoilà pour la doctrine sur la folie, et je crois que la loi sur ce point a été exactement interprétée par lord Erskine lors du procès de James Hadfield, arrêté pour avoir tiré sur George III. Il dit :\n\nPour qu'un lunatique ne soit pas responsable à la justice criminelle, il faut que le rapport entre la maladie et l'acte soit apparent. Quand la relation est douteuse, le jugement devrait certainement être très doux, vu la grande difficulté de pénétrer jusqu'au sources secrètes du désordre qui règne dans une intelligence.\n\nC'est là ce que le gouvernement aurait dû faire et c'est ce qu'il n'a pas fait, car il existe un doute et plus qu'un doute —dans mon opinion, il y a une preuve suffisante—que cet homme était fou ; mais si quelques députés ne sont pas dispo-\nsés à aller aussi loin, je prétends qu’il doit exister plus qu’un doute légitime dans leur esprit que cet homme était fou, et que l’on aurait dû agir conformément à la proposition de lord Erskine, relativement à la difficulté de pénétrer jusqu’aux sources secrètes du désordre qui règne dans une intelligence. Je n’ennuierai plus la Chambre par plus de citations d’autorités.\n\nUn DÉPUTÉ : Ecoutez, écoutez.\n\nM. GIROUARD : J’entends un député dire : “écoutez, écoutez.” Je pense qu’il mérite qu’on lui inflige un discours de six heures, mais j’ai trop d’égard pour le reste de la Chambre—bien qu’il puisse arriver que je n’en aie pas beaucoup pour lui—pour me permettre un discours de cette longueur. Je n’ennuierai pas la Chambre par la lecture du rapport des Drs Lavell, Valade et Jukes. Dans mon opinion, leurs conclusions sont que cet homme était fou. Les Drs Lavell et Valade ont dit qu’il souffrait de monomanie sur les questions religieuses et politiques. Est-il besoin de longs commentaires pour démontrer qu’il y a en relation entre la rébellion et la monomanie sur les questions politiques et religieuses ? Je considère l’autre partie des conclusions de ces médecins comme un simple sophisme, savoir : qu’à l’exception de ces deux points, la monomanie sur les questions religieuses et politiques, cet homme connaissait la différence qui existe entre le bien et le mal. Il n’est pas au pouvoir du médecin de témoigner de ce fait. Leurs attributions consistent seulement à déclarer la nature de la maladie dont l’individu souffre, et ils doivent laisser aux jurés, au tribunal ou au gouvernement, de décider, d’après cet énoncé, si le prisonnier connaissait la différence qui existe entre le bien et le mal en supposant qu’elle suffirait pour établir la santé d’esprit aux yeux de la loi. Le Dr Haslam, sur ce point, dit :\n\nIl n’est pas au pouvoir du médecin témoin de donner une opinion sur la faculté du prisonnier de distinguer le bien du mal. Il est du devoir du médecin, lorsqu’il est appelé à rendre témoignage devant une cour de justice, de déclarer s’il considère que la folie existe dans un cas quelconque, non de constater la quantité que possède ou ne possède pas la personne que l’on dit être folle. Il suffit, continue le Dr Haslam, que le médecin praticien sache que l’esprit de la personne est dérangé et qu’un tel état de folie sera suffisant pour expliquer l’irrégularité de ses actes.\n\nJe vais mettre fin à ces remarques, afin de donner plus de temps à d’autres députés qui désirent expliquer leur attitude. L’autre jour, j’ai entendu le ministre de l’intérieur dire que c’était une question de très peu d’importance que celle de savoir si des pétitions avaient été envoyées au gouvernement pour demander l’exercice du droit de grâce. Jamais je n’ai\nété aussi étonné que lorsque j'ai entendu dire que le gouvernement n'est pas tenu de considérer ces pétitions. Dans la plupart des cas, ces pétitions sont le seul mode qui puisse être adopté pour faire connaître au gouvernement le sentiment public qui existe à propos d'un cas particulier, afin de porter le gouvernement à exercer le droit de grâce. Le sentiment public qui prévalait dans toute la Confédération, au sujet du sort de cet infortuné, était-il en faveur de son exécution? On a cru, à un moment, qu'une corporation puissante usait de son influence pour demander le sang de Riel.\n\nQuand les documents ont été produits, nous n'avons vu, pour toute la Confédération, que trois pétitions demandant son exécution : l'une, des orangistes du district ouest de Toronto, et deux des citoyens de la Confédération demeurant à Regina et à Moosomin. Aucune autre personne n'a demandé la vie de cet homme ; mais, d'un autre côté, nous voyons, à la dernière page du rapport, qu'il y a eu 75 ou 100 pétitions demandant que sa vie fût épargnée, dans le cas où il ne recevrait pas un pardon entier. En ce qui me concerne, mes électeurs ont envoyé au gouvernement des pétitions, non pour demander un pardon, car, comme moi, ils ne croyaient pas que l'on dût donner la liberté à ce lunatique dangereux, mais pour demander une commission médicale, et par ce moyen une commutation. D'où venait le cri demandant que cet homme fût exécuté? On ne le trouve nulle part, ailleurs que dans les articles du Globe et chez les grits d'Ontario; mais depuis quand le gouvernement de ce pays doit-il se laisser conduire par le Globe et les grits d'Ontario? Pourquoi n'a-t-il pas suivi l'opinion publiée telle que représentée par le Mail et par ses propres amis et par les conservateurs de la province de Québec, ainsi que par les libéraux de cette province? Pourquoi a-t-il suivi l'idée du parti grit? Je ne puis pas le comprendre. Je dis que, vu l'expression d'opinion publique, aujourd'hui, en cette Chambre; quand nous voyons qu'une fraction importante du parti grit, au moins, a changé de sentiment, quand nous voyons que le Globe montre qu'il n'était pas sérieux lorsqu'il faisait des représentations demandant le sang de cet homme, il est parfaitement évident que toute l'opinion publique, dans la Confédération, était en faveur de la commutation de cette sentence, et je blâme le gouvernement de n'avoir pas compris ce sentiment public.\n\nMaintenant, avant de reprendre mon siège, je désire parler d'un énoncé fait à l'ouverture de la session par le très honorable premier ministre du pays. Il a déclaré que, lorsque le club Saint-George de Londres lui a donné un banquet, il\navait été obligé de témoigner de la loyauté des Canadiens français. Je suis sûr que plus d’un d’entre nous, en décembre dernier, a été surpris de voir que le premier ministre avait été placé dans cette position inexplicable.\n\nLe peuple anglais ne sait-il pas qu’un homme parlant une langue et professant une religion qui ne sont ni la langue ni la religion de la majorité du peuple anglais, qui vénère des institutions qui ne sont pas des institutions anglaises, peut cependant être loyal ? Voyez la France ; voyez l’Alsace et la Lorraine—la Lorraine Allemande. La France a-t-elle eu, dans toute la nation, une population plus loyale, bien que ces hommes fussent Allemands, qu’ils parlassent allemand, que bon nombre d’entre eux appartenissent à une religion différente de celle du peuple français ? Voyez la Grande-Bretagne elle-même ; regardez la population française des îles de la Manche, ces hommes ne sont-ils pas restés fidèles à leur langue ? N’aiment-ils pas leur langue, leurs lois et leurs institutions ; et l’Angleterre a-t-elle des sujets plus loyaux que les habitants de ces îles ?\n\nSi on prend les Écossais, les Irlandais et les Anglais, ne trouvons-nous pas des nationalités différentes et dans certains cas des lois locales différentes, et qui peut dire que ces diverses nationalités ne sont pas dévouées à l’Empire et à la couronne britannique ?\n\nViendra-t-on nous dire qu’en Angleterre on ignore l’histoire des Canadiens français ? On peut, peut-être, prétendre cela de certaines parties du continent européen, mais non pas de la Grande-Bretagne. Les Anglais savent aussi bien que nous qu’en 1776 les Canadiens français d’alors ont eu à combattre le général Lafayette et d’autres officiers français qui, quelques années auparavant, étaient dans l’armée canadienne.\n\nCes Canadiens français ont combattu pour le glorieux drapeau anglais que désertaient alors plusieurs des propres enfants de l’Angleterre. Rappeliez-vous de 1812. N’est-ce pas un Canadien français—le colonel de Salaberry—and trois cents braves, qui ont repoussé l’invasion américaine à Châteauguay ? Voyez même en 1837, qu’on nous citera comme un exemple de déloyauté. Nous n’avons pas été alors déloyaux envers la couronne britannique. Ce fut un soulèvement pour obtenir le redressement de griefs et contre un gouvernement canadien tyrannique. Nous combattions alors pour les privilèges du gouvernement responsable, et sans ce soulèvement je doute fort que nous eussions joui aussi tôt des avantages du gouvernement responsable.\n\nQu’on se rappelle aussi l’année 1865 ou 1866, lorsque le Canada fut menacé d’une invasion féniennes. Les Canadiens\nfrançais restèrent-ils en arrière de leurs concitoyens d'origines différentes ? Non ; ils étaient au premier rang, et je me rappelle très bien que mon honorable ami le député de Montréal-Est (M. Coursol) prit les armes pour défendre le drapeau canadien et les institutions britanniques. Voyons encore plus tard ; en 1869 et 1870. Il y a eu à cette époque dans le Nord-Ouest une révolte dont il a été souvent question dans le débat actuel. Alors comme en 1837 les métis français combattaient pour la liberté ; ils combattaient pour obtenir les avantages d'un gouvernement responsable, et contre la tyrannie du gouvernement canadien.\n\nDans ce discours de six heures que j'ai prononcé l'an dernier, j'ai dit, et cela n'a pas été contredit, que lorsque la révolte éclata, en 1869, le gouvernement n'avait pas l'ombre d'un droit dans le Nord-Ouest. En l'absence de toute autorité locale, ces hommes prirent le pouvoir en main pour assurer à la population ses libertés politiques. Pour cela nous avons aujourd'hui le témoignage de ceux même qui étaient alors les adversaires des métis—le témoignage d'un homme comme M. McArthur, un fonctionnaire de la compagnie de la baie d'Hudson qui fut lui-même à cette époque prisonnier de Riel—dans une conférence publique faite à Winnipeg, il déclare que c'est à la fermeté déployée par les métis en 1869-70, que le Manitoba doit de jouir des avantages du gouvernement responsable.\n\nEt l'an dernier, nos compatriotes ont-ils tiré de l'arrière ? Malgré tout ce qu'on a pu dire, je ne crois pas qu'on aille jusqu'à prétendre que les Canadiens français ne sont pas allés au Nord-Ouest pour défendre le drapeau et l'autorité de la Confédération ; si tous les volontaires Canadiens français n'ont pas vu le feu, il y a eu au moins deux compagnies qui sont allées à la poursuite de Gros-Ours, sous le commandement du colonel Strange, et cet officier a été le premier à déclarer qu'il n'avait jamais désiré avoir de meilleurs soldats.\n\nEn présence de tous ces faits, M. l'Orateur, je crois que sir Etienne P. Taché avait raison lorsqu'il disait que le dernier coup de canon tiré sur le continent américain pour la défense des droits de l'Angleterre, le serait par un Canadien français.\n\nComment se fait-il alors, que l'honorable premier ministre, parlant des affaires du Canada à un banquet offert par le club Saint-George, ait eu à défendre les Canadiens français des accusations lancées contre leur loyauté ? Cela est dû aux écrits de l'organe du parti conservateur dans la province d'Ontario, le Mail de Toronto, qui devait connaître mieux les\nCanadiens français. Ce journal important ne s'est pas contenté de nous dénoncer comme de mauvais partisans politiques, je l'aurais sans doute excusé d'agir ainsi, en présence des provocations qu'il avait reçues de certains journaux de la province de Québec ; mais lorsque le Mail nous appliqua l'épithète de rebelles, nous menacés d'une deuxième conquête, disant que cette fois il n'y aurait pas de traité de Paris, je dis qu'alors il aurait dû y avoir une protestation, non seulement de la part du premier ministre, mais de tous les membres du cabinet, pour faire voir que le Mail n'exprimait pas les opinions du parti conservateur dans la province d'Ontario.\n\nPourquoi nous menacer de l'abrogation du traité de Paris ? Je demande à la minorité anglaise de la province de Québec si elle a jamais souffert quelque mauvais traitement ou quelque injustice de notre part ? N'a-t-elle pas toujours obtenu pleine justice des Canadiens français ? S'il y en a un seul qui puisse dire le contraire, j'aimerais le voir se lever et le dire.\n\nNon, M. l'Orateur ; nous avons respecté les sentiments de la minorité anglaise de la province de Québec ; non seulement ses sentiments, mais même ses préjugés ; et comme nous occupons dans la Confédération la position qu'occupe la minorité anglaise dans la province de Québec, nous croyons être en droit de nous attendre à ce qu'on respectera nos sentiments et même nos préjugés.\n\nImprimerie MacLean, Roger et Cie., rue Wellington.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001453.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 28792, "total-output-tokens": 16062, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1631, 2], [1631, 4323, 3], [4323, 7024, 4], [7024, 9854, 5], [9854, 13120, 6], [13120, 16421, 7], [16421, 19151, 8], [19151, 21897, 9], [21897, 24667, 10], [24667, 27288, 11], [27288, 30280, 12], [30280, 32992, 13], [32992, 35684, 14], [35684, 38413, 15], [38413, 41167, 16], [41167, 44241, 17], [44241, 47016, 18], [47016, 49676, 19], [49676, 52306, 20], [52306, 54880, 21], [54880, 56343, 22]], "primary_language": ["None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]