[{"id": "2241b30761755628299b5b45a8c35c5d806bee87", "text": "IN THE CASE\n\nOF\n\nLOUIS RIEL,\n\nCONVICTED OF TREASON,\n\nAND\n\nEXECUTED THEREFOR.\n\nMEMORANDUM OF SIR ALEXANDER CAMPBELL.\n\nOTTAWA:\nPRINTED BY MACLEAN, ROGER & CO., WELLINGTON STREET,\n1885.\nOTTAWA, 26th November, 1885.\n\nMEMORANDUM respecting the case of The Queen v. Riel, prepared at the request of the Committee of the Privy Council.\n\nThe case of Louis Riel, convicted and executed for high treason, has excited unusual attention and interest, not merely in the Dominion of Canada but beyond its limits. Here it has been made the subject of party, religious, and national feeling and discussion; and elsewhere it has been regarded by some as a case in which, for the first time in this generation, what is assumed to have been a political crime only has been punished with death.\n\nThe opponents of the Government have asserted that the rebellion was provoked, if not justified, by their maladministration of the affairs of the North-West Territories, and inattention to the just claims of the half-breeds.\n\nWith this question, which has been made one of party politics, it is not thought becoming to deal here.\n\nUpon such a charge, when made in a constitutional manner, the Government will be responsible to the representatives of the people, and before them they will be prepared to meet and disprove it.\n\nAppeals to the animosities of race have been made in one of the Provinces with momentary success. Should these prevail, the future of the country must suffer. Parliament will not meet for some time, and in the interval, unless some action is taken to remove these animosities, they will gain ground, and it will become more difficult to dispel belief in the grounds which are used to provoke them.\n\nIt is thought right, therefore, that the true facts of the case, and the considerations which have influenced the Government, should be known, so that those who desire to judge of their conduct impartially, may have the information which is essential for that purpose.\n\nIt has been asserted that the trial was an unfair one, and before a tribunal not legally constituted; that the crime being one of rebellion and inspired by political motives, the sentence, according to modern custom and sentiment, should not have been carried out; and that the prisoner's state of mind was such as to relieve him from responsibility for his acts.\n\nAfter the most anxious consideration of each one of these grounds the Government have felt it impossible to give effect to any of them, and have deemed it their duty to let the law take its course.\n\nI am now desired, in a matter of such grave importance and responsibility, to place on record the considerations which have impelled them to this conclusion:\n\n1. As to the jurisdiction of the court and the fairness of the trial.\n\nIt should be sufficient to say that the legality of the tribunal by which he was tried has been affirmed by the Privy Council, the highest court in the Empire, and has seemed to them so clear that the eminent counsel who represented the prisoner could not advance arguments against it, which were thought even to require an answer.\n\nIt has been said that a jury composed of six only, and the absence of a grand jury, are features so inconsistent with the rights of British subjects that the prisoner had still ground of complaint; but, as was pointed out in the Privy Council, the same crime may be tried elsewhere in the British Empire, notably in India, without any jury, either grand or petty, and this mode of trial has been sanctioned by the Imperial Parliament.\n\nIt is to be observed also, that the offence was tried in the country in which it was committed, under the law as it then existed and had existed for years, and that this is a course of which no offender can fairly complain, while it is a right to which every criminal is entitled.\nOf the competency of the court, which had been affirmed by the full court in Manitoba, the Government saw no reason to entertain doubt; but having regard to the exceptional character of the case, the usual course was departed from in the prisoner's favour, and a respite was granted, to enable him to apply to the ultimate tribunal in England, and thus to take advantage to the very utmost of every right which the law could afford to him.\n\nThe fairness of the trial has not been disputed by the prisoner's counsel, nor challenged either before the Court of Appeal in Manitoba, or the Privy Council. It has, on the contrary, been admitted, not tacitly alone by this omission, but expressly and publicly. It may be well, however, to state shortly the facts, which show how the duty which the Government fully acknowledged both to the public and the prisoner has been fulfilled.\n\nIt was most desirable not only to ensure the impartial conduct of the trial, which would have been done by the appointment of any barrister of known standing, but to satisfy the public that this had been effected; and in view of this the prosecution was entrusted to two leading counsel in Ontario, known to be in sympathy with different political parties. With them was associated a French advocate of standing and ability in Quebec, and the personal presence and assistance of the Deputy Minister of Justice was given to them throughout the proceedings.\n\nThe procedure adopted and the course taken at the trial, to be now shortly stated, as it appears on the record, will show that every opportunity for the fullest defence was afforded; and it is needless to add, what is well known and recognised, that the prisoner was represented by counsel whose zeal and ability have made it impossible to suggest that his defence could in any hands have been more carefully or more ably conducted.\n\nThe charge was made against the prisoner on the 6th of July, 1885, and the trial was then fixed to take place on the 20th of that month, of which the prisoner was duly notified.\n\nOn the same day a copy of the charge, with a list of the jurors to be summoned and of the witnesses to be called, was duly served upon him, the Crown waiving the question whether this was a right which could be claimed, and desiring, as far as possible, to afford every privilege which, under any circumstances or before any tribunal, he could obtain, and which, consistently with the procedure otherwise prescribed in the Territory, could be granted to him.\n\nOn the day named the prisoner, having been arraigned, put in a plea to the jurisdiction, to which the Crown at once demurred, and this question was then argued at length. The grounds taken by the prisoner's counsel had been in effect decided unfavorably to their contention by the Court of Queen's Bench in Manitoba in a recent case, and the presiding judge held that it was therefore impossible for him to give effect to them.\n\nThis decision having been announced, the prisoner, by his counsel, then demurred to the information, which was alleged to be insufficient in form, and this demurrer having been argued, was also overruled.\n\nThe prisoner then pleaded not guilty, and his counsel applied for an adjournment until the next day; to enable them to prepare affidavits on which to apply for a further postponement of the trial; and, the Crown not objecting, the court adjourned.\n\nOn the following day, July the 21st, the prisoner's counsel read affidavits to the effect that certain witnesses not then present were necessary for the defence, and that medical experts on the question of insanity were required by them from the Province of Quebec and from Toronto. They represented that the prisoner had not had means to procure the attendance of these witnesses, and desired an adjournment for a month, during which they would be able to obtain it.\n\nIn answer to this application, of which the Crown had had no notice until the day previous, the Crown counsel pointed out that these medical witnesses, as well as some others in the North-West Territories who were wanted, could all be got within a week; and they offered, not only to consent to an adjournment for that time, but to join with the prisoner's counsel in procuring their attendance, and to pay their expenses.\nThe counsel for the prisoner accepted this offer, which the presiding judge said was a reasonable one; and the trial was adjourned until the 28th. In the meantime the witnesses were procured. They were present and were examined for the prisoner, and their expenses were paid by the Crown, the medical gentlemen being remunerated as experts at the same rate as those called for the prosecution. The other grounds which had been urged for delay were not further pressed.\n\nThe court met on the 28th. No further adjournment was asked for, and the trial proceeded continuously until it was concluded on the 1st of August. The exceptional privilege accorded to persons on trial for treason, of addressing the jury after their counsel, was allowed to the prisoner and taken advantage of.\n\nAs to the general character of the tribunal, and the ample opportunity afforded to the prisoner to make his full defence, it may be well to repeat here the observations of the learned Chief Justice of Manitoba in his judgment upon the appeal.\n\n\"A good deal,\" he remarked, \"has been said about the jury being composed of six only. There is no general law which says that a jury shall invariably consist of twelve, or of any particular number. In Manitoba, in civil cases, the jury is composed of twelve, but nine can find a verdict. In the North-West Territories Act, the Act itself declares that the jury shall consist of six, and this was the number of the jury in this instance. Would the Stipendiary Magistrate have been justified in impanelling twelve, when the Statute directs him to impanel six only? It was further complained that this power of life and death was too great to be entrusted to a Stipendiary Magistrate.\n\n\"What are the safeguards?\n\n\"The Stipendiary Magistrate must be a barrister of at least five years standing. There must be associated with him a Justice of the Peace and a jury of six. The court must be an open public court. The prisoner is allowed to make full answer and defence by counsel. Section 77 permits him to appeal to the Court of Queen's Bench in Manitoba, when the evidence is produced, and he is again heard by counsel, and three judges re-consider his case. Again, the evidence taken by the Stipendiary Magistrate, or that caused to be taken by him, must before the sentence is carried into effect, be forwarded to the Minister of Justice; and sub-section eight requires the Stipendiary Magistrate to postpone the execution from time to time, until such report is received, and the pleasure of the Governor thereon is communicated to the Lieutenant-Governor. Thus, before sentence is carried out the prisoner is heard twice in court, through counsel, and his case must have been considered in Council, and the pleasure of the Governor thereon communicated to the Lieutenant-Governor.\n\n\"It seems to me the law is not open to the charge of unduly or hastily confining the power in the tribunals before which the prisoner has been heard. The sentence, when the prisoner appeals, cannot be carried into effect until his case has been three times heard, in the manner above stated.\"\n\nThe evidence of the prisoner's guilt, both upon written documents signed by himself and by other testimony, was so conclusive that it was not disputed by his counsel. They contended, however, that he was not responsible for his acts, and rested their defence upon the ground of insanity.\n\nThe case was left to the jury in a very full charge, and the law, as regards the defence of insanity, clearly stated in a manner to which no exception was taken, either at the trial or in the Court of Queen's Bench of Manitoba, or before the Privy Council.\n\n2. With regard to the sanity of the prisoner and his responsibility in law for his acts, there has been much public discussion.\n\nHere again it should be sufficient to point out that this defence was expressly raised before the jury, the proper tribunal for its decision; that the propriety of their unanimous verdict was challenged before the full court in Manitoba, when the evidence was discussed at length and the verdict unanimously affirmed. Before the Privy Council no attempt was made to dispute the correctness of this decision.\n\nThe learned Chief Justice of Manitoba says in his judgment: \"I have carefully read the evidence and it appears to me that the jury could not reasonably have\n\"come to any other conclusion than the verdict of guilty. There is not only evi-\ndence to support the verdict, but it vastly preponderates.\"\n\nAnd again: \"I think the evidence upon the question of insanity shows that the\nprisoner did know that he was acting illegally, and that he was responsible for\nhis acts.\"\n\nMr. Justice Taylor's conclusion is: \"After a critical examination of the evidence,\nI find it impossible to come to any other conclusion than that at which the jury\narrived. The appellant is, beyond all doubt, a man of inordinate vanity, excitable,\nirritable, and impatient of contradiction. He seems to have at times acted in an\nextraordinary manner; to have said many strange things, and to have entertained,\nor at least professed to entertain, absurd views on religious and political subjects.\nBut it all stops far short of establishing such unsoundness of mind as would render\nhim irresponsible, not accountable for his actions. His course of conduct indeed\nshows, in many ways, that the whole of his apparently extraordinary conduct, his\nclaims to Divine inspiration and the prophetic character, was only part of a cunningly devised scheme to gain, and hold, influence and power over the simple-minded people around him, and to secure personal immunity in the event of his\never being called to account for his actions. He seems to have had in view, while\nprofessing to champion the interests of the Métis, the securing of pecuniary advance for himself.\"\n\nAnd he adds, after reviewing the evidence: \"Certainly the evidence entirely\nfails to relieve the appellant from responsibility for his conduct, if the rule laid\ndown by the judges in reply to a question put to them by the House of Lords in\nMacNaghten's case, 10 Cl. & Fin. 200, be the sound one.\"\n\nMr. Justice Killam says: \"I have read very carefully the report of the charge\nof the Magistrate, and it appears to have been so clearly put that the jury could\nhave no doubt of their duty in case they thought the prisoner insane when he\ncommitted the acts in question. They could not have listened to that charge\nwithout understanding fully that to bring in a verdict of guilty was to declare\nemphatically their disbelief in the insanity of the prisoner.\"\n\nAnd again: \"In my opinion, the evidence was such that the jury would not have\nbeen justified in any other verdict than that which they gave. *** I hesitate to add\nanything to the remarks of my brother Taylor upon the evidence on the question of\ninsanity. I have read over very carefully all the evidence that was laid before the\njury, and I could say nothing that would more fully express the opinions I have\nformed from its perusal than what is expressed by him. I agree with him also in\nsaying that the prisoner has been ably and zealously defended, and that nothing\nthat could assist his case appears to have been left untouched.\"\n\nThe organization and direction of such a movement is in itself irreconcilable with\nthis defence; and the admitted facts appear wholly to displace it. The prisoner, eight\nmonths before this rebellion broke out, was living in the United States, where he had\nbecome naturalized under their laws, and was occupied as a school teacher. He was\nsolicited to come, it is said, by a deputation of prominent men among the French\nhalf-breeds who went to him from the North-West Territories, and, after a conference,\nrequested him to return with them, and assist in obtaining certain rights which they\nclaimed from the Dominion Government, and the redress of certain alleged grievances. He arrived in the Territories in July, 1884, and for a period of eight months was\nactively engaged in discussing, both publicly and privately, the matters for which he\nhad come, addressing many public meetings upon them in a settlement composed of\nabout six hundred French and a larger number of English half-breeds, together with\nothers. The English half-breeds and other settlers observed his course, and saw\nreason to fear the outbreak which followed; but the suggestion of insanity never\noccurred, either to those who dreaded his influence in public matters over his race,\nand would have been glad to counteract it, or to the many hundreds who unhappily\nlistened to him and were guided by his evil counsels to their ruin.\n\nIf, up to the eve of the resort to arms, his sanity was open to question, it is unaccountable that no one, either among his followers or his opponents, should have called\npublic attention to it. If the Government had then attempted to place him under\nrestraint as a lunatic, it is believed that no one would have been found to justify their action, and that those who now assert him to have been irresponsible would have been loud and well warranted in their protest. It may be well also to call attention to the obvious inconsistency of those persons—not a few—who have urged the alleged mal-administration of the affairs of the North-West Territories by the Government as a ground for interfering with the sentence, without ceasing to insist upon the plea of insanity. The prisoner cannot have been entitled to consideration both as the patriotic representative of his race and an irresponsible lunatic. It may be asked, too, if the leader was insane, upon what fair ground those who were persuaded by and followed him could be held responsible; and if not, who could have been punished for crimes which so unquestionably called for it.\n\nIt has been urged, however, that his nature was excitable, and his mental balance uncertain; that as the agitation increased his natural disposition overcame him, and that the resort to violence was the result of over-wrought feeling, ending in insanity, for which he cannot fairly be held accountable—that, in short, he was overcome by events not foreseen or intended by him.\n\nA simple statement of the facts will show that this view is wholly without foundation; that throughout he controlled and created the events, and was the leader, not the follower; and that the resort to armed violence was designed and carried out by him deliberately, and with a premeditation which leaves no room whatever for this plea.\n\nThe first collision with the troops occurred at Duck Lake on the 26th of March, 1885.\n\nOn the 3rd of March previous the prisoner was at a meeting where there were about sixty of his followers, nearly all armed. He spoke at that meeting, and said that the police wanted to arrest him. \"But these,\" he said, \"are the real police,\" pointing to those present. On the 5th he told Charles Nolin that he had decided to induce the people to take up arms, and he had begun to speak to him of doing so as early as December previous.\n\nOn the 17th of March he said to Dr. G. Willoughby, sixty or seventy armed half-breeds being present, that they intended to strike a blow to assert their rights; and, pointing to the men, \"You see now I have my police. In one week that little Government police will be wiped out of existence.\" He added that the time had come when he was to rule this country or perish in the attempt, and that the rebellion of fifteen years ago (in which he had also been the leader) \"would not be a patch upon this one.\"\n\nTo Mr. Lash, whom, on the 18th of March, at the head of his armed followers, he arrested, he said that the rebellion had commenced, and they intended to fight until the whole of the Saskatchewan Valley was in their hands; that he had been waiting fifteen years, and at last his opportunity had come; and that he would give the police every opportunity to surrender, but if they did not do so there would be bloodshed.\n\nOn the same day he, with about fifty armed followers, came to the stores of the witnesses Kerr and Walters, and demanded the arms and ammunition, the removal of which he superintended.\n\nOn the 20th, he said to Thomas McKay that this was Major Crozier's last opportunity of averting bloodshed, and that, unless he surrendered Fort Carleton, an attack would be made that night.\n\nOn the 21st the prisoner sent a demand, written and signed by himself, to the same Major Crozier; then-in-command of the Mounted Police at Fort Carleton, demanding an unconditional surrender of the fort and of his force; and threatening a war of extermination on refusal. This demand was not presented as written, because his messenger who carried it, on conferring with Major Crozier's representative, saw that it would be peremptorily rejected.\n\nOn the 26th the prisoner, with a force of between three and four hundred armed men, proceeded to attack the police and the volunteers, on their way from Fort Carleton to Duck Lake, and he himself gave the command to fire, when nine men were killed.\n\nIt has been made a question which side fired first on this occasion, but Riel's own statement to Capt. Young was, that they were endeavoring to surround the\nGovernment force while Major Crozier was engaged in a parley with one of Riel's people; and that it was part of his plan to capture the police force, or some high Government official, in order to compel negotiations, has been stated by him to the Rev. Mr. Pitblado and to others, as well as to Capt. Young.\n\nFrom that time until the suppression of the rebellion by the taking of Batoche, on the 12th of May, he was the unquestioned leader of the movement. Being urged by Mr. Astley, after the second engagement, which took place at Fish Creek, to allow him to negotiate, he said to him, what he also repeated to the witness Ross, that they must have another victory first, when they would be able to make better terms with the Government; and to the end he remained, not merely in the ostensible, but in the actual control of the armed force, negotiating in that capacity with the commander of the troops, and with an authority never doubted by those who, being his prisoners, observed his conduct, or questioned by any one of those in arms under him.\n\nIt may be asserted with confidence that there never has been a rebellion more completely dependent upon one man; that had he at any moment so desired, it would have come to an end; and that had he been removed a day before the outbreak, it would, in all probability, never have occurred. A dispassionate perusal of the whole evidence will leave no room for doubt upon this point, and that this was his own opinion appears by his statement to Father André, to be presently referred to.\n\nFinally, under this head, as regards the mental state of the prisoner, after his trial and before execution, careful enquiry was made into this question by medical experts employed confidentially by the Government for that purpose, and nothing was elicited showing any change in his mental powers or casting any doubt upon his perfect knowledge of his crime, or justifying the idea that he had not such mental capacity as to know the nature and quality of the act for which he was convicted, as to know that the act was wrong, and as to be able to control his own conduct.\n\n3. It has been urged that the prisoner's crime was a political one, inspired by political motives alone; that a rebellion prompted only for the redress of alleged political grievances differs widely from an ordinary crime, and that, however erroneous may be the judgment of its leader, in endeavoring to redress the supposed wrongs of others, he is entitled, at least, to be regarded as unselfish, and as in his own view patriotic.\n\nThis ground has been most earnestly considered, but the Government has been unable to recognize in the prisoner a political offender only, or to see that upon the evidence there can be any doubt that his motives were mainly selfish. On the contrary, it seems plain that he was willing at any moment, for the sake of gain, to desert his deluded followers, and to abandon his efforts for the redress of their alleged grievances if, under cover of them, he could have obtained satisfaction for his own personal money demands.\n\nIt is believed that many who have espoused his cause and desired to avert from him the sentence which the law pronounced must have been ignorant of this fact, or cannot duly have considered its proper effect, for it seems incredible that any one knowing it could regard the prisoner as entitled to the character of a patriot, or adopt him as the representative of an honorable race.\n\nIt is to be remembered that the prisoner had left this country and gone to the United States, where he had become an American citizen. He was brought here, therefore, avowedly to represent the claims of others, although in his letter of acceptance to the delegates he mentioned his own grievances as enabling him to make common cause with them. It is clear, however, from the evidence of Dr. Willoughby and Mr. Astley, that from the beginning his own demand, which he himself claimed against the Government, was uppermost in his thoughts, and as early as December he attempted to make a direct bargain with the Government for its satisfaction.\n\nFather André was a witness called on behalf of the prisoner, and there can be no reason whatever to question the correctness of his statement. His evidence on cross-examination by Mr. Casgrain was as follows:—\n\"Q. I believe in the month of December, 1884, you had an interview with Riel and Nolin, with regard to a certain sum of money which the prisoner claimed from the Federal Government?\"\n\n\"A. Not with Nolin. Nolin was not present at the interview?\"\n\n\"Q. The prisoner was there?\"\n\n\"A. Yes.\"\n\n\"Q. Will you please state what the prisoner asked of the Federal Government?\"\n\n\"A. I had two interviews with the prisoner on that subject.\"\n\n\"Q. The prisoner claimed a certain indemnity from the Federal Government, didn't he?\"\n\n\"A. When the prisoner made his claim I was there with another gentleman, and he asked from the Government $100,000. We thought that was exorbitant, and the prisoner said 'Wait a little; I will take at once $35,000 cash.'\"\n\n\"Q. And on that condition the prisoner was to leave the country, if the Government gave him the $35,000?\"\n\n\"A. Yes, that was the condition he put.\"\n\n\"Q. When was this?\"\n\n\"A. This was on the 23rd December, 1884.\"\n\n\"Q. There was also another interview between you and the prisoner?\"\n\n\"A. There has been about twenty interviews between us.\"\n\n\"Q. He was always after you to ask you to use your influence with the Federal Government to obtain this indemnity?\"\n\n\"A. The first time he spoke of it was on the 12th December. He had never spoken a word about it before, and on the 23rd of December he spoke about it again.\"\n\n\"Q. He talked about it very frequently?\"\n\n\"A. On these two occasions only.\"\n\n\"Q. That was his great occupation?\"\n\n\"A. Yes, at those times.\"\n\n\"Q. Is it not true that the prisoner told you he himself was the half-breed question?\"\n\n\"A. He did not say so in express terms, but he conveyed that idea. He said: 'If I am satisfied, the half-breeds will be.' I must explain this. This objection was made to him, that even if the Government granted him the $35,000 the half-breed question would remain the same, and he said, in answer to that: 'If I am satisfied, the half-breeds will be.'\"\n\n\"Q. Is it not a fact he told you he would even accept a less sum than the $35,000?\"\n\n\"A. Yes. He said: 'Use all the influence you can; you may not get all that, but get all you can, and if you get less we will see.'\"\n\nThis evidence confirms that of Charles Nolin, a very prominent half-breed, at one time Minister of Agriculture in the Government of Manitoba, who had strongly sympathised with Riel and the movement, until armed rebellion became imminent, when he separated from him, and afterwards gave evidence for the Crown. This was his testimony:\n\n\"In the beginning of December, 1884, he began to show a desire to have money; he spoke to me about it first, I think.\"\n\n\"Q. How much did he say he wanted?\"\n\n\"A. The first time he spoke of money I think he said he wanted $10,000 or $15,000.\"\n\n\"Q. From whom would he get the money?\"\n\n\"A. The first time he spoke about it he did not know any particular plan to get it; at the same time, he told me that he wanted to claim an indemnity from the Canadian Government. He said that the Canadian Government owed him about $100,000, and then the question arose who the persons were whom he would have to talk to the Government about the indemnity. Some time after that the prisoner told me that he had an interview with Father André, and that he had made peace with the Church; that since his arrival in the country he had tried to separate the...\"\n\"people from the clergy; that until that time he was at open war almost with the\nclergy. He said that he went to the church with Father André, and in the presence\nof another priest and the Blessed Sacrament he had made peace, and said that he\nwould never again do anything against the clergy. Father André told him he\nwould use his influence with the Government to obtain for him $35,000. He said\nthat he would be contented with $35,000 then, and that he would settle with the\nGovernment himself for the balance of the $100,000. That agreement took place\nat Prince Albert. The agreement took place at St. Laurent, and then Father\nAndré went back to his mission at Prince Albert.\"\n\n\"Q. Before December were there meetings at which Riel spoke, and at which you\nwere present?\"\n\n\"A. Yes.\"\n\n\"Q. How many?\"\n\n\"A. Till the 24th February. I assisted at seven meetings, to the best of my\nknowledge.\"\n\n\"Q. Did the prisoner tell you what he would do if the Government paid him the\nindemnity in question?\"\n\n\"A. Yes.\"\n\n\"Q. What did he tell you?\"\n\n\"A. He said if he got the money he wanted from the Government, he said he\nwould go wherever the Government wished to send him. He had told that to\nFather André. If he was an embarrassment to the Government by remaining in\nthe North-West he would even go to the Province of Quebec. He said also that\nif he got the money he would go to the United States and start a paper, and raise\nthe other nationalities in the States. He said: 'Before the grass is that high in this\ncountry, you will see foreign armies in this country.' He said 'I will commence\nby destroying Manitoba, and then I will come and destroy the North-West and take\npossession of the North-West.'\"\n\nMuch has been made of the argument that the prisoner came here at the request\nof others, but for which he would have remained away, and that being here he\ndesired to return to the United States, and would have done so were it not for the\nurgency of those who had induced him to come. As to this, Charles Nolin swore as\nfollows:\n\n\"Q. Was there a meeting about that time, about the 8th or 24th of February?\"\n\n\"A. A meeting?\"\n\n\"Q. At which the prisoner spoke?\"\n\n\"A. There was a meeting on the 24th of February, when the prisoner was\npresent.\"\n\n\"Q. What took place at that meeting; did the prisoner say anything about his\ndeparting for the United States?\"\n\n\"A. Yes.\"\n\n\"Q. What did the prisoner tell you about that?\"\n\n\"A. He told me that it would be well to try and make it appear as if they\nwanted to stop him going to the States. Five or six persons were appointed to go\namong the people, and when Riel's going away was spoken about, the people were\nto say: 'No, No.' It was expected that Gagnon would be there, but he was not\nthere. Riel never had any intention of leaving the country.\"\n\n\"Q. Who instructed the people to do that?\"\n\n\"A. Riel suggested that himself.\"\n\n\"Q. Was that put in practice?\"\n\n\"A. Yes.\"\n\nThe Counsel for the other half-breeds who pleaded guilty also stated in court\nthat Riel had himself procured the request to him to come to this country; and\non two occasions in court these learned gentlemen most earnestly and indignantly\ndenounced the prisoner as one who had misled and deceived their clients, and to\nwhom all the misery and ruin which this unhappy rebellion had brought upon\nthem was to be attributed.\n\nBut if an unselfish desire could be credited to the prisoner to redress political\nwrongs even by armed rebellion, it would at least have been necessary to disprove\nthe charge which lies against him, that in his own mind the claims of humanity had no place, but that he was prepared to carry out his designs by bringing upon an offending people all the horrors of an Indian rising, with the outrages and atrocities which, as he knew full well, must inevitably accompany it. That this cannot be disproved, but that it is beyond all dispute true, the evidence makes plain.\n\nFrom the beginning, even before Duck Lake, he was found in company with Indians armed, and to the end he availed himself of their assistance.\n\nIn that engagement, the first occasion of bloodshed, according to the evidence of the witnesses Astley, Ross and William Tompkins, the Indians composed a large portion of his force—one-third, or thereabouts.\n\nIn a letter found in the camp of Poundmaker, an Indian Chief, in the prisoner's handwriting, and signed by him, after describing in most exaggerated language what is termed their victory at Duck Lake, it is said: \"Praise God for the success He has given us. Capture all the police you possibly can. Preserve their arms. Take Fort Battle, but save the provisions, munitions and arms. Send a detachment to us of at least one hundred men.\"\n\nIn a draft letter, also in his handwriting, and proved at the trial, addressed to the French and English Métis from Battle River to Fort Pitt, the following expressions are found:\n\n\"We will help you to take Fort Battle and Fort Pitt. * * * Try and have the news which we send to you conveyed as soon as possible to the Métis and Indians of Fort Pitt. Tell them to be on their guard; to prepare themselves for everything. * * * Take with you the Indians; gather them together everywhere. Take all the ammunition you can, in whatever stores they may be. Murmur, growl and threaten. Rouse up the Indians.\"\n\nOther evidence to the same effect was given at the trial, and it may be added that in the scouting reports and Orders in Council the active employment of Indians in carrying on hostilities clearly appears.\n\nIt could not be overlooked either, upon an application for executive clemency, that upon the trials of One Arrow, Poundmaker, White Cap and other Indians, it was apparent that they were excited to the acts of rebellion by the prisoner and his emissaries. Many of these Indians so incited and acting with him from the commencement were refugee Sioux from the United States, said to have been concerned in the Minnesota massacre and the Custer affair, and therefore of a most dangerous class.\n\nIt is to the credit of the Indian chiefs that their influence was used to prevent barbarity, but by individuals among them several cold-blooded, deliberate murders were committed, for which the perpetrators now lie under sentence of death. These crimes took place during the rebellion, and can be attributed only to the excitement arising out of it.\n\n4. Whether rebellion alone should be punished with death is a question upon which opinions may differ. Treason will probably ever remain what it always has been among civilized nations, the highest of all crimes; but each conviction for that offence must be treated and disposed of by the Executive Government upon its own merits, and with a full consideration of all the attendant circumstances. In this particular instance, it was a second offence and, as on the first occasion, accompanied by bloodshed under the direct and immediate order of the prisoner, and by the atrocity of attempting to incite an Indian warfare, the possible results of which the prisoner could and did thoroughly appreciate. In deciding upon the application for the commutation of the sentence passed upon the prisoner the Government were obliged to keep in view the need of exemplary and deterrent punishment for crime committed in a country situated in regard to settlement and population as are the North-West Territories; the isolation and defenceless position of the settlers already there; the horrors to which they would be exposed in the event of an Indian outbreak; the effect upon intending settlers of any weakness in the administration of the law; and the consequences which must follow in such a country if it came to be believed that such crimes as Riel's could be committed, without incurring the extreme penalty of the law, by any one who was either subject to delusions, or could lead people to believe that he was so subject. The crime of the\nprisoner was no constructive treason; it was accompanied by much bloodshed, inflicted by his own direct orders; and the Government have felt, upon a full and most earnest consideration of the case, that they would have been unworthy of the power with which they are entrusted by the whole people, and would have neglected their plain duty to all classes, had they interfered with the due execution of a sentence pronounced as the result of a just verdict, and sanctioned by a righteous law.\n\nA. CAMPBELL,\n\n(Minister of Justice during the proceedings against Riel.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001361.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 15, "total-input-tokens": 21634, "total-output-tokens": 8502, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 183, 3], [183, 183, 4], [183, 3815, 5], [3815, 8099, 6], [8099, 12443, 7], [12443, 16957, 8], [16957, 21243, 9], [21243, 25552, 10], [25552, 28881, 11], [28881, 32369, 12], [32369, 36759, 13], [36759, 37324, 14], [37324, 37324, 15]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]