[{"id": "deac1372b974f0372155bf36861aaecbcdce09f8", "text": "NORTHERN WATERS;\n\nA REPORT PRESENTED TO\n\nTHE WINNIPEG BOARD OF TRADE\n\nREGARDING THE\n\nHudson's Bay and Strait,\n\nBeing a Statement of their Resources in Minerals, Fisheries, Timber, Furs, Game and other products. Also Notes on the Navigation of these waters, together with Historical Events and Meteorological and Climatic Data.\n\nBY CHARLES N. BELL\nVice-President Manitoba Historical and Scientific Society.\n\nEntered according to Act of the Parliament of Canada, in the year One Thousand Eight Hundred and Eighty-four, by CHARLES NAPIER BELL, in the Office of the Minister of Agriculture.\n\nPublished by authority of the\n\nWINNIPEG BOARD OF TRADE.\n\nJAMES E. STEEN, PRINTER, WINNIPEG.\nERRATA.\n\nPage 8, line 18, read \"1684\" instead of \"1864.\"\nPage 11, line 25, read \"Ungava\" instead of \"Ungova.\"\nPage 47, line 6, read \"Dwina\" instead of \"Divina.\"\nOUR\n\nNORTHERN WATERS;\n\nA REPORT PRESENTED TO\n\nTHE WINNIPEG BOARD OF TRADE\n\nREGARDING THE\n\nHUDSON'S BAY AND STRAITS.\n\nBeing a Statement of their Resources in Minerals, Fisheries, Timber, Furs, Game and other products. Also Notes on the Navigation of these waters, together with Historical Events and Meteorological and Climatic Data.\n\nBy CHARLES N. BELL.\n\nPublished by authority of the\n\nWINNIPEG BOARD OF TRADE.\n\nJAMES E. STEELE, PRINTER, WINNIPEG.\nTo the\n\nPresident and Members of Winnipeg Board of Trade.\n\nGentlemen:\n\nAs requested by you some time ago, I have compiled and present herewith, what information I have been enabled to obtain regarding our Northern Waters.\n\nIn my leisure hours, at intervals during the past five years, I have as a matter of interest collected many books, reports, etc., bearing on this subject, and I have to say that every statement made in this report is supported by competent authorities, and when it is possible I give them as a reference.\n\nMy searches have been mainly historical, and with the view of making public something that is not within the reach of the mass of the people, owing to the rarity of the books and other causes.\n\nAll the quotations herein given are direct from the original works named.\n\nThe following is a partial list of authors quoted from:\n\nNorth-West.—Fox, 1635\nAccount of Countries adjoining to Hudson's Bay.—Arthur Dobbs, 1744\nA Voyage to Hudson's Bay.—Edward Killis, 1748\nA Voyage in Search of a North-West Passage, 1750\nThe Present State of Hudson's Bay.—Edward Umfreville, 1790\nA Journey to the Northern Ocean in 1769-72.—Samuel Hearne, 1796\nVoyage de la Perouse, 1798\nVoyage to Hudson's Bay.—Lt. Edward Chappelle, R.N., 1816\nVoyage to New Foundland, 1818\nParry's Second Arctic Voyage, 1843\nNarrative of Two Voyages to Hudson's Bay.—J. B. Nevins, M.D, 1847\nSmithsonian Institute Publications, 1854\nThe Physical Geography of the Sea.—M. T. Maury, LL.D., 1855\nBritish House of Commons Report on Hudson's Bay Company, 1857\nMcClintock Voyages, 1860\nAnnual Record of Science and Industry, 1872\nHind's Report of Navigation of Hudson's Bay, 1878\nHistory of Manitoba—Donald Gunn, 1880\nReport of Boundary Commission, 1880\nProceedings of the Royal Geographical Society, London, 1881\nOntario Boundary Papers, 1882\nEncyclopaedia Britannica,\nImmigration and Colonization Committees Reports, 1883\nMeteorological Reports.—Dominion Government, 1876—1883\nGeological Reports, 1879—1884\nMaps, letters, pamphlets, reports, interviews, etc., to date.\n\nYours, etc.,\n\nCHAS. N. BELL.\n\nWinnipeg, 16th February, 1884.\nOUR NORTHERN WATERS.\n\nDISCOVERY OF THE BAY.\n\nThe early discovery and occupation of the country in and about Hudson's Bay are, as in many other cases, shrouded in a good deal of obscurity. The British claim as the first discoverers of the whole coast of this part of North America, in the persons of John and Sebastian Cabot, about the year 1497; but it is contended on the other hand that their discoveries did not extend to the north of Newfoundland, which still retains the name they gave it. There appears to be only hearsay evidence of what they did, or where they went, told afterwards at second-hand to third parties.\n\nThe French claim discovery, in 1504, through fishermen of Brittany, and a British geographical work, published in 1671, with a map attached, fixes the scene of their operations at Hudson's Strait, but this claim does not seem to be well founded.\n\nThe first authentic account we have of the exploration of the Straits and Bay is that of Henry Hudson, who, on April 10th, 1610, sailed in the little Discoverie. He ventured through the long straits, discovered the great bay that bears his name, at once his monument and his grave. He and his men wintered in its southern extremity, and in coming north during the next summer, near the east coast, half way back to the Strait, he, his son, and seven of his men, in a mutiny, were put into a shallop and cut adrift, on Midsummer-day, 1611. He was never again seen.\n\nThe crew reached home with the Discoverie after the death of several of their number from sickness and wounds received in a fight with Eskimo, near Digges Islands, where they landed to shoot fowl for food, as they had been on the verge of starvation. People in England did not doubt but that Hudson had discovered the Northwest passage. It is not now known who had fitted out the expedition under Hudson, but the books of that date describe the company as certain worshipful merchants of London.\n\nThis same company immediately fitted out another expedition, consisting of two vessels, named the Resolution and the Discoverie, and the command was given to Capt. Thomas Button, \"a gentleman\nat that time in the service of Prince Henry, and who was afterwards knighted.\" He wintered in the Nelson River, 1612-13.\n\nOn Button's return in 1613, still another expedition was sent out in 1614, under the command of Capt. Gibbons, but he missed the entrance to the Strait, and returned the same year.\n\nAgain, in 1615, the same company, not discouraged by these repeated disappointments, fitted out the *Discovery*, a vessel of 55 tons, and gave the command to Capt. Robert Bylot, who had been in all the three expeditions of Hudson, Button and Gibbons. Bylot only penetrated to the Bay, and returned home. He went out the following year in the *Discovery* (which made the fifth voyage for that little vessel), but did not add anything to the stock of information already in the possession of his employers.\n\nNo further efforts were made until 1631, when Capt. Luke Fox entered the Bay and examined the north and west shores before arriving at the Nelson River, where he made some slight repairs to his vessel, the *Charles*, which was of 70 tons burden, and had a crew of twenty men, with two boys. Here Fox found the remains of the cross erected by Button, when he took possession of the land in the name of his Majesty the King of Great Britain, France and Ireland. Fox also erected a cross, which bore the inscription that it had been first raised by Sir Thos. Button, and was again raised by Luke Fox. He again put to sea, and on the 29th August fell in with the *Mary*, commanded by Capt. James, of Bristol, who was also in search of a Northwest passage, and had letters from his Majesty Charles the First to the Emperor of Japan.\n\nJames wanted Fox to winter at once in some river or bay, telling him that Sir Thos. Button \"tooke harbour the 14 of this instant.\" Fox answered, \"Quoth I, hee is no precedent for mee, I must paralell my poverty with poore Hudson, who tooke no harbour before the first of November.\"\n\nAfter the return of James, in 1632, all thoughts of a Northwest passage by way of Hudson's Bay seem to have been laid aside.\n\nIn 1632 peace was concluded between the English and French, and by the treaty of St. Germain-en-Laye, New France was relinquished to the French without any particular designation of its limits.\n\nThe provisions of the Treaty of 1632 seem to have been respected for a period of thirty-six years, when in 1668 the next English expedition entered the Bay, which was the first trading voyage ever made by British subjects, and which resulted in the\nformation of the Hudson's Bay Company, and the grant of the charter two years after. In saying that this was the first purely commercial enterprise of the British in Hudson's Bay it is to be understood that the previous enterprises were undertaken with the definite object alone of reaching the Pacific.\n\nIt has been claimed that in 1656 the first exclusively commercial sea voyage was made into Hudson's Bay by a Frenchman named Jean Bourdon, but this has been disproved.\n\nThe Englishmen, trading as above stated, in 1668, were induced to do so by two French Canadians, De Grozelier and Radisson, who having been already engaged in the trade of the Bay, and having failed in procuring from their own government certain privileges they desired, went to England, and induced some Englishmen to join them in the trading voyage of 1668, under command of Capt. Z. Gillam. This was the origin of the Hudson's Bay Company, and they immediately commenced to build forts and establish themselves in the trade, which occasioned a desultory warfare between the English and French traders for a number of years.\n\nHostilities continued until the Peace of Ryswick, in 1697, put a stop to the fighting, and at that date Fort Albany only was in the possession of the British and this position remained unchanged to the time of the Treaty of Utrecht in 1713, by which treaty the whole of the Hudson's Bay was ceded to the British.\n\nFor fifty years more the Hudson's Bay Company occupied only the posts on the coast in the Bay, and as in 1763, by the Treaty of Paris, the rest of Canada was ceded to Great Britain, the Company began to enter into the country towards the Red River, but it was not until 1774 that their first establishment was erected at Lake Winnipeg.\n\nIt is very easy to follow the business of the Company since 1735, and I have possession of the names of the vessels, with the dates of the arriving at and sailing from Moose Factory since then and up to 1883.\n\nThe same information is also published, covering like data at York Factory between 1789 and 1883, and which furnishes an excellent account of how trade has been carried on with perfect regularity.\n\nWith the exception of one occasion (1779), Moose Factory has been visited by a ship in every year since 1735.\n\nThis shows a very surprising state of regular navigation, and the truth of it cannot be gainsaid, for the list was kindly furnished by the Hudson's Bay Company's officials in London.\nDobb's Book (1744) extends this list of arrivals for some years further back (page 14). He gives account of establishment of Moose Factory in 1730.\n\nIt is amusing to read some of the wonderful stories given us through some of the daily papers relating to the discovery of the Bay, and which appear to be obtained from encyclopaedias. We are informed positively that Sebastian Cabot discovered Hudson's Bay, when there is really no foundation for the statement, but on the contrary, it is shown that it was impossible for him to have entered the Bay during the time he was on the coast of America.\n\nThe last edition of the Encyclopaedia Britannica, I find, has made the error of stating that \"Sir Thomas Butler commanded the Discovery in 1612.\" It was Sir Thomas Button, whom Fox knew, and wrote of twenty years after. Button named the islands at the east entrance of the Strait after himself, and they are known by that name to-day. A dozen of the old books speak of the knighting of Thomas Button on account of his discoveries.\n\nHUDSON'S BAY.\n\nThe Hudson's Bay is a great inland sea extending between the 51st and 63rd degrees of north latitude, and is about 1,000 miles in length by 600 in width, having an area of about 500,000 square miles. It drains an extent of country about 2,100 miles from east to west, and 1,500 miles from north to south, or an area of 3,000,000 square miles. Its western feeders issue from the Rocky Mountains, its eastern from Labrador, and its southern from a point far within the boundaries of the United States, where, indeed, from the same lake source, water flows south to the Gulf of Mexico. Even Lake Superior is nearly tapped to supply material for this great body of water, for the south-eastern watershed is close to Thunder Bay.\n\nThe southern end of James' Bay is in the same latitude as the south of England, so that seven degrees length, at least, of the Bay is in like latitude as from the English Channel to the north of Scotland.\n\nThe average depth of the Bay is about seventy fathoms according to Chappelle, who made extensive soundings; this depth is evenly distributed, and there is a singular freedom from shoals or dangerous reefs, and the approach to the west shore shows a level sandy bottom.\nOn the east side of the Bay, and extending nearly the whole way along the coast at a distance of a hundred miles from it, is a string of islands, The Sleepers, which, however, present an easy approach, the Moose Factory ship track being to the immediate west of these. The east coast has bold high shores, while the west and south shores are low, with nearly level land gradually rising as they extend inland.\n\nThe tides on the west side decrease from twelve or fifteen feet at York to nine or ten at Moose Factory, at the southern extremity of James' Bay. On the east coast the tides are still lower.\n\nSeveral large islands lie in the northern part of the Bay, amongst which are Marble, Mansfield (or Mansel, as the old works have it), and Southampton.\n\nOn Charlton Island, in James' Bay, several ships' crews have wintered, from the days of Capt. James, in 1632, to 1833 and 1873, the latter dates being those on which the ships of the Company remained there. The vessel which wintered there in 1873 arrived at Moose Factory, from London, on the 21st August.\n\nOther islands are: The Sleepers, Nastapoka, Hopewell, Long Island, Belanger's Island and Flint Island, which are about the lower and eastern side of the Bay.\n\nJAMES' BAY.\n\nJames' Bay begins at Cape Jones on the east side, and Cape Henrietta Maria on the west, and runs south about 360 miles, with an average breadth of about 150 miles. The Bay is named after Capt. James, who wintered there in 1632.\n\nThe waters being shallow and brackish, the ice forms to a greater thickness than farther north, and is also frozen farther out from the shore.\n\n\"For long distances out we found it only possible to land from a small boat at high tide. The southern and western shores of the Bay are very low and level, and the Bay itself is remarkably shallow with the exception of a channel down its centre. The water is brackish, and in many places is fit for drinking. Water is turbid, and in many places bottom is reached with an oar when out of sight of the shore in a small boat.\"*\n\n*Dr. Bell.\nThe trading schooner starts on her trips along the coast on June 1st, and is generally laid up by the middle of November; shore ice forming after that time prevents her running later, though James' Bay does not close at that time. (This is supplied by a gentleman who resided at Moose for seven years.)\n\nThe south end of James' Bay is distant from Michipicoton, Lake Superior, in a straight line, only 281 miles, and from Nepigon, via the Albany, 468 miles, of which 270 miles of the Albany River is said by Dr. Bell, who has surveyed it, to be, except in very low water, navigable by powerful steamers of light draught, leaving only 198 miles of land carriage to connect the waters of Lake Superior and James' Bay.\n\nThere are several Hudson's Bay Company posts or forts on the east, south and west shores of the Bay, amongst which are Albany, in 52°12' N. lat., 82°15' W. long.; Moose, 51°16' N. lat., 80°56' W. long. Rupert's House is on the east side.\n\nFort Albany has also been named Fort St. Anne and Fort Chechouan at different times. It was established in 1664. Fort Moose is also the site of the old French posts, Fort Monsoni and Fort St. Louis. It was built before 1686. Rupert House was at different times called Fort St. Charles and Fort St. Jacques, and was built by Capt. Z. Gillam, in 1668.\n\nHUDSON'S STRAIT AND ITS NAVIGATION.\n\nHudson's Strait is about 500 miles in length, and varies from 45 miles to 150 miles in breadth, having an average of about 100 miles. The two narrowest points in the Strait are between Cape Best of Resolution Island, and the Button Islands, at the eastern entrance; and opposite North Bluff, near the Savage Islands. Between Resolution Island and the mainland, and on the north side of the Strait, there is a wide passage of some 10 miles, called Gabriel Strait. Button Islands, on the south of the entrance, are at least 10 miles from the mainland of Labrador. There are, therefore, no less than three eastern entrances into Hudson's Strait, the first 10 miles in breadth between Resolution and the north shore; the second or main entrance, between Cape Best and the Button Islands, 45 miles in breadth; and lastly, the several channels lying between the islands on the coast of Labrador, of which four are marked on Captain\nBecher's chart, within a breadth of 10 miles. The steamers of the Company bound for Ungava Bay pass between the Button Islands and the mainland of Labrador. I will show that it is the general opinion of sailors that the entrance of the Strait once passed, the navigation becomes comparatively easy.\n\nAs the prevailing winds are from the north or north-west, it is most probable that Gabriel Strait will be the one for steamers to take, as they will by that means escape the ice driven by the winds through the main or south entrances. It is stated that sailing ships are not taken in that way because the currents are very strong, and the north shore being very high they are liable to be becalmed and thrown on the rocky shores.\n\nThe difficulty of effecting an entrance in the summer with sailing vessels arises from the drifting floe ice, and the following extract from a work written by Captain Becher, R. N., in 1842, will serve to illustrate this point:—\"George Best has given in his narrative of the voyage, a formal dissertation on the general features of the mistaken Straits of Frobisher, in which the proof that it was no other than Hudson Strait must be looked for. We have already accounted for the ship's having drifted down to the entrance of Hudson's Strait, and it appears that once within that entrance, the progress to the westward was comparatively easy\"—a circumstance also observed by Sir Edward Parry, who says:—\"We continue to gain a great deal of ground, the ebb tides obstructing us very little. Indeed, from the very entrance of Hudson's Strait, but more especially to the westward of the Lower Savage Islands, it was a matter of constant surprise to find our dull sailing ship make so much progress when beating against a fresh wind to the westward.\"\n\nDr. Nevins, in 1844, writes that being in a ship belonging to the Hudson's Bay Company, his experience was as follows:—\"Our consort, the Prince Albert, entered the Strait, whilst we, being further south, had been detained for four days by contrary winds and fog, during which we durst not attempt to enter it. There are no friendly lighthouses upon the rocks to warn ships of their dangers, they have to sail amongst icebergs and rocks which descend perpendicularly into one hundred fathoms of water.\"\n\nCapt. J. Tabor, of New Bedford, says:—\"The entrance to the Bay can be made from the 1st to the 15th of July. Steamers would have great advantages over sailing vessels, as they could steam inside of all obstructions from ice, water being bold close to shore, tides strong, say six to seven miles, but quite regular. No trouble\nabout coming out up to November 1st, and some seasons later. Nearly all the danger from ice at that time would be outside Resolution Island. There is about 30 feet rise and fall of the tide, and the currents are swift.\"\n\nCaptain St. Clair, of New Bedford, was of the opinion \"that a steamer could go in by July 1st, and come out as late as in 1878, in which year the ice did not make its appearance until November 12th.\"\n\nCapt. E. B. Fisher, who whaled in Hudson's Bay for sixteen years, remarks:—\"A steamship can enter and go through the Strait some ten days sooner than a sailing vessel, say by 1st July, and might, some seasons, sooner. Whalesmen never had any trouble in coming out, as they leave as soon as the summer whaling is over, and are always out by November 1st. The only trouble is in Hudson's Strait, and that is caused by the ice coming down from Fox Channel and lodging amongst the islands in the Straits, blocking up the narrowest part, which is midway of its length. A steamer could crawl out by keeping close to the rocks inside of the ice, as there is always open water more or less between the rocks and the great body of ice.\"\n\nDr. Bell was a passenger on the Ocean Nymph, which on her voyage to London was in the Strait from the 19th September to the 9th October. The weather was so fine during most of the time occupied in passing from the Bay to the Atlantic, that the Bishop of Moosonee, who was on board, held divine service on the open deck on each of the three successive Sundays. They saw some ice, but none of it would have hindered a steamer in the slightest degree, the captain remarked, when about half way through the Strait, that if he had had a steamer he would then have been in London. The vessel was delayed, principally by her bad sailing qualities, and yet she had been making regular voyages for many years. Her first voyage to York appears to have been in 1864.\n\nSoundings made at several places showed no bottom at 150 fathoms, and in the centre it often exceeds 300 fathoms. It is particularly deep along the north shore, the land rising in places to at least 1,000 feet in height.\n\n\"From all I could learn or observe, there appears reason to believe that the Strait and Bay can be navigated and the land approached by steamships during an average of over four months each year, or from the middle of June to the end of October. The Strait and Bay might, perhaps be navigated by steam vessels earlier\nthan the middle of June, but nothing would be gained, except by whalers, in going out before an open harbor could be reached.\"*\n\nDr. Bell again refers to the established fact that the Hayes River, at York Factory, is open for an average of six months each year.\n\nNelson River is open for a longer period; and the tidal portion can scarcely be said to set at any time. During the winter of 1880-1 the river did not freeze across at all for some forty miles above tide water.\n\n\"It is probable that during the whole winter, from October to March, there is no ice in the Strait to obstruct their passage into or out of the Bay; for a ship which chanced to be closed up with ice in an inlet, by the breaking of the ice got out, and came through the Strait at Christmas without finding any ice in the Strait to prevent her passage. The greatest danger and delay from the ice is in the entrance into the Strait for the first 40 leagues, from thence the quantity is less, and they pass on with less difficulty, and after getting into the Bay the northwest side is freest from ice. Since, therefore, the greatest danger from the ice is in passing the Strait, and so few accidents have happened in so many years, the navigation, I think, cannot be called dangerous, though it has been generally so apprehended.\"\n\nCapt. Wm. Kennedy, of this Province, who commanded an Arctic expedition in search of the remains of Sir John Franklin, in 1850, writes me as follows:—\"A residence of eight years on the shores of Ungava Bay and its vicinity enables me to state that for four months, viz.: July, August, September and October, there is no difficulty in the navigation, and I believe that steamers might get through as early as June and as late as November. The Strait ice is never fast, and it keeps forming and breaking from shore during the winter months, covering it with moving ice more or less compact. In 1825, I was about a week passing through the Strait, in September, on the Prince of Wales, and it was then perfectly free from ice.\"\n\nCapt. Bishop, now commanding the Hudson Bay Company's vessel, the Prince of Wales, writes under date of 18th of March, 1881:—\"My average passage from the entrance of the Strait to the head of the same has been about fifteen days, and about twelve days from thence to Moose, or in going to York about nine days.\"\n\n* Dr. Bell's Report, 1880. † Dobbs, page 69.\nOne cannot have a very high opinion of the sailing qualities of the *Prince of Wales*, the distance from Mansfield Island to York being 570 miles, and the time consumed in covering it averaging nine days, shows an average day's sail to be 63 miles, or about 2½ miles per hour, with deep water and no danger from shoals.\n\nCapt. Bishop's average time home from York for the thirty-three voyages he has made was a little over four weeks. He is of opinion that the beginning of August is early enough for a vessel to attempt entering Hudson's Strait, wherein he differs from five American whaling captains whose opinions are quoted, for they agree that vessels can enter by the 1st of July. Capt. St. Clair, of New Bedford, said he had entered the Bay on the 13th of June, 1877, and the captain of the *Abbie Bradford* left New Bedford, May 8th, 1878, and began whaling in Hudson's Bay on the 20th July, having that day \"spoke with the bark *Nile*, boiling out their third whale of that season.\"\n\nCaptain McPherson, of the Hudson Bay Company's ship, *Ocean Nymph*, is of the same opinion as Capt. Bishop regarding the 1st of August being early enough for vessels to try to enter Hudson's Strait, and as he has made a great many voyages his opinion is well worth noticing. Of course, both Captains Bishop and McPherson speak of sailing vessels, and their statements must be viewed in that light.\n\nMany of the log books of the Company's vessels have been placed in the hands of the Dominion Government, and it is likely that valuable information will be had from them, and it must be observed that the Company have certainly during late years placed every means available in the hands of the Government officials to assist them in getting at the true position of affairs at the Bay. This is specially mentioned by Prof. Bell in the reports of his work about the Bay, and his voyage to London on their vessel.\n\n\"* * * For that it hath been alwayes said that the north side was clerest from ice.\"*\n\n\"I doe thinke that all this time of our imprisonment this north shore hath beene free, this fayre dayes west wind blew cold and uncouth from out the passage, wee are all upon kinde tearmes, drinking one to another: God hold it.\"\n\n\"As the Straits, then, are never frozen over, nor always unnavigable, even when there is much ice in the Bay, I imagine that a safe\n\n* Fox, page 185. † Fox, page 190.\npassage may often be found in the beginning of June, for the ice enters the Straits at intervals, according as it breaks off, and as the wind and current drive it out of the Bay; so the wind may keep the ice back at this season as well as any other. Besides, the ice at the bottom of the Bay, and the north and west ice, will not have had time to reach the Strait; but after June all the bay ice, commonly reaches it. The beginning of June, therefore, seems to be the likeliest time in which to expect a free passage.*\n\n\"As to the dreams of the last age, about the danger and difficulty of the navigation through Hudson's Strait and Bay, it is now out of the case; we know that this navigation is far from being so perilous as it is represented.\"†\n\n\"This is the more manifest from a fact, the truth of which is indisputable, and that is, the Hudson Bay Company ships, returning year after year without any disaster.\"‡\n\nCapt. Ellis wrote the above in 1748, after returning from a voyage of two years to Hudson's Bay when he had acted as agent of the proprietors of the two vessels Dobbs Galley and California. Part of the instructions he had received was: \"In your passage through the Strait, keep nearest the north shore, until you pass the Savage Islands.\"\n\n\"At the entrance of the Bay is Salisbury Isle, and to the northward of it Nottingham Isle, northwest of which lie Mill Isles in lat. 64°.20', long. 80°.30'. At the entrance of the Bay, fourteen leagues west from Cape Digges (which is on the south side of the Strait in lat. 62°.42', long. 77°.45') is Mansils Island (Mansfield), which is twenty leagues long.\" Mansils Island is called after Sir Robert Mansils.§\n\nThe course taken by the Ocean Nymph in 1880, from York, was north of Mansfield Island, then between Nottingham and Digges and north of Charles Island.\n\nMr. Archibald, who lived seven years about the Bay, says:—\n\n\"There is little doubt that the channel on the southeast side of Mansfield Island, is deep and safe enough for vessels, and always free from the blocks of ice which the set of the tide carries into the north channel. But the Company's vessel save no charts of the passage, and so they never attempt to go through it.\"\n\nThere are several openings into Hudson's Bay besides Hudson's Strait, and they are described by Dr. Bell in the following words:—\n\n* Robson, page 58. † Ellis, page xvii. ‡ Ellis, page 282. § Fox, page 198.\n\"For example, Fox Channel is the main entrance from the northward. This channel divides into two at the Archipelago, formerly called Southampton Island, but proved to be a number of islands. The one in the west is called Rowe's Welcome, and that in the east Fox's Channel, which enters into Fury and Hecla Straits and others to the northward, and the Gulf of Boothia, still farther north.\"\n\nSir Edward Parry, when on his second voyage in search of a northwest passage, says that on the 1st of December, in a bay of Fox Channel, where he wintered, while none of the \"old ice\" was visible, that part of the sea about them was covered with a very thin sheet of young ice, having spaces of clear water. In June of the following year the ice in their wintering bay, where they sawed it, was four feet, and that on that date a good deal of ice was still attached to the land.\n\nAs the ice from Fox Channel affords the bulk of what passes through Hudson's Strait, it is important to know from an eminent authority like Parry that as late as June the ice still remained attached to the shore, for it is evident that, if it is there, it cannot be at the same time bothering ships in the Strait, and it points out, what many men who have been through the Strait early in June have insisted on, that the month of July is the worst of the whole year for entering the Strait, but the floe ice, being more affected by winds than bergs, is acted on by the prevailing northern and northwestern winds, as well as the southerly setting currents, and we find in consequence, that in the words of Captain E. B. Fisher, who had sixteen years experience of whaling into the Bay since 1850, \"there is always open water between the rocks and the great body of ice,\" on the north side.\n\nThe tides in Hudson's Strait rise from 30 feet to 40 feet, and run about six or seven miles an hour, and at every turn, where there is ice, many authorities say that much breaking up occurs, and that steamers could take advantage of this while sailing vessels are at a stand-still, if the wind is ahead and blew anyway fresh. As the winds are in July and August generally \"ahead\" to vessels entering the Strait it is seen why sailing vessels are so delayed.\n\nParry says the ice of one winter's formation was ascertained to be in June, about four feet thick, so that we can have some idea of the floe ice which passes through the Strait, but as Fox enters minutely into that question it is perhaps better to take his statement respecting it. He says that he saw a few bergs the size of \"a church.\"\nwhich he had no trouble in evading, and that the floe ice was seen as thick as eight or ten feet.\n\nRobson gives us a very interesting account of a naval engagement in the Strait between five French men-of-war and H.M.S. Hampshire, convoying two Hudson's Bay Company's ships, none of the vessels were destroyed, as they got into ice and were separated. They again met in the Bay and continued the fight, when H.M.S. Hampshire \"was by some unlucky accident overset,\" and her crew perished. During a storm the following night two of the French ships were driven on shore and lost.\n\nIt is found on investigation that fully 750 vessels have passed through Hudson's Strait, and this does not cover, it is known, the whole number. The list includes British troop-ships, emigrant ships, war vessels of the English and French (some of them carrying 74 guns), as well as ships bound on voyages of discovery, trade and whaling. As early as 1619, Capt. John Munck was sent by the King of Denmark, and he wintered at Churchill, a brass gun of his being taken out of the river some time about the date of the appearance of Fox in that harbor.\n\nDr. Bell obtained from the Company's offices, in London, a record, which, printed in his report, shows the date of arriving and sailing of their vessels at York Factory for 93 years, and at Moose Fort for 147 years. These lists show that in some years several vessels were sent in charge of British men-of-war, and there has been, almost every year during the past two centuries, ships of various classes and sizes, navigating the Strait without loss, and it seems almost incredible that such a number of voyages could be made, extending over 274 years without the loss of over one, or as is claimed by some writers, two small sailing vessels.\n\nIt is said that the two vessels lost were chartered ships of the Hudson's Bay Company, and they met with mishaps in the ice. They were the bark Grahame, in 1852, and the bark Kitty, about 1850. The latter foundered in the middle of the Strait off Saddle Back Island.\n\nIt is impossible to reconcile this record of 274 years with the wild and unfounded statements of interested persons or uninformed terrorists.\n\nIt is but a comparatively short time since it was claimed that it would be impossible to navigate the St. Lawrence with steamships, and, indeed, several steamers were lost in proving that it would be possible for an immense fleet to pass up to Montreal during each summer.\nMany references might be made to the length of time vessels take in passing through the Strait in either direction, but sailing ships, and they for the most part, from their build, very bad sailers, consume most of the time waiting for fair winds, which, in sailing west, are very few and far between. If they encounter ice that would not be taken any notice of by steamers, sailing ships must have fair winds, or they have to \"ice-anchor\" in the lee of a large \"floe\" and bide their time. I have copies of several log books of American whalers, which show that the out trip was made in the autumn, as follows:\n\n| Ship          | Year | Days |\n|---------------|------|------|\n| Northern Light | 1862 | 7    |\n| Andrews       | 1863 | 7    |\n| Ansel Gibbs   | 1864 | 3    |\n|               | 1868 | 8    |\n\nH. M. S. Rosamond returned through the Strait from the Bay in October, 1824, in three days, when they had been 25 days going in, and Chappelle shows the daily log, giving the cause of delay to be the light or contrary winds and the other troubles which a sailing vessel experiences in these waters when there is any ice, even in such quantities as are unnoticed by steamers.\n\nDr. Bell was nineteen days passing through the Strait, on the Ocean Nymph belonging to the Hudson's Bay Company, and they were not delayed by ice, but by calms and contrary winds that would not have delayed in any way a steamer in her thirty-six or, at most, forty-eight hour passage through the Strait.\n\nCapt. Bishop, of the Hudson's Bay Company's Prince of Wales, gives as his average time in passing through the Strait, going out to York, fifteen days, and the American whalers give about the same, the latter adding, however, that \"steamers would have great advantages over sailing vessels, as they could steam inside all obstructions from icy water being bold close in shore.\"\n\nProf. Hind has made a study of the geography and character of the navigation of Hudson's Straits and Bay, and I copy the conclusions he has arrived at:\n\n1st. The season on the coast of northern Labrador, south of Hudson's Strait is from six weeks to two months later than the season on the coast of Hudson's Bay at and for some distance north of Port Nelson. This is established by the testimony adduced in relation to the approach of fish to the shore, wholly apart from other considerations.\n\n2nd. The only hindrance to an entrance into and through Hudson's Strait early in June, arises from the obstructions presented by the\ntwo ice streams coming from East Greenland and Baffin's Bay, down the west coast of Davis Strait. It is reasonable to suppose that these ice streams are less encountered late in May or early in June than in July.\n\n3rd. The Strait once entered the chief difficulty is over, and if entered before the ice comes down as alleged from Hudson's Bay, Bluff Head may be reached and a new departure taken, as suggested by the authorities quoted.\n\n4th. It is doubtful whether the northern portion of the Bay ever freezes more than \"several miles\" from the shore, and it remains to be seen whether much, or indeed any ice does come out of Hudson's Bay. It is probable that the ice spoken of as coming from the Bay, really comes down Fox Channel, as shown by the drift of H.M.S. Terror, represented on the accompanying admiralty chart.\n\nThere are two reasons for supposing that very little ice comes from Hudson's Bay; the first is, it would imply the constant occurrence of strong southerly winds and a considerable space of time to carry the ice from so large a surface as Hudson's Bay through the confined channels leading into Hudson's Straits, and experience teaches that ice is rarely met with after passing Charles Island, except towards the centre of the Bay. Moreover, from the description of the ice met in Hudson's Strait, it is largely composed of hummocky, or heavy Arctic ice, which comes down Fox Channel from the north. It is more probable that the Hudson's Bay ice melts and disappears within the limits of the Bay itself. The second reason is that the early opening of the ice on the west coast of the Bay, admitting the salmon and codlin to the shores in the latter part of June, even so far north as Churchill, and six weeks before the northern Labrador is free from coast ice, appears to show that local dissolution is the chief, if not the only cause of the disappearance of the bay ice, and its remnant is occasionally found in the eddy near the centre of the Bay in July. If the bay ice found its way into Hudson's Strait these would be most liable to be blocked up between Mansfield and Digges Islands, but this part is represented to be always clear.\n\nIt may, with great propriety be asked: Why should a patch be found near the centre of the Bay? If the ice drifts out into the Strait, would not the ice under such circumstances be found near Mansfield Island instead of at the centre of the Bay? Why does the central patch not follow the stream?\n\nIn a tideway, when the tides rise at neaps 30, and at springs 40 feet, and when the daily swing of the tides is from 12 to 20 miles,\ncarrying ice backward and forward through that space twice every day, fresh channels are constantly opening, which a steamer can avail herself of, but which are useless to a sailing vessel, except with a fair wind.\n\nHence the greater reason for adopting the suggestion of Lieut. Chappelle, and entering Hudson's Strait early in June, before the Arctic ice in Fox Channel comes down, as shown by the drift of H. M. S. Terror.\n\nUmfreville, who, while in the service of the Hudson's Bay Company from 1771 to 1782, lived at the different forts about the Bay, wrote:—\"If it be objected to this, that the vast quantities of ice in the Straits must impede a vessel; I answer that many years the ice is so insignificant in quantity as not to obstruct the passage of the ships in the least, and in those seasons when it is thickest, it is dissolved and dispersed in the ocean long before the return of the ships in September.\"*\n\nI sent, through Mayor Logan, to the Mayor of New Bedford, Mass., a list of questions I desired answers to, and he kindly responded and says that the following are given by reliable men, who have whaled in Hudson's Bay.\n\n\"Ice is generally met with before reaching Resolution Island, at the eastern entrance to the Strait, and is seen at intervals from there to Mansfield Island, at the western end. Whalers are said to come from Fox Channel into the Bay, but no one knows how many whalers winter in the Bay. They never experience trouble from floating ice in the north of the Bay. The course in is on either side of Mansfield Island, after hugging the north side of the Strait. They do not know if the Strait ever freezes over, as they winter in latitude 65°30' N. in the Bay. The ice on an average freezes for three and sometimes four miles from the shore. A steamer would have the advantage of being able to pass through ice that will hold a sailing ship fast. Steamers could find open water on a passage through the Strait from July 15th to November 1st.\"\n\n\"Ships do well, therefore, to keep to the northward, until they reach the latitude of Cape Resolution; and when that is attained, they may haul in N.W., and keep close in to the north shore; thus making a semi-circle round the ice.\"†\n\nSir Edward Parry states that, \"the effects to be apprehended from exposure to the swell of the main ocean constitute the peculiar\n\n* Umfreville, page 99\n† Chappelle, page 47.\ndanger of first entering the ice about the mouth of Hudson's Strait, which is completely open to the whole Atlantic.\"\n\nCapt. Hackland says there is a choppy sea at the eastern entrance of the Strait, caused by the tide and north-west winds meeting the swell of the Atlantic. The ice is thrown into violent commotion.\n\nCapt. Middleton says:—\"All along the coast of Hudson's Strait the land is very high and bold, and a hundred fathoms or more close to shore.\"*\n\n\"In our passage from Resolution to the Upper Savage Islands, we met with little ice to obstruct us.\"†\n\nCapt. Hackland, now living at Headingly, Manitoba, who was sixteen years in command of the Company's vessels in the Bay and Strait, says that the water is deep and sure along the north side of the Strait, the ice there met with being small in quantity and passable, the north winds and currents carrying it down to and along the south side. There is plenty of water for vessels in the entrance between Resolution Island and the North Mainland.\n\nLieut. Chappelle states as a reason for selecting the northern passage close to Resolution Islands:—\"That entering Hudson's Strait, it is a necessary precaution to keep close in with the northern shore, as the currents out of the Hudson's and Davis' Straits meet on the south side of the entrance, and carry the ice with great velocity to the southward, along the coast of Labrador.\"‡\n\nSome very wild statements have lately been made by enthusiastic persons who allow their enthusiasm to run away with their judgment about the perfect freedom from ice enjoyed by the Strait. They have, they say, been told by employees of the Hudson's Bay Company that there is very little ice to be seen there. Several of the Company's people, with whom I have conversed, and who are well informed, say that as a rule the employees have but a limited and local knowledge regarding the Bay, and their experience in the Straits is confined to perhaps one passage through it. These wild statements show on their face that they are absurd, and I have taken great care in this report to give only the statements of good authorities, and none of the hearsay.\n\nPlenty of ice is met with in Hudson's Strait as a general thing during the month of July, though some years the quantity is small, and Capt. Bishop states that out of twenty-three voyages that he\n\n* Ellis, page 127; † page 131. ‡ Chappelle, page 40.\nmade only on six did he find perfectly open water and clear sailing on his way into the Bay.\n\nIt is unnecessary here again to state that steamers would pass with ease through the general run of ice met with in the Strait, which effectually stops a sailing vessel, for I have under different headings shown that this is the deliberate statement of several whaling and other captains. It is simply wasting breath for people who have not actually seen the ice of the Strait to say just what can be done in it by steamers. The value of an opinion on this subject is to be measured by the person it comes from, and that is why I simply state what practical sailors who have been there have to say about it.\n\nHUDSON'S BAY OPEN.\n\nRegarding the season of open water in the Bay, it is important to know that all the evidence advanced proves that it is, as might be expected, from its great size and position, open the whole year, and is in that respect so much superior to the lower part of the St. Lawrence River.\n\nWe have very satisfactory statements on this point, and as a sample of the number, I quote in full what was brought out by the Committee of the House of Commons, at Ottawa, in April, 1883.\n\nIn answer to the question, \"Have you the dates of the opening and closing of navigation of Hudson's Bay?\" Dr. Bell, of the Geological survey of Canada, who has spent six seasons about the Hudson's Bay, testified as follows:—\"In regard to the Bay itself there is no date for the opening or closing of navigation, because the Bay is open all the year round, like the ocean in corresponding latitudes.\" It is strictly correct to say that the Bay is open during the winter, because, although in the shallow water at the head of James' Bay, a narrow margin of ice forms, it does not extend outwards, and is due to the land-locked nature of the Bay and the shallowness and freshness of the water. Further north there is a margin of ice along the shallow water, but it never extends so far but a man on the beach can see the fog on the open water on a clear morning. On parts of the eastern coast, I am told, the sea washes against the rocks all the winter, just the same as on the coast of Nova Scotia or Newfoundland.\"\nDr. Bell also says that the fact that the ice forms along the shores would only interfere with the navigation of the Bay, in that vessels could not get into the harbors longer than in the Gulf of St. Lawrence.\n\nThe rivers falling into the Bay are open for an average of six months. This is amply proved by the records kept at the various posts of the Hudson's Bay Company, on the Bay, and which, being kept by the officials for over fifty years, have been presented to the Canadian Government. We have, therefore, undeniable data to substantiate this fact, and even further that the Nelson River is open still longer. Dobbs, writing in 1744, gives a number of dates of the opening of James' Bay, and I may mention one, given on page 13: There was no frost on the 24th October to freeze the fish they caught, and they had to stop fishing on that account. On the 28th October ice showed in the river and the geese began to leave. November 13th the river (Albany) was full of heavy ice, and on the 18th November it froze over but the weather was \"still moderate.\" In the following spring (1731) the ice was gone to sea May 12th. November 10th, 1731, the Albany River was frozen over. Dobbs here closes with the remark, \"So far goes this journal.\"\n\nFrom the statement of Capt. Middleton, who was in command of one of the Company's vessels in 1741, and wintered at Churchill; the weather was very severe, they had snow on the 1st September, and crossed the river on the ice eight miles above the fort on October 9th. The river froze fast at the entrance on the 12th November. In the spring \"the ice without the harbor is drove to sea\" on the 20th April. The tide rose 10 feet 3 inches, and a goose was killed 28th April.*\n\nDobbs answered the objection that there is dangerous navigation in the Bay in these words: \"The navigation is not so dangerous as it is apprehended to be, but appears to be more so by the insinuations and reports, given out in order to deter others from venturing and interfering in the trade. Captain Middleton made twenty voyages to different parts of the Bay and never lost a ship nor had any accident in these voyages. Where captains are careful in the ice, there is not much danger. It is of great advantage to them that there is no night at that season they enter the Bay, when the quantity of ice is the greatest; and when they return in September or even in October, all the ice is dissolved or passed out. The ice\n\n* Dobbs, page 16.\nthat is formed in bays and rivers in winter does not break up until it begins to thaw upon the shores in March and April. Yet even then good pilots know how to avoid it, and get into the eddy tide, out of the current, where the ice is more open; but these difficulties would lessen every day, if the trade were opened.\"\n\nThis was written in the year 1744, and Mr. Dobbs' statements have been followed by others of like tenor during the 140 years following.\n\nDr. Bell informed the House of Commons Committee, in 1883, in answer to a question, that the temperature of Lake Superior, below the immediate surface, is 39° Fahr.; along the east shore of Hudson's Bay, it averaged 53° in the summer months, according to the observations he made in 1877. He spoke of the summer alone, and it was so warm that they bathed in it with more comfort than they could in the water of the Gulf of St. Lawrence. Owing to the fact that it is land-locked and the summer warm, the water becomes heated, and at the same time is not carried off by cold ocean currents, as on the Atlantic coast. The Bay is very tranquil in the summer, and the sun shines longer there each day than in more southern latitudes in the summer months, and that has the effect of heating the water. The harbors are not closed by ice till the middle of November, and sometimes not till near Christmas. There is no difficulty in a vessel leaving the coast of the Bay up to the latter part of October or the middle of November. Shore ice would not interfere with navigation for over six months of the year. The floating ice in James' Bay in the spring is from the shores and rivers, and would offer little obstruction to a steamship, being light and rotten after it floats.\n\nThe following incident, related in Gunn's History of Manitoba, serves to illustrate how many of the fears of the navigation of the Bay were propagated:—\"In August, 1836, the annual ship from London to York Factory was driven from her mooring at the latter place by the storm, and the captain, instead of trying to re-enter the harbor, made sail, with all the supplies of that year for the Red River colony, back to England,\"—the reason given is that their anchor was lost.\n\nDr. Rae, who was for some years in the Hudson's Bay Company's service, when before a committee of the British House of Commons, in 1857, gave it as his opinion that the water in the north end of the\n\n* Dobbs, page 69.\nHudson's Bay Open.\n\nBay was only sufficiently free from ice to hunt whales for about two months. As Dr. Rae's opinions on the navigability of these northern waters have been quoted on several occasions, it may be of value to know how the above quoted statement of his compares with the experience of the whalers who were even at the time he testified, gathering a rich harvest from our fisheries in the Bay.\n\nI will give extracts from copies of the log books of some whalers from New Bedford, Mass., and New London, Conn. Ship Northern Light, Capt. Tabor, May 15th, 1864: getting ready for whaling; sawing out of harbor. September 19th: sighted Resolution Island on way out of Strait.\n\nThis shows nearly four months work instead of the two supposed possible by Dr. Rae.\n\nLog book of the Abbie Bradford, July 20th, 1878: Spoke with bark Nile, of New London, boiling out their third whale this season. Ship in the Bay and began whaling.\n\nThe Abbie went out through the Strait, August 10th, 1879, and there is no mention of ice.\n\nThe Abbie Bradford again wintered in the northern part of the Bay 1880-81, and her log book chronicles on June 1st, 1881, \"sawing out of harbor; 4th, in clear water and bearing up for Depot Island.\"\n\nAs most of the log books show that vessels in the northern part of the Bay begin to make preparations for wintering in the end of September, the Abbie Bradford would have a clear four months' whaling.\n\nCaptain E. B. Fisher, who made eight whaling voyages to the Bay, covering some 16 years time, writes as follows: \"The Bay is open all winter, except a little ice that makes near the shore, and that breaks up in every gale of wind. It was never very cold where I wintered, in a small harbor to the northwest. Whalersmen never have any trouble in coming out; as they leave as soon as their summer whaling is over, and are always out by November 1st.\"\n\nIt will be seen, therefore, that practical whalersmen say they do work between the 15th of May and the 1st November, or during a period of five-and-a-half months if it is necessary, so that the opinion of Dr. Rae on this matter would seem to be very far wide of the actual fact. Only one captain of a whaling vessel, Capt. Spicer, seemed to think that a whaling ship could not depend with certainty on getting out after October. The log books show that the vessels\nhave, as a rule, begun to get ready for wintering about the end of September.\n\nCaptain Tabor, of New Bedford, who whaled in the Bay in 1862, and again in 1863, remarks:—\"Hudson's Bay is open all winter, and what little ice makes on the shore breaks up with every gale of wind. About thirty feet rise and fall of the tide in the Strait and northern part of the Bay, and the currents are swift.\"\n\nThe whalemen seem to winter at Marble Island and other places in the northern and northwestern part of the Bay, and as they agree in the main with the extracts I have given it is useless to quote the remarks of more of them, but there are many more to refer to if they are called for.\n\nMr. W. A. Archibald, who lived at Moose Factory, on James' Bay, writes under date of January 19th, 1884:—\"The ice in Moose River breaks up in May from the 10th to the 20th as a rule, and the river remains open till the middle of November. The Bay is open for navigation from 1st June to 1st December. On 1st June the trading schooner starts on her trips along the coast to gather up the winter's catch of furs. If the English vessel is not too late in arriving, the schooner's work is done and she is laid up by the middle of November. Shore ice may begin to form any time after that date. I saw but one storm of any violence while I was there, and the little coasting schooner, which happened to be caught out in it, came safely through that. From what I know of Hudson's Bay and its connection with the Atlantic, and I have coasted about in those regions for many years, I should judge that steam vessels can navigate those waters from June to December in ordinary years without any danger or difficulty.\n\nDr. Nevins, surgeon on the Prince Albert, a vessel of the Company, trading to Moose from London, relates his experience in a work entitled A Narrative of Two Voyages to Hudson's Bay:—\"It is very common to meet with ice in James' Bay, but there is not generally much in Hudson's Bay.\"\n\nRobson informs us of the various expeditions made in search of the Northwest passage by the Company's vessels, and gives the dates of their sailing from York and other ports.*\n\nOne expedition in the Prosperous sloop, started from York Factory, June-19th, 1719, and after a visit to the north of the Bay, returned in August.\n\n* Robson, page 53.\n\"It is a settled and undisputed fact that the northern part of the Bay is perfectly free and open when the southern is much embarrassed with ice.\"\n\n\"Danger is so far lessened by keeping a constant watch and proper discipline amongst the seamen, that one seldom hears of any melancholy accident. This is more manifest from a fact, the truth of which is indisputable, and that is, the Hudson's Bay Company's ships, returning year after year without any disaster, from whence, perhaps, we may infer, that where constant and continual danger excite perpetual attention, it thereby alters its nature, and becomes, if I may be allowed the expression, the course of safety.\"\n\n\"I know that but a few years ago this voyage was thought very difficult and tedious, that the Company's ships almost always wintered in the Bay, and that they were well satisfied with that captain who wintered safely, and returned the following year, allowing him a gratuity of fifty guineas. But of late this gratuity is withheld from him, and given only to those who go out and return the same year, so that what was once represented as absolutely impracticable, is now very easily and speedily performed.\"\n\nLieut. Chappelle, of the Royal Navy, in 1816, wrote the following: \"It is not to be expected that ships during our return to Europe will ever meet with loose ice; therefore, as soon as our ship anchored on York Flats, we undid all the preparations which had been made for manoeuvring while amongst the ice, such as re-stowing our anchors and putting below ice ropes, ice anchors, ice axes, etc., and we rejoiced in being rid of them.\"\n\nThis strongly confirms Dr. Bell's statement regarding the state of the open harbors in the Bay during the autumn months.\n\nFox says that the farther north he got in the Bay the warmer he found the weather during the summer and \"the more free from ice.\"\n\nCapt. Hackland, who has had 16 years experience in the Bay, states that the distance the ice forms from the shore is entirely dependent on the depth of the water. He says that at Churchill, where the water is deep, the ice does not form for more than half a mile from the shore, while at York it forms at times as far as three miles, on account of less depth of water, though the mouth of the Nelson River is never really closed.\n\n* * * \"In lat. 62° 30' there is no ice to obstruct the passage from the middle of June to October, for they may return any time\n\n* Ellis, page 320; † page 282. † Robson, 1748.\nin September or October safe from any obstruction from the ice.\"*\n\nCapt. Hackland says a standing order with the Company's captains is \"Never go south of latitude 60°, until you are west of longitude 90°, in going to York or Churchill.\"\n\n* * * \"There is a continual current setting to the east from Cape Henrietta Maria, towards the supposed opening; the Bay ship in her voyage to Moose has frequently observed a large glut of loc-ice off Cape Henrietta Maria, which, before her return, has entir disappeared; and whither could it have drifted with a strong easte. current, unless some opening had admitted its escape from the Bay?\n\nThis is the channel supposed to exist between Mosquito Bay and Ungava Bay, and if there, most likely steamers could use it during those months that ice is met with in the Strait, though they would have to run across the ice stream in Ungava Bay, which is generally heavy, even when there is little or none along the north coast of Hudson's Strait.\n\nThe lower St. Lawrence (notwithstanding its comparative narrowness) is partly open, even in the middle of winter. But the difficulty, as in the case of the Hudson's Bay, is the apparent impossibility of getting into harbors. Harbors such as Churchill or York, on Hudson's Bay, would have the advantage over Quebec or Montreal of connecting directly with the open sea, and hence in autumn vessels would not be liable to be frozen in, as occasionally happens in the St. Lawrence, as, for example, in the autumn of 1880, also in the autumn of 1870, when the outward-bound shipping got frozen in below Quebec, occasioning a loss, it was said, of over a million of dollars. Again, in the spring, there might be no more uncertainty about entering from sea than in the Gulf of St. Lawrence, where vexatious delays are not uncommon after the open season is supposed to have arrived.\n\nThe Montreal harbor master, according to the United States report on commercial relations for 1878 (page 657), furnished a table showing the average opening and closing of that port for ocean-going vessels for twenty years to be:—Average opening 1858 to 1877, 1st May; average closing 25th November.\n\nSummary of the opening and closing of Hayes' River, opposite York Factory, for various years from 1830 to 1880, according to report of Mr. Wood, Government Meteorological Observer at York Factory:\n\n* Dobbs, page 82. † Chappelle, page 81. ‡ Dr Bell.\nThe records of the Hudson's Bay Company, as presented to the Government in 1880, show that the Hayes' River, at York Factory, for an average of 53 years was open on the 15th May. Only once in the 53 years did it remain closed till the end of May or first of June. Once (in 1878) the river closed as early as the 3rd of November, but the average closing for 53 years was about the 20th of November. It must be borne in mind that the Hayes' is but a small river in comparison with its neighbor, the Nelson, which is distant from it at York about six miles. The Nelson closes much later than does the Hayes', if indeed it can be said to close at all.\n\nIt is interesting, then, to note the comparison between the opening of the harbors of York and Montreal, though a fortnight is here given against York to clear the river and again in the fall when ice first forms:\n\nMontreal.  \nOpening of harbor........ 1st May.  \nClosing of harbor......... 25th of Nov.\n\nYork.  \n1st June.  \n10th Nov.\n\nThis proves conclusively that the harbor at York is open and clear of ice for five-and-a-half-months of the year, and that vessels could approach docks between those dates. At a port on Nelson River these dates would be extended.\n\nSAILING SHIPS vs. STEAMERS.\n\nIt must be thoroughly understood that all the vessels spoken of in these pages are sailing ships, and that so far steamers have never gone into the Bay. The importance and value of many points brought out by my quotations will be appreciated when the additional advantages that steamers would have had in the same situation are kept in view. The vessels which were in use 274 years ago, when the Hudson's Bay was discovered, and first navigated, may be\nbetter imagined than described, and a glance at a model, or sketch of one of them, which gives their dimensions, will afford some idea of what they might be expected to do in our northern waters.\n\nIt is surprising to one who reads the books of two hundred years ago, and compares them with works of recent date, which bear on this subject, to find that in the earlier days there was scarcely any mention made of danger in the navigation of the route into Hudson's Bay. It seems as if some forty or fifty years ago, it suddenly afflicted people as with a nightmare to hear the matter spoken of, and yet facts seem wanting to prove that any losses had occurred to alarm people in this manner. It is evident to anyone, who looks for the cause, that as people had been shut out of any trade in that direction, it was highly desirable to keep any adventurous persons from trying to gain a foothold in the future, and the best means to be adopted were those of magnifying the dangers of the navigation.\n\nI believe it is about thirty years since the American whalers with their vessels began to seek their cargoes of oil in the north of the Bay; and the trade has been carried on very quietly ever since.\n\nIt is a fact that the first vessel that ever floated on the waters of the Bay, after pushing through the Strait, was a little ship of 55 tons burden.\n\nDavis, the discoverer of the Strait that bears his name, made his discoveries in 1585, with the Sunshine, of fifty tons, and the Moonshine of thirty-five tons, and the following year he took with him in addition to these two vessels, the North Star, of ten tons.\n\nCaptain Bylot, in 1615, sailed into the Bay with a vessel of 55 tons, and Ellis is careful to note that this was the fifth voyage of discovery into these northern waters, made by this little vessel.\n\nCapt. Fox, the discoverer of Fox Channel, sailed from London on the 8th of May, 1631, in the Charles, a pinnace of only 20 tons burden, and entered Hudson's Strait on the 22nd of June, and pushed through what ice he saw without difficulty.\n\nAll the vessels, it is seen, were small, and they must have been rudely constructed.\n\nIt seems almost absurd to point out the difficulties encountered by sailing vessels as compared with steamers, but so many cases of ships becalmed in ice are met with throughout the authorities that I herein quote from, that it may be well to show some of them.\n\nDr. Nevins, on a trip to Moose Factory, met with considerable float ice in the southern part of the Bay, near to James' Bay, and the Prince Albert had the experience that he says a great many of\nthe Company's vessels have with contrary winds, and as an example of the ice that kept them floating helplessly with it for six weeks, I quote his words, \"She would sail for a half a mile, or not even her own length, before she was again stopped, and this obstacle was removed only to make way for others which would detain us for hours.\" He explains that the sailors took poles and shoved aside the blocks of ice, and he describes it all as floe ice. Two weeks later the vessel passed through this same quarter, and did not see a speck of ice, nor did they meet with any obstructions in the Straits, and yet they were over seven weeks in going to London.\n\nChappelle made almost the same voyage with H.M.S. Rosamond, in nineteen days, and his opinion of the sailing qualities of the Company's ships is given in this very plain and distinct language on page 26 of his book. \"It ought to be mentioned that we found ourselves much retarded by the bad sailing of the Northwest ships; but a Moravian brig with us sailed well.\" This was on the voyage to the Bay. He says:—\"We got under sail with a fair wind, running a zig-zag course amongst the ice, at intervals striking hard, so that the ship was much shaken, as she had not been strengthened for the occasion. Ships passing through the ice of Hudson's Strait should have their bows doubled with oak plank and heavy blocks of wood bolted to each side of her cutwater.\"\n\nCapt. Stirling, R.N., in the year 1813, had the same experience when convoying the ships into the bay.\n\nThese vessels had not made the slightest preparation for ice.\n\nThe German expedition to Greenland, which returned home in 1870, reported that their sailing vessel had been wrecked on the coast, her crew being saved by the steamer, which returned in good condition. \"Steamers were believed to be the only form of vessels suited for research on the eastern coast of Greenland, anything like reaching the coast in a sailing vessel being entirely out of the question. The lowest temperature experienced was about 58° fahr., this occurring on the 21st February, 1870.\"\n\nHere is a case where the experiment of testing the ice, and other resisting quantities of both descriptions of vessels was made by a thoroughly competent and scientific staff of chosen men.\n\nIt has been said that steam vessels could not possibly stand the severity of the climate, and yet here is shown, on undoubted authority, that the \"steamer returned in good condition,\" after exper-\n\n*Chappelle, page 130. † Annual Record of Science and Industry, 1872.\niencing fifty-eight degrees below zero weather, such as is never found about Hudson's Bay, according to the meteorological reports made to our Government, which cover a long extended series of years.\n\nSteamers have been used in ice encumbered seas for years, and the invariable report is similar to the above. Several Arctic expeditions have been made with steamers, and, indeed, they are almost entirely made in such vessels now-a-days.\n\nCapt. D. Herd, one of the Company's officers, who had commanded a ship for twenty-three years in her voyages to York Factory, stated to the Committee of the British House of Commons, in 1857, that though he knew nothing of steamers, he did not believe they could navigate in ice-encumbered seas.\n\nExperience shows that his opinion was without value.\n\nDr. Bell, who passed through Hudson's Strait in the fall of 1880, relates his experience of the sailing qualities of the Ocean Nymph.\n\nSept. 20th. Came to some drifting bay ice, a light wind blew from the direction of the drifting ice, prevented us, owing to the slight hold the ship has on the water; from entering amongst it for some hours, as we wished to do, in order to pass through it on our course. The most the ship could be induced to do was to keep her bows \"looking\" towards it, while she was allowed to drift gradually southward.\n\nSept. 21st. Occasionally the vessel would lie for a few seconds quite still against an unusually large \"pan.\" Owing to her bad sailing and the light wind, she has been nearly dropping almost broadside, from piece to piece, sometimes on the one tack, and sometimes on the other, according as she happened to turn when balancing against each \"pan\" of ice she encountered, or according as it yielded to her pressure at one end or the other.\n\nSep. 22nd. Owing to the lightness of the wind, and the great leeway made by the ship, we could not get through a little isthmus of ice which could have been crossed in ten minutes by steamer.\n\nAlthough not retarded by ice, the following distances, in a day's run, will best show the sailing qualities of the vessel:—35 miles; 32 miles; 14 miles; just held their ground; 27 miles; 47 miles. They were 19 days running 500 miles, showing an average of about 26 miles per day.\n\nThe Newfoundland, Dundee and the Norwegian sealing steamers being properly protected pushed their way through into the apparently illimitable fields of ice, in March and April, in pursuit of seals, seeking the ice, for it is there only that they can capture the seals. There are now five-and-twenty sealing steamers, of large\nsize, in Newfoundland waters, and during the past ten years they have nearly driven sailing sealing craft from this formerly styled hazardous enterprise. It is not unreasonable to suppose that, with ice navigation so thoroughly understood, not only by the captains of sealing vessels but by steamer whalers, the passage through Hudson's Strait successfully accomplished for 200 years and more by bulky and unwieldy sailing vessels and vessels of war, should now become an easy problem. All these facts show that old-fashioned sailing craft successfully accomplished for over two centuries, for the purposes of a limited trade, a supposed obstructed and hazardous navigation, which the interests of a country, as large as the empire of Germany, now invite us to encounter, with the modern protected steamer, the magneto-electric light and the experience of trained and skilful men. The employment of these, or steamers similarly constructed for summer work in Hudson's Strait and Bay, would afford a wide field for the exercise of that special skill and enterprise which at present finds temporary employment only.\n\nBut the modern sealing steamer has led the way to the solution of that all-important problem which has in view the creation of an ocean port, and an extensive seaboard for the future commerce of the Northwest. The mouth of Nelson river lies under the same parallel as Dundee, in Scotland, and it cannot escape notice that numerous fine sealing steamers from the Scottish ports are, after the 10th of March, pushing their way amongst the same kind of ice as that found in Hudson's Strait, in pursuit of seals.*\n\nIf we refer to the different charts and accounts of voyages, it will be found that it is the prevailing north-west winds which is the chief cause of sailing vessels being delayed in Hudson's Strait, these prevent them from taking advantage of such opportunities as openings in the ice, etc. Steamers can take instant advantage of such opportunities, and can effect the passage under conditions which would render it absolutely impossible for ordinary sailing vessels to go through. These are nearly the words of Prof. J. Hind, who has an intimate knowledge of the movements and capabilities of the steam sealing vessels, and he states further that they have learned how to deal with ice, and treat it rather as a source of safety than of danger, by pushing into it to make themselves perfectly secure from storms. Their manner of proceeding is totally different now from what it was when sailing vessels were in vogue.\n\n*Hind's Report.\n\"We arrived at the Orkneys nineteen days before the other Hudson's Bay ships arrived from York.\"* They left York together.\n\nTo show how quickly a sailing vessel is caught in the ice which forms in the fall, Capt. Parry, in 1821, describes that the ice which \"bent like leather beneath their feet and caused them sometimes to sink into the water,\" had fixed the Fury firmly, though the sea, a short distance off was open. This was in a bay of Fox Channel.\n\nCapt. McClintock, on an Arctic voyage, says:—\"After steaming out of our predicament (a matter we could not accomplish under sail), we ran on to the south, but found the pack edge still composed of light ice very closely pressed together. * * * An insignificant hummock then blocked up the narrow passage; as we could not push it before us, a two-pound blasting charge was exploded, and the surface ice was shattered, but the difficulty was increased instead of being removed. This is one of the many instances in which our small vessel labors under very great disadvantage in ice-navigation. We have neither sufficient manual power, steam power, nor impetus to force the floes asunder. I am convinced that a steamer of moderate size and power, with a crew of forty or fifty men, would have got through 100 miles of such ice in less time than we have been beset.\" The Fox was a steam-yacht of 177 tons burden.\n\n\"Upon the 8th of July, 1746, we made the Island of Resolution, at the distance of about half a mile. * * * The wind falling, and the sea tumbling in on the shore, we were forced to have recourse to the ship's oars, and by the help of these, and the boats towing ahead, we made shift to deliver ourselves from this danger.\"†\n\nPREVAILING WINDS AND CURRENTS.\n\nIt is with confidence that the assertion is made that the prevailing winds in the Strait come from the north-west, and that they are the chief cause of the trouble experienced by sailing ships. Parry, who wintered in Fox Channel, in 1853-54, informs us that there were, during the year, 145 north-westerly, and 81 north-north-westerly winds, which would all be directly felt in Hudson's Strait. On only 34 occasions during the year did the wind blow from the south-east, so that it will be seen that sailing vessels have, as a rule,\n\n*Chappelle, page 224. †Ellis, page 126.\ndead head winds as well as the ice to contend with in working up the Strait towards the Bay, and they cannot take advantage of the good deep water under shelter of the north shore owing to the danger of being drawn against the steep rocky banks that generally rise straight up from the water.\n\nDr. Nevins, surgeon on a Company's ship, in 1843, wrote:—\"Ships have to sail amongst icebergs and rocks, which descend perpendicularly into one hundred fathoms of water, and against currents so strong that ships can hardly make head against them, and yet there has not been an accident of importance to one of them for above fifty years, nor do I remember to have heard of any of them having been lost at sea. There is always a strong current down the south side of Hudson's Strait, which in some places runs as fast as seven or eight knots an hour.\"\n\n\"The north-westerly winds prevail in these parts, it blows from the north-west quarter near nine months in twelve.\"*\n\nCapt. Kennedy, of St. Andrew's, Manitoba, who, in 1850, commanded an expedition for Lady Franklin; lived eight years on the south shore of Hudson's Strait, in a letter to me last week, says:—\n\n\"It is chiefly from Fox Channel that ice comes in June and July; the current moving south forces it into the Strait, passing Ungava Bay, into the Atlantic. * * * Every operation of winds and currents is favorable for the formation of a channel along the north shore. The Hudson's Bay ships have always found the Strait ice-encumbered in the beginning of July, and, being sailing ships, have had to give the land a wide berth, more especially as the beginning of July is the season of calms which render sailing ships very helpless.\"\n\nCapt. Kennedy also said, last summer:—\"The north shore of Hudson's Strait is sheltered from northerly winds. Southerly setting currents open a channel along the northern coast.\"\n\n\"If I was to give any directions for avoiding the thickest of the ice in Hudson's Strait, it would be to keep pretty near the north shore, for we always observed that side much the clearest, as not only the winds blow mostly from thence, but currents too come out of most of those large openings which are on that side.\"†\n\nChappelle states:—\"Entering Hudson's Strait, it is a necessary precaution to keep close in with the northern shore, as the currents out of the Hudson's and Davis' Straits meet on the south\n\n* Ellis, page 126; † page 144.\nside of the entrance, and carry the ice with great velocity to the southward, along the coast of Labrador.\"\n\n\"It is well known, however, that the direction of the ice drift is much affected by winds, and that meteorological conditions have much influence in determining the position of the floe ice. Icebergs which can be avoided by a steamer, are not much affected by winds, being directed by deep-seated currents, which, in Hudson's Strait, according to Sir Edward Parry, carry the bergs to and fro twice as fast as the floe ice.*\n\nThe work of the Smithsonian Institute, on winds, shows that from all the records on file of the observations made by explorers in Hudson's Strait and Fox Channel, it is found that the prevailing winds are from the north-west.†\n\n\"In passing out through Hudson's Strait we could perceive none of the drift ice which was so plentiful in our voyage outwards; it had been carried away to the ocean by the prevalence of the southerly currents.\"‡\n\nThe log books of the American whalers also show that the currents from the north carry the ice to the south, where it lodges amongst the islands and blocks up towards the north, about midway up the Strait, where it is narrowest.\n\nProf. Hind writes, concerning the ocean currents, which sweep past the entrance of Hudson's Strait, as follows:—\"It appears certain that some of the popular impressions respecting the icy character of Hudson's Strait and Bay have arisen from the accounts which have been published from time to time of the climate and coast line of northern Labrador, which is not unfrequently neared in entering the Strait. But the coast line of northern Labrador is the unfortunate recipient of the combined effects of no less than three separate arctic or sub-arctic ice streams.\n\n\"These are the east Greenland ice stream, the Baffin's Bay and Davis' Strait ice streams, and the Hudson's Bay ice stream. All of these ice-encumbered currents meet in the summer on the coast of northern Labrador, and are the cause of its exceptionally cold climate. The reason why the entrance to Hudson's Strait is encumbered in early summer, arises from the ice of the combined Greenland and Davis' Strait currents sweeping in a broad stream past its entrance towards the Labrador coast, on which it is pressed by the earth's rotation.\"\n\n* Hind's Report, page 7. † Smithsonian Institute, 1854. ‡ Chappelle, page 234.\nA glance at the map will show that this ice when it passes further south affects the entrance to the Straits of Belle Isle before it reaches the Banks of Newfoundland.\n\nAt Fort Chimo, at the foot of Ungava Bay, the currents are very powerful, the tide rising, it is said, to over 40 feet, and the ice from the Strait is carried into Ungava Bay; sweeps round its shores, and is carried out of the Strait to join the Labrador ice stream.\n\n\"Another thing worthy of remark is, that if a ship steers in for Cape Churchill until she have forty fathoms water, she may be certain of being in latitude of the Cape; and when she reaches within five or six leagues of the land, she will have eighteen fathoms water. But a navigator must be cautious to make allowance for the southerly current, which sets continually along the western coast of Hudson's Bay.\"\n\nCapt. Hackland states that there is a strong current down the west side of the Bay, which, at the south end, crosses over and passes up the east side, running out into the Strait through Mansfield Island and the mainland. This is why ice is sometimes met with by the Moose ship, whose course is down the east side.\n\nFOGS.\n\nIt having been stated that great trouble and danger is experienced by reason of frequent fogs in both the Strait and Bay, it is desirable to present some information that comes to hand, so that this question may be understood.\n\nFrom the extracts supplied by the log books of nine American whalers who have been whaling in the Bay during recent years, I find that there is only one mention made of fogs in the passage through the Strait, and that remark, as given, is:—“Ship Ansel Gibbs, July 5th, 1866. Ice seems open, but weather too thick to run.”\n\nThe Canadian Government have had for something like seven years meteorological stations at York Factory and Moose Factory, and as the observers are the officers of the Hudson’s Bay Company, we can take their returns without fear of their being either too favorable or the reverse:\n\n*Chappelle, page 173.*\nYORK FACTORY.\n\nFogs observed 1876, 18\nNo returns 1877\nFogs observed 1878, 4\n\nMOOSE FACTORY.\n\nFogs observed 1878, 6\n\" \" 1879, 17\n\" \" Jan. to Aug., return 1880, 2\n\nIt would be very interesting to compare this return with one from the lower St. Lawrence, and it certainly answers the absurdities of the nonsensical reports which have been disseminated either through ignorance of the true facts or a desire to conceal them. It is most likely that the former is the case.\n\nChappelle, in his passage through the Strait, mentions having seen fog about the end of July, and from the meteorological reports it would appear that there is, as a rule, two or three days at that time when fogs may be expected there, as one year's returns show five cases of fog in July, and two other years there was one day each in July.\n\nOutside Hudson's Strait, in the Atlantic, ships come somewhat into the region of the Newfoundland fogs, but it is too far north to expect anything like the trouble caused by the meeting of the arctic waters with those of the Gulf Stream, and which is such a source of danger.\n\nFindlay says:—\"The Gulf Stream is completely destroyed near Newfoundland by the south-west polar current, and not to be traceable any further.\"*\n\nThis matter is fully explained in Maury's Physical Geography of the Sea, which is the standard authority on the subject. Plate 9 shows very distinctly that the cold waters from the Hudson and Davis' Straits reach down to latitude 45, and east to longitude 40 west before meeting with the Gulf Stream.\n\nMaury speaking of this, says:—\"By its discovery we have clearly unmasked the very seat of that agent which produces the Newfoundland fogs.\"†\n\nNow no such influences are at work in the Hudson's Strait or Bay, except possibly, where the warm summer water of the Bay mingles with that of the Strait, and it is fortunate that reports show that no trouble occurs at that point from fogs, and that one of the\n\n* Annual Record of Science and Industry, 1872. † Page 242.\ngreat advantages the Bay offers to igators is the immunity from them as well as shoals and reefs, the islands and shores showing great depths of water close up.\n\nCapt. Middleton, who had made twenty voyages into and about the Bay up to the year 1743, writes under date of that year: \"And then as to observing the latitude in foggy seasons, I have seldom missed two days together, if it be tolerable smooth water, as you will find in our journals.\"\n\nThis is a particularly important statement coming from a man who was then accused by opponents of the Hudson's Bay Company as working and writing entirely in its interests, and with suppressing anything favorable to the navigation of those waters.\n\nDr. Bell was in Hudson's Strait on the Company's vessel from the 19th Sept. to the 9th Oct., and gives a detailed journal of events. They had spells of fog on two days.\n\nMr. Archibald, who lived on the Bay for seven years, in a letter says:—\"The amount of fog in Hudson's Bay is about the same as is experienced in Manitoba. The conditions for producing fog do not exist in that Bay.\n\nCapt. Hackland reports that fogs are very uncommon, as the general conditions for producing them are wanting in either Bay or Strait.\n\nLighthouses.\n\nThe freedom of Hudson's Strait and Bay from rocks, shoals, and other impediments to navigation, will exonerate vessels, in that quarter, from the heavy expenses for pilots, lighthouses, etc., which burden shipping in many other American ports.\n\nBoth shores of Hudson's Bay are high and bold, and, if observatory stations were placed upon some of them, on elevated points on either side, they would command a complete view of its entire surface. By means of signals, of telegraphic communication between these stations, in case of the existence of drifting ice; vessels could be directed what course to follow in order to pass through it at the easiest part, or to avoid it altogether.*\n\nThe main eastern entrance of the Strait between Cape Best and Cape Chudleigh is about fifty miles in width, and there are other entrances which could be utilized to advantage if proper lighthouses.\n\n* Dr. Bell.\nwere established on elevated points. At places where ice accumulations are met with, the channel, never exceeding forty-five miles in breadth, is sufficiently narrow for telegraphic communication by means of the magneto-electric lights, from one side to the other, so that instant advantage could be taken of information conveyed, respecting the condition of the ice.\n\nSHIP'S CHARTS.\n\nDobbs says that in his day (1744) the Company and their friends gave it out that navigation into the Bay was dangerous, in order to deter others from venturing and interfering in their trade, and for that reason they obliged their captains, under a penalty, not to publish any charts of the Bay and Strait.*\n\nThis may have been the case in the olden time, but it certainly is not the case now, for the officers of the Hudson's Bay Company are placing all their records at the disposal of the Canadian Government, and Dr. Bell was supplied with every facility for obtaining correct information, both in the London office and at the various posts about the Bay, during the six years he has been investigating and exploring there.\n\nThe following, taken from Chappelle, an officer of H. M. S. Rosamond; who convoyed the ships of the Hudson's Bay Company into the Bay during the war of 1814, may better explain why we have such difficulty in procuring correct and authentic charts of these waters.\n\n\"Nothing can be more incorrect than the chart supplied me by the Admiralty for the guidance of a man-of-war in Hudson's Strait; it absolutely bears no resemblance to the channel of which it is intended to be an exact delineation. During the time we continued in Hudson's Strait; the Rosamond was entirely piloted, by a chart belonging to the chief mate of the Prince of Wales, and one of his own making; yet he was so jealous of his performance, that he was highly offended at our master's having endeavoured to take a copy of it; and from thence forward kept his charts carefully locked up. When I questioned him, with some freedom, on this mysterious conduct; the selfish motive stood at once confessed; he feared lest,\n\n* Dobbs, page 62.\nfrom others attaining the same knowledge as himself, they might be induced to enter into the service of the Company, and thereby possibly supplant him in his situation. And such I found to be the motives which induced the majority of these experienced seamen to keep their truly valuable information concealed within their own bosoms.*\n\nCapt. Sherard Osborn, R.N., brought under the notice of the Royal Geographical Society, of London, in 1863, a curious instance of the valuable information possessed by the captains of whalers in Davis' Straits and the northern seas generally. He was assured by one of these whaling captains, that every one of the so-called sounds in a certain part of Davis' Straits, were bays, not sounds. Upon being asked why he did not make the truth known, his answer was, \"My knowledge is money.\"\n\nAn Admiralty chart of 1853, corrected up to 1872, retains all the errors connected with the Meta Incognita of Queen Elizabeth and the so-called Frobisher Strait, now known to be a bay. The chart published in 1875 has not expunged the meta incognita, but it has transformed Frobisher Strait into a bay.\n\nCapt. Beecher presented a chart, with a paper, to the Royal Geographical Society, in 1842.\n\nSir Edward Parry, Admiral McClintock, Lieut. Chappelle, and many others, have assisted in the production of the charts in present use.\n\nThe old maps show a channel through from Ungava Bay, at the eastern entrance to Hudson's Strait, to Mosquito Bay on the east coast of Hudson's Bay—which has been dropped from the recent maps, though I do not think it is proved not to exist. It was shown as a narrow channel, 200 miles in length, leading into Hudson's Bay about 190 miles south of the Strait.†\n\nThe southern shore of the Strait has, seemingly, never been properly explored, and islands mentioned by Chappelle as likely to afford shelter and many harbors, along a coast of 300 miles, are not yet recorded on any published map.\n\nThe Ministry of Marine and War, of France, have large and extensive charts; maps, profiles, etc., of the coasts of Labrador, Hudson's Strait, and Hudson's Bay. Some of these may now be seen in the archives of the department in a building facing on the Place de la Concorde, Paris. The charts and profiles are on a very large scale, and are most comprehensive.\n\n*Chappelle, page 175. †Dr. Bell, 1882.\nIn the chart room of Lloyd's, London, are also to be found numerous charts of the above localities. Apparently, none of the French profiles, etc., have been published.\n\nFORT PRINCE OF WALES.\n\nFort Prince of Wales stands at the west side of the entrance to the harbor at Churchill. It occupies a very commanding position, was built of stone, and at one time mounted forty cannon of large size for those times. It is stated that it is probably the largest ruin in North America.\n\nSeveral years were consumed in building the fort, which was begun in 1733. Joseph Robson, who was the surveyor and architect in charge at one time, shows in his book the plans, the length of each side being 300 feet.\n\nIt has been said that when La Perouse, the French Admiral, captured it in 1782, \"it was surrendered, after a gallant resistance on the part of the garrison.\" This is perfectly absurd, as various writers have given the true version of the surrender, and I have been favored with a copy of La Perouse's Voyages, published in Paris, 1798, wherein La Perouse says that he had with him the \"Sceptre, carrying 74 guns; the Astree and the Engageante, carrying each 36 guns; with 250 infantry, 40 artillerymen, 4 field guns, 2 mortars, and 300 bombshells.\n\nThey sighted the fort on the evening of the 8th August, and anchored in eighteen fathoms of water. An officer sent to reconitre the approaches to the fort reported that the vessels could be brought to bear on it at a very short distance. La Perouse, thinking that the Sceptre would not easily subdue the enemy if they resisted, prepared to make a descent during the night, and without difficulty the boats landed about two miles from the fort.\n\nLa Perouse, seeing no preparations made for the defence, although the fort seemed to be in a good state, summoned the enemy, the gates were opened, and the governor and garrison surrendered at discretion.\n\nThus it will be seen by an account written by the French, that the Company's people surrendered without firing a shot.\n\nLa Perouse, having destroyed the mounted guns and parts of the fort, sailed for York Fort within three days after the first sight of Prince of Wales was had, taking with him the Governor, Hearne.\nFort Prince of Wales.\n\nIt is very strange that Hearne, who had amply proved his individual bravery during his arctic journeys, when he discovered the Coppermine River, in 1772, should have proved such a coward before the French.\n\nOld Fort Churchill, at the time Fort Prince of Wales was built, was about five miles up the river. It was established in 1688, and rebuilt in 1721.\n\nUmfreville, who was taken prisoner by the French, wrote a full account of the taking of the fort to the English papers, in April, 1783, and I find by his letter that La Perouse's account is strictly accurate. Umfreville was disgusted with the cowardice shown by Hearne, and says that the French were weak and reduced in health after their long sea voyage, most of them being poorly clothed, and only half of them had shoes.\n\nLa Perouse sailed to York Fort, on the Hayes' River, and captured that fort with equal ease, the garrison surrendering at the first call, the French troops landing on the bank of the Nelson River and marching overland to York Fort, a distance of some six or eight miles.\n\nRIVERS.\n\nOver twenty-five large and many small rivers empty into Hudson's Bay. Some of these are the Churchill, Seal, Nelson, Hayes, Severn, Albany, Moose, Ruperts, Eastmain, Big River, Great Whale and Little Whale. Some of them are navigable for a considerable distance from the sea for river steamers.\n\nNelson-River and Harbor.\n\nThe Nelson is the great trunk river which discharges all the waters which have been gathered into Lake Winnipeg from every point of the compass, and has a volume equal to about four times that of the Ottawa at the Capital of the Dominion. Its length is about 400 miles, in which distance it has a descent of 710 feet from the surface of Lake Winnipeg. If we add the length of the Saskatchewan to that of the Nelson, we shall have a total of 1,300 miles from the source of the former in the Rocky Mountains to the mouth of the latter at Hudson's Bay. (ride pamphlet).\n\nThe Nelson may be ascended by large river steamers to a distance of about eighty miles from the sea, according to soundings made by Prof. Bell. He also says in his report of 1879-80:—\nMost of its estuary becomes dry at low tide, but a channel runs through it near the centre, as far as the head of tide water. I sounded this channel in a number of places, in 1878, '79 and '80, and although an average depth of about two fathoms at low water was found, continuous soundings throughout might have shown interruptions or shallower water in some places. As stated in previous reports, there is a section at the head of tide, or between the tidal portion and the regular inland channel of the river, in which not more than ten feet of water was found. This may extend for about two miles above, above which an apparent continuous channel; with a depth of about twenty feet, according to our soundings, extends to the lowest limestone rapid, which is the first break in the navigable part, and is between forty and fifty miles from the head of tide, or from seventy to eighty from the open sea. If the section referred to were deepened, steamers coming in from the sea might enter this part of the river and find perfect shelter, or even proceed up the stream to any point below the rapid referred to. In continuation of the channel running down the estuary, a \"lead\" of deeper water extends out into the Bay, and forms the \"North River,\" or \"York Roads,\" with excellent anchorage. The tides at the mouth of the Nelson River amount to fifteen feet.\"\n\nSir Thomas Button's Journal, 1612:— \"After which time, came on the new winter, with much stormie weather, as he was constrained to winter there, in a small rile or creeke on the north side of a river in lat 57° 10', which river he named Port Nelson, after the name of his master (whom he buried there), putting his small ship in the foremost and barracadoe both of them (with piles of firre and earth), from storne of snow, ice, raine, floods, or what else might fall.\"*\n\nEllis states that the Nelson is six miles wide at the entrance, with a very good channel about a mile broad, and from five to fifteen fathoms deep.\n\nRobson made extensive soundings of the Nelson River, and published a plan of about forty miles length of it and the Hayes' River. He gives excellent depths up as far as Flamboro Head, a distance of twenty miles from the mouth. Above here are two islands, Gillam and Seal Island, where Robson says ships could lie in safety summer or winter.\n\nIn 1782, La Perouse, the French admiral, with a seventy-four-gun line-of-battle ship, and two frigates of thirty-six guns each, anchored\n\n* North-West Fox, or Fox from the North-West, 1835, page 117.\nat the mouth of Nelson River, not finding sufficient water in Hayes' River. He landed 250 men, mortars, guns, and provisions for eight days.*\n\nCertainly these were large-sized vessels to be in those waters, and it proves that the French considered the taking of the forts a matter of importance, and also that the water at the mouth of the Nelson was of a good depth.\n\n**HAYES' RIVER.**\n\nMany people labor under the impression that York Factory is on the Nelson River. This is likely caused by the imperfect and incorrect maps current which do not show distinctly that it is on the Hayes' River, which flows into the Bay, and whose outlet is divided from that of the Nelson by a bar or tongue of land projecting out into the sea, called Beacon Point. It was supposed by the early navigators to be a branch of the Nelson, and indeed I find Dobbs speaks of \"York Port, on the southern branch of the Nelson River.\"†\n\nHayes' River and two of its branches can be navigated by shallow draft steamers to points about 140 miles inland.\n\nThe outer anchorage of the Hayes' contains five fathoms water at high tide and is seven miles from the fort, but the vessels move up opposite the fort, and there lie in the middle of the stream. One report gives fifteen feet of water on the bar.\n\nRobson, in his day, speaks of a water way connecting the Nelson with the Hayes', down which the Indians went in their canoes when going to the factory. Dr. Bell's map shows where this creek enters the Hayes', and there seems to be no particular notice taken of it. Robson shows it in its course across from the Nelson, on the excellent map he issued in 1752. † He calls it Penny-cut-away.\n\nThe reason why Hayes' River was chosen as that on which the fort should be built was that the Indians found the Nelson too large for them to venture down in their small canoes loaded with furs. They cannot cross the flats at the mouth of the Hayes' River to enter the Nelson, and consequently the fort was established on the smaller river for the convenience of the inland trade. It is alleged also, that Nelson River is not well adapted for \"tracking\" in the spring, chiefly on account of the lodged ice on its banks. Robson\n\n*La Perouse Voyages, page 42. †Dobbs, page 14.\nremarks:—\"It is not thirty years ago (i.e., prior to 1745) that a ship was lost off Hayes' River, for want of knowing that there was a good harbor and safe entrance at Nelson.\n\nDobbs is authority for the following:—\"The French were in possession of Fort Bourbon, which we call now York Fort, upon St. Theresa, the eastern branch of Nelson River, from the year 1697 to 1714. The River St. Theresa is but half a league wide where the fort is built. Two leagues higher up is Fort Philipeaux, built for a retreat. Twenty leagues above the fort the river divides into two branches, one comes from the north-west side, communicates with Nelson or Bourbon River by which the natives come down to trade.\" This is evidently Robson's Penny-cut-away, or as Dr. Bell has it, Penny-gut-away.\n\n\"The depth of water abreast of York River, and off Cape Tattenham, to the southward, is uncommonly regular, and it can therefore be fairly concluded that although the western coast of the Bay be very low land, yet there is no great danger in making it. The continual washing of the waters has enabled the sea to encroach a great deal on the land, and thereby created many dangerous shoals at the mouth of the river.\"\n\nBishop Tache says the Bay into which the Nelson and Hayes' rivers pours is called Port Nelson.\n\nThe fort, which has been called Bourbon, Nelson and York, was first built by the French in 1676, and rebuilt by them in 1682.\n\nTHE CHURCHILL AND ITS HARBOR.\n\nThe Churchill, which has its source between the Saskatchewan and the McKenzie, was described by Dobbs, in 1744, to be a noble river, with a deep bold entrance, the tide flowing from 10 to 14 feet.\n\nMiddleton (1742) says the Churchill is about 500 paces wide at the entrance for a quarter of a league, and is very deep; but within it is much broader.\n\nGeorge A. Bayne, C.E., who made a professional trip in the interests of the Nelson Valley Railway Company, to Churchill, says the harbor at Churchill is regarded as one of the finest in the world. The river at this point is half a mile or more in width, and two points of rock, some twenty feet above high water, one on each side, overlap, the one on the western shore being\n\n*Chappelle, page 182.\nhalf a mile farther north than the point on the eastern, thus closing\nthe harbor from any storm that may be raging in the bay. The\ndepth of water is sufficient to float the largest ocean steamers.\nSoundings show that at a distance of 100 feet from high water\nmark on the shore a depth of 6½ fathoms can be obtained at extreme\nlow water, deepening suddenly to 8½ fathoms.\n\nThe tidal waters at springs rise and fall at least 15 feet, and on\nthis account it will be seen that good shelter is afforded in the\nharbor, thus enabling it to take a front rank among ocean ports.\n\nDr. Bell says:—\"The tide extends to the foot of the last rapid,\na distance of seven or eight miles from the open sea, the intervening\nsection forming a lagoon about two miles broad. The mouth of the\nriver, which is bounded by solid rock, is less than half a mile in\nwidth, and the point on the west side projects some distance beyond\nthe other. The fine harbor of Churchill lies immediately within\nthe mouth of the river.\"\n\nThe upper branches of the Churchill, being in a warmer region\nthan the lower part of the river, the water rises in the spring and\nbursts away the ice in the latter, while it still retains its strength.\nThis circumstance, and the rapid nature of the river, evidently\ncause great packing and shoving of the ice during the freshet, and\nthis no doubt has the effect of temporarily daming back the water\nin many places. The banks are in some places two or three hundred\nfeet high. Below the junction of the Little Churchill (103 miles\nfrom the sea), the banks are entirely denuded of timber twenty or\nthirty and even forty feet above the summer-level of the river.\nDuring the summer, however, a luxuriant growth of grass and\nother plants springs up, and covers these sloping banks in most\nplaces with a rich green.\n\nFurther down, after the river has expanded among the islands and\nthe banks have become lower, the effects of the spring ice are no\nlonger noticeable.\n\nDr. Bell says:—\"From various circumstances connected with the\nhistory of old Fort Prince of Wales, at the mouth of the river, and\nother data, I conclude that the relative level of the sea and land in\nthis vicinity is changing at the rate of about seven feet in a century.\nThis recession of the sea may be due to a general lowering of its\nlevel relatively to the land, and partly to the silting up of portions\nof Hudson's Bay, interrupting the free flow of the tides.\n\nThe exact latitude of Churchill Fort is 58° 44' 43\". The varia-\ntion of the compass in 1879 was 11° E.\nThe Churchill is a beautiful clear water stream, somewhat larger than the Rhine.\n\nThe harbor of Churchill does not freeze up until November, and this has been proved by 264 years experience, or, since the Danish captain, John Monck, wintered there in 1619-1620.\n\nGeneral Sir J. H. Lefroy, President of the Geographical Section of the British Association, and who spent two years in the Territories making magnetic observations, stated in his address to the Association, in 1880:—“Hudson’s Bay itself cannot fail at no distant date to challenge more attention. York Factory, which is nearer Liverpool than New York, has been happily called by Prof. Hy. Hind, the Archangel of the West. The mouth of the Churchill, however, although somewhat farther north, offers far superior natural advantages, and may more fitly challenge the title. It will undoubtedly be the future shipping port for the agricultural products of the vast Northwest Territory.”\n\n“The port at Churchill is tolerably good, and ships of any size may anchor in it. At the entrance is a danger, called Cape Mary’s Rock; but it is to be easily avoided.”\n\nHe speaks of it of course as being easily avoided even by sailing vessels.\n\nArch-Bishop Tache describes Churchill in these words:—“The mouth of Churchill River forms the port of the same name. This harbor, celebrated in days gone by, is capacious, safe and convenient. The little schooner which sails between Churchill and York Factory still makes use of it; and here, too, are sheltered such Hudson’s Bay Company’s ships from England as are accidentally obliged to winter in these parts.”\n\n**The Severn.**\n\n“The River Severn, used as a means of communication between the two posts on its banks, is rather a fine river. Its navigation is difficult. It flows into Hudson’s Bay to the east of Port Nelson. The height of land from which Beren’s River flows is reached by following the Severn River and the lakes connected with it. Bark canoes sometimes take this route in passing from Lake Winnipeg to Hudson’s Bay.”\n\n“The new Severn River is a very fine river, well wooded, and capable of receiving ships of 50 or 60 tons burden. The entrance is but shallow, only capable of vessels of 60 tons.”\n\n---\n\n* Chappelle, page 144. † Sketch of the North of America, 1863; ‡ page 57. § Dobbs, page 22.\nFort Severn was built at the mouth of the river by the Hudson Bay Company in 1686; and Fort Neuve Savanne was erected by the French in 1702, they naming the stream Riviere des Saintes Huiles.\n\nARCHANGEL\n\nThe City of Archangel, in Russia, is situated at the head of the delta of the Divina, in lat. 64°32' N., and long. 40°33' E. It may be said to date its existence from a visit paid it by the English voyager Chancellor, in 1553, and, indeed, an English factory was established there by consent of the Russian Czar in 1584.\n\nThe total value of exports, in 1874, amounted to £1,234,390—in 472 ships, of which 62 were steamers and 220 coasting vessels—a large proportion being carried to England.\n\nThe harbor is open only from June to October. The best season, however, is from the middle of June to the middle of August. After that period the nights become cold, and in September it is often stormy.\n\nPopulation in 1867, 19,936.\n\nThe exports are flax, flax-tow and cordilla, oats, linseed, wheat, deals, tar, pitch, rosin, mats, beef and pork, calf and seal skins, train oil, cordage, feathers and linseed cakes.\n\nA ship starting from Archangel, at the south end of the White Sea, for England, must sail north full seven degrees to round North Cape, the most northerly cape in Norway, and this for five-and-a-half degrees within the Arctic Circle, or to a distance of over 500 miles farther north than the track followed by vessels sailing out of Hudson's Strait for English ports.\n\nIt can be seen on the inspection of a chart which shows the bend of the Gulf Stream, that the influence of that great current of warm water does not set east of Cape North, along the Lapland shore, between 25th and 45th degrees of east longitude, and vessels sailing along that coast, going to or coming back from the White Sea, are subject to the full effect and influence of the great Arctic Ocean.*\n\nFull a century before Englishmen began to send ships to Hudson's Bay on trading voyages, an Englishman had opened a trade and to reach the scene of his operations had traversed an arctic sea at least 500 miles further north than had Gillam and his vessels, and\n\n*See Maury's charts.\nthough each trade has been kept up to the present day, one has been kept a close preserve, while the other has been open to the world.\n\nThe site of the City of Archangel is farther north than York Factory by 500 miles and considerably farther than the most northerly point reached by the track of ships between York Factory and Liverpool.\n\nThe White Sea, in its land-locked nature resembles somewhat the Hudson's Bay, as it does in being connected with the ocean by a strait or narrowed passage, and in addition to being in a much higher latitude has several large rivers flowing into it which do not break up until July, and then close in September. The rivers of Hudson's Bay break up in the middle of May, and do not close until November.\n\nIt is thus seen that there is scarcely any comparison between the position of Archangel and the ports on Hudson's Bay.\n\nI describe Archangel because some people have argued that because it can be reached by vessels, therefore, York Factory ought to be. The position of York or Churchill is superior in every way to Archangel as regards accessibility from the Atlantic, and the country inland, and it conveys an erroneous impression to mention these places as being on the same; or anything like equal footing.\n\nCLIMATE OF HUDSON'S BAY.\n\n\"The countries about the Bay are capable of great improvement; the lands southward and westward of the Bay are in good climates, equal in their several latitudes to those in Asia and Europe, and the climate improves farther within land.\"\n\n\"It is vastly colder at Fort Churchill than a few leagues up the river among the woods, where the factory's men lived comfortably in huts or tents all the winter, hunting, shooting and fishing the whole season.\"\n\nRobson, Dobbs, Ellis, Hearne and other writers state that when Europeans have once lived in the country about the Bay, that they are never content to live out of it again, and this fact is proved in our own Province every day, and the climate during the winter months at York is but very little colder than at Winnipeg, and during the summer it is warmer there than in this Province.\n\n* Robson, page 62. † Dobbs, page 55.\nClimate of Hudson's Bay.\n\nThe Meteorological Department, at Toronto, have kindly given me many statistics of their stations at York and Moose, and a few extracts from them are given herewith, though it is impossible to make many comparisons, as records for some months of either summer or winter have not been kept in the office.\n\nLowest temperature on any day during year.\n\n| Year | Manitoba | Moose | York |\n|------|----------|-------|------|\n| 1876 | -44      |       | -53  |\n| 1877 | -47      |       | -45  |\n| 1878 | -36      | -35   | -33  |\n| 1879 | -50      | -45   |      |\n| 1880 | -44      | -39   | -40  |\n| 1881 | -40      | -39   | -39  |\n\nHighest temperature on any day during year.\n\n| Year | Manitoba | Moose | York |\n|------|----------|-------|------|\n| 1876 | 97       |       | 99   |\n| 1878 | 93       | 92    | 106  |\n| 1879 | 93       | 84    |      |\n| 1880 | 90       | 87    |      |\n| 1881 | 93       | 91    |      |\n\nThe mean average temperature for several months at Moose:\n\n| Month | 1878 | 1879 | 1880 | 1881 |\n|-------|------|------|------|------|\n| May   | 47   | 40   | 40   | 48   |\n| June  | -57  | 50   | 55   | 47   |\n| July  | 61   | 60   | 59   | 64   |\n| August| 63   | 58   | 55   | 61   |\n| September | 52 | 49   | 52   | 52   |\n| October | 41  | 45   | 38   | 33   |\n\nThe mean average temperature for several months at York:\n\n| Month | 1876 | 1878 | 1882 |\n|-------|------|------|------|\n| May   | 38   | 33   | 33   |\n| June  | 49   | 65   | 52   |\n| July  | 57   | 74   | 63   |\n| August| 56   | 59   | 55   |\n| September | 46 | 38   | 49   |\n| October | 26  | 22   | 28   |\n\nThe mean average temperature for several months at Winnipeg:\n\n| Month | 1876 | 1877 | 1878 | 1879 | 1880 | 1881 |\n|-------|------|------|------|------|------|------|\n| May   | 53   | 55   | 48   | 53   | 55   | 57   |\n| June  | 60   | 57   | 65   | 64   | 53   | 62   |\n| July  | 67   | 68   | 70   | 68   | 66   | 69   |\n| August| 64   | 64   | 67   | 64   | 62   | 66   |\n| September | 53 | 56   | 52   | 51   | 52   | 51   |\n| October | 37  | 39   | 36   | 44   | 38   | 34   |\nFrom July to October, the temperature at Moose and Winnipeg is very much alike. In September and October, Moose has the best of it.\n\nIt will be understood that the readings for York and Moose are taken at the forts, which are on tide water, and have been described as most exposed, but they give us a fair idea of what the climate is about the Bay, as far north as York or Churchill.\n\nThe fact of the water in the rivers rushing down before the ice is broken up at lower levels proves that the climate inland is more genial, and this is the case with all the rivers flowing into the Bay.\n\nAccording to Ballantyne, vegetation in the valley of Hayes' River, thirty miles from its mouth, on the 23rd June, was found by him to be in an advanced state, the trees being covered with foliage, and on the 25th June he described the Hill River, \"Along its gentle sloping banks the country was teeming with vegetable and animal life.\"\n\nE.S. Matheson, C.E., under date Feb 4th, 1884, writes me in reply to my question as to how he stood the cold at the mouth of the Nelson River, when surveying it, during the winter of 1882-83, as follows:— \"I found the climate much milder than I had expected. In November, we built our shanty in five or six days, and commenced work; and for nearly four months we slept out without tents, and there were not more than ten days, during that time, in which we had to remain in camp through inclemency of the weather. When you take into consideration the exposed place in which we were working, viz., on the Nelson River and the sea coast, you can rest assured that the cold would not prevent men or machinery from working farther inland.\"\n\n\"In summer, when the wind is about west-south-west, it becomes sultry, and if it happens to blow fresh, it comes in hot gusts, as if blew from a fire, and the hardest gusts bring the greatest heats; but this is not the case when the wind blows from any other point.\"\n\nThis was written in 1752 as a proof that a genial and hospitable region lay in that direction, for it must be explained that at that date nothing was known of the interior to the south-west of York Factory. It is most likely that the \"chinook\" or warm winds from the Pacific may reach even as far east as the Bay, and produces the \"hot gusts\" mentioned by Robson. We know that for a certainty a genial and hospitable region does exist in the position indicated by him.\n\n*Ballantyne's Hudson's Bay.* † Robson, page 44.\n\"I took the temperature of the sea upwards of twenty times during our voyage (about 550 miles north of Moose on the east main coast), which extended over the greater part of July, August and September, and found it to average 53° Fah. I also noted the temperature of the rivers we visited, and found that the average of five of them was 61° Fah. We bathed in the water almost daily, and found the temperature agreeable. We saw no ice, with the exception of a little \"bay ice\" at the commencement of our journey, which had been driven into the neighborhood of the mouth of Moose River, after northerly winds had prevailed for many days. There was very little rain, and only two or three days of fog. Average temperature of the sea at three to four feet below surface for trials during three months was 53°, and of the air 62½°. These observations were taken at various hours between 7 a.m. and 9 p.m.\"\n\nIn the autumn of the same year (1864) the schooner Martin arrived at Moose Factory from York with a portion of the cargo of the Prince Arthur, about the end of October. She reached Moose Factory just in time to be hauled up out of the fast forming ice.\" (Letter of Charles Horetzky, lately in the Hudson's Bay Company's service, to Col. Dennis, 4th Nov., 1878.)\n\n\"In regard to the country for agriculture, the country that I have spoken of, south and south-west of James' Bay, lies in the latitude of Cornwall and Devonshire, in England, and southward of that, it is in the same latitude as the northerly parts of France; and while these countries enjoy exceptionally favorable conditions, there is no peculiarity of climate that would make the district I have referred to, worse than the average of the face of the earth in those latitudes, and, therefore, I think it is likely to be of value for agriculture, as far as climate is concerned.\n\n\"The temperature below the immediate surface of Lake Superior is 39° Fah.; along the east shore of Hudson's Bay it averaged 53° in the summer months.\n\n\"What is the liability to summer frosts in the country around Hudson's Bay? In the larger area of agricultural land south and south-west of James' Bay, I think not very great. In 1877, on my homeward journey, I left Moose Factory on the 1st October, and at that time all the tender plants—the tobacco plant, castor oil bean, common beans, cucumbers, balsams and other tender plants—were perfectly green, standing in the open air; and probably remained so\n\n*Dr. Bell, 1877.*\nfor some time after I left, as we had no frost. And at the posts of the Hudson's Bay Company, inland, they are not often troubled with early autumn frosts.*\n\n\"How about late frosts in the spring? Nor late frosts in the spring. I think the sowing is done on an average at the same time as in corresponding latitudes in Lower Canada. I have spoken of the southern region. Further to the north-west, at Norway House, in 1879, they had a frost in the latter part of September, which blighted the tender plants, and it was remarked as the first that had occurred there in thirty-four years. Wheat ripens perfectly every year in that region.\n\n\"Where is that? About twenty miles down the Nelson River from the north end of Lake Winnipeg. The climate, there, I think, is as good as in Manitoba, on account of certain favorable conditions.\n\n\"Moose Factory enjoys the most favorable climate on the Bay. You are there away from the influence of the open sea. James' Bay is far south, and comparatively narrow, and the water is warmer than at York Factory.\"\n\nEllis mentions that in the spring of 1747, \"the ice in Hayes' River gave way on the 16th May, floating gently to sea.\" On the 5th June, nineteen bark canoes, laden with furs, passed down on their way to York Factory, and on the next day, seventy more,\"—a clear proof that the rivers, inland, had been open at least a fortnight or three weeks previously.\n\nProf. Hind, in the course of his evidence:—\"We must bear in mind that ice is often found in the lakes near the water-shed, west of Lake Superior, about the middle of May, and Lake Winnipeg is sometimes impassible at its northern extremity during the first week of June. From these comparisons it will be seen that the climate of the Nelson River valley is of an exceptionally favorable character away from the coast line. It can scarcely excite surprise that there should be a large tract with a good climate and great depth of soil of drift clay in the vicinity of the valley of the Nelson River, for it is the lowest portion of the whole basin of Lake Winnipeg, and is constantly under the influence of the drainage waters from three hundred thousand square miles of land, lying altogether to the south of the narrow depression, not, perhaps, more than forty miles broad, through which the Nelson River finds its way.§\n\n* See Table of mean average at Moose, for September of various years, on page 49.\n† Dr. Bell before House of Commons Colonization Committee,\n‡ Ellis, page 209. § Hind's Report.\nSUN'S RELATIVE INTENSITY.\n\nProf. Hind gives us some very valuable data respecting the influence of the sun during the long days experienced in these northern regions, and I give a table prepared by him:\n\nTABLE showing the Sun's Relative Intensity, and the Length of the Day in Latitudes 40° N., 50° N., and 60° N.\n\n|        | Latitude 40° N. | Latitude 50° N. | Latitude 60° N. |\n|--------|----------------|----------------|----------------|\n|        | Sun's Intensity | Length of Day  | Sun's Intensity | Length of Day |\n| May    |                |                |                |                |\n| 1      | 80             | 13.46          | 77             | 14.30          | 70             | 15.44          |\n| 16     | 85             | 14.16          | 83             | 15.16          | 79             | 16.56          |\n| 31     | 88             | 14.38          | 87             | 15.50          | 85             | 17.56          |\n| June   |                |                |                |                |                |                |\n| 15     | 90             | 14.50          | 89             | 16.08          | 88             | 18.28          |\n| July   |                |                |                |                |                |                |\n| 1      | 90             | 14.46          | 89             | 16.04          | 88             | 18.18          |\n| 16     | 87             | 14.34          | 86             | 15.42          | 84             | 17.42          |\n| 31     | 84             | 14.08          | 81             | 15.04          | 71             | 16.38          |\n| Aug.   |                |                |                |                |                |                |\n| 15     | 79             | 13.36          | 74             | 14.18          | 68             | 15.24          |\n| 30     | 72             | 13.02          | 65             | 13.28          | 57             | 14.08          |\n| Sept.  |                |                |                |                |                |                |\n| 14     | 65             | 12.22          | 58             | 12.32          | 46             | 12.46          |\n| 29     | 57             | 11.44          | 47             | 11.36          | 36             | 11.26          |\n\n\"The conditions required for the adaptation of a certain area to agricultural purposes, apart from altitude above the sea and the character of the soil, are generally reduced to two, namely, the mean temperature of about 90 days, as during the summer or growing months, and the degree of humidity during that period.\n\n\"There are, however, two other conditions which exercise a very great influence upon vegetable growth throughout an area extending over many hundred miles to the north. Those are the measure of the sun's intensity as regards light and heat, and the duration of the length of the day. As we move from Manitoba say in lat. 50°, to Peace River in lat. 56° (or York in 57°), this important fact has to be noticed, that the length of the day in summer increases in a greater ratio than the sun's intensity of light and heat diminishes. It is not heat only which affects the growth of vegetation, it is also the duration of solar light in the day. The longer the day the greater the total amount of heat and light which will be received by vegetables.\"\n\nLook at the table and you will see that in lat. 40°, the sun's intensity is 88, on May 31st, the day being 14 hours 38 minutes long. In lat. 50°, the sun's relative intensity of light and heat on\nthe same day is 87, but the day is 15 hours and 50 minutes long. In lat. 60°, the sun's intensity on the 31st May is represented by 85, but the day is 17 hours 26 minutes long. The day is widely different in length, and the heat and light have a longer time to act on vegetation under the more northern meridians.\n\nIn connection with the above table, a comparison of it, with the meteorological tables given in this report, will prove highly interesting.\n\nEXPOSED POSITION OF FORTS, VEGETATION, STOCK, ETC.\n\n\"The present situation of the Prince of Wales Fort, on Churchill River, is vastly cold, and, for that reason, very inconvenient, as are all the other factories in the Bay, all the others being fixed with a view only to profit, and this alone for profit and strength, and therefore surrounded on all sides, without any shelter, by frozen sea and river, exposed to all storms, being vastly colder than a few leagues up the river amongst the woods, where the factory's men lived comfortably in huts and tents all the winter, hunting, shooting, and fishing the whole season. When the cold continued at York Port, and there was ice in the river four leagues above, they had a fine spring, all the trees in bloom and very warm weather. At present the factories of Moose and Albany are situated very unhappily, being placed in the swamp, at the mouths of the rivers, for the Company's aim being trade, they don't regard the soil, aspect, or situation where they fix them, provided they are upon navigable rivers where their ships can approach them and the natives can come in their canoes.\"\n\nIt is likely, for the above reasons, that reports generally heard give such a miserable account of the privations and hardships men suffer under when living at the trading posts about the Bay, whether of the French or English.\n\nMoose and York Factories are, however, not so much exposed but that they can grow plenty of vegetables for their own use, as is assured us by all who have visited these places. Dr. Bell was told at Moose, in 1875, that the previous year they cropped 1,700 bushels of good potatoes. He also saw oats, barley, beans, peas, turnips, beets, carrots, cabbages, and onions grown there.\n\n\"Dobbs, page 55.\"\n\"The factories are situated at the mouths of the rivers upon a frozen sea; whilst the inland countries are pleasant, fruitful and temperate.\"*\n\n\"Most kinds of garden stuff grows here (York), coming to perfection, particularly peas and beans, also good radishes, coleworts, turnips, carrots and lettuces, and other salading.\"†\n\nHearne, in 1770, wrote that \"Wish-a-capucca is the name given by the natives to a plant which is found all over the country bordering on Hudson's Bay; and an infusion of it is used as tea by all the Europeans settled in that country.\"\n\n\"There is also a plant which is a very interesting one, although its history may be probably not of very great importance just now; that is the Labrador tea plant. It was formerly imported into this country (England) by the Hudson's Bay Company, under the name of Weesuckapuka; that is the Indian name. It is a tradition that the East India Company interfered with its importation; that the Chinese took such a great liking to it that they were somewhat jealous of it. It is only a tradition, but the fact is rather extraordinary, that at the time to which this Parliamentary Report refers, when the imports of the Company were so small, that they should have imported eight hogsheads of this article into this country in one year, and sold it in the London market. The import was suddenly discontinued; from what cause, nobody knows.\"‡\n\nDr. Bell, in 1879, saw good potatoes and turnips growing in the garden at Churchill. Previous to the advent of the present official the possibility of growing them was ridiculed, but they have had a good crop for seven consecutive years. He also, in the surveys of 1877 and 1879, found 237 specimens of various plants which grow in the vicinity of the Bay, most of which have been determined by Prof. Macoun.\n\nIt is said that close to the Bay the frost never comes entirely out of the ground at any time of the year; but even if that be the case it is well known now that that does not prevent vegetable growth, as is proved by the above, as well as the fact that trees grow in soil that overlies perpetually frozen ground.\n\nH. Jukes, C.E., who was at York Factory in charge of a party of engineers, says that 150 bushels of potatoes were grown within the walls of the fort that season (1882). His staff was kindly supplied with them from the fort.\n\n* Robson, page 82; † page 43. ‡ Isbister before British House of Commons, 1857.\nMr. Archibald, who lately lived seven years at Moose Factory, adds to the list given by Dr. Bell, tomatoes and cucumbers. He also states that 20 to 30 cows and about 50 head of steers and young cattle, 20 to 40 sheep, 4 horses (imported from Scotland), and any quantity of pigs and fowls are kept there.\n\nHorses and cattle were kept at Churchill in 1733, and the small herd now kept there is recruited by raising the animals calved at the fort itself, though formerly ignorance prevented any attempt being made to breed stock on the spot.\n\nRobson states that the horses there had been kept several years previous to 1733, and were constantly employed in drawing stones, etc., for the building of the fort.*\n\nDr. Bell reports that about 80 head of cattle are now kept at Moose Factory. While there is no probability that the districts immediately bordering on the Bay will ever be considered as agricultural localities, yet it is worthy of notice that vegetables, as well as some sorts of grain, can be grown for local demand.\n\nInland, a hundred miles or so, there is some fair agricultural land, which will be turned to good account when it is required.\n\n\"According to Ballantyne, the brigade of boats for the interior usually leaves York Factory about the end of May, which shows that the rivers are open even in the cold border land within twenty miles of Hudson's Bay. Lake Winnipeg is sometimes impassable at its northern extremity during the first week in June.\"†\n\nUmfreville mentions that many vegetables are raised at Moose, Albany, York and Churchill, though the soil along the rivers close to the sea is not very well fitted for growth. All writers speak of the cranberries, gooseberries, currants, strawberries, raspberries and cherries, as growing along several of the rivers.\n\nIn giving evidence before the select Committee of the British House of Commons, in 1857, Mr. A. Isbister said:—\"Sarsaparilla grows wild over the Hudson's Bay country, and of superior quality. We import 180,000 pounds of it a year from Russia and other parts. Why should we not take some of it from Hudson's Bay?\" 40,000 gallons of cranberries are annually imported from Russia; they grow wild around the shores of Hudson's Bay.\"\n\nDr. Bell, before the Colonization Committee, Ottawa, April, 1883, said:—\"I have devoted about six whole seasons to examining either\n\n* Robson, page 43. † Hind's Report.\nthe immediate shores of Hudson's Bay, or the country surrounding it, at a greater or less distance back from the Bay.\n\n\"The country immediately surrounding Hudson's Bay cannot be said to be an agricultural region, but to the southward of James' Bay, the southern prolongation of Hudson's Bay, and to the southwestward, there is a long tract of land which, sooner or later, will be, I believe, of value for agricultural purposes. It extends for a distance of nearly 200 miles in a southerly and south-westerly direction. The immediate shore of James' Bay, towards the south end, is very low and level, and the country, for some distance back, is covered with sphagnum moss, but this does not exist far inland, the greatest extent is between the lower parts of the Albany and Moose Rivers, but beyond that there is a level tract of excellent land, well wooded; and southward and south-westward of that again, the country rises pretty rapidly for a short distance, and we come upon another plateau which extends inland for another 100 miles, and over the greater part of that, the land is excellent, as far as I could judge. I have surveyed all the principal rivers and lakes, and canoe routes of that country, and made excursions inland to see the rocks and the soil, and it would be what we should consider, in western Canada, good land. On the eastern side of James' Bay, there is a narrow strip extending about 100 miles from the southern extremity, which would be useful for cattle raising. It is already used by the Hudson's Bay Company for that purpose, and they have shown that sheep and cattle can be reared there successfully. Further north, on the west side, from York Factory or Churchill, to the north end of Lake Winnipeg, the first half of the distance, or that nearest to Hudson's Bay, is too cold, in a general way, and otherwise unfitted for agriculture, but in the remaining half, a great deal of the land is good, and it is not too cold to become eventually of some value for agriculture.\n\n\"No grain would grow at York Factory—nothing but potatoes and vegetables, turnips and root crops. The immediate influence of the sea there is unfavorable. The climate is bad at the very sea shore. It improves rapidly as you go inland, and very decidedly as you get halfway to Lake Winnipeg. There is a very decided change in going to the south-westward.\n\n\"The soil is very good at Moose and along the immediate bank of the river, and, after you get a certain distance inland, above the flat country, it seemed to be good everywhere, on this plateau, as far as I could judge.\"\nProf. Macoun, botanist to the Geological Survey of Canada, says:—Dr. Bell tells me that down along the southern part of James' Bay, and a few miles back of Hudson's Bay, he could see nothing in the climate to show that it was cold. He submitted all these plants to me, and not a plant, gathered two miles back from James' Bay, indicated a cold climate, and away up as far as latitude 59° I never found, in the Peace River region, a plant that indicated a climate as cold as Quebec. Those within two miles of the coast did, and those within half a mile of Lake Superior are of the same character.\"\n\nDr. King, who was attached to Captain Back's expedition to the Arctic Ocean (1833-35), states that at the commencement of Hill River, halfway between York Factory and Norway House, the argillaceous cliffs are seen rising in some places 100 feet above the water level, capped with hills at least twice that height; and at some parts of the stream, where it is expanded to a breadth of several miles, innumerable islands appear, stretching in long vistas, and well-wooded, producing scenery of extreme beauty. The occurrence of such deep deposits of drift clay in this valley is of great importance. The same traveller states that Steel River—the name which Hill River takes after flowing fifty-seven miles—serpentines through a well-wooded valley, presenting at every turn much beautiful scenery. The mouth of the Steel River is forty-eight miles from the sea by the winding course of Hayes' River, into which it falls.*\n\nGeorge Gladman was in the Company's service from 1814 to 1845, and he testifies that when he wintered at Eastman House, on the east side of the Bay:—\"Though the climate is not so good as at Moose Factory, raised good potatoes, turnips and other vegetables, nevertheless; soil sandy. Station much exposed to bleak north-west winds off the sea. A large herd of cattle kept there at that time, an abundant supply of hay being made in the salt marshes on the shores of the Bay... Vegetables grew wild on the point of the river, abundance of wild strawberries and currants. Resided at Moose Factory 15 years; much sheltered from northerly winds; climate and soil good; raised potatoes and other vegetables there in great abundance; barley ripened well; small fruits, as currants, gooseberries, and raspberries plentiful, grow wild; never knew wheat tried, the season being too short; horned cattle, horses, sheep and pigs kept there; all housed in winter. Albany Fort, 100 miles further north, does not differ from Moose in regard to soil and climate, being well\n\n* Journey to the Shores of the Arctic Ocean.—Richard King, M.R.C.S.\nsheltered, the marshes on the coast furnishing an abundant stock of fodder for domestic cattle. Was at York for five years, and found the soil not adapted for cultivation, being for the most part mossy swamps. Was at Oxford House. Experienced no difficulty whatever in raising vegetables; had potatoes to spare for York Factory and for the Indians.\"*\n\nRIVERS NAVIGABLE.\n\nBefore the Committee on Colonization, Ottawa, Dr. Bell, when asked the question:—\"Could you give any particulars respecting the Nelson and Churchill rivers as regards their capability for affording commercial facilities?\" answered:—\"The Churchill River would furnish no facilities. It is rapid down to the head of tide, within eight miles of the sea. The Nelson River might be navigable upward from the mouth, or downward from Lake Winnipeg for a certain distance. Half the river is navigable. Except a chute of some fifteen feet, there is a stretch of about 180 miles in the central part of the Nelson River, which is navigable, but between this and the mouth on the one hand, and the head of the river on the other, there is a considerable part broken by rapids.\n\n\"How far can the Nelson be navigated from its mouth upwards? From the head of tide about forty or fifty miles, and downward from Lake Winnipeg about the same distance. Then there would be forty or fifty miles above the first and below the second of those stretches broken by rapids, and the central 180 miles would be navigable except for the one break referred to. The whole length of the river is 360 miles, one half in the central part is navigable, and the other half is divided into stretches of ninety miles each, half of these again being navigable, and half broken as I have just stated.\"\n\nThe falls are over solid rock, and the descent from Lake Winnipeg to tide water is about 710 feet. Nelson River, as a whole, cannot be counted on as of value for navigation, except temporarily, or for local purposes.\n\nThe mouth of the Nelson is distant from the western entrance of the Strait about 550 or 600 miles.\n\n* British House of Commons Report, 1857, Appendix.\nIt is said that the Moose River is navigable at high water for about 130 miles from its mouth.\n\nThe heads of the principal rivers used for canoe routes, between Lake Superior and James' Bay are 1,200 or 1,300 feet above the sea.\n\nFrom the height of land between Lake Superior and James' Bay there is a plateau gradually sloping to the north, and, as you approach Hudson's Bay, there is a sudden drop at about 100 miles south of James' Bay. This descent turns round with a wide sort of sweep to the south-westward of the Bay. In crossing it you have a fall of 100 feet to 200 feet in a few miles. Then the character of the rivers change, and they run over silurian or devonian rocks, and through clay, and are quite navigable for steamers, at high-water.\"\n\nWHALING.\n\nBefore a Committee of the British House of Commons, Dr. Rae, in answer to the question:—\"Do you suppose there would be a sufficient quantity of fish of that kind (whales) to support a settlement?\" testified:—\"I think not. When I went in 1846-7, I saw a good many whales. When I went in 1853-4, I saw only one or two small ones.\"\n\nBefore the same committee, Captain David Herd, who commanded coasting vessels, in answer to the question:—\"What are the capabilities of Hudson's Bay with regard to whaling,\" answered:—\"I have been going there for the last 22 years and have never seen a whale but once; that was last year, I saw one whale.\" \"Assuming that there are whalesthepe, is the state of the sea, with regard to ice, such that whaling can be carried on in it?\" \"No, I do not believe that it could.\" \"I do not believe myself that whales will ever go amongst ice.\"\n\nMr. A. Isbister, witness before the same committee, stated:—\"In Hudson's Bay itself, there are also very good facilities for the whale and seal fishery. It was stated the other day, I think, by one of the commanders of the coasting ships, that he had seen no whales! I happen to have a book here containing an official report, laid before Parliament, of the imports from Hudson's Bay for ten years, from 1738 to 1748, in which it is stated that the company imported in the year 1747, as many as 1,914 whale fins, which of course represented more than 600 whales. It does not say whether they were black or white whales.\"\nIt would seem in the light of later evidence, that Mr. Isbister was correct in his statement, and that Capt. Rae and Capt. Herd did not seem to know much about the extent of the whale fishery, although the latter had sailed in those waters for 25 years.\n\nFor half a century, at least, the north-western part of Hudson's Bay has been regularly frequented by a large number of American whalers, and, I am told, by whalers from Dundee and other Scotch ports.\n\nAn inspection of the report of the United States Commissioner of fish and fisheries for 1875-76 fortunately gives us some information as to the extent of the whale fishing in Hudson's Bay. That report shows that between the years 1861 and 1874 American whalers made about 50 voyages, giving an average of rather more than four vessels for each year, and the average catch annually amounted in value to $124,000 worth of that fish. The total of the eleven years' catch amounting to $1,371,023.26, there being 23,241 gallons sperm oil, 804,265 gallons whale oil, 399,729 pounds of whalebone. It is also to be remembered that the returns submitted are those of very recent date. In all the early history of American whale fishery, Davis' Strait was a favorite whaling ground; and vessels appear to have gone into Hudson's Bay, and out again into Davis' Strait, but the records of their catch are given as being generally made in Davis' Strait.\n\nThe presence of so many whales in Hudson's Bay suggests conclusions as to the supply of food for this enormous marine mammal.*\n\nThe question has been asked; Where do the whales come from that are found in the north-western part of the Bay? I happened to meet with a rather peculiar passage in a scientific work lately published.\n\nDuring the years 1862-64-66-68-70-71 the bark Ansel Gibbs, sailing from New Bedford, Mass., whaled in Hudson's Bay, being lost there in the latter year. From the book referred to I copy the following:—“The daily papers have lately referred in brief terms to the recent capture of a whale in the Arctic Ocean, with a harpoon embedded in its flesh. The whale in question was taken by the ship Cornelius Howland, off Point Barrow, the northernmost cape of Alaska, and off the mainland of North America. The harpoon was marked “A. G.” referring, as was supposed, to the ship Ansel Gibbs,\n\n* Hind's Report.\nof New Bedford, which has been engaged for ten or twelve years in the whale fishery. Cases have before occurred of whales being captured at Cumberland Inlet with harpoons in them that must have been inserted in the Arctic Ocean, but this is said to be the first instance authenticated in which the movement of the whale was in the opposite direction.*\n\nThis would look as though whales entered Hudson's Bay by its several entrances, and went out again as in the other whaling grounds.\n\nIn a letter to me received a few days ago from a whaling captain in New Bedford, it is stated that whalers come into the Bay from Fox Channel.\n\nRobson, Hearne, Dobbs and Ellis, as well as other early writers on Hudson's Bay, constantly refer to the presence of black whales in the Bay as well as the swarms of \"white whales\" which abound all over the Bay proper.\n\nI have not on hand (though I have sent for them) the statistics showing the quantities and value of the oil, whalebone, etc., taken from the Bay to Great Britain by the whalers from Dundee and other ports, but I am informed on good authority, that the amount is very large. An American whaling captain states that he saw a whaling vessel from Dundee.\n\nEllis says that at one place in the northern part of the Bay: \"Fox saw no less than forty whales at one time, and it is a thing out of question, that all sorts of fish, but more especially the larger sorts, sea-unicorns and whales, are found in great numbers in these northern parts.\"\n\nI give several extracts from American whalers under another heading, which show the dates and length of the whaling season in the Bay proper.\n\nOne captain reports, on the 15th May, that he got ready for whaling and cut the ship out of the winter's ice.\n\nSeveral others say that they come out when the season is over, or up to November 1st.\n\nSir Edward Parry reports having seen black whales in Fox Channel, and his crew killed one on the 1st August, 1882.\n\nFox Channel has two connections with Hudson's Bay, one on each side of Southampton, and whales can range in and out through these as well as through Hudson's Strait.\n\n*Annual Record of Science and Industry, 1872.\n\"My comfort is, that the quantity of whales and sea-mors that place affordeth, will, when whale-oil comes into request, drive the merchant, to send the mariner to visit the Isle of Brooke-Cobham.\"*\n\nFox predicted exactly what has come to pass, for at Marble Island is the chief whaling ground of the Americans, who now have an average of at least four vessels, each year, at that place.\n\nIt is therefore positively proved that the whaling grounds of the Bay are exceedingly valuable, and a source of profit to our American cousins.\n\nIt may be interesting to some to know that the whalers wintering in Hudson's Bay are in size from the Isabel, of 95 tons, to the Northern Light, of 513 tons.\n\nThe Pioneer, in 1864, left home on the 4th June and returned 18th September, same year, with 1,391 barrels oil and 22,650 pounds of whalebone. Her cargo sold for $150,000. That same year the value of cargoes taken out of the Bay amounted to $127,638.86.\n\nThe above figures are from the report of the United States Commissioner of Fisheries, and are therefore accurate.\n\nI may say that several times I have heard the statement made that the value of the catch of the years 1861-74 was $10,000,000. This is wildly absurd, the figures being, according to the reports for those years, $1,371,023.36.*\n\nInaccurate quotations are as impolitic as they are absurd and misleading.\n\nCOD FISH.\n\nLittle seems to be known as to the extent of waters in Hudson's Bay where the cod is to be found. Dr. Bell says the Bishop of Moosonee informed him that he had heard of a few \"real\" cod having been caught near Whale River on the east main, where the water is deep, and Dr. Bell himself has seen plenty of rock cod taken at various places on the east coast of James' Bay. He says:—\"There appears to be no reason why the common cod should not be found in Hudson's Bay. The conditions as to temperature, depth of water, etc., are favorable, and its food, especially the caplin, is abundant. The latitudes of the prolific fishing-grounds of the Atlantic coast of Labrador are the same as those of Hudson's Bay. The question\n\n* Fox, 1635.\nwhether or not Cod-fishing grounds are to be found in this great Bay is so important that it deserves a thorough trial.\"\n\nHearne, in a foot note, remarks:—\"In the fall of 1768, a fine rock cod was drove on shore in a high gale of wind, and was eaten at the governor's table, but I never heard of one being caught with a hook, nor even saw an entire fish in those parts, their jawbones are, however, frequently found on the shores. Kepling (caplin) in some years, resort to the shores near Churchill River in such multitudes to spawn, and such numbers of them are left dry among the rocks as at times to be quite offensive.\"*\n\n\"In 1877, cod and caplin were taken in abundance by Newfoundland craft in the vicinity of Hebron, not far from the entrance to Hudson's Straits, about the 15th of August. That the caplin occurs in immense shoals in northern Hudson's Bay has long since been noticed by Hearne and others. This fish is also, in abundance on the coast of south Greenland, but the point to which special attention is directed, as regards the movement of the salmon, the caplin, and the cod, is the broad fact that the season in northern Hudson's Bay is so much earlier and so much longer than on the Atlantic coasts of northern Labrador, where the fishing interests have assumed such imposing proportions. Hearne tells us that the salmon fishing at Churchill begins in the latter part of June; he also mentions the occurrence on that coast of innumerable shoals of caplin coming in shore to spawn as soon as the ice leaves the coast. Generally the caplin precede the cod and salmon on the Newfoundland coast. It is not likely that the habits of this fish have changed under similar conditions in Hudson's Bay.\n\n\"Hearne could scarcely have made us a better enumeration of the general food of the cod than he has given us in his narrative, and the only conclusion which suggests itself in relation to his remarks upon the cod is, that this fish not being an article of commerce in Hudson's Bay, has never yet been sought for there. When the food of the cod is stated to be in great abundance, it is more than probable that the voracious fish will be relatively abundant.\"†\n\n\"When we had run almost across the Bay, and were got near some banks to the northward of Churchill River, the captain expressed his regret that they were not tried for cod; for it seemed highly probable, he said, that there was almost as many to be taken there as at Newfoundland.\"‡\n\n* Samuel Hearne, 1796. † Hind's Report. ‡ Robson, page 20.\nSALMON FISHERIES.\n\nIt is not generally known that large quantities of salmon are taken in Hudson's Bay and Strait, and from one or two of the rivers of the Hudson's Strait, a considerable number of barrels, in a salted condition, are exported every year by the Hudson's Bay Company.\n\nDr. Bell caught a species of salmon, attaining a weight of about 10 lbs., on the east coast of the Bay. He found the Indians fishing with gill nets, set in about two fathoms of water. They were taking them in considerable numbers, the fish having a strong resemblance to the common salmon (S. Solar) in outline, fins, head and mouth, and the flesh the same color and flavor. The average size is, however, smaller, the largest which they saw during the summer weighing only about 10 lbs., but many were nearly as heavy. They were caught all along the eastern coast. The Indians also killed them with spears (like those used by the Mic-Mac Indians), in the mouths of small rivers, and in shallow arms of the sea.\n\nAccording to Hearne, the season for salmon in the neighborhood of the Churchill River begins at the latter part of June; and ends about the middle or latter part of August. This writer states, that in some years, salmon are so plentiful near Churchill River, that he has known upwards of two hundred fine fish taken out of four small nets in one tide, within a quarter of a mile of the fort.\n\nProf. H. Y. Hind says:—\"If Hearne be correct in his statement, that the season begins the latter part of June, it is a fortnight or three weeks earlier than the season for salmon on the Labrador coast.\"\n\nAt the Moravian Mission Stations, Hopedale and Nain, on the Labrador, and not more than three hundred miles north-west of the Straits of Belle Isle, the salmon are always expected at the first spring tide after the 6th of July, and the cod generally approach the coast about the same time as the salmon. Indeed, it should be stated, if Hearne's statement be correct, the commencement of the fishing season on the north-west coast of Hudson's Bay, is as early as at any part of the Labrador coast, north-west of Hamilton Inlet.\n\nMr. E. S. Mathieson, C.E., who spent last winter at York Factory and on the Nelson River in engineer work for a railroad company, states that Hearne is perfectly correct about the abundance of salmon.\nThis, in the future, will be of great importance to the markets in this province and to the south. A large number of carloads of whitefish, and other kinds, are now being sent south, and east, as far as Chicago, and even to Buffalo, the fish going from Lakes Winnipeg and Manitoba. These markets can be supplied with salmon from Hudson's Bay, three weeks earlier than from the Northern Labrador.\n\nWhen the Indians and fur traders are fishing for salmon, on the coast of Hudson's Bay, north of the Nelson River, the entire coast of Labrador, during an average of years, is blocked by ice, from the Straits of Belle Isle to Cape Chudleigh, and is inaccessible to fishermen.\n\nThis fact is a most important one.\n\nEllis mentions finding plenty of salmon at the mouth of the Nelson River.\n\n\"Salmon are in some seasons very numerous on the north-west side of Hudson's Bay, particularly at Knapp's Bay and Whale Cove. At the latter place I once found them so plentiful, that had we been provided with a sufficient number of nets, casks, and salt, we might soon have loaded the vessels with them.\" *\n\nThe steamer Diana, owned by the Hudson's Bay Company, is a refrigerator vessel, and is regularly in the trade to Ungava Bay. She takes cargoes of fresh salmon to England, where it is sold for from 1s. 6d. to 2s. 6d. per pound. Some of her cargo has been re-shipped to Australia.\n\nThe Rev. M. Harvey, of St. John's, Newfoundland, writes me as follows:—\"We have here a fleet of over 20 fine sealing steamers. At present they are laid up for the most part for nine or ten months of the year, as remunerative employment cannot be found for them, when the seal fishery is over. These would make a splendid fleet for the navigation of Hudson's Bay, which could be easily carried on during four months of the year. They are about 500 to 650 tons burden, and their service could be had cheap. It would be a good plan to charter a couple of them for experimental purposes. Not more than three or four have been crushed during the twenty years which have elapsed since the introduction of steamers in the seal fishery. These were lost by being \"nipped\" in the heavy arctic ice through which they plough their way in search of seals.\"\n\nThe Rev. M. Harvey is the author of works on Newfoundland.\n\n* Hearne, page 395.\nThese vessels might be used in the salmon trade; and, as salt has been found in large quantities close to some of the streams which flow into Lake Winnipeg, it would seem as if a profitable and extensive trade is awaiting development in that respect alone. Both fresh and salted salmon may yet rank amongst the heaviest exports of Hudson's Bay.\n\nGENERAL FISHERIES.\n\nBesides the whale, cod and salmon fisheries, the waters of Hudson's Bay, and the rivers falling into it, contain many excellent oil-producing and edible fish.\n\nHearne says he saw the walrus in such numbers, on the sea shore north of Churchill, \"That the whole beach seemed to be in motion,\" and he also says, \"seals of various sizes and colours are common in most parts of Hudson's Bay, but most numerous to the north.\" \"Sea unicorns are also known to frequent the Bay and Strait.\" \"White whales (porpoises) are also very plentiful in those places.\"\n\nDr. Bell reports finding the pike, perch, herring, whitefish, grayling, sea trout, sculpin and caplin, besides pike, pickerel, carp, chub and speckled trout in their proper waters. White porpoise abound, and the walrus and narwhal are killed in considerable numbers.\n\nDobbs mentions the same list of fish as given above, and states that 14,000 \"fish larger than mackerel\" are taken at Albany in a season for the winter's supply.\n\nFox speaks of the great store of fish to be found.\n\nHearne enumerates \"mussels, crabs, starfishes, whilks, periwinkles, cockles, scallops, and many other kinds, which are found on the beaches in great plenty.\"\n\nThe whitefish abound in some of the rivers, and are, at places, caught in winter through holes cut in the ice.\n\nMINERALS.\n\nThe Geological Reports of 1879-80 give very encouraging prospects of the likelihood of valuable minerals being found about the Bay. I quote from the reports of the above-named years.\n\n\"Minerals may, however, become in future the greatest of the resources of the Hudson's Bay. Little direct search has, as yet, been\nmade for the valuable minerals of these regions. In 1875 I found a large deposit of rich ironstone on the Mattagami River. In 1877 inexhaustible supplies of good manganiferous iron ore were discovered on the islands near the east main coast, and promising quantities of galena around Richmond Gulf, and also near Little Whale River, where a small amount had previously been known to exist. Traces of gold, silver, molybdenum and copper were likewise noted on the east main coast. Lignite was met with on the Missinabli, gypsum on the Moose, and petroleum-bearing limestone on the Abitibi River. Small quantities of anthracite and various ornamental stones and some rare minerals were collected in the course of our explorations around the Bay. Soapstone is abundant not far from Mosquito Bay, on the east side, and iron pyrites between Churchill and Marble Island on the west. Good building stones, clay and limestones exist on both sides of the Bay. A cargo of mica is said to have been taken from Chesterfield Inlet to New York, and valuable deposits of plumbago are reported to occur on the north side of Hudson's Strait.\n\nMany of the navigators of the past century mention the finding of minerals.\n\nIn answer to the question asked by the Select Standing Committee on Immigration and Colonization of the House of Commons, Ottawa, 4th April, 1883, in a general way, in the Hudson's Bay territories, \"are there many useful minerals?\" Dr. Bell's answer was:\n\n\"As far as we know there are, but very little search has been made there. I can, however, mention numerous minerals which are already known to exist. They embrace iron, as hematite, magnetite, clay ironstone and rich magnaniferous iron ore on the east main coast; copper in its native state and in various combinations; lead, silver, gold, molybdenum, antimony, manganese, chromium, phosphate of lime, jade, chrysophase, agate, cornelian, malschite, jasper, serpentine, jet, lazulite, petroleum, asphalt, peat; anthracite, bituminous coal, lignite, limestone, granite, sandstone, and sand for glass-making, moulding sand, clays, marls, ochres, gypsum, iron pyrites, salt, medicinal waters, sheet mica, soapstone and plumbago. These are all known to occur; many in various parts of the territory, and most of them certainly well worth looking after.\"\n\nMany years ago, Sir John Richardson was convinced that it would not be long before the value of the mines of the Hudson's Bay territory would far surpass that of the fur trade.\n\nMr. Hickson, formerly in the service of the Company, thus refers to the mineral deposits on the shores of the Bay:— \"At a certain\npoint on the east coast of James' Bay there is a vein of magnetic iron, so extensive, that, when examined by a practical English miner, in 1865, it was pronounced by that gentleman to be one of the most valuable veins of ore in existence. Plumbago, in a pure state, is also to be found in the same locality; and at this place is the commencement, on the sea coast, of a range of mineral bearing rocks, which extend along the mainland, and among the islands near the sea shore, for a distance of 600 miles, with a width of from fifty to two hundred miles or more, into the interior of the country.*\n\nAt certain points on this range a partial examination has been made, showing that galena, iron, and copper are procurable in almost unlimited quantities, and during a thirteen years' residence at various parts on the east coast, I had ample opportunities of examining both its geological and mineralogical formations at a great many points, both in James' and Hudson's Bay, and have no hesitation in stating that I believe it to be the most valuable mineral region in the Dominion, perhaps on the Continent.\"\n\nMr. Hoffman, Chemist of the Geological Survey of Canada, analyzed a specimen of anthracite, from Long Island, on the east coast, with the following result:—\n\n| Component            | Percentage |\n|----------------------|------------|\n| Fixed carbon         | 94.91      |\n| Volatile combustible matter | 1.29       |\n| Water                | 3.45       |\n| Ash                  | 0.35       |\n\n100.00\n\nMr. Hoffman reported also on the composition of the Moose River lignite, as follows:—\"A piece of this lignite, immersed in water for over three days, remained apparently unaffected; it had not disintegrated, nor imparted any coloration to the water.\n\nThis specimen having been kept in the laboratory for months, may be regarded as having been thoroughly air-dried.\n\nTwo proximate analyses by slow and fast coking gave:—\n\n| Component            | Slow coking | Fast coking |\n|----------------------|-------------|-------------|\n| Fixed carbon         | 45.82       | 44.03       |\n| Volatile combustible matter | 39.60       | 41.39       |\n| Water                | 11.74       | 11.74       |\n| Ash                  | 2.84        | 2.84        |\n\n100.00 100.00\n\n*Geological Survey, 1876, page 423.\nTIMBER.\n\n\"Some of the timber found in the country which sends its waters into James' Bay may prove to be of value for export. Among the kinds which it produces may be mentioned white, red and pitch pine, black and white spruce, balsam, larch, white cedar and white birch. The numerous rivers which converge towards the head of James' Bay offer facilities for \"driving\" timber to points at which it may be shipped by sea-going vessels.\"*\n\nIn addition to the above list, in another report, Dr. Bell gives the following kinds of trees:—White elm, mountain maple, pigeon cherry, mountain ash or rowan, green willow, cotton-tree, cypress.\n\nOn the head waters of the Moose River, white pine is abundant and of good size. Red Pine also exists, and extends rather further north than the white. Then there is \"Jack pine, or \"Cypres,\" or more properly Banksian pine, which, though not a timber tree in its southern extension, becomes so in the northern region, which is its home. In the Albany region, I have seen large groves of this tree, quite different from the ordinary scrubby variety, and from which one or two very good saw logs might be cut. Then there is tamarac of good growth, and white spruce cedar in the southern part, a great deal of white birch, and other trees, which will some day be valuable.\n\nIn the country, between the upper parts of the Nelson and Churchill, where the green woods, like spruce or tamarac occur, the ground is covered with moss and is apt to be wet. When that is burnt off, poplar grows up and the land is dry.\n\n\"If the navigation of Hudson's Bay becomes practicable, it seems to me, if there is much timber in that locality, it will be a valuable item of export. Perhaps you can tell us what the extent of the timber resources of these rivers that fall into Hudson's Bay are—whether there is likely to be a large export of timber from that region? The Moose River, which is perhaps the most valuable for timber, has some perhaps, twenty principal branches, that spread out and cover a transverse area of more than 200 miles from the neighborhood of the Ottawa westward, to beyond Michipicoten Valley. These join together and form several fine large streams running northward parallel to each other, and they unite to form the Moose, which falls into the head of James' Bay. The southern parts of these streams are clothed with white and red pine, and, as you go north-\n\n* Geological Report, 1880.\nward, you have good cedar, spruce and tamarac and the Banksian pine. The southern branches of the Albany also afford valuable timber; but northward of that, I do not think you could say the timber would be valuable for export commercially, as long as we have the other rivers to fall back upon. As to the limits of timber generally, I have paid a good deal of attention to the subject of scientific foresting, and have prepared maps showing the northern limit of every tree that occurs in Canada. The most northern species is the spruce, the limit of which runs from Seal River north of Churchill to the mouth of the Mackenzie River, or in a north-westward direction; and on the other side of the Bay, from Richmond Gulf up to Ungava Bay in Hudson's Straits, and down to the Straits of Belle Isle. The whole country to the southward of that line is wooded.\n\n\"You speak of that being the northern limit. For a considerable distance south of that the timber would not be merchantable? No. It is scrubby, but it becomes larger as you go south and westward. In my last report there is a map showing the northern limits of thirty of the principal trees. We have about sixty species of timber trees east of the Rocky Mountains and thirty west.\"\n\nSir Geo. Simpson testified that the timber about James' Bay was \"small stunted pines.\"\n\nDr. Rae, at the same time, said that about Moose Factory, on James' Bay:—\"There are pine woods. It is well-wooded. There are extensive forests. About two, or two-and-a-half feet in diameter is about the largest I have seen.\"*\n\nFURS:\n\nThe very name, Hudson's Bay, is so associated with the fur trade, that it is unnecessary to more than state that large quantities of furs are exported yearly by the Hudson's Bay Company in the two or three ships which go to the Bay for the purpose of taking out goods for the trade and carrying back the \"fur c. of the previous year.\" Besides York, Churchill, Moose, Ojibway, Martin's Falls, East Main, Rupert's House, and Fort Chimo, many small winter posts are established for the fur trade, and in the spring the coasting schooners sail from post to post and collect the fur for shipment from Moosé, York and Churchill.\n\n* British House of Commons Report, 1857.\nA steamer runs to Fort Chimo, at the foot of Ungava Bay, and takes out furs, fish, oil, etc.\n\nAmongst the skins of animals exported are given moose, musk-ox, various kinds of deer, beaver, wolf, fox of various kinds, lynx, Polar bear, black and brown bear, otter, martin, fisher, ermine, wolverine, skunk, etc.\n\nAt one time the whole fur trade of the Northwest was conducted through the Hudson's Bay route, but of late years the districts lying adjacent to the railroads have sent their furs through the United States, via New York or Montreal.\n\nGAME—BIRDS, ANIMALS.\n\nAs might be supposed, the country adjoining the Bay is well stocked with game of all kinds, from the polar bear to the snipe.\n\nDr. Bell shows a list of 55 birds, which are found between Lake Winnipeg and the Bay, and includes grouse, ptarmigan, crane, snipe, ten species of duck, three species of goose, swans, etc. Either the eggs or skins of all these are now in the Department at Ottawa. He saw one specimen of the woodcock at York Factory, as well as small flocks of the passenger pigeon.\n\nFrom this list of birds actually taken, or their eggs obtained, a very good idea may be formed of the variety to be found there.\n\nDobbs informs us that in 1744 it was customary to kill 3,000 geese for the winter at Albany Fort, and the Right Rev. David Anderson testified before the British House of Commons Committee, in 1857, that in one year he visited Fort Albany, in James' Bay, they killed twenty thousand (20,000) wild geese and then stopped.\n\nWhen Sir Thomas Button wintered at Nelson River, during the winter, \"they killed no less than 1,800 dozens of partridges, and other fowl.\"\n\nHearne says, at Churchill, they used to kill 5,000 or 6,000 geese in the spring. At York they have salted 40 hogsheads, and at Albany 60 hogsheads of geese, besides great quantities of plover. He describes ten different species of geese as frequenting the Bay.\n\nAnimals of the deer kind, bears, including the Polar bear, etc., are found at different parts of the Bay in great quantities.\n\nA large amount of feathers is yearly exported to England by the Hudson's Bay Company.\nI have it on the authority of a retired chief factor of the Hudson's Bay Company that within late years they salted down 36,000 geese as the regular winter's allowance at the forts in the south of James' Bay.\n\nArchbishop Tache gives a list of 223 birds which are known to exist about the Bay, or along the rivers which flow into it from the Rocky Mountains. Of these I give some of the species.\n\n| Species                  | Number |\n|--------------------------|--------|\n| Vultures and falcons     | 15     |\n| Owls                     | 9      |\n| Perchers                 | 67     |\n| Olimbers                 | 10     |\n| Swallows, etc.           | 8      |\n| Grouse, pigeon, etc.     | 11     |\n| Waders                   | 6      |\n| Cranes, etc.             | 4      |\n| Curlew, snipe, etc.      | 22     |\n| Coct, rail, etc.         | 6      |\n| Divers                   | 11     |\n| Gulls, tern, etc.        | 19     |\n| Duck and swan            | 32     |\n| Pelican and cormorant    | 2      |\n| Geese                    | 5      |\n\nArchbishop Tache furnishes us with a description of the following animals found within the northern territories, whose waters are tributary to Hudson's Bay.\n\n| Species                  | Number |\n|--------------------------|--------|\n| Shrew                    | 3      |\n| Shrew-mole               | 1      |\n| Bear                     | 4      |\n| Badger                   | 1      |\n| Raccoon                  | 1      |\n| Wolverine                | 1      |\n| Weasel                   | 1      |\n| Stoat, or ermine         | 1      |\n| Mink                     | 1      |\n| Pine Martin              | 1      |\n| Pekan                    | 1      |\n| Otter                    | 1      |\n| Skunk                    | 1      |\n| Dog                      | 4      |\n| Wolf                     | 6      |\n| Fox                      | 6      |\n| Lynx                     | 1      |\n| Panther                  | 1      |\n| Beaver                   | 1      |\n| Musk rat                 | 1      |\n| Meadow mouse             | 5      |\n| Field mouse              | 1      |\n| Jerboa                   | 1      |\n| Marmot                   | 6      |\n| Squirrel                 | 3      |\n| Flying squirrel          | 2      |\n| Sand rat                 | 1      |\n| Porcupine                | 1      |\n| Hares and rabbits        | 4      |\n| Moose                    | 1      |\n| Cariboo                  | 1      |\n| Stag                     | 1      |\n| Deer                     | 2      |\n| Antelope                 | 1      |\n| Wild goat                | 1      |\n| Wild sheep               | 1      |\n| Musk ox                  | 1      |\n| Bison                    | 1      |\nThe hags are so plentiful about York Factory, that the Company had to give up cultivating vegetables in a garden at Ten Shilling Creek, a short distance above the fort, as it was impossible to preserve anything from the voracious little animals.\n\nTRADE AND COMMERCE.\n\nAs long ago as 1748, this subject was dealt with so fully that I cannot do better than simply quote the words then written by a ship's captain, after his return from a voyage to Hudson's Bay.\n\n\"Discovery promotes trade more than anything, not only as it opens new branches, and thereby brings a clear accession to commerce, without adding in one shape what may be lost in another, but also of quickening, improving, and enlarging many old branches; since it is visible that there is a circulation in trade, and whatever creates an exportation on one side, must encourage manufactures, and heighten importations on the other. But, above all, it contributes most effectually to the extending navigation. A new trade immediately calls for an increase of shipping, and this exactly in proportion to the demands which this new trade creates, either for our own goods and manufactures, or for the produce of the new discovered country; so that the benefits received from thence, are clearly doubled to us in this respect.\n\n\"After this short explanation of the benefits that arise from discovery, we need not wonder, that the best friends to commerce, who at the same time are the best friends to their country, have always considered it in so favorable a light. It must be allowed, that they have sometimes met with opposition, as what truth is there, that has not been denied? what useful design, that has not been opposed? We may from hence conclude, that no arguments can be now offered against discovery, but what are built upon another foundation which, when examined, will be found as sandy as the former, viz., the doubting whether anything of consequence is left to discover.\n\n\"If it can be shown, that from this discovery, there is a moral certainty, that the exportation of our commodities and manufactures may be vastly increased; that several branches of foreign trade may be highly improved thereby; that navigation in general may from\nthence be greatly extended, and our shipping increased; then surely it deserves to be considered as a thing of high consequence to the public; and an object worthy of national attention, protection, and encouragement.\"\n\nMILITARY.\n\nIt does not seem to be generally known that on three occasions bodies of British regular troops have been brought from England in sailing vessels through Hudson's Strait and Bay, landed at York Factory, and proceeded by the usual water route to this city.\n\nIn 1846, a wing of the 6th Foot, a detachment of Artillery, and a detachment of Royal Engineers, numbering 383 persons, including 18 officers, 329 men, 17 women and 19 children, arrived at York Factory on the 7th August, and after a stay there of eleven days, proceeded on to Fort Garry, which place they reached in thirty days time, without any casualty.\n\nThe troops carried with them one nine-pounder and three six-pounder guns, and left twenty-four guns at York, to be forwarded after them.\n\nThese troops returned by the same route, in 1848, and a squad of 70 pensioners took their place that same fall, and these were again followed by a like number in the summer of 1849.\n\nSome of these soldiers and their descendants are amongst our most respected and worthy fellow-townsmen.\n\nIMMIGRATION.\n\nIt must not be lost sight of that nearly all the early white settlers of this Province and the many settlements of the Northwest came in via the Hudson's Bay. Lord Selkirk, in 1811, sent out the first detachment, others followed, and the first agriculturists who raised the grain which has since become so famous for its quality, experienced the delays incidental to the long passage in sailing ships.\n\nSince that day, it is not too much to say, that thousands have travelled by the same route, in perfect safety.\n\nThis fact cannot be denied, and the statement of it speaks volumes in favor of the safe navigation of our northern waters.\nPOPULATION:\n\nAs most of the prominent points of interest in connection with the Bay and its surrounding country have been taken up, it may be well to show what the people who live there are like.\n\nThe officers of the Company at the posts are generally of Scotch or English blood, the bulk of the mechanics and other employees coming from the Orkney Islands.\n\nIt is usual to find at each post a number of half-breeds, the result of the employees marrying the natives, and settling about the forts, and many of the most valued officers of the Company have come from this section of the community.\n\nArch-Bishop Tache states that the Indians inhabiting most of the country about the Bay are Swampies, or Maskegons. They live on the shores of the Bay, and in the neighborhood of the group of lakes which collect the water of the great rivers flowing into the Bay; their name being derived from the swampy character of the district which they inhabit.\n\nThe Swampies have a very distinct character. They are gentle, averse to bloodshed, easy to influence, and less superstitious than their neighbors, and brother Algonquins. The neighborhood of the principal factories has greatly modified their color and nature. The English, and the Methodist churchers have some missions amongst the Swampies.\n\nThe following statistics as to the number of Indians frequenting the different posts were compiled in 1857, and it is not likely that the numbers have been much changed, as they are now living in the same manner as then, and have not been brought in contact with the new population of whites, which has spread over the districts island:\n\n**Oxford District.**\n\n| Factory          | Number |\n|------------------|--------|\n| York Factory     | 300    |\n| Churchill        | 420    |\n| Severn           | 250    |\n| Trout Lake       | 250    |\n| Oxford House     | 300—1,500 |\n\n**Albany District.**\n\n| Factory          | Number |\n|------------------|--------|\n| Albany Factory   | 400    |\n| Marten's Falls   | 290    |\n| Osnaburg         | 200    |\n| Lac Seul         | 300—1,100 |\n\nCarried forward: 2,600\nPopulation.\n\nBrought forward 2,600\n\nMoose District.\n\nMoose Factory 130\nHannah Bay 50\nAbitibi 350\nNew Brunswick 150—680\n\nEast Main District.\n\nGreat Whale River 250\nLittle Whale River 250\nFort George 200—700\n\nRupert's River District.\n\nRupert's House 250\nRupert's House Outposts 735—985\n\nTotal 5,015\n\nThe Eskimo, or Esquimaux, are of an entirely different race from the Indians in their manner of living, their habits, customs, hunting and language.\n\nThe name Esquimaux, according to Bishop Tache, is derived from the Cree word Ayaskimew. The etymology and meaning of the name is found in the two roots \"Aski\" (raw flesh, or fish), and \"Mowew\" (he eats), implying, \"He who eats raw flesh, or fish.\"\n\nThe Esquimaux are found about all the Straits, on numerous islands, avoiding coming south on the Hudson's Bay, past the 60th parallel of latitude, their mission, to guard the frozen ocean, brings them to the south of this latitude on the coast of Labrador.\n\nThey at times come down as far as Churchill.\n\nThey flock about a ship passing through Hudson's Strait, when it arrives in the vicinity of the Savage Islands, for the purpose of trade, offering oil, ivory, sealskin garments, etc., in exchange for knives and other articles of metallic form. Seated in their skin \"Kayaks,\" which they manage with the greatest dexterity, they clamor for barter.\n\nThe number of Esquimaux in the Hudson's Bay territories are said to number about 4,000, but they are scattered over a vast extent of country. They are generally described as having gentle natures, but they are the most inveterate thieves imaginable, nothing comes amiss to them, and they make no pretence of concealing the fact.\nIt is most amusing to read of the astonishment of the early gators into Hudson's Bay, at witnessing the feats of theft performed by these simple and bland natives. Everything from an awl to a handsaw disappeared into the depths of their capacious sealskin bootlegs.\n\nThe above comprise nearly all the population of the districts bordering on the Bay and Strait, except the American whalers who winter each year in the northern part of the Bay, an average of four vessels being there each season.\n\nCONCLUSION.\n\nWe have, in the very heart of our Dominion, an immense inland sea which never freezes, it is connected with the Atlantic Ocean by a wide passage which never freezes over, and is open for navigation for at least five or six months, if not during the whole year. This great body of salt water has emptying into it a large number of rivers, many of them navigable for large river steamers for long distances inland, they are well-stocked with the finest edible fish, and in some places their banks are clothed with timber, much of which is valuable for export. The islands of the Bay, and many localities on the mainland are rich in mineral-bearing rocks and forms of coal. The northern waters are frequented by schools of whales which are already affording a bountiful harvest to the enterprising whalers. At all points in the great Bay, porpoises abound, which supply hides and oil. Furs are obtained from the full list of fur-bearing animals frequenting the adjacent country. Large game supports, in a great measure, the Indian population. Feathered game is so plentiful, that at a single post, 36,000 geese are killed in the autumn, as the year's supply. Vegetables are raised at all the forts in the southern part, and at some of those in the north. Horses, cattle, etc., are kept, and an abundance of fodder is found for them. At least three harbors are frequented by ships, and for 274 years sailing vessels of all descriptions, from the pinnace of 20 tons to the 74-gun man-of-war, have anchored in them after passing through the Strait and across the Bay. British regular troops and immigrants have sailed through these waters and landed at these harbors.\n\nShould we not, as Canadians, anxious for the full development of the great natural resources of our country, take what nature offers us so freely, and make use of her bountiful gifts.\n## CONTENTS\n\n| Topic                                      | Page |\n|--------------------------------------------|------|\n| Discovery of the Bay                       | 3    |\n| Hudson's Bay                               | 6    |\n| James' Bay                                 | 7    |\n| Hudson's Strait and its Navigation         | 8    |\n| Hudson's Bay open                          | 20   |\n| Sailing Ships vs. Steamers                 | 27   |\n| Prevailing Winds and Currents              | 32   |\n| Fogs                                       | 35   |\n| Lighthouses                                | 37   |\n| Ships' Charts                              | 38   |\n| Fort Prince of Wales                       | 40   |\n| Rivers                                     | 41   |\n| Nelson River and Harbor                    | 41   |\n| Hayes' River                               | 43   |\n| The Churchill and its Harbor               | 44   |\n| The Severn                                 | 46   |\n| Archangel                                  | 47   |\n| Climate of Hudson's Bay                   | 48   |\n| Sun's Relative Intensity                  | 53   |\n| Exposed position of Forts, Vegetation, Stock, etc. | 54   |\n| Rivers Navigable                           | 59   |\n| Whaling                                    | 60   |\n| Codfish                                    | 63   |\n| Salmon Fisheries                           | 65   |\n| General Fisheries                          | 67   |\n| Minerals                                   | 67   |\n| Timber                                     | 70   |\n| Furs                                       | 71   |\n| Game—Birds, Animals, etc.                  | 72   |\n| Trade and Commerce                         | 74   |\n| Military                                   | 75   |\n| Immigration                                | 75   |\n| Population                                 | 76   |\n| Conclusion                                 | 78   |\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001200.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 84, "total-input-tokens": 114968, "total-output-tokens": 45812, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 680, 1], [680, 841, 2], [841, 1289, 3], [1289, 3401, 4], [3401, 5527, 5], [5527, 8019, 6], [8019, 10474, 7], [10474, 12720, 8], [12720, 14765, 9], [14765, 17035, 10], [17035, 19643, 11], [19643, 22091, 12], [22091, 24478, 13], [24478, 26866, 14], [26866, 29275, 15], [29275, 31833, 16], [31833, 34292, 17], [34292, 36785, 18], [36785, 39380, 19], [39380, 41769, 20], [41769, 44166, 21], [44166, 46377, 22], [46377, 48837, 23], [48837, 51256, 24], [51256, 53600, 25], [53600, 55918, 26], [55918, 58393, 27], [58393, 60801, 28], [60801, 62499, 29], [62499, 65098, 30], [65098, 67642, 31], [67642, 70214, 32], [70214, 72776, 33], [72776, 75073, 34], [75073, 77487, 35], [77487, 79879, 36], [79879, 81907, 37], [81907, 83907, 38], [83907, 86037, 39], [86037, 88157, 40], [88157, 90505, 41], [90505, 92717, 42], [92717, 92717, 43], [92717, 92717, 44], [92717, 94876, 45], [94876, 97401, 46], [97401, 99641, 47], [99641, 101842, 48], [101842, 104370, 49], [104370, 106680, 50], [106680, 108849, 51], [108849, 111003, 52], [111003, 113108, 53], [113108, 115557, 54], [115557, 118028, 55], [118028, 120529, 56], [120529, 124088, 57], [124088, 126308, 58], [126308, 128739, 59], [128739, 131127, 60], [131127, 133710, 61], [133710, 136356, 62], [136356, 138460, 63], [138460, 140714, 64], [140714, 143045, 65], [143045, 145203, 66], [145203, 147313, 67], [147313, 149833, 68], [149833, 152155, 69], [152155, 154452, 70], [154452, 156448, 71], [156448, 159066, 72], [159066, 161375, 73], [161375, 163803, 74], [163803, 166030, 75], [166030, 168158, 76], [168158, 170879, 77], [170879, 173090, 78], [173090, 175013, 79], [175013, 177106, 80], [177106, 178783, 81], [178783, 181140, 82], [181140, 183103, 83], [183103, 183103, 84]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]