[{"id": "1c6141a2be7dcd94b00f945216673eab390c56a0", "text": "NORTH WEST OF CANADA\n\nA GENERAL SKETCH\n\nOF THE\n\nExtent, Woods and Forests, Mineral Resources and Climatology of the Four Provisional Districts of Assiniboia, Saskatchewan, Alberta and Athabasca.\n\nPUBLISHED BY AUTHORITY OF THE DEPARTMENT OF AGRICULTURE.\n\nOTTAWA:\n1887\nA View from the Platform, looking down the St. Lawrence, from the Citadel, Quebec.\n\nA Sketch by H.R.H. the Princess Louise.\n\nA View at Quebec.\nNORTH WEST OF CANADA\n\nA GENERAL SKETCH\n\nOF THE\n\nExtent, Woods and Forests, Mineral Resources and Climatology of\nthe Four Provisional Districts of Assiniboia, Saskatchewan,\nAlberta and Athabasca.\n\nPUBLISHED BY AUTHORITY OF THE DEPARTMENT OF AGRICULTURE.\n\nOTTAWA:\n1887\nGENERAL DESCRIPTION\n\nOF THE\n\nNORTH WEST OF CANADA\n\nOR OF THE\n\nExtent, woods and forests, mineral resources and climatology of\nthe four provisional districts of Assiniboia, Saskatchewan,\nAlberta and Athabasca.\n\nCHAPTER I\n\nA GENERAL VIEW\n\nThe central portion of North America consists of an immense plain extending from south to north between the Gulf of Mexico and the Arctic Ocean, and from east to west between the Alleghany region and that of the Rocky Mountains. This plain is divided into two distinct basins: the waters of one flowing towards the south; those of the others, towards the north. The dividing line of the waters separating these two great basins is very nearly at an equal distance from the Arctic Ocean and the Gulf of Mexico, passing between the sources of the Mississippi and its affluents on one side, and those of the Red River, Assiniboine and the South Branch of the Saskatchewan on the other. This is the line of natural division; the artificial division is formed by the forty ninth parallel of latitude which separates the United States from Canada.\n\nThe plain comprised in the Basin, which discharges its waters to the north, nearly forms an isosceles triangle; having for its base, a line drawn in a north west direction from the Lake of the Woods to a certain point between 64° et 65° of latitude, a distance of nearly 1500 miles; and for its two sides, the 49th parallel of latitude as far as the base of the Rocky Mountains, and a line following the foot of those mountains.\n\nThe summit of this vast triangle, between the sources of the Missouri and the South Saskatchewan, has an altitude of nearly 4000 feet; but the general level of the plain descending as it stretches to the north west, at the point of the base of the triangle it is only from 400 to 1000 feet above the sea level.\n\nThe principal rivers which drain this great plain are the Peace and the Athabasca, two affluents of the Mackenzie River, which empties into the Arctic Ocean; the Saskatchewan, and the Red River, with its principal tributary the Assiniboine, which flow into Lake Winnipeg and thence by the Nelson River into Hudson Bay. In the \"plain\" region these rivers have hollowed out deep beds, often of considerable width, and as the lands through which they cut their way, are composed of alluvial soil or of soft rocks easily eroded, their course is generally uniform, scarcely interrupted in a few places by little cascades and they descend with a nearly regular fall to their mouths.\nThe inclination towards the north east of the plain comprised in this triangle, is slightly undulating, with ranges of heights of which the most prominent form hills rising from five to eight hundred feet above the general level of the country around. The direction of these ranges of hills is generally nearly the same as that of the Rocky Mountains, with the exception of the range separating the basin of the Peace River, from that of the Saskatchewan, which is transversal to the general axis of the great chain of the Rocky Mountains.\n\nIn the Athabasca region, this \"plain\" country is turned round to the south east by the metamorphic rocks of the Laurentian system and a belt of forest zone in which the white foliage of the birch and poplar stands up against the sombre verdure of the conifers. To the north west of this forest zone is found a region of prairies; steppes whose undulations resemble petrified waves; where the rivers flow between steep banks over beds scarcely interrupted by accumulations of sand or gravel. The beauties of this region have been so well described by Archbishop Taché, who in his character of missionary, traversed the whole country in every direction, that we cannot resist the pleasure of quoting his magnificent description:\n\n\"The prairie which borders on the desert,\" he says: \"like its neighbour is composed of secondary rocks, although at its extremities may be found in transition rocks, as for example, the limestone stratifications of the Red River and the coal fields of the different branches of the Saskatchewan. The glacial age borders upon and sometimes is confounded with the Devonian system. Immense deposits of sulphate of soda are found near the limestone beds and elsewhere. The valleys of the rivers, the refuse and waste of the forests multiply everywhere fresh land formations. Thick alluvial beds are there, and when they have a certain age, they are covered with vegetable beds sometimes also of great thickness.\n\n\"The pioneer colonist who has worked to clear our thick forests in Canada, who has only been able to sow his land after having waged a terrible war with the giants that cover it and after having dug deeply to extract their immeasurable and enormous roots, naturally feels a certain repulsion to lands well wooded, he has expended too many efforts, and exhausted too many of his resources to believe in the superiority of these kinds of lands. It seems to him that the open country where he has, so to speak, only to put his plough into the ground, is a fortunate country. From this point of view, the prairies have an incontestable advantage; but as nothing here below is perfect, this advantage has its disadvantageous compensation in the excessive scarcity of wood for use and for fuel.\"\n\n\"To the buffalo hunter, the prairie is a country without an equal; it is his empire in winter as well as in summer; he experiences there a veritable happiness in spurring his rapid coursers in the pursuit of a prey until lately still so abundant and so easy. It is there, that, without an obstacle so to speak and without toil, he tracks their routes, overcomes space, and enjoys a spectacle often grand, although a little monotonous.\n\n\"Seen at the season of flowers, the prairie is truly beautiful since upon a foundation of verdure, it is completely enamelled with different colors. It is a rich carpet whose various shades seem disposed by the hand of an artist; it is a sea, which at the least breath of wind, undulates in sweet smelling waves. This prairie, although so smooth that it seems a super-\n\n---\n\n(1) We shall see elsewhere that in reality this inconvenience does not exist in an appreciable manner, as is established by recent surveys.\nsocial horizon, suddenly undulates and forms a rolling prairie. Its beauty then increases; a thousand little hillocks raise themselves here and there, and give in their almost regular variety, the idea of the undulations of the ocean in the midst of a great storm.\n\nIt seems that the powerful hand of the Ruler of the seas, in mockery of the fury of the waves, has seized them at the moment of their rising, and by a word of command transformed them into earth. In some places erratic blocks of stone seem from afar on the tops of the downs and hillocks, seem the foam of fleecy waves petrified. Elsewhere the prairie is dotted with clumps of wood and sown with lakes with contours as agreeable as varied, there are basins which one would say are reservoirs destined for the play of great waters, and whose sides bear the visible imprint of the different levels that the supreme Artist assigned to these dried up ponds. Apart from the wild and savage beauty of the great mountains, apart from the view of a great sheet of water bathing a beautiful shore, altogether without what art has added to natural beauty, it is difficult to imagine anything more beautiful, or at least more pretty or more lovely than certain points in these undulating prairies. It would be easy to fancy oneself in an immense park, whose rich protector had put under contribution the most experienced talent.\n\nIn the midst of these clusters of trees, these thickets, this rich verdure, these lakes without number, one would ask where is the master to whom belong the numerous flocks that are tranquilly feeding in the distance? Who has tamed that gazelle so light, so graceful, which seems to come to salute our travellers, which fear drives away, and curiosity brings back?\n\nThose bands of wolves which sport around you, which bark, which howl and whistle by turns, are they the impatient pack which wait the signal to dart away in pursuit of the game? Then, in the autumn, what variety, what quantity of aquatic birds covers all these lakes? Ducks sport there by thousands, the swan, that inhabitant of all beautiful pieces of artificial water, is there; floating with a majestic negligence and pouring forth plaintively her mysterious song. Oh! yes, it is beautiful, the prairie, and since only inhabitants and habitations are wanting, there are certain spots which I will willingly point out to you.\n\nTo facilitate, to hasten the settlement of this magnificent country, whose natural beauties dispute the palm with the astonishing fertility of the soil, in 1882, the government of Canada divided the part of this prairie region situated to the west of the province of Manitoba into four provisional districts, which will be before long organized regularly into provinces, designated by the names of the district of Assiniboia, district of Saskatchewan, district of Alberta, and district of Athabasca.\n\nThese four districts comprise an area of 134,000 square miles or 275,840,000 acres, which exceed by at least 14,000 square miles, the collective extent of France, Great Britain and Ireland, Portugal, Switzerland, Belgium, and Holland. As these different countries have not a richer soil than the four districts in question, and as they are inhabited by a population of over 80,000,000, it is evident that the four future provinces of the Canadian North West will be able to support with ease a population at least a third of that of these countries of Europe, that is to say one of at least 25,000,000. As we see it, immigration for a very long time could be poured into these immense territories without the least danger of encumbering them.\n\nThe greatest part, much the greatest part of these vast prairies possesses a soil of astonishing fertility, and even in regions less favoured in this\nrespect, there are no great extents as stated by Capt. Palliser, in his report to the Imperial Government, at all approaching to sterility. The careful explorations made for some years back, by surveyors in the service of the Department of the Interior, in the territory bordering on the American frontier, entirely corroborate the opinion of Capt. Palliser. They establish, that even in that strip heretofore designated \"the desert\" there is comparatively but a small part of the land unfit for the culture of the cereals or for pasture. In nearly every spot not favourable for culture, the soil is covered with succulent grasses which render it profitable for cattle raising, so much the more profitable, that these pasture lands are nearly all in the neighbourhood of the Canadian Pacific Railway.\n\nAs we have already seen, the surface of this great prairie, is only slightly uneven. It gradually grows lower as it stretches towards the east, and, in the great basin of the Saskatchewan forms two very distinct plains. The first whose mean elevation above the level of the sea is about 2700 feet, extends from the foot of the Rocky Mountains to a range of heights of which the most elevated are the mountains or rather the Hills of Elk, File, Touchwood and Eagle to the west of Fort Carlton.\n\nThe second plain or steppe, whose general level is scarcely 1600 feet above that of the sea, is contained between the ranges of heights we have mentioned, and another parallel range which runs to the north west, extending from Pembina Mountain on the United States' frontier, to the neighbourhood of Fort Cumberland, on the Saskatchewan. The highest points of this second range of heights, after Pembina Mountain are the Dauphin, Duck, Thunder, Porcupine and Pasquin Hills.\n\nThe conformation of these ranges of heights is distinguished at nearly every point by characteristic features, showing clearly that they have been formed by denudation or by the gradual withdrawal of the waters of the sea or lakes which once covered this country. On the western side, the declivities have a gentle inclination hardly perceptible in many localities, while on the east they are generally abrupt, often even steep, showing a decline of several hundred feet in a distance of a few miles. These accidents in the surface of the ground, constitute a very distinct line of demarcation between the transition or sedimentary formations east of them, and the secondary formations which form the western plateau.\n\nBesides these ranges of hills forming the limits of the two great plains between which the western part of the prairie region is divided, there are several other eminences marking out the valleys of the tributaries of the principal rivers which traverse these two plateaux. Between Battle River and the north branch of the Saskatchewan, the most striking of these eminences are the Bear Hills, the Beaver, the four Hills of the Black Feet, and those of Willow and Wolf. Between Battle River and the La Biche, there are the Squirrel Hills and especially those of La Main which attain a height of 3,400 feet above the level of the sea and 600 above the bed of La Biche river. More to the south, the south branch of the Saskatchewan passes round in describing an arc of a circle towards the north, the extremity of the \"Great Coteau\" of the Missouri, on the borders of which are found the Cypress Mountains, 3,800 feet high, and the Thunder Mountains in the vicinity of the \"Elbow,\" or the place where the river turns to the left to take a northern direction. At the bend of the north branch, it is separated from its principal affluent by the Eagle Hills, which attain an altitude of 2,328 feet.\n\nThe basin of the Saskatchewan is separated from that of the Athabasca by\na range of heights forming the dividing line between the waters flowing into Hudson Bay, and those which empty into the Arctic Ocean through the McKenzie River. This range of heights starts from the neighbourhood of the Miette rock, one of the peaks of the eastern spurs of the Rocky Mountains and stretches to the north east into the vicinity of Portage-la-Loche, after having passed between Lakes Beaver and La Biche. Over a distance of more than two thirds of its length after leaving the Rocky Mountains, this range of heights skirts the right bank of the Pembina river, one of the principal affluents of the Athabasca. For the greater part of its course, its mean elevation is scarcely 400 feet above the level of the Saskatchewan at Edmonton or nearly 2,500 above the level of the sea.\n\nThe region north west of this line is for the most part comprehended in the district of Athabasca; it forms a great plain gradually growing lower as it grows more distant from the Rocky Mountains; scarcely broken in a perceptible manner by a few mountains of comparatively little altitude, and ridges of high land forming the lines of demarcation between the valleys of the rivers which drain this great plain.\n\nBetween the Pembina and Athabasca rivers, the only accidents in the formation which vary the uniformity of the plain are the ravines at the bottom of which flow the rivers of that region especially the valley cut out by the river McLeod, another great tributary of the Athabasca. Beyond the Athabasca, another range of heights, nearly parallel to that above described, forms the dividing line between the waters of the Athabasca valley and the plateau drained by the Peace River and its numerous southern affluents. This range of heights extends from the foot of the Rocky Mountains unto the vicinity of the point where the 58th degree of latitude cuts the 112th meridian. The only branch of the Athabasca which crosses this range, is the Little Slave River, issuing from the lake bearing the same name. This lake is 1800 feet above the level of the ocean, and between it and Lake Athabasca to the south, the mountains attain a height of 3,150 feet, that is to say, they rise 1700 feet above the lake. Nearer to the Rocky Mountains between the Athabasca, and the sources of the Smoky river, the elevation of this range of heights is scarcely 3,300 feet above the sea or from 600 to 800 above the general level of the plain. Beyond the Little Slave Lake, the elevation of this ridge of high lands diminishes, but it contains still some points of a considerable height, notably those designated as the mountains of La Biche, which are prolonged beyond the Athabasca; and the Wood Mountains, which form the extremity of the range and end at the Red River, an affluent that the Athabasca receives on its left side, not far from its mouth.\n\nTo the north of Little Slave Lake, there is a group, of which the highest points attain an altitude of 2,500 feet. From this group detach two ranges running towards the north; one inclining to the west, the other to the east, to form on two sides the boundaries of the great valley through which flows the Loon river, one of the affluents of the Peace. The most salient point of the eastern range is found in the Birch Mountains, which terminate at the 58th parallel; and at the foot of which are found the sources of the Red, and Vermillion rivers, two small tributaries of the Peace. The western range separates the Loon from the Peace river, and projects several spurs which mark the division between the lands drained by the little rivers Cadotte, Carcajou and others, and then terminate in the Buffalo Head Mountains to the north of White Fish Lake, which is only a few hundred feet above the plain.\n\nTwenty miles to the north of the Peace River, starting from the Rocky\nMountains, another ridge of high lands extends from west to east and seems to be prolonged beyond the Peace river which it crosses twenty miles below the mouth of the Smoky river and then mingles with the hills of the Buffalo Head. A little before arriving at Peace river, that is to say between $119^\\circ$ et $120^\\circ$ of longitude, this zone of high land parts into two to give place to another range running north and gradually rising, running in that direction, forms the Cariboo Mountains, or the summit line between the Peace river valley, and that of the Hay and Liards. The plateau which crowns these mountains, and forms thus the left bank of the Peace river, measures from 1900 to 2400 feet above the sea, and the height of the Cariboo Mountains varies from 600 to 1500 feet above the level of the plateau.\n\nOn the south side, or rather on the right bank of the Peace River, the high lands are much farther removed than on the left bank, and as far as Smoky river their course is nearly everywhere transversal to that of the river which flows from west to east. These heights separate the valleys of the tributaries of the Peace River and do not present, except in the vicinity of the Rocky Mountains, any isolated peaks of noticeable elevation. Finally, between Hudson’s Hope and Lake Moberley is found an eminence - 2,900 feet above the sea, rising nearly 900 feet above the lake, whose altitude is 2,050 feet. More to the southwest, in the vicinity of the forks of the Pine River, rises Table Mountain at least 3,400 feet high, of which the altitude exceeds by 1,000 or 1,200 feet, that of the plateau, which, further east, rises to form a range of heights bounding on the western side the large and beautiful valley of Smoky River.\n\nLet us state before going further that, except the mountains surrounding the Little Slave Lake, and Table Mountain near Pine River, the ranges of heights above described are only accumulations of earthy matter, hillocks devoid of rocks, composed of soft earth, everywhere arable, and in which the most stony parts at the most contain beds of little pebbles or gravel. Solid rock is so hard to be found in these lands, especially in the Peace River valley that in the whole extent of the District of Athabasca, there is not perhaps five per cent of the lands not cultivateable on account of the composition of the soil, which is, in general, of great richness, resting on beds of limestone and a subsoil of clay, then covered again in many places and over great extents by a bed of vegetable mould often of great depth.\n\nApart from these secondary accidents of formation, these undulations which only render the drainage more easy and the landscape more picturesque, the surface of the great plain drained by the Athabasca and Peace rivers forms a smooth plateau regularly inclining towards the north east. The inclination is scarcely perceptible, but of an uniformity pretty nearly constant. Along the Rocky Mountains, the general elevation of the ground varies from 2,000 to 2,500 feet above the level of the sea. This elevation is very nearly maintained as far as the longitude of Dunvegan, that is to say, to the east of the 119th meridian, south of Peace River, and is increased a little as it extends to the south; then in the valley of Smoky River towards 54° of latitude, the mean elevation is nearly 2,500 feet, and further south attains even 3,300 feet in the plateau which separates the valley of the Athabasca from that of Peace River.\n\nTo the north of Dunvegan, the level of the plateau is found a mile from the river to be 800 feet above it, or a little more than 1900 above the sea. At first some undulations of the ground are met, with groves of aspens, but five or six miles from the river these undulations disappear and the surface of the ground becomes perfectly smooth; as far as the eye can reach, the plain is\nlevel with scattered clumps of aspens, and admirably suited for agriculture. The soil is composed of a strong loam covered again by a bed of rich black earth a foot and more in thickness. There are neither savannas nor marshes, and these beautiful lands continue for fifteen miles from Peace River.\n\nThis plateau is prolonged towards the west up to the foot of the Rocky Mountains between Dunvegan and Fort St. John, a distance of a hundred and twenty miles, its elevation varying from 1900 to 2400 feet above the sea. The soil is everywhere rich and well drained, and the prairies dotted with clumps of aspens alternate with the forest which occupies nearly 25 p. c. of the total extent. In these forests, are found, in considerable quantities spruce trees measuring 10 inches or more in diameter.\n\nBeyond this plateau, the elevation of the plain diminishes towards the north, where are found the valleys of the Liard and Hay rivers, which flow north and east to pour out their water, the one into the Mackenzie, and the other into the Great Slave Lake.\n\nAs we have already seen, to the north of Dunvegan, the Cariboo Mountains form the dividing line between the waters of the Hay and the Peace rivers. They seem to be a prolongation of the high lands which, more to the south, separate the Smoky River from the basin in which lies Little Slave Lake. This range of heights running in general from south to north, seems to form the dividing line from a great plain extending as far west as the Rocky Mountains and whose mean elevation as the references given above indicate, is very nearly 2,000 feet above the level of the sea.\n\nTo the east of this great plain, the general elevation sensibly diminishes; it is nearly 1500 feet at the confluence of the Smoky River, and it does not exceed 1000 feet at Fort Vermilion, scarcely a degree of longitude more to the east. At this last place, the general level of the plain is from 50 to 100 feet above the bed of the river. This elevation steadily diminishes as far as Lake Athabasca, which is only 600 feet above the sea level, and it is evident that the great plain measuring nearly 200 miles in width, through which passes the lower part of Peace River, forms a flat steppe whose mean elevation does not much exceed 700 feet above the ocean, and which comprises an area of very nearly 40,000 square miles.\n\nProfessor Macoun, who has gone over a great part of this country, gives in a few words, an excellent idea of the vast extent of the lands of which we are treating, \"The whole country, he says, contained between the Rocky Mountains, the Athabasca, and the Great Slave Lake, is a gently inclined plain, elevated at least 2500 feet at the 55th degree of latitude, and at least 400 feet at the mouth of the Liards river, sloping down 2000 feet in 5 degrees of latitude, or six feet to a mile. Ranges of low hills appear in some places; but there are no heights meriting the name of mountains, except the Buffalo Hills, south of Fort Vermillion and the Cariboo Mountains which appear to be 40 miles to the north east of this fort. These ranges of hills are scarcely more than some hundred feet high and are probably the continuation of the plains of the upper part of the valley of Peace River. They form the line of watershed between this river and the Hay river to the north, and the river Loon to the south. All this region that I have seen or upon which I have procured information in the country itself, possesses a deep rich soil of marvellous fertility, free from stories and comprising very few savannas or marshes.\" Let us add that the greater part of the best lands of this region are prairie lands which can be immediately opened up to colonization, and produce excellent crops without\nany trouble of clearing, without any other work than the ordinary labour of cultivation.\n\nWe have classed all together in the prairie regions our immense plains in the north west, the basin of the Saskatchewan as well as those of the Athabasca and Peace Rivers. This classification is adopted because the prairie predominates in this vast territory; but it would be an error to suppose from this that these two basins consist only of prairie, since several sections of them contain large forests, and even in the prairies properly so called, there are few localities where some wood is not found, nearly everywhere in sufficient quantities for domestic uses, that is to say, for fuel and the building of fences, or even for the construction of buildings.\n\nIt is sufficient to know the origin of these prairies to understand in what circumstances the wood they contain will be found.\n\nIn the United States the prairies owe a good part of their origin to the extreme aridity of the soil—great areas being covered with saline deposits—of an excessive dryness, preventing the growth of wood, which finds neither in the soil nor the climate the degree of humidity necessary to start and develop it. These uninhabitable plains are designated by the name of salt plains, and they occupy a comparatively extensive area in several of the Western States; they diminish or entirely disappear, as the frontier of Canada is approached in the Minnesota region, to reappear in the great Missouri Coteau; more to the west, where a large part of the country is hardly cultivable.\n\nThe prairies of the Canadian North West, on the contrary, at least in the part we are describing, have been formed by the burning of forests which formerly clothed these immense plains, except perhaps a very small section in the region bordering on the Elbow of the South Saskatchewan, where the aridity of the great Missouri Coteau makes itself somewhat felt.\n\nWith this slight exception, all our prairies owe their origin to the conflagrations which have destroyed the primitive forest, for the most part composed of conifers, birches, and other similar species. For a long time, this fact seemed scarcely probable, but latterly it has been established without a question by the explorations of the Geological Survey. \"Whatever may have been,\" writes Dr Selwyn, \"the effect of those disastrous conflagrations on this region from a hygometric point of view, it is beyond doubt that at different epochs nearly every superficial mile of the region comprised between the Red River and the Rocky Mountains has been subjected to the action of fire, and that hundreds of square miles of forests have been thus converted into prairies nearly stripped of trees. (1).\" Dr Dawson, another member of the geological staff, has stated the same fact respecting the valley of the Peace River. \"Whatever may be,\" he says: \"the theory adopted, or that any one has been able to propose, as an explanation of the origin of the great prairies of the western part of America situated more to the south, the origin of the Peace River prairies is sufficiently evident. There cannot be a doubt that they have been produced, and are preserved by fires. In its nature, this is a forest country, and the young trees grow rapidly in places where the fire has not passed for several years. These fires, it is reasonable to think, are the work of men, and it is clear that before it was inhabited by the savages, this country was everywhere covered with dense forests. That the origin of the prairie zones actually existing goes back to a distant date,\n\n(1) Geological Survey of Canada, 1873-74, page 59.\nis clearly demonstrated by the appearance of these prairies, especially by\nthe fact that they are everywhere in furrows, cut by the old paths repre-\nsenting the tracks of the buffaloes, and also by the fact that in all\nfavourable localities are found hollows of saucer-like form in which the\nbuffaloes have lain and taken their sport. In the primitive state, this region\nwas probably covered with large and tall forests of conifers, principally\nspruce with, in some places, dwarf pines, aspens and poplars. These forests\nhaving been destroyed by fire, a second growth, principally of aspens but\ncontaining in some places much birch, and everywhere a certain proportion\nof conifers generally spruce, replaced the primitive forest. The aspen being\na tree which does not live long while the spruce attains a great age\nand large dimensions when let alone, the natural course of time would bring\nback the restoration of the ancient forests of spruce. The natural vegetation\nof these prairies is truly marvellous; it indicates not only the fertility of the\nsoil, but also, the existence of a sufficient quantity of humidity and of\nrain.\" (1).\n\nThese extracts upon the origin of the prairies, enable us to form some\ngenerally pretty exact idea of their present state. Since the denudation of\nthese lands is the work of fire, it is easy to see that everywhere the wooded\nparts will be found in places either low, or rendered humid by the vicinity of\nthe Rocky Mountains, and in places where humidity has presented an obstacle\nto the progress of the fires; it is easy to see also that the poplar which replaces\nthe spruce after a fire and seeks for dry soils will be ordinarily met with upon\neminences or heights marking the separation of the valleys drained by the\ndifferent rivers. This explains also how it is that in the limits assigned to the\nprairie the belts of the primitive forests still existing should be found in\nthe low region bordering the lower part of the Saskatchewan, in that situated\nto the north of this river as well as in the humid soils of the upper Athabasca,\nas far as the river Pembina, then in the similar regions in the vicinity of the\nmouth of this river, prolonged to the north in the lower valley of the Peace\nriver, along Great Slave river, and at last along the Rocky Mountains.\n\nBut even in the midst of the great forests which clothe the slopes of\nthe Rocky Mountains, are also found comparatively extensive prairies pro-\nceeding from the destruction of the trees by fires lighted by the savages\nin their hunting excursions; thus the upper parts of the two Saskatchewans\nand of the Athaba-ka, the Pembina river and above all, the Spruce river, one of\nthe affluents of the Peace river, have prairies in the open spaces of the\nmountains and forests. The high lands forming the slope north of the Saskat-\nchewan and separating the valley of that river from the basins in which are\nGreen and La Biche Lakes have also prairie areas, whose existence is attribu-\ntable to the same cause, since in these places, the soil is nearly everywhere\nvery fertile, and the climate sufficiently humid to allow the growth of forests like\nthose found in the primitive state in the neighboring regions, which are lower\nand more humid.\n\nIt is important to particularly insist on the origin of our rich prairies in the\nNorth West in order to show clearly that they are not caused by the aridity of\nthe soil, or the dryness of the climate, as are, for the most part, the prairies of\nthe North Western United States; and finally, it is important to well establish\nall these facts in order to dissipate any erroneous notions which may have\n\n(1) Geological Survey of Canada, 1879-80, page 63 B.\nsprung up concerning our rich and fertile plains from the perusal of certain books treating of the plains of the United States.\n\nContrary to what is the case further south, it may fearlessly be affirmed throughout the whole extent of the immense plains of North-Western Canada there is not certainly ten per cent of the lands, which are not susceptible of profitable working for the culture of cereals for pasturage or for forest industry. At least one half of these plains is composed of lands of a marvellous fertility; and as to the rest, the surveys made for some years past by the employees of the Department of the Interior, as well as by the Geological Survey, establish that there are no lands approaching sterility, except perhaps some small areas in certain parts of the region watered by the South Saskatchewan. And moreover, the first attempts at cultivation tried in these later years in nearly every part of these vast plains prove in an incontestable manner, as we shall see further on, that the climate is favourable to the growth of the ordinary cereals—wheat, barley, oats, &c.—that wheat succeeds well in the region of Great Lake to the north of the Saskatchewan, as well as in the Peace River valley much further north, and that if, in some localities, the cultivation of wheat exposed to slight drawbacks, these drawbacks are due to local circumstances and in no way affect the general adaptability of the climate to the cultivation of wheat and all other grains.\n\nUntil lately, the only drawback pointed out in the way of the colonization of the great plains of the North West, was the scarcity of fuel and wood for building purposes. But recent and multiplied surveys pursued in every direction along the Rocky Mountains and beyond the Peace River, establish the fact that coal is found in inexhaustible quantities in the lands lying east of the mountains, and that in this same region, and in nearly all parts of the plains, over areas more or less restricted, there is an abundance of good wood for building without counting the poplar which is nearly everywhere found in sufficient quantity for fuel and the construction of fences. As to coal Dr. Dawson (1) has established the fact that in the regions of Belly and Bow rivers alone, taking only the indications of the most easy and least costly survey, there are nearly eight hundred million tons of good coal. The population of the plains will have to become very numerous to succeed in burning all that. And yet, there are indications apparently as rich in both the Saskatchewan and Athabasca regions. And the great rivers coming down from the mountains will permit this coal to be transported with the greatest facility into nearly every part of the prairie.\n\nThe drawbacks then that seemed to exist in the scarcity of fuel and wood for building exists no longer, and nothing hinders the colonization of these superb and rich prairie lands under the most advantageous conditions.\n\nOne considerable advantage which these great plains offer to colonization is their fitness for immediate cultivation. The prairie is covered with natural grasses furnishing excellent pasturage; it is ready to receive the plough share without exacting any work of clearing; so that, on arriving on the land he has chosen, the colonist can at once put his cattle to pasture, plough and harvest his crop just as if he had bought a farm a long time cultivated in the other parts of Canada. Often even, some low sections contain natural meadows producing very good hay for wintering the stock, which can besides find the own living during a part of the winter by browsing on the prairie. Indeed\n\n(1) Geological survey of Canada, 1882-32-34, p. 127 and 128.\nAfter a twelve months, the colonist who takes a prairie farm is as well, or even better established than would be after fifteen or twenty years of hard and costly labour of clearing, one who takes up land covered with forest. The rich harvests that the former reaps when he has got his prairie land under cultivation, compensate him a hundred fold for the small trouble that he can have in procuring the wood necessary for the construction of his fences or his farm buildings. And lastly, the work of road making, so indispensable for the colonist who settles in a forest country, is all done by nature in the prairie lands, where one can travel in every direction with great facility without having any road making to do. There is a still further considerable advantage, which takes away from the colonist all fear of seeing himself isolated or stopped by want of roads, for years, as often happens to the courageous settler who goes to pitch his tent in the middle of the forest. Upon the plain, one travels in every direction on wheels as freely as the navigator on the sea with his vessel, and everywhere the beasts of burden find upon the prairie itself the nourishment that elsewhere it is necessary to buy or transport.\n\nIs it possible to imagine a country more attractive in all its aspects than these beautiful and rich prairies of the west whose extent approaches immensity?\n\nCHAPTER II\n\nWOODS AND FORESTS\n\nThe two first regular explorations made in the Canadian North West, were those of Hind and Palliser, extending only to the prairies of the Red and Saskatchewan rivers; they only, so to speak, ran over the country where the prairie predominates and where consequently wood would be comparatively scarce, since these prairies have been formed by the destruction of the primitive forests by fire. Besides to travel more easily, these expeditions avoided the forest country as much as possible to follow everywhere, as well as they could, the tracks of the buffalo hunters; so that the reports published by them apply in nearly an exclusive manner to the prairie lands; it is not then astonishing that after the reading of these magnificent reports, one remains a little too much under the impression that the absence of wood would make itself strongly felt in this country so beautiful in situation and so rich as agricultural land.\n\nThis impression is incontestably erroneous. The multiplied surveys carried on in every direction, for a dozen years past, by the members of the Geological Survey as well as by the surveyors of the Department of the Interior, establish that apart from an area of comparatively little extent, along the South Saskatchewan upon the borders of the great Missouri Coteau, there is, even in the prairie region, sufficient wood for ordinary domestic use—fuel and the building of fences—as well as a considerable quantity of wood for building. Nearly everywhere, areas of prairie alternate with thickets of poplar or spruce; in several places in the southeast portion, the valleys of the creeks and rivers contain oak, maple, ash and elm capable of being utilised as lumber. All\nthis seems to show clearly enough that wood is hardly more scarce in great western plains, than it is today in the older parts of Quebec or Ontario which have been cleared.\n\nBut if wood, and above all, building timber, is not as abundant as one could desire on the prairies themselves, it must be admitted that it abounds in the forest zone bordering these prairies to the west, north, and east. The whole eastern slope of the Rocky Mountains from the frontier of the United States to beyond the Peace River over a mean width of more than a hundred miles is a country of forests, in which abound the finest building woods, except the hardwoods and white pine. In these forests as in those of the North Saskatchewan, and especially in those of the Athabasca and Peace River, white spruce abounds; it can furnish timber at least as fine in every respect if not finer than that which our eastern forests furnish for exportation and which is more and more sought for by our lumber merchants. There is also a red pine in the Rocky Mountains, and a species of hemlock met with in quantities in the great plateau from whence issue the two rivers Saskatchewan.\n\nIt seems as if it would at least be exaggerated, to contend that a country surrounded with such forests, traversed in every direction by great rivers down which the floating of wood could be done under the most advantageous conditions, along three or four hundred miles of mountains, can really suffer from scarcity of lumber, especially when it is considered that in all parts of the prairie there is poplar enough for fuel and fences, and there are even great stretches of fine timber on the tops of nearly all the hills rising in many localities above the level of the prairie. In Europe, a country which contained such forests as those of the Saskatchewan and Peace River prairies, would be called well wooded. The abundance of wood in our old provinces has rendered us more exacting, and if this is not a misfortune it is at least a great error of a nature to prevent our taking the part rightfully belonging to us, in the settlement of our superb western plains.\n\nLet us now enter into some details respecting the ligneous species which compose the forests we have sketched.\n\nThe hard woods of full grown trees are not numerous as species; they comprise only oak, maple, ash, elm and birch.\n\nThe oak is only met with in the southeast part of the district of Assiniboia; especially on the river Souris and its tributaries, notably in the valley of the creek Pierre-a-Calumet, where it is large enough to be used for lumber and building.\n\nThe maple (Aegundo aceroides, Aegundo fraxinifolium, ash leaved maple and Gignier maple) spreads over a much more extensive area. The expedition of Palliser established that it existed in the Rocky Mountains, generally as shrub, not far from the sources of the Saskatchewan. More to the east, in the vicinity of Lake Manitou, in the valley of Battle River, this tree is large enough and in sufficient numbers to be tapped by the Indians who convert its sap into sugar and syrup. There is also some maple in all the region lying between the United States frontier, the South Saskatchewan and the river Qu'Appelle, especially between the Cypress and Wood Mountains. In the valleys of Maple and Moose Jaw Creeks, the tree measures from ten to fourteen inches in diameter, and covers considerable spaces. Its cultivation by planting has been tried with success; at Victoria, a dozen miles north of the 54th parallel; but in the natural state, it has not been found farther north than Lat. 32° 30', and about Long. 109°, in the valley of Battle River. The most considerable forests of it are probably found in the\nvalley of the Carrot River, one of the principal affluents of the Saskatchewan in its lower course. There is besides maple in the region of the Elbow of the South Saskatchewan, chiefly in townships 23, 24, 25 and 26, ranges 7 and 8 where this tree is from ten to fourteen inches in diameter.\n\nThe elm and the ash grow in the same regions as the maple, except that as trees of an old growth they do not pass the longitude of the Cypress Mountains. The finest elms are found in the neighbourhood of Fort Cumberland, especially in the beautiful rich valley of the Carrot River, which also contains a good deal of ash. There are also both ash and elm, ten to fourteen inches in diameter, a little to the north west of the elbow of the South Saskatchewan in townships 23, 24, 25 and 26, ranges 7 and 8 as well, as in many other places which it would take too long to enumerate.\n\nThe birch grows in all parts of the territory; mixed nearly always with the ligneous forest trees, principally spruce and poplar. In the Athabasca region and that of the Peace River, as well as in the valley of Carrot River, this tree attains to two feet in diameter, and constitutes in many places a precious resource both for timber and fuel. When these regions shall have been peopled, it will be of great use for the making of furniture, as it is already in some of our older provinces.\n\nIn these north western forests, the conifers are represented by the cedar, cypress or Banksian pine, red pine, fir, a species of tamarack, black spruce, red spruce and especially white spruce which forms much the greatest part of all these forests.\n\nThere is white cedar (Thuja Occidentalis) in the Rocky Mountain region, where it is of colossal dimensions, at the sources of the river Saskatchewan, in Kicking Horse Pass, and in the adjoining valley of the Kootenay river. The expedition of Palliser went through places where these trees measured four or five feet in diameter at four or five feet from the ground and were a hundred to a hundred and twenty feet in length. They are in sufficient quantity to make an important object of export, and the more readily that the Canadian Pacific Railway crosses this region and furnishes the desired means of transport. In British Columbia, cedar is much used for making shingles; it could be put to the same use on the plains of the Saskatchewan, and especially be very advantageously employed in making stakes and rails for fences, as is practised in the eastern provinces.\n\nThe cypress (Pinus contorta, Pinus banksiana) is a cosmopolite tree; it is found nearly everywhere on the plains, on the plateaux of the mountains, upon high and poor lands. It crosses the chain of the Rocky Mountains into the valley of the Peace River and is met in more or less great abundance over a very extensive area, generally on the higher parts of the plateau, or on poor lands. It is found in considerable quantities and of very good dimensions in the high lands forming the watershed between the Athabasca and the Saskatchewan. Naturally it grows on the Cypress mountains, to which it gives its name and as far as twenty miles east of Fort Walsh. Towards the north, it is again found as far as Clear Water valley, and in the valley of Peace River, between Dunvegan and Fort Saint John.\n\nThis tree springs up on high and gravelly lands, but does not disdain the richest soils, in which it attains a height of from 60 to 100 feet and more than two feet in diameter. Its wood is not much used; because generally it is of small dimensions; but it is white, durable enough, and merits to be looked after in those places where the tree attains proportions fit to make logs.\n\nThe red pine (Pinus resinosa, Pinus ponderosa) is found in more or less\ngreat quantity in the vicinity of Lake Waterton, near the United States frontier, in the valley of Bow River, above Morleyville, on the banks of the North Saskatchewan, especially in the neighbourhood of Rocky Mountain House, and nearly the whole length of the river as far as Fort Carlton. The trees that Dr. Hector saw in this last place and at Rocky Mountain House measured six inches in diameter on an average, were straight and free from branches to a height of 60 or 70 feet.\n\nIn the neighbourhood of the Rocky Mountain House, in the valley of Clearwater River, and in that of Whistling River, this pine enters largely into the composition of the forest. \"The wood is very good,\" says Dr. Hector, \"but not of large dimensions.\" On the high grounds I have remarked here what I think ought to be the *Pinus resinosa*. The tree that I suppose to be the *Pinus resinosa*, has a beautiful straight trunk nearly without branches up to a height of 70 feet; the trunk is often sixteen inches in diameter and goes up diminishing like a mast. The cones and foliage resemble a little those of another pine which grows in abundance on the gravelly terraces.\n\nDr. Hector saw in the same places another pine which the Hudson Bay Company's people designate by the name of \"cypress,\" but which he thought was the *Pinus banksiana*. \"This tree,\" says he, \"corresponds very nearly with the *Pinus inops* of New Jersey, but has more vigorous habitudes, and several other particular characteristics. It is the same that I saw near Carlton, and that, after leaving that locality, I only saw again along the Saskatchewan, beyond Edmonton, and never in any quantity, except in the vicinity of Rocky Mountain House. It only seems to grow in light soils, and prefers the slope of the terraces.\"\n\nIn the Kicking Horse Pass, Dr. Hector found another species of pine (*Pinus Lambertina*), which attains enormous dimensions. This tree measures four or five feet in diameter, and its cones are nine inches long.\n\nThere is fir (*Abies balsamea*) in several places, and in the mountain region this tree attains good dimensions, especially in the region where the two rivers Saskatchewan have their sources and in the Bow River valley, in the vicinity of Mounts La Crotte and Bourgeau, where Dr. Hector reports to have found it well grown.\n\nAnother species of fir (*Abies subalpina*); Engelmann (*Abies idahoensis*, Hook) crosses the Rocky Mountains into the Peace River region. This fir grows in the cold and wet soils of the country between Little Slave Lake and the Athabasca. It is often more than two feet in diameter, but it is said that its wood is of little value. It is very abundant in groves of great extent east of Lake McLeod, in the country watered by Parsnip River.\n\nIn the same region, that is to say from Rocky Mountain House to the United States frontier, from north to south and as far as beyond Kicking Horse Pass, the expedition of Palliser found in considerable quantities, a species of Hemlock (*Tsuga Mertensiana*) which attains colossal proportions four to five feet in diameter and a hundred and a hundred and twenty in height. The foliage of this tree much resembles that of the hemlock of the eastern province, but the bark is completely different, and so much resembles that of the balsam poplar, that to distinguish the two trees one is absolutely obliged to look at the foliage. The cone of this species is only two inches long, and is formed of large prickly scales. This tree gives good timber and in British Columbia where it attains to 200 feet in height, its bark is successfully employed in tanning. Sir Alexander Mackenzie states that he has seen this species of hemlock in the region from which the Parsnip river, one of the\nbranches of the Peace, takes its rise, which would place the growth of this tree, really valuable both for its bark and wood as far as north as 54° 30'.\n\nThe other varieties of the Abietinae family are red spruce, black spruce and white spruce.\n\nThe red spruce or American Larch (Larix Americana) grows in nearly all parts of the four great provisional districts we are describing and even further to the north. This tree is found in abundance in the swampy parts of the great plateau of the Peace river as well as in the valley of the Athabasca. In the country about Lake Athabasca as in the valley of Beaver river the red spruce attains its greatest perfection on high and dry lands, of good quality, as well as in the good lands which border the lakes and rivers.\n\nThere is in the Kootenay river valley and in the country about the sources of the Saskatchewan, another species of larch (Larix occidentalis) of enormous proportions, as are nearly all the trees of that country. The expedition of Palliser saw these red spruces measuring four or five feet in diameter and more than a hundred and twenty-five feet in height. The trunk of this tree is straight, its bark hard, and its colour pale red. The wood of this species of tree is as hard and strong as that of the ordinary red spruce, but more coarse.\n\nThe black spruce (Abies nigra) has the same habitat as the white spruce but is far from being as abundant. In compensation, its wood is more durable. This tree seeks the tops of the hills and the swampy and cold lands; it attains to dimensions sufficiently large to make good building timber. It is compact enough and durable enough to be very advantageous employed for railway ties, so much the more that its ordinary proportions render it eminently suited to this purpose. There is much of this spruce on the hills and in the swampy places of the Athabasca region.\n\nThe white spruce (Abies alba) is much the most abundant ligneous tree in all parts of the great plains of the North West. Here, this tree attains its perfect development, and in many places specimens measuring thirty inches in diameter and from a hundred to a hundred and twenty in height, have been found in considerable quantities. It seeks by preference the borders of the lakes and rivers, and especially the valleys in which the soil is rich and sufficiently dry, which may explain why it is so abundant on the fertile plains of the Saskatchewan and the Peace River where these two qualities are everywhere found. This tree forms forests, valuable both for the quality of the wood and for their extent, in the lower valley of the North Saskatchewan, going down from the Forks, in the rich valley of Carrot river, in the region north of the Elbow as far as the valley of Beaver river; in the valley of Sturgeon river and Lake St. Anne behind Edmonton and as far as Rocky Mountain House. It is also white spruce that is found in the superb forests of the upper half of the valleys of Battle and La Biche rivers, and finally, it is also white spruce which forms the greater part of the forests of the Peace river plateau, of the Athabasca valley and of that of the Great Slave river, as far as the northern line of the District of Athabasca. It is still white spruce which forms the greater part of the clumps of primeval forest which are scattered nearly everywhere over the prairies properly so called. Everywhere this wood is generally large enough and long enough to be advantageously employed for building purposes; and in many localities it is very superior to that which our forests of the eastern provinces furnish for trade and export.\n\nThere are three species of poplar in the country we are describing; the aspen (Populus tremuloides), the balsam poplar (Populus balsamifera), and an\nother poplar which explorers designate under the different names of *populus grandidentata*, *populus trichocarpa*, or perhaps *montifera*.\n\nThis last species and the balsam poplar, which are probably only two varieties of the same species, are nearly invariably met with in the valleys of the rivers in which these trees attain very great dimensions. In the valley of the Parsnip, in that of Peace river and above all in the valley of the South Saskatchewan, in the past bordering on the great Missouri Coteau, these poplars spring up in nearly all quarters in the hollows and islands. They are four to five feet in diameter in the Peace river country; they are also large enough on the banks of the South Saskatchewan, and the people of Palliser's expedition measured some nine feet seven inches in circumference in Bow River valley, near Mutton creek where these large trees were found in very considerable numbers.\n\nThe aspen is much more abundant, and in our north west plains it always indicates a very fertile soil. It ordinarily springs in clumps among the forests of white spruce, and invariably replaces that tree when it is destroyed by fire. In the prairies, it is the clumps and thickets of aspens, one finds everywhere which vary the monotony of the landscape and give in many places to the plain, the appearance of beautiful artificial parks. Its wood furnishes a good part of the material employed in the construction of fences and even of farm buildings. Like its congener, the balsam poplar, it furnishes to the savages the bark with which to make their cabins as well as their canoes, which they construct by hollowing out the trunk of these great trees. The aspen is generally from twelve to twenty-four inches in diameter and its wood gives a good enough fuel, burning with less flame and making fewer sparks than the spruce and the other resinous woods. It is, par excellence, the wood of the prairie.\n\nThe extracts which follow show from evidence that it requires a good deal of imagination to entertain seriously the idea that on our North Western plains wood is sufficiently scarce to constitute a real inconvenience, a serious obstacle to colonisation. Without doubt wood is more scarce, since it is a prairie country than in the eastern provinces which are a wooded country; but there is sufficient wood for domestic uses—fuel, fences and the greater part of the farm buildings—and building timber abounds in the Rocky Mountain region in places where it can be floated down the rivers, with the greatest facility into every part of the plain situated more to the east, and it abounds also in the lower valley of the Saskatchewan and a little to the north of that river from the Forks to Rocky Mountain House. Finally it forms forests as beautiful and as abundant as those of our old provinces to the east, in the country where the Battle and La Biche rivers take their rise. What more is to be desired? After all, does not a good part of this lumber, for carpenter work and furniture, which is used in the south east parts of the provinces of Quebec and Ontario, come from the north, and is it not taken distances of three or four hundred miles and even more from the Realutes where this wood is consumed. The distance is no greater between the plains of the lower Saskatchewan and the superb forests which border the upper courses of that river and its principal affluents.\n\nLet us complete our researches by some more circumstantial details, of a nature to show thoroughly how much there is of false and erroneous in the idea that the scarcity of wood can form a serious obstacle to the well being of the population who will inhabit along the four rich districts of Assiniboia, Alberta, Saskatchewan and Athabasca.\n\nThe forests of this vast territory naturally divide themselves into three\nclasses sufficiently distinct, which may be designated as hard wood forests, mountain forests, and plain forests.\n\nThe hard wood forests, if the birch is taken out of this class, are only found in the south and southeastern parts of the territory. They are composed of oak, maple, ash and elm, which grow either isolated or in small clumps. The oak is found only in the valleys of the Qu'Appelle and Assiniboine. The maple forms forests of some size in the Battle River region, along certain parts of the South Saskatchewan, of Carrot River and especially of the creek to which this wood gives its name. This tree appears to the west as far as Cypress mountains and Palliser found it still farther in the Rocky Mountains along Kicking Horse Pass. At this place, as nearly everywhere else, the ash accompanies the maple and there are there two feet in diameter. This last wood is more abundant in the region of the South Saskatchewan and Carrot River, where there is likewise elm of good size. Let us cite the very words of some of the explorers, the better to see the value of these second growth forests and the uses to which they can be put.\n\n\"In the forest behind our camp (near the sources of the Saskatchewan and the Kicking Horse Pass) there is some moose wood (Corylus). There is also now much hard wood, especially maple and mountain ash.\" (Palliser's Explorations in B. N. America, page 152.)\n\n\"We saw maple with ash leaves (in the neighbourhood of the Elbow of the South Saskatchewan) but not in abundance. We found also a species of ash and two kinds of birch.\" (Palliser's Explorations, page 54.)\n\n\"The northern extremity of this valley (of Wig'atignou or Grande Coulee, one of the affluents of the Battle River, Lat. about 52° 30', Long. 109°,) is principally wooded with aspen; ash-leaved maple and white birch are in small quantities. The aspens are the most beautiful specimens of the species we have seen in this country. At the southern extremity of the valley, there was a great wood of ash-leaved maple, where we found the traces of an Indian camp, indicating that a party of these savages had come here in the spring to make their sugar.\" (Palliser's Expedition, page 85.)\n\n\"The bottom of the creek upon which the farm is established contains aspens and maples, the first, the largest I have ever seen in the North West, some trees measuring three feet in diameter.\" (Report of the Minister of the Interior for 1880, page 15.)\n\n\"There is upon the north side of these hills (the Cactus Hill,) a good number of deep ravines containing a great quantity of good wood for fuel, viz: ash, maple and poplar, with an abundance of cherry and burning bushes.\"\n\n\"The river Moose Jaw crosses section 36, (Township 15, range 26) three times. There is in the valley a considerable quantity of wood, principally ash and maple.\" (Report Min. Int. for 1880, page 70.)\n\n\"The Creek (Magic, Township 8, Range 17) is bordered by a skirt of wood composed of ash, maple, elm and alder in sufficient quantity and large enough dimensions to furnish the settlers for many years with wood for fuel and fencing.\" (R. M. I. for 1880, page 120.)\n\n\"Along the whole of Moose Jaw Creek there are ash from five to twenty inches in diameter.\" (R. M. I. for 1880, page 128.)\n\n\"In sections 24 and 19 (range 18, township 7) I crossed a creek running in a northeast direction. This creek is bordered with large elms and ash.\" (Report Minister Interior for 1881, page 129.)\n\n\"The bed of the South Saskatchewan (Township 31, range 8) is much obstructed by sand bars. The two banks are raised and bordered with a\n\"considerable quantity of fine wood, ash, maple and poplar.\" (Report Min. Int. for 1880, page 110.)\n\n\"The Eagle was crossed twice ('Township 46, range 11.\") Upon its banks there is good wood for fuel, ash, maple and alder.\" R. M. J. for 1880, page 111.\n\n\"These ravines (township 31, range 18) contain a good deal of wood of fair size, ash, maple and poplar.\" (Item page 115.)\n\n\"For thirty miles east of this post (at the Wood mountains, about lat. 49° 50' and long. 106° 40') as far as the Great Mud river, I found good clear wood in great quantity, of which I think could be made axles, spokes of wheels, shafts, double and single, and poles, of quite as good a quality as those at present imported for the use of the Mounted Police.\" J. M. Walsh, superintendent of the M. P.\"—(Report Min. Int. for 1879, Part III, page 12.)\n\n\"Over a distance of nearly 80 miles in a straight line, to the east of Fort à la Corne, the Carrot river crosses a fertile country, well wooded and well drained.... There are many large woods, especially along the lower part of the river, which are composed of spruce, poplar, balsam poplar, maple, elm, &c. According to the Indians, these woods extend far back from the river\" (A. L. Russell, Report Min. Int., for 1879, Part II, page 21.)\n\nThese extracts show clearly enough that in the southern part and to the east of the prairies of the Saskatchewan, the hard woods are far from being wanting.\n\nThe mountain forests are found on the higher points of the eastern slope of the Rocky Mountains, from the frontier of the United States to beyond the Peace River, between the line made by the crest of these mountains, and the parallel range which forms the western limit of the great plains of the Saskatchewan and Peace Rivers. This great plateau extends over more than 40,000 square miles, enjoys a moist and temperate climate, most propitious to forest vegetation, as we shall elsewhere see.\n\nBesides the hard woods we have mentioned above, the ligneous trees which compose these forests, are cypress, red pine, white cedar, fir, red spruce, black spruce, white spruce; and, the hemlock of the west. In the southern part from the American frontier as far as beyond the upper valley of the North Saskatchewan, these trees, in many places and over great extents, attain colossal dimensions. Further on, there is little but white spruce, but it is generally very fine, and combines the qualities desired both for good sawn wood and for timber. A few extracts will suffice to give a good idea of these forests.\n\n\"After marching three miles, we perceived a path leading to the ford which crosses Bow river on the way to Kananaskis pass. Up to this time, the road we followed, passed through beautiful forests of young pines.... Up the river from the place where the valley narrows, we penetrated into a labyrinth of dense forests where a portion of the black pines are very large.... At daylight, we started to make the ascent of Mont à la Grotte. After having ascended 500 feet, we came out of the wood, but rather in mounting to the top of great wrinkled rocks than in any other way, for the great trees shot up 800 feet higher on favorable pieces of ground.\" (Pulliser's Expedition, p. 99.)\n\n\"Lower than this point by 500 feet, the forest (in the vicinity of Cascade Mountains) is composed of pines of fine growth, then come the trees that one ordinarily finds in the valleys among mountains, among which the white and black spruce are the largest, mixed with birch and sometimes with hemlock, a species of conifer seen for the first time at the Bow fort, and which resembles the hemlock of Canada.\" (Pulliser's Expedition, p. 101.)\n\"We had climbed six hours through the woods, when we reached to the level of the trees, but we had not made more than a dozen miles, we had not crossed the rocky lands, and in fact, we were still far from the limits of the forest, the trees being even larger and finer than in the Bow River valley.\" (Idem, p. 102.)\n\n\"Three hours marching brought us to a great tributary coming from the north and having its source in Mount Ball.... The valley was still well wooded. We had become entangled in a forest of cedars, the first I have seen since leaving Lake Winnipeg.\" (Idem, p. 103.)\n\n\"We had ascended a good deal and went on our way over terraces of gravel where the wood was pine, as is ordinarily the case in such a soil. At noon, we stopped at 50° 52' Lat., being still in forests so thick that we travelled with difficulty. I sent Pierre and Nimrod to explore the land. After having crossed the Kootenay river, they returned and gave us great tales of the size of the wood they found there.\"\n\n\"After three hours, we descended 1300 feet to the bottom of the valley and crossed the river Kootenay. The valley was two or three miles wide, and the woods very fine on both sides, especially the southern.\" (Idem, p. 104.)\n\n\"Here was small maple in abundance, and there lay the trunks of great cedars, all the fine wood having been burned. Besides white spruce, which attains great size, there is another spruce which we saw at Bow River. It is very large in the valley, often four or five feet in diameter. It is not a very tall tree, however, but it has very strong branches. In its foliage, it resembles much the hemlock of Canada.\" (Palliser's Expedition; pages 104-105.)\n\n\"At the end of five miles, the valley (of Kicking Horse river) is terminated by a sharp declivity, covered with forests of large pines.... During the first part of the ascent, we saw a good deal of cedar and birch; but going higher, we penetrated forests composed of pine exclusively.\" (Idem, pages 106-107.)\n\n\"Ascending this rolling prairie (at the sources of Bow river) we arrived at a beautiful pine forest, which covered the valley and we halted just at the point where the valley begins to descend to the north west, Lat. 51° 40'. The altitude of this place is nearly 6,350 feet above the sea. On leaving this afternoon, a march of some hundred rods brought us to a stream of water, small at first, but soon swelled by numerous branches, which flows into the north Saskatchewan. The channel of the Saskatchewan opposite our camp (15 or 20 miles from its source) is 150 rods wide. The Saskatchewan is already a large river, with a deep and rapid course even so near its source. The valley is very extensive and its borders thickly wooded.\" (Palliser's Expedition, p. 109.)\n\n\"The terraces along the borders of the Kootenay plains are superbly marked, rising by steps several hundred feet above the river. The highest terraces are wooded with cypress of vigorous growth and full of brush wood.\" (Idem, p. 113.)\n\n\"The region of the great valley comprised between the great Brazeau chain and the mountains proper is very beautiful. The wood has been greatly destroyed by fire, but there still remain fine clumps, while at the same time, in the open parts there are rich pasture grounds, with intervals of poplars and alders.\" (Idem, p. 113.)\n\n\"The Saskatchewan turns to the south east to cut through the range of the Brazeau Mountains.... After some miles of travel through open forest, we entered as we approached the hills into a thick forest of spruce.... We\nbegan to see in the low lands red spruce, a wood not common in the moun-\ntains... We again descended to the river and found the valley much larger\nthan before with great alluvial plateau. The wood on these is very fine; a\ngood number of balsam poplars and white spruce being very large.\" (Idem,\npage 115.)\n\n\"We marched 4½ hours (in the valley of Whistling river) to get to the\nSaskatchewan (at Pointe-aux-Pins, lat. 51°, 58', long. 117° 2'), at first through\nvery troublesome woods, but the last five miles on terraces of slaty,\nschist. These terraces are wooded with a fine species of pine, whose foliage\nis composed of little detached tufts of a greyish green colour. The trunk\nis slender and attains a height of nearly double that of the so called cypress\nwith a spruce cone. It differs also from the pine that I saw last year on the\nopposite side of this valley, which is very robust with great knotty branches,\nand a thick foliage.\" (Idem, p. 149.)\n\n\"We camped here (in the vicinity of the sources of the South Saskatchewan)\nupon the bank of a little lake and in a beautiful open forest, where the\nwood is of fine quality.... The wood is composed of large trees of several\nspecies, with a strong growth of cedar shrubs.... The trees are now very\nfine, a good number of cedars and pines attaining a height of 120 feet.\nThe under growth is very thick, composed of cedar, white maple and alder.\nThe depth of the decomposed vegetable soil is also very great, and it is\nevident that during ages the forest has not been disturbed.\" (Idem, p. 151.)\n\n\"We camped upon an island (not far from Kicking Horse River) covered\nwith pines, birches, cedars, spruce, junipers and cherries. A part of the\ntrees were high and large.\" (Idem, p. 153.)\n\n\"The wide and swampy bottom of the valley is now replaced by terraces\ndry and smooth, on which are found a forest of pines, free from brushwood.\nWe encamped in a grove of spruce, which surrounds the calcareous springs.\n\nThe trees are in great part of a kind of spruce-pine, with a rough bark,\nthat we saw for the first time at Bow River and designated as hemlock,\nalthough it is not the true hemlock of Canada.... We arrived at a series\nof prairies, and passed the end of the trail leading from the Vermillion pass,\ntowards Lat. 50° 29'. There are here large specimens of hemlock, but the\nthick woods are composed of pines.... Some miles after crossing the river\nKootenay, we encamped in a forest of splendid trees, especially of the pine\nI have mentioned and of a species of gigantic larch (Larix occidentalis). In\nmeasuring one of these pines of a mean size, I found that it was 120 feet\nhigh, and 11 feet in circumference four feet from the ground. The bark is\npale red and divided into great oblong slabs separated by deep fissures.\nThis bark is four or five inches thick and makes an excellent fuel. The\nlarch is a higher and smaller tree, but I have seen it five feet in diameter.\"\n(Palliser's Expedition, pages 153-5.)\n\nThese extracts apply to the region comprised between 49° and 52° 20' of\nlatitude, from south to north, and between the Brazeau chain and the axis of\nthe solid mass of the Rocky Mountains that is to say, an area of nearly 225\nby 50 miles, or of 12,250 square miles. In the south Saskatchewan region,\nthe tributaries of that river permit the wood to be easily brought to the\nPacific railway, which passes into the valley of that river in order to go\nthrough Kicking Horse Pass, in such a way that the transport of wood, from\nthe mountains into the plains farther east, need not be a matter of any\ndifficulty.\n\nWe have seen above that only a few miles from its most distant sources the\nNorth Saskatchewan is already a large river 450 feet wide, with a deep and rapid flow which offers all desirable advantages for the floating of wood. Consequently it would be easy to take out of the mountains the product of the fine forests through which this river runs, which river it is said, is exceedingly favourable to the descent of the wood, since it is interrupted only by a little fall of three feet, from Rocky Mountain House, near its source as far as Edmonton.\n\nThe working of these forests offers another advantage that it is not out of place to point out.\n\nIn the provinces of Quebec and Ontario, our lumber merchants are often obliged to make clearings in the very middle of the forest, to procure the forage which they need for the beasts of burden they employ in their shanties. In the region we are describing there are nearly everywhere sufficiently great extents of natural prairies, where the animals of the shanties could easily find their living in summer, as well as swamps where possibly a great part of the hay necessary to winter them could be cut. And finally, the supplies could be easily transported with horses, since the expedition of Palliser went over the whole country with horses to carry the baggage and the provisions.\n\nThe mountain forests lying between the North Saskatchewan and the Peace River have been little explored; but from what is known of them it seems to be established that these forests are similar both in the variety and quality of their wood, to those of the southern part. They contain the same ligneous trees, of which some attain colossal proportions. In the valley of the Parsnip river towards 54° 30' of latitude, Sir Alexander Mackenzie found cedar, maple hemlock, &c. This last species is evidently the big hemlock with the bark of the poplar, which is found in abundance in the Saskatchewan region, and which Dr. Hector saw also in the vicinity of the sources of the Athabasca.\n\nThe white spruce, large and fine, is met with nearly everywhere, and even the balsam poplar in favourable places. Some extracts will give a better idea of the character of these forests:\n\n\"We have now crossed the river three times and are encamped above the mouth of the Malin river (thirty miles to the southwest of fort Jasper, and towards 53° of latitude and 118° 10' of longitude.) We have seen today many fine trees, and our march has been impeded by the trunks of this hemlock which is a species of spruce pine resembling hemlock, but with a different cone.\" (Palliser's Explorations, p. 128.)\n\n\"The trail leading to the camp of the free men (thirty miles north of fort Jasper and towards latitude 53° 30', and longitude 118°) passes at first through fine large forests.\" (Idem, p. 127.)\n\n\"We run over nine miles of the sand hills which occupy the bottom of the Athabasca valley and which are nearly everywhere covered with trees of fine growth.\" (Idem, p. 128.)\n\n\"I remained up in the borders of this river (the Parsnip, lat. 54° 25', several trees and plants that I had not seen to the north of 52°; such as cedar, maple hemlock, &c.\" (MacKenzie's voyage, page 223.)\n\n\"The vegetation in the valley of the Parsnip river differs very little from that of the region about Lake McLeod. The spruce forests seem to be continuous on both sides of the river; but the banks and great spaces devastated by fire are often covered with aspens. There is fine birch, (Betula papyracea) and thickets of tall elms border the little tributaries. In general the forest is composed of quite large trees, a good number of the spruces being more than two feet in diameter.\" (Geological survey of Canada, 1875-76, p. 143.—Macoun.)\n\"The country east of Parsnip river is entirely covered with dense forests, fallen down or burned. For ten or twelve miles going up the Misinchinca, alders and sombre coppices of great spruces border the river. In several places are found big black spruces and big poplars; some of these last measure five feet in diameter.\" (Geological Survey of Canada, 1879-80, p. 35)\n\n\"In leaving the Precipice,\" the source of the South Spruce river, not far from Lake Azouzetta, which is the source of this river, the valley is thickly wooded and contains belts of large fine trees.... From the mouth of the Misinchinca up to a point on Spruce river, situated seven miles to the north west of the highest part of the Mountains' range, (about thirty miles) the humidity of the climate is shown by the vegetation and in other ways; the forest fires have been very numerous and have not affected great extents. The valleys are filled with dense sombre forests of spruce, and the trees attain great dimensions.\" (Ibid, p. 38 B.)\n\n\"From the Precipice\" towards the head of the Spruce River south) up to this place (Lat. 55° 25', Long. 122° 32'), to the east of the Rocky Mountains, the slope is nearly uniform, and the river flows in a bed of very small pebbles. The valley is thickly wooded with spruce and poplar of good quality.\" (Canadian Pacific Railway Survey, 1878, p. 77).\n\nAll testimony goes to establish the fact that the mountain regions contain forests of irrefutable value, which will always be capable of furnishing good building timber to the plains which border that region to the east, with the Athabasca, Spruce, Parsnip and Peace rivers, as means of transport for bringing down these woods from the mountains to the plains.\n\nThese, besides, have also their forests containing fine and good building timber, especially in the zone bordering the Rocky Mountains, called by the explorers the Foot Hills. To the east the general limit of this forest zone follows very nearly the meridian formed by 113° 30' of longitude, from the 49th parallel as far as the water shed between the basin of the Saskatchewan and that of the Athabasca. The area comprised between these two lines and the flank of the Rocky Mountains forms a great triangle having its base to the east and its other longer side to the north, which clearly enough indicates that the width of this wooded zone increases as it goes in the direction of the Athabasca.\n\nThe finest part of these forests is found in the region crossed by the upper courses of Battle and La Biche rivers, and that of the North Saskatchewan from Rocky Mountain House to about 20 miles from Edmonton. In all these fine forests, the white spruce is the tree which dominates—and it is in general very fine—but there are also cypress, red pine and especially very fine balsam poplar. The intervals of prairie which in many places alternate with the forest, and the rivers navigable for rafts which flow this country in every direction, render the working of these fine forests more easy and more profitable, and this explains why a good portion of these wooded lands is already taken up. There are also fine forests in the Bow River region, but they are less extensive than those in the country farther north. In compensation there are on the Bow River and the Kananaskis, one of its tributaries, several cascades and falls capable of furnishing water power at little expense for a good number of saw mills. The forests of the Bow River and its tributaries are already being worked, and supply a good part of the building material used at Calgary and elsewhere.\nLet us see what explorers have said of the trees found in this great forest region.\n\nAlong the foot of the Rocky Mountains there is a tract of country presenting very peculiar characteristics which has been called \"The Foot Hills.\" Long borders of high grounds alternate with parallel valleys through which flow little streams of water; the streams which have their sources in the mountains have hollowed nearly at right angles out through this region, deep beds in order to reach the plains which lie beyond. The portion of this region not wooded is covered with a luxuriant growth of buffalo grass, and there is fine building timber (generally Oregon pine, Douglass fir) in considerable quantity in some of the more sheltered valleys.\n\n\"After leaving the 49th parallel, for a distance of twenty four miles in a north west direction along the foot of the mountains, the foot hills are not high, and contain but few continuous extents of forest, except in the upper part of the valley of the Great Belly river. The land is covered with a fine buffalo grass, and the trees are in great part massed in the valleys. From this point, in going towards the north, the foot hills grow larger, there are considerable extents of forest, chiefly in the immediate vicinity of the mountains, and before Bow River is reached, a great part of the Foot Hill region is covered with forests more or less dense.\" (Geological survey of Canada 1879-80, p. 11, Dawson.)\n\n\"The banks of the river (Bow, long 113° 30', lat. 51°) are nearly 120 feet high, the valley is very nearly a mile wide and bears a good growth of alders and poplars. A balsam poplar measured 9 feet 7 inches in circumference, and we saw a fine clump of white spruce two miles higher up. In resuming our southward course, we found ourselves again in the fertile zone; the land was good and undulating. The valleys of the tributaries of Bow river contain considerable quantities of wood of good dimensions fit for lumber. We made twelve miles. The coulees are not as abrupt as yesterday, and the wood generally better. I measured a poplar 9½ feet in circumference at the height of my shoulder. We saw white spruce in abundance along the two insignificant tributaries we had crossed.\" (Palliser's Exploration p. 91.)\n\n\"A little higher up than this place, the Little La Biche river, coming from the south west, and Medicine river, from the north west, empty into the Great La Biche River. At the expansion of the valley at the confluence of these rivers, there are extensive forests of large white spruce.\" (Idem, p. 119).\n\n\"The banks of the river (Little La Biche) are very high and covered with a thick pine forest—after six miles marching, we began the ascent of a series of terraces dry, gravelly, and covered with cypress—After going some miles, we descended rapidly from the terraces and went along the valley of the little river La Biche. There is in this valley much pasturage and abundance of good building timber. In the evening, we descended to the river and camped under some splendid pines.\" (Idem, page 120.)\n\n\"At the confluence of the rivers La Biche and Medicine, fine building timber is in abundance, and if a mill is ever established at this place (Beef Lake) nothing would be more easy than to float down the wood by the river La Biche. In this place (Deadman's Creek) spruce appears to be in considerable abundance.\" (Idem, p. 88.)\n\n\"Making our way across an uneven and wooded country, we descended into the valley of the La Biche river (about lat. 52° 19', long. 113° 3'). There are fine forests in the valley of the La Biche river, and the more one proceeds towards its source, the more abundant is the wood.\" (Idem, p. 89.)\n\"Here the river (La Biche, range 7, base line west of 5th initial meridian) is 600 feet higher than where it crosses range 6. The trees, chiefly of pines and white spruce, are much larger; there are trees, thirty inches in diameter. The little valleys contain white spruce, and the heights, pine.\" (Rept. Dept. Int. 1883; part II, p. 73.)\n\n\"As Battle River is approached, the country is more wooded. West of the river, the line goes through a very fine clump of spruce; many of the trees are 100 feet high, and at least 8 to 20 inches in diameter.\" (Idem, p. 103.)\n\n\"The 14th base line passes through a section of well wooded country. Poplar is found there and cotton wood 4 to 8 inches in diameter. Belts of white spruce, 8 to 20 inches and 60 feet high.\" (Idem, p. 104)\n\n\"Range 4. (11th base line, west of 4th initial meridian). There are alders, poplars, groves of white and red spruce.\" (Idem, p. 105.)\n\n\"Range 5. Is full of white spruce, cotton wood, balsam and poplar in groves. With the exception of some open spaces of prairie, all the range is thickly wooded.\" (Idem, p. 105.)\n\n\"I went upwards along the river Clearwater, after leaving Rocky Mountain House, travelling on the ice, a dozen miles. The wood is good everywhere, but never of large dimensions. Upon the high lands, I have seen here what I believe to be the pinus resinosa, although all the pines are called by the Company's servants, cypress, which however is rather the pinus Banksiana. I have never seen lower down along the Saskatchewan, the tree which I suppose to be the pinus resinosa (or red pine.) Its beautiful straight trunk rises with small branches to the height of 70 feet, and the tree is often 16 inches in diameter and goes on diminishing like a mast. Besides these pines I have seen here, for the first time, since we left the boats, the abies balsamea, or the fir-tree of the voyageurs, with its fine foliage, dark green above, and silvery below. Here, however, it is not a common tree, the mass of the forest being still composed of white spruce, white birch and poplar together with the pines above mentioned.\" (Pallis r's Expedition, p. 75.)\n\n\"Here (upon Roseau Creek) I saw the pine having cones like the one that I remarked at Carleton. It appeared to me to be very abundant upon the heights, where there are strips of light and gravelly soil.\" (Idem, p. 73.)\n\n\"The great valley lying between the Brazeau range, and the principal range is very beautiful. The wood has been a good deal destroyed by fire, but there remain still great stretches of it.\" (Idem, p. 113.)\n\n\"We descended again to the river (North Saskatchewan, about lat. 52°, 26') and found the valley much wider, with great beds of alluvial soil. The trees are very fine on these bottoms, the balsam poplars and white spruce being very large.\" (Idem, p. 115.)\n\nIt would be useless to multiply these extracts, since at the present time, it is well understood that the country in which B. tte and La Biche rivers take their rise, as well as the two Saskatchewans, is one of the finest forest regions in Canada. In general, the white spruce is larger in these forests than in the greater part of those of the eastern provinces, and the working of these forests is more easy, on account of the intervals of prairie that they enclose, and the great rivers crossing them, on which logs can be floated. Good building timber in abundance is there, with rivers to bring it to the plains, where the want of this article is most felt.\n\nThe region of the North Saskatchewan from Edmonton to the Grand Forks contains also forests with an abundance of good trees for lumber especially white spruce.\nBetween Carlton and Edmonton, there is no wood of any value, south of the river; north of it, however, all along the river, between these two places, spruce, pine, fir and birch are abundant.\" (Palliser's Expedition, page 11.)\n\nAlong English river, and thence towards the west, on both sides of the Saskatchewan, and upon its northern tributaries, white spruce, pine and red spruce of small dimensions are abundant enough. Along the river, above Edmonton, large spruce is plentifully found, and every year considerable quantities are cut and floated down the river for the use of the posts and settlements lower down, as far as Carlton. Starting from about twenty miles down the river from Carlton the river passes all the way to Lake Winnipeg, through a region most thickly wooded, and white spruce, pine, and birch as well as red spruce, are mingled in a large proportion with poplar, which is still the dominant wood of these forests:\" (Geological Survey of Canada, 1873-74, p. 50—Selwyn.)\n\nPassing to the following division, and the last of the three divisions specified, it may be designated as the district of the Upper Saskatchewan or of Edmonton and Victoria, and as comprising the more immediate valley of the Saskatchewan from Saddle Lake to the 115th degree of longitude. An approximate estimate states that this district would make two hundred and forty townships. The greatest part of this tract would bear comparison advantageously as an agricultural country with those already described; good water is plentiful, and the proportion of forest to prairie is such that there is ample provision of wood for building and for lumber. The soil is so good that in many places, the surveyors were inclined to class it as equal in respect of fertility to the alluvial richness of the prairie of Manitoba.\" (Report Dept. Int. 1878, part 11, p. 7—Lindsay Russell.)\n\nSome miles to the north of Fort Saskatchewan, there is a great extent of fine spruce forest in the neighbourhood of Egg Lake, and from this is drawn a great quantity of lumber for the use of the mission of St. Albert. (Idem, p. 18.)\n\nWent up along the river two miles from Carlton, to see a grove of white spruce which is found there—the only trees except poplars which there are near the fort. In coming down the river, towards the confluence of the two Saskatchewan, there were great forests of pine and spruce, from which was drawn most of the wood with which the fort was built. Up the river again about thirty miles, there is a great \"Coulée\" where people procure birch to make axles for their carts and other things requiring hard wood.\n\nHowever, their best timber is found at Shell creek sixty miles north of this locality.\" (Pulliser's Expedition, p. 63.)\n\nThe region lying between the Saskatchewan at Carlton and the Wood Mountain Fort is exceedingly rich and at present well provided with water, forming a magnificent grazing country; immense tracts could easily be put into cultivation. In this district are found all kinds of soil; on the heights light and sandy lands; in the bottoms rich land, with a considerable thickness of vegetable matter; and on the prairie great stretches of land furnishing natural hay of excellent quality. The quantity of good wood for lumber that can be procured along the foot of these hills for building and others purposes, adds to the value of this region.\" (Idem, p. 70.)\n\nSince we left the province of Manitoba, we have not met any arable lands, which, for fertility or extent, could bear comparison with the attractive valleys of the magnificent river Saskatchewan, which, from Carlton, on the north branch, and St. Laurent, on the south, flows a distance of at least a hundred and fifty miles across a region possessing an excellent soil,\n\"splendid wood in abundance and plenty of water.\" (Report Depart. Int. 1877, part III, p. 17—A. L. Russell.)\n\nThe country lying between the Forks and the mouth of the Saskatchewan is a land of forests, in which there is an abundance of fine timber and in places where the land is sufficiently high and dry some kinds of hard wood.\n\n\"In the Indian reserve at Birch Portage, south of Fort Cumberland, the land has been partially cleared along the river. The soil is all that could be desired, very fertile, with a clay bottom, covered with a rich sandy earth, yellow and black. Birch Portage itself crosses an excellent country. The northern side passes into a thick forest chiefly composed of balsam poplar, of which some specimens measure at least two and a half feet in diameter.\n\n\"The white elm comes next, both in abundance and size. The white ash (Fraxinus viridis) is likewise abundant, and some maples (Negundo aceroides) are also to be seen as well as aspens. The white spruce attains here large dimensions.\" (Geological Survey of Canada, 1879-80, page 10 C.)\n\n\"We saw pines for the first time in coming from the Thunder Mountains to Fort Pelly at Lake Assiniboine. The pine against which I rested when we sat down to breakfast measured 6 feet 3 inches in circumference. Fort Pelly is the chief place in the district of Swan River, a region abundantly provided with wood.\" (Palliser's Expedition, p. 59.)\n\n\"The forest in Swan River district has its importance, and on its eastern limit we begin to find ligneous woods of greater utility than those to the west. Dauphin, Duck, Thunder, Porcupine, and Pasquin Mountains are well wooded. Between the Assiniboine and the Dauphin and other Mountains there are fine lands, lands so advantageously situated that the rivers which flow from these heights can, in the spring, float down wood in abundance.\" (Sketch of the North West, by Monseigneur Taché, p. 54.)\n\n\"It is said that the region watered by the river La Biche (which has its source a hundred miles to the east of the South Saskatchewan, runs along the Pasquin Mountains to the south, and empties into the north-west extremity of Lake Winnipegosis) is very fertile and the fact that maple is found there in considerable quantities confirms the opinion that the climate is not unfavourable. In all this region, wood is sufficiently abundant to assure a supply of fuel for many years to come.\" (Report of the survey of the country between Lake Superior and the Saskatchewan, by S. J. Dawson, p. 5.)\n\n\"The second division naturally comprehends the hilly region forming the south-west limit of the great alluvial plateau which has been described; it extends from the 49th parallel to the Saskatchewan, a distance of 360 miles in a north-west direction, and may have a mean width of 40 miles.... In all this region wood is sufficiently abundant to satisfy the wants of settlers for generations to come. The high lands are generally covered with dense forests, and the valleys contain a nearly equal extent of forest and prairie.\" (Idem, p. 15.)\n\nThese extracts, perhaps too much multiplied, establish conclusively that the magnificent plains of the Saskatchewan are surrounded to the west, north and east by forest regions, which are capable of furnishing an abundance of wood for use and for building and that in fact these woods are no more rare, nor more difficult, nor more expensive to obtain on the plains of the Saskatchewan than in the valley of the Richelieu or even a good part of that of the St. Lawrence in the province of Quebec.\n\nBesides these great extents of continuous forests, there are on the prairies themselves a number of places where good building timber is found in\nconsiderable quantities, notably on the top of nearly all the ranges of hills which break the levels of these great plains. This fact is established by the evidence of explorers.\n\n\"We were in reality going along the Cypress Mountains. We were several miles out of our course, and we encamped in a valley where there was a considerable quantity of maple. The Cypress Mountains in truth make a great contrast to the smooth level country in which we have been travelling; they are covered with wood, of which a great part is fit for lumber; the soil is rich and the supply of water plentiful.\" (Palliser's Expedition, p. 141.)\n\n\"The Touchwood mountains are composed of gently undulating hills, elevated at least 400 feet, well wooded, however, and containing many lakes.\" (Palliser's Expedition, p. 59).\n\n\"Gay soil prevails in the Little Touchwood mountains which are covered with forests of poplar, which trees in several places are large and valuable for timber.\" (Geological Survey of Canada, 1873-74, p. 82, Selwyn.\n\n\"It was necessary to cross the Big and Little Touchwood mountains, both thickly wooded with poplar and birch. On the Little mountain the poplar often exceeds two feet in diameter, is very tall; round, and of good quality... There are, among these mountains, places very suitable for agricultural purposes; lands well drained for cereals, bottom lands for hay, wood for fuel, fences, and even fit for lumber, in the clusters of poplars.\" (Report Dept. Int. 1876, p. 43.)\n\n\"There is everywhere plenty of wood for fuel beyond Battleford, especially upon and along the slopes of the coteau (Eagle Hills) which overlooks the valley from the southern side, as well as in some of the islands; and in the ravines there are large trees. The wood consists principally of balsam poplar, although there is some spruce.\" (Report Dept. Int. 1876, part III, p. 26.)\n\nIf to all this be added the fact that, nearly everywhere on the prairie, groves of poplars alternate with the grassy spaces, and that generally this poplar is fit for fuel and fencing, it may be admitted that, after all, the plains of the Saskatchewan are far from being absolutely badly endowed with respect to wood. For, in fact, one great advantage of a good part of these plains, is their capability of cultivation without the previous labour of clearing. This would not furnish a lumber dealer with business, but it is exactly what the colonist seeks for, as he goes on these lands to cultivate them, not to carry on the business of a lumberman. The evidence that has been given above shows that there is sufficient wood to supply the wants of settlers, and this is all that is necessary. Besides there is really no need for wood, but for fences and buildings, for coal for fuel can be got at a very reasonable price from the inexhaustible beds found along the slopes of the Rocky Mountains.\n\nThe region through which the Athabasca passes is a forest region, in which there is abundance of fine timber, especially of white spruce which there attains to thirty inches in diameter. Here the difficulty for settlers would be not so much to obtain wood, as to get rid of the great forests which clothe nearly all the valley of the river, from the Rocky Mountains to Lake Athabasca.\n\n\"We have now crossed the river three times, and are encamped about the mouth of the Malin River (at the foot of Miette Rock, thirty miles above Jasper House.) We saw to-day much fine wood, and our march was greatly hindered by the trunks of hemlock or a species of spruce fir, resembling hemlock, but with a different cone.\" (Palliser's Expedition, p. 128.)\n\n\"The track leading to the camp of the free men (20 or 25 miles north west of Jasper House) passes through very fine large forests.\" (Idem, p. 127.)\n\"The valley of the river is much larger (on arriving at the River Baptiste, in going up again) and the trees are very fine.\" *Idem*, p. 124.\n\n\"On leaving the McLeod River this morning, we marched between east and south across a forest much resembling that which we saw upon the portage leading to Fort Assiniboine and composed of fine big trees, pines and birches.\" *Idem*, p. 130.\n\n\"Behind the Fort (Assiniboine), the country is level, but covered with forests of very large trees. Where we encamped (between Fort Assiniboine and the McLeod river), there were very fine trees; birch, 2 feet in diameter; fir (*abies balsamica*) 2 feet 6 inches; and the poplar with the thick bark (*populus balsamifera*) 4 to 5 feet in diameter.\" *Idem*, p. 123.\n\n\"This afternoon, we crossed the river Pembina, which measures nearly 80 yards in width. The valley is wide, and there are on its borders some fine stretches of open land. The timber in all this region that we have crossed, is much finer than in the neighbourhood of Edmonton.\" *Idem*, p. 123.\n\n\"There is very fine large spruce on this side (East) of McLeod river, but no pine of any value.\" *Survey of C. P. R.*, 1877, p. 194.\n\n\"The region between the River la Rame and the Athabasca is covered with tall forests, chiefly composed of spruce, aspens and poplars, all very big, the spruce measuring as much as three feet in diameter.\" *Geological Survey*, 1879-80, p. 94.\n\n\"In the Townships 67, 68, 69, 70 and 71, and as far as the Athabasca River, poplar is the principal timber; there are also some good spruce and occasional clumps of pine (Banksian).\" *Report Dept. Int.*, 1884, p. 326.\n\n\"From this point (Lake La-po-o, upon the Little Smoky River) to the Athabasca a distance of twenty miles, fire has not passed in some years. In some places the second growth trees are already of good size; and in others stretches of the grand primitive forests, composed of spruce, have been preserved.\" *Geological Survey*, 1879-80, p. 65—Dawson.\n\n\"White spruce is plentiful from the Little Slave River as far as the Clearwater; this tree and poplar appeared to be in equal quantities; they are the two dominant species. The white spruce is generally found by itself in clumps, and as a rule is rarely more than a dozen or fourteen inches in diameter, and from a hundred and twenty high. There are many large clumps of it that would make good useful timber very suitable for all purposes for which we employ that kind of timber, the trees being large, clean, and long. On the flats around the lake, the timber is principally spruce, with a good deal of poplar and cottonwood and a few white birch. The spruce are generally much larger here than on the upper portion of the river, much more free from limbs and knots and well suited for lumber. I have seen nothing to compare with them in any part of the territories adjoining the prairies through which I have been. I learned from those who had been north of this point that the same features are to be seen through to Great Slave Lake.\" *Report Dept. Int.*, 1884, p. 32.\n\n\"At the Embarrass river, (one of the branches formed by the Athabasca at its mouth) and several miles to the north of it the spruce is of enormous dimensions; many of the trees being more than three feet in diameter and very high.\" *Geological Survey*, 1875-76, p. 168.\n\n\"These fine forests of spruce occupy all the eastern part of the plain of Peace River, that is to say, an extent of nearly 20,000 square miles. In going up the river to the west, red spruce and cypress are found.\n\"On the Quatre Fourches (the branch of the Peace River emptying into Lake Athabasca) there is some very fine spruce, with groves of poplar and a few pitch pine mixed through it. On the Peace, up to Vermillion River, (a distance of 200 miles,) there is a great deal of first class spruce, much of it being the best I have seen in the country. The sandy and gravelly ridges here, as elsewhere, are covered with pine. There is also much poplar and cotton wood, but it is generally small; mixed with it is a little white birch. Above Vermillion River, as the banks get higher, the timber becomes thinner and smaller, until near Battle River, many of the hill sides are bare, or covered only with scrub. Wherever a flat or a moderate slope occurs, the wood is generally of fair size; I conclude therefore it is the same on the prairies back from the steep banks.\" (Report Dept. Int. 1884, p. 52.)\n\nWe saw when speaking of the forests of the mountain region that there were superb forests in the valley of the Parsnip river. The other tributaries of this river, coming from the mountains, also cross timbered lands where there is plenty of fine spruce.\n\nLeaving the \"Precipice\" not far from the Lake Azouzeta, which is the source of South Spruce River, the valley is thickly wooded and comprises areas of large and beautiful trees.\n\nFrom the mouth of the Misinchina as far as a point on Spruce river, situated seven miles to the north east of the most elevated part of the range of mountains (a distance of thirty miles), the humidity of the climate is proved by the vegetation and other things; the forest fires have not been numerous and have not affected great extents. The valleys are filled with thick and sombre groves of spruce and the trees attain large dimensions.\" (Geological Survey of Canada, 1879-80, p. 381).\n\nFrom the \"Precipice\" as far as lat. 56°25', long. 122°32' east of the Rocky Mountains, the descent is nearly uniform and the river flows over a bed of fine gravel. The valley is thickly wooded with spruce and poplar of good quality.\" (Survey C. P. R., 1878, p. 77.)\n\nThere is likewise good timber in the valley of Smoky River, about midway between the mountain forests and those in the neighbourhood of the lower Athabasca.\n\n\"We crossed to the south of Elk river between that stream and Smoky river.... Along this line, the country is generally scantily timbered with poplars and conifers, although there are thick belts of spruce in which the trees are sometimes very large. Between Smoky River and Sturgeon Lake.... the country may be described as being generally covered with dense forests, for the most part of second growth, composed of aspen, birch, cypress, spruce and poplar and generally of moderate dimensions. However, considerable tracts are still covered with the primitive forests of big spruces and poplars.\" (Geological Survey of Canada, 1879-80, p. 551.)\n\nAs is seen, the superb plain of the Peace River possesses wood in abundance; besides what may be brought from the mountain region by the Parsnip and Spruce rivers, there are in the midst of the plain itself the forests of Smoky river, forests which are in the vicinity of an extent of nearly 500,000 acres of superb prairie. Lastly, there are in the lower portion, immense forests which border the Great Slave river and the lower course of the Athabasca, and which can furnish spruce, for trade products superior to those which we draw from our forests of the eastern provinces, where logs of thirty inches in diameter are not common.\n\nThe forests of Athabasca present uncommon advantages. Glancing at the\nmap, it is easy to see that at two or three places, especially between Athabasca Landing and the curve made by the Saskatchewan near the point of intersection of 113° longitude by 54° latitude, the distance between the two rivers is at the most only from fifty to sixty miles. The land does not offer the least difficulty in the way of the construction of a railway by which timber could be easily transported from one place to the other, that is to say, from the Athabasca to the Saskatchewan. Once placed on the Saskatchewan, the wood could be brought down with the greatest facility as far as the Forks, then taken up the South branch into the region of the Elbow or even higher, into any locality where lumber is needed.\n\nWhen one thinks that the construction of this little bit of railway would put the Saskatchewan in direct communication with the fine forests traversed by the Athabasca in the first seven or eight hundred miles of its course, that is to say, with forests as extensive as those of the Ottawa valley, it must be admitted that the question of timber for building ought not to be an obstacle in the way of the colonisation of the rich lands of the Saskatchewan, even did this last region not possess any of the fine forests whose existence and extent we have established.\n\nCHAPTER III.\n\nMINERALOGICAL SKETCH\n\nThe mineral riches of the four provisional districts of the North West are comparatively little known, for the good reason that no special surveys have been made to establish their existence or extent; but the minerals already found in these territories have an incontestable importance. Besides building materials, what stones and mill stones, there are in these regions salt marls, and gypsum, petroleum in abundance, silver and gold, iron ores and above all inexhaustible beds of coal and lignite.\n\nMATERIALS FOR BUILDING. Along the rivers, Saskatchewan, Battle and La Biche, as also on the banks of the Athabasca and Peace Rivers, there are in a number of places, sand stones which furnish an excellent building stone; beds of it even, in which are found a stone as beautiful, as rich and as easy to work, as that which we import at so great an expense from Ohio. The quarrying of this stone offers no difficulties, since where the stone crops out on the banks, it presents sections already ready for cutting. In the foothills especially in the Bow River region, sand stone of excellent quality for building stone is found in abundance, and further on, among the mountains, there are in inexhaustible quantities, lime stone and other palaeozoic rocks which would furnish an infinite supply of excellent building materials.\n\nThe huge stone groups of the Rocky Mountains, will necessarily be the source for the supply of lime to half the country. The position of these lime stones is most favourable for easy working, at the point where the Pacific Railway enters the mountains and especially at several localities along the line between Kananaskis and a point eight miles distant from that station. Wood is plentiful in that neighbourhood and enables lime to be manufactured at little expense, and it can be easily\nshipped by the railway or even by the South Saskatchewan to the plains of the east, as well as sandstone, lime stone and other building stones.\n\nThere are likewise in this Bow river region flinty clays, and in certain localities deposits of alluvion giving good materials for the making of common brick; and in the clay lands, there are in great abundance, soft slates and very fine sedimentary matters, suitable for brick of superior quality. Some of these clays are fire proof; and many of them suited to the manufacture of common pottery, tiles, and draining tiles. There are also in abundance limestone and slaty concretions, as well as beds of nodules of the same kind, of which a good hydraulic cement can be made.\n\nThe Devonian limestones, in several places along the Athabasca, yield also good lime, and at the rapids of the Clearwater river can be got any quantity desired of lime stone for this purpose of a superior quality and several of the beds would also furnish excellent building stone. In the vicinity of Hudson's Hope upon Peace river, and in several other places along that river, the water which oozes out of the sedimentary matters, has deposed great masses of calcareous tufa, which has become so solidified and compact as to form a pure crystalline lime stone which would make good lime. There is also on Peace River, at the Falls, and at Fossil Point, blue limestone which would make lime as well as good building stone. And, again, in nearly all parts of the plains, good earth for brick is found, especially in the vicinity of Battleford, where a brick yard has been for several years in operation.\n\nWhet stones.—The black schists in the vicinity of Hudson's Hope contain strata of sandstone which would furnish good whet stones. At the fort, they use for this purpose stones brought five or six miles from this locality which give the greatest satisfaction. These stones are likewise found in the Athabasca region especially near Pembina river, where they form immense beds. They are also found along Clearwater river a little distance from its mouth, where the employes of the Hudson Bay Company procure the stones of which they have need, and which are very good. In the La Biche Mountains, on the North West side, the falling of the rubbish has raised mounds a hundred and fifty feet high. There have been found here cropping out of a rock stones which would make excellent whet stones. On its north side, the bank of Little Slave Lake is covered with blocks and pebbles of a particular sandstone which would make excellent mill stones, and Professor Macoun says that all these blocks could be converted into good whet stones.\n\nPlaster.—The Boiling Rapid is found about a hundred miles from the mouth of the Peace river. Leaving the head of this rapid, and descending for a distance of twenty miles, the layers of bluish limestone which crop out on both sides of the river are stratified by a band of plaster whose thickness varies from ten to fifteen feet. This plaster is pure, clear, fine and white as snow. Its extraction would not offer the least difficulty, since the bed which holds the plaster, crops out on the banks of the river and is only covered by a soft rock, which could be easily removed and the plaster uncovered. This rock, besides, would also have its use, since it would furnish stone for lime and for building. As to the plaster, the fact that it forms a layer of from ten to fifteen feet thick, and that Professor Macoun has traced it over a course of twenty miles, shows clearly that it is to be found in inexhaustible quantities, and can be made the object of a considerable industry. The usefulness of this mineral in agriculture and in building, is too well known for it to be necessary to insist upon the importance of so extensive a deposit. Let it suffice to say that if this bed of plaster be supposed to have a width of a mile\non each side of the river and a mean thickness of seventeen and a half feet, it would contain more than 264,000,000 cubic yards. The farmers of the North West have here an inexhaustible provision of this precious mineral to renew the soil and augment its yield.\n\nMARL.—This mineral, as precious for agriculture as that which has just been mentioned, is found in abundance in the Athabasca region as well as in several parts of the other provisional districts of the North West. The bed of Lake La Biche, near the point where it discharges, is covered with a marl in sweet white water, and it is reported that this substance is found in the other lakes of this region. The strata of Devonian Limestones, which are found near the forks of the Athabasca supply also a blue greenish marl which is employed to whitewash the interior of houses and which is much appreciated.\n\nSALT.—The tract of Palaeozoic lands which bounds at the north the plains of the Saskatchewan, Athabasca and Peace Rivers, contains formations characterised like the formations of the same age in Ontario, by deposits of salt and petroleum of great value. According to Dr. Selwyn, the Director of the Geological Survey, there is little doubt that Canada possesses here a region full of mines of salt and petroleum, whose extent and capacity of production exceed all that has yet been found in America. (1)\n\nThe principal salt mines of this region are found on the banks of Salt river, one of the affluents of the Great Slave river which passes through the north west part of the district of Athabasca. Along this river and a little distance from its mouth, the existence has long been known of seven or eight abundant salt springs which spring out of a long ridge seven hundred feet high, and spread their brine over a clay plain, where the evaporation produced by the heat of summer and still more by the winter's cold, accumulates immense deposits of salt of the first quality. Sir Alexander Mackenzie speaks of it in the narrative of his voyage of discovery. \"One finds salt, he says, in the region lying north west of the Peace river, in a great number of salt marshes and springs which could furnish fine well crystallised salt in unlimited quantity; of perfect whiteness and pureness.\" (2) It is there that the Hudson Bay company procures all the salt which it wants for its posts at Peace river and Athabasca. It sends thither a boat every autumn, and its people have only to take the salt with the shovel and put it in the sacks. Some of the men employed in this task reported to Professor Macoun that the thickness as well as the extent of these beds of salt is illimitable, and that there are immense deposits a little below the surface of the soil. (3) There are other mines as rich, midway between the Great Slave Lake and Great Bear Lake. Mr. Moberley, Hudson Bay Company factor, informed Professor Macoun that fifteen miles from the mouth of the Clearwater, one of the affluents of the Athabasca river, there is a spring of which the brine is very strong, and Mr. King had informed him of the existence of similar springs which had been found on the banks of the Athabasca, fifteen miles down the stream from its confluence with the Clearwater. And Sir John Richardson states that there are in the Pasquil Mount. in south of Fort Cumberland, and in the lower valley of the Saskatchewan, salt springs which made him class these lands in the saliferous Onondaga group.\n\nPETROLEUM.—Mackenzie, Richardson, Father Petitot and all other explo-\n\n(1) Geol. Survey of Canada, 1874-75, p. 21.\n(2) Voyages from Montreal to the Frozen & Pacific Oceans, p. XC.\n(3) Geol. Survey of Canada, 1875-76, p. 90.\nrers have affirmed the existence of petroleum in the Athabasca and Mackenzie regions. Father Petitot visited mines of bitumen found at the outlet of Great Bear Lake, where they occupy more than a square league, and Mackenzie relates, that twenty-four miles from the confluence of La Biche river, there are wells of bitumen in which poles twenty feet long, could be sunk without experiencing the least resistance. These imperfect data regarding the petroleum wells of Athabasca, have been verified by the explorations of Dr. Bell, of the Geological Survey of Canada, who has established the existence of this mineral from the Noyé rapids to a point twenty miles from Lake Athabasca, that is to say, over a distance of from 130 to 140 miles. The bed of fine sandstone through which the petroleum oozes, is covered with deposits of marl and other transposed matters whose thickness sometimes reaches two hundred feet. In several places the petroleum of the underlying sandstone, has accumulated in the upper layer so as to form deep wells, or it runs across these layers and often reaches the shores of the Athabasca, upon which it forms immense beds of asphalt and thick bitumen. Below we cite the description given by the learned explorer, of these deposits of petroleum, asphalt and plastic bitumen.\n\n\"At the Noyé rapids, a black petroleum-bearing sandstone of fine grain is met with for the first time, and becomes abundant and prominent afterwards as far as to a very short distance from Lake Athabasca. It underlies all the strata before described, and lower down the river is stated to be two hundred feet deep. The dark bed of the rapid Noyé appears to represent the highest of these petroleum bearing layers which lower down take so great a development. The underlying marls, which probably prevent the petroleum from rising higher into these rocks, contain also a little oil and have its characteristic smell.\n\n\"The marly fine grained sand blackened by the petroleum from the Noyé rapid, has a strong cleavage. At a temperature of 60° Fahr. the mass is plastic enough to bend considerably before breaking. When cut with a knife, the chips roll up like those of hard soap. When kneaded in the hand, it softens and can be moulded like cement and is breakable. In a wood fire, this dough soon takes fire and burns for some time with a smoky flame, then falls in a powder which floats, when sprinkled on cold water. If a hot piece is put into water, it does not separate from the oil, but strongly resists the water.\n\n\"Along the right bank of the Pas-de-Bout rapid, the petroleum bearing sandstone forms a steep bank forty feet high. In some places there appears to be an excess of asphalt, and the bank has grown soft under the rays of the sun, and has run down, forming below great beds of tar.\n\n\"All the 120 feet of sandy beds which repose on the limestone upon the bank going up from the Crooked Rapid are more or less impregnated with petroleum.\n\n\"Upon the left bank of the river, nearly midway between Biche Island and the Crooked Rapid, the sandy petroleum-bearing marls form a bank nearly 200 feet high.\n\n\"The river, at the Cascades Rapid, descends over two or three banks or ledges of limestone. Upon it there are 80 or 90 feet of petroleum-bearing\n\n(1) See Geological Survey of Canada, 1882-3-4 p. 15, C.C., p. 17 seq.\n\"marls. In one place, a stream of sandy pitch has run down the limestone on\nto the beach. Three miles higher up than the Cascades on the left,\nside there are 80 feet of petroleum bearing layers.... the 40 lower feet are\nblack, homogeneous and solid. This part is evidently saturated with thick\npetroleum. The tar comes out of it in many places, under the heat of the\nsun and at one place it forms a little stream.\n\n\"On the right bank of the river, at the Mountain Rapids, a fine sand,\nfull of tar, forms a band 80 or 90 feet high. The sandy pitch melts in the\nsun, and runs in great viscous masses along the side of the bank and even\non to the limestone at the bottom. Tar and pitch are to be seen running\ndown from the banks at different places between this rapid and Fort\nMcMurray. For nearly a mile down the river from the Mountain Rapids the\npetroleum-bearing beds more than 100 feet deep, dip in going up the river.\nOn the right bank, opposite the mouth of the little river Péche, three miles\nabove Fort McMurray, nearly 70 feet of petroleum-bearing sand are exposed.\n\n\"The sandy petroleum-bearing beds that are seen so well on the east bank,\nover the 53 first miles below the Forks, are only found at intervals along\nthe left bank of the river. They have been noted at the following measured\ndistances in a straight line after leaving Fort McMurray, viz.: 18, 42\n(Tar River), 49, 51, 74 and 87 miles (on both banks.) Nearly everywhere\nalong the black cliffs of the east bank, the asphaltic sand has melted under\nthe rays of the sun, and run down to the foot of the bank in viscous masses,\nwhich appear to contain a greater proportion of petroleum than the undis-\nturbed beds. At a temperature of nearly 60° Fahr., the sandy pitch of these\ndroppings has the consistency of hard cheese. In some places, however, it\nis much clearer and even forms little pools of oil, and of tar proceeding\nfrom this pitch.\n\n\"During the summer heat, the tar or the liquid pitch, free from every\nmixture of sand, oozes from the banks into the places where the black beds\nappear to be completely saturated with thick petroleum. This pitch accu-\nmulates among the vegetable matters in the low places, and can be gathered\nup in large quantities. It is possible that the tar also could be forced up in\nsome places by a pressure exercised from below upwards. It is transported\nin barrels to the Hudson Bay Company's posts and to the mission stations,\nand after having been sufficiently boiled so that it will harden when cold,\nis used to pitch the boats, roofs, &c. For these purposes, the tar near the\nbank of the river collected at the places situated at the following distances,\nin a straight line, from Fort McMurray, all upon the right bank: 19, 33,\n36, 40 and 51 miles. Monseigneur Farand, from Lake La Biche, tells me\nthat he has seen a great quantity of this tar, is an island of the river,\nabout sixty miles below Fort McMurray. At the first of these localities, 19\nmiles below, the tar is found 640 paces back of the river's bank, upon a\npiece of ground elevated 50 or 100 feet above the water, at little dis-\ntance from the foot of a second escarpment nearly 15 feet high. The\nsurface of the ground is formed of hardened pitch, covered again with\nmoss, &c., and more or less mingled with vegetable matter or fine\nsand. Sixteen little orifices were made in this crust, and from the most\nof them, tar was extracted by means of wooden spoons. The locality\nmentioned as 40 miles down the river, is hardly a mile above the mouth of\nElk River. Here the tar oozes out at the same time as springs of clear\nwater at 20 or 30 yards from a bank of petroleum-bearing sand 30 or 40\nfeet high. The water and the tar are equally covered with a crust of hard\npitch mixed with moss and other vegetable matters but still plastic enough\nto yield to the pressure of the foot. Holes are dug through this crust, the\nfresh tar collected with wooden ladles, and put into barrels for transport.\nThere is found here a kind of thick tar in the holes under the clear water,\nwhile a clearer variety floats on the surface of the water under the hardened\ncrust.\n\nAll along the banks of the Athabasca, from the Forks to the mouth may\nbe seen patches of oily foam shining and spots of petroleum floating on\nthe water near the shores, and they sometimes collect in masses when they\nare stopped by branches or trunks of trees lying across the current.\n\nSome traces of oil were found in a bed of limestone on the Clearwater\nriver....On our return, we followed the road which passes Clearwater\nriver and Isle à la Crosse. In going again up the river, the plateau of petro-\nleum-bearing strata which came out on the eastern bank of the Athabasca\nbelow the Forks, appeared to be prolonged for some miles up the river on\nthe north side. Great masses of sandy pitch, like that falling down the steep\nbanks of the Athabasca have been found in the bed of the Clearwater river,\nat 11, 13 and 17 miles above the Forks. We saw also small quantities of\npetroleum floating on the river at the last mentioned point.\n\nThese deposits had been pointed out by the early explorers, especially Sir\nJohn Richardson; but at that time geological science was still in its infancy,\nand no one paid any attention to the geological relations of petroleum, there\nbeing then no commercial value attached to it. The bitumen and the tar of\nthe Athabasca region were mentioned rather as natural curiosities than on\naccount of any appreciation of their usefulness. Today, however, they possess\ngreat interest in a scientific, and great value in an economic, point of view;\nin spite of the distance which separates the locality in which they are found\nfrom the existing railways. The enormous quantity of asphaltic or thick petro-\nleum in so great a depth and so great an extent of sand indicates an\nabundant origin. It is not probable that the source from which this petro-\nleum comes, is exhausted. The position and condition of the strata are\nfavourable for the accumulation of oil in the limestones themselves, and\nconsequently it may be hoped that abundant wells will be found by boring\nthe rocks along the Athabasca. Great quantities may be found in spots\nwhere there are scarcely any indications on the surface.\n\nThese facts, reported by a man of the greatest competency, clearly estab-\nlish that the petroleum mines of the Athabasca river and of its tributary, the\nClearwater, are of a richness which perhaps exceeds that of similar mines\nin the province of Ontario and several parts of the United States. When it\nis remembered that this petroleum-bearing region, such as Dr. Bell has\nexplored and described, is more than a hundred and twenty-five miles long\nfrom south to north, and that in the valley of Clearwater river it extends\ntowards the east at least seventeen miles, it is easy to judge of the source of\nwealth which we there have and of the development of which these petro-\nleum springs are susceptible.\n\nBesides the liquid oil, which may be extracted as in other places by means\nof artesian wells, the quantities accumulated in the tellurian beds on the\nsurface are also susceptible of being utilised for many purposes. In the\nnatural state, this paste of sand and oil makes an excellent fuel, which\nburns easily and offers no other inconvenience than making a rather\nsmoky flame. Dr. Bell says that this asphaltic sand could also be utilised\nwith little or no manipulation, for paving streets, or roofs, for manufacture of\ndraining tiles as well as for the isolating of electric wires. From it can also be extracted a lubricating oil of superior quality. Mr. Hoffman, of the Geological Survey, Mr. Isaac Waterman, the celebrated refiner of London, Ontario, and Lieut. Cochrane, professor of applied science in the military college at Kingston, have found that this sand contains from 12 to 15 per cent of bitumen. Small as this percentage may appear, the sand exists in such great quantities that a profitable method of extracting the oil and paraffine it contains might be found. As this bituminous paste burns easily and is most easy to extract, a part of it could be employed as fuel to extract the oil from the other part, seeing it may be said that there is no limit to the quantity which can be procured. Mr. Waterman declared to Dr. Bell that in the specimen of bitumen submitted to him, the proportion of paraffine was considerable, and could advantageously be extracted from deposits such as have described.\n\n**Gold and Silver**—For many years it has been reported that the Peace River and the two Saskatchewan, as well as their tributaries flowing from the mountains, contain in the alluvial earths which form their beds, gold in more or less considerable abundance.\n\nDr Selwyn states that gold in paying quantities has been collected in several places along Parsnip and Peace rivers, and that Daniel Williams who has been in this region for a dozen years back, has lived in a great measure by collecting gold from the bed of these rivers. The people in the locality reported to Professor Macoun that gold had been found in the bed of the Iroquois creek, one of the smaller tributaries of Peace river, as well as in the Buffalo mountains, which lie southwest from Fort Vermilion. It was also said that silver had been found in those mountains.\n\nGold seems to be more abundant in the Saskatchewan, especially in the north branch. \"The first gold bearing alluvials that we saw in descending the river, says Dr Selwyn, (Geological Survey, 1873-74, p. 58), were found a little more than forty miles down from the mouth of the Brazeau; and thence to Edmonton, and some miles lower down, more or less gold has been found on the bars which cross that river as well as on the banks. Even as low down as Carlton, I believe that gold may be found, but not in sufficient quantity to make prospecting pay. On the South Saskatchewan, at the ford twenty miles south east of Carlton, I gathered in the gravel of the river bed some grains of gold.\" Mr. Ellis, of the Geological Survey, reports that, during his stay at Edmonton, in 1876, the miners prepared to go exploring along the La Biche river, where the prospecting for gold seemed more attractive than elsewhere.\n\n\"Thus, says Dr Selwyn, the fact is well known that gold has not been found in the streams which form the sources of the Saskatchewan in the Rocky Mountains, nor in the neighbourhood of the mountains on the east side; but it has been found in this river and its tributaries from the north, from the vicinity of the Rocky Mountain House as far as the Forks. I have been informed by several miners, who have spent much time in prospecting, that they found fine gold in nearly every stream where they tried diggings, between the two branches of the Saskatchewan, from the longitude of Edmonton to the Forks. We ourselves found little particles of gold at the Elbow of the South Saskatchewan and at Red Ochre Hill. However, gold appears to be the most abundant in the vicinity of Edmonton.\"\n\nDr. Dawson, another member of the Geological Survey, states that in the Bow River region, there is found in certain streams, gold in sufficient quantities to make it profitable to collect it, in all places where there are deposits.\nfrom rocks belonging to the Laurentian and Huronian formations. And Mr. Hoffman has made an analysis of certain minerals brought from the vicinity of the Rocky Mountains which have given 2246 ounces of silver to the ton of rough ore.\n\nLet us complete these references by quoting what is said in the report of the Minister of the Interior concerning the existence of the precious metals in the Rocky Mountains.\n\n\"The eastern slope of the Rocky Mountains promises to be nearly, if not quite as rich as the western slope, in the deposits of the precious metals which it contains.\" (Report for 1882, p. XI.)\n\n\"The prospects of successful mining for the precious metals on the eastern slopes of the Rocky Mountains are exceedingly encouraging. A large number of practical miners, drawn from various parts of the world, expended a good deal of time and capital in prospecting at different points in the course of the past summer. Some discoveries of rich ores are said to have been made, and there is every reason to anticipate that there will be an extensive movement of population towards the mining regions. On the upper part of the North Saskatchewan and its tributary streams flowing from the mountains, there has yet been no discovery reported of quartz or other gold bearing rocks in place; but this section of country is rich in promise of remunerative employment for the class of miners who, with primitive appliances and inexpensive outfit make the development of alluvial and subaqueous deposits their business.\" (Idem 1883, p. XV.)\n\n\"The yield of gold in some localities although not sufficient to remunerate individual labour, may prove profitable when conducted by companies with proper appliances for hydraulic placer mining.\" (Idem, for 1884, p. XIV.)\n\nBog Iron Ores.—These ores abound in many parts of the four provisional districts. The most considerable and most valuable deposits yet discovered, are those of Spruce River, Smoky River, Edmonton and the Great Belly River. The coal beds of the Spruce river contain in many places bog iron ore in abundance, in the form of foliated nodules. In the valley of the Smoky river, are found beds of pure bog iron ore, from three to four feet thick, alternating with a ferruginous sandstone occupying an extent of several miles, and still preserving its thickness with much regularity. This ore gave on analysis 30.98 per cent of metallic iron and 15.94 per cent of insoluble matter. This ore is found in smaller quantities in the section lying between Peace river and the Athabasca. The Edmonton ore gave 34.98 per cent of metallic iron; Mr. Hoffman the analyst of the Geological Survey, says that it is a rich and valuable ore, composed of carbonates with an exterior layer of hematite. In the Bow River valley not far from Grass Island, Dr. Dawson found great masses of carbonate of iron weighing sometimes several tons, contained in veins of sandstone, and so numerous that they might have an industrial value and be made the object of a considerable business.\n\nCoal.—The zone of coal fields, which borders the Rocky Mountains between the United States frontier and Peace River, measures nearly 450 miles in length, and has a mean width of nearly 125 miles, making an area exceeding 55,000 square miles. The surveys so far made establish, that throughout all this vast extent, there are lignite and coal in abundance, and that in many places the mining of this combustible could not be more easy or less expensive.\n\nTo assist in an appreciation of the deposits found in various places, we\nwill pass in review those of each locality, or rather of each coal region in particular.\n\nIn 1876, Dr. Selwyn discovered in a pass in the Mountains on Peace River about Longitude 122° 10', a bed of coal six feet thick, and three years later Mr. Cambie, one of the engineers charged with the survey for the Pacific Railway, found, in nearly the same place, another bed two feet thick. The coal, discovered by Dr. Selwyn gave on analysis the following results.\n\n| Slow Burning | Rapid Burning |\n|--------------|---------------|\n| Water        | 2.10          | 2.10          |\n| Volatile combustible matter | 21.54 | 25.09 |\n| Fixed carbon | 71.63 | 68.08 |\n| Ashes       | 4.78          | 4.73          |\n| **Total**    | **100.00**    | **100.00**    |\n\nMr. Hoffman, who made the analysis of this coal, says that when quickly burned, it gave a beautiful coke, and that it might be considered in every respect a fuel of excellent quality.\n\nLet us remark here that this coal is found at the head of the Peace River navigation, and that it can be easily transported by water into all places east of it, for a distance of 5 or 600 miles.\n\nThe Spruce River, which falls into the Peace River some miles below Fort St. John, also runs through lands abounding in coal. In speaking of the surveys made in 1876 in the vicinity of Table Mountain, Dr. Selwyn says:\n\n\"I employed the remainder of the day in exploring a deep rocky gorge, through which a little stream empties itself into the Spruce River. I discovered here four seams of good bright coal, in about ninety feet of alternate layers of sandstone and schist; following a descending order these beds are respectively six inches, eight inches, two feet and six inches thick.\"\n\nIn the lower part of Coal Creek, which falls into the east branch of Spruce River there are large exposures of sandstone of an inferior grade. (1) In 1877, Mr. Hunter found coal in this sandstone. He sent me some specimens which he had gathered there, and I have myself since examined this locality. (2) The coal forms beds and appears to be of good quality, but as far as I have been able to discover, all these beds are very thin, the thickest measuring about six inches. There is also coal on the east branch of the Spruce River, going up from the mouth of Coal Creek, and there is every reason to hope that there will be found in this region, beds of coal fit for working.\n\nSmoky River another affluent of Peace River entering below Fort Dunvegan about 250 miles from the Rocky Mountains, flows also through coal beds of real importance. In Mountain creek, (one of the tributaries of Smoky River) great fragments of lignite which evidently had come from no great distance covered the bars found in the river. Some very thin beds were observed in the banks, but the scattered bits must have been taken from thicker beds which may crop out lower down in the water, and be concealed by the bank. Similar pieces of lignite were found along Elk river above the mouth of Mountain creek, which shows that there should be also beds of coal along the upper course of Elk river. (3)\n\nThe learned explorer cited above sums up thus the nature of the coal regions of Peace River.\n\n\"In the Peace River region, says he; the two horizons characterised by\n\n(1) (Geological Survey of Canada, 1878-80, p. 117-18. Dawson.)\n(2) The banks of the river are covered with bits of coal, several thin beds of which appear on the face of the exposure. (J. Hunter. Report on Pacific Railway surveys 1878, p. 79.)\n(3) (Geological survey, 1879-80, pages 124 and 125—Dawson.)\nsandstone contain coal. That constitutes in itself a point of considerable importance; and demonstrates that the carboniferous nature of the rocks is not limited to a single series of beds, but is found again in two strata.\n\nIt would appear then that if, in the region situated between the Peace and Athabasca rivers, there have not yet been found beds of coal sufficiently thick to have an industrial value, still coal and lignite of good quality are nevertheless found in two distinct series of beds. Everywhere that the natural sections of these layers are met with in the valleys of the rivers and in the running streams, coal in more or less great quantity is found, which sufficiently proves the persistence of the carboniferous nature of these beds.\n\nThe existence of coal in the valley of the Athabasca and its principal affluents was long ago stated by Dr Hector, the learned geologist of Captain Palliser's expedition; and the researches of the Geological Survey of Canada have demonstrated that in this region coal abounds, and have shown that in many places the beds are sufficiently thick to be worked with profit.\n\nThe presence of coal has often been remarked in the banks (of the Athabasca,) over a distance of nearly sixty-two miles going up from Fort Assiniboine and several miles going down from that place. The exposure containing coal, that we saw still farther on in going up the river, exhibits near the bank of the stream, the following sections in a descending order:\n\n| Feet | Inches |\n|------|--------|\n| Sandstone and schist | - |\n| Schistous lignite coal | 8 0 |\n| Sandstone and soft schist | 4 0 |\n| Good coal | 1 0 |\n\nAbout eight miles lower down, at Lat. 54° 11' 40\", Long. 115° 56' was found the most important deposit of coal seen along the Athabasca. Here there were two beds of coal. They appeared near the water's edge, in a heap of rubbish which had fallen from the principal bank. The upper bed is ten feet thick, not including nearly six thin layers of schist which separate the coal and form a collective thickness of a dozen inches. Below this bed, there are twenty feet of sandstone and soft and earthy schists, below which again is found a second bed of pure hard coal, about three feet thick. The coal of the upper layer contains, according to the analysis of Mr. Hoffman, 11.47 per cent of water, and that of the lower, 10.58 per cent.\n\nLower down, along the river, the existence of two beds of lignite occupying the same horizon, has been also ascertained, which shows the persistence of the carboniferous nature of these lands although the only beds suitable for working may be those mentioned above.\n\nWe did not see farther down the river than fifteen miles from Fort Assiniboine, exposures of the rocks underlying the transposed matter, although there were observed in several places below the mouth of the Little Slave River, heaps of overturned schists and iron carbonate which might indicate that rocks similar to those above described will be found in the higher parts of the valley. Mr. McConnell found at a point north of Little Slave Lake, an exposure of sandstone; and some fragments of lignite were found in the bed of a large stream of water which came from near the east extremity of the lake. According to Mr. Horetzky, there is also impure lignite and sandstone on Swan river and in the La Biche Mountains south of Little Slave Lake. (1)\n\n(1) Geological Survey of Canada, 1879-80, p. 126 and 127—Dawson.\nOn the North Saskatchewan, Dr Hector found deposits of coal from Rocky Mountain House as far as several miles below Edmonton, or over a distance of a hundred and sixty-five miles. He says that the two beds he examined on the banks of Clearwater river contained a lignite, superior as a fuel, to that in the vicinity of Edmonton. At Rocky Mountain House, he found on the bank of the Saskatchewan and followed along the river, for more than two miles, a bed of coal two feet thick, from which was easily dug the fuel required for the supply of the fort. The coal was shiny, with a clean cubic fracture, and had no tendency to decompose.\n\nA little below the mouth of the White Earth River, in about $113^\\circ 40'$ of longitude, upon the banks of the Saskatchewan; Dr Hector found another bed of very fine compact coal three or four feet thick, which he traced over a distance of several miles going down the river. Between this place and Edmonton, he saw several other exposures of coal in the banks of the river. The deposits in the vicinity of Edmonton are the most considerable which have been examined on the banks of the Saskatchewan; of them he gives the following description:\n\n\"Several of these beds contain many nodules of iron carbonate. There are in these beds several layers of coal or lignite which would appear to be of good quality, since it is employed in the forge at the fort to the exclusion of every other fuel. The blacksmith, who is a miner, told me that the quality of the coal varies much according to the distance from the exposure. Near the fort, there are two beds of 18 inches each; but on the opposite bank of the river, near the water, there is a bed six feet thick and another of four feet, a little higher up the bank. This coal has no fibrous structure, takes fire with difficulty, but once lighted, burns a very long time.\"\n\nDr Selwyn visited this same region in 1873, and the result of his investigations has added considerably to the already valuable information furnished by Dr Hector. In the summary he gives of the result of his researches, he says that he has \"made a collection of some specimens which aren't wanting in interest, but that of all the facts verified, the most important is the existence along the river Saskatchewan between Edmonton and Rocky Mountain House, of a great number of beds of good coal susceptible of being worked; one of these beds measuring, at two exposure more than four miles apart, from eighteen to twenty feet in thickness, and very favourably situated for the extraction of the coal.\" He describes the most considerable deposit that he saw in the following terms: \"At one place on the right bank of the river, about forty miles below the mouth of the river Brazeau, I discovered a bed of thin coal resembling jet, measuring from 18 to 20 feet in thickness: (1) It presents the same thickness in two exposures distant a little more than four miles from each other. In the first exposure, which shows itself over an extent of 50 or 60 yards, but which, on account of the rapidity of the current at its base, could not be easily examined, the bed is nearly level and forms, as it rises above the water a cliff very nearly vertical, exposing eighteen feet of coal, apparently of excellent quality. In this place the bottom of the bed was below the water and could not be examined. The second exposure, which is evidently a continuation of the same bed, has the form of an arch, and allows eighteen feet of coal to be seen, with separations of one, two, and three inches of schist. At intervals, over all\n\n(1) Geological Survey of Canada, 1879-80, p. 127-127—Dawson.\nthe distance from Rocky Mountain House to Edmonton, 135 miles, and\nfrom there, as far as Victoria 76 miles lower, we remarked along the river,\nsimilar rocks with beds of coal and carboniferous iron.\"\n\nThere is also coal in the valley of the river Brazeau, as is established by\nthe following fact reported by Mr. Ells, of the Geological Survey: \"Mr. Brown\nhe says, 'the guide of the party of Pacific Railway surveyors, under the con-\nduct of Mr. McLeod, declared to me, that in the course of the survey made\nby him of the river Brazeau, a hundred miles to the west, he saw in the\ncutting of a ledge of sandstone three beds of coal superimposed and of a\nthickness varying from fourteen to twenty-six feet.\" Mr. Ells also discovered\na little above Victoria a bed of coal two feet and a half thick.\n\nThere is ground for believing that the bed of twenty feet discovered by Dr.\nSelwyn forty miles from the mouth of the river Brazeau, is only the continuation\ntowards the east of the bed of twenty feet found on the same river, a hundred\nmiles from its mouth, by Mr. Brown, which would give to this bed a develop-\nment of 140 miles, at least, from west to east. As it appears to be fifty or\nsixty yards wide, it is easy to form for oneself an idea of the quantity; so to\nspeak illimitable, of the fuel which it contains. The analysis of three specimens\nof this coal gave the following mean results:\n\n|                | Slow combustion | Quick combustion |\n|----------------|-----------------|------------------|\n| Water          | 11.88           | 11.8             |\n| Volatile combustible matter | 29.43 | 35.64           |\n| Fixed carbon   | 5.50            | 47.40            |\n| Ashes          | 11.90           | 5.08             |\n|                | 100.00          | 100.00           |\n\nAfter having studied and even explored a large part of the carboniferous\nlands of the North Saskatchewan, Dr Selwyn has arrived at the following con-\nclusions: \"There can be no doubt that in the region situated to the west of\nEdmonton, bounded north by the Athabasca River and south by LaBiche\nRiver, there is a vast extent of carboniferous lands occupying an area of at\nleast 25,000 square miles, and that, under a great part of the surface of\nthis area, we may expect to find beds of coal capable of being worked at\ndepths rarely exceeding 300 feet, and often, as in the case of the great bed\nabove described (that found forty miles from the confluence of the Brazeau\nRiver) situated in a manner favourable for surface mining.\"\n\nThe existence of coal in the valley of Battle River was first made known by\nthe expedition of Captain Palliser, who discovered exposures of this mineral\nin a place situated in lat. 52° 28' and long. 111° 29' (1). Mr Ord, a surveyor\nin the employ of the Department of the Interior, discovered a little higher up\nthan this locality, in 1883, a vein of coal, massive and pure, four feet thick,\nwhich he thus describes: \"The clays (in Township 43, Range 18 west of the\n4th initial meridian) are mixed with thin beds of slaty coal, of friable sand\nstone; and of one or two thin beds of hard and ferruginous clays, and below\nall that, on the bank of Battle river nearly 100 feet downwards from the\nplains, is exposed here and there a vein of coal nearly four feet thick.\nIt is placed under a shaly schist and upon a bed of clay, and like the\nother strata which accompany it, it forms a stratum band, with the excep-\ntion of some rare and slight undulations. It is besides free from slaty leaves,\nthe coal being pure and massive, of good quality, although it was exposed\nto the action of the air and consequently friable. This vein corresponds\nperhaps to the upper vein observed at Edmonton.\"\n\nPalliser's Exploration, p. 37.\nThese carboniferous beds are prolonged towards the south into the La Biche valley, where the existence of considerable deposits has been reported by several explorers. Dr. Hector discovered there a bed of fifteen feet thick eight miles above the mouth of Dead Man's Creek. \"The depth of the valley,\" he says, exceeds 200 feet, and the river has a mean width of 130 yards. Upon the two banks, there are strata of coal which are in many places 15 feet thick, but the quality of this fuel is not superior to that found at Edmonton on the North Saskatchewan. In making an assay of it, I ascertained that this coal burns without any flame; but that once kindled, it burns for a considerable time. Some little fire kindled in the evening kept the fire lighted until morning. The ashes that it leaves resemble wood ashes, and this coal gives considerable heat.\" Dr. Hector traced back these beds of coal over a distance of a dozen miles along the river.\n\nThe surveyors in the employ of the Department of the Interior have traced back these beds of coal in the valley of the Biche River as far as 100 or 125 miles towards the south east, from the place where Dr. Hector found the bed of fifteen feet mentioned above.\n\n\"In Range 17, Townships 26 and 27, the ground begins to descend from the sand hills towards the river. I saw exposures of coal in several places on the banks of the river. I got from a vein, nearly three feet thick and lying twenty feet from the surface of the ground, some excellent specimens of hard coal.\" (T. Fawcett, Report of Min. Int. for 1883, part II, p. 72.)\n\n\"In regard to the veins of coal that I saw, at first, in Township 11, Range 10, exposed in the perpendicular banks of the La Biche River, and further on, on the banks of Bow River and Crow Foot Creek, I am of the opinion that all the region contained between these points is covered with a bed or beds of coal, varying in thickness from 5 to 15 feet, and lying from 50 to 75 feet below the surface of the prairie. I believe that this is the same bed which crops out at the Seven Persons Coulee, and extends very nearly in the same direction north-west towards Edmonton. The coal that I have examined is lignaceous and bituminous.\" (C. F. Miles, Report Dept. of Interior for 1882, part II, p. 99.)\n\nDr. Dawson, of the Geological Survey, has made lately a systematic exploration of the greatest part of the region drained by Bow and Big Belly rivers as well as of certain parts of the valleys of La Biche and Milk rivers. With the exception of this last, all the other rivers empty their waters into the South Saskatchewan. The region thus explored includes the southern part of the district of Alberta and the southwest part of that of Assiniboia. Starting from the base of the Paleozoic rocks, or of the Rocky Mountains, and going towards the east, this region embraces a superficial area of about 26,909 square miles, of prairie and plain repose upon the softer and more recent formations designated by the names of \"Cretaceous\" and \"Laramie.\"\n\nThe limits of this pamphlet do not permit us to enter into the details of these investigations—they may be found in the report of the operations of the Geological Survey of Canada for 1882-3-4—we must content ourselves with giving the excellent summary made by Dr. Dawson himself.\n\n\"There is not (says this learned explorer), in the area included in the present report, anything more remarkable than the universal distribution and the immense quantity of combustibles fit for industrial uses, and it may be said without exaggeration that, practically, all the area designated in the preceding chapter under the name of 'plains,' everywhere covers, as well as can be judged by the natural exposures.\"\n\"deposits of clay or lignite, while at the same time there are found over\nconsiderable areas, two or three successive horizons of beds of combustible.\nThere is not in reality any point more than thirty miles distant from\nsome natural exposure of coal or lignite fit at least for local use; and the\nnatural exposures in several localities demonstrate the existence of a fuel of\neasy extraction, which would serve for on a great scale during a consump-\ntion many ages.\n\nThe places showing the natural exposures are not sufficient to furnish\na general estimate of the quantity of combustible matter found in this\nregion; but we may form an approximation sufficiently exact with regard to\ncertain defined districts, and this will amply suffice to show that the pro-\nvision is, apparently, inexhaustible. The base of the Pierre group consti-\ntutes the most persistent coal horizon which has been up to this time\nestablished in this region, and veins of coal varying in thickness and quality\nare everywhere found where good cuttings can be seen. The exposure of\nthese combustibles found on Great Belly River, near the Coal Banks, has\nbeen followed towards the south at intervals nearly as far as the 49th\nparallel and towards the north east as far as La Biche River, which makes\na total distance of a hundred and fifty miles. The south and south east\nextremities of this exposure cannot, judging from the thickness of the veins,\nbe classed as workable, but on Big Belly River and the lower part of St.\nMary's river, an exposure nearly eighteen miles in length may be looked\nupon—according to what appears in numerous good cuttings—as every\nwhere workable, and in the immediate neighbourhood of the Coal Bank, it\nmay be estimated that there are 5,500,000 tons of coal to the square mile.\n\nSupposing—and this supposition is much below the reality—that this com-\nbustible may be worked with the greatest facility over the width of a mile,\nthe length of eighteen miles of exposure above defined would contain in\nitself alone 90,000,000 tons. The same coal horizon is found at a distance\nof sixty six miles on the banks of St. Mary's River, and on Bow River at Grass\nIsle, where it is calculated there are 3,000,000 tons under each square\nmile. This may be regarded as the probable minimum for that part of the\nexposure above mentioned. Taking the minimum figure—simply for the\npurpose of forming an approximate idea of the richness of the vein—it is\nfound that the quantity which the width of a mile on the line of exposure\nwould produce, is 330,000,000 tons, or taking into account, the waste and\nsome decrease, a yield equal to 1,000,000 tons for 300 years.\n\nThe thickest seam which is found near Medicine Hat may be also\ncounted upon, as a mean, for nearly 5,000,000 tons a square mile and it\nmay be affirmed that the cuttings on the banks of the river prove its exis-\ntence over an extent of more than thirty thousand square miles, which would\ngive a quantity of workable coal of about 150,000,000 tons. The vein near\nthe Horse Shoe elbow on Bow River, is estimated to be equal to nearly\n4,900,000 tons to the square mile. However, as this vein has only been seen\nin a few places in this locality only, and has probably only a local character,\nit would not perhaps be safe to claim that it covers more than ten thousand\nsquare miles, which would give a total of 49,000,000 tons. The exposures\nseen on the river in the Black-feet country as well as the borings lately\nmade by the Pacific Railway Company, and the general persistence in all\nthis region of a vein found very nearly at this horizon in the Laramie for-\nmation, appear to justify us in saying that the extent established for this\nlocality is about thirty square miles, which, since the vein is thick, ought to\ngive very nearly 9,000,000 tons of coal to the square mile, or a total of 270,000,000 tons.\n\nIn calculating the quantity of combustible over an extended line, in connection with the exposures on La Biche River, and in the numerous localities, in the foot-hills and mountains where 'good veins' are found, the figures given above for some districts might be considerably augmented; but the practically inexhaustible character of these deposits once admitted, these calculations would not have much more signification. In the measure that the region of the foot hills becomes better known, and more thickly settled, there will doubtless be discovered in other localities, coal fields in great number, for the veins are found repeated upon several lines by the parallel folding of the beds. The same remarks apply to the very interesting areas of Laramic cretaceous rocks, which form basins or depressions between the Palaeozoic chains of the mountains.\n\nAs to the quality of these coals or lignites, complete and precise details will be found in the report of Mr. Hoffman, as well as some observations touching their value and practical uses. It may be well to add, however, that some of the coals of the mountains and foot hills yield in nothing to those of the carboniferous or coal regions of Nova Scotia and the Eastern States, while those which are classed as true lignites are very superior to wood for the production of heat, and can in conditions favourable for combustion be employed with success, not only for ordinary domestic fuel, but also for the production of steam, and industrial needs in general. For burning brick, which is an important consideration, owing to the scarcity of wood for building, lignites of a quality altogether inferior can be employed.\n\nThe value of the coal beds of the mountains and foot hills for everything relating to the mining, smelting and reduction of the metalliferous deposits which will probably be discovered, is evident, and for purposes of this nature, some even of the most distant and most inaccessible beds could be utilised labor on.\n\nLet us complete these statement by the following extract from the report of the Minister of the Interior for 1883:\n\nThe existence of coal in practically unlimited quantities in South Western Manitoba, in the valley of the North and South Saskatchewan, and indeed more or less throughout the whole of the territories west of the second meridian, had already been satisfactorily proven; but not until the season of 1883 did the coal mining become an established industry in the country.\n\nThe deposits on the South Saskatchewan and its tributaries, consist of a superior class of lignite, equal to much of the bituminous coal consumed on this continent. The product of one mine in the Belly River country has been tested by the Locomotive Department of the Canadian Pacific railway with so much success, that the Company has contracted for a large supply of it for the next five years.\n\nContrary to the expectation of the most sanguine, a valuable deposit of anthracite has been discovered close to the line of the Canadian Pacific Railway on the Devil's Head Creek a tributary of Bow river, about 40 miles east of the summit of the Rocky Mountains, and 60 miles west of Calgary. The importance of this discovery can hardly be overrated, particularly as the deposit is already known to extend over a considerable area.\n\nAs Dr. Dawson has himself stated, the quantities of coal found and that he has examined, in the Bow river and Belly river regions, are practically inexhaustible, and sufficient to supply all the North West for ages. This region has an area\nabout 27,000 square miles, and the thickness of the coal in the deepest beds found does not exceed ten feet. Taking these figures for a ground of comparison, we arrive at the conclusion that the coal basin between the Athabasca and the Biche rivers of which the extent is estimated at 25,000 square miles by Dr Selwyn contains or at least should contain more coal than the other region so well explored by Dr Dawson. About a hundred miles west of the mouth of the Brazza river, Mr. Brown discovered as we have already seen three beds of good coal of a thickness varying from fourteen to twenty six feet. More to the east, forty miles below this river, and consequently a hundred and forty miles from the bed discovered by Mr. Brown, Dr Selwyn discovered on the banks of the North Saskatchewan, a bed eighteen or twenty feet thick, in two places four miles distant from each other and finally, the expedition of Palliser discovered another bed fourteen feet thick on the banks of La Biche river, eight miles from Dead Man's rock. Casting a glance at the map, it is immediately seen that these three very considerable deposits of coal, are found in such a position that it is impossible not to conclude that they are three exposures of an immense bed which would be nearly 200 miles long. It would be useless to state that such a deposit would much exceed in richness, notwithstanding the proximity of these, the coal beds of the south branch of the Saskatchewan.\n\nHowever this may be, it may be affirmed without fear that there is no country more rich in mineral fuels of good quality than our four provisional districts of the North West, and none which possesses so many facilities for the transport of this fuel into all parts of the territory.\n\nCHAPTER IV.\n\nCLIMATOLOGICAL SKETCH.\n\nThe climatology of the region we are describing has never been submitted to a methodical study; but the data furnished by science and observation establish beyond a question, that the greater part of these vast territories enjoys a climate superior, in every respect, to that of the eastern half of Minnesota and the province of Manitoba. These to cite only one fact in support of this assertion—it is well established, that, in the region lying east of the Rocky Mountains, from the United States frontier to beyond the Athabasca district, less snow falls, and the water is less cold than at Red River of the country about St. Paul, the rich and flourishing capital of Minnesota. It is established likewise that wheat and cereals of all sorts will succeed as well in the Peace River country, Lat. 56° and 57°, as in the province of Manitoba, lying five or six degrees more to the south, and finally, it is established that in the environs of Fort Vermilion, maize has been successfully cultivated, which cannot be done in England on account of the climate.\n\nThese facts, which are established perfectly, at first sight appear extraordinary, especially to those who are prepossessed with an erroneous notion that the temperature of a country corresponds to its latitude; but they are easily understood when the causes which act upon the climate of these territories are a little examined into.\nIn virtue of certain well known laws in physics, the action of the sun in the equatorial regions causes the current of warm water and air to deviate from the coasts of Japan and the Aleutian Islands, and it is directed upon Alaska and British Columbia. Pursuing its course towards the east, and increased by the temperature of the sea, which in winter in the Japan current is 50°, this current of warm air passes over the Rocky Mountains, whose height and breadth are here much less considerable than in the regions lying farther south, and carries into the Peace River country, and over the plains of the Saskatchewan, a quantity of heat which considerably raises the temperature of the country.\n\nThis fact has been established by a great number of scientific men and travellers, particularly by the Hon. M. G. Garfield, delegate to the United States Congress, from Washington territory, by Capt. Palliser, Dr. Hector, Father Pettitot, and Dr. Dawson, of the Geological Survey of Canada.\n\nThere are other causes, writes the Hon. Mr. Garfield, which contribute to render the winter less severe according to its latitude in the vicinity of the 49th parallel and farther to the north, than in the regions situated more to the south. One of these causes is this: \"The two principal chains of the Rocky Mountains, attain their highest elevation between the 32nd and 40th degrees of latitude. Farther north, these chains of Mountains are less elevated and intersected by a great number of wide and low passes.\" The highest parts of the mountains oppose a barrier to the warm southwest winds, prevent them from penetrating into the interior of the continent and force them to follow along their side in a north west direction. At the same time as they advance towards the north, the mountain chains becoming lower, and the depressions wider, these winds pass over their tops, are engulfed in the defiles, and thus spread a part of their heat over the interior regions lying farther north. This atmospheric \"Gulf Stream\" is evidently a part of the great southwest current which circulates in the temperate zone around the world, as wind skimming over the surface of the ground wherever it meets no obstacles; but more especially as an upper current whenever it is obstructed by chains of mountains or continental masses. These currents driven upward by the mountain chains, often return to the surface of the ground, and produce very marked effects. On the great Columbia plateau, during the intervals of great cold, after having passed over the tops of the Cascade mountains, the southwest wind descends at times to the surface of the ground; then snow is immediately formed, the ice disappears, and the temperature becomes mild and pleasant. When the current goes up again, frost reappears, and the winter resumes its course. These occasional currents are designated by the name of Chinooks.\n\nThese warm winds of the southwest passing through the lower parts of the Rocky Mountains, blowing hard through the defiles which cut through these mountains in their northern section, and extending, like a fan, over the immense regions of the Saskatchewan and Assiniboine, (the least elevated plains also being there fairly sure), give to these regions a mildness of climate almost incomprehensible by, and incredible to, those who have not given the subject any particular attention. But theory and observations have established that after having the Pacific coasts and going east towards the Mississippi, the severity of winter augments under every latitude in which causes of disturbance do not intervene such as chains of mountains or a general elevation of the surface of the soil. (1.)\n\n(1) Climates of the North West, by Hon. G. Garfield.\nAccording to Dr. Dawson, the region bordering on the mountains incontestably possesses a more temperate climate than that more distant from them, notwithstanding, up to a certain point, its greater mean elevation. The series of air currents coming from the west, and especially the great west winds called \"Chinooks,\" play an important part in this amelioration. It is a fact that the passage of these winds above a high mountain barrier, and their ulterior descent upon a section of land lower, although still comparatively dry and warm, in accordance with well known physical laws, permits them to effect rapidly the dissolution and evaporation of the snow.\n\nThese remarks of Dr. Dawson apply principally to the section comprised between latitude 49° and 51° 20', that is to say the southern part of the Saskatchewan plain. But Dr. Hector likewise establishes the influence exercised by the west winds in winter over the temperature in the region of the North Saskatchewan and even in the valley of the Athabasca. He says that several circumstances led him to believe that the climate in the vicinity of Rocky Mountain House was more favourable to agriculture than that of Edmonton which lies much more to the east and is eight hundred feet lower. Every day, says he, speaking of the time that he passed in winter at Rocky Mountain House, we have here mild winds coming from the west, which make the thermometer rise, even above freezing point, and they tell me that the winter is always much milder and the spring earlier than in places lying more to the east. Under the date of 23rd February, 1858, at Edmonton, the same traveller writes in his journal, as follows: \"The weather has been changeable and stormy during some days, but today it is extraordinarily warm. We have had the windows opened, sat in our shirt sleeves, and made no fire since breakfast. Two hours after noon, the thermometer registered 63°. The snow has altogether disappeared, several of the streams are running freely, and the ground is thawed to a depth of six inches.\" He says also, that nine days later, on the 6th March, the thermometer exposed to the sun in the open air registered 70°.\n\nIn speaking of the investigations of Dr. Hector, Captain Palliser states that he had obtained much valuable information concerning the winter temperature of the region bordering on the Rocky Mountains, in the Athabasca and Saskatchewan valleys, and that among other interesting phenomena he was assured that the mean temperature of the winter months at the foot of the Mountain is fifteen degrees higher than that of the western part of Canada; that is to say, of the Provinces of Ontario and Quebec. In his journal, under the date of 5th February, 1859, speaking of the neighbourhood of Jasper House, Dr. Hector has set down the following description, which gives the clearest possible idea of the mildness of the winter climate of the region, produced by the winds blowing from the Pacific:\n\n\"Although the weather here continues to be mild and fine, it is evident that it is snowing east of us outside the mountains. This afternoon, a duck was killed in the river in front of the fort, and a man instantly threw himself into the water to find it. When one thinks that on the prairies the rivers will remain still covered with ice for three months yet, reckoning from this date, a circumstance like this proves the difference which exists between the climate of the region bordering on the foot of the mountains and that of those sections lying more to the southeast.\"\n\nSir Alexander Mackenzie, who passed a winter in the Peace River country a couple of hundred miles from the Rocky Mountains and several from Lake Athabasca, in like manner states the influence exercised upon the winter\nclimate of these regions by the warm winds coming from the Pacific, as may be seen from the following notes, taken from his printed journal:\n\n\"The 29th (December) he says, the wind blowing from the east, the weather was still and cloudy. In the air was heard a dull sound resembling distant claps of thunder, and then the sky began to lighten far off in the south west, from whence came to us a veritable hurricane of wind, which blew for eight hours. A little after this wind began to blow, the atmosphere became so warm that all the snow melted upon the ground; the ice even was covered with water and had the same appearance as at the time of its breaking up in the spring. The 5th (January) in the morning, the day was calm, clear and very cold; the wind began to blow from the south west and in the course of the afternoon a thaw set in. At Lake Athabasca, I had already observed that this wind invariably brings fine mild weather, while the opposite one, on the other hand, brings snow. Here this is much more sensibly felt: for if the wind blows from the south west during four hours, it is followed by a thaw, and when the wind comes from the north east, it brings sleet and snow. These warm winds come off the Pacific Ocean.\"\n\nTo conclude, these warm winds are sensibly felt even within the polar circle. Father Pettiot, missionary at Fort Good Hope, on the Mackenzie, narrates in his journal that in January 1867, they made the thermometer rise to one degree above zero, and took away so much of the snow that the bodies of the wild animals made a track into the wood.\n\nThe action of these warm winds is thus explained by Dr G. M. Dawson who has made of them a special study.\n\n\"It has been often stated, in a general way, that the cause of the exceptionally favourable climate of the Saskatchewan and Peace River countries, as compared with that of the eastern part of the American continent, is to be found in the prevalence of warm westerly winds from the Pacific. Sir Alexander Mackenzie speaks of the influence of these westerly winds in winter. More to the south, they are called \"Chinooks,\" and it has been observed that they produce similar effects.\n\nThe complete explanation is to be found in the great quantity of heat rendered latent when moisture is evaporated or air expanded in volume, but which becomes sensible again on condensation of the moisture or compression of the air.\n\nThe pressure in the upper regions of the atmosphere being so much less than in the lower, a body of air rising from the sea level to the summit of a mountain range, must expand, and this, implying molecular work, results in an absorption of heat, and consequent cooling. The amount of this cooling has been estimated at about 1° centigrade for 100 metres of ascent when the air is dry, but becomes reduced to ½ degree when the temperature has fallen to the dew-point of the atmosphere, and precipitation of moisture as cloud, rain, or snow begins; the heat resulting from this condensation retarding to a certain degree, the cooling due to the expansion of the air. When the air descends again on the farther side of the mountain range, its condensation leads to an increase of sensible heat equal to 1° centigrade for each 100 metres.\n\nThe data are wanting for an accurate investigation of the circumstances of our west coast in this regard, but a general idea of the fact may be gained.\n\n(1) Mackenzie's Journeys to the Pacific Ocean.\n\"We may assume that the air at the sea level is practically saturated with moisture, or already at its dew-point; that in crossing the mountainous region the average height to which the air is carried, is about 2000 metres (6,560 feet) and that it descends in the Peace River country to a level of about 700 metres (2,296 feet). The loss of sensible heat on elevation would, in this case, amount to $10^\\circ$ C. ($18^\\circ$ F.); the gain on descent to the level of 700 meters to $13^\\circ$ C. ($23.4^\\circ$ F.). The amount of heat lost by the air during its passage, across the mountainous region by radiation and contact with the snowy peaks, cannot be determined. It is of course much greater in winter than in summer, and depends also on the speed with which the current of air travels. Taking the mean summer temperature of the coast at about $12^\\circ$ C. ($54^\\circ$ F.), and allowing several degrees for loss by radiation, it becomes easy to understand how the western prairies may be flooded with air nearly as warm as that of the coast, through it has travelled to them over a region comparatively cold.\n\nOwing to the great width of the mountain barrier, the main result is complicated by local details; regions of considerable precipitation occurring at each important mountain range, with subsidiary drier regions in the lee. The last of these regions of precipitation is that of the Rocky Mountain Range properly so-called. In descending from this, a further addition is made to the air, which then flows down to the east as a dry and warm current.\" (1)\n\nThese extracts are a little long, but it is necessary to establish well the important effect that these warm winds from the Pacific, or from the great Japan current, have on the climate of the North West, and to demonstrate clearly that if the elevation of the latitude has the effect of lowering the temperature in these regions, the winds from the Pacific more than counterbalance this effect, and give to these vast territories a climate which puts them on a footing of equality with the parts of the world which are the most thickly settled and the most advanced in arts and industry.\n\nIn summer, the warm winds hardly make themselves felt, since their temperature not being ordinarily so high as that of the plains lying east of the Rocky Mountains, their influence could only be exerted in places where the general temperature is lowered or affected by local circumstances. As the spring advances, and the sun travels from the equator northwards, these warm southwest winds, whose action in winter is so perceptible, advance also towards the north as upper currents, being constantly rarified and held in suspension by the increasing action of the sun; and the accumulation of these masses of hot air in the arctic regions, forces back a lower and cooler counter-current which blows from the north west into the plains. When autumn arrives, in the degree that the lower strata of the atmosphere become cold with the diminution of the solar action, they lower themselves anew, and gradually resume the calorific influence which they exert on the plains during the cold season.\n\nThe effect of the gulf stream, or the equatorial current of the Atlantic on the temperature of a good part of Europe is well known. It is this which carries the heat of the tropics to the cold regions of Northern Europe. The water retains the heat until it strikes the shore, where, in its restless motion it robs itself of this heat which the winds carry into the interior of the continent, and this gives to a great part of north and middle Europe, the\n\n(1) Geological Survey of Canada for 1879-80, pages 70 B' and 75 B'.\ntemperature that renders them habitable. In short, it is well known that if the beneficent action of the Gulf Stream should cease, the North Sea would become a frozen ocean, the British Isles would become another Labrador incapable of producing wheat or barley, and its inhabitants would be obliged to emigrate to preserve themselves from perishing in a frozen desert. Now the equatorial current of Japan which directly influences the climate of our North West territories is much more powerful as a source of heat than the Atlantic gulf stream, and when we know the influence of the latter on the climate of European countries, it is easy for us to form a just idea of that of the former over our vast countries of the North West, and the fact is explained and established without question, that in British America wheat has been successfully cultivated above the 60th degree of latitude.\n\nAnother important factor affecting the climate of the plains of the North West from an agricultural point of view, especially that of the ripening of the cereals, is the length of the days in summer. On this point, thermometric observations are far from giving an exact idea of the climate of these regions. It is not so much the degree of heat as the sum of calorific action which makes the grains sprout and ripen, and this view is confirmed by the fact that vegetation is always much more rapid in northern countries than in those which more nearly approach the equator. In truth, in the north, the temperature indicated by the thermometer being the same, in a given region, with that in another region lying farther south, the quantity of heat would be more considerable, since the more one advances towards the pole, the more the days lengthen, and consequently, the greater is the sum of the calorific action of the sun. The length of the days of summer increases with the latitude in the following proportions:\n\n| Latitude | Lon. (°) | Length of night |\n|----------|---------|----------------|\n| 45°      | 15.6    | 8.4 hours      |\n| 50°      | 16.3    | 7.7 \"          |\n| 55°      | 17.3    | 6.7 \"          |\n| 60°      | 18.7    | 5.3 \"          |\n\nIt is easy to see the results given by this table when applied to comparisons between well known localities.\n\nThe 45th parallel, which passes near Cornwall, Bracebridge, on the Muskoka River, and Cape Hangcliff on Georgian Bay, divides into two nearly equal parts, that portion of the province of Ontario contained between Lake Nipissing and Lake Ontario. Along this line the duration of the longest day of summer is 15.6 hours. The most northern part of the plains of the Peace River is crossed by the 55th degree of latitude. In this latitude, the longest day of summer is 17.3 hours, or nearly an hour and three quarters more than in the province of Ontario, which is the same as saying that the result of the sun's action upon vegetation is not much less than 12 per cent more considerable in the district of Athabasca than in the province of Ontario. Instituting a similar comparison between the central part of Manitoba and the corresponding part of the plains of Peace River, there will be found in favour of this latter region a difference of an hour and a quarter.\n\nIt is evident then that under a like thermometric temperature, the most northern regions of our great North West territories receive a greater amount of solar heat, and consequently the ripening of the cereals will be more rapid and prompt there than in regions lying further south. This fact, stated by Schubeler in Norway, and corroborated by observations in other countries, is brought out clearly in the attempts at cultivation which have been made on the plains of the Saskatchewan and the Peace River.\nAnother important fact in the climatology of the four districts we are describing, is this: their small elevation above the level of the sea, as compared with the lands farther south. The altitude of the upper part of the plain of the Saskatchewan is computed by Captain Pilliser to be 2,700 feet, and that of the lower part 1,600. It is calculated that for every thousand feet of elevation, the temperature lowers three degrees; so that from this point of view, the temperature, of the highest part of the Saskatchewan plains represents only four and a half degrees, and the lowest ten and a half degrees, which is much less than on the plains of the United States lying more to the south. \"It is well known,\" says the Hon. Mr. Garfield (1) \"that the temperature lowers nearly three degrees for every thousand feet of elevation. It will be seen, that by reason of this cause alone, the region of the Saskatchewan in British America, has a temperature 12° higher than if it had the elevation of the Union Pacific Railway, and of 24° higher than if it were of the altitude of the Mexican plateaus. This single difference of altitude compensates for the difference of latitude.\"\n\nThe elevation above the sea of the plains of the Peace river is still less than that of those of the Saskatchewan. The general level of that part lying between the Rocky Mountains and the Smoky river is about 2000 feet, and that of the part between that river and Lake Athabasca, the eastern limit of the district of that name, does not exceed 1,000 feet and even diminishes as it goes northwards. The low lands which surround the north end of Lake Athabasca and which are crossed by the lower part of Peace river, so similar in other respects to that of Red river, have also the same elevation above the sea, viz.; 600 to 700 feet.\n\nThus, the warm winds from the Pacific, the comparatively greater length of the summer days, and the little elevation of the land above the level of the sea, considerably ameliorate the astronomical climate of the plains of the Saskatchewan as well as of those of the Peace river, more than compensate for the high latitude, and give to these vast territories a temperature which puts them in the category of the most favoured agricultural lands, as well as of a climate, the most fitted for the development of the energy and industry of man.\n\nLet us now examine the results of thermometric observations made in different parts of these territories. These observations will be found condensed in the tables which follow:\n\n(1) Climates of the North West.\n## SOUTH WEST REGION\n\n| LOCALITIES       | Fort-Walsh | Fort-McLeod | Fort-Calgary |\n|------------------|------------|-------------|--------------|\n| **Altitude**     |            |             |              |\n| Latitude         | 49° 32'    | 49° 39'     | 50° 53'      |\n| Longitude        | 109° 51'   | 113° 12'    | 113° 45'     |\n| **January**      | 19° 49     | 11° 40      |              |\n| **February**     | 25° 70     | 1° 60       |              |\n| **March**        | 25° 10     | 10° 00      |              |\n| **April**        | 42° 50     | 36° 70      |              |\n| **May**          | 53° 20     | 51° 80      |              |\n| **June**         | 57° 00     | 61° 10      | 61° 00       |\n| **July**         | (0° 20)    | 67° 10      | 59° 60       |\n| **August**       | 58° 80     | 64° 30      | 53° 50       |\n| **September**    | 49° 00     | 54° 60      | 47° 20       |\n| **October**      | 41° 20     | 41° 00      | 36° 10       |\n| **November**     | 27° 20     | 15° 00      |              |\n| **December**     | 25° 00     | 21° 20      |              |\n| **Year**         | 42° 26     | 38° 76      |              |\n\n| **Winter**       | 23° 88     | 11° 40      |              |\n| **Spring**       | 40° 26     | 32° 53      |              |\n| **Summer**       | 53° 66     | 64° 16      | 53° 03       |\n| **Autumn**       | 40° 93     | 32° 76      |              |\n\n## NORTH WEST REGION\n\n| LOCALITIES       | Fort-Norway | Fort Cumberland | Fort-Pelly |\n|------------------|-------------|-----------------|------------|\n| **Altitude**     | 400 feet    | 900 feet        | 800 feet   |\n| Latitude         | 51° 00      | 53° 57          | 51° 51'    |\n| Longitude        | 98° 00      | 102° 16'        | 102° 10'   |\n| **January**      | -7° 00      | 4° 11           | 10° 50     |\n| **February**     | -2° 41      | -6° 00          | 13° 80     |\n| **March**        | 7° 00       | 12° 15          | 2° 60      |\n| **April**        | 27° 10      | 26° 00          | 33° 50     |\n| **May**          | 44° 60      | 51° 29          | 51° 50     |\n| **June**         | 54° 91      | 64° 25          | 59° 29     |\n| **July**         | 63° 50      | 71° 25          | 67° 20     |\n| **August**       | 61° 20      | 61° 42          | 60° 10     |\n| **September**    | 46° 40      | 46° 25          | 45° 30     |\n| **October**      | 31° 10      | 36° 08          | 35° 10     |\n| **November**     | 12° 50      | 18° 24          | -0° 20     |\n| **December**     | -1° 70      | 6° 47           | -0° 70     |\n| **Year**         | 29° 61      | 33° 51          | 31° 81     |\n\n| **Winter**       | -3° 34      | -5° 73         | -3° 20     |\n| **Spring**       | 28° 23      | 29° 81         | 29° 20     |\n| **Summer**       | 59° 53      | 65° 64         | 62° 16     |\n| **Autumn**       | 29° 93      | 32° 88         | 27° 73     |\n### NORTH SASKATCHEWAN CENTRAL REGION\n\n| LOCALITIES       | Carlton | Battleford | Edmonton |\n|------------------|---------|------------|----------|\n| **Altitude**     | 1321 feet |            | 2888 feet |\n| **Latitude**     | 52° 5'   | 52° 11'    | 51° 37'  |\n| **Longitude**    | 106° 18' | 108° 50'   | 112° 52' |\n\n| Month           | January | February | March | April | May | June | July | August | September | October | November | December |\n|-----------------|---------|----------|-------|-------|-----|------|------|--------|-----------|---------|----------|----------|\n|                 | 0.00    | 3.00     | 6.10  | 8.10  | 12.20| 19.90| 22.20| 38.10  | 49.10     | 58.12   | 64.00    | 68.20    |\n|                 |         |          |       |       |     |      |      |        |           |         |          |          |\n| Year            | 35.70   | 38.12    | 35.18 |\n\n| Season          | Winter  | Spring   | Summer | Autumn |\n|-----------------|---------|----------|--------|--------|\n|                 | 0.29    | 55.30    | 63.33  | 33.53  |\n|                 |         |          |        |        |\n|                 |         |          |        |        |\n|                 |         |          |        |        |\n\n### NORTH WEST, OR PEACE RIVER REGION\n\n| LOCALITIES       | Fort Chipewyan | Lower Peace River | Dunvegan |\n|------------------|----------------|-------------------|----------|\n| **Altitude**     | 700 feet       | 850 feet          | 1302 feet |\n| **Latitude**     | 58° 43'        | 58° 50'           | 58° 08'  |\n| **Longitude**    | 111° 18'       | 112° (0) (3)      | 117° 13' |\n\n| Month           | January | February | March | April | May | June | July | August | September | October | November | December |\n|-----------------|---------|----------|-------|-------|-----|------|------|--------|-----------|---------|----------|----------|\n|                 | -5.76   | -9.10    | -9.80 | -9.20 |     |      |      |        |           |         |          |          |\n|                 |         |          |       |       |     |      |      |        |           |         |          |          |\n| Year            | 27.52   | 32.53    | 34.77 |\n\n| Season          | Winter  | Spring   | Summer | Autumn |\n|-----------------|---------|----------|--------|--------|\n|                 | -3.83   | 4.21     | 9.05   | 23.06  |\n|                 |         |          |        |        |\n|                 |         |          |        |        |\n|                 |         |          |        |        |\nBefore entering into other details, let us compare the temperatures these figures indicate with those of certain well-known localities in Europe. This comparison will show clearly, that, the plains of the Saskatchewan and those of the Peace river differ very little in this respect from the finest agricultural countries of Europe, and that as regards summer temperature, the climate of our prairies is superior to that of several European countries, especially to that of Great Britain. The figures which point out these temperatures are given below:\n\n| LOCALITIES       | Winter | Spring | Summer | Autumn | Year |\n|------------------|--------|--------|--------|--------|------|\n| Fort McLeod      | 23.66  | 40.26  | 64.16  | 40.93  | 42.26|\n| Calgary          | 11.40  | 32.83  | 58.03  | 32.76  | 33.76|\n| Norway           | 3.33   | 26.23  | 59.63  | 29.93  | 29.01|\n| Cumberland       | 5.73   | 29.81  | 65.64  | 32.86  | 33.51|\n| Pelly            | 3.20   | 29.20  | 62.16  | 27.73  | 31.81|\n| Carlton          | 0.30   | 35.36  | 63.33  | 33.33  | 33.76|\n| Battleford       | 10.03  | 37.93  | 64.10  | 33.30  | 36.12|\n| Fort Edmonton    | 5.70   | 36.46  | 61.70  | 36.86  | 35.18|\n| Chipewyan        | 3.33   | 22.76  | 58.70  | 34.88  | 27.52|\n| Lower Peace River| 4.25   | 32.89  | 56.64  | 33.02  | 32.53|\n| Fort Dunvegan    | 0.05   | 33.66  | 61.90  | 40.20  | 34.77|\n| London           | 39.20  | 47.60  | 61.00  | 50.70  | 49.60|\n| Liverpool        | 40.50  | 46.20  | 57.60  | 49.10  | 48.30|\n| Glasgow          | 38.40  | 45.90  | 60.10  | 49.00  | 48.60|\n| Edinburgh        | 38.40  | 45.00  | 57.10  | 47.90  | 47.10|\n| Paris            | 37.80  | 50.60  | 64.50  | 52.20  | 51.30|\n| Berlin           | 31.40  | 47.40  | 64.50  | 49.20  | 48.10|\n| Christiana       | 22.80  | 39.40  | 59.70  | 42.00  | 41.00|\n| Stockholm        | 26.00  | 38.20  | 60.40  | 44.40  | 42.30|\n| St. Petersburg   | 48.10  | 35.90  | 60.60  | 40.30  | 38.70|\n| Riga             | 25.20  | 45.20  | 63.00  | 41.20  | 43.70|\n| Warsaw           | 25.20  | 44.90  | 64.60  | 46.00  | 45.20|\n| Moscow           | 15.20  | 41.00  | 64.00  | 39.90  | 40.00|\n| Kazan            | 6.20   | 36.20  | 62.40  | 36.90  | 35.00|\n\nAs is seen, the other seasons are a little colder but the summer, the specially important season from an agricultural point of view, is warmer in our North West Territories than in the greater part of these European localities, in which agriculture has nevertheless been wonderfully successful. It is worthy of remark that Fort Chipewyan and the lower Peace River region, which show the lowest summer temperature, have yet a summer, not less warm than that of Edinburgh and Liverpool. Now these two cities are the centres of sections where all the cereals, except maize, are cultivated with success.\n\nLet us look a little into the characteristics of each season by thermometric observations would indicate. The sky is ordinarily clear, the weather fine\nand dry, making the cold infinitely less penetrating than in such humid climates as that of Great Britain and of certain parts of Germany, which are notwithstanding populous. The raw wet weather, so unhealthy and so uncomfortable, of Great Britain and the north of Europe, is unknown on our great western plains, and one can go out without suffering from cold in the least degree when the thermometer registers 10°, 15°, or even 20° below zero, especially as when it is very cold, the wind never blows. \"Owing to the dryness of our atmosphere, says Father Petitot, the climate is very salubrious and gives strength to those in feeble health: *sanitas e staco.*\" This same dryness is also the reason why less snow falls than in more humid climates.\n\nIt will be easily comprehended that with an atmosphere generally so dry during the winter, comparatively little snow falls on the plains of the North West. Along the Rocky Mountains, there is a narrow border where no more than a few inches of snow ever remains on the ground. Forty miles farther east the thickness of the snow fall increases but rarely exceeds two feet. Upon the prairies the snow rapidly evaporates and does not accumulate except in the hollows, but it accumulates in the woods which protect it both against the wind and from evaporation and in the northeast part, it sometimes reaches in the spring or rather at the end of winter, the depth of three or four feet. As is seen, on the prairies just enough of snow falls to make excellent winter roads, and permit travel in all directions without the least difficulty and without being troubled with those drifts which so often render it difficult and even impossible to get about in the eastern provinces.\n\nAs we have seen above, the quantity and depth of snow increases as we go towards the north east; there is even less in the southern part than in the section nearest the mountains, and in these sections cattle can browse on the trees without difficulty during all the winter. This is established by the fact of the buffaloes before they were destroyed or hunted away by settlements, having preferred to winter in those regions from the United States frontier to Peace River. This fact is also stated by all explorers who inform us that the domestic animals winter perfectly well on the plains without either stabling or artificial nourishment and that they even grow fat on it. In the narrative of their journey across the plains, Lord Milton and Dr. Cheadle relate that the horses which they had put out to graze on the prairie during the winter, were in excellent condition, and like \"balls of fat\" when they were taken in in the spring; and the 80,000 cattle that the owners of ranches have wintered for several years in the Bow River region, without shelter or artificial food also prove without dispute, that the winter is far from being as severe as thermometric observations would indicate, and is in fact less severe than on the plains of Russia and Germany.\n\nOn the North West portion of the Saskatchewan plains, the section of which Fort Edmonton is the centre, the subject of the winter temperature was carefully studied by Capt. Palliser, who has recorded the phenomena we give below.\n\nAt Edmonton, the winds may be divided into three groups: First, the clear wind which in winter brings intense and extreme cold, and which comes from the north west. This wind may be regarded as the rightly named \"continental\" current, and is that which accompanies settled fine weather. Often it only acts on the lower strata of the atmosphere, the clouds in the upper strata taking a contrary direction. The direction of this wind must not be too strictly defined, since it often varies more or less, although its character...\nremains the same, its force being altogether subordinate to one or another of the other groups, which are cloudy winds. Secondly, the winds which generally blow from the north and east, as well as from intermediate points, and which, in winter, bring snow. Thirdly, the south and south east winds which coming from the Pacific Ocean, across the Rocky Mountains, bring always cold, heat and sometimes in the winter even rain.\n\nIn the upper Saskatchewan, the phenomena of winter temperature follow each other in nearly the following order:\n\nSome days of fine settled weather, though perhaps extremely cold, are followed by a slight rise in temperature occasioned by the north east wind accumulating a canopy of clouds above the lower strata of the atmosphere and thus preventing radiation. This is done gradually every morning, the sky becoming more and more cloudy, but lightening up at first in the middle of the day, until at the end of a few days the clouds remain until evening, then a piercing nor' east wind rises, which ends in a hurricane followed by a fall of snow. This snowfall often lasts two or three days, after which the snow falling more gently and the temperature rapidly rising, the clouds open, and allow the upper strata of the atmosphere to be seen rapidly moving from the south west and driving little fleecy clouds over a clear sky. Generally, the night following the wind blowing then from the south west increases in violence, veering sometimes to nearly all points of the compass, and in a short time is transformed into a cyclone, raises the temperature and forms big cloudy which fall in rain. After this hurricane brought by the south west wind a gale wind from the north west generally springs up in an irregular manner, and a few days the temperature lowers to extreme cold during which the weather is generally calm, and then come the fogs and mists brought by the north west wind. In the winter noted in a special manner and with the greatest care by the expedition of Palliser, the distribution of these winds at Edmonton, was as follows:\n\n**January**\n\n- Winds clear and cold from the north west: 4 days\n- Winds cloudy from the north east: 17 days\n- Winds misty and warm from the south west: 6 days\n\nThere were 12 days cloudy and 4 days of snow with the north east wind, 3 days cloudy and 1 of rain with the south west winds.\n\n**February**\n\n- Winds clear and cold from north west: 10 days\n- Winds snowy from north east: 7 days\n- Winds misty and warm from south west: 11 days\n\nThere were 7 days of cloudy weather and 4 days of snow with the north east wind, 7 days of cloudy weather and 3 days of rain with a south west wind.\n\n**March**\n\n- Winds clear and cold from north west: 19 days\n- Winds snowy, cool and cold from north east: 15 days\n- Winds warm from south west: 15 days\nThere were 9 days of cloudy weather and 7 of snow with north east wind, 9 days of clouds and 3 days of rain with the south west winds.\n\nApril\n\nWinds clear and cold from north west 5 days.\nWinds cold and raw from north east 10 days.\nWinds warm from south west 15 days.\n\nThere were 8 days of cloudy weather and 2 of snow with the north east wind, 10 days of clouds and 4 of rain with the south west wind.\n\nWe have given the months of March and April in order to show how the transition from winter to spring is made.\n\nThis progresses rapidly in all the Saskatchewan country, but particularly in the north west section, where it is not retarded as in the north east, by the melting of the ice on the lakes and streams, which cover a much greater extent in this section. At the post of Carlton and Edmonton, the thermometer rises nearly always to 40° and 45° after the 1st March, and at times reaches 60° and even 70° in the sun, in the section lying between Edmonton and House Jasper on the upper Athabasca. The snow melts rapidly, so much so, that in their excursions at this season, the expedition of Palliser could only travel early in the morning or in the evening after sunset, when the frost gave a little hardness to the snow, which was too soft and moist, or rather too much melted, during the day so as walking on snow shoes or the dogs drawing their sledges. The snow ordinarily disappears at the beginning of April and often by the end of this month, the work of cultivation has already commenced. The following extracts taken from the journal of the Rev. Thomas Wooley, missionary, and from that of Palliser, will enable us to see the progress of this season at Edmonton.\n\n(Journal of Mr. Wooley for 1857)\n\nMarch 21.—The ducks and wild geese appear.\nMarch 31.—The snow has completely disappeared.\nApril 7.—Work has commenced. The river has been crossed on the ice for the last time.\nApril 28.—The first wheat sown.\nMay 5.—Boats arrive from Rocky Mountain House. Navigation is open.\n\n(Journal of Expedition of Palliser, 1857)\n\nMarch 13.—Strong breeze from the south. A party of men arrive from the plains with sleighs; they have had hard work to get them through as there was no snow at all on the road, the snow having disappeared in exposed places, but there is still ashine in the thick woods.\nMarch 20.—Rev. Mr. Neillman arrived today from the Serpent Hills, informs us that the river is open in several places.\nApril 12.—The weather so fine very mild. Three men have commenced work in the field around the fort.\nApril 23.—The river is clear of ice above the fort.\nApril 25.—Aiders and moquitos very at the fort.\nApril 29.—Fine clear weather. Three men sowing wheat.\nMay 4.—Three men sowing barley.\nMay 5. Fine clear weather. Mr. Bazeau arrived this morning by boat with his family from Rocky Mountain House, and the rest of his men with the other boats in the evening.\n\nMay 7. No boat late started, loaded with skins from Rocky Mountain House.\n\nMay 10. Seven men are busy at work.\n\nThe journal of Dr. Hector, for the same year, contains the following notes:\n\n\"May 5. The work of cultivation around the fort is now well advanced. Although it still freezes at night, the weather this month has been mild and favorable to vegetation, which, when one considers the latitude and the exposure, is remarkably vigorous. Although this spring is regarded as a month later than others, everything here was much more advanced at the beginning of May than it was at the middle of June in 1837 on Lake Superior five degrees further south.\"\n\nCaptain Palmer states that the ice takes on the Saskatchewan about the 12th November, and that it breaks up from the 15th to 20th April, that the spring phenomena was much earlier, that the snow disappeared in a few days, and that at the beginning of May, the grass had already begun to grow. The 11th April, the blue anemone was in bloom on the prairie as well as the asters on the river banks, and there were myriads of butterflies.\n\nIn the Peace River region, the spring is still earlier and progresses as rapidly, as may be seen from the following notes, extracted from the journal of Sir Alexander Mackenzie, relating what he noted during the winter that he passed at the confluence of Smoky and Peace Rivers.\n\n\"The good weather that we had at the beginning of February, lasted until the 14th March, when the wind blowing from the south west, the weather became cold. The 15th March, some wild geese were seen, and these birds were always considered as the forerunners of spring. The 1st April our legs began to feel fine. The weather has been mild for a fortnight and promises to continue so. On the 5th April, the snow had entirely disappeared.\"\n\n\"The 2nd April, I made an observation of Jupiter and his satellites to within longitude, and as soon as they came into sight, I called upon the companions of the sun, the stars and meteorites. On the other side of the river, which was covered with ice, the plants were delightful to see; the trees were covered with their buds, and many plants in flower. Mr. Mackay brought me a bouquet of rose-colored flowers and a yellow button surrounded by six leaves of a soft purple color. The change in the aspect of nature was as sudden as surprising, for only a few days before, the ground was covered with snow. On the 26th April, the river was free of ice.\n\n\"At this time from the 5th to the 10th of May, the buffaloes were accompanied by their young who gambolled around them. All the country shone with an extraordinary beauty; and the flowering trees were rapidly approaching the moment of giving us the delightful spectacle of their bloom.\n\nIn all Canada, there is only the southern part of the Province of Ontario in which the spring approaches that of Peace River, as it is described by Sir Alexander Mackenzie, and it may be safely affirmed that the state of vegetation so well observed by him, denotes a spring more forward than that of England and a good part of Germany.\n\nIn comparing the tables of the mean temperature of the spring in the different parts of the north west with that of the principal centres of population of the Eastern Provinces, it is found that the difference is inconsiderable.\nhardly to be observed. The following table will form the elements for this comparison:\n\n| LOCALITIES | March | April | May | Spring |\n|------------|-------|-------|-----|--------|\n| Toronto    | 27.2  | 46.3  | 53.4| 45.3   |\n| Cornwall   | 24.3  | 39.3  | 55.5| 39.8   |\n| Montreal   | 26.7  | 43.4  | 56.6| 42.9   |\n| Quebec     | 21.8  | 36.8  | 50.4| 32.8   |\n| Halifax    | 29.1  | 37.2  | 46.4| 37.6   |\n| St. John   | 27.6  | 36.5  | 45.7| 36.6   |\n| Fort Norway| 27.0  | 37.1  | 44.6| 29.2   |\n| Cumberland | 22.2  | 26.7  | 35.5| 29.8   |\n| Fort Pelee | 21.6  | 27.1  | 35.2| 29.2   |\n| Calgary    | 16.0  | 31.7  | 35.4| 32.8   |\n| Fort Macdonald | 25.0 | 32.2  | 35.2| 32.8   |\n| Carlton    | 26.5  | 35.5  | 35.5| 35.5   |\n| Battleford | 19.6  | 35.5  | 35.5| 35.5   |\n| Edmonton   | 22.2  | 35.5  | 35.5| 35.5   |\n| Fort Chipewyan | 35.5 | 35.5  | 35.5| 35.5   |\n| Dunvegan   | 17.6  | 35.5  | 35.5| 35.5   |\n\nThe figures given for Toronto, Cornwall, and St. John are the mean of the five years, but the figures given for the other stations have been calculated by Mr. Thompson, who has directed the observations under the direction of the Meteorological Department of Canada. The observations of Mr. Thompson show that the temperature in April and May was much higher than that of 1840, since they are 33° higher than those given above as the result of the present years.\n\nThe conclusion which may be drawn from these figures is that:\n\n1. The temperature of the prairies, except Toronto, is lower than that of all the other localities except Montreal;\n2. The same at Halifax and Battleford, but not so much as at St. John, N.B., or Quebec;\n3. The same at Edmonton and Fort Chipewyan, higher than at Quebec; and\n4. The same at Dunvegan, taking the figures of Mr. Thompson for Toronto and Cornwall, and a degree higher than at the other stations of the two years in which observations were taken.\n\nThese facts need no commentary. They prove conclusively that in our North Western prairies the temperature of the year is always even relatively higher, in some localities, than in the more southerly and more advanced\nsections of the old provinces of Canada, with this difference, that over there the snow goes off earlier, and that consequently the work of cultivation begins much sooner than in the eastern sections. At Fort McLeod, Bathurst, Moncton, or Dumaguay, work and seeding commence after the 15th of April, which is nearly a month in advance of a good part of the province of Quebec, of New-Brunswick and of Nova Scotia, where rain and bad weather are at this season infinitely more frequent, and of longer duration than on the western plains, which enjoy in this respect also an incontestable advantage.\n\nIn all the prairie region, but especially in the north west portion and along the United States frontier, the spring, in an agricultural point of view, is one of the finest seasons possible to imagine. The weather is clear, still, dry, and rain almost unknown. The gradual thawing out of the soil furnishes vegetation all the moisture of which it has need, and gives it a vigour of which it is hardly possible to form an idea, unless one has seen it with his own eyes. These facts are all stated by Professor Macoun, who has made of this subject a special study. Early in April, he says, the sun which is already strong melts the small quantity of snow which covers the ground, and almost immediately work commences, for even when the surface of the soil is thawed only six inches, the work of cultivation may be begun. Work and seeding go on at the same time, as the soil is entirely dry, and in a few days the grasses commence, thanks to the heat of the sun; the roots receive plenty of moisture from the soil as it thaws out, and following the frost, in the degree which that comes out, in the very pores even that it opens, penetrate to an astonishing depth (sometimes even two feet) sending out all the time their fibrous fires. When the rain and heat of the month of June arrive, a mass of roots is already formed, which rapidly push the plants to maturity.\n\nIt is owing to the power possessed by the frost of opening the soil, as to its fertility, that we must attribute the enormous crops raised in the North-West.\n\nThe summer is a magnificent season on our great western plains. In places not affected by local circumstances, the mean temperature of this season is higher than in a great part of our old provinces, higher than in the greater part of the agricultural counties of Great Britain, and the weather is of a nature such that the crops ripen rapidly.\n\nThe two first summer in July, June and July, are naturally the most rainy, but there are some rains, such as are common in other countries, retarding vegetation and injuring the grain. These rains are produced by the coming together of the warm moist winds of the south and south west with the colder currents of the north-west, and fall only in showers, generally warm, which do a considerable good to vegetation, and increase its activity in an extraordinary manner. They cease altogether at the end of July or beginning of August, which month is dry and warm and could not be more pleasant in any respect. The following notes taken from the Journal of Palliser for June and July give a sufficiently clear idea of the sort of weather found in these two months.\n\n\"16th June—At half past seven P.M., the thermometer registered 68°.\"\n\"In the afternoon the wind veered from south to north, with violent gusts and heavy passing showers.\"\n\"17th June—Cloudy this morning. At half past 9, a thick fog came from the north, which disappeared at the end of an hour and was followed by cloudy weather.\"\n\"18th June—Heavy rain in morning and at noon.\"\n19th June—Lowery weather in morning, clear in the afternoon, cloudy in evening.\n\n20th June—Rain and mist nearly all day.\n\n21st June—Beautiful morning. Afternoon clouds coming from the west, a little rain fell during the night.\n\n22nd June—At half past six P.M., great clouds in the south. A little rain, clouds veer to the west, and lightning.\n\n23rd June—West and south west winds, cold and high until about sunset, then it fell. In the evening aurora borealis.\n\n24th June—Wind veered to the north during the night. In the afternoon, a strong squall of north wind accompanied with heavy rain. At nine in the evening, the wind suddenly turned to the south east and the weather cleared; the rain ceased and a strong wind came up.\n\n27th June—Cloudy weather at 10 A.M., after having been clear in the morning.\n\n28th June—Heavy rain during last night, great cloud in the south west. Thunder in the distance, heavy rain during the night, no thunder, but some lightning.\n\n29th June—Cloudy weather all day with fresh east and south east wind.\n\nJune 30th—Wind increasing became fresh about noon, and turned into a squall at 8 o'clock. Rain.\n\nJuly 3rd—South wind until sun rise. Fine weather until noon when it became cloudy. In the afternoon the clouds accumulated in the south and formed great masses. At half past five P.M.; the storm broke. It hailed. The storm was half an hour in passing. Large clouds very high up and sharp lightning. The clouds passed to the north west. Rain continued for an hour after the passing of the storm.\n\nJuly 4th—At 11.45 A.M., cloudy weather; thunder at a distance in the north east. At mid-day the weather cleared, and remained clear until 7 P.M., then black clouds began to form.\n\nJuly 5th—Great storms at noon and most terrific than ever.\n\nJuly 11th—At sunset, great clouds in the north, and heavy rain during the night.\n\nJuly 12th—Very warm weather. A little mist in the morning.\n\nJuly 13th—Very warm all day. In the afternoon, fresh wind from the north east. At 4 o'clock, heavy clouds from the south west going against the wind, for a storm of rain and thunder going to the north east. Rained all night.\n\nJuly 15th—From 13th till today clouds and rain. Rain very hard.\n\nJuly 17th—Very warm, although a breeze comes from the west. Sky without clouds for 48 hours.\n\nJuly 18th—In the afternoon, accumulation of clouds, coming from the west and a violent thunder storm passing near us, from west to north east. The clouds are high and scattered, but the lightning is vivid, and the rolling of thunder continual. All was over by 8.50 P.M.\n\nJuly 19th—Clear and warm all day, at 8 o'clock great clouds in north and north west, with flashes of lightning.\n\nJuly 21st—In the afternoon, cloudy weather and rain. Flashes of lighting in the north west.\n\nJuly 23rd—All the afternoon, heavy clouds and thunder on the slope of the mountains south of us.\nJuly 29th—Clouds threatening thunder passed to the southwest during the day, but did not reach us. Weather overcast, but fine.\n\nJuly 30th—Clear in the morning, cloudy at 8 o'clock A.M. Cloud threatening thunder and a good deal of lightning in the east. Cloudy all day. Much rain east of us.\n\nThese notes indicate 8 rainy days in the last fortnight of June, and the same number for all the month of July. But apart from the two days from 13th to 15th July, there was no persistent rain; it only fell in showers of short duration, that is to say giving just enough moisture to stimulate vegetation. These little showers, and the electricity shown by the lightning constitute a state of the atmosphere most favourable to the development of plants and at the same time one of the healthiest. As to the mean temperature, the following table enables us to see how it compares with that of some well known localities of Europe, and of the old provinces of Canada:\n\n| LOCALITIES       | June | July | August | Summer |\n|------------------|------|------|--------|--------|\n| Fort-Walsh       | 57.0 | 60.2 | 58.8   | 58.7   |\n| McLeod           | 61.1 | 67.1 | 64.3   | 64.2   |\n| Calgary          | 61.0 | 59.6 | 53.5   | 58.0   |\n| Norway           | 54.9 | 63.5 | 61.2   | 59.3   |\n| Cumberland       | 64.2 | 71.3 | 61.4   | 65.4   |\n| Pelly            | 59.2 | 67.2 | 60.1   | 62.2   |\n| Carleton         | 59.9 | 64.5 | 65.6   | 63.3   |\n| Battleford       | 59.1 | 65.0 | 68.2   | 64.1   |\n| Fort-Edmonton    | 58.1 | 64.0 | 63.0   | 61.7   |\n| Chipewyan        | 55.0 | 63.0 | 58.1   | 58.7   |\n| Dunvegan         | 59.9 | 65.3 | 60.4   | 61.9   |\n| Toronto          | 63.7 | 68.2 | 67.8   | 66.6   |\n| Cornwall         | 66.6 | 70.4 | 68.3   | 68.4   |\n| Montreal         | 67.5 | 70.9 | 69.2   | 69.2   |\n| Quebec           | 62.3 | 67.0 | 65.1   | 64.8   |\n| Halifax          | 56.7 | 62.8 | 63.3   | 60.9   |\n| St. John         | 56.3 | 60.1 | 59.9   | 58.8   |\n| London           |      |      |        | 61.0   |\n| Liverpool        |      |      |        | 57.6   |\n| Glasgow          |      |      |        | 60.1   |\n| Edinburgh        |      |      |        | 57.1   |\n| Paris            |      |      |        | 64.5   |\n| Berlin           |      |      |        | 64.5   |\n| Christiana       | 58.1 | 61.2 | 59.7   | 59.7   |\n| Stockholm        | 57.0 | 63.4 | 60.8   | 60.4   |\n| St. Petersburg   | 58.2 | 62.7 | 60.8   | 60.6   |\n| Riga             | 61.6 | 65.8 | 61.5   | 63.0   |\n| Warsaw           | 63.7 | 65.7 | 64.4   | 64.6   |\n| Moscow           | 62.4 | 66.4 | 63.1   | 64.0   |\n| Kazan            | 61.4 | 64.8 | 60.9   | 62.4   |\nFrom the comparison between the summer temperatures of the different localities mentioned in this table, it results that:\n\n1. Cumberland, Battleford and Fort McLeod have the same summer temperature as Toronto, Quebec, Moscow, Warsaw, Berlin and Paris, but from six to eight degrees warmer than that of St. John, Halifax, Liverpool, Edinburgh and Christiana;\n\n2. Chippewyan, Calgary and Fort Walsh have the same summer temperature as St. John, Halifax, Liverpool, Edinburgh, Christiana, and Norway House, the same temperature as Stockholm;\n\n3. Fort Pelly and Carlton have the same summer temperature as Riga and Kasan, and a higher temperature than that of St. John and Halifax; and\n\n4. Edmonton and Dunvegan have the same summer temperature as Halifax, London, Glasgow, Stockholm and St. Petersburg, and a higher temperature than that of Liverpool, Edinburgh and Christiana.\n\nThese facts, based upon incontestable data, establish beyond dispute that, as far as regards summer temperature, our great North West plains are in no way inferior and in some cases are even superior, to the most noted agricultural sections of the old provinces of Canada, and of the European countries in which agriculture is the most prosperous and the most advanced. It would be very exacting, certainly, to ask for more.\n\nThe autumn is finer in the North West than in the old provinces on the Atlantic. During the months of September and October, the weather is calm, clear, most pleasant and most favourable for agricultural operations. The nights become very gradually colder after the middle of September; but during the day, the heat keeps up, often even intense, until the last week in October. This season, at least during the two first months, has no rain, or only a very little, so that the harvesting of the cereals, and the storing of the root crops in the cellar are done with greater ease and under better conditions than it is possible to imagine. Then the animals, not being exposed to the inclemency characterising the last part of this season in the older provinces, are kept in a better state for entering on the winter, and can remain later in the fields, which is a considerable advantage.\n\nThe cold weather ordinarily begins in a more or less regular manner in the first week of November. The following notes, taken from the journal of the Reverend Mr. Wooley for 1857 and that of the Palliser expedition for 1858, will show the kinds of weather and the atmospheric phenomena which characterised this month at Edmonton.\n\n**1857**\n\nNovember 1st—Sensible change in the weather, the thermometer marking 2° below zero.\n\nNovember 3rd—A little snow.\n\nNovember 4th—The snow remains on the ground and the river is full of floating ice.\n\nNovember 5th—Very mild weather, thermometer rising to 33°.\n\nNovember 6th—Cold. The snow is increasing.\n\nNovember 7th—The snow increases. The dogs were harnessed for the first time to the sleds.\n\nNovember 9th—The snow increases. The river entirely covered with ice upon which the horses and carts have crossed.\n\nNovember 10th—Piercing cold.\n\nNovember 30th—Nothing remarkable since the 10th.\nNovember 1st—The marshes and water courses freeze for the first time; the earth is also frozen to the depth of 2 inches and the heat of the sun only thaws out the surface. There are still ducks and geese along the river. There have been snow birds for several weeks. The grey plovers are, the only birds remaining on the plains.\n\nNovember 4th—The river is lower than it has ever been, and the ford is crossed in a cart. It is full of floating ice, and there are fringes of ice along the banks.\n\nNovember 5th—The ice collects in the windings of the river.\n\nNovember 11th—The ice in the river gradually increases. Snow is falling.\n\nNovember 12th—Still snowing. At different intervals, there have fallen very nearly 2½ inches of snow during the last twenty hours. An east wind is rapidly melting it.\n\nNovember 14th—During the last week, the ice has again disappeared from the river as well as its banks. All the summer birds have left. The surface of the ground is frozen to four inches.\n\nNovember 15th—South west wind the greater part of the day. In the evening strong wind accompanied by rain, changed into sleet when the wind veered to the north. In the night, hard frost.\n\nNovember 16th—The river is rapidly filling with ice. The water is rising quickly. Ice has taken on the bays, very cold.\n\nNovember 17th—The river crossed the first time on the ice, by making a circuit, but the main current is still free of ice and the carts laden with meat were brought across in the boat.\n\nNovember 18th—This morning there were only some small spots on the river free of ice.\n\nNovember 19th—The wind yesterday veered to the south, which brought on a thaw. The ice on the river is a little broken up.\n\nNovember 22nd—The river taken in solid ice and a horse has passed over. At the ford, above the rapids, there is still much open water.\n\nNovember 23rd—Weather remarkable, continuing mild and the thermometer has hardly changed for 24 hours. A little snow this morning. The wind continues light and variable, veering several times in the day. A fall of fine sleet at 6 P.M. This happens nearly every evening.\n\nNovember 28th—The snow which fell yesterday in the neighbourhood of the fort, had almost entirely disappeared at break of day, at 9 o'clock this morning it rained; at 10 o'clock the wind veered straight north and it froze hard; at 8 o'clock in the evening a strong squall of wind got up, and since, the thaw continues.\"\n\nThis is very nearly the weather that we have in the best sections of the Atlantic province, with the exception of our rain and melting snows, which are unknown on North Western prairies. This constitutes a considerable advantage, since at this season, the animals are not exposed to those falls of melting snow and sleet, common in Ontario as well as in the other eastern provinces and which are so unhealthy for the cattle not yet put up into their regular stables.\nWith regard to mean temperature, the following table will enable us to form a just idea:\n\n| LOCALITIES     | September | October | November | Autumn |\n|----------------|-----------|---------|----------|--------|\n| Fort-McLeod    | 54.6      | 41.0    | 27.2     | 40.9   |\n| Calgary        | 47.2      | 36.1    | 15.0     | 32.8   |\n| Norway House   | 46.4      | 31.1    | 12.3     | 29.9   |\n| Cumberland     | 46.2      | 36.1    | 16.2     | 32.9   |\n| Fort-Pelly     | 48.3      | 35.1    | 0.2      | 27.7   |\n| Carlton        | 45.9      | 35.9    | 17.3     | 33.3   |\n| Battleford     | 46.9      | 33.2    | 19.8     | 33.3   |\n| Edmonton       | 45.6      | 38.5    | 27.1     | 36.9   |\n| Chipewyan      | 43.5      | 33.0    | 19.1     | 34.9   |\n| Dunvegan       | 52.1      | 41.9    | 26.5     | 40.2   |\n| Toronto        | 59.3      | 47.9    | 32.3     | 46.5   |\n| Cornwall       | 58.6      | 47.9    | 30.2     | 45.6   |\n| Montreal       | 58.7      | 48.4    | 31.3     | 46.1   |\n| Quebec         | 57.3      | 43.6    | 27.0     | 42.6   |\n| Halifax        | 56.5      | 48.6    | 35.5     | 46.8   |\n| St. John       | 54.8      | 47.7    | 32.8     | 45.1   |\n| St. Petersburg | 51.0      | 40.6    | 29.4     | 40.3   |\n| Riga           | 51.6      | 40.5    | 31.5     | 41.2   |\n| Moscow         | 53.2      | 39.5    | 27.1     | 39.9   |\n| Kasan          | 59.0      | 37.1    | 24.7     | 36.9   |\n\nAs we see, the thermometric observations show a dozen degrees of difference in favour of places situated in the eastern provinces; but when is taken into account, the humidity which, in these provinces, renders the cold much more penetrating than in the dry climates of the North West, the conclusion is necessarily arrived at, that practically, the autumn temperature on the plains of the Saskatchewan and Peace rivers is very nearly the same as in the valley of the St. Lawrence and the western parts of the maritime provinces. As a point of superiority in favour of the western prairies there rests the absence of those rains and those meetings which render our autumns so disagreeable and hard to be endured by cattle. Taking Dunvegan, the only place in the North West where regular observations have been made,—it is found that in 1880, the number of days on which rain fell, was as follows:\n\n| LOCALITIES     | September | October | November | Total |\n|----------------|-----------|---------|----------|-------|\n| Toronto        | 13        | 12      | 8        | 33    |\n| Cornwall       | 14        | 20      | 9        | 43    |\n| Montreal       | 17        | 17      | 8        | 42    |\n| Quebec         | 19        | 19      | 6        | 44    |\n| Halifax        | 15        | 11      | 10       | 36    |\n| St. John       | 13        | 10      | 11       | 34    |\n| Dunvegan       | 7         | 9       | 4        | 20    |\nIn 1883, there were at Dunvegan only 20 days on which rain fell. Now in this regard, Dunvegan represents not only the plains of Peace River, but also those of the Saskatchewan; which shows clearly that in the North West the autumn is much drier and infinitely finer than in the old provinces of the confederation.\n\nWe have given all these details upon each of the four astronomical seasons to permit the most complete comparison between the climate of the north west, and that of the best known and most forward countries. It remains now to study the agricultural season, that is to say, the six months during which the temperature and the state of the soil permit the labours of agriculture to be carried on, and especially the bearings of the temperature and of the atmosphere, upon the point of the ripening of grains and their harvest.\n\nThe agricultural season, that is to say the interval during which the land can be worked, is the six months from the 15th April to 15th October, except in the north east section and certain other portions where great bodies of water make the spring a little later. The five months of May, June, July, August and September show the following temperatures:\n\n| LOCALITIES | May | June | July | August | September | Mean |\n|------------|-----|------|------|--------|-----------|------|\n| Fort McLeod | 53.2 | 61.1 | 67.1 | 64.3   | 54.6      | 60.06|\n| Calgary     | 51.8 | 61.0 | 59.6 | 53.5   | 47.2      | 54.60|\n| Cumberland  | 51.3 | 64.3 | 71.2 | 61.4   | 46.3      | 58.90|\n| Pelly       | 51.5 | 59.2 | 67.2 | 60.1   | 48.3      | 57.30|\n| Carlton     | 45.0 | 59.9 | 64.5 | 65.6   | 46.0      | 56.20|\n| Battleford  | 56.9 | 59.1 | 65.0 | 68.2   | 46.9      | 58.02|\n| Fort Edmonton | 49.1 | 58.1 | 64.0 | 63.0   | 45.0      | 55.84|\n| Chipewyan   | 45.4 | 55.5 | 63.0 | 58.0   | 43.5      | 52.98|\n| Dunvegan    | 50.4 | 59.9 | 65.3 | 60.5   | 52.1      | 57.24|\n| Toronto     | 53.4 | 63.7 | 68.2 | 67.8   | 59.3      | 62.08|\n| Cornwall    | 55.5 | 66.6 | 70.4 | 68.3   | 58.6      | 63.88|\n| Montreal    | 58.6 | 67.5 | 70.9 | 69.2   | 58.7      | 64.98|\n| Quebec      | 50.4 | 62.3 | 67.0 | 65.1   | 57.3      | 60.42|\n| Halifax     | 46.4 | 56.7 | 62.8 | 63.3   | 56.5      | 57.14|\n| St. John    | 45.7 | 56.3 | 60.1 | 59.9   | 54.8      | 55.36|\n\nThis table shows that the temperature of these five months is very nearly the same in the North West as in the valley of the Saint Lawrence and the Maritime Provinces. But we have seen elsewhere, that by reason of the greater length of the days, the thermometric degrees being the same, the sum of the heat is much greater in the North West than in our old provinces, and thus practically and as regards vegetation, the temperature of the agricultural season is warmer and higher on the plains of the west than in the finest portions of the eastern provinces, where the days are shorter.\n\nThus, in the Saskatchewan region, and in the greater part of the Athabasca and Peace river countries, the temperature of the agricultural season is warm enough and high enough and to spare, to make wheat and all the cereals ripen perfectly. To ripen wheat perfectly requires a mean\ntemperature of from $62^\\circ$ to $65^\\circ$ for the months of July and August. Now, for these two months, we find for the different localities the following figures: Fort McLeod $65.7^\\circ$; Fort Pelly, $63.6^\\circ$; Norway House $62.3^\\circ$; Cumberland $66.3^\\circ$; Carlton $65.1^\\circ$; Battleford $66.6^\\circ$; Edmonton, $63.5^\\circ$; Dunvegan, $62.9^\\circ$, or $66.7^\\circ$ if we take the observations of the astronomer Thompson. Even at Fort Simpson, in Lat. $61^\\circ 51'$, or nearly 35 miles north of Dunvegan, the mean temperature for July and August is $63.3^\\circ$; and it is established by experiments that at this place four times out of five, wheat ripens perfectly. The temperature of our prairies is even high enough to allow of the cultivation of maize—which the climate in England renders impossible there—since the census of 1880 states that in that year 190 bushels of maize had been harvested at Qu'Appelle, 1567 bushels at Prince Albert, and 200 bushels at Edmonton. Professor Macoun states that maize comes also to perfection at Fort Vermillion on Battle River, in the Peace River country, at $58^\\circ$ of latitude. Cucumbers planted in the open air come also to maturity, which further proves the adaptability of this region to the cultivation of all cereals, since the cucumber is one of the plants most sensitive to cold.\n\nAs to wheat, the north limit of its culture follows a line starting a little to the south of Fort Simpson, situated in lat. $61^\\circ 57'$ and long. $121^\\circ 31'$, passes through Lake Athabasca, Ile à la Crosse Lake, and ends in the east of Lake Winnipeg, so that grain can be cultivated in a profitable manner in parts of our four great provisional districts of the North-West, which contain a superficial area of more than 275,000,000 acres. As this grain requires a temperature of $60^\\circ$ for the three summer months, it may very well be concluded that apart from places which are perhaps affected by some local circumstances, this summer temperature exists everywhere within the limit of the isothermal line which we have above indicated.\n\nThis fact reported and affirmed a long time ago by Sir John Richardson, an observer as judicious as worthy of credence, has been established by practical experience. Professor Macoun reports that he was informed by Mr. Hindley, the factor for several years in charge of the Mackenzie district, that at Fort Simpson, latitude $62^\\circ$ north, barley always ripened from the 10th to 20th August, that wheat succeeded four times out of five, that melons ripened well after having been first sown in a hotbed, that the frost rarely did any damage in summer, and that there was altogether heat enough to ripen any kind of grain no matter what. Monseigneur Taché states that wheat succeeds at Lake Athabasca and at Ile à la Crosse, and this is confirmed by Professor Macoun, who has been over all these localities. Oats, even which are more tender than wheat, are cultivated at Ile à la Crosse, and wheat succeeds at Fort McMurray, at the confluence of the Clearwater river with the Athabasca, at the mission of L'Etoile, 50 miles north of Fort Carlton, as well as at White Fish Lake, between Lake La Biche and Victoria, upon the Saskatchewan. At White Fish Lake, Dr. Dawson saw in 1880 a field of wheat belonging to the Revd. Mr. Staines, the Wesleyan Missionary, who had raised that year a mean of twenty-eight bushels to the acre of excellent wheat, although this field had been sown to wheat for fourteen consecutive years. As to the Saskatchewan region, it is known that, with rare exceptions due to local circumstances, it is everywhere most favourable for the cultivation of wheat, as well as other cereals; and this fact is superabundantly proved by the following statistics, extracted from the Census of 1881, showing the produc-\ntion of grain in the places where its cultivation in a regular manner has hardly been commenced:\n\n| Localities       | Wheat   | Barley | Oats   |\n|------------------|---------|--------|--------|\n| Qu'Appelle       | 3,820   | 2,202  | 4,600  |\n| Wood Mountain    | 300     | 50     | 253    |\n| Bow River        | 15,331  | 3,798  | 18,034 |\n| Battleford       | 3,246   | 4,219  | 3,108  |\n| Prince-Albert    | 61,641  | 17,260 | 18,269 |\n| Edmonton         | 22,000  | 2,500  | 12,600 |\n\nIn all these localities, the mean yield to the acre was nearly twenty one bushels, or three times more than in the Province of Quebec.\n\nThe facts settle in a peremptory manner the question of summer temperature, as far as regards agriculture. And yet, this temperature will undoubtedly grow still higher as the cultivation of the land proceeds, and then there will be heard no more of those rare summer frosts which sometimes happen in the North-West as in all other places where the absence of drainage and other like circumstances occasion at times an excess of radiation, not sufficient, however, to affect large areas of cultivation. In general, the country is exempt from hard frosts from the beginning of May to the middle of September, or four months and a half, and only in the latter part of September and in October are nocturnal frosts at times strong enough to injure the grains or the plants which have either been put in late or not well cared for. The same thing happens in all the old provinces of Canada.\n\nAs to the humidity of the atmosphere, it is everywhere sufficient to give to vegetation all the energy, all the development of which it is capable. This is proved by the vegetation itself which is most luxuriant as well as most abundant, and by the testimony of all explorers, especially Palliser and the surveyors in the employment of the Department of the Interior. \"During the summer months,\" says Captain Palliser: \"when the expedition was travelling the greater part of the time on the driest plains, or passed along the borders of the wooded country, rain and cloudy weather were of more frequent occurrence than we could have then expected.... On the higher plains which were crossed in 1858, from Carlton to the Rocky Mountains, the altitude of which plains varied from 2,000 to 3,500 feet, storms accompanied with thunder, were more rare, but a good quantity of rain fell. During the latter half of the month of June, in the Eagle Hills region, there were nine days of rain and cloudy weather, and six of clear weather. The mean of atmospheric humidity was 0.64, the point of saturation being 100. During the month of July, between the Grande Coulée, and the foot of the mountains, the proportion of fine weather was greater, with light and variable winds. However, there were during twelve days of this month, rainy clouds, with 0.59 for the mean of the humidity of the atmosphere. The radiation, as is natural to expect, is very considerable during the summer nights in the section north of the prairies, so much so that...\nwhen the weather is not cloudy, the quantity of dew which is produced, is considerable, in proportion to the degree of the humidity of the atmosphere.\n\nIt is owing to these dews and to the white frosts, that in September the rich grazing lands of the North Saskatchewan plains are preserved green and juicy until the snow comes, when the frost continues to preserve them as fresh and as nutritious as the cured hay, even until the return of spring.\n\nIn 1883, Messrs. Edgar and Fawsett, employed on the survey in the Saskatchewan country, kept a regular register of the state of the atmosphere from the beginning of May to the end of September. These observations apply to the district lying between the third initial meridian and the foot hills of the Rocky Mountains, from east to west, and between the fifth and tenth base lines from south to north; that is to say, the greater part of the South Saskatchewan country, which is considered the driest on these great plains.\n\nThe result of their observations makes it evident that there is in this country sufficient humidity for all the needs of vegetation, and that if the rains are never obstinate or of long duration, they are comparatively frequent enough. Below we give the notes of Mr. Edgar:\n| Date   | Commencing | Ending   | Observations                                                                 |\n|--------|------------|----------|------------------------------------------------------------------------------|\n| 5 May  | 7:30 p.m.  | 10:00 p.m.| Rain followed by a storm; snow during the night; there were 0.60 inches of snow on the morning of the 6th. |\n|        |            |          | Light showers during the whole day.                                           |\n| 14     |            |          | do do do                                                                      |\n| 16     | 1:30 p.m.  | 2:00 p.m.| Storm accompanied with thunder with slight showers during the afternoon.     |\n| 17     |            |          | Slight showers during the whole day.                                          |\n| 21     | 11:30 a.m. | 2:00 p.m.| Slight shower.                                                               |\n| 21     | 10:30 p.m. |          | Nearly all night, squalls of wind with a little rain.                         |\n| 26     | 12:30 a.m. | 1:00 p.m.| Light shower.                                                                |\n| 27     |            |          | Light showers in afternoon.                                                  |\n| 30     | 1:30 p.m.  | 2:30 p.m.| Light shower.                                                                |\n| 31     |            |          | Heavy showers in afternoon followed in the night by snow and hail, with squalls of wind. |\n| 3 June |            |          | Light showers in the afternoon.                                              |\n| 5      |            |          | Heavy storms in morning and afternoon with hail.                             |\n| 7      |            |          | Rain in afternoon.                                                           |\n| 8      |            |          | Light showers in afternoon.                                                  |\n| 10     |            |          | Rain during the whole day.                                                   |\n| 13     | 3:00 p.m.  | 4:00 p.m.| Rain and hail.                                                               |\n| 15     |            |          | Rain during night.                                                           |\n| 16     |            |          | Great storms accompanied with thunder during the day and night.              |\n| 17     |            |          | Storm in afternoon.                                                          |\n| 21     | 1:30 p.m.  | 5:00 p.m.| Stormy.                                                                      |\n| 25     | 2:00 p.m.  | 2:30 p.m.| Storm with hail.                                                             |\n| 2 July | 1:30 p.m.  | 3:30 p.m.| do do do                                                                     |\n| 5      | 3:30 p.m.  | 10:00 p.m.| Storms of rain.                                                              |\n| 11     | 1:30 p.m.  | 3:00 p.m.| do do do                                                                     |\n| 12     |            |          | Storm of rain in the afternoon.                                              |\n| 13     |            |          | do do do                                                                     |\n| 14     |            |          | do do do                                                                     |\n| 25     |            |          | Rain Storm in the morning.                                                   |\n| 4 August| 12:30 a.m.| 1:30 p.m.| Light shower.                                                               |\n| 8      |            |          | 3:30 p.m. Heavy rains.                                                       |\n| 17     | 5:00 p.m.  |          | Light showers.                                                               |\n| 18     |            |          | 10:00 a.m.                                                                    |\n| 20     |            |          | Slight showers in afternoon.                                                 |\n| 21     | 8:00 a.m.  | 9:30 a.m.| Great snow storm (near the mountains).                                       |\n| 30     | 5:00 p.m.  | 6:00 p.m.| Storm.                                                                      |\n| 4 October| 1:00 p.m.|          | Storm.                                                                       |\n| 5      |            |          | 7:00 a.m.                                                                     |\nOf the 153 days between the 5th May and the 5th October, there were 39 rainy or stormy, 11 in May, 14 in June, 8 in July, 1 in August, none in September, and 2 in October. It is easily seen that the rain fell in a way most favourable for vegetation.\n\nThe notes of Mr. Pawcett comprise 140 days from 15th May to 30th September, of which 47 were rainy. These are the notes:\n\n| Date | Begining | Ending | Observations |\n|------|----------|--------|--------------|\n| 15 May | 6.00 a.m. | 7.00 a.m. | Slight shower. |\n| 18 \" | | | Slight successive showers. |\n| 21 \" | | | Rains during the day. |\n| 25 \" | | | Frequent rain during day. |\n| 26 \" | | | Some shower. |\n| 27 \" | | | Heavy showers. |\n| 31 \" | 3.00 a.m. Night | | Showers of rain followed in the night by snow and hail. |\n| 4 June | | | Showers up afternoon. |\n| 5 \" | 7.00 a.m. | | Several small showers. |\n| 6 \" | | | A little rain all day. |\n| 7 \" | 5:30 p.m. | 10:30 p.m. | Showers. |\n| 9 \" | 6.00 a.m. | 11.00 a.m. | do |\n| 10 \" | 7.00 p.m. | | Rain all night and 1 |\n| 11 \" | Noon | | Rain until noon. |\n| 14 \" | | | Thunder. Storm during night. |\n| 15 \" | | | Shower early this morning. |\n| 16 \" | | | Some little showers. |\n| 17 \" | | | do do |\n| 21 \" | 9.30 a.m. Night | | Heavy rain. |\n| 22 \" | 5.00 a.m. | | Rain early this morning. |\n| 30 \" | | | Rain in the evening. |\n| 2 July | 5.00 a.m. | 8.00 a.m. | Shower this morning; raining still at 6 in the evening. |\n| 3 \" | | | Shower in morning. |\n| 5 \" | | | Rain during the night. |\n| 6 \" | 10.00 a.m. | | Rain this morning. |\n| 7 \" | | | Thunder. Storms during day. |\n| 12 \" | | | Frequent light showers during the day. |\n| 13 \" | | | Squalls of wind with rain during the night. |\n| 14 \" | 8.00 p.m. | | Rain all night. |\n| 15 \" | 10.00 a.m. | | Rain this morning. |\n| 16 \" | 10.00 p.m. | | Showers. |\n| 17 \" | 7.00 p.m. | 8.00 p.m. | Rain. |\n| 24 \" | 4.00 p.m. | 5.00 p.m. | Violent storm with thunder. |\n| 25 \" | 5.00 a.m. | 1.00 p.m. | Heavy rain. |\nDate  Beginning Ending Observations\n\n5 August  Rain during night.\n7  Shower (Heavy).\n9  Wind down.\n17  Rain all night.\n12  do in the morning.\n19  Showers during day.\n20  do\n30  Misty day.\n1 September  Rain in the afternoon.\n12  Rain during night.\n19  Rain this morning.\n\nThe crops, as far as I have been able to observe, between May 15th and September 30th, have been very good; 8 in May, 14 in June, 13 in July, 8 in August, and 4 in September. These facts show that conditions are generally favorable to vegetation and the crops are likely to be abundant. The weather has been agreeable and suitable for work in the open air. The crops are harvested in good condition and are likely to be abundant, a fact which is favorable to the greater part of the area covered by the Confederation.\n\nAs to the time of opening and closing of the agricultural season, the times following will show the following statements about what dates these took place:\n\nIt is known that the ice disappears upon the Sa katchewan towards the end of April, and has been seen in a permanent manner about the middle of November. This fact is confirmed by Parker and all those who have a personal knowledge and experience of the country. It is very nearly the same throughout the Peace River, as may be seen from the following notes, extracted from a journal kept by the Hudson Bay officers at Fort St. John:\n\n| Year | Beginning of ice | First ice |\n|------|-----------------|-----------|\n| 1866 | 19 April        | 7 November |\n| 1867 |                 |           |\n| 1868 |                 |           |\n| 1869 |                 |           |\n| 1870 |                 | Not registered |\n| 1871 |                 | 19 November |\n| 1872 |                 |           |\n| 1873 |                 |           |\n| 1874 |                 |           |\n| 1875 |                 | 31 October |\nAs Professor Macoun observes, these notes show that from the middle of April to the first week of November, the ground can be worked; that the winter is shorter in the Peace River country than in the Province of Manitoba, and that the Autumn temperature is warmer than at Winnipeg, 1200 miles south east of Edmonton. Firstly, the ice breaks up at least twelve days sooner on the North Saskatchewan and the Peace River than on the St. Lawrence starting from Quebec and going up it. Even at Montreal, ships and other boats do not ordinarily come off the river until the last week of August.\n\nIn the Peace River region, the seeding and harvesting are done very early. At Dunvegan, reports the surveyor Mr. Ogilvie, the crops were very fine both in quantity and quality. During my stay there (probably in September, 1863), the R. C. M. missionaries had just had their grain, of which I brought away some samples. Here is what had been harvested:\n\n- 50 pounds of wheat sowed the 16th April and reaped the 20th of August, had yielded 27 bushels of good very clear grain, 15 lbs. of hay, 15 bushels weighing at least 60 lbs. to the bushel. Mr. Macoun contends that the season was still more favorable for farming, moving to the east, and two degrees further north than Dunvegan. I confirmed by the field and the garden, and found that the growths, e.g., that barley and vegetables were much more advanced there than at Dunvegan or at Fort St. John. The wheat was in advance on the field, having been sown on the 6th August, and the earliest ears of wheat I found were nearly ripe (12th August, 1875).\n\nThe barley had been sown on the 24th May, and cut on the 6th August, having been in the ground exactly ninety days. The quality and the variety were the finest I have ever seen. There had been no frost since the beginning of May, and it was not expected there would be before the end of September. Throughout the season, there was little difference from the beginning of May to the end of October. The vegetation indicates that the climate is still warmer, as the Red River Canal, a tributary of the Peace River at Vermillion, already had a garden, regularly watered, advanced (12th August) Peace River country.\n\nWhile we were travelling there, our house was constantly warm, with a windless atmosphere and very mild, but quite cool. Even as late as the 15th October, the thermometer at day break registered 47°, and at noon, 61° in the shade. Among the hills, at the foot of the Rocky Mountains, I hiked on the 26th October, three weeks after the snow had melted. These facts and many others that could be cited show in a convincing manner that the autumn is fine and long, and the warmest tendency of the resident of the country clearly establishes that the growing season begins before the first of May. The season is also highly favorable for the growth of service berries (Amelanchier Canadensis) perfectly ripe.\n\nIn the Edmonton Region, work commences about the 15th of April, and in general, the wheat is sown in the latter half of that month and greatly for harvest about the 15th of August. The ground begins to freeze at the end of October, which does not prevent there being usually to six fine weather after this date. After saying this, it is not necessary to add that the climate\n\n---\n\n(1) Report of the Minister of the Interior for 1871, part II, page 77.\n(2) Geological Survey of Canada, 1875-6, p. 191.\nof Edmonton is favourable to the cultivation of all the grains, even of corn, of which a crop of a couple of hundred bushels was harvested in 1880. \"We have seen,\" says Dr. Selwyn, \"proved abundantly at Edmonton, Victoria, Fort Pitt and Prince Albert; the aptitude of the soil and climate to produce all kinds of cereals and vegetables which are elsewhere cultivated with success, even in conditions more favourable as regards latitude and altitude. It would be impossible to find in any part of the world whatever, barley, wheat, potatoes, turnips, carrots, onions and cabbage finer than those I saw harvested at Victoria, and the R. Catholic Mission of Prince Albert, near Edmonton.\" (1) Dr Selwyn saw all this in a tour of exploration from Fort Ellice to Rocky Mountain House, going by Carlton and Edmonton, and returning by Cumberland and the lower Saskatchewan, from the 6th August to the 16th October. \"During all the journey\" says he, \"we were favoured with remarkably fine weather. We were stopped by rain only one day in going, and half a day in returning. We had the first frost on the 4th September (at Victoria).\" This confirms the statement of Capt. Palliser,—that the work of harvest need not be interrupted in a serious manner by the three or four rainy days occurring ordinarily in September.\n\nThis fine season is earlier and warmer and longer also in the South Saskatchewan region and the Qu'Appelle. Professor Macoun has stated that at the Qu'Appelle Mission—the centre of a region comprising 16,000,000 acres of excellent wheat land—the harvest ripens earlier than in any other part whatever of the North West. In 1879 and 1880, barley was cut in the last week in July. There is never any summer frost in this region, and the spring is two weeks earlier than at Winnipeg. Indian corn succeeds perfectly. This fact has also been established by the expedition of Professor Hind, that of Palliser, and especially by the Census of 1881.\n\nIn 1884, the Pacific Railway Company in order to make a practical test of the soil and climate of the South Saskatchewan country, instituted ten experimental farms in the country extending west from Qu'Appelle to the foot hills of the Rocky Mountains, that is to say from 106° 25' to 113° long, from east to west, and between 50° and 51° of latitude, from south to north. These experiments most abundantly established that both the soil and the agricultural climate could not be more favourable for cultivation. Below we give the results of these experiments at each of the localities, which are stations on the railway.\n\n**SASKATCHEWAN.—** Land ploughed the 15th October, sown the 6th April, harvested the 1st September. Yield per acre: wheat, 22 bushels; oats, 33 bushels and a fraction; barley, 17½ bushels.\n\n**RUSSELL LAKE.—** Ploughed 16th October, sowing 16th April, harvest 1st September. Yield per acre: wheat, 22½ bushels; oats, 54 bushels; barley, 18 bushels.\n\n**SWIFT CURRENT.—** Ploughed 28th October, sowing 14th April, harvest 13th August for oats and 21st for wheat. Yield per acre: wheat 13½ bushels; oats, 36 bushels.\n\n**GULL LAKE.—** Ploughed 24th October, seeding 17th and 28th April and 15th May, harvest 18th August and 7th September. Yield per acre: wheat, 24 bushels; oats, 55 bushels; barley, 29 bushels; peas, 16½ bushels.\n\n**MAPLE CREEK.—** Ploughed 18th October, seeding 10th April, harvest 9th\n\n---\n\n1. Geological Survey of Canada, 1873-74, page 60.\nAugust for barley and oats and 19th for wheat. Yield per acre: wheat 22½ bushels; oats, 49½ bushels; barley, 30½ bushels; peas, 15½ bushels.\n\nFORBES—Ploughed, 27th October, sowing, 8th to 19th April, harvest, 11th and 20th August. Yield per acre: wheat, 30½ bushels; oats, 50 bushels, barley, 28 bushels, peas, 15½ bushels.\n\nDUNMORE—Ploughed, 24th October, put in seed 4th and 5th April; harvest, 23 July for barley, 6th August for oats and 7th for wheat. Yield per acre: wheat, 20 bushels; oats, 38½ bushels; barley 32½ bushels; peas, 10½ bushels.\n\nSTAIR—Ploughed, 18th October, sowing 3rd and 20th April, harvest, 25th July, for barley and 9th August for wheat and oats. Yield per acre: wheat, 19½ bushels; oats, 24½ bushels; barley, 15 bushels; peas, 12 bushels.\n\nTILLEY—Ploughed, 20th October, sowed, 2nd April, harvest, 18th August for barley and the 25th for wheat and oats. Yield per acre: wheat, 12 bushels; oats, 38½ bushels; barley, 14 bushels; peas, 10 bushels.\n\nGLEICHEN—Ploughed, 22nd October, sowed, 31st March and 22nd April; harvest of a part of the wheat and oats on 25th August, and of the rest, 9th September. Yield per acre: wheat, 28½ bushels; oats, 56½ bushels; peas, 13 bushels.\n\nThese facts establish on evidence that in this region, the agricultural season, that is to say, the interval during which the earth can be worked, is nearly six months and a half. It would be very exacting, certainly, to ask for more! Which are, in the north of Europe, the countries that have an agricultural season longer or even as long? When the fact is considered that in all this region, measuring 350 miles from east to west, the seed is sown in the middle of April as a mean time, the harvest take place in August, and work is carried on until the end of October, one would naturally ask, what of the nature of an agricultural climate could this magnificent country find to envy in the countries most favoured in this respect? The absence of rain at the season of harvest adds yet more to all these advantages, and gives to the climate of our plains a seal of incontestable superiority. And the yield of grain shows clearly that there is no lack of moisture, especially when the fact is taken into consideration that these experimental cultivations, made ab impromptu, were not accompanied with the care given to cultivation regularly organised beforehand.\n\nSuch are the principal characteristics of the climate of our rich, vast plains of the North West. The winters are apparently severe in some places; but the temperature and atmospheric conditions of the fine season, which lasts more than six months, are so favourable to cultivation and to comfort, so salubrious and so healthful; the air is so pure, so exhilarating, so stimulating, that there is hardly a land in the world, where life can be more agreeable, or man can lead an existence more active and more happy in all its aspects. Here the active and industrious man experiences a true pleasure in working the fertile soil which spontaneously offers him its astonishing riches, without exacting, as elsewhere, the tribute of a hard preparatory labour; the Author of creation has shed over it a profusion of beauties which elevate the soul, and inspire in a heart capable of feeling noble sentiments, the desire of contemplating this Heaven so pure and so calm, which gives only fertilising rains and never anything which can affect the happiness or health of man.\nINDEX\n\nCHAPTER I\nGENERAL VIEW\n\nThe plains of North America, 3—Part comprised in North West of Canada, 3—Boundaries and principal rivers, 3—Description of the prairies, 4—The four provisional districts, 5—Their extent, 5—Fertility of soil, 5—The two great steppes of the Saskatchewan plain, 6—Principal ranges of heights, 6—Plain of the Athabasca and Peace Rivers, 7—Prairies and Forests, 10—Origin of the prairies, 10—It does not proceed from aridity of soil, 10—Richness of the oil, 12—Coal in inexhaustible quantities, 12—Wood, 12—Advantages that the prairies offer to settlers, 13.\n\nCHAPTER II\nWOODS AND FORESTS\n\nFalse impressions, 13—Woods alternating with prairie, 13—Forest regions, 14—Forests easy to work, 14—Principal ligneous woods: maple, 14; elm and ash, 15; birch, 15; white cedar, 15; cypress, 15; red pine, 15; Pinus Lambertinus, 16; fir, 16; hemlock of the west, 16; red spruce, 17; black spruce, 17; white spruce, 17; poplar, 18—General considerations, 19—Forests of hard wood, 19—Mountain forests, 20—Saskatchewan region, 21—Easy working, 22—Athabasca and Peace River forests, 23—Richness of the forests of Battle and La Biche river, 25—Forests of the Edmonton Victoria, Carlton and Canadian regions, 27—Forests of the Upper Athabasca and Peace River, 29—General Recapitulation, 31.\n\nCHAPTER III\nMINERALOGICAL SKETCH\n\nGeneral remarks, 32—Building materials, 32—Sandstone, 32—Lime stone, 32—Brick, 3—Whet stones, 33—Plaster, 33—Marl, 34—Salt, 34—Petroleum, 34—Gold and Silver, 38—Iron ores, 39—Coal, 39—In Peace River region, 40—In the Athabasca region, 41—In the North Saskatchewan region, 42—In Battle River Valley, 43—In La Biche River Valley, 44—In the region of Bow and Big Belly rivers, 44—Inexhaustible quantities of coal, 46.\nCHAPTER IV\n\nCLIMATOLOGICAL SKETCH\n\nClimate superior to that of a part of Minnesota, 47—Warm winds from Pacific or chinooks, 48—Climate of region bordering the mountains, warmer, 49—Explanation of action of chinooks, 50—Influence of gulf stream on temperature of part of Europe, 51—Length of days ameliorates agricultural temperature, 52—Plains little elevated, 53—Recapitulation of causes ameliorating astronomical climate of the North West, 53—Thermometrical observations, 54—Comparison with some well-known European localities, 56—Characteristics of each season, 56—Winter, 57—Spring, 59—Summer, 62—Autumn, 65—Agricultural season, 68—Cultivation of wheat, 69—Humidity of atmosphere, sufficient for vegetation, 70—Date of work of cultivation in Peace river country, 74; in the Edmonton region, 75; in the South Saskatchewan and Qu'Appelle region, 76—General conclusions, 77.\nCANADIAN GOVERNMENT AGENCIES.\n\nALL persons desirous of obtaining information relating to Canada, can make application to the following Agents:\n\nIN THE UNITED KINGDOM.\n\nLONDON ........... SIR CHARLES TUPPER, K.C.M.G., &c., High Commissioner for the Dominion, 9 Victoria Chambers, London, S.W.\n\nMR. J. COLMER, Secretary, and MR. C. C. CHIPMAN, Assistant-Secretary, High Commissioner's Office, London.\n\nLIVERPOOL ....... MR. JOHN DYKE, 15 Water Street.\n\nGLASGOW .......... MR. THOMAS GRAHAM, 40 St. Enoch Square.\n\nBELFAST .......... MR. CHARLES FOX, 29 Victoria Place.\n\nDUBLIN ........... MR. THOMAS CONNOLLY, Northumberland House.\n\nBRISTOL .......... MR. J. W. DOWN, Bath Bridge.\n\nPARIS ............ SIR HECTOR FABER, 78 Boulevard Haussmann.\n\nCANADA.\n\nIN THE OLD PROVINCES.\n\nQUEBEC ........... MR. L. STAFFORD, Point Levis, Quebec.\n\nTORONTO .......... MR. J. A. LOWALDSON, Simcoe Avenue, Toronto.\n\nOTTAWA ........... MR. J. W. WILLIAMS, Wellington Street, Ottawa.\n\nMONTREAL .......... MR. J. J. DALEY, Bonaventure Street, Montreal.\n\nKINGSTON .......... MR. R. MACPHERSON, William Street, Kingston.\n\nHAMILTON .......... MR. JOHN SMITH, Great Western Railway Station, Hamilton.\n\nLONDON .......... MR. A. G. SMYTH, London, Ontario.\n\nHALIFAX .......... MR. E. CLAY, Halifax, Nova Scotia.\n\nST. JOHN .......... MR. S. GARDNER, St. John, New Brunswick.\n\nSHERBROOKE .......... COL. W. E. IRBETSON.\n\nIN MANITOBA AND THE NORTH-WEST.\n\nWINNIPEG .......... MR. W. C. B. GRAHAM, Winnipeg, Manitoba.\n\nEMERSON .......... MR. J. E. TEU, Railway Station, Emerson.\n\nBRANDON .......... MR. THOS. BENNETT, Office at the Railway Station.\n\nTRINQU'APPELLE .......... A. J. BAKER.\n\nCALGARY .......... J. Z. C. MIQUELON.\n\nPRINCE ARTHUR .......... MR. J. M. MCGOVERN.\n\nIN BRITISH COLUMBIA.\n\nVICTORIA .......... MR. JOHN JESSOP.\nOLD TOWERS THAT ADORN\nTHE LOWER RAMPARTS,\nON THE SITE OF THOSE\nTHAT DEFENDED THE CITY IN\n1759.\n\nTHE WALLS HAVE BEEN\nRENEWED, AND ARE NOW BEING\nRETURNED TO THEIR ORIGINAL\nFORMS, BY THE DOMINION\nGOVERNMENT.\n\nPart of the Lower Ramparts\nA VIEW AT QUEBEC\n\nBy H. R. H. the Prince of Leinster\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001661.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 90, "total-input-tokens": 125664, "total-output-tokens": 65714, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 267, 2], [267, 410, 3], [410, 410, 4], [410, 410, 5], [410, 410, 6], [410, 410, 7], [410, 677, 8], [677, 677, 9], [677, 3176, 10], [3176, 6896, 11], [6896, 10671, 12], [10671, 14429, 13], [14429, 18246, 14], [18246, 22128, 15], [22128, 25876, 16], [25876, 29516, 17], [29516, 33210, 18], [33210, 36923, 19], [36923, 40042, 20], [40042, 43748, 21], [43748, 47489, 22], [47489, 51226, 23], [51226, 55001, 24], [55001, 58820, 25], [58820, 62412, 26], [62412, 66073, 27], [66073, 69609, 28], [69609, 73255, 29], [73255, 76916, 30], [76916, 80508, 31], [80508, 84200, 32], [84200, 87842, 33], [87842, 91600, 34], [91600, 95294, 35], [95294, 99055, 36], [99055, 102601, 37], [102601, 106198, 38], [106198, 109346, 39], [109346, 113236, 40], [113236, 116910, 41], [116910, 120242, 42], [120242, 123976, 43], [123976, 127709, 44], [127709, 131470, 45], [131470, 135018, 46], [135018, 138590, 47], [138590, 142056, 48], [142056, 145692, 49], [145692, 149429, 50], [149429, 153155, 51], [153155, 156920, 52], [156920, 160567, 53], [160567, 163746, 54], [163746, 167480, 55], [167480, 171239, 56], [171239, 174678, 57], [174678, 178353, 58], [178353, 182089, 59], [182089, 184654, 60], [184654, 187535, 61], [187535, 190091, 62], [190091, 193062, 63], [193062, 196810, 64], [196810, 199620, 65], [199620, 202331, 66], [202331, 205820, 67], [205820, 207948, 68], [207948, 211557, 69], [211557, 214426, 70], [214426, 217080, 71], [217080, 220199, 72], [220199, 223086, 73], [223086, 225957, 74], [225957, 229129, 75], [229129, 232965, 76], [232965, 236014, 77], [236014, 237263, 78], [237263, 241871, 79], [241871, 243843, 80], [243843, 245702, 81], [245702, 249117, 82], [249117, 252548, 83], [252548, 255985, 84], [255985, 257736, 85], [257736, 258612, 86], [258612, 258612, 87], [258612, 260411, 88], [260411, 260697, 89], [260697, 260697, 90]], "primary_language": ["None", "en", "en", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, true, false, false, true, false, false, true, true, false, true, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]