[{"id": "4410e08bc3a480feb73a78acb92a6d91608fb65a", "text": "SKETCHES\n\nBY\n\nDOM PEDRO.\n\nDEDICATED TO THE VETERANS OF —85.\n\nHILL & WEBB, PRINTERS, 15 TEMPERANCE STREET.\nREMARKS.\n\nThe object of these sketches is from a desire to introduce a new feature of literary endeavor to the public, whose ample shoulders are already overburdened with stacks of works from the voluminous pens of amateur authors. Praying that this little work may not be the last straw to crush the exhausted public. It is therefore launched upon the sea of public opinion, hoping its frail bark may not be wamped by the breakers of unfair criticism, or the want of criticism. The incidents connected with these sketches are facts not in the least overdrawn. The aim is not alone to amuse at the expense of eccentric characters, but to point out the moral defects of the customs and institutions of the community in which we live—from no worse motives on the part of the author than patriotism, humanity, and the progress of enlightenment. So I fling myself into the maelstrom of popular demand.\n\nDom.\nCONTENTS.\n\nFun at the Seat of War ........................................... 7\nSchool War .......................................................... 15\nTemperance Reminiscences ......................................... 21\nThe Last Letter ..................................................... 28\nMY name is Nehemiah Jones. I followed the pursuit of peacemaker at the time of the North-West Rebellion, and was a good sized target for the ever ready Winchester of the ambushed half-breed or tufted Cree. Our regiment consisted of rifles, short swords, officers, hard tack, and military ardour, under the direct appointment of Our Lady the Queen, whose name bore a considerable resemblance to our own.\n\nAside from the stirring war scenes of that eventful period in our history, and the glory that will ever be emblazoned on the banners of the various corps that shot and shelled at and sometimes hurt the foes to the unity of our common country, I wish to tell of some of the incidents inseparable from camp life, which for the time being at least was ample compensation for the tedious marches—feet pinched and chafed by the square-built government shoes, specially designed for the chastening of man's soul, by wearing sections off his toes or heels during the long fatiguing march. Harnessed in belt, cross-belt, bullet pouch, heavy knapsack, including a haversack full of hard tack and salt with some bacon in it.\n\nNo matter how beautifully picturesque the scenery along the line of march was—and it might be said without exaggeration that the North-West Territories contain some of the grandest landscape views of any country in the world—that is on the surface. The long vista of rolling prairie like the heaving billows of the restless ocean; lakes both large and small scattered promiscuously over the great country. Here nature might have been more considerate by placing them in rows like the squares on a checker-board, so the railroads would not have to make such detours, and at so great an expense. So also the great winding rivers, accompanied by fringes of cottonwood and the dusky red man. Ranges of hills rising one above the other similar to packed thunder clouds, after a storm,\nand lost in the dim blue of the horizon and the setting sun. All this glory of river, lakes, stream, and panoramic landscape was more or less knocked out by the annoyances that flesh is heir to. No matter how the young volunteer or machine soldier may be filled with the ardent spirit of war and corn-beef. Marching through rain storms, snow storms, the biting north winds; ploughing through slush and mud; sleeping on the wet fertile soil, with nothing but knapsacks for pillows, and a few odd belts and pouches for counterpanes. Then the wearied patriots to be roused from their dreams—perhaps of spring mattresses and dry floors—half asleep and nearly scared to death at the yells of guard turn out when nothing but a prairie chicken or gopher rustled among the dried grass. These carnal effects are not an incentive for indulgence in landscape painting, in water colors, or any other kind. In addition to these, being obliged to bail out the tents with the government shoes before referred to.\n\nJust about that time the landscape view that would have given the most satisfaction to our boys, would have been a long stretch of prairie dotted with dead Indians and half-breeds in the most picturesque attitudes that the engines of war could make them, but it was not to be so. With the exception of Cut Knife, when we hadn't time to take a negative of the slaughtered red man on account of the dinner bell ringing at Battleford, our march was uneventful, excepting fatigue and the absence of the usages of the laundry.\n\nWhen the brigade, of which I was an important part (in my own estimation) as I often remarked to my fellow corporals that I could have finished up the campaign in half the time that those in command could, I cannot refrain from wondering why my name did not vibrate the whole nation, and parliament grant me a large bonus and knighthood for services rendered my country. It is mighty queer, yet quite true, that my surpassing military abilities were ignominously overlooked by an ungrateful government. As I was saying, the brigade for purposes of hygiene and eluding the massacre-affected half-breed, changed its quarters from time to time. We came across a deserted Indian camp. In their anxiety to show us hospitality, they left everything to our pleasure, including a tortoise-shell cat. Other living creatures were left, but the cat was the only thing we voluntarily accepted. The cat turned out to be quite a prize. It was the regimental cat of my corp. It marched when we marched, and retreated when we did, always marching with tail erect and swollen like a sausage at bay. A most singular thing about this cat was its haughty pride and exclusiveness. It would never condescend to walk with the rank and file. Nothing less than a sergeant would do our feline companion. Catacomb, the pride and joy of the regiment, used to march alongside of a sergeant with military precision, and when tired, climbed up the rear portion of a delighted non-com. to the knapsack. The pouch, haversack, water bottle, etc., offering numerous foot holds for the ascent, to the great amusement of the boys. Catacomb marched everywhere the regiment went, even if he had to do it part of the way on board of a knapsack.\nIt seems that when men are torn away from their families and friends and drafted to unknown and hostile regions, when perhaps tomorrow's sun may rise on their mutilated and bloody corpses, and suffer all the pangs of hellish butchery. They must have something to bestow their affections and ridicule upon. The present day's jokes and tricks crowd out all anticipations of the morrow.\n\nQuite a number in our corps kept pets of various kinds. Some crows, gophers, dogs, and other cats. It was no uncommon sight to see us fellows, after getting an order to suddenly march, and as suddenly snatching up our equipments in heavy marching order. One man with a crow or a gopher perched upon his knapsack. Another with a cat by the tail and a neighbor's dog trying to chew off its head; and the cat in its frantic efforts trying to tear the scalp of the dog and spitting furiously, would not infrequently lacerate the nether portion of its owner's trousers. Already showing marks of hasty and ill-considered repairs amidst the roars of glee of those marching in the rear.\n\nAnother prominent figure belonging to our particular and exclusive corps was a dog—a general pet. He always headed the regiment, and was held in as much respect as Colonel Slammer himself. He seemed to have all the responsibility of the glory in his proud and martial bearing. He was of Indian extraction (that is Indian dog), and went by the historic name of \"Big Bear,\" because he always kept ahead, and was a great favorite with the boys, anyone of whom would just as soon see one of themselves hurt as him.\n\nIn my capacity as orderly, I was obliged to break bread and hard tack in the same tent with half a dozen others, and go through all the tortures of despair and desperation. There were enough human fiends in our tent to cause the death of the deepest dyed criminal by the slow process of exasperation. I had to submit to the constant exactions of two or three crows and gophers. It was no joke for me to wake up in the middle of the night, with a yell and maybe other language, and find a gopher lying on the side of my head, with its tail in my ear. At the same time receive the well directed curses of my snoozing companions for breaking their hard-earned rest. The gopher slept at the other side of the tent for the balance of the night; he did not walk there either. The traces of that gopher created much anger in my breast. To reach the cupolo of human forbearance, the pet crows perched overhead were the means of destroying the tout ensemble of my brightly polished accoutrements. Here relentless revenge took possession of me, and seizing a frying pan, with one long incursive stroke I converted the pets into cold crow. My companions in arms, my chosen friends and mess-mates, ruthlessly dragged me out and requested me to say my prayers. Prayers! why, I knew as much about prayers as I did about Chinese. In consideration of my family I was spared; but was more or less looked upon as cold, cruel and heartless. I could have said that having been called out to defend my country against her enemies and against the disfigurement of her arms and\nuniforms, in the exercise of my duty I slew the crows. But I said nothing, and suffered in silence. Vindication came at last.\n\nCol. Slammer acquired several crows as pets for his own particular instruction. In the excess of their eccentricities they committed an offence that no well regulated crow should. So next morning an order came from the Colonel's own hand that every crow in the battalion was to be decapitated, and they were. The moral is, that a favorite does not know when he will be thrown on a cold world.\n\nSection B.\n\nAt last when the Revolution drew to a close, I received my promotion to the lofty dignity of sergeant. Long and faithful service to my Queen and colonel brought its own reward. I may say without the mantle of shame on my cheek, that the campaign would have had a longer ending without my presence. So regardless of contradiction I hereby put myself down as a veteran of the late N. W. Rebellion. The honor of sergeant was not conferred upon me so much for my valor, but on account of my sprinting ability when the bugle sounded a retreat.\n\nThe brigade in its various changes of base, frequently came in contact with friendly half-breeds and Indians. The regulations were, that in our intercourse with the neutrals, any foraging for purposes of plunder and loot was strictly prohibited under pain of severe punishment to offenders. So when the boys cast envious eyes on the fatted calf, chickens, geese or sheep, they had to conduct their depredations with the greatest secrecy and caution; and I must say, to the honor of our regiment, we were never caught.\n\nOne day while we were encamped in the vicinity of Battleford, we descried a fatted calf romping near the half-breed dwellings. Notwithstanding the consequences of our rash act, we conspired, planned and allied together to acquire that calf. The following night, after lights out, we made a bee-line for the quarters of the juvenile bovine, captured him, gagged him, one man twisting his tail, two more leading him by the ears, and a few more as body guard. We escorted our captive to a tent belonging to some of the troopers, tethered him, then broke away, each to seek his reposeful couch, to dream of veal cutlets, breaded, veal pie, etc., done up in the finest style that our chef du cuisine could manipulate. But alas! for human calculations, not one of us had a chew of that calf.\n\nThe next morning, before the rise of the sun, appeared above the distant hills a posse of half-breeds headed by a priest, whose\nEnglish issued indirectly from his passionate lips. In the name of the Pontiff and the Church he demanded back the calf, and accused our honorable body of surreptitiously enticing the calf to the abattoir. With swollen and purple visage, and corpulency heaving like the prow of a three-masted schooner in a heavy gale, voice hoarse with passion, Colonel Slammer asked the priest if we were a —— lot of thieves. Then pulled out his sword—slashed around. Nobody attempted to cross swords with him. The Col. made use of a vocabulary in connection with the half-breeds and Indians that would sound very unkempt in a pulpit.\n\nAn order was immediately given by the Col. to have every tent searched, and the whole staff turned out to do it. My position as a member of the calf expropriation committee appeared to have the semblance of peril, although we laughed and put on a look of injured innocence when the priest tendered his demand. But when the possibility of being found out permeated us, we seemed to feel a certain amount of degradation and guilt. My duty was plain. I sneaked off to the abode of the calf and told the boys what happened, and that Col. Slammer was going to search every tent. If a hundred ton gun had exploded in their midst, or if half a million Indians and half-breeds appeared, decked out in war paint, tomahawks, and Winchesters, a hundred yards away, they would not have showed half the consternation. As a sergeant I thought it best to leave just then and let the rest of them get out of the difficulty as well as they could. Though I was quite willing to share the veal, I was quite disposed to allow them the whole of the odium.\n\nHowever, the boys were equal to the occasion. While the staff were looking at one end of the camp, they ran the calf into the Colonel's tent at the other, then joined the searchers. As they drew nearer to the Colonel's quarters, the thin bawl of a calf was heard. The Colonel said, \"Now I will catch the scoundrel that stole the calf,\" and dived into the tent next his own, but the bawl wasn't there. A blank fell over the crowd as the calf was exposed to view in the Colonel's own tent. The scene beggared all description. The Colonel strode around, sword in hand, puffing like a traction engine, and he threatened to have every man in the regiment shot. Although the boys enjoyed the whole thing hugely, they stood around as solemn as owls. Suddenly the Colonel entered his tent, kicked out the calf, and then started to kick the priest and half-breeds in the same manner. We gladly joined-in, and in a very short space of time we fired the half-breeds, calf, priest and all into their own plantation; and didn't ask them how they liked it either. Thus ended a very embarrassing situation.\nSection C.\n\nIn this little history of the campaign there is no account of great battles where both sides leave heaps of dead and dying on the sauguirary field. So far as I know, what battle we did have was considerably one sided. Unfortunately for some it left houses of mourning.\n\nThe commissary department is an important factor in the subjugation of the enemy. In our brigade we kept a number of horned cattle. In order to get our hands in the way of gorey carnage, we passed the time away in slaughtering oxen, with their noses pinned to the ground. As anyone acquainted with the customs of military life knows that when a bullock is sacrificed, the choicest portions—such as the tenderloin, heart, liver etc.,—are set apart exclusively for the Staff, and to the rank and file go the shanks and the tougher parts of the beefy structure, and served up as beuf de bouillion, with potatoes, cabbage and barley trimmings. There can be no doubt of its being wholesome enough, as the boys thrived on it, and there were times when we would have been glad to look at a photograph of a chunk of fresh beef. But I reasoned that a sirloin steak was as palatable to me as to the commandment. Having been brought up on porterhouse steak and two cow's milk, I did not see why everybody could not have his turn at the choice morsels. Having democratic ideas of fair play, I believed our tent should have the first turn. So, being orderly sergeant, I confiscated the allowance designed for the staff officers, crammed it in my haversack and made for my tent. Here boys I said, take this meat and bury it for awhile; they did so, haversack and all. I hurried back to see to the distribution of the rest of the beef. When all had been given out, we found that the share for the staff was missing. I was the first to announce the fact. It soon reached headquarters that there was going to be no sirloin steak with parsley. The whole staff, including the commandant, severely cross-questioned everyone in sight as to the mysterious disappearance of their allowance. As no clear explanation could be given, a general search was inaugurated and I formed part of the searching party. It would have been a sad day for the culprit if apprehended. The recent and unsatisfactory rencontre with Poundmaker, put the Commandant in a mood to sacrifice his grandmother on the altar of discipline. I was quaking in my shoes for fear the absence of my haversack would be noticed. Though there was a very minute search made, no one ever thought of questioning me, the plunder was not found, but we did not resurrect it for three days after, for fear of detection. The weather being hot caused the meat to become high, but it all became incorporated with our gastronomy. It certainly would have come higher if we had been found out.\nSpeaking of the late Cut Knife sortie. Since returning to my paternal roof, I met quite a few acquaintances who watched the engagement from a point about two thousand miles away with a police force to look after them day and night, said that if they had been running the business up in the North-West, it would have just taken three days to clean out the whole region of Indians, Half-breeds, and gophers; and pointed out the fact, if we surrounded Poundmaker instead of Poundmaker surrounding us, how much more advantageous our position would have been. If these great military geniuses had only let us know before we started, what a lot of time and expense would have been saved the country. If we only had their experience how different the case would have been. All our abilities fitted us for was to charge on a ten acre field of statuary, and knock it all to pieces with the but ends of our guns.\n\nWhen we arrived at Winnipeg on the home stretch, we lost our beloved pet Catacomb—the tortoise shell cat, our loyal and true feline friend that stayed with us through the whole campaign. It was supposed that the unusual sight of a regimental cat, drew the attention of the city canines, and in a sportive way chewed Catacomb up into sausage meat. Anyway we lost our pet and shed some tears over the loss; we certainly spent a whole hour in Winnipeg searching for him. There was not a saloon in the place that we did not make enquiries, but without avail. Poor Catacomb! The name Catacomb was given, for the reason that he was found beneath the ruins of the tepees of the Indian camp.\n\nSection D.\n\nWe are rolling homeward bound on board a C. P. R. train, to make connection with the Campana at Port Arthur. The Campana was a steamship rival of the C. P. R. boats. Though there was no impediments on the tracts, nor any want of fuel on the tender of the engine nor any heavy grades, but somehow or other the train got there an hour behind time, when the Campana was far out to sea. The only reason that could be assigned for the delay, was that the engineer and fireman were having a quiet game of poker, and did not want to go too fast for fear of disturbing the cards.\n\nWe are obliged to stay over for another day and pitch our tents for breakfast. We are not over clean, and a good bath and about two pounds of mottled soap for each man would be a blessing in disguise.\n\nA strange incident occurred during the progress of breakfast. The cook of our company had a barrel of water carried from a distance of two miles, for culinary purposes, and when about to make\nuse of some water for the coffee or tea, he found a half dozen of\nthe boys taking a swim in the barrel. There was one man in the\nbarrel up to his neck, and the rest on the outside splashing them-\nselv s over for all the world like a flock of ducks or gese around a\npan of water, with one floating around inside. It was a great sight\nto see them running around the barrel like a lot of sprites, the cook\nafter them with a frying pan in one hand and a griddle in the other,\ntrying to brain them all. It is not known what the cook used to\nmake the beverage with. At any rate, after the boys got through\nwith the barrel of water, it would easily have passed for coffee.\n\nWe finally embarked, and in due time reached Owen Sound,\nand met an anxious deputation of patriots from Toronto, who did\nthe honors all the way down—for the party. As they did not have\nto carry knapsacks and firearms, it came easy. Down Yonge Street\nto the City Hall we march—through the seething populace—under\ntriumphal arches, amid the thunder of huzzas. Dusty—of Ethiop-\nian complexion and ragged as scarecrows. We are nearly played\nout and jambed to death before we are released to go to our various\nrendezvous to fight our battles all over again. In twenty-four hours\nall is tranquil. The same citizen that shouted the loudest for the\nglory of our victories and of our country, was the first to be on\nhand next morning to buy our script at two hundred and fifty dol-\nlars discount. As the land grants in the North-West would cost\nmore than the script would amount to locating them, we sold to the\nhighest bidder, which somehow did not seem to fill the bill.\n\nI have made up my mind to mention to the government that\nwhen we go out shooting half-breeds again, to either give us a\ndecent bonus in cash, without discount, or cut up some of the gov-\nernment property lying around home, where we can either sell to\ngood advantage, or build a home near where we do our business.\nWe are hereby resolved to strike for better terms—that is, we the\nrank and file. I as a sergeant believe my life to be as precious as\nthe highest commander in the militia, and I don’t care about being\na prey to bullets and rapacious script speculators without proper\ncompensation and recognition.\n\nN. J.\nSCHOOL WAR.\n\nABOUT the close of the American war, and from what the historian knows to the contrary, this warfare might have occurred simultaneously with the great American rebellion, or prior to it, at any rate the particular struggle took place shortly after or upon the close of the rebellion referred to. But this great war was a Canadian one, and a Torontonian one in particular. As the oldest inhabitant doubtless knows as well, the second oldest inhabitant is certain to know. The Model and Grammar Schools used to be rivals for educational supremacy, except the University in Toronto at that time. The Model School represented all that was exclusive and aristocratic, while the Grammar School upheld the principles of democracy as well as they understood it, and it might be said with truth that their understanding of it was somewhat limited.\n\nThe Model School as well as the Normal are enclosed within the same grounds. From the appearance of the fence surrounding the two institutions it would appear to the casual observer that the Model and Normal Schools were erected in the midst of the primeval forest, when timber was plentiful and labor cheap, the authorities built a fence around both schools on a very simple and primitive plan, simply laying square timber on the top of the newly created stumps, and then hewed to the proportions of the dorsal exterior of a much exaggerated sea serpent, massive, impenetrable and everlasting. But there was one source of amusement and exhilaration to the scholars of the Model School in the older time, were the merry-go-round and the gymnastical apparatus, secluded in a large driving shed, extending from Church Street in a westerly direction to the steps of the boys' entrance of the Model School. The great points of difference between the Model and Grammar School are not as one at first sight might be led to believe, that the subject of grammar was entirely excluded.\nin the former, and entirely monopolized in the latter; it is believed by those acquainted with the working of these schools that grammar was not entirely neglected in either of them, but the obvious distinction was that the pupils of the Model were sons and daughters of well-to-do citizens, whose sole aim was to educate their sons into the belief that theirs was not a common lot, and that if they could not trace any blue blood very far back they were to acquire it as quickly as possible, and as it would be an uncertain speculation to point with pride at a long line of ancestors distinguished for everything great, they were to cultivate their genealogical tree from posterity. Hence, no doubt, arose the bitterness displayed towards the plebian grammar school boys, whose ancestors in the male line instead of driving a baker's waggon, or milk waggon, either directed a coal cart, or assisted to pilot the eccentric motions of a push-cart. Another cause for contempt, unfavorable to the Grammarites, was that they were more or less the sons of struggling parents, where every dollar was acquired by hard working parents, who had to deny themselves of many a luxury, or even necessity to enable their boys to get a solid education, to hold their own with the rough usages of the world—perhaps many a mother has pointed out with pardonable pride at the successes her boy has achieved in education and business through her untiring efforts, patient endurance, and self-sacrifices for his sake, future comfort and prosperity. Whether the priceless acquisition of a good education, where every stone in its construction was the mental anxiety and daily earnings of conscientious parents, whose care and expense were lightened by the expectation of all the advantages that accrue from a thorough education. Whether or not the recipients of all these benefits, the basis of which was daily struggling and scraping economy, ever fully repaid these great obligations, or could do so is a question best left to those who were most benefitted by them. Whether they did or not, many of the scholars that attended the Grammar School have reaped both wealth and prominence in the various departments of life, and still do so.\n\nThe Grammar School of that day was situated a few yards above Gould Street, on the east side of Dalhousie Street. Where once it stood now stands a livery stable of something of the same dimensions, but built of brick. The school was built of wood, probably what was left of the Normal School fence, and was painted brown, one story in height, with a spear-head sort of cupula, where the bell swung to and fro. The tout ensemble suggested the appearance of a brown setting-hen with her wings spread out, having an \"At Home\" in connection with her chickens. The play-ground consisted chiefly of the length and breadth of Dalhousie Street, and what other adjacent thoroughfare that might have been required.\n\nThe date of this conflict between the two schools has never been properly chronicled except that there were several feet of snow on the ground sufficiently moistened by a gentle thaw for purposes of\ncarnage. It was at the hour of noon, the Model School boys issued forth from their grounds in battle array, every boy with about ten rounds of vicious looking snow-balls, marching down Church Street in a solid phalanx, and when arriving within a few yards of the corner of Gould, made a charge on the foe around on Gould Street, who were in ambush and ready, then snow-balls began to fly in all directions. A volley from the Modelites in the direction of the Grammarites went whizzing through the air, some to spend their forces on the adjoining houses and window-panes whose resistance was seldom as great as the force; some spending their force on the mouth of an unsuspecting pedestrian turning a corner; but very few struck the agile Grammarites who suddenly made a sortie on their foes, and sent in hot shots by the hundreds into the ranks of the Modelites who wavered under the murderous fire now broke into confusion and disorder, and ignominously retreated up Church Street, the cheering and victorious Grammarites in close pursuit; but as soon as the Modelites got as far as their own stronghold they made a stand and formed into column, then the real battle of the day began, snow-balls hurtled through the air at various ranges, many an ear tingled. The little girls stood on the doorsteps awe-stricken and otherwise stricken if they did not get out of the way. The peaceful inhabitants of the dwellings adjoining the old battle-ground looked on with mingled approval and inelegant language as stray shots would spang against the front door or hit a head if incautiously put out of the window. A strong detachment of veterans wearing the model colors, headed by an intrepid young general who tried to turn the right flank of the grammar legions, but were repulsed with great slaughter, and the Hector received the \"Legion of Honor\" for his brilliant manoeuvre in the shape of a wet ungainly snowball somewhere in the neighborhood of his left ear and right eye-brow which caused him to retire to the top of the wooden pallisades of the Normal School the envy of would-be aspirants of military honors and followed by the admiring glances of the crowds of little boys and girls who were variously concealed behind porch doors and picket fences intently watching the fray.\n\nStanding behind the sheltering wooden walls of the Normal on the north side of Gould, near the corner was a squad of men of very early years, thinking they were the reserve of the model army, and when the snow battle waged fiercely and the decisive moment of the day hung in the balance, a Grammarite youth who kept an eagle eye in all directions for a possible surprise, made a dash upon the enemy as he supposed, and with no other help than his own trusty snow-ball commanded them to surrender. The squad consisted of a couple of dozen fighting men, armed with big woolen mittens, long woolen scarfs and caps with ear flaps; averaging about three feet in height, they explained as well as their six or seven years would allow them, that they were neutral and their sympathies went to the best men, and that they belonged to the Victoria Street school around the next corner. But no amount of explanation would\nsatisfy the obdurate young Grammarite but immediate and unconditional surrender, which was as quickly complied with, and if they would not take part in the fight to the damage of the Grammarites they would be allowed to roam on parole. This magnanimous offer the Victorias gratefully accepted. The daring Grammarite who made this important capture has since achieved renown and promotion in the military annals of our country, and valiantly pushed himself up step by step to a place of some eminence in one of our institutions of learning inseparably connected with the old Grammar School.\n\nBut the battle still goes on. The icy snow-balls cause distorted exclamations to issue from those who run counter to them. The stubborn forces seem equally determined to exterminate each other before they will yield. But suddenly both sides waver—and retreat precipitately—even the Victorias are seized with an unaccountable panic, and flee without looking behind. What is the cause of this frenzy and alarm? It must be the ringing of the school bells the signal of the close of the noon hour. That is just what it is. The Victorias having further to go and being detained as prisoners of war do not reach their cantonment at the regulation minute. Nevertheless they have the Victoria cross conferred on them, but to them the honor was fraught with pain and applied externally. Some historians might say it was a drawn battle, and again some writers hold that the Modelites were defeated as they were driven under the shelter of their fort walls, but more accurate chroniclers say it was a Bull's Run. But the neighboring dwellers hotly aver that they don't care what it was so far as they were concerned if both sides had completely exterminated each other with the deadliest missiles of war they would have been the winners. It might have been cause for gratification and martial valor among the schools, but horribly rough on the street traffic and the aforementioned dwellers who looked upon these feats of arms as a peace destroyer and a nuisance generally.\n\nThe Model School of twenty years ago is the Model School of today, with several brick additions to its Church Street facade. The old time merry-go-rounds and the gymnasium, its long driving shed and lodge at the gate now belong to the past, the same old wooden bulwarks encircle its spacious lawn where the football, cricket ball, and recently the vulgar base-ball have each in turn been kicked and pounded by the sportive youth. The Normal School is little changed externally. The same picturesque architecture, its front facing Bond Street, set some distance back in a well kept lawn, flower beds, hedge rows flanking each side amidst umbrageous foliage and gleaming statuary. Art and science in a high state of cultivation ornament its interior departments and are a medium of considerable instruction to the visitor; its outer walls are a continuation of the wooden bulwarks around the Model School.\n\nThe old Grammar School, with the low-roof and brown exterior in the interest of science and art, has been obliterated from the\nface of the earth, and its timbers converted into kindling wood, or helped to gird up the tottering frame of the neighboring cow stable or equestrian habitation, a long time back. But like the phoenix it rose up again out of its own ashes, but the ashes were blown over on the east side of Jarvis Street, next to St. Andrew's Church, which occupies the sou-east corner of Carleton and Jarvis. There to rise again into a fine brick edifice of modern architecture, with limited play-grounds on either side, braced up in the rear by the Horticultural Gardens, and the handwriting on the wall says, to all it may concern, \"The Collegiate Institute.\"\n\nHere in the rejuvenated Grammar School any young person of either sex may acquire an education that will fit him in any walk of life, except such useless occupation as raising cereals or stabbing weeds amongst various kinds of marketable vegetation, or driving a locomotive, or any such vocation of muscular humanity. All one needs is to purchase a moderately sized library and pay of a certain amount, not so much for its current value as a guarantee of keeping up the established rules of the institution, and for other purposes not here mentioned. The Collegiate Institute being surrounded by all the indications of wealth and fashion, and an asphalt pavement can hold up its head now even higher than its sometime rival—the Model. The haughtiest and most disdainful aristocrat is the one that was cradled in the lap of ignorance and rose from a pedestal of mud.\n\nIf one of the Model boys, of twenty years ago, whose patriotic career in the civil service unfitted him for anything except a pension, or perhaps whose circle of thought and action were confined to the intricacies and terribly superfluous legal technicalities of professional law, or whose manhood was sapped in the close atmosphere of business life, were to sit on the substantial superstructure of the Model School fence, and watch the boys going through their evolutions with military precision, and admiring the perfect subordination to keep line, carrying wooden guns, wooden swords, and wooden heads, but of course the latter was an unexpressed thought and might properly be eliminated from the description. The spectator would reasonably hope that if ever his country called upon her sons for her honor and protection, that the greatest physical harm that would befall mankind would come from those wooden guns and swords.\n\nThe man on the fence would probably say that the mental endowment military exercise and games are both ornamental and useful, but are they adequate to supply the full compliment of moral and mental stamina—to the rising generation—they are taught the cream of artificial education, to occupy the mansard roof of structural civilization when there is more room for mental as well as physical development in the lower stories right down to the foundation in productive labor. The greatest opponents to labor in the mechanical departments, have been turned out of the Model Schools, from time immemorial, from no other cause than ignorance of the utility of industrial education; for without contact\nwith labor of the physical kind, how can sympathy be expected for the laboring millions, whose pulse can beat in unison with the struggling masses and never handle a pick-axe, a shovel, saw, or an iron lever.\n\nSomething of the same thought runs through the mind of the old Model boy, as the elastic youths march and counter-march over the well mowed lawn. If the Model School boys were formed into fours with wooden guns at the trail, and marched out a few miles into the rural districts two or three times a year and pile arms and file into the mysteries of human existence with the hoe way laying weeds in the rows of potatoes and corn, beans, cabbages, etc., perspire a few days under a blazing sun, loading hay and grain turning over the mellow earth with the plow and acquiring the rudiments of agriculture and the raising of stock; not only would the physical exuberance of the boys find ample scope, but their mental, moral and physical condition would be brought into its fullest perfection; and agriculture looked beforeupon with quiet scorn, would be elevated in proportion to the enlightenment of those that undertake to solve its scientific problems and its great necessity to man and the nation. But it is very uncertain, if the old time Model boy did think that way at all, in fact, unless proof is forthcoming to place the question beyond a doubt, the belief will be prevalent that it was only a dream. A haughty Institute Collegian just passing along with his face averted will bring the hated rivals in perfect accord on that question.\nTEMPERANCE REMINISCENCE.\n\nNot many miles from the centre of a metropolis whose enterprise is a household word far and near, and whose antiquated notions of civic government is no less celebrated, in a northeasterly direction from the city's throbbing centre, there is an ancient highway commanding a fine view of the many steeples and public buildings of the town. The gleam of the marble columns and other sculptured effects that crest the tenements of a race passed away, whose grave-stones seem to stand up in mute protest at the way the time-honored stream, the Don has been tampered with. There from their point of vantage could be seen the graceful curves of the river bending now under the brow of some sand swept hill, and again lost to sight in some natural meadow where the whispering willows bend their suppliant boughs. Alas where are the picturesque banks that once adorned these pellucid waters that flowed into the uncertain elements of Toronto and Ashbridge bays! Those rustic bridges, with their loose abutments—all gone—all swept away—sometimes by the enraged river at the vandalism and enterprise of the times. The meandering roadway that descends under the ruffled brow of the city of the dead till the wooden bridge is reached that spans the placid river. It may not be out of place here to say that this bridge is not at all picturesque, but the view from this point northward is perfectly charming; the stream pursuing its serpentine way now north, now west, and again east, through a wide expanse of valley with enough trees to give it a park-like appearance. Its hill-sides covered thickly with timber, and in the distance other hills rising above these give it a gorgeous panorama-like appearance. Crossing the rude bridge, hear again is a sad sight, where once this rural pathway pursued the even tenor of its way; is now thrust aside like some ambitious aspirant for civic honors whose honest but unappreciated ideas were turned away, and to fall by the tide of popular approbation. Is there nothing held sacred or inviolate from the spoilage of this bold faced despot that blocks up a traditional highway and putting the most\ncherished wishes of the wayfarers and custodians of the turnpike at defiance and to inconvenience without so much as asking leave. But believing man is but grass they trample it as much as they think fit. It is a sorry confession to make but there is much grass within the gates of Toronto.\n\nAfter seeking a hole in the railway embankment, which it was the gracious permission of the Company to allow us the pastime of hunting for it, the traveller again finds the pathway from which he was forced to wander. Up the winding grade; through the mud; under the umbrageous pine boughs, skirted by high hills, having much the appearance of an uninhabited region, wild and unbroken, and, but for looking backward now and then at the signs of human habitation, it is hard to believe it not somewhere around Hudson Bay; yet it is still within the city's bounds. The quiet and hush of the evening does not render the road less perilous by reason of a gulley that occupies the left side of the roadway for a considerable length up the hill. Here and there are finger posts—with the fingers knocked off—as the road ascends; but they would avail but little on a dark night if the tired beast and his burden by some mischance wandered forth from the beaten path, the number of mourners would correspond with the number of his relations. The top of the hill is reached, and that part of \"ye ancient Mill Road,\" called Winchester Hill, left behind. At this point are the north-eastern gates of the city: and lo! this must be some holy day at the city's temple, for there are no sentinels to be seen as far as the eye can reach. Along the Don Mills Road the mud bespattered wanderer wends his way through the oceans of mud and surface water—through the prettily-situated village of Doncaster on the east bank of the Don, with its hoary post-office. The fine elevation; pleasing views of the surrounding country. It looks so peaceful and quiet with its diversity of dwellings and its quiet little church ensconced among the fir trees;—fitting place for the soul's communion.\n\nBut alas for the enterprise of this place—the lanes, bye-ways and highways are begirt with mud—to cross the road anywhere to salute your best friend, or on a mission of mercy or charity, is fraught with much hidden under-currents of mud. However, even the muddiest locality has some dry spot, at least so thought the writer, as standing by the front window in the bar-room of the popular hostelry of Todmorden, overlooking the Don valley and the tall chimney of the factory that converts wearing apparel into paper bags, etc. The horses and vehicles passing or stopping for water for the horses and other drink for the drivers, seemed to be all of one color—muddy. No wonder the bar is filled with men, and every man more or less fill up with the prevailing beverage. The only oasis of recreation in the wilderness of mud is the bar-room. There can be found a good blazing fire; pictures of battles hung on the wall; various brands of liquors ranged regularly on the walls; plenty of beer in the cellar—it was a tie which was most in demand, hot whiskey or beer, but beer seemed to have the call. What are those mysterious whisperings at the little door behind\nthe bar—every now and then a hand thrust out with a basket containing a can, or a jug, or a bottle as the case may be—sometimes a little boy would come in front of the bar to purchase hardware no doubt—at any rate it was carried away in water-tight vessels.\n\nA fitting school to bring up young children, where the object lesson is a glass of beer or hot whiskey, somehow mixed up with a lot of men of mixed politics, tobacco smoke, profanity and tobacco juice, and a few free fights. However, the ale is good, and with a foaming tankard balanced in hand, enter into a confidential discourse with one of the local inhabitants who has seen better days, and in all probability will see worse. In a very serious voice and a glass of beer a foot long gradually moving towards his mouth, and a breath like the far off aroma of Ashbridge Bay, said that Frank ________, a neighbor, would hurt himself if he did not quit drinking. \"Now Johnny, I tell you it will hurt him if he does not quit.\" By way of emphasis he took a taste of beer from the glass in his hand—nothing but the glass remained. Still saying Frank would hurt himself, he unsteadily absorbed another schooner. It can be seen here that temperance men may consistently sample a large quantity of raw liquors, and yet be guiding instruments for keeping men out of drunkards' graves—if they would only spend their money with this temperance lecturer instead of frittering it away amongst strangers.\nDEER PARK is probably familiar with pretty nearly everyone in Toronto. The origin of the name \"Deer Park\" is generally understood to mean that portion of the Township of York set apart for the exclusive use of the noble animal—deer. Any insinuation that said Park had been largely devoted for the sustenance and development of numerous milch cows and horses, of all degrees of spavin and ringbone, and flocks of geese that used to wander over the park in perfect abandon of intention and carry on animated arguments peculiar to that bird; and also a favorite camping ground for the picturesque tinker who carried on a lucrative trade in soldering tinware and trading horses with the inhabitants would call down the just resentment of the select people whose palatial residences occupy its beautiful sites at the present time. The few people left in the place not having any social position to speak of say that as far back as two generations they never saw anything in the shape of deer there except those driven by a barefooted boy, or several of them, with horns and udder resembling that patient and useful animal which supplies man with a liquid alleged to be milk, but often falls far short of it. Certain other quadrupeds having a tendency to run to nose with tail artistically curled, frisking joyfully o'er the turf and, unlike well regulated deer, instead of cropping the tender herbage, must dig into the ground with its nose in search of roots, at the same time making use of a guttural language in sound similar to a large section of the human race. Be that as it may, it is still muttered that the name Deer Park is derived from the high price of land in its precincts which seems to be somewhat borne out in fact.\nBetween Sellers' Hotel (now O'Halloran's), on Yonge Street—Dick Lee's hostelry a little further up on the right—Hughey, the subject of this sketch, used to circulate. Hughey was apparently born in the neighborhood, for he was never known to be absent from either of these hallowed inns, which time and oft have echoed revelry by night not particularly choice either as the chief ingredient of the amusements of the time was low-grade whiskey. Hughey and whiskey were constant companions. If it rained Hughey philosophically resigned himself to sure-death-whiskey to prevent him from catching cold. For the same reason he would absorb gallons of the elixir when it was hot or cold, or when the dew was very heavy. Hughey's passion for the red beverage was not more animated than the beverage for him. Such sublime constancy, such fellowship it may have been equalled but never excelled. It was Hughey's food, sleep and drink. He was never happy away from it. If he worked a few days in the brick-yard, or broke stones on the roadside, his first act on getting his wages was to fill up with his beloved elixir. His best friends could never prevail on him to part from his cherished companion; but as a matter of fact his friends never tried—at least Hughey never remembered it, as his regard for G. and W. Whiskey drowned out all other thoughts in his social courtesies. Even the genial host of the Deer Park Arms (now do more) often tried to persuade Hughey to break away from his boon companion, and as often failed in his humane admonition (while giving Hughey his rye, composed of equal proportions of strychnine, benzine, brimstone and whiskey)—of such was whiskey made of in the good old days—at any rate it seemed so to the uninitiated. Hughey sometimes labored at hostlering and took it out in trade, when he would then get a specialty in whiskey that would take the breath away and paralyze the brain of an ordinary man, but it was Hughey's delight. The reader may be curious to know what style of man Hughey was, thinking, perhaps, he was a man of colossal physique and of kingly bearing, considerably degenerated; a hero whose slumbering virtues were never by destiny and the vicious surroundings of his life brought into play. It was not at all the case. Hughey was a little stunted mannikin, who seemed to have been born too young; a scrubby chin, an expansive upper lip, with a nasal twang in his voice, and of Irish extraction. Such was Hughey's natural make-up. As to clothes, the principal garment seemed to be a big pair of top boots, with ears overhanging like a beagle's; an old coat reaching down to his heels and a slouch hat made up his outfit; also a nose of sufficient brilliancy to light his way on the darkest night. The oldest inhabitant of Deer Park never knew Hughey to shed his raiment. In a word Hughey could hold more whiskey of any brand (but in those days, and in many places now, the only brand was sure-death or forty-rod) than any ten men of twice his size who were no slouches at the business, in the neighborhood of Deer Park or the Deer Park Arms, where many a barrel of whiskey got incorporated with its devotees, and could knock them all out—and did, before they could knock each other out. Those were glorious days—where, in its balmyest days, Deer Park had its nightly ruction and danced\nthe unstudied can-can with beer and whiskey and fiddle accompaniment, but now totally effaced—such was the early aristocracy of Deer Park. During all its vicissitudes, its joys and free fights, Hughey managed to pour large consignments of fiery red whiskey into his system and suffered none to interfere with his regular diet.\n\nHughey's loyalty to his early friend and fellow traveller, whiskey straight, may be illustrated by the following incident in our hero's career. The scene is laid in the neighborhood of Moore Park Aqueduct, on this side of the gully—now designated as \"The Vale of Avoca,\" close behind the palatial mansion of the late Paddy Shields, late of Her Majesty's regiment afoot—then on the pension list, but now gone to his benefactors. His mansion has also departed, to make way for a new school house. The arch enemy of the people thereabouts at that time, of whom Paddy was much superior in the way of education, because he could read a little anyway. However, it was on a Sunday morning, somewhere in the early seventies—James a nephew of Hughey—whose appropriate and general name was Yallow Jimmy—Jimmy was playing tag with another boy of his own age on the hillside, when there suddenly emerged from the rear portals of Paddy Shield's mansion, Hughey, who came cantering up the hill towards the boys, and taking Yallow Jimmy aside, asked him if he would go over as far as Donald Sellers and get him fifteen cents worth of whiskey, at the same time producing a small flask, and promising Jimmy he'd do as much for him some time, and other persuasive blandishments, thereupon Jimmy consented to go, and urged to make unusual haste, as Hughey diplomatically put it, he hadn't a drop since the night before, and thirst was a word entirely inadequate to express his desire for an eye opener. Off Jimmy scouted, and in a very short time returned with a well filled flask, giving it to Hughey, who started off to the protection of a sheltered spot to take his usual breakfast, and Jimmy and his companion hurried off in another direction. Jimmy suggested climbing a small pine tree, which was done forthwith. Meanwhile Jimmy explained a little trick he played on Hughey. Instead of buying the whiskey, Jimmy just went inside of the tavern door and out, then went to the pump and filled the flask with water. Thinking Hughey would be watching him, which Hughey certainly did, he only made a pretence in going in the door. So from their point of vantage they watched Hughey behind a snake rail fence lift up the flask and take a long pull, throw down the watered stock, gave a yell and started in a bee line, with his coat tails flying in the December breeze, towards the spot where the boys were hiding, swearing in every color of the rainbow. Jimmy nearly fell out of the tree laughing, and indeed the whole thing was a perfect comedy. Something seemed to draw Hughey to the tree, and spying the boys, he offered to kill Jimmy in any style he would choose; and it was a mean trick to play on a decent man, on a Sunday too. Jimmy offered to come down with the money if he (Hughey) would grant him immunity from corporeal unpleasantness. Hughey accepted the conditions if he would hurry, as he never suffered so severe a disappointment in his life.\nbefore in taking a drink of water; and the worst of it was, he took a big horn of it. What hurt him most was that he had never tasted it before, and a man should take it by degrees, not in the sudden manner that through Jimmy's method of forcing the teetotal act on him. When Hughey got his fifteen cents, he dashed across the fields and over fences without a break in the direction of Dick Lee's famous Inn, where the License Act was no great bar to the acquisition of man-killer, and there no doubt Hughey satisfied his raging thirst and got the taste of water taken out of his mouth.\n\nOn reflection, the boys could not see where the profit came in after playing the trick on Hughey, being treed for two hours and nearly frozen, and had to give up the spoil was a terrible infliction. The moral here is that it is better to be honest in all one's dealings as the trickster is apt to be tripped up under the most unexpected circumstances, and no matter how laudable a theory may be to force it on an unwilling subject is not only as senseless as it is mortifying to the one that applies it.\n\nTo return to Hughey, all that can be said of this renowned whiskey-head is that the circumstances of his environments had very little to do with his fiery career. He had brothers and sisters though not strictly educated, were sober and industrious; and the same facilities of Christian religion, education, and ordinary respectability were open to him as well as anybody else that chose to adopt them. The only plausible solution of Hughey's permanent appetite for straight whiskey, though naturally of an industrious turn, he had a weak nature, and whiskey being of a strong and robust nature the weaker quite naturally succumbed to the stronger. At any rate Hughey struggled long and heroically with the stronger nature, and Hughey had the advantage of entirely surrounding his opponent by always having it inside of his person. However, one cold morning, Hughey gave up the unequal combat, and ignominously turned up his toes in an open field, unmourned, uncared for, and nothing but the wintry winds and the stars to sing his requiem. Without benefit of clergy Hughey's remains were unceremoniously fired into an unknown grave in St. Michael's Cemetery hard by. No long funeral cortege accompanied his corpse to a richly sculptured sarcophagus or gilded obelisk planted o'er his last resting place. The only epitaph if any to indicate where he lies would be, \"Ignorance, weakness and whiskey, mark the final resting place of Hughey McCann.\"\n\nIf Hughey's shade were to appear at the scene of his earthly doings, it would say, provided it had sense enough, that one half the liquor drinking evil is the vile stuff that is dished out to the unsuspecting victims of intemperance, and it would further say as a representative of an experienced mortal, that if all liquors were pure, and a competent inspection of government officials, and a law provided that all sellers of intoxicating liquors be punished, and fined heavily for supplying anyone under the influence of whiskey or other brands of liquor. Had such regulations been in operation in Hughey's time perhaps even now he would be alive and pushing a useful existence.\nTHE LAST LETTER.\n\nThere is a picture of considerable artistic merit, entitled \"The Last Letter.\" It is a painting of an English home. The picture this sketch is taken from is but a cheap chromo, but is sufficiently true to the original to show the master hand of the artist, whose portrayal of the persons included in it is a most powerful delineation of human expression.\n\nThe picture is a living room, in a simple English homestead, a cosy, comfortable apartment, bright carpet on the floor, square old-fashioned table, a stairway of simple construction, leading to the upper part, and immediately opposite the door opening to the outside world. A few primitive pictures on the wall, the large gothic clock on the mantel, with capacious fireplace beneath. A sportive kitten is playing with a ball of yarn on the floor, rolling over it and under it, and having lots of fun as kittens are generally wont to do. In a rocking-chair seated pensively is an old lady, in one hand on her lap is held an open letter, and in the other hand is a pair of spectacles, dressed in a simple garb, with an apron on her head encased in a frilled cap, the face so sad and worn, eyes downcast, and the lines of care and anxiety have furrowed her kindly face that the pain and sorrow of heart are plainly depicted, and in gazing on the lineaments one is almost of the belief that he stands in front of a living-thinking being, and that she is uttering her thoughts of mingled anguish and despair aloud. With her eyes bent on the letter, which appears to be from the field of battle, and is from her son out there, is no tone of hope in it. No true mother can feel any exultation at the thought that her son, no matter how brave and daring he may be, when entering a field of carnage, where nothing is heard but the boom of the guns, the clashing of steel, the constant roll of small arms, where men are mowed down by the thousands, hacked and hewed and mangled out of all semblance to\nbrightly uniformed men. If he should be the hero of the hour, in the thickest of the smoke and din of battle, slicing the enemy up with sabre that would make a butcher turn green with envy—should win deathless fame by his indomitable courage and clash and honors heaped upon him, and the Victoria Cross. No matter how glorious the feats, the mother, sister, or wife may be, do not share any such glory. The wounds in the heat of battle, the shattered and battle scarred soldiers, even their last dying agonies, and even those that are carted off to the hospitals and hurriedly pruned by the brisk surgeons, can have no conception of the suffering and pain of the ones left at home. What quaking fears, sleepless nights, hideous nightmares of bloody encounters; the loved ones lying gashed and bleeding, crushed as if they had gone through a quartz stamping mill, left among the heaps of dead, nothing but the carrion-fowls and the soulless camp followers silently stripping the dead, unmindful of the groans of a stray wounded warrior. Such is their sepulchre, such are the triumphs and glory of war, where some acquire deathless fame, and hundreds of thousands death without fame. All these honors are the living wounds of the great army of the helpless women and children, the aged and infirm left behind, whose every waking moment is a nameless terror. Every bulletin may bring fresh news of death and desolation, poverty, wretchedness, and broken hearts. Although the soldiers' wounds may be agonizing and cause loss of life and limb, but their greatest sufferings are physical, but the tortures of the anxious ones left behind are a thousand-fold more acute, and prostrate both mind and body, and the joys and happiness of life wither and shrivel up like the flourishing vegetation affected by the drought. All these glorious tidings of the joyous battle field are indelibly written on the countenance reftred with care of the old lady in the rocking chair, with the letter in her hand, and the kitten still tumbling over the ball of yarn, regardless whether the whole of mankind are at war with each other, hacking one another in various sized fragments, slashing with the cutlass, broad sword, sable-boring each other with Winchester rifles, hundred-ton guns, converting men into fertilizer with Krupp guns, Gatling guns, Mountain Howitzer's torpedoes, or lifting each others crowns with revolvers of all patterns, and slaughtering with axes, pitchforks, and shot guns, in the most approved manner. The kitten chased its tail around in a circle, and wotanot of war and its terrors.\n\nThere are two more figures in the perspective. The outside door is quietly opened and a tall dragoon stops at the threshold, with cape unbuttoned, hand on the hilt of his sword, top-booted and spurred, bronzed features, heavy blonde moustache. The very personification of a soldier. A younger female form apparently comes down the stairs, and placing one hand on his arm, looks up into his face—his sister, or perhaps the girl he left behind him, and maybe his wife. Does he look down upon her with all the fond look of hope long deferred, and fervently embrace her as one who never expected to see her again? No. His gaze is rivetted on his poor old mother with a look of kindling affection and solicitude in\nhis eyes and the gentlest and softest smile on his face, which brings out the angel in the man that is brave and good. Could there be anything more soulful and sublime than this soldier's return after the varying tide of war—the marches—wearied and perhaps sick and in the midst of unlooked for dangers. To think of his mother as the guiding light of his existence, all other considerations are cast aside. The plaudits of the populace for the return of the soldiers of fortune, the sturdy defenders of the nation's honor, or the nation's rapacity as the case may be, are merely echoes of the excitement of the hour, and weighed in the balance against the anxiety of the waiting mother, is as chaff compared to the wheat of life. The soldier could not have any patriotism—no moral courage. No grand resolve to defend the hearthstone of his sire at the sacrifice of life and limb, and all that is dear to man in the spring-time of life. Patriotism takes its root at the home fireside, and is characterized by unshaken loyalty and devotion to that one whose tender care led him in the paths of moral rectitude and self-respect; and above all things, under all circumstances, and through trials and temptations, to honor thy father and mother, as without that respect, patriotism and public duty are the greatest sham on earth.\n\nLet poets extol the valiant achievements of war that resound with the praise of the nations heroes in the battle-field through all ages. Let the painter immortalize himself by thrilling spectacles of scenes—Waterloo, Moscow, Sedan, etc. The historian supply the craving for details of slaughter and horrors of bloody wars—both ancient and modern. Instead of clarion notes of the bugle—massing the troops—or the retreat or advance. How much pleasanter and enjoyable is the toot of the dinner horn, calling the people to their mid-day meal, with sharpened appetites by useful toil in the production of the bountiful stores provided by a lavish providence. How much better would the thunder of moving ordinance sound than the rumble of the waggon's field, bringing in their loads of golden grain for the sustenance of the nation. How much better the charges of the squadrons of cavalry upon blocks of living men, to be smashed by the iron hoofs of horses, and horses and men laid out by the steady pour of lead, than the employment of those useful animals in the profitable pursuits of man. Instead of herds of cattle and sheep grazing peacefully on the hills and meadows—and the best points exhibited at the fall shows, with red, white and blue tickets attached to their horns and harness—be the spoils of foraging parties of contending armies, and the country side in its pastoral beauty and serenity laid in waste and desolate like the track of an indiscriminate tornado. The busy hives of commerce. The factories turning out articles useful and ornamental for the convenience and comfort of everyone—the hum of industry everywhere—the mausoleums of art, education and finance. The march of civilization. The advance of religion and science. How much more musical would be the roar of guns, the bursting of shells, the crash of falling walls and toppling spires. The once open channels of trade and order of progress, now the scene of collapse and destruction, probably caused by the mistaken policy of the governmental few that do not represent the wishes of the\nmany. No doubt such martial desolation would be splendid material for some gifted artist. But the reality, it is to be hoped, belongs to the buried past, and only to be revived when reason is darkened o'er by the dull cloud of insanity.\n\nThe soldiers patriotism. The soldiers courage, fortitude and generalship can find plenty of scope in the peaceful paths of trade and enterprise. In the battle of life there are enough dangers to contend with in the shape of maladies, accidents on water and land. The engines of trade and transit are often enough the engines of human sacrifices. The thirst for wealth and position. The unhealthy ambition for notoriety and class distinction. And the inclination to neglect the humane and Christian virtues of the more practical kind. A man has plenty of opportunity in displaying his heroism at the present time without hacking his fellow man into sections with the instruments of sanguinary conflict. There is lots of room for hardship, pain and mortification, in this enlightened age without carrying a gun. The road to patriotism and honor is frequently strewn with Scotch thistles, and requires all the soldier's courage and devotion to come off with the Victoria Cross.\n\nIn the foregoing picture of the \"Last Letter,\" volumes could be written from its vivid history. It makes manifest that the first duty of a patriot, be he soldier or civilian, is the respect and care due to parents, and that is due from the strong and weak. The man that raises himself or gets risen to position, influence and wealth, and contributes largely to the Church, to societies, to anything and everything, and build him a palatial residence, and otherwise spend lavishly for his own aggrandizement. And who neglects and contributes nothing willingly to the ones that cared for him when care was mostly required. When kindness and a proper return were looked for, nothing but dictatorial and arbitrary brutality, and a few pence thrown at them like a bone to a dog. Unfortunately there are many people of that kind utterly oblivious of the inconvenience and self-denial of those that placed them on the first step to prosperity and success. Such men are not soldiers, patriots, or citizens, in the fullest extent of the word. To be a traitor or renegade to the highest human virtues would place him on the same ground towards his country and his Maker.\n\nStill looking at the picture—why not if we must have militia and munitions of war—utilize our army to some purpose. Instead of paying out large sums of money on men for mere ornamental purposes. Supply them with equipments for opening up roads through the wilder portions of our country for future traffic, for agricultural convenience and colonization. As brigades of engineers, sappers and miners, they could find employment for high explosives in removing rocks and building bridges, that would open the way for thousands of people that would otherwise not develop the back regions. They would then be serving a highly useful purpose, and the advantage to the country would more than equal the outlay for their maintenance, and it would in nowise unfit them for\nmilitary duty if such a dark episode should arise. Even the ancient Roman soldiery have the credit of making good roads wherever they penetrate. Why not at the present day?", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001521.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 29, "total-input-tokens": 40182, "total-output-tokens": 15650, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 106, 1], [106, 1010, 2], [1010, 1306, 3], [1306, 3206, 4], [3206, 6433, 5], [6433, 9565, 6], [9565, 12072, 7], [12072, 14821, 8], [14821, 17622, 9], [17622, 20190, 10], [20190, 22440, 11], [22440, 24370, 12], [24370, 27495, 13], [27495, 30688, 14], [30688, 33775, 15], [33775, 36917, 16], [36917, 38470, 17], [38470, 40625, 18], [40625, 43845, 19], [43845, 45297, 20], [45297, 47025, 21], [47025, 50356, 22], [50356, 53621, 23], [53621, 56841, 24], [56841, 58807, 25], [58807, 62107, 26], [62107, 65497, 27], [65497, 68638, 28], [68638, 68810, 29]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]