[{"id": "0a698b717af52d3429a1be852cf6ff29b9b7f4a6", "text": "ALLEN.\nVOLUNTEER LAND GRANTS,\nSCRIP, AND PENSIONS.\nVOLUNTEER LAND GRANTS,\nSCRIP, AND PENSIONS,\n\nWith suggestions shewing how a Grantee may realize to best advantage,\n\nBY CAPT. C. W. ALLEN,\n\nLate of the Department of the Interior, author of \"The Land Prospector's Manual and Field-Book,\" Etc.\n\nPRICE, - 15 CENTS.\n\nOf all Booksellers and Newsdealers.\n\nTORONTO: The Toronto News Co. MONTREAL: The Montreal News Co.\nNEW WOOLLENS.\n\nWe show today a full assortment of NEW FALL WOOLLENS, and can safely say that our Stock this Season is far superior to any ever held by us.\n\nWe are showing all the newest designs and colourings in Suitings, Trowsersings, and Overcoatings, in all the fashionable materials.\n\nWe are also pleased to inform our numerous Customers that we have secured the services of a really FIRST-CLASS CUTTER, and our Patrons may rely on being favoured with good fitting, well-made garments.\n\nINSPECTION INVITED.\n\nPETLEY & PETLEY,\n\n128 TO 132 KING STREET EAST,\n\nOpposite the Market, Toronto.\nERRATUM.\n\nPage 13.—In the thirteenth line, remedy a typographical omission by making the text include the following italicized words:—\"and further to claim and receive the warrant issued in my name conferring such land grant, to nominate,\" etc.\nVOLUNTEER LAND GRANTS\n\nSCRIP, AND PENSIONS,\n\nWith suggestions shewing how a grantee may realize to best advantage,\n\nBY CAPT. C. W. ALLEN\n\nLate of the Department of the Interior, author of \"The Land Prospector's Manual and Field-Book,\" etc.\n\n\"Where is the coward who would not dare\nTo fight for such a land?\"\n—Fitz-Eustace in \"Marmion.\"\n\nTORONTO: The Toronto News Co. MONTREAL: The Montreal News Co.\n\n1895.\nPREFACE.\n\nThe city newspapers contain advertisements asking returned volunteers to call at certain places where they can dispose of their scrip at profitable prices. Many of the returned heroes could be seen yesterday in the speculators' offices, bartering off their rewards at a price much below the actual value of the lands. A scrip speculator last night said that he considered it a profitable but risky business. About two weeks ago scrip could be purchased for any sum between $2 and $15; but now, since there is a demand, the price has risen to $30. Many have intimated their willingness to sell out, but will not accept less than $50. Those who are anxious to get rid of their scrip are either out of situations or hard pressed for money to pay off debts contracted by their families while left alone. There appears to be a desire on the part of most of the scrip-holders to dispose of it, as they do not appreciate its value and have no inclination for farming. One young man sold his holding to a speculative Yonge street tobacconist, who, on going down town, found the same young man driving a bargain in a King Street office.—The Globe, August 22nd, 1885.\n\nThe obvious want of correct information in regard to the intrinsic relative value of land grants and scrip, as shown by the above facts, suggested the preparation of this pamphlet, the main object of which is to protect those entitled to benefit by the bounty of Parliament from being persuaded to sacrifice their interests for lack, on their part, of trustworthy intelligence. If, the effect of the circulation of the work should be that men who have tried to take advantage of the necessities or ignorance of the grantees come to realize that they have bought \"a pig in a poke,\" probably little sympathy will be felt for disappointment experienced by a class of speculators able, as a rule, to take very good care of themselves. The numerous references, as well as the text of certain official documents printed in the appendix, will enable any one who differs from the conclusions of the author to turn readily to original sources of information. Finally, the brief exposition of the new regulations governing the award of pensions and allowances for casualties on service will be found, at the present time, valuable reading for those interested.\n\nPRINTED BY THE \"GRIP\" PRINTING AND PUBLISHING COMPANY, TORONTO.\nVOLUNTEER LAND GRANTS AND SCRIP.\n\nThose who are entitled to participate would do well to disabuse their minds of any false impression already formed, that Parliament has voted what is virtually a bounty as, in any sense, an equivalent for their services. The pay and allowances of the militia when called into active service are fixed by Order in Council, under authority of a statute (46 Vic., chap. 11, sec. 63). Every officer, who accepts a commission, and each man who enrols himself in a corps, may accordingly be supposed to know the full extent of the pay and allowances that he can expect. The land grant (or scrip in lieu thereof) to which those who have recently served in the North-West are now entitled should therefore be properly regarded as a bonus presented by the representatives of a grateful country in special acknowledgment of efficient services performed with successful result, but that have been paid for at the rate stipulated in the contract. Looked at from this point of view, the bounty now granted him should be regarded by the militiaman as something to the good beyond his original calculations, and as a property it would be well for him to turn to the best possible account.\n\nThe precedent of bestowing a land bounty on members of the volunteer militia sent on active service was set up by the Canadian Government when, after the bloodless suppression of Riel's first rebellion, members of the 1st (Ontario) and 2nd (Quebec) Battalions of Rifles, which had formed part of the Red River Expedition, under Sir Garnet (then only Colonel) Wolseley, were each, by an Order in Council dated April 25th, 1871, granted a quarter section (160 acres) of land without the condition of personal settlement. Subsequently, every recruit taken for service in the garrison maintained at Winnipeg till the year 1877 was, by the terms of the general order governing his enlistment, promised a similar free land grant on his discharge; but, strangely enough, a man who re-engaged for a further period was (though a trained soldier) denied a second grant, notwithstanding that it was virtually, in the case of a raw recruit, a deferred portion of his compensation.\n\nIn those days the price of Government lands in Manitoba and the North-West was one dollar per acre, and speculators eagerly purchased a man's discharge (with claim to land warrant) for sums ranging (according to the quantity of unlocated warrants at the time existing) from fifty dollars to one hundred dollars, while the latter figure was about the price that warrants themselves generally brought. The market value suffered all sorts of fluctuations; but the darkest day for the holders, whether discharged soldiers or their assignees, was that in which the Government, by Order in Council, dated July 9th, 1879, included all the surveyed lands within certain railway belts, so that there was no place in the whole of Canada where military warrants could be utilized, which condition of affairs actually lasted over twelve months.\nOther cases of hardship, however, might be mentioned. In 1876, the garrison at Winnipeg was perfunctorily reduced, at one week's notice, from one hundred to fifty men, the remainder being suddenly set adrift several weeks before their term of enlistment had expired; though, had they ventured thus abruptly to terminate the contract, they would have been liable to trial by court-martial for desertion. These men did not receive their warrants for nearly two months, and, the first issue of half-breed scrip having been made in the meantime, the value had shrunk from one hundred to fifty dollars. This occurrence really took place, but neither the administration of the day nor that which succeeded it could be prevailed upon to entertain the claim of the sufferers to compensation, though a respectful petition was sent to both Houses of Parliament.\n\nSuch experience by men suddenly thrust out of steady employment through no fault of their own, where the issue of but fifty warrants was concerned, might be deemed ominous of years of weary waiting, in the case of the six thousand officers, non-commissioned officers, and men now looking for the benefit to which they are entitled; but happily the energy infused into the Militia Department by Sir Adolphe Caron, and the increased efficiency of the Department of the Interior under the present Deputy Minister, afford some ground for indulging the hope that official routine will be expedited so far as possible, and give a perfect assurance that any enquiries [see page 12] on points which the writer may have omitted to touch upon will be replied to with courtesy and promptitude.\n\n**ELIGIBLE CLAIMANTS FOR BOUNTY.**\n\nThose only are entitled to claim a land grant (or scrip in lieu thereof) who were members of the \"enrolled militia force actively engaged, and bearing arms, in the suppression of the Indian and half-breed outbreak, and serving west of Port Arthur since the 25th March, 1885, including officers, non-commissioned officers, and men.\" [See page 11.] The heirs of grantees killed in action, or who have died, since the above date, succeed to the rights of the deceased.\n\n**NATURE OF THE BOUNTY.**\n\nThe bounty on the present occasion differs materially in form from that which used to be granted to discharged soldiers or Mounted Policemen, by what were known as land warrants, which authorized the grantee to select and enter, as a free grant, one quarter-section (or 160 acres) of any Dominion Lands open for sale at one dollar per acre. With the increase of settlement in the North-West, and the necessity for the appropriation of a large portion of the public domain in aid of the construction of the Canadian Pacific Railway, occasion arose for the Government to increase the general price of public lands available for purchase, or as pre-emptions, from $1 to $2 and $2.50 per acre.* To meet the difficulty which this step involved, in that it had the effect of locking up all lands from location by bounty warrants still unutilized, the Dominion Lands Act, 1883, (see 46 Vic., chap. 17, sec. 21,) declared that such warrants should be received, \"at the value shown upon their face, in payment for any\n\n* By the Dominion Lands Regulations of December 23rd, 1881, surveyed lands in Manitoba and the North-West Territories were divided into certain classes, according to locality and the extent of the railway facilities existing or in immediate prospect. As a result, the price of all lands purchasable by pre-emption in that portion of the country lying within twenty-four miles of the main line of the Canadian Pacific Railway, between such main line and the international boundary, and also within twelve miles on either side of any projected line of railway (other than the C.P.R.) approved by Order in Council published in the Canada Gazette, was fixed at $2.50 per acre. Elsewhere, i.e., to the north of the Canadian Pacific Railway belt and outside of any other railway belts, if west of the second initial meridian, the price of pre-emptions is fixed at $2 per acre.\nDominion lands open for sale,\" —viz; $160, which sum, as applied in the purchase of Government lands, represented, therefore, the intrinsic value of all bounty warrants issued to discharged soldiers or Mounted Policemen up to the present time. In comparing the grant now made to the troops who have served in 1885 with that previously made, this fact should be well kept in mind.\n\n**THE LAND GRANT,** now offered to those entitled to bounty is a very liberal one, being in fact more than double that which has been conferred on soldiers or policemen heretofore. Few of the recipients seem to appreciate this truth, the general feeling apparently being that the troops of the present day, notwithstanding their having \"smelt powder,\" are unjustly discriminated against. To prove that this latter view is erroneous, it is only necessary to show how the respective grants compare in the case of the grantees in either case electing to become a farmer, and taking up two quarter sections (160 acres each):\n\nThe volunteer of 1871 could enter one quarter section as a free homestead...........160 acres, worth $160\n\nHe could take up a second quarter section as a free grant by locating his warrant ....160 \" \" $160\n\nThus gaining........320 acres, worth $320\n\nLess entry fees on both quarter sections..20\n\n$300\n\nThe volunteer of 1885 may enter, without payment of fees, two quarter sections as a free homestead, thus gaining 320 acres, worth $640 or $800\n\nIt would appear, therefore, that Parliament has actually conferred upon each member of Gen. Middleton's expedition, if willing to become a homestead settler, a free grant of more than double the value of that conferred upon any former recipient. It is true that the conditions attached to the old bounty warrant system did not exact personal settlement from the grantee; but, if a man desires to farm, the obligations imposed by the Dominion Lands law will not be found burdensome or unreasonable. The motive of the extra generosity of the action which Parliament has taken on this occasion is found in the suggestion contained in the preamble of the Act, that \"it is expedient that the grant should be made in such form as will be conducive to the actual settlement of the public lands of Canada.\"\n\n**THE OBLIGATIONS OF A HOMESTEADER,** which must be observed by all who decide to take lands grants, whether as original grantees or as substitutes, may be summarized from the Dominion Lands Acts (46 Vic., chap. 17 and 47 Vic., chap. 25,) as follows:\n\n1. The land selected must be of the class open for entry under the homestead provisions of the Dominion Lands law and regulations.\n\n2. A formal entry must be made of the land selected at the office of the Dominion Lands Agent for the district in which they are situate, and this must be done before August 1st, 1886.\n\n3. The claimant must perfect his entry by commencing residence on, and cultivation of, his homestead within six months from the above date.\n\n4. He must continue to reside on and cultivate his claim for three successive years, though absence for periods not exceeding six months in any one year is permitted. He may, however, at his option, reside within two miles of his homestead, instead of upon it; but in this case certain specific\n\n*For further particulars as to the Dominion Lands law or the system of survey pursued in the North-West, see advt., page 15.*\nconditions of annual cultivation and improvement must be performed. [See Dominion Lands Act, Sect. 23, sub-sect. 6.]\n\nWhile he faithfully observes the above simple obligations and abstains from disposing of wood from off his homestead, except to supply the personal needs of an actual settler, the grantee will enjoy the full rights of proprietorship; but his land is secure from being taken in execution for debt of any kind until after the issue of patent.\n\n6. In case of the grantee's death occurring before issue of patent, the legal representatives of the deceased would be permitted to complete his homestead duties, and thus secure the title of the property to his heirs.\n\nTHE POSITION OF A SUBSTITUTE\n\nnamed by a grantee will be identical with that of the grantee himself in all respects. He will succeed fully to the rights, and be subject to the obligations, of the grant which a volunteer is entitled to claim; but he will not, until issue of patent has been recommended, enjoy the privilege of re-transferring or assigning the \"right, title, and interest\" in the grant that has been vested in himself. The entry for the land selected must be made in his own name, in which, also, the patent will issue in due course on fulfilment of the three years' residence and cultivation required by the homestead provisions of the law.\n\nSCRIP.\n\nIn the event of a volunteer being unable to take up his land grant, or to provide a substitute who is willing to do so, he has the option of accepting scrip in lieu thereof. This scrip will no doubt correspond in form to that which was issued in satisfaction of the claims of the half-breed heads of families and other original settlers in Manitoba. In that case it will be a lithographed document, bearing an inscription as follows: \"The bearer hereof is entitled to an allowance of Eighty Dollars in any purchase of Dominion lands.\" This, it will be observed, is not, as in the case of the alternative previously described, a grant of land, but purely an acknowledgment of a pecuniary interest that may be availed of in a special way—the purchase of Government land, or in the discharge of rents or other obligations in respect of the same. Its use is subject to the conditions [see Dominion Lands Act, section 21] that (1) no greater area in any township than twenty per cent. of the land, exclusive of school and Hudson Bay Company's lands, shall be deemed open for entry by scrip, and that (2) should any scrip or amount in scrip be in excess of the amount of the purchase money, such excess will not be returned by the Government, but, if there be any deficiency, such deficiency shall be made good in cash.\n\nWhile such scrip will always be accepted at par by the Government, its discount value in the hands of holders will necessarily depend upon the amount in circulation and the extent of the demand for scrip in payment for Dominion lands. Grantees must, therefore, be prepared to find the price offered them in Montreal, Toronto, or Winnipeg considerably less than the face value of the scrip.\n\nThe purchase value will in fact be determined entirely by the law of supply and demand, as governed by the rate of development of the North-West. A considerable quantity of scrip of the denomination of $240 is being issued, in satisfaction of the claims of those half-breeds of the North-West who had not already participated in the similar distribution made to those of their class residing in Manitoba. The market will accordingly be pretty well stocked for the present. According to recent information afforded to the Manitoban, of Winnipeg, by Mr. W. P. R. Street, one of the commissioners appointed by the Dominion Government to investigate and settle half-breed claims in the North-West, \"Out of\nthe 1,400 claims adjusted, 900 had the option of taking land or scrip. But 225 took the land, the rest all preferring the scrip. This they readily disposed of to speculators and others who followed the commission right from its first sitting to the last. They usually paid from 60 to 80 per cent. on the dollar, making an excellent speculation out of it.\" However, quite a large amount of purchase money is due to the Crown by the various colonization companies, which may absorb considerable scrip. Again, the North-West Central, the Manitoba and North-Western, and the Manitoba South-Western Railway companies will shortly be required to find sums aggregating some $50,000, in payment of the survey fees in connection with their free land grants, and it is possible scrip may be utilized in discharge of this obligation. Further, there is always a considerable number of pre-emptions for which payment must be made, and for which scrip would be available, while the rents of lands leased for grazing or hay-cutting purposes may also be expected to annually absorb quite a large amount.\n\nScrip, once it is issued, being an acknowledgment available to bearer, may be transferred from one person to another without any formal assignment, passing from hand to hand like a bank note.\n\nCOMPARATIVE VALUE OF LAND GRANTS AND SCRIP.\n\nFor the better information of readers quite unfamiliar with the subject, it may be as well to place the relative values of the land grant or scrip still more clearly in comparison. As anyone can obtain one free quarter section on the same (homestead) conditions as a volunteer would secure half of the land Parliament has granted him, the true way to estimate the bounty is to regard it in the light of a free pre-emption. That is to say, the volunteer who takes up 320 acres of land will save an outlay, at the time he makes his entry of twenty dollars (entry fees), and at the end of three years, of $320 or $400, according to the price of Government lands in the locality in which he makes his selection. Now, if he should wish to buy Government land with scrip, it would only realize to him its par (or face) value—eighty dollars—which is actually but one-fourth or one-fifth the value of the free pre-emption he might secure, if he so desired.\n\nHOW CLAIMANTS WILL OBTAIN THEIR LAND GRANTS OR SCRIP.\n\nOfficers commanding corps have already been notified by circular from headquarters to send in a nominal roll, duly certified, of all officers, non-commissioned officers, and men in their commands entitled to the bounty granted by Parliament; and each individual concerned can, to some extent, advance the business in hand by furnishing to the officer commanding his troop, battery, or company such particulars as to his full legal name and present postal address as the Militia Department require for record. There is no good reason why any considerable delay should occur in procuring this information; and it would seem better that any deficiencies should afterwards be remedied, by the sending in of supplemental lists, than that procrastination should be indulged in to the disadvantage of those sufficiently alive to their own interests to come forward promptly with the required particulars.\n\nAfter the list of eligible claimants furnished by a commanding officer has been duly examined and verified at Ottawa, the Militia Department will forward to the Department of the Interior certificates showing that the claimants have served in the North-West and are entitled to bounty, and at the same time notify each individual that his right to bounty has thus been recognized. It is for this reason important that every man should see that his correct name and address goes upon the roll.\nSo soon as he receives the above notification from the Militia Department, it will be opportune for the grantee to advise the Department of the Interior whether he decides to take his grant of 320 acres of land by warrant, or if he prefers to relinquish his grant entirely and accept scrip for $80 instead. Upon being informed of the choice made, the proper document—whether a land warrant (authorizing the party therein named to enter for a free grant of two quarter sections without payment of entry fees) or scrip (declaring \"the bearer hereof is entitled to an allowance of $80 in any purchase of Dominion Lands\")—will be prepared. When ready, the warrant or scrip will be delivered upon the Department being furnished with an order signed by the grantee himself or some one duly authorized by power of attorney to receipt on his behalf, accompanied by the letter of notification received from the Militia Department. All this routine and these precautions may seem to some people to savour strongly of \"red tape\"; but it should be remembered that the authorities are bound to take due precautions to protect both the Government and the rightful claimants of bounty against the perpetration of fraud.\n\nN. B.—All claims to bounty, whether land grant or scrip, will lapse unless made before the 1st August, 1886.\n\nHOW MOST ADVANTAGEOUSLY TO REALIZE THE BOUNTY.\n\nA volunteer should postpone notifying the Department of the Interior of his desire to receive scrip until it appears absolutely certain that he will not take up his 320 acres in person and that he cannot dispose of his right to name a substitute for more than the face value of the scrip, viz., $80. It has already been explained (on page 5) what the land grant is intrinsically worth to the man who takes it, but it is now proposed to show what should be its purchase value to the only person who could realize its full benefits—that is a substitute, duly qualified* under the Dominion Lands law, who purposes becoming a homestead settler. Such person is entitled to obtain a free homestead of 160 acres on the identical conditions of settlement and cultivation that would attach to the utilization of a volunteer grant; but, if he entered also for a pre-emption, he would be called upon to pay the Government $2 or $2.50 an acre for the same (without interest) at the end of three years, to which should be added the amount of the prescribed entry fees. His outlay would accordingly stand thus, if his land were selected within reach of railway facilities.\n\n| Purchase price of the pre-emption, less three year's interest saved, at (say) 8 per cent | $304.00 |\n| Entry fees on homestead and pre-emption, in cash | $20.00 |\n| **Total** | **$324.00** |\n\nThe par value of a volunteer's land grant may therefore be fairly estimated at $324.00; and it follows that anyone desiring, by becoming a \"substitute,\" to secure what would virtually amount to a free pre-emption as well as a free homestead, would be distinctly the gainer by the difference between that sum and the amount at which he can purchase a volunteer's right.\n\nAccording to the fluctuations of the market value, which should gradually enhance as the quantity of unlocated land warrants diminishes, a volunteer may fairly hope, by watching his opportunity, to realize from $250 to $300 by the sale of his right to the land. Surely, therefore, it\n\n---\n\n*Any man over eighteen years of age, or any woman who is the sole head of a family, may take up a homestead. If the citizen of a foreign country, such settler is required to become a British subject, by naturalization, previous to issue of patent, which can be done under the law on completion of his or her three years' residence on the homestead.—See Land Prospectors' Manual and Field Book; advt., page 15.\nwould be extremely unwise at present to accept scrip for $80, the face value of which is just as liable to depreciation and fluctuation.\n\nWHY CLAIMS TO WARRANTS OR TO SCRIP CANNOT BE LEGALLY ASSIGNED.\n\nThe Dominion Lands Act [see page 12] having declared that assignments of military bounty land scrip, or of the expectancy of the same, shall not be recognized, it necessarily follows that no document can be devised which will make legal a transaction distinctly tabooed by statute. Accordingly, all who purchase the right of any volunteer to scrip must depend chiefly upon the integrity of the vendor. Those who venture upon this kind of speculation generally place their dependence upon an ingeniously worded document, which purports to be evidence of bargain and sale, and also a power of attorney to draw the warrant or scrip. The latter portion of the document, however, can alone be recognized, and, all things being equal, recognition will be given to the instrument first filed in the Department of the Interior.\n\nHOW THE RIGHT TO LAND OR SCRIP MAY BE TRANSFERRED.\n\nSo soon as a volunteer receives notice from the Militia Department that his claim has been recommended to the Department of the Interior, where it will be registered according to law, he may, if he desires to sell his right, legally do so. It is, for, the purchaser to see that the transfer is made effectual. The simplest way to secure this is for the grantee to execute a power of attorney* [see page 13] authorizing the purchaser to name such grantee's substitute, or to draw scrip. The warrant itself will be issued in the name of the grantee, by whom or his attorney the substitute must be nominated. To facilitate this a blank form for the naming of the substitute will be printed on the back of the warrant. Once this document has been received and filed in the Department, no fraudulent resale would affect the transaction. It would be well for any intending purchaser, however, to ascertain before he pays over the purchase money whether the grantee has previously drawn, or given a power of attorney to draw, his warrant or scrip. When a duly executed power of attorney from a volunteer to draw his warrant or scrip, or to nominate his substitute, has been filed in the Department of the Interior, it will then be for the attorney to notify that Department whether he elects to accept scrip or a warrant for free entry of 320 acres. If the latter, he can then, as attorney, name the substitute on the form for that purpose on the back of the warrant, or separately if he see fit.\n\nCONCLUSION.\n\nHaving now fulfilled his undertaking to explain the nature of the land grants and scrip which the Act of Parliament confers upon members of the North-West Field Force; having also stated the law and related the practice of the Department of the Interior, little remains for the author to add. There is an old saying, that the man who gives or takes advice is a fool, and certainly he who ventured to dictate to grown-up men how they should dispose of their own property would assume a grave responsibility. Parents who attempt to dictate to a wayward daughter in a matter of the affections are apt to precipitate the very step which they regard as imprudent. The wisest course is to counsel the party chiefly interested to take time to fully consider the subject in all its bearings. That is the nature of the advice the writer would here offer to recipients of Parliament's bounty. \"Fools and their money are soon parted;\" but\n\n*N.B.—All concerned should bear in mind that a Power of Attorney, like a will, is a revocable instrument.\nprudent men will hold fast to a property which, properly handled, may become the nucleus of future independence. Those whose tastes do not lead in the direction of farming would be most unwise to forsake their urban occupations for residence on the prairie; but, for the man with small means whose ambition is to become the proprietor of a farm in a region as fertile as can be found in British North America, the free grant of two quarter sections—without even entry fees—affords a splendid opportunity. The man who accepts such an opening may take possession of a farm of 320 acres, worth, according to the Government price of the contiguous wild land, $800, upon the simple condition that he will utilize such property for three years by residing upon and cultivating it. How often such a chance will recur in the lives of the stalwart young men who went so readily to the North-West to put down Riel's second rebellion is a subject on which those interested may well ponder carefully. They have still eleven months to consider the matter, and at the last moment they can fall back on scrip if, by the 1st August next, they see they cannot utilize the land grant personally or by substitute. The selling price of scrip a year hence should be much higher than the expectancy of it is now, as a great quantity will undoubtedly have been absorbed in the meantime.\n\nGRATUITIES AND PENSIONS.\n\nPENSIONS AND ALLOWANCES FOR CASUALTIES ON SERVICE.\n\nThe Regulations and Orders for the Militia, 1883, have been amended by the addition of seventeen paragraphs, under the heading, \"Gratuities and Pensions.\" The principle upon which these awards are made is the admission that when an officer or man is killed (or dies from wounds or disease contracted) on actual service, provision must be made for his wife and family out of the public funds, and that in all cases of permanent disability, arising from injuries received (or illness contracted) while on actual service, those concerned shall be compensated according to the regulations for the time being. The claims of those officers and soldiers who may be only temporarily incapacitated are also fully recognized, the pay and allowances of an officer being continued till his recovery, but with no allowance for medical attendance; while a non-commissioned officer or private is entitled to one dollar per day, whether in hospital or at home (also without allowance for medical attendance). The annual pensions to officers who have been crippled in action are based upon the rank they hold in the service, the scale ranging from $280 to $1,200, and in addition a bonus of one full year's pay is given. No pension or gratuity is awarded unless application be made within five years after the occurrence of the injury. Pensions to non-commissioned officers and privates range from fifteen cents to one dollar and ten cents per day, according to the rank of the claimant and the degree in which he may be incapacitated from earning his livelihood. If a deceased officer or soldier has been killed in action, or has died from wounds received in action, or if the deceased officer or soldier died from illness that can be directly traced to fatigue, privation, or exposure incident to active operations in the field, or if he shall have lost his life in consequence of wounds received in the execution of military\nduty otherwise than in action, his widow and orphans are entitled to what is termed \"compassionate\" allowances upon a scale set forth. The mother, sisters, and daughters of deceased officers and soldiers are entitled to receive gratuities and pensions under certain circumstances. The manner in which claims must be made and proved are set forth in the \"Regulations for Claims,\" and those interested would do well to present their cases for consideration by the proper authorities with the least possible delay, as the necessary routine is sure to take considerable time, which may prove wearisome and inconvenient to such as are in straightened circumstances.\n\nCOMPENSATION FOR INJURIES TO HORSES.\n\nThe amount of compensation that may be claimed from Government for injuries to the horse of a volunteer, received on service, is limited to $125, and ample proof must be made before a board of officers of the circumstances. [See Regulations and Orders for the Militia, 1883.]\n\nAPPENDIX.\n\nTHE ACT GRANTING LAND OR SCRIP.\n\nAn Act to authorize grants of land to members of the militia force lately on active service in the North-West. [Assented to July 20th, 1885.]\n\nWhereas, it is right to recognize the services of the members of the enrolled militia force actively engaged in suppressing the late half-breed and Indian outbreak in the North-west, by giving to each, in addition to the pay and allowances to which he is entitled under the Militia Act, a grant of land; and it is expedient that the grant should be made in such form as will be conducive to the actual settlement of the public lands of Canada: Therefore Her Majesty, by and with the advice and consent of the Senate and House of Commons of Canada, enacts as follows:\n\n1. The Governor-in-Council is hereby authorized to grant to each member of the enrolled militia force actively engaged and bearing arms in the suppression of the Indian and half-breed outbreak, and serving west of Port Arthur, since the twenty-fifth day of March last, including officers, non-commissioned officers and men, a free homestead of two adjoining quarter-sections (comprising an area of three hundred and twenty acres in all) of any even-numbered section of unoccupied and unclaimed Dominion lands in Manitoba or the North-west Territories open for homestead and pre-emption entry, subject to the condition that the grantee, or his duly constituted substitute, shall have selected and entered the said two quarter-sections in the Dominion Lands Office, at the last district in which they may be situated, on or before the first day of August, eighteen hundred and eighty-six.\n\nProvided that the said grantee, or his substitute, as the case may be, shall perfect the entry made as aforesaid, by commencing actually to reside upon and cultivate the land within six months from and after the first day of August, eighteen hundred and eighty-six, and shall thereafter continue to reside and cultivate the said land for the period and in accordance with the terms and conditions prescribed by the homestead provisions of the Dominion Lands Act, 1872: Provided also that no substitute to be selected by a grantee shall be a person who is not eligible under the provisions of the said Act to obtain entry for a homestead: And further, that in case a substitute be selected by a grantee, as hereinbefore provided, the land shall be entered in the name of the substitute and upon compliance with the conditions in that behalf prescribed by the homestead provisions of the said Act, the patent for the two quarter-sections shall be issued in the name of the said substitute.\n\n2. Any person entitled under the foregoing provisions to select and enter, either by himself or by his substitute, three hundred and twenty acres of land as a homestead, in the manner and subject to the terms and condition hereinbefore prescribed, may, in lieu thereof, if he so choose, receive scrip for eighty dollars, which shall be sufficient for the purchase of lands open for selection in payment of rent, or of rents of Dominion lands leased for grazing or hay-cutting purposes; but any person choosing to take scrip, as herein provided, must notify the Minister of the Interior of his choice on or before the first day of August, eighteen hundred and eighty-six.\n\n3. All grants of land or scrip, as the case may be, issued in accordance with the foregoing provisions, shall be made by the Minister of the Interior, upon a warrant in favor of the person entitled thereto issued by the Minister of Militia and Defence, which shall be recorded in the\nDepartment of the Interior, under clause twenty-one of \"The Dominion Lands Act, 1883,\" and all scrip issued under the second section of this Act shall be subject in all respects to the provisions of the said clause twenty-one and also of clause twenty-two of the said Act.\n\n3. The entries to be made and the patents to be issued under this Act shall not be subject to the dues and charges exacted in the case of ordinary homestead entries.\n\nTHE DOMINION LANDS LAW.\n\n(Extracts from 46 Vict., Chap. 17.)\n\nMILITARY BOUNTY LAND SCRIP.\n\n21. In all cases in which land scrip has heretofore been earned, or shall hereafter be given by the Dominion, for military services, warrants therefor shall be granted in favour of the parties entitled thereto by the Minister of Militia and Defence; and such warrants shall be recorded in the Department of the Interior:\n\n2. Such warrants shall be received, at the value shown upon their face, in payment for any Dominion lands open for sale: Provided always, that no greater area in any township than twenty percent of the land, exclusive of School and Hudson's Bay Company's lands, shall be open for entry by military bounty warrants.\n\n3. In accepting warrants as so much purchase money, any deficiency shall be payable in cash; but should any payment by warrant or by amount in warrants, be in excess of the amount of the purchase money, any such excess shall not be returned by the Government.\n\n22. Assignments of Military Bounty warrants, or of the expectancy of the same, shall not be recognized; but the warrants shall, similarly to other land scrip, be considered payable to bearer; and the warrantee shall be at all risk of their loss, as no warrant shall be duplicated. In cases where any person entitled to a Military Bounty warrant dies before its issue, the warrant shall issue in favour of the legal representative or representatives of such deceased person.\n\nPROVING UP A CLAIM.\n\n(Extract from 47 Vict., Chap. 25, Sect. 3.)\n\n4. Proof of the residence, erection of a habitable house, and cultivation required by this clause shall be made by the claimant by affidavit, and shall be corroborated by the evidence on oath of two disinterested witnesses, resident in the vicinity of the land affected by their evidence, and accepted as sufficient by the Commissioner of Dominion Lands or the Land Board: such affidavit shall be sworn and such testimony given before the Local Agent or some other person named for that purpose by the Minister of the Interior.\n\nCORRESPONDENCE WITH OTTAWA.\n\nObservance of the following hints for conducting correspondence with the Departments of the Government will save time and trouble to the official staff, facilitate the submission of applications for decision, and consequently tend to diminish the period in which replies may be looked for:\n\n1. Address no letters on official business by name to the Minister, or anyone else connected with the Department, as letters so personally addressed may be deemed private correspondence, and, in the possible absence of the person to whom they are directed, remain unopened till his return.\n\n2. All letters to the authorities at Ottawa on official matters should be addressed, in a plain hand, to\n\nThe Hon. the Minister,\nDepartment of\nOttawa.\n\nNo stamp is required for letters so directed to a Department, such communications being \"free.\"\n\n3. Write in a concise and courteous manner, upon foolscap paper, on one side of the paper only, and leaving a margin of at least an inch on the left-hand side.\n\n4. In the right-hand top corner of the first page write distinctly the official name of the post office to which a reply should be addressed, together with the date of your letter. If the matter occupies more than one page, see that the pages are numbered; and be sure that your signature is legible.\n\n5. Never deal with more than one subject in a single communication; but write a separate letter for each.\n\n6. On receiving a reply, if you have to respond to it, do not fail to quote the reference number of the official file, which you will observe in the left-hand top corner of the first page (i.e., at the head of your letter put—In reply to No. . . . . . .)\nPOWER OF ATTORNEY\n\n(Approved Form.)\n\nKNOW ALL MEN by these presents (executed in duplicate), that I, of In the County of and Province of by occupation a and recently serving in the rank of Troop (Battery or Company) of the Millia Force of Canada, actively engaged in suppressing the Half-breed and Indian outbreak, and serving west of Port Arthur since the 25th day of March, 1885, do hereby make, constitute, and appoint of in the County of and Province of by occupation a my true and lawful Attorney for me, in my name, and on my behalf to exercise the option conferred upon me by the Act entitled: \"An act to authorize grants of land to members of the militia force lately on active service in the North-West,\" whereby I am entitled to elect whether I will accept a land grant or scrip in lieu thereof; and further to nominate my substitute for such land grant, or to claim and receive such scrip, and to do all lawful acts and things affecting the premises, I hereby agreeing to allow, ratify, and confirm whatsoever my said Attorney, or such substitute or substitutes as he may appoint, shall do or cause to be done by virtue of these presents.\n\nSIGNED, SEALED, AND DELIVERED\n\nby the within named ...........................................\n\n.................................................., in the\n\npresence of .................................................\n\nAFFIDAVIT OF WITNESS.\n\nCOUNTY OF .................................................\n\nI, ...................................................of the ........................\n\nof .................................................., in the County of\n\nTo Wit:\n\n..................................................and Province of ...........................................\n\nby occupation ..................................................make oath and say:\n\n1. That I was personally present and did see the within instrument and duplicate thereof duly signed, sealed, and executed by ..................................................the party thereto.\n\n2. That the said instrument and duplicate were executed at ..................................................in the County of ...........................................\n\n3. That I know the said party;\n\n4. That I am a subscribing witness to the said instrument.\n\nSworn before me at the .................................................\n\n..........................of.......................\n\nIn the County of ..............\n\nIn the year of Our Lord,\n\n1883.\n\nNotary Public.\n\nNote.—If the above form be executed in one Province to be used in another (say, executed in Winnipeg to be filed in Ottawa), the affidavit should be sworn before a Notary Public, whose official seal must be affixed. If executed in Ontario, for filing at Ottawa, the affidavit may be made before a Commissioner in B. R.\nThe Illustrated War News.\n\nNOS. 1 TO 18, INCLUSIVE.\n\nThe back numbers of this paper have been re-issued by the Publishers, and are offered to the public in book form. This volume is one of intense interest, as it contains all the numbers issued from the outbreak of the Rebellion of 1885 up to and including the return and disbanding of the troops. There is\n\nALSO AN APPENDIX\n\nGiving name and rank of every man who went to the Front.\n\nIt will form a lasting memento of Riel's second revolt. The illustrations are from authentic sources, and have secured an excellent reputation for the paper. The Publishers have had a special artist with General Middleton's division from the first, and correspondents and artists with all the other divisions.\n\nPrice, bound in half leather, cloth sides, - - $3.25\n\" \" \" \" with gold side stamp, $3.50\n\nAGENTS WANTED.\n\nThe Grip Printing & Publishing Co.,\nTORONTO.\nTHE LAND PROSPECTORS' MANUAL\nAND FIELD BOOK\n(ILLUSTRATED).\nFor the Use of Immigrants and Capitalists taking up Lands in Manitoba\nand the North West Territories of Canada.\n\nBY CAPTAIN C. W. ALLEN.\n\nThis little work, which is of a handy size for the pocket, gives full explanations\nof the system of survey, and contains a concise and intelligible synopsis of the\nDominion Land Laws, Regulations, etc.\n\nThe Appendix includes a number of lithographed diagrams of townships and\nsections, upon which a land hunter can make personal memoranda while in the\nfield for after use by himself or friends.\n\nDEPARTMENT OF THE INTERIOR,\nOTTAWA, 16th September, 1881.\n\nMY DEAR SIR,—Please accept my thanks for the advance copy you have been\nkind enough to send me of your Land Prospector's Manual. It cannot fail to be of\nmuch service to those intending to settle in our North-West Territories.\n\nYou have succeeded in making, in popular language, a very clear exposition of\nour system of survey and of the Dominion Land laws and regulations.\n\nVery truly yours, LINDSAY RUSSELL,\nCAPT. C. W. ALLEN, Ottawa.\nSurveyor-General.\n\nPRICE, 25 Cents, of all Booksellers.\n\nPUBLISHERS:\nTORONTO, The Toronto News Company.\nMONTREAL, The Montreal News Company.\n\nBURDOCK BLOOD BITTERS\n\nThe only Medicine that successfully purifies the\nBlood, acts upon the Liver, Bowels, Skin and Kidneys,\nwhile at the same time it allays Nervous Irritation,\nand strengthens the Debilitated System, perfectly and\nspeedily curing Biliousness, Jaundice, Dyspepsia, Consti-\npation, Headache, Rheumatism, Dropsy, Nervous and Gen-\neral Debility, Female Complaints, Scrofula, Erysipelas,\nSalt Rheum, and every species of Chronic Disease arising from\nDisordered Liver, Kidneys, Stomach, Bowels or Blood.\n\nTHE BEST LIQUID PURIFYING TONIC IN THE WORLD.\nSample Bottle, 10c. I. MILBURN & CO., SOLE AGENTS, TORONTO.\nRegular Size, $1.00\n\nMrs. Freeman's Worm Powder is a safe, sure and effectual destroyer of worm in children or\nadults. Price 25 cents or 5 for $1.\n\nMrs. Freeman's New Domestic Dyes are perfect in every color. For brightness and\ndurability they have no equal. Price 15 cents per package.\nCATARRH.\n\nA new treatment has been discovered whereby a permanent cure of this hitherto incurable disease is absolutely effected in from one to three applications, no matter whether standing one year or forty years. This remedy is only applied once in twelve days, and does not interfere with business. Descriptive pamphlet sent free on receipt of stamp by A. H. DIXON & SON, 305 KING ST. WEST, TORONTO, CANADA.\nYOUNG MEN!\n\nWhen you want to get a Suit, a pair of Pants, or anything in the Clothing Line, call at JAMIESON'S, and there you will find a large assortment of\n\nREADY-MADE CLOTHING\n\nIn all the Newest Patterns and Styles.\n\nALSO A\n\nFine Choice of Tweed Suitings, Overcoatings, Corkscrews, Diagonals, Trowserings, Etc., Etc.,\n\nWHICH WE CUT AND TRIM IN FIRST-CLASS STYLE.\n\nFit and Workmanship Guaranteed.\n\nWE ALSO CARRY THE\n\nLARGEST STOCK OF GENTS' FURNISHINGS\n\nIN CANADA.\n\nP. JAMIESON,\n\nCorner Yonge and Queen Streets,\n\nTORONTO.\nVOLUNTEERS\nINSURED IN THE\nCONFEDERATION LIFE ASSOCIATION\n\nWere Allowed by the CONDITIONS OF THEIR POLICIES to Engage in\nthe Suppression of the North-West Uprising WITHOUT\nPERMITS or the PAYMENT of an\nEXTRA PREMIUM.\n\nThis Association's Loss in consequence of the rebellion was\n$4,000—$1,000 on the life of the late Robert Middleton, Jr., who\nwas killed at Duck Lake, and $3,000 on the life of the late F. A.\nSmart, who was shot while on guard duty at Battleford.\n\nThe Confederation Life merits the patronage of all classes,\nbecause there is no Company doing business in Canada which can\ngive superior advantages to its policy-holders.\n\nThe Confederation Life, through careful and successful man-\nagement, has not only been able to declare larger profits than any\nother Company, but actually holds for the security of Policy-\nholders a much larger sum than is called for by the Insurance\nDepartment of Ottawa.\n\nThe rates are as low as in any Canadian Company and lower\nthan in Foreign Companies.\n\nPolicies indisputable after being 3 years in force.\nLife and Endowment policies non-forfeitable after 2 years.\nProgress unexampled among Canadian Companies.\n\nPOSITION AT END OF 13TH YEAR.\nInsurance in Force, $12,370,185\nAssets, $1,415,944\nIncome, $428,035\nSurplus above all Liabilities to Policy-holders, $268,736\n\nAgents in all Provinces of the Dominion.\n\nHEAD OFFICE, TORONTO.\n\nPRESIDENT—SIR W. P. HOWLAND, K.C.M.G., C.B.\nVICE-PRESIDENTS—HON. WM. McMASTER, WM. ELLIOT, Esq.\nMANAGING DIRECTOR, J. K. MACDONALD", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001326.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 32610, "total-output-tokens": 11574, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 51, 1], [51, 412, 2], [412, 1002, 3], [1002, 1247, 4], [1247, 1653, 5], [1653, 4038, 6], [4038, 7050, 7], [7050, 11098, 8], [11098, 14480, 9], [14480, 18234, 10], [18234, 21958, 11], [21958, 25746, 12], [25746, 29360, 13], [29360, 32714, 14], [32714, 37279, 15], [37279, 41465, 16], [41465, 44270, 17], [44270, 45167, 18], [45167, 47308, 19], [47308, 47720, 20], [47720, 48244, 21], [48244, 49749, 22]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]