[{"id": "841cef9d868379445acc9e22505a0f6b7e92252e", "text": "RIEL\n\nPATRIOTISME\n\nvs.\n\nLOYAUTÉ\n\nPAR\n\nJULES DERIARES.\n\nPRIX : 10 CENTINS.\n\n1885\nPATRIOTISME VS. LOYAUTE.\n\nJe n'ai jamais pu comprendre la manie de nos hommes d'état (?) Canadiens-Français de proclamer en toute occasion la loyauté de leurs compatriotes à l'Angleterre, et pourquoi ils remercient avec une si tendre effusion cette généreuse Albion des libertés qu'elle a daigné nous accorder.\n\nLoyaux, les Canadiens-Français ? Oui, mais à la France, à leur langue, à leur religion !\n\nNous n'aimons pas les Anglais. Leur morgue insipide, leur dédaigneuse fierté, leur orgueil, leur égoïsme, n'a jamais été et ne peut aller au tempérament canadien, ouvert, franc, joyeux et libéral. Les deux races, depuis plus d'un siècle d'existence commune, n'ont pu s'assimiler, n'ont pu s'aimer, n'ont même pu s'estimer.\n\nC'est en vain qu'on parle de la sympathie qui unit ces deux éléments. Cette sympathie n'existe nulle part, si ce n'est dans l'imagination de quelques-uns d'entre nous aveuglés par l'intérêt ou décorés d'un ruban, d'une croix ou d'un titre.\n\nQue les Anglais assistent à une réunion publique où les mérites de la France et de l'Angleterre seront discutés, les applaudissements frénétiques qui accueilleront le défenseur de notre ancienne\nmère patrie les convaincront de notre profonde indifférence, pour ne pas dire plus, pour leur pays.\n\nRemercier l'Angleterre de sa libéralité ? C'est oublier bien vite, il me semble, les sombres pages de notre histoire de 1837-1838 ! Remercier l'Angleterre ? Pour les assassinats de Duquette, de DeLorimier, et de nos autres martyrs ? La remercier de ses persécutions d'un siècle, de sa domination tyrannique, de sa haine contre tout ce qui nous touchait, la remercier d'avoir voulu faire de nous une race de parias !\n\nRemercie qui voudra, je n'en suis pas.\n\nDes canadiens rendent hommage à l'Angleterre pour avoir doté le Canada du gouvernement responsable ! Lui devons-nous de la reconnaissance pour l'accomplissement d'un devoir, que dis-je, pour l'établissement d'un système accompagnant l'acte d'union passé pour nous écraser ?\n\nÉcoutons Garneau à ce sujet :\n\n\"La loi de l'union adoptée par les deux chambres mit fin, en recevant la sanction royale, à l'acte de 1791 passé pour soustraire à la domination des Canadiens-Français la petite population du Haut-Canada et réinvoyé pour mettre ces mêmes Canadiens-Français sous la domination de la population anglaise qui devenait plus nombreuse.\n\nSi donc nous jouissons d'un gouvernement responsable, c'est que dans l'esprit de ceux qui l'établissaient nous devions y trouver l'anéantissement de notre nationalité. \"Timeo Danaos et dona ferentes.\"\n\nPeut-on en venir à une autre conclusion que celle de Garneau, lorsqu'en 1838 le \"Herald de\nMontréal,\" représentant le sentiment anglais, disait : \"Nous avons vu la nouvelle potence faite par M. Bornezdon et nous croyons qu'elle va être élevée aujourd'hui en face de la nouvelle prison, de sorte que les rebelles pourront jouir d'une perspective qui ne manquera pas sans doute d'avoir l'effet de produire un sommeil profond et des songes agréables. Six ou sept pourront s'y trouver à l'aise, mais un plus grand nombre pourra y trouver place dans un cas pressé.\"\n\nQue les événements se répètent et on verra se répéter le même langage odieux.\n\nHélas! les mêmes événements viennent de se répéter, et le même fanatisme a éclaté de tous côtés et les Anglais frustrés une fois dans leur projet de vengeance tiennent entre leurs mains ce pauvre Riel qui mourra sinon martyr de sa bonne foi et d'une juste cause, du moins victime de la haine anglaise.\n\nJe ne veux pas dans un cadre aussi restreint discuter le soulèvement des Métis. D'ailleurs à quoi bon la discussion ? Je ne convaincrais pas les Anglais, et les Canadiens indifférents me répondraient que Riel est un insensé.\n\nJe m'en doutais bien un peu par la confiance absurde en la justice anglaise qui l'a engagé à se livrer, mais sa folie ne change pas la question nationale. Que les métis soient des ignorants comme on veut l'insinuer, que Riel soit un aventurier, qu'ils aient pris les armes sans raison aucune, en présence des motifs qui font agir les Anglais, notre devoir était de soutenir ces malheureux, nos com-\npatriotes, que l'on persécute uniquement parce qu'ils sont Canadiens et que la vieille histoire de Scott reste vivace dans l'esprit haineux des Anglais.\n\nScott! Voilà l'explication de ce débordement de fanatisme. Voilà pourquoi grit et tory d'Ontario et des Provinces Maritimes ont couru vers le Nord-Ouest pour pendre Riel et exterminer les Métis.\n\nComme l'ardeur de ces braves aurait diminué si les rebelles, comme on tient à appeler ceux qui ont défendu leur propriété et leur liberté par les seuls moyens qu'ils avaient à leur disposition, comme l'ardeur belliqueuse de ces Orangistes aurait diminué si les rebelles eussent été des colons anglais!\n\nMais est-il bien vrai que les Métis se sont soulevés sans cause légitime?\n\nComme question de fait:\n\nIl est indubitable que ces pauvres Métis étaient maltraités et volés par le gouvernement ou ses employés; il est parfaitement reconnu qu'ils n'ont pas de droits politiques; il est aussi prouvé hors de tout doute que depuis plusieurs années le gouvernement, pour toute réponse à leurs justes plaintes souvent rejetées, doublait la police montée pour leur faire sentir le joug de fer auquel il les destinait et sa ferme détermination de les anéantir.\n\nS'il n'y a pas là suffisamment pour autoriser une révolte, autant vaut dire que jamais une population n'a le droit de se révolter.\n\nPourquoi alors ne pas avoir fait face à ce déploiement de souvenirs haineux, pourquoi ne pas avoir pris fait et cause pour les métis?\nLes Canadiens-Français ont bien dégénéré depuis quinze ans, et la cause en est à l'esprit de parti qui prime l'esprit national.\n\nEn 1870, non seulement les Métis avaient nos sympathies, mais nous n'avions pas peur de le déclarer, et en 1885 les libéraux cherchent à faire du capital politique de ces événements malheureux pendant que les conservateurs, pour excuser leur criminelle négligence, prouvent que le cabinet McKenzie a été aussi coupable.\n\nQui le nie ? Pas plus McKenzie que McDonald n'aime les Métis et les Canadiens, et l'un n'a pas plus écouté que l'autre les protestations de cette brave population.\n\nAvant d'appartenir à un parti politique les Anglais sont Anglais et tous et toujours contre nous, à moins qu'ils ne soient intéressés à nous faire des compliments.\n\nSi McKenzie eut été au pouvoir en 1885, les Métis se seraient révoltés tout comme ils ont été obligés de le faire, parce qu'il aurait refusé de reconnaître comme légitimes leurs réclamations. D'ailleurs plus de dissimulation : pour obtenir justice à Ottawa, un canadien-français doit avoir deux fois raison.\n\nLa révolte de 1885 était une guerre de race et dès lors le 65e et le 9e n'auraient pas dû répondre à l'appel du gouvernement fédéral. Ils devaient lui dire : S'il vous faut du sang français, nous refusons de le faire couler ; nous ne voulons pas de guerre fratricide.\n\nEt un tel langage aurait forcé Sir John A. McDonald à régler de suite, et sans effusion de sang les réclamations des Métis.\nCe prétendu sentiment de loyauté dont je parlais en commençant à prédominer, on a voulu se montrer, canadiens plutôt que canadiens-français, le 65e est parti, s'est bravement battu, mais que n'a-t-on pas vu ?\n\nLe même 65e insulté par Toronto, méprisé par Winnipeg, maltraité pendant la campagne, volé de ses provisions par les régiments Anglais.\n\nOn dit même, et je donne les noms pour que les intéressés puissent démentir une aussi odieuse accusation, qu'un des généraux aurait défendu à un M. Chivic, de Québec, de parler français à sa table ! On m'informe que M. Chivic, en canadien sans peur, a noblement refusé d'obéir à cet ordre grossier.\n\nEt les soldats du 65e qui prétendent avoir été contraints de transporter le bagage des soldats anglais lorsque ceux-ci se reposaient bien tranquillement.\n\nÀ l'arrivée du 65e à Ottawa, n'a-t-on pas refusé à la Bande de la Cité, la fanfare du 65e, une place dans la démonstration militaire ?\n\nLes soldats d'Halifax n'ont-ils pas été reçus au Windsor et les nôtres au Drill Hall ?\n\nDes malendendus dira-t-on !\n\nEt les soldats de l'artillerie qui n'avaient pas un drapeau français !\n\nUn malentendu !\n\nEt le bataillon d'Halifax qui chantait à St. Hyacinthe We'll hang Louis Riel !\n\nEt les volontaires de Winnipeg et d'Ottawa qui ont brûlé Riel en effigie !\n\nDes malentendus !\nEt ces lignes insultantes à tout le 65e que je trouve dans le \"Herald\" du 25 Juillet, en parlant de l'artillerie :\n\nNo attempt had been made to come into the City as dirty an' dusty as it was possible to show up in, but on the contrary, every man seems to have done his best to brush up and appear presentable.\n\nEncore un malentendu !\n\nMais un malentendu qui sent d'une lieue son Anglais et son Shepherd. Comme c'est bien reconnaître la valeur des plus braves volontaires du pays. Quels remerciements pour leurs nuits sans sommeil, pour leurs journées sans pain et sans eau, pour leurs marches forcées à travers les bois, les ravins et les marais, pour l'argent qu'ils ont eux-mêmes dépensé pour acheter les guenilles glorieuses qu'ils portaient !\n\nMaintenant, compatriotes du 65e, unissez-vous aux Anglais, fêtez-les, et nous, après ces grossières injures, mêlons les plis du drapeau français au lambeau rouge anglais ! Croyons tous à la sincérité des démonstrations qu'ils ont été forcés de faire.\n\nTous ces malentendus se répètent trop souvent pour ne pas voir qu'ils procèdent du même esprit fanatique, fanatisme qu'il faut détruire par la plus étroite union.\n\nLa province de Quebec est à nous, c'est notre propriété, et disons aux Anglais que nous voulons la garder.\n\nPas de concession : pouvoir absolu chez nous, des gouvernants français partout.\n\nPlus de maire anglais à Montréal, et le drapeau français à l'Hôtel-de-Ville.\nPlus de députés anglais où notre nationalité domine. Un député canadien pour Chateauguay, pour Drummond et Arthabaska, pour Missisquoi, pour Richmond et Wolfe, pour les trois divisions de Québec.\n\nLecture en français des procès verbaux des Conseils municipaux, de l'Assemblée Législative, de la Chambre des Communes, du Sénat.\n\nParlons français quand on paie et ne condescendons à parler anglais que pour recevoir de l'argent.\n\nNe pas imiter M. Beaugrand qui fait un discours en anglais et le repète ensuite en français.\n\nEssayez de n'avoir jamais besoin des Anglais.\n\nNe pas perdre une occasion pour leur montrer que nous sommes plus forts qu'eux, relever une à une leurs impertinences, leurs grossièretés, leurs insultes, leurs accès de fanatisme.\n\nMontrons-nous français dans les moindres détails.\n\nSi les Anglais parlent leur langue dans un de nos banquets, parlons la nôtre dans les leurs.\n\nPlus de Grenier au conseil de ville, plus d'hommes de cette trempe qui s'opposent à l'annexion des municipalités françaises, ne voyant que la question d'argent quand il s'agit d'assurer pour toujours la domination de notre race à Montréal.\n\nNous en avons assez de cette loyauté de commande, de ces souhaits d'union entre deux nations que sépare un abîme de sang.\n\nEt que nos chefs ne faussent plus l'esprit public en se joignant aux Anglais pour chanter\nle God save the Queen en protestant de leur inébranlable loyauté à un pays qu'ils n'ont jamais vu.\n\nN'y avait-il rien de plus ridicule que de voir nos chefs politiques assister, dans le mois de Février dernier, à cette assemblée du Mechanic's Hall convoquée pour célébrer la victoire d'un nommé Stewart sur les habitants du Soudan ? En a-t-on gaspillé de la loyauté, les a-t-on flagorné les Anglais ! On a même feint de croire qu'ils étaient allés dans ce lointain pays pour la cause de la civilisation. Drôle de civilisation que celle qu'on apporte au bout de la bayonnette et qui sort de la gueule des canons !\n\nOn savait fort bien cependant que l'Angleterre ne combat que pour l'extension de son commerce ! Mais il fallait se montrer loyaux.\n\nLes résultats de cette loyauté sont faciles à constater !\n\nJackson, un citoyen de Toronto, un élève de l'université de la même ville, un avocat d'Ontario, le secrétaire de Riel, impliqué dans les mêmes troubles que le chef métis, est acquitté sur la recommandation des avocats de la couronne, tandis que Riel, un élève d'un collège français, un catholique, un canadien, est condamné à mort.\n\nEt avec quelle joie est accueillie la condamnation de ce malheureux !\n\nOh, non ! Ils ne sont pas fanatiques les Anglais. Lisez :\n\nTimes du 3 Août 1885.\n\n\"The Queen City. Riel's sentence approved of.\n\"The verdict of the jury in the Riel's trial is\n\"looked upon here as a just one, and opinions are\nfreely expressed that Riel should suffer the\nextreme penalty of the law. The people are\npuzzled to know upon what ground the jury\nbrought in recommendation to mercy.\n\n_Herald_, 3 Août:\n\"This verdict will, we believe, be considered a\njust one by the great majority of the people of\nthe Dominion\n\n_The Montreal Gazette_, 3 Août 1885:\n\"That Riel is a crank of the Guitean type is\nquite possible, but he is assuredly not entitled to\nother treatment than the murderer of Garfield\nreceived upon the face of the evidence produced\nat the trial. The Government will, doubtless,\nreceive a number of petitions for his reprieve,\nbut in view of the proceedings at the trial, there\ncan be but no conviction in the public mind,\nnamely that the verdict is in strict accordance\nwith the evidence, and that justice has prevailed.\n\nLes orangistes d'Ontario se sont réunis pour\nfêter cette grande victoire et pour engager le\ngouvernement à ne pas écouter favorablement la\nrecommandation du jury.\n\nLa presse canadienne française, incapable\nd'oublier le rôle qu'on lui dicte chaque jour,\ncherche encore à faire du capital politique autour\nde Riel, pour qui on va se hâter sans doute de\nconstruire une potence.\n\nDans un moment aussi solennel \"La Patrie\"\ntrouve le temps d'accuser Sir John et constate\navec plaisir que si Riel est pendu, au moins\nSir John y perdra quelques votes.\n\"La Minerve,\" dans une colonne entière, n'a pu trouver un seul mot pour en appeler sinon à la justice du cabinet fédéral, du moins à sa modération.\n\n\"L'Etendard\" seul proteste : \"Que les persécuteurs aient leur jour marqué en caractère de sang par la main du bourreau : celui de la justice viendra.\"\n\nCe language, suivant les patriotes de \"La Patrie,\" n'est pas français, et l'étranger qui le dit, essaie de faire rire des lecteurs qui espéraient voir dans ce journal un chaleureux appel à la clémence du gouvernement, mais qui n'y ont vu que des farceurs et des politiciens.\n\nNous regretterons peut-être avant longtemps cette profonde indifférence, et plaise à Dieu que nous ne sortions pas de notre apathie pour constater notre ruine complète.\n\nSi jamais la coalition a été nécessaire et possible c'est aujourd'hui.\n\nJULES DERIARE.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001429.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 19970, "total-output-tokens": 4571, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 80, 1], [80, 80, 2], [80, 1242, 3], [1242, 2731, 4], [2731, 4209, 5], [4209, 5678, 6], [5678, 7160, 7], [7160, 8478, 8], [8478, 9909, 9], [9909, 11259, 10], [11259, 12644, 11], [12644, 14051, 12], [14051, 14884, 13]], "primary_language": ["fr", "None", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "en", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]