[{"id": "0b3bac3ef7f955c7ac8cb017aa875a0751682de4", "text": "INTERIM REPORT\nOF THE MANAGEMENT OF\nTHE\nTemperance Colonization Society\nLIMITED.\nCONTAINING IMPORTANT\nJUDGMENT Re SCRIP,\nAND\nOTHER INFORMATION\nFOR\nSHAREHOLDERS AND SCRIPHOLDERS.\nSEPTEMBER, 1885.\n\nHead Offices:\n114 AND 116 KING STREET WEST,\nTORONTO.\n\nHUNTER, ROSE & CO., PRINTERS, TORONTO.\nTHE CITY OF SASKATOON,\n\nTHE PROPOSED METROPOLIS OF THE TEMPERANCE COLONY,\n\nIS SITUATED ON THE SOUTH SASKATCHEWAN RIVER.\n\nWhere the commercial necessities of the Great North-West will necessarily centre to a considerable extent. The amount of the patronage already guaranteed to the Colony, consisting of purchases and applications for Lands, will necessitate many Settlers and their families, thus giving every security for its importance. It is most beautifully situated, and in respect to site and natural advantages is unequalled by any other City in the North-West. 200 Lots were offered free to actual settlers and many taken up. The balance of the City lots will be sold at prices ranging from\n\n$60 to $100 EACH.\n\nWATER LOTS AT SPECIAL PRICES.\n\nTerms:—20% Cash down; balance at 6½% interest on time agreed. Lots 25x140 to lane 15 feet wide; Streets 66 to 90 feet wide.\n\nDon't fail to avail yourself of this chance.\n\nAddress,\n\nC. POWELL, Manager,\nTemperance Colonization Society (Limited),\n114 King Street West, Toronto.\nThe Defendants were incorporated by Letters Patent under the provisions of the Act of 1877, done on the 14th day of March, 1882. The action is for a rescission of a contract entered into by the Plaintiff with the Defendants, and for the repayment of certain moneys which were paid in pursuance of the contract, amounting to $128, and certain expenses, which amount to the sum of $25, and for such other relief as the Plaintiff may appear to be entitled to. Owing to the merely historical and loose manner in which the Plaintiff has stated his claim, some difficulty is found in ascertaining any precise point of attack upon the Defendants such as one would expect in a case where the Defendant is really charged with fraud or fraudulent misrepresentation. The Plaintiff, however, sets forth in his pleading, a contract entered\ninto by him with the Defendants, and I glean that this is the contract the rescission of which he desires. This is in the form of a subscription list and is as follows:\n\n\"TEMPERANCE COLONIZATION SOCIETY.\n\n\"Whereas the Canadian Government have signified their approval of an application made to them for a grant of a large, choice, compact tract of land in the North-West for a Temperance Colony, on condition that the same be fully paid for in cash on delivery, and that certain expenditures be made, and improvements guaranteed such as rail or water communication with the general commercial system outside, and, whereas, the applicants, and other capitalists combined hereinafter, called 'The Board of Management,' are undertaking to provide the necessary funds to meet such payment and other disbursements required by the government, and are willing, if they can complete the scheme, to sell out shares to the extent of one third of such tract and representing an average third that is to be selected by the subscribers hereto from such tract before the last third, and after the first third, at $2 per acre, unencumbered with any such liability to Government for railway and expenses as aforesaid, and to devote as conditional with the Government whatever net profits they may realize from the subscription and the sale of the remaining third, over and above the first cost of the lands, and expenditures, aforesaid, to further general improvements under a joint management, to be chosen by the subscribers or settlers\ngenerally, and to assist the early settler with necessary supplies at minimum cost. Therefore we, the undersigned, agree to take of the lands on conditions as above set forth, subject to Government terms as to settlement, and subject always to restrictive clause in conveyance prohibiting all importation, or traffic in, or manufacture of, or storage of any kind of alcoholic liquors or intoxicants on these lands, or any part thereof, forever, the number of acres set against our names, respectively, and to pay for the same to the board of management, or their lawful representatives or successors, at the rate of $2 per acre. One tenth, when the board of management are prepared to take the land from the Government and give title; and one tenth each and every year thereafter, with interest annually on the unpaid balance, at the rate of six and one half per cent., with the option of making any further payment in part, or in full at such times. Subscribers are to have choice according to actual date of subscriptions.\"\n\nOn the fifth day of November, 1881, the Plaintiff signed this, agreeing to take 320 acres at the sum of $640. This was while the Defendant Company was being promoted, and before its incorporation. It was shown and presented to the Plaintiff by Samuel Hicks, who was acting in the locality of Seaforth in some ways for the promoters. This paper is put in evidence and marked Exhibit K. The Plaintiff says that this and another document, marked Exhibit J, are the only papers he saw before signing, so far as he can recollect. In his\npleading he says that he is and has for many years been in favour of what is known as the Temperance Movement or Reform against the manufacture, sale, and use of intoxicating liquors, and that he, accordingly, at the request of the Defendants, became a subscriber for one half section so subscribed for to be thereafter selected by him. In his evidence before me he said that when he signed he did not take into consideration the locality of the land, that he had no choice of location, and that he wanted to assist the Temperance cause and to get a home for his family where liquor would not be sold, that, in his case, Temperance meant Prohibition, and that he did not know of the Statute respecting prohibition in the North-West Territory. He also said that at the time he subscribed he had no notion of going to the North-West. In his examination before the trial he says that he met Hicks when he (Hicks) was soliciting subscriptions and that what Hicks represented to him was that he thought it would be a good speculation or investment, or to this effect. He also says that when he signed the subscription list he had no definite idea about the proposed Colony. At the trial there was much discussion in respect to this Exhibit J, it, and the subscription list, itself, being the papers that were seen by the Plaintiff before the time of his entering into the contract. It is a somewhat voluminous document. It is, however, necessary to set forth parts of it, and other parts I will refer to in a general way. It bears date, the 12th day of October, 1881, less than one month before the date of the Plain-\ntiff's subscription. After naming various provisional officers of the organization, it proceeds as follows:\n\n\"PROSPECTUS.\n\n\"The object of this Society is to colonize a tract of land in the North-West Territory, furnishing lands to actual settlers at cheap rates with a provision that such settlement shall be kept free from all intoxicating liquors. An application has been made to the Dominion Government of Canada, for a compact, choice tract of land, comprising about 2,000,000 acres for this purpose. And the Government has replied favourably to the terms offered, which is to allot lands to subscribers under specially favourable conditions. The Management are prepared to provide facilities for reaching the same. The best agents from Europe, United States, and Canada will be employed to select from the entire unsurveyed lands of the North-West Territory, land favourably located commercially, and having the best soil, water, and timber advantages and other desiderata necessary to a successful settlement and permanent prosperity. No reasonable pains will be spared to accommodate in establishing themselves in their new home, where the Management hope they will soon enjoy the blessings of a large and harmonious community free from the dissipations so commonly attending the severing of old ties and the formation of habits in a new country. Great advantage will be derived from this manner of settling a new colony having the social, commercial and other privileges of an\nold settled community. It is an acknowledged fact that our great North-West is destined, at no distant day, to be the wheat-growing centre, and the garden of the world, and it is to be hoped that this large, compact settlement in the choicest part of the territory will become an important controlling centre of a future Province noted for the sober habits, enterprise, and virtue of its people. The Management for the present will take subscriptions for lands in this tract at $2 per acre, and on easy terms of payment; ten per cent. in cash, and ten per cent. annually thereafter, until paid with interest on unpaid balance at the low rate of 6½ per cent. with the privilege of paying sooner if desired. They hope to be prepared to give titles inside of a few months or as soon as the lands are subscribed for, when the first payment of ten per cent. will be required.\n\n\"Toronto, 12th October, 1881.\"\n\nThen follows, under the heading or caption of opinions, a clipping from the inaugural address of the Society, said to have been delivered by Principal Grant, of the Queen's College, from the grand stand of the amphitheatre of the Exhibition grounds on the 14th September, 1881; a short comment, or a clipping from a comment, upon that address taken from the Mail newspaper of the 16th of the same month, and another short cutting from the same newspaper of the 24th of the same month; an extract from a communication to the Christian Guardian by Dr. Hunter; an extract from the Evening News newspaper, 28th of the same month of September; a\nshort reference to a very valuable article contained in the Evening Telegram of the 21st of the same month; a copy of a resolution said to have been passed by the Ontario Grand Delegated Temperance Convention, held in Hamilton on the 16th of the same month; an extract from the Globe newspaper of the 12th of the same month; and a reference to the Governor-General's great speech on the North-West, delivered at Winnipeg on the 11th October, said to have been reported in full in the Globe newspaper of the 12th October, 1881; and a valuable article, in the same number of that paper, on the Temperance Colonization Society.\n\nThen follows a series of seven questions and answers. Counsel for the Plaintiff attached particular importance to the sixth of these, which is, \"What security have you that you will get the land?\" Ans. \"The official assurances, in writing, of the Minister of the Interior, who represents the Government in the sales of lands, and is backed by a Government quite capable of performing their undertakings.\"\n\nThe document appears to be signed by the President and Secretary, and to it is attached a copy or form of a subscription list, substantially the same as the one above set forth as being the one signed by the Plaintiff. Now, as it was in effect, as I understood the matter, contended that this document J was false and fraudulent, and was a principal inducement, if not the sole inducement, by way of representation to the Plaintiff, to cause him to sign the contract above referred to and set forth, it will\nbe necessary to look (and I will do it as briefly as possible) at what had occurred, or taken place between the Government and the Association before the document was published. On the 29th of August, 1881, a memorandum of application had been sent by the Association to the Government. To this were signed, as appears by the copy in my hands, eight names, amongst which were the names of the President and Secretary. The memorandum was as follows:\n\n\"Memorandum of application of the provisional representatives of a proposed Temperance Colonization Society to the Government of Canada.\n\n\"Whereas it is desired amongst the members of our various Temperance organizations of Canada to found and establish a settlement or colony where Temperance principles shall prevail exclusively, and, whereas, they believe such an allotment of land as will be suitable for their purpose may be found in the unsurveyed portion of the North-West territories. They desire, therefore, that a block of land for such purpose, of about the area of a degree each way, in some convenient form, may be granted in such locality as may be selected by the applicants within the unsurveyed territory of the North-West, at the rate or price of one dollar per acre, deducting therefrom the acreage of the water and waste lands within the block, payment for such land to be in cash on the location of the lands.\n\n\"One year to be allowed in which to complete the preliminary arrangement and implement the agreement.\"\nwith Government, provided the promoters proceed at once to work out and thoroughly advertise the scheme as hereafter proposed.\n\n\"Should the Government be disposed to encourage the enterprise and grant this application, the applicants are prepared to and will advertise the undertaking by sending pamphlets, circulars, and other printed matter into the numerous Temperance organizations in Canada and the United States, with a prospectus showing the advantages offered for settlement on our Western lands, and offering a scheme whereby subscribers to stock in the undertaking may obtain lands on advantageous terms, and any surplus receipts, after paying the incidental expenses of management, advertising, colonising, and the like, being expended in the improvement of the general property under a management chosen by the shareholders.\n\n\"They will place each year, or in a term of years on the lands so to be granted, such a number of settlers as may be agreed on between the management and the Government.\n\n\"They will build, or cause to be built, when required, a good and sufficient Railway, connecting the Colony with some main line of Railway, or some branch thereof, or thoroughfare by water.\n\n\"In case the applicants, after thoroughly advertising the lands as aforesaid, fail to secure a sufficient number of stockholders to take the lands, and meet the said requirements of the Government, the Government to have the option of furnishing them with so much of the land\nas they may be prepared to take on the same terms, or withdrawing the grant altogether.\"\n\nRespectfully submitted this 29th day of August, 1881.\n\nThere can, I think, be no doubt that what the applicants meant by this application was a compact block of land.\n\nThis application was, as I understood, at the trial accompanied by a letter from Mr. Meek. This letter is not before me, for some reason; it was spoken of at the trial, but I do not find it amongst the papers in the action.\n\nOn the first day of September, 1881, an answer or reply was sent by the Minister of the Interior (acting) addressed to Mr. Meek, which was as follows:\n\n\"OTTAWA, Sept. 1st, 1881.\n\n\"Sir,\n\n\"I beg to acknowledge the receipt of your letter of the 29th ult., together with the application of certain gentlemen who are desirous of founding in the North-West territories a Temperance Settlement or Colony, and with that object in view, wish to obtain an allotment of land, of about the area of a degree each way, in a portion of the Territories which has not yet been surveyed. I beg that you will assure the applicants that every reasonable effort will be made to facilitate their object. I am of opinion that under clauses 14 and 15 of the land regulations, of which I enclose copies, the plans of the proposed Society may be carried into effect, and that if any of these regulations should have to be modified, the\nmodification will be so unimportant as to permit of its being made by the Governor-in-Council.\n\n\"I can, at all events, assure you that the Government will be anxious to do all that can be conveniently done to meet the wishes of the gentlemen on whose behalf you have communicated with me.\"\n\n\"I have the honor to be, Sir,\" &c. &c. &c.\n\nThe area of land asked for by the application was larger than 2,000,000 acres. The subsequent correspondence (which took place after this) but not till after the Plaintiff has entered into the contract, mentions the 2,000,000 acres. Now, can it be said that the prospectus issued on the 12th of October, 1881, some six weeks after the receipt of this letter, nothing to the contrary having intervened; was false, deceptive or fraudulent, and this in such a sense as to constitute a ground for the rescission of a contract?\n\nFirst, as to the main body of this prospectus. The passage that was most discussed was this: \"An application has been made to the Dominion Government for a compact, choice tract of land comprising about 2,000,000 acres for this purpose and the Government has replied favourably to the terms offered.\" Can it be said that this was not substantially, if not literally, true? I think it cannot. What precedes this is a statement of the object of the organization, and I do not see that this can, on the evidence, be characterized by want of truth or fraud. The remainder of this main body of the prospectus seems to be promissory in character, and expres-\nsive of hope in the future for the contemplated Colony. Then, as to the references to the speeches and writings of distinguished gentlemen, and the publications in newspapers, there was no pretence that these were untruthfully placed in the prospectus. It was not denied that the facts did take place as stated in the prospectus. There does not appear to me to have been any undertaking by the promoters of the Company as to the accuracy of what was stated or written by these gentlemen, or in the newspapers, and it was not shown that any part of what was said or published was untrue, or inaccurate, at all events not inaccurate in such a sense as to justify one in saying that it was an untruth. Then as to the part of the prospectus under the heading\n\nQUESTIONS ANSWERED.\n\nQuestion and answer No. 6, the one that I before referred to, was the one point spoken of at the trial. A perusal of the letter from the Minister of the Interior should be satisfactory on this subject. A condition in the contract, that signed by the Plaintiff was that it was \"subject to Government terms as to settlement,\" and subject always to restrictive clauses in conveyances as to intoxicating drinks. By this he had notice that what he was to get would be as to settlement subject to the Government terms and he was bound to accept a conveyance with the restrictive clause in it as to intoxicants. The inducements held out to the Plaintiff to sign the contract were (on his own showing) the perusal of this pro-\nspectus and Hicks telling him that it would be a good investment, and after a perusal of the whole of the documents and evidence, I am of the opinion that the signature of the Plaintiff to the subscription, or contract of the fifth day of November, 1881, is not shown to have been improperly obtained, and I think he became bound by the contract when he signed it. I think that there is no pretence for saying that his signature was obtained by fraud.\n\nAfter this, and on the 14th day of March, 1882, the Society became incorporated, as from the beginning intended, and it was not until the 6th day of June, 1882, that their agreement with the Government was consummated.\n\nThere was much correspondence, in the meantime, between the officers of the Government and the Society, and between the Government and well known gentlemen, who, no doubt from the best motives, interested themselves on behalf of the Society. This, or a large part of it was put in evidence. I am not now prepared to say that it was all strictly admissible, but I have perused the whole of it. It was put in at the instance of the Plaintiff, and some of it objected to by the Defendants.\n\nIt seems manifest that the Defendants at the time of concluding the contract with the Government did not obtain all that they expected and contended for. The Government seems to have insisted upon the regulations regarding the odd and even numbered sections, and in\nregard to the even numbered sections only, made the Defendants their agents for the purposes of settlement, and although an area equal to the 2,000,000 acres was in a way set apart for the Defendants, only some 213,760 acres are by the agreement made the subject of it; and the Defendants seem to have paid $84,000 in cash to the Government.\n\nAccording to the evidence of the Minister of the Interior, a change was made in the land regulations such as would enable the Government to make a grant of both the odd and even numbered sections to the Defendants, or to any Company; but he says that this particular change was not acted upon in any instance.\n\nThe Plaintiff complains of representations made to him by the paper, Exhibit L, which is dated the 6th of April, 1882. After the making of the contract, and after the incorporation of the Defendants, and when they wanted payment of the first instalment, but before the consummation of their agreement with the Government. The representations do not appear to be very materially different from the representations made formerly and above referred to. I do not deem it necessary to scan these very closely, because the change, made by the Plaintiff, as he says, in his position, in consequence of them was the payment of the instalment of the money that he, by his agreement, when he signed the subscription list, became bound to pay. The Plaintiff paid this instalment, and got his scrip, which bears date the 10th April, 1882. In the month of June, 1883,\nthe Plaintiff paid another instalment. The scrip, issued by the Society, contains a provision that it may be used for even numbered sections when five payments of $320 have been paid, and on its face says that the right of the holder is subject to the clause in regard to Temperance, before alluded to, and to such settlement duties as will enable the Company to secure from the Government the rebate of $1.00 per acre, as provided for in their land regulations. The Plaintiff says, as nearly as I can make out, that he is dissatisfied because the whole two millions of acres have not been absolutely obtained by the Company from the Government, and because the Company has not obtained an absolute right to both the odd and even numbered sections in the block that they have so obtained, and that by reason of this the provisions contemplated in regard to prohibition can not be with certainty carried into effect, I think he is fairly answered in this way. He signed his contract. No imposition, concealment, or fraud was practiced upon him. He became bound; he became a party to the enterprise. He engaged in it (one is led to believe) as a speculation, as no doubt many others did. The Company, I have no reason to doubt, got from the Government all that they could obtain at the time of the agreement. They had to submit to the terms of the Government, both as to the quantity of land, placed under the operation of the agreement at the time, and, as to the regulations respecting the settlement of the even numbered sections and what he, the Plaintiff, is entitled to is his\nproper rights according to his contract carved out of what the Company has obtained, and may obtain, and if the Company are not awarding him these, or refuse to award them to him, there are no doubt means whereby he can compel them to do so. But I think this is a matter with which I have now no concern, for although the Plaintiff in the event of his not obtaining a recission of his contract and a repayment of the money and expenses mentioned in the prayer of his statement of claim asks such further and other relief as he may appear entitled to, all the evidence having been given with the view of obtaining a recission of the contract and a repayment of the money. I have not before me such evidence as would enable me to arrive at a conclusion as to what in this view are the rights of the Plaintiffs, and, besides, it might turn out that this would be more naturally matter of internal management of the affairs of the Company than matter for litigation. I do not, however, say how this is, one way or the other.\n\nI am, however, satisfied that the Plaintiff cannot succeed upon his contention that the contract should be rescinded, and I am of the opinion that this action should be dismissed with costs.\n\nAction dismissed with costs.\n\nJudgment accordingly.\nTHE TEMPERANCE COLONIZATION SOCIETY,\n\n(Limited).\n\nThe Management think it is due to the Shareholders, and others interested in the welfare of the Society, that they should be made acquainted with what is being and has been done, and that at the earliest opportunity; so that each may, if he thinks proper, express himself and signify his approval or disapproval, as the case may be.\n\nThe following Resolutions were adopted at a meeting of the Board held May 4th, 1885. (Vide Minute Book, page 325):\n\n\"It was moved by Mr. Powell, seconded by Mr. Cooper, and carried—That the individuals who have unlawfully received or appropriated commissions be asked to refund the amounts so received or appropriated, if there be any such, and that the Executive Committee be instructed to investigate the matter and report to this Board.\"\n\nThe following Resolution was moved by Mr. Cooper, seconded by Mr. White, and carried unanimously:\n\n\"Whereas a great dissatisfaction exists amongst many of the Shareholders of this Society at what they deem to be the advantageous position held by other Shareholders of the Society, such dissatisfaction operating to the detriment of the Society. Be it, therefore, resolved, that a scheme be formulated and suggested to the Board whereby an endeavour shall be made to allay such dissatisfaction,\"\nand place every Shareholder in such a position that no one Shareholder can be said to hold an advantage not possessed or attainable by any other of the Shareholders.\"\n\nOn motion of Mr. Powell, seconded by Mr. Cooper, the formation of the scheme referred to above to be suggested to the Board, was referred to the Executive Committee.\n\nAt a meeting of the Board held 15th June, 1885, the following Report was adopted, G. M. Rose, A. Farley and J. W. Cheesworth, dissenting. (Report, page 327; adopted, page 331 Minute Book).\n\n\"The Executive Committee of the Board of Directors of the Temperance Colonization Society (Limited), pursuant to resolution of the Board, 4th May, 1885 (Minute Book, page 325), beg leave to Report—\n\n\"Ist. That certain Shareholders, acting in the capacity of Directors of the Society in the years 1882 and 1883, made calls on the Shareholders of the Society amounting in all to Twenty Dollars ($20) a Share.\n\n\"2nd. That said Shareholders themselves, and certain others have not paid said calls, but have endeavoured to satisfy said calls by applying thereon certain credits of no value, and for which the Society received nothing.\n\n\"3rd. We think that such credits must be regarded as nullities, and said calls as unpaid.\n\n\"4th. Because such preferential arrangements, if allowed to prevail, will bring about the insolvency of the Society, defraud the creditors, and work intolerable wrong to the cash contributors to the capital of the Society.\n\n\"5th. And having now become aware of the true state of affairs, we think it is imperative on the Board to take\nsteps to avert calamity, to rectify as far as possible the wrong done, and to recover sums illegally abstracted, if any.\n\n\"6th: We make the same report in regard to commissions as to wrongs and remedies.\n\n\"7th: That the Books be corrected in accordance here-with.\"\n\nIn accordance with the above Report, and by further orders of the Board, the Books of the Society have been corrected so far as to show the Society to be in a flourishing and sound financial condition, if only parties thereby shown to be indebted to the Society will discharge their obligations; and in any event it should be clearly understood that the Society is able and willing to carry out all its engagements; and Scripholders especially are requested to take notice and govern themselves accordingly; as where parties are in arrear the amounts must and will be collected.\n\nPlease address all communications to\n\nC. POWELL,\nManager, T. C. S. (Limited).\n\n114 King Street West,\nToronto.\n\nN.B.—Scripholders are again reminded of the desirability of an early application for Location of Land under Scrip held by them.\nTHE HEALTHINESS OF THE NORTH-WEST.\n\nFrom the Daily Globe, 28th July, 1885.\n\nOne thing in regard to the North-West has been put beyond all reasonable question, and that is the noticeable healthiness of the country. Some of our Conservative contemporaries are even inclined to put this as a per contra in favour of the Government which they love so well, and from which they have profited so largely. We cannot go that length, but we frankly acknowledge that the casualties of the campaign, apart from deaths and wounds received in battle, have been far fewer than they would have been had a similar four months of campaigning been gone through even in Ontario.\n\nWhen one considers the comparatively unprovided fashion in which the Volunteers were sent to the North-West; the hardships which from the very first they were called upon to pass through, the marches they had to make, the food they had to eat, the battles they had to fight, it is a surprise, and a most gratifying one, to mark how little sickness there has been among these unseasoned troops; how wounds have healed \"on the first intention;\" how mere lads have \"filled up\" in spite of all the fatigues and exposures of active service; and how those who went away comparatively delicate return hearty and vigorous.\n\nWe frankly acknowledge that taking the experiences of other campaigns as our guides, in estimating the probable outcome of the disturbance we have been mistaken in our forecasts, and most agreeably so.\n\nThe proof thus afforded of the abnormal healthiness of the North-West is beyond all reasonable question.\n\nLet any one call to remembrance what resulted from the short campaign in 1866, when the Fenian raid took place. There were young men not for months, but for years after dying of consumption caused by exposure at that time. In ordinary cases it is calculated that in every war the number of deaths from exposure and disease thereby induced is always double that which takes place in actual fight, often greatly more, while the percentage of the wounded who usually die is immensely greater than in this particular case. Perhaps there is not another country in the world where in similar circumstances and with similar unseasoned troops the same favourable results could have been shown.\nAnd if this affords splendid and unimpeachable evidence of the healthiness of our North-West, it shows quite as unmistakably that Canada can grow young men of special pluck and vigour.\n\nWe don't believe in any such expensive way of testing the healthiness of a country, but at least this one good thing, we gladly take advantage of, and are only too happy to give that country, which has suffered so much during these past months, all the advantage it can possibly derive from such a splendid and unimpeachable certificate, secured though it be by such a formidable sacrifice.\n\nEMIGRATION\n\nTHE CANADIAN NORTH-WEST.\n\nTHE TEMPERANCE COLONY.\n\nThe Temperance Colonization Society (Limited), offers peculiar advantages to emigrants:\n\n1st. They give 160 acres free to actual settlers.\n\nThe land is ready for immediate cultivation, and while it is acknowledged to be one of the most fertile and best wheat growing soils in the world, it is suitable for raising every kind of crop upon which the farmer or the family has to rely. It is also peculiarly adapted for grazing and cattle raising.\n\n2nd. The climate is bracing and healthy. The spring and harvest operations are uninterrupted by rain, while there is sufficient moisture to promote rapid vegetation. The summer is never disagreeably hot, while the winter, though cold, in consequence of the dryness of the atmosphere is not only unattended with inconvenience, but is invigorating and enjoyable. The evidence of settlers on this point is unmistakeable.\n\n3rd. Settlers getting the grant of 160 acres have a right of pre-emption, that is a right to purchase the quarter section, or 160 acres adjoining their free grant at the government valuation.\n\n4th. Water is abundant over all the territory, and there is an ample supply of fuel. For building purposes there is sufficient wood, and there are also extensive clay fields suitable for brick making, which are in course of being utilised.\n5th. The magnificent Saskatchewan river running through the territory gives important facilities for water carriage.\n\n6th. The exclusion of intoxicants from the Colony is a feature which must commend itself to all:\n\nThe City of Saskatoon, the Capital of the Colony is charmingly situated, and in a very few years will add another to the now rapidly developing centres of the Canadian North-West.\n\nEvidence in favour of the Canadian North-West as a field for emigration is accumulating every day. The disparaging reports so industriously circulated by interested parties have been most satisfactorily answered and contradicted. In fact they are shown to be destitute of foundation. The Report on Canada by Professor Tanner, F.C.S., Senior Member of the Royal Agricultural College, etc., etc., is the most perfect refutation of these reports. He says of them, after stating the result of his careful inquiries: \"These facts, which came under my own observation, compel me, therefore, to state that the unfavourable reports upon Canada which have been published in this country do not fairly represent the condition of affairs in Canada.\" But the positive evidence of the real state of matters as found by the Professor is the best answer to these reports. The whole passage is worth quoting. He says:\n\n\"Throughout the whole of this lengthened tour of inspection I found those settled upon the land happy, prosperous and healthy. After conversing freely with large numbers of these settlers, I am able to state that I did not meet with a single instance in which they were not fairly successful, contented, and full of hope for the future. They worked hard, it is true, but that labour was sweetened by the knowledge that they were improving their own property. Their personal requirements were easily provided for by the aid of a rich and productive soil.\"\n\nSpeaking of the ultimate results of opening up these prairie lands, the Professor concludes this part of his notice as follows: \"Here then, wheat lands are available which even the strongest opponent of Canada must admit are unsurpassed in the world, and as these become occupied by successful cultivators, they will not only produce an enormous amount of freight for the railway, but they will become large consumers of manufactures, and they will give a power to Canada in which every patriot will rejoice.\"\n\nA large number of persons are deterred from enjoying the benefits of this grand country from want of training in the art of farming. Read what Professor Tanner says on this point:\n\n\"Dealing, as the operations of the field and the garden here do, with a rich and generally deep virgin soil of remarkable fertility, there is less necessity for that refinement of good husbandry which is so important in exhausted, or even partially exhausted soils.\"\nThe rough culture which some of the lands here receive, especially from those who have never held a plough before, seems to command the special sympathies of Nature, and luxuriant crops smile favourably upon the efforts even of inexperienced farmers.\n\nThe climate is strongly commended. The description of the winters concluding as follows:—“The winters here are very pleasant and bracing, proceeding from the same cause, namely, the dryness of the atmosphere.” In everything that can commend itself to the intending emigrant the Temperance Colony is unsurpassed.\n\nFor particulars apply to\n\nC. POWELL, Manager,\nTemperance Colonization Society (Limited),\n114 King Street West,\nTORONTO.\nCANADA\nWANTS YOU AND ALL YOUR FRIENDS TO GET A\nCHEAP HOME\n—IN—\nHER GREAT NORTH-WEST,\nWhile the land is yet cheap and Homes so readily made.\n\nTHE\nTemperance Colonization Society,\nLIMITED\nHave beautiful Prairie Land in the\nFamous Valley of the South Saskatchewan River,\nWhich runs through the Tract from South-west to the North-east.\nThese Lands are now offered to actual Settlers on the most favourable terms.\n\nWEALTH AND HAPPY HOMES\nAre within the reach of all willing to take them.\nAddress for further particulars—\n\nC. POWELL, Manager,\nTemperance Colonization Society (Limited),\n114 King Street West,\nTORONTO, ONT.\nTHE Temperance Colonization Society\n\nAFFIRM THAT:\n\nNo better opportunities exist in the North-West for the selection of Homes.\n\nNo poor man can achieve independence more quickly or surely elsewhere.\n\nNo man of ordinary intelligence and industry can fail to do well.\n\nNo other portion of the North-West offers MORE natural advantages with less disadvantages.\n\nNo better climate can be found in the North-West.\n\nFamilies and their friends can locate close together.\n\nHomes can be made where the inhabitants will be forever free from the accursed Liquor Traffic, which means prosperity, happiness and safety.\nA PRAIRIE FARM AFTER A SINGLE YEAR'S WORKING.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001549.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 44380, "total-output-tokens": 9025, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 289, 1], [289, 1315, 2], [1315, 1315, 3], [1315, 1315, 4], [1315, 2142, 5], [2142, 3665, 6], [3665, 5224, 7], [5224, 6837, 8], [6837, 8322, 9], [8322, 9867, 10], [9867, 11407, 11], [11407, 12892, 12], [12892, 14368, 13], [14368, 15761, 14], [15761, 17273, 15], [17273, 18769, 16], [18769, 20196, 17], [20196, 21705, 18], [21705, 23286, 19], [23286, 24552, 20], [24552, 25873, 21], [25873, 27455, 22], [27455, 28540, 23], [28540, 30812, 24], [30812, 32749, 25], [32749, 35564, 26], [35564, 36249, 27], [36249, 36865, 28], [36865, 36865, 29], [36865, 36865, 30], [36865, 37471, 31], [37471, 37516, 32]], "primary_language": ["en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true]}}]