[{"id": "8a3cfb3c529754fa1a72dc5bb41022964ee50fa3", "text": "Moose Jaw Board of Trade\n\nThe District of Moose Jaw as a field for emigration\nMEAT MARKET\n\nOF\n\nHUGH FERGUSON\n\nDealer in all Kinds of Beef, Pork, Mutton, Veal, Etc., Fish and Game in Season. Meat Delivered to any part of the Town.\n\nCOUNTRY ORDERS PROMPTLY ATTENDED TO.\n\nJAMES BRASS,\n\nCONTRACTOR AND BUILDER\n\nESTIMATES,\n\nPlans and Specifications Furnished\n\nSASHES AND DOORS MADE TO ORDER.\n\nAll Work Guaranteed.\n\nRIVER STREET, EAST, MOOSE JAW.\n\nH. U. RORISON,\n\nGrain Commission Merchant\n\nMOOSE JAW, N.W.T.\nTHE\n\nDISTRICT OF MOOSE JAW\n\nNORTH WEST TERRITORIES,\n\n—AS—\n\nA FIELD FOR EMIGRATION.\n\nPrepared by the Moose Jaw Board of Trade, and issued with the approval of the Moose Jaw Agricultural Society and the Council of the Town of Moose Jaw. Signed on behalf of the Board of Trade by\n\nE. N. HOPKINS, Secretary.\n\nJ. G. GORDON, Chairman.\n\nOn behalf of the Moose Jaw Agricultural Society by\n\nSAMUEL K. RATHWELL, President.\n\nOn behalf of the Council of the Town of Moose Jaw by\n\nJ. T. SIMPSON, Mayor.\n\nIssued the 18th day of January, 1889.\n\nWINNIPEG:\nTHE CALL PRINTING CO.\n1889\nGilmour's Harness Emporium\n\nPRICES:\n\nSingle Harness from $12.00 up.\nTeam Breeching Harness, $32.00 to $35.00.\nHip Strap Harness, $27.00 to $33.00.\nOx Harness, $10.00 to $14.00.\n\nAll work guaranteed and exactly suited to the requirements of this country. No factory Harness. All manufactured at home. Intending settlers will save money by reserving orders for us.\n\nOn arriving call at once at Gilmour's Harness Emporium,\nMAIN STREET, MOOSE JAW.\n\nG. M. ANNABLE,\nIMPORTER AND DEALER IN\nALL KINDS OF LIVE STOCK\n\nKeeps Constantly on hand a Careful Selection of Heavy Draft and Carriage Horses and Ponies. First Class Brood Mares, Working Oxen, Polled Angus and Durham Cattle at prices to suit Purchasers. Milk Cows for Sale.\n\nCorrespondence Solicited.\n\nProprietor of Main Street Sale Stable.\nTHE DISTRICT OF MOOSE JAW.\n\nITS SOIL AND CLIMATE.\n\nITS AGRICULTURAL AND GRAZING RESOURCES.\n\nThe District of Moose Jaw comprises, according to the distribution of this part of the Northwest Territories which was made by the Northwest Council in 1885, that part of the Territories which lies along the main line of the Canadian Pacific Railway extending from range twenty-three to range twenty-nine, inclusive, west of the Second Principal Meridian. The following stations and sidings on the Canadian Pacific Railway are located therein: Belle Plain, Pasqua, Moose Jaw, Boham and Caron.\n\nThe settlement of it commenced in 1882. During that and the following year, a considerable quantity of the land therein was taken up by immigrants who were chiefly from the Eastern Provinces of Canada. A very large quantity of government land yet, however, remains for entry by settlers, some of which lies within a short distance of these stations and sidings. The newcomer who does not desire to comply with the government regulations as to residence and cultivation (although these are by no means onerous, and by the bona fide farmer will be regarded as imposing upon him nothing more than he would do apart from their being exacted of him by the government) can purchase C. P. R. or other lands which are in the market and well situated.\n\nC. P. R. LANDS.\n\nAs is generally known, every alternate section (that is 640 acres) belongs to the C. P. R. Co. The great bulk of these lands is still in the possession of the Company. They are at present being held by them at prices varying, according to location, from $2.50 to $5.00 per acre payable as follows: One-tenth cash, the balance in nine equal annual instalments with interest at the rate of six per cent. per annum on the then unpaid principal.\n\nITS SOIL.\n\nThe soil throughout the greater part of this district cannot be excelled for agricultural purposes. This is true of practically all of the\nland lying north of the C. P. R. track (only a very small portion of it here and there being light and stony), and also south of the line of railway for from ten to twenty miles. South of that again, the land is as a whole better adapted for grazing purposes, though excellent agricultural land is also to be found there. The land in the former part of the district—that described as specially adapted for agricultural purposes—varies from a clay loam to clay. The clay land in the Northwest generally, and in this district in particular, does not however bake as a similarly heavy soil would in eastern Canada, but it remains perfectly friable under all circumstances. The prairie here is not by any means the dead level that it is generally understood to be and which it sometimes is elsewhere, but it is usually rolling and has a sufficient slope to at least drain it well. Land better adapted for agricultural purposes cannot be conceived than the bulk of this land—a strong, heavy, deep, friable soil, and many thousands of acres of this land, well situated in every respect, convenient to markets and churches and schools, are in this district awaiting the arrival of the immigrant.\n\nTHE C. P. R. REPORTS\n\nPublished in 1884 of the character of these lands are usually accurate. They have been printed from returns made by experts in the employ of the Company, who had travelled over the country and graded or classified the lands belonging to the Company, and as are their lands so are the Government lands adjacent to them. Below are the remarks in these reports on a few of the townships in this district selected at random. Take for instance the township in which the town of Moose Jaw is situated, that is township 16; range 26, west Second Meridian. The remarks therein on it are as follows: \"It is splendidly watered by two streams; one Moose Jaw creek, flowing in a northwesterly, the other Thunder creek, in an easterly direction, to their confluence in section 33, where the division town of Moose Jaw is located. The C. P. R. runs adjacent to Thunder creek all the way across the township. Soil same as in 16-25—that is the next township east of it—\"first-class.\" Take again the next township north of it. The notes in their reports on it are these: \"Tp. 17, surface, soil, &c., same as preceding.\" Then again look at the township west of that last mentioned, that is tp. 17, r. 27, w. 2nd M. Of it we read in their reports that it \"is undulating with a soil, except a few sections in the south, of a strong rich clay, two to three feet deep—highest rating.\" This is the manner in which these townships, in the Moose Jaw district, selected at random and as samples of the rest, are described and characterized in the official guide book to the lands of the Canadian Pacific Railway Co'y.\n\nLENGTH OF SEASON.\n\nThe season for farming operations is longer here than it is further east, this being more affected by the chinook winds from the west and yet far enough from the mountains not to be influenced by the cold from them. In 1883 seeding in the Moose Jaw district began on the 6th day of April;\nA. R. TURNBULL, M.D.,\n\nGraduate of McGill College, Montreal.\n\nJ. G. GORDON,\n\nBARRISTER,\n\nADVOCATE, NOTARY PUBLIC, ETC.\n\nT. W. ROBINSON,\n\nGENERAL\n\nMERCHANT\n\nMAIN STREET,\n\nMOOSE JAW, N.W.T.\nWM. GRAYSON,\nBarrister, Attorney, Conveyancer, Notary Public, Etc.,\nMOOSE JAW, N.W.T.\nAgent for the Canada Northwest Land Company, Limited, and the Trustees of Moose Jaw Town Site.\n\nDominion Government Immigration Agency\nThe undersigned having resided over six years in this District is in a position to give SPECIAL INFORMATION to Immigrants and intending settlers regarding HOMESTEAD LAND, ETC.\n\nR. L. ALEXANDER,\nDominion Government Immigration Agent.\n\nCITY DRUG STORE\nE. H. SCOTT, M.D., Manager, Moose Jaw, N.W.T.\nDEALER IN\nDRUGS AND MEDICINES\nBooks, Stationery and Wall Paper, Fancy and Toilet Articles.\n\nFINE SOAPS, BRUSHES, SPONGES, &c.\n\nCustomers will find our stock complete, comprising many articles it is impossible here to enumerate, and all sold at moderate prices.\nin 1884, on the 26th day of March; in 1885, on the 17th day of March; in 1886, on the 6th day of April; in 1887, on the 16th day of April, and in 1888 on the 10th day of April.\n\nLIABILITY TO FROST.\n\nThe crop in this district, in consequence of the greater length of the season and the less variable character of the weather, is less liable to frost than is the case elsewhere: Only during one season (that is in 1884) has any damage been sustained in this district by crops from frost. Indeed there is no greater liability to injury from frost here than there is in the more favored parts of Ontario. Last season for instance, the first sign of frost that there was in the Moose Jaw district (and a very slight frost it was) appeared on the night of the 19th and morning of the 20th day of September; and the first frost which was at all heavy fell on the night of the 26th and morning of the 27th of September last; and before either date all crops had been well saved. Wheat, well matured and a good crop, has ripened and been cut in the district as early as the 24th day of July from seed sown in the previous spring.\n\nMIXED FARMING.\n\nThe above land is specially well adapted for mixed farming. Cattle, horses, sheep, &c., can be raised here by farmers at about one-third of what it costs in Ontario to do so. The season during which they require to be fed is shorter here than it is there. Indeed until very recently little or nothing had been fed to stock this autumn. They continued to thrive on the natural grass of the prairie; and as soon as the snow disappears in the spring, they will eat nothing and need nothing but it. The chief reason why this prairie grass retains in such a great degree its nutritive qualities all the year round in this western country appears to be that, during the month of August in each year, it turns into hay as surely and markedly as if it were cut and properly saved, and is therefore as little affected by the frost as is the hay which has been cut, cured and stacked; whereas further east it remains green and consequently loses almost all of its nourishment after it has once been frozen. Besides the straw in the Northwest has in it much more nutriment than it has in eastern Canada. And then enough hay has easily been obtained on the prairie to satisfy the requirements of the settlers for the feeding during winter of their stock. At any rate the fact is undoubted that the raising of stock (and better stock too than can be raised in eastern Canada) is in this district wonderfully easy and inexpensive in comparison with what it is and costs elsewhere. The first settlers made the mistake of confining their attention to the raising of grain. It is now acknowledged that mixed farming yields better pecuniary results, and is accordingly being more generally pursued.\n\nSUPERIOR GRAZING CHARACTER.\n\nTwo things may be here stated for the purpose of showing the superior character of this district as regards its grazing qualities. One is this: When the farmers excursion came to Moose Jaw last summer from\neastern Canada, one of the most common remarks made by the excursionists was as to the exceeding richness of the milk which had been supplied to them here, that it greatly surpassed anything of its kind which they had previously tasted. That was their tribute to the richness of our prairie grass their acknowledgment that cattle have more nutritive food here than that which is supplied to them in the places from which these excursionists came. The other is this—and probably nothing can be said that would better indicate its quality in this respect than this—that in addition to what has been shipped by others, Messrs. Baker and Plante, merchants of Moose Jaw, have shipped from it upwards of two hundred and fifty cars of buffalo-bones, averaging over fourteen tons each, to the east where they are utilized for refining and fertilizing purposes. The network of deep buffalo runs visible everywhere on the unbroken prairie throughout the Moose Jaw district and this large shipment of buffalo bones from it show conclusively that it has in the past been a favorite resort of the buffalo; and this it certainly would not have been had not the grass in it been exceedingly nutritive and the district in every respect an exceptionally fine grazing ground.\n\nCHEESE FACTORIES.\n\nTwo cheese factories have been established in this district, one of which has been in operation for several years. They are those of R. K. Thomson, six miles west of this, and of J. L. Legare at Willow Bunch, seventy miles south of this. The cheese manufactured by them has been of such an excellent quality that it has always found a ready sale.\n\nEARLY EXPERIENCES.\n\nIt is freely admitted, that in common with the rest of the Northwest Territories and with Manitoba, this district did not for the first few years after its settlement, or rather after 1882, enjoy quite the measure of prosperity which would naturally have been anticipated from the quality of its soil and from the experience in 1882 of the settlers therein. A good share of this is doubtless attributable to the inexperience of the immigrants as to the best methods of treating the soil in this new country. Not a little of it has to be laid at the door of careless farming, many having put in their seed in a way that no intelligent farmer in eastern Canada, or they themselves before they came to the Northwest, would dream of doing and yet expect to get a crop. But the chief cause of the state of things mentioned is by very many thought to be prairie fires. In the autumn of 1882 and afterwards, these fires were deliberately set out, the general opinion among the settlers having then been that they were beneficial to the soil in every way. They gradually came however to discover their great mistake; that, instead of being a benefit these fires are most detrimental to the prairie, their effect being marked by drying it up, decreasing the rainfall, destroying the grass, radically changing indeed the character of the soil. This country has thus, where the facts with their causes are not understood, been blamed for what has resulted from the inexperience, carelessness and wrong-doing of those who had settled in it.\nThe experiences of the early settlers in the Northwest and Manitoba run wonderfully parallel with those of the parties who had first located in Iowa, Wisconsin, Nebraska, Kansas, Minnesota, &c. Indeed in the Canadian Northwest, the crop failure (except perhaps in 1886, when there was a similar failure south of the line and from the same cause) has never been as great as it had for several consecutive years been in the above and other states after the first settlement of them. But they learned the causes of their failures, set themselves to work to rectify them, and success of a marked kind did ultimately reward their efforts.\n\nMORE RECENT EXPERIENCES.\n\nSo things have been tending in the Canadian Northwest, and in particular in the Moose Jaw district. We have admittedly an excellent soil, heavier and richer than it usually is in Dakota or south of the line. The crop of 1877 was a satisfactory one. That of the past season has been an excellent one. The highest recorded average of wheat per acre raised in Dakota was obtained in 1887, when it fell under sixteen and one-half bushels. It is estimated from statistics which have been gathered and which are now nearly complete, that the total crop which was raised last season in the Moose Jaw district exceeds one hundred thousand bushels of wheat and of all kinds of grain one hundred and seventy thousand bushels, averaging for wheat twenty-one bushels per acre—a high average in any case, and especially so considering that much of the seed had been put into the ground in a very indifferent manner. Individual farmers in the district who cultivated their lands well have had superior returns. Below are given the names of some of them, their post office addresses, the number of bushels of wheat raised by them last season and the number of bushels they had of all kinds of grain. These crops have been in nearly all instances raised by them without any help whatever, except in stacking and threshing—in all cases indeed except where they had a child or children old enough to be of assistance to them. In nearly all cases threshers' measure is given, as only a few have yet sold all of their grain, and consequently they have no other means of computing the quantity raised by them. It may be mentioned however, that those who have disposed of the whole of their grain, except what they are reserving for seed and for feed for working animals, usually find that the quantity of grain which is being actually realized by them from last season's crop is from eight to twelve per cent. in excess of that which had been stated to them when threshing had been completed.\n### LAST SEASON'S YIELD—EXAMPLES OF WHAT IT WAS\n\n| Names            | P. O. Address     | No. Bushels Wheat | No. Bushels all kinds of Grain |\n|------------------|-------------------|-------------------|--------------------------------|\n| Allison, Robt.   | Pasqua            | 1482              | 2082                           |\n| Beesley, J. C.   | Marlborough      | 1240              | 1775                           |\n| Barker, E. J.    | Moose Jaw         | 800               | 1600                           |\n| Carle, A. B.     | \"                 | 850               | 1450                           |\n| Checker, Hy.     | \"                 | 2300              | 3400                           |\n| Cudmore, E. J.   | Caron             | 1800              | 2740                           |\n| Dalgarno, A.     | Moose Jaw         | 980               | 2400                           |\n| Dorrell, Hy.     | \"                 | 966               | 1450                           |\n| Franks, Thos.    | \"                 | 2100              | 2500                           |\n| Franks, W. & Jas.| \"                 | 1490              | 2000                           |\n| Gilmour, H. C.   | \"                 | 1300              | 2000                           |\n| Gilmour, Hugh    | \"                 | 1600              | 2100                           |\n| Gass, C. A.      | \"                 | 1000              | 1700                           |\n| Gibson, Jerry    | \"                 | 1250              | 1900                           |\n| Getty, Sam       | Caron             | 1590              | 2200                           |\n| Hill, J. A.      | Moose Jaw         | 750               | 2100                           |\n| Latham, Mrs.     | \"                 | 1500              | 2750                           |\n| Lamb, Geo.       | \"                 | 1190              | 1655                           |\n| Lamb, Chas.      | \"                 | 1000              | 1250                           |\n| Love, Edgerton   | Pense             | 1000              | 2100                           |\n| Miller, R. O.    | Moose Jaw         | 1350              | 1350                           |\n| Moore, Robt.     | \"                 | 1000              | 1600                           |\n| Might, H. & G    | \"                 | 1560              | 2550                           |\n| McBean, Donald   | Marlborough      | 1030              | 1590                           |\n| McCartney, Jas.  | Moose Jaw         | 2500              | 3400                           |\n| McConnell, Jas.  | \"                 | 1220              | 1370                           |\n| Ross, D. M.      | \"                 | 2040              | 2750                           |\n| Rathwell, S. K   | \"                 | 880               | 1600                           |\n| Smail John       | \"                 | 2070              | 3640                           |\n| Smail, Geo.      | \"                 | 1325              | 1475                           |\n| Smith, Ben       | \"                 | 1400              | 2800                           |\n| Smith, JamesW    | \"                 | 900               | 1400                           |\n| Sylvain, George  | \"                 | 1150              | 2200                           |\n| Sanders, W. C.   | \"                 | 1790              | 2500                           |\n| Schram, John     | \"                 | 900               | 1400                           |\n| Thomson, R. K    | \"                 | 860               | 1555                           |\n| Thompson, James  | \"                 | 1400              | 1700                           |\n| Wilson, Alex     | \"                 | 1160              | 2200                           |\n| Wilson, Richard  | \"                 | 900               | 1350                           |\n| Welsh, E. B.     | \"                 | 1300              | 1800                           |\n| Young, Jos       | Pense             | 2000              | 3000                           |\n\nThese figures, taken in connection with the fact that the bulk of the wheat has been sold this autumn at upwards of one dollar per bushel and other kinds of grain at relatively high prices, tell their tale of comfort and prosperity for the farming community better than any words can do so.\n\n### TOWN OF MOOSE JAW\n\nThe town of Moose Jaw is centrally located in the district. It is prettily situated in a valley, about a mile in width, slightly sloping to the south. The land to the north and south of it is one hundred and fifty or more feet in height. It is the nearest point on the C. P. R. to Prince\nH. MCDougall\n\nAgent Temperance Colonization Co., Limited\n\nAND\n\nDealer in Lumber\n\nAND\n\nBuilding Material.\n\nWM. WALSH,\n\nLivery, Feed and Sale Stables,\n\nHorses, Ponies and Cattle for Sale.\n\nLeading Stage Line to Saskatoon, Prince Albert, Battleford, Wood Mountain and Willow Bunch.\n\nBaled Hay Always on Hand.\nJOHN BELLAMY,\nCONTRACTOR and BUILDER\n\nDEALER IN ALL KINDS OF\nFurniture, Bedroom Suites, Parlor Sets, Baby Cabs, Window Shades, Shade Rollers, Picture Frames and Mouldings.\n\nAGENT FOR THE DOHERTY ORGAN.\n\nORGAN STOOLS AND MUSIC BOOKS CONSTANTLY ON HAND.\n\nUNDERTAKER, Etc.,\nCorner Main and High Streets, Moose Jaw.\n\nANNABLE & CO.,\n\nNEW CHEAP CASH STORE,\n\nDEALERS IN\nDRY GOODS,\n\nREADY-MADE CLOTHING,\nBoots and Shoes, and General Groceries.\n\nSPECIAL ATTENTION paid to FURNISHING SETTLERS with Outfits.\n\nWe'll not be Undersold.\n\nMAIN STREET. MOOSE JAW\nAlbert, both being in the same range; and the shortest and best trails to Saskatoon, Wood Mountain and Willow Bunch start from this place. The Temperance Colonization Society transact at this point their business, and from this place the settlers leave the railway for the Society's lands.\n\nCHURCHES.\n\nIn the town there are three churches, in which services are regularly held—the English, Presbyterian and Methodist churches. In addition to these a Catholic priest occasionally officiates here, and the Salvation Army have some time ago begun work in this place. Besides this, services are being held at various points in the district in connection with these churches; and a Roman Catholic church, with a resident priest, is established at Willow Bunch in it. The Baptists have recently acquired lots in the town for church purposes.\n\nSECRET AND BENEVOLENT SOCIETIES.\n\nIn the town there are also the following secret and benevolent societies: Masonic, I. O. O. F. and Orange. They regularly meet as follows: Moose Jaw (Masonic) on the second Tuesday of each month, Jas. Brass, W.M.; Valley Lodge (I. O. O. F.) every Thursday evening, A. B. McKenzie, Noble Grand; and Western Hope (L. O. L.) on the Monday before the full moon, Wm. Hannah, W. M. They cordially welcome visiting brethren.\n\nMOOSE JAW AS A FARMER'S MARKET.\n\nIt is a divisional terminus town on the C. P. R., and therefore the home of a large number of railway employees. About $75,000 are annually disbursed by the C. P. R. Co'y to their employees in this place. Besides this the section houses along the western division from Moose Jaw to Swift Current and a number of these on the eastern division to Broadview procure their supplies at this place, causing a further business to be transacted here to the amount annually of some $12,000. This makes Moose Jaw an exceptionally good market for all that a farmer has to sell. From twenty-five to thirty cents per dozen are being at present paid to farmers for eggs and twenty-five cents per pound for good butter. There have been in it this season four grain buyers, each with a separate grain warehouse, causing a healthy competition to be maintained in the price paid for grain. During a large part of the season (that is until the close of navigation east of Port Arthur), wheat brought at this point upwards of one dollar per bushel, and relatively high prices have been paid for other grains. The freight rates on the C. P. R. on through shipments to the east of grain are only (per car load) two cents per bushel higher from Moose Jaw than they are from Brandon; and the price paid for wheat at Moose Jaw should therefore not vary, and ordinarily does not vary, more than two cents from the price that is paid per bushel for it at Brandon. This place is regarded as one of the best markets in the Northwest.\nSETTLES' SUPPLIES.\n\nThese can be purchased at Moose Jaw and at reasonable prices. The advertising pages of this pamphlet will inform the reader as to where he can buy them. We have hardware, tinware, grocery, dry goods, boot and shoe stores, a drug store, harness shops, lumber yards, agricultural implement warehouses, &c.—places where the immigrant can readily procure all supplies he may require and such as are found to be best adapted to the Northwest. Freight rates on small lots, added to eastern prices, will bring the cost of all needed supplies quite up to, if not beyond, what they can be obtained for here.\n\nTHE CLIMATE\n\nhere is very healthy. Read Mr. Sylvain's statement annexed to this. When the farmers' excursion party reached this last summer from eastern Canada, they at once remarked that people generally appeared to be more rugged here, in better physical condition, than there. Sometimes in the winter it is cold and the thermometer falls low, but the cold weather rarely continues for any length of time; and as there usually is no wind when it is very cold, and as the atmosphere is dry, it is not greatly felt. The cold is less steady, not as long continued, as it is further east. On account of the formation of the country, we have not the cyclones that occur elsewhere, and not as frequently the less high winds as other prairie countries have, notably south of the line. Take for instance our lowest dip and most stormy week last winter—the second week in January. It was reported as from ten to fifteen degrees lower in Dakota and Montana than it was here and with a higher wind than we had. This autumn has been exceedingly fine. A game of base ball was played here on New Year's day, the thermometer standing at forty-four degrees in the shade. As trees are cultivated—and with proper care and attention, they will grow well—the climate will be greatly modified, and the appearance of the prairie be much improved.\n\nSCHOOLS.\n\nSix school sections have been formed in the Moose Jaw district, that of the town employing two teachers. The Northwest School Ordinance is, as it is right that it should be in a new country, peculiarly flexible, and permits the formation and re-arrangement of school districts as the needs of the settlers may require. A school district may be formed wherever there are within an area of twenty-five square miles not less than four resident heads of families and ten children of school age, that is between the ages of five and sixteen inclusive. And the grant to schools by the Northwest Legislative Assembly is so liberal that settlers need not be deprived of educational advantages for their children.\n\nIt may here be mentioned that south of Moose Jaw (or rather a little east of south) and about twenty-five miles out from it lies a large bed of pottery clay, which has been pronounced by experts to be quite equal to\nE. A. BAKER & CO.,\nGRAIN MERCHANTS,\nand Wholesale and Retail Dealers in\nGroceries, Provisions, Flour and Feed;\nHardware, Stoves, Paints, Oils, Etc.\nESTABLISHED 1883. MAIN STREET.\n\nJ. T. SIMPSON,\nDEALER IN\nLumber, Lath and Shingles,\nSash, Doors, Mouldings, Wood, Etc.;\n—ALSO—\n\nGENERAL COMMISSION MERCHANT.\nAgent for the Equitable Life Insurance Co., and the Ontario Mutual.\nHOPKINS & BATE,\n\nImporters and Breeders of\n\nClydesdale Horses and Short Horn Cattle.\n\nWe have a number of Stallions and Mares from the best sires in Scotland. We invite inspection of our stock.\n\nPRICES LOW. TERMS EASY.\n\nCorrespondence Solicited. P. O. Box 41, Moose Jaw, Assa\n\nE. N. HOPKINS. J. E. BATE.\n\nR. BOGUE,\n\nGENERAL MERCHANT\n\nLEADING HOUSE FOR\n\nSETTLERS' SUPPLIES,\n\nCorner Main and High Streets,\n\nMOOSE JAW, N. W. T.\nthe Bristol clay, and lying near to it are coal deposits which will in the future make an excellent and cheap fuel. There is yet a quantity of wood here, but the fuel at present chiefly used (and an excellent fuel it is) is coal from the Lethbridge mines west of this.\n\nRAILWAYS.\n\nThe Moose Jaw Board of Trade are applying for a charter for a line of railway to run north and north-west of this in the direction of Prince Albert and Battleford. A shorter and less expensive line can be constructed from this place to them than from any other point on the line of the C.P.R.—It is their expectation that this charter will be obtained by the Board and that the line will be constructed in the near future.\n\nThe great need of the district is settlers to fill up and till the many thousands of acres in it that are awaiting immigrants—settlers of the right stamp, energetic, industrious, willing to learn from the experience of others and to act thereon; and possessed of these, the Moose Jaw district would speedily become second to no other part of Canada.\n\nEXPERIENCE AND VIEWS OF THE SETTLERS.\n\nAppended to this are statements, voluntarily made, from a number of intelligent farmers in the district giving their experience since their settlement therein, and their views as to the character of the soil and its agricultural and grazing resources. The P.O. address of each is given. They will readily reply to letters of enquiry sent to them by persons who are thinking of coming to the Northwest.\n\nStatement of George Sylvain as to the District for Farming and Grazing. Its Healthful Climate.\n\nI, GEORGE SYLVAIN, of w § 34, 18, 25, w 2nd M., yeoman, do hereby certify as follows: That I came to the Moose Jaw district in 1882 from Rimouski in the province of Quebec, and settled on said half section and have since that resided on it, and that I consider the land out here to be excellent land for agricultural and grazing purposes, particularly for horses and sheep. Last season raised, without any hiring, eleven hundred and fifty bushels of wheat and twenty-two hundred bushels of all kinds of grain. The climate is very salubrious; and for those who (like myself) are or have been troubled with asthma, it is simply inestimable. Before I came here I could not move for at least six months out of each year for thirty years on account of it; since I came here, it has not troubled me at all. I think this is a good place for farmers with little means and a good deal of energy to come to for the purpose of making a home for themselves. Such persons can scarcely fail to do well out here.\n\nGEORGE SYLVAIN.\n\nTp. 18, R. 25, W. 2nd M.,\nMoose Jaw P.O., Jan. 11, 1889.\nStatement of John Smail.—An Ontario Farmer gives the Result of his Five Years' Experience.\n\nI, JOHN SMAIL, of s. & 34, 19, 27, w. 2nd M., yeoman, settled on this land in the spring of 1884. I came from the township of Emily, county of Victoria, Ont. The soil of my farm is heavy clay loam. It is the same soil as nearly all of this district. It is well adapted for the growth of all kinds of grain and roots. Though heavy it has no tendency to bake after rain. My crop this year was (threshers measure) two thousand and seventy bushels of wheat and three thousand six hundred and forty bushels of all kinds of grain, raised by me with the assistance only of a young son and a yoke of oxen, in addition to my own team; and my son George, who lives on and cultivates the other half of this section, raised without any assistance thirteen hundred and twenty-five bushels of wheat besides his coarse grain. Among other roots I raised Indian corn which ripened to perfection. I regard the district as unusually good for grazing. The grass is not as long as it is in Manitoba, but it is very nutritive and turns into hay during the month of August. It is not hurt by the frost. The cattle thrive on it as long as they can get at it. Indeed this autumn my cattle have so far got nothing but what they picked up on the prairie, and they are in as good order now as they were last summer. I am well satisfied that I came to this part of the Northwest, and my family are also well satisfied, and so it seems to me that every well-beloved and industrious man be. He can make a good home for himself out here. That is my opinion from nearly five years residence in this district.\n\n34, 19, 27 w. 2nd M.,\nMoose Jaw, P.O., Jan. 11, 1889.\n\nJOHN SMAIL.\n\nStatement of Henry Dorrell, one of the Directors of the Moose Jaw Agricultural Society.—An English Farmer's Experience.—Has had an Average of Nineteen Bushels of Wheat to the Acre for Five Years.\n\nI, HENRY DORRELL, of 30, 18, 26, w. 2nd M., yeoman, make the following statement as to my views of and experiences in the Moose Jaw district. I came from the parish of Holt, in the county of Worcester, England, to Ontario in 1881 and thence came to the Northwest in 1882 and settled on said land in this district in the spring of 1883. During the summer of 1882 I was chiefly engaged in prospecting for land and finally selected this district. I have no cause to regret my choice; although I have met with difficulties which had to be and have been overcome such are incident to settlement in a new country. I have never doubted the suitableness of the land for both wheat growing and grazing. I write from a farming experience of some twenty years. Although some of the seasons were not as favorable as could be desired and though large results cannot be expected from this land until the sod is subdued, my average of wheat during five years has been nineteen (19) bushels to the acre. The excellent quality of our prairie grass is abundantly proved by the growth of our cattle. They can feed out on the prairie for at least nine months out of each year and do well all the time; indeed my cattle are feeding out still. I am going into farming here as largely as I can and intend to influence my friends to emigrate to this country as I regard it as a good place for all farmers to come to.\n\n30, 18, 26, w. 2nd M.,\nMoose Jaw P.O., Jan'y 12, 1889.\n\nHENRY DORRELL.\n\nExperience of S. K. Rathwell, President of the Moose Jaw Agricultural Society.\n\nI was raised in the county of Wellington, Ont., and lived on my own farm there for twenty years. After hearing so many glowing accounts about Manitoba and the Northwest, I rented my farm in 1883 and came out to the Northwest to see it for\nmyself. I took up land about six miles from Moose Jaw (part of 22, 17, 27, w. 2nd M.). After having given out a contract to get a quantity of it prepared for crop, I returned to Ontario and in the spring of 1884 I came back with my family. I have been here since that. My crop of 1884 was a little damaged with frost (the only time anything I had sown was at all touched with frost) and the season of 1886 was unusually dry; but I am satisfied with my experience since I came to this country, and think that a man of the right stamp with $500 who will come to this country and use it judiciously for farming purposes will do better than he would do with one hundred acres in any part of Ontario that I have seen or been in.\n\nS. K. RATHWELL.\n\nMoose Jaw P.O., Jan'y. 14, 1889.\n\nJohn W. McIntosh compares this District with Other Places.\n\nTO THE INTENDING SETTLER:\n\nI can say that I have travelled several thousands of miles over two of the leading Pacific lines of railway in the United States and also over the C. P. R. into British Columbia, and I have failed in all my researches to find a better field for emigration for the agricultural community than the Moose Jaw district has proved to be for the last few years. Our wheat has no equal. As to climate it is much milder than Manitoba and it is much preferable to western Ontario. Certain classes of stock graze on the prairie all year. The climate is most healthful. I came from the neighborhood of Strathroy, county of Middlesex, Ont., to this place.\n\nJOHN W. McINTOSH.\n\n12, 17, 27, w. 2nd M.,\nMoose Jaw P.O., Jan. 14th, 1889.\n\nExperience of W. C. Sanders.\n\nI wish to relate my experience since my settlement in the Northwest and to give my views regarding the country for agricultural and grazing purposes. I came to the Northwest in the spring of 1884 from Lakefield, county of Peterboro, Ont. I selected 12, 20, 27, w. 2nd M., to settle on. I have lived on it ever since. The land is, in my estimation, excellent. I have been farming since 1884, inclusive. I have never been troubled with frost since I came to the district. At first my crop average was not up to my expectations; but I believe that during these years which were dry, the crops would have been good if the land had been longer under cultivation. The land was so loose and soddy that it was impossible to get a firm seed bed. The longer I have been in the country, the more satisfied have I been with the crops I have been able to raise. I have had cattle during all of these years; have at present 36 head of cattle, horses, etc., and have never had to feed them until the 1st of January, nor after the 1st of April. The frost in the fall preserves instead of killing (as it does elsewhere) the grass in this district. Cattle eat it in preference to hay. My cattle do so now. I have not fed anything yet even to my calves of which I have thirteen. My cattle are beef fat. After the snow leaves in the spring, the grass is just as good as it was in the fall before. Horses will improve their condition by being out all winter—unfed. Climate, grasses, everything makes this an excellent grazing district.\n\nW. C. SANDERS.\n\n12, 20, 27, w. 2nd M.,\nMoose Jaw P.O., Jan. 14th, 1889.\n\nAn Intelligent Frenchman gives the Result of his Twenty Years Experience in the District.\n\nI, Jean Louis Legare, desire to state as follows: I came to Wood Mountain in 1869 and have for the last twenty years resided at Willow Bunch and neighborhood. I have been engaged in raising stock since I came here, principally ponies. We\nW. M. SMITH,\nPIANOFORTE TUNER.\nGraduate of the Halifax Institution for the Blind.\nSATISFACTION GUARANTEED.\n\nJ. M. SIMINGTON,\nBAKER and CONFECTIONER.\nFresh Bread, Pies, Cakes, Confectionery, Cigars, Etc., Etc.\nOYSTERS AND ICE CREAM IN SEASON.\n\nCorner Main and River Streets, MOOSE JAW, N.W.T.\n\nLITTLE BILL'S\nMeat and Vegetable Parlor.\nFRESH MEAT OF ALL KINDS:\nPoultry, Fish and Vegetables in Season Constantly Kept on Hand.\nnever had a winter hard enough to cause any loss worthy of mention in our stock. Grazing was always good the whole year round. Horses prefer ours to the longer grass of the east. Concerning cattle I have only had five years of experience. My idea is that the grazing here is just as favorable for cattle as for horses, excepting when there is much snow on the ground when horses have the advantage. I will, with full confidence, continue raising stock; I have at present 120 head of cattle; and appreciate more the value of raising stock at Willow Bunch, I have had a cheese factory built here last season. I have raised good crops of oats, wheat corn, potatoes and all kinds of vegetables out here. There is good farming land here. Less rain has fallen during the last five or six years than formerly, and in consequence the crops raised by me during those years have not been as good as they had been before that. In 1877 rain fell twenty-three days during the month of May, and all that summer was wet, and so it was from 1877 to 1882 inclusive. I consider this a good grazing part of the country with much good agricultural land.\n\nJEAN LOUIS LEGARE.\n\nWillow Bunch,\nMoose Jaw P. O., Jan. 15th, 1889.\n\nOther Statements of Settlers from Ontario.\n\nI, HUGH C. GILMOUR, came to the Northwest, from township of Stanley, county of Huron, Ont., and in 1883 settled on east half 30, 18, 25, w. 2nd M. I have lived there since then. I consider the land out here to be good land for agricultural and grazing purposes. I raised last season 1,300 bushels of wheat and 2,000 bushels of all kinds of grain; and my son Hugh who farms alongside of me raised 1,600 bushels of wheat and 2,100 bushels of all kinds of grain; and both would have had a great deal more had not our reaping machine broken down early during our harvest and a great deal was shelled out. We raised these crops without any hiring. I have, besides horses and other stock, over forty head of cattle; and they can be raised here at much less cost, with greater ease, and come out better in the spring than is the case in Ontario. I travelled in 1882 and 1883 largely through Manitoba and the North-West Territories, and I saw nothing to suit me until I struck Moose Jaw and the Buffalo Lake district in it.\n\nH. C. GILMOUR.\n\nBuffalo Lake,\nMoose Jaw P. O., Jan. 15th, 1889.\n\nI, BENJAMIN SMITH, of W. § 20-17-27 W. 2nd M., yeoman, came to the Northwest in 1883. I came from the Tp. of Arthur, Co. of Wellington, Ont. I have lived on this land since I came. The land out here is unquestionably fine land, I have never seen better or even as good elsewhere. I am satisfied with the crops I have had since I came here with the exception of one year (1886), and the comparative failure of that was, I think, due to prairie fires. I had last season 2,800 bushels of grain, half of which was wheat; and this was raised by me without help of any kind except in stacking and threshing. I think this is the making of a fine country for good, substantial farmers. Good crops can be raised with much less labor than would have to be expended on them in Ontario and the grain is of the finest quality.\n\nBEN. SMITH.\n\nMoose Jaw P. O., Jan. 15th, 1889.\n\nMr. Smith is one of the Directors of the Moose Jaw Agricultural Society.\nStatement of J. G. Beesley, of 22, 18, 27, west 2nd M.\n\nAfter nearly six years experience, I am satisfied that no other country can approach the Canadian Northwest Territories as a field for agricultural productions. I have no hesitation to state that a man who is willing to work and put up with a few inconveniences at first cannot help but succeed. This part is naturally well adapted for grain raising. I had a yield last season of 1,775 bushels from sixty acres. There has been no frost here to damage grain since 1884. The climate is very healthy. The winter is sometimes cold but spring, summer and fall are delightful. I came here from Clinton, Co. Huron, Ont.\n\nJ. G. BEESLEY.\n\nMarlborough P. O., Jan. 17th, 1889.\n\nExperience of Donald McBean of 22, 18, 27, west 2nd M.\n\nAs far as my experience has been, this will be a splendid country in time to come. I have been in the country about five years and I believe that any industrious man can here sooner become independent at growing grain and raising horses than in any country I have seen. I came to it from near Forest, Co. Lambton, Ont.\n\nDONALD McBEAN.\n\nMarlborough P. O., Jan. 17th, 1889.\n\nExperience of a Nova Scotian.\n\nI have travelled through part of the United States and have had eighteen months' experience of farming in Kansas. I came to the Canadian Northwest about eight years ago and believe this part of it to be the best agricultural country I have seen, especially for any industrious young man to make a start towards wealth, as he can start on very small capital and work up. I came originally from the East River of Pictou, Nova Scotia.\n\nJ. D. FRASER.\n\nE. & 16, 18, 27, w. 2nd M.,\nMarlborough P. O., Jan. 17th, 1889.\n\nStatement of Joseph Young, Tp. 18, Rg. 24, W. 2nd M.\n\nI came to this part of the Northwest in the fall of 1883 from the Tp. of Caradoc, Co. of Middlesex, Ont. I think this is about the best part of the country that lies between Winnipeg and the Rocky Mountains for agricultural purposes and mixed farming. I had 95 acres under crop in 1887 that turned out 4,000 bushels, 1,500 bushels of which was wheat. I raised last season 3,000 bushels, of which 2,000 bushels were wheat. I am keeping a large number of cattle and I find this country exceptionally good for stock raising and dairying. I think any man that comes to this country that will start in mixed farming will do well.\n\nJOSEPH YOUNG.\n\nPense P. O., Jan. 16th, 1889.\nDAIRYING EXPERIENCE OF E. N. HOPKINS.\n\nTO THE MOOSE JAW BOARD OF TRADE.\n\nGentlemen,—I was engaged in the cheese business in Ontario for more than ten years. I made cheese in the Big Factory in the Township of East Zorra, Co. Oxford, for two years and had charge of the Brownsville Cheese Co.'s factories for seven years. I claim to understand milk and cheese. I have made cheese in the Moose Jaw district for three years and find the grasses of the prairie will produce milk that will make the finest flavored cheese. The cheese made here by a skilful hand has that nutty flavor that is at times so hard to procure in Ontario.—The air is so pure here that the milk will remain sweet and pure for a much longer period than it will in Ontario. This country is destined to become a great dairy country.\n\nE. N. HOPKINS.\n\nEureka Factory,\nMoose Jaw, Assa., Jan. 17th, 1889.\n\nSTOCK AND GRAZING EXPERIENCE OF WM. RIDDELL, QU'APPELLE VALLEY, NEAR MOOSE JAW.\n\nMy experience extends over some six years in this district. I have about one hundred head of cattle and about two hundred and fifty head of horses. My experience is that this district is well adapted for the raising of both. This winter so far and all last year I did not feed them anything nor house them at all and yet they remained in excellent condition—better than the same number of animals would be (even if fed as they usually are) in Ontario.\n\nWM. RIDDELL.\n\nSimilar statements from intelligent farmers in this district could be greatly multiplied. But it is thought to be needless to do so. Those which are here given tell their story—and that is all they are here inserted for—of confidence in the future of this district, arising from its great, though as yet but little utilized or developed, resources; and they invite outsiders, whose thoughts are directed towards settling in the Northwest, to visit this part of it and for themselves to pronounce upon the agricultural and grazing resources of the Moose Jaw district.\n\nH. McBRIDE & CO.,\nDEALERS IN\nBoots and Shoes, Rubber Goods and Harness.\n\nBoots, Shoes and Harness made to Order. Repairing on Short Notice.\n\nMAIN STREET, MOOSE JAW, N.W.T.\nCENTRAL\n\nBlacksmith and Machine Shop,\n\nHIGH STREET, NEAR MAIN.\n\nRepairing in all its Branches.\n\nHorse Shoeing and Plow Points a Specialty.\n\nManufacturer and Patentee of the EUREKA ROAD CART\n\nO. B. FYSH.\n\nW. J. LAW, Merchant Tailor,\n\nIMPORTER OF\n\nIRISH, SCOTCH\n\nAND\n\nENGLISH SUITINGS\n\nMoney to Loan at Lowest Market Rates.\n\nNo. 3 Main Street, Moose Jaw.\nA. HARRIS, SON & CO.,\nWINNIPEG.\n\nMANUFACTURERS OF AND DEALERS IN\nSELF-BINDERS, MOWERS, RAKES,\nSEEDERS, PLOWS, HARROWS, SLEIGHS,\nWAGONS, BINDER CORD, ETC., ETC.\n\nFACTORY AT BRANTFORD, ONT.\n\nAll four goods are fully warranted. Our long experience in this country places us in a position to judge of the wants of its settlers. Agencies at all important points in Manitoba and N.W.T. See our agents or write us direct.\n\nCHAS. A. GASS, AGENT AT MOOSE JAW.\n\nFELIX PLANTE,\n\nDEALER IN\n\nDry Goods, Ready Made Clothing, Groceries,\nProvisions, Boots and Shoes, Etc.\n\nFarmers' Produce Bought at Highest Market Prices.\n\nSETTLERS' EFFECTS A SPECIALTY.\n\nMAIN STREET, MOOSE JAW.\nNOTICE TO FARMERS AND OTHERS.\n\nThe lands reserved for selection by this Company have all been carefully inspected and are good Agricultural Lands. For sale without cultivation or settlement restrictions. Price Lists can be seen at the offices of the various agents. The Company's shares, which are now at a considerable discount, are accepted AT PAR in payment of lands.\n\nA great part of the Lands is IN CLOSELY SETTLED DISTRICTS and NEAR THE MAIN LINE of the Canadian Pacific Railway.\n\nTOWN SITES.\n\nThe Company offers Lots for sale at all Stations along the main line of the Canadian Pacific Railway, from Brandon west to British Columbia.\n\nMERCHANTS, MECHANICS, TRADESMEN,\n\nAnd all who intend making their homes in the progressive Trade Centres of the Northwest, should consider the advantages of the railway towns and cities, with their conveniences of communication and prospects of rapid growth and development.\n\nMANAGING DIRECTORS:\n\nW. PEACOCK EDWARDS, W. B. SCARTH,\n14 Castle Street, 624 Main Street,\nEDINBURGH, SCOTLAND. WINNIPEG, MAN\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P001809.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 35, "total-input-tokens": 47750, "total-output-tokens": 12973, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 78, 1], [78, 78, 2], [78, 78, 3], [78, 503, 4], [503, 503, 5], [503, 503, 6], [503, 1070, 7], [1070, 1857, 8], [1857, 3797, 9], [3797, 6910, 10], [6910, 7098, 11], [7098, 7876, 12], [7876, 10931, 13], [10931, 14106, 14], [14106, 16739, 15], [16739, 21432, 16], [21432, 21738, 17], [21738, 22284, 18], [22284, 25112, 19], [25112, 27992, 20], [27992, 28365, 21], [28365, 28790, 22], [28790, 31457, 23], [31457, 35176, 24], [35176, 38708, 25], [38708, 39131, 26], [39131, 42397, 27], [42397, 44818, 28], [44818, 46975, 29], [46975, 47328, 30], [47328, 47328, 31], [47328, 47328, 32], [47328, 47991, 33], [47991, 49034, 34], [49034, 49034, 35]], "primary_language": ["en", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]