[{"id": "a7e4f870a4e99bbcfb29efc834f4927564ba6ca7", "text": "trop rapide passage, il va publier un ouvrage sur les coutumes des peuplades sauvages qu'il a évangélisées pendant dix-huit ans. La santé de Mgr Faraut s'est améliorée : daigne le Seigneur lui donner toutes les forces nécessaires pour fonder solidement son nouveau Vicariat !\n\nLes dernières nouvelles du R. P. Vandenberghe sont du 30 juillet. À cette époque l'insatiable Visiteur était arrivé au Grand-Portage la Loche, où se trouve la ligne de démarcation entre le diocèse de Saint-Bouiface et le Vicariat de la Rivière-Mackenzie. Il s'y est rencontré avec Mgr Grandin, et ils ont repris ensemble le chemin de l'île à la Crosse. De là le R. P. Vandenberghe devait se rendre au lac à la Biche et au lac Sainte-Anne pour visiter les Pères qui desservent ces deux importantes Missions. Les fatigues de ce long voyage n'ont point altéré la santé de l'intrépide Missionnaire, qui voit de près et qui expérimente par lui-même les privations auxquelles sont condamnés nos Pères dans ces régions immenses. Tout fait espérer que le dévouement du R. P. Vandenberghe aura pour l'avenir des Missions du nord de l'Amérique une très-grande portée. Que nos prières l'accompagnent et lui obtiennent toutes les grâces et toutes les forces d'en haut, en assurant à ses pas la protection puissante de notre Mère Immaculée !\n\nParis, le 14 novembre 1864.\n\nFIN DU TOME III.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007471.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 426, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1352, 1]], "primary_language": ["fr"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]