[{"id": "f7665b392da61a808c0d0933577fb64bd2cc0924", "text": "saient à les suivre. C'est un éminent service rendu à l'Eglise dans le nord-ouest de l'Amérique, et une grande joie pour Mgr Taché.\n\nLes lecteurs de Annales n'ont pas oublié le grand chef des Cris, appelé l'Herbe odoriférante, le converti et l'ami du R. P. Lacombe; le neuvième volume des Annales, à la page 117, contient un récit intéressant qui nous donne une véritable photographie de ce chef sauvage. Sa dévotion, pleine de respect filial envers la personne du souverain Pontife, était surtout remarquable. On pourra lire avec intérêt les détails concernant la vie de Wikaskokisyen surnommé l'Herbe odoriférante, dans le volume que nous indiquons. Aujourd'hui c'est avec un véritable regret que nous apprenons sa mort. Voici en quels termes elle est annoncée par l'Opinion publique, journal de Montréal, dans son numéro du 26 avril 1877 :\n\n« L'été dernier le lieutenant-gouverneur de Manitoba se rendait sur les bords de la Saskatchewan, afin de faire un traité avec la tribu des Cris. Quelques-uns étaient mal disposés et ne voulaient pas entendre parler de traité. Mais Wikaskokisyen, dans une harangue sage et persuasive, fit comprendre aux siens que c'était leur intérêt de bien s'entendre avec les blancs. Il les persuada et le traité fut conclu. Devant toute l'assemblée, il demanda au gouverneur des Missionnaires catholiques. Le représentant de la reine l'embrassa, lui remit un habit de chef et un beau pistolet. Wikaskokisyen s'était acquis l'amitié et l'admiration de tout le monde. Hélas ! il ne devait pas jouir longtemps de ces marques de distinction. Quelques mois après, ce même pistolet lui donnait la mort. Pendant une réunion dans sa loge, on examinait cette arme, qu'on remuait en tous sens, sans précaution.\nTout à coup une détonation se fait entendre, et le chef des Cris est frappé mortellement, à la grande désolation de tous.\n\n« Il y a une dizaine d’années, Abraham Wikaskokisiyien avait accompagné le P. Lacombe à Saint-Boniface, où, dans la cathédrale, il avait reçu le sacrement de confirmation des mains de S. Gr. Mgr l’Archevêque. »\n\nSous ce titre : les Catholiques de Manitoba, on lit dans l’Opinion publique du 5 avril 1877 l’article suivant, extrait du Métis, journal de Saint-Boniface :\n\nDimanche dernier, un grand nombre de personnes sont allées à l’Archevêché voir les cadeaux destinés à Sa Sainteté Pie IX, à l’occasion de ses noces d’or comme évêque. Ces cadeaux étaient exposés dans le salon et consistent en une magnifique descente de lit, en peau d’élan noir, fourrure très-précieuse et très-rare ; en un petit tapis en peau de loup, en une magnifique paire de pantoufles, une superbe paire de gants à la façon du pays, et un équipage d’un missionnaire voyageant dans le Nord. Cet équipage est certainement ce qu’il y a de plus intéressant à voir. La traîne est tirée sur un fond blanc cotonneux par trois chiens dont l’attelage est un miracle de patience ; car rien n’y manque. La traîne porte les ustensiles de cuisine, la hache et les chaudières ; et sur le côté, les peaux crues se relèvent sous un lacet serré pour couvrir la charge, qui se compose de la literie du Missionnaire, de sa chapelle, de ses pauvres provisions de bouche et de la nourriture de ses chiens.\n\nCes cassettes, d’un très-joli dessin, seront, pour cette fois, remplies de pièces d’or, produit de la quête qui doit se faire à Pâques dans toutes les églises de l’archidiocèse. Derrière la traîne, et tenant la corde, s’avance le Missionnaire, la raquette aux pieds, le fouet plombé à longue mèche à la main, les reins", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007598.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 2, "total-input-tokens": 2768, "total-output-tokens": 1106, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1733, 1], [1733, 3536, 2]], "primary_language": ["fr", "fr"], "is_rotation_valid": [true, true], "rotation_correction": [0, 0], "is_table": [false, false], "is_diagram": [false, false]}}]