[{"id": "128a00d25fe79a1966dc49471ca65041fe151fab", "text": "nous, à notre Mère Immaculée, qu'elle nous obtienne de son divin Fils la grâce de marcher sur les traces de l'Évêque bien-aimé qui nous a été donné pour nous guider et nous conduire. Puisse ce Père vénéré nous revenir bientôt, parfaitement rétabli et accompagné d'une nombreuse caravane d'apôtres !\n\nAgréez, très-révérend et bien cher Père, l'expression de l'affection bien sincère avec laquelle je suis votre tout dévoué et humble Frère en J. M. I.,\n\nH. Leduc, O. M. I.\n\nLETTRE DU R. P. BONNALD.\n\nMission du Sacré-Cœur de Jésus, 6 juillet 1878.\n\nMON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nComme l'année dernière, à la même époque, c'est en attendant le passage des barques du lac Caribou que je vous écris ma lettre annuelle. J'aurais pu m'acquitter plus tôt de ce devoir, mais j'ai cru qu'il était mieux d'attendre jusqu'à mon retour d'un voyage chez les Cris infidèles de la rivière Nelson, voyage très-intéressant à plus d'un point de vue. Il manquait cependant à mon bonheur d'avoir un compagnon pour être témoin des admirables dispositions de ces bons sauvages, et pour attester que ce qui fera l'objet de ce récit n'est pas l'effet de l'illusion ou de l'enthousiasme.\n\nVous savez, mon très-révérend Père, que le R.P. Gasté a eu le premier l'idée d'établir une mission au lac Pélican. Dans l'été de 1874, au moment où nous traversions les prairies avec Mgr Grandin et sa caravane, le R. P. Gasté, passant ici à son retour du lac Cumberland, choi-\nsit à cet effet une pointe de terre. Au printemps suivant, le R. P. Blanchet, en quittant le lac Caribou, vint passer trois mois à ce nouveau poste. Son séjour fut marqué par quelques baptêmes d'adultes et plusieurs abjurations. Il planta aussi une croix que Mgr Grandin bénit dans le courant de l'été, à son retour du lac.\n\nA cette même époque, j'étais au fort Cumberland, où j'entrevis le R. P. Blanchet en route pour Saint-Albert et où je reçus aussi Monseigneur qui était en tournée pastorale.\n\nDans le courant de l'automne, en me rendant au lac Caribou, je ne m'arrêtai que deux heures au lac Pélican, où je fis deux baptêmes. Mais en mars 1876, j'y arrivai dans une traîne à chiens, conduite par le F. Labelle.\n\nUn métis français, le cher et excellent Antoine Morin, me reçut comme l'envoyé de Dieu. À peine étais-je arrivé, deux jeunes infidèles arrivaient aussi en toute hâte, en apparence pour affaire temporelle, mais en réalité pour un motif tout religieux. Je les instruisis de mon mieux, et je les chargeai de dire à leurs compatriotes que je venais ici de la part de Dieu, pour leur plus grand bonheur à tous. Ces bons sauvages furent fidèles à la grâce de leur vocation. Aussitôt après les glaces, ils arrivèrent en canot, et je crois vous avoir écrit à cette époque, pour vous dire avec quelle ardeur et quelle foi vive ils embrassèrent notre sainte religion.\n\nL'hiver suivant, ils furent fidèles à leurs prières et aux exercices de la religion et, bien que simples catéchumènes, ils se firent les apôtres de leurs frères. Quand je les revis, l'an passé, ils étaient plus nombreux et disposés pour le baptême. J'en baptisai onze.\n\nMalheureusement, je ne les attendis pas pour l'automne. Je fus désolé en apprenant plus tard qu'ils étaient accourus en grand nombre, amenant femmes et enfants\npour me voir, et qu'au lieu de me trouver au rendez-vous ils avaient rencontré le ministre protestant. Cependant pas un de ces pauvres sauvages ne voulut aller au prêche de l'anglican ou y envoyer ses enfants. Cette fidélité était admirable ; j'organisai donc toutes choses pour leur faire oublier l'ennui de ce contre-temps.\n\nJ'arrivai ici en février avec le R. P. Gasté, qui poussa jusqu'au fort Cumberland. Antoine Morin n'était plus à la mission. En arrivant, je me retirai dans mon cabanon, froid comme la glace. Mes voisins étaient plus qu'indifférents. La colère de leur fanatisme éclata surtout quand le chef de la famille se rendit à Dieu et au cri de sa conscience, après trente ans d'indifférence.\n\nA son retour du fort Cumberland, le R. P. Gasté me laissa Mathias, jeune Cris élevé à Saint-Albert. Ce jeune homme m'aida à faire la pêche sous la glace ; après mon départ, il continua tout seul en canot. Avec le poisson et les quelques vivres que j'avais apportés du lac Caribou, nous eûmes de quoi vivre et de quoi nourrir deux sauvages que j'avais loués pour équarrir du bois. J'eus bien des ennuis pour tout ce qui regarde le petit train domestique. Il faut en effet faire tous les métiers et acquérir de l'expérience à ses dépens.\n\nAu mois de mars, j'allai à trois jours d'ici, en plein pays protestant, voir un pauvre malade qui m'avait envoyé chercher par son fils avec une traîne. Arrivé en face du temple, mon conducteur arrête ses chiens et tous les sauvages assemblés sur la côte viennent me serrer la main ; ils n'étaient pas retenus par la crainte du ministre, qui était reparti la veille. Le maître d'école de la mission me fit suivre par son plus ardent zélateur. Cet individu s'attacha à mes pas à la façon des traiteurs de fourrures ; cela n'empêcha pas les deux familles catholiques du pays de se réunir chez le malade. Tous se con-\nfessèrent, le malade communia et je repartis après deux jours d'arrêt, laissant ces bonnes gens contents. Moi, j'étais bien heureux. C'est au fort que j'appris la mort de notre vénéré Pie IX.\n\nEn revenant, le mauvais temps nous surprit : nous jeûnâmes un peu et de plus j'échappai à une mort certaine. C'était à notre dernier campement du soir. J'étais debout, distrait par je ne sais quelle pensée, lorsque tout à coup, levant instinctivement la tête, j'aperçus un arbre énorme qui, ébranlé par la tempête, allait m'écraser dans sa chute. Je n'eus que le temps de me détourner, et une seconde après, le géant tombait à la place que j'occupais. Toute la soirée je fus impressionné par le souvenir du péril que j'avais couru, et je remerciai Dieu, qui m'avait préservé.\n\nPendant tout le carême et aux fêtes de Pâques, nous ne fûmes que trois catholiques au lac Pélican : le post master de l'endroit, mon jeune homme et moi. Le premier eut le bonheur de faire sa première communion à l'âge de cinquante ans.\n\nVers la fin de mai, tous les sauvages arrivèrent en canot. Je reconnus avec bonheur parmi eux mes chers néophytes du lac Fendu ou de Nelson River : en tout ils n'étaient que dix. À notre réunion du soir ils montrèrent qu'ils n'avaient oublié ni prières ni cantiques. Dès cette entrevue, le plus âgé d'entre eux, digne assurément d'être comparé aux premiers chrétiens, me dit : « Oh ! mon père, cette année ce n'est pas comme l'an passé, on a grand besoin de se confesser, moi surtout. »\n\nCes bons néophytes avaient eu à supporter beaucoup de tracasseries de la part de vieux sorciers. Deux jeunes gens me demandèrent le baptême et je jugeai par les réponses qu'ils firent à mes questions qu'ils étaient bien disposés : ils avaient bien appris leur catéchisme, quoique\ntout seuls et sans le secours d'autres chrétiens, pendant tout l'hiver. Je les admis au baptême et j'ai admiré dernièrement leur zèle pour la conversion de leurs compatriotes. À leur départ, je leur promis de visiter leur pays et leurs parents dans le cours de l'été. Ce fut pour eux une grande joie et l'un d'eux resta pour m'attendre et pour me servir de guide.\n\nLes, FF. Némoz et Labelle arrivèrent enfin le 5 juin et se mirent aussitôt à l'ouvrage pour élever la maison projetée depuis quatre ans. Je dus les laisser quelques jours seuls, pour faire la visite de la tribu infidèle qui habite les terres et les rivières entre Churchill et Nelson. C'était une mission magnifique à remplir et dont je n'étais pas digne. Elle me souriait cependant beaucoup et je tâchai de m'y préparer le mieux que je pus.\n\nLe grand jour de la Pentecôte était la veille de mon départ. Nous priâmes pour la conversion des Cris que j'allais visiter et nous chantâmes à cette intention le Veni Creator. Depuis mon ordination, je n'avais jamais senti autant de dévotion à chanter cette hymne sublime : chaque parole touchait mon cœur. Je pensais à mon indignité et je pensais aussi à ces bons infidèles. Qui diceris donum Dei... sermone ditans guttura... hostem repellas longius... Jusqu'ici ces pauvres sauvages avaient été les esclaves du démon qui les trompait dans leurs rêves, se montrait à eux sous toutes sortes d'aspects et les tyrannisait de toute manière... Per te sciamus da Patrem, noscamus atque Filium...\n\nCe peuple docile ne demandait pas mieux que de connaître le véritable Dieu et Jésus-Christ, notre sauveur et rédempteur. Il n'attendait que l'occasion de voir un prêtre qui vint lui annoncer des vérités qu'il ignorait.\n\nLe lundi de la Pentecôte en ouvrant mon livre de méditation, je mis la main sur une feuille imprimée que le\nR. P. LESTANG venait de m'envoyer. Je fus frappé de l'apropos. Après ces mots : *Spiritus Domini replevit orbem terrarum*, j'y lus ces paroles de Notre-Seigneur : « Mon Père, l'heure est venue ; glorifiez votre Fils afin que votre Fils vous glorifie ; comme vous lui avez donné puissance sur les hommes afin qu'il donne la vie éternelle à tous ceux que vous lui avez donnés. Or, la vie éternelle consiste à vous connaître, vous qui êtes le seul Dieu véritable, et Jésus-Christ, que vous avez envoyé. » On avait ajouté la prière suivante : « Divin Cœur de Jésus, donnez-moi des âmes (trois fois) avec l'oraison : O Dieu, qui voulez que tous les hommes soient sauvés et arrivent à la connaissance de la vérité, daignez envoyer des ouvriers dans votre moisson et leur accorder la grâce d'annoncer votre parole avec une inébranlable confiance afin que vos enseignements se répandent et soient obéis et que toutes les nations apprennent à vous connaître, vous, vrai Dieu, ainsi que votre fils Jésus Christ. »\n\nDans cet admirable à-propos, je vis plus que du hasard; cela me donna confiance et me fit bien augurer de ma visite. Le démon cependant essaya de nous arrêter, car les jongleurs des environs effrayaient un de mes hommes en lui exagérant les dangers de la route dans le grand fleuve Missinipig. Moi, qui crains naturellement l'eau, je redoutais aussi ce voyage. Mais, n'importe, j'étais décidé à l'entreprendre. Je savais qu'il y avait là-bas un camp nombreux d'infidèles qui ne sont jamais dans les forts, qui ne sortent pas de leurs terres et qui n'ont encore vu ni prêtre, ni Européen. J'avais manqué à leur attente l'automne passé ; ma conscience me commandait d'aller, coûte que coûte, les trouver dans leur pays.\n\nAntoine Morin me céda son fils aîné, digue en tout de son père par ses sentiments religieux. Il me prêta aussi son meilleur canot. On le charge avec nos couvertures,\nnos vivres, ma tente et ma chapelle, et nous voilà embarqués. « Si je ne reviens pas, criai-je à nos Frères, vous écrirez au T. R. P. Général de faire dire beaucoup de messes pour moi. »\n\nComme mes deux hommes, j'avais un aviron, et je pagayais de temps en temps tout seul pendant que mes rameurs fumaient leur pipe, ou bien je ramais avec eux pour avancer plus vite. Nous traversons une suite de lacs à l'est du lac Pélican, nous remontons des petites rivières innommées et nous allons bien loin ce jour-là coucher dans une île.\n\nNous repartons le lendemain matin de bonne heure, et, avant le lever du soleil, nous arrivons à la source d'une rivière qui tombe d'un lac par une cascade de 30 mètres de hauteur. Après ce portage, nous traversons une baie du lac pour faire encore un long portage qui aboutit à un autre lac, et ainsi de suite tout ce jour-là, allant d'un lac à un lac ou d'un lac à une rivière à travers les terres.\n\nArrivés à la hauteur des terres vers midi, nous commençâmes à descendre de petites rivières qui traversent des marais, au milieu d'une forêt de joncs où nous avons de la peine à faire passer notre canot. Avant le coucheur du soleil nous arrivons à la grande Rivière, la grande Eau, comme l'appellent les Cris Missinipis. C'est la rivière aux Anglais, qui, après avoir pris la rivière Caribou, se divise en deux branches, la rivière Churchill et une autre plus dans l'est, laquelle n'est pas marquée sur les cartes, et va se joindre à la rivière Nelson.\n\nEn arrivant à ce grand cours d'eau, sur les bords duquel le démon règne en maître, je pris possession au nom de Jésus-Christ : *Adveniat regnum Dei... recedant tartareae protestates... Laudetur Jesus Christus et Maria Immaculata...* « Chantons », dis-je à mes rameurs, et le nom de Jésus-\nChrist retentit, peut-être pour la première fois, sur ce fleuve; les échos le redisent au loin.\n\nNous sommes tout à coup distraits par la vue d'un ours qui se promène sur la grève. Vite on descend à terre derrière une pointe, mais l'ours gagne le bois, où il court encore.\n\nLe lendemain nous descendons le fleuve sans presque ramer, emportés par le courant. Nous rencontrons plusieurs grands rapides, des cascades effrayantes. De ces eaux écumantes s'élèvent des nuages de vapeur qui enveloppent toute la vallée. Au bas d'un de ces rapides, dans un remous, notre sauvage tue deux esturgeons magnifiques. Le soir, en doublant une pointe, on trouve une écorce de bouleau attachée au bout d'un morceau de bois penché sur le fleuve. C'est une lettre à mon adresse, en caractères cris. Il est dit : « Prêtre, notre père, nous allons t'attendre ensemble à Pakitawagan (la pêcherie). Nous avons [tué ici seize esturgeons. Salut. » Signé : Pierre, Joseph, Martial, etc.\n\nNous passions par des endroits où notre sauvage disait avoir vu le Witiku, le mangeur de monde, et aussi le diable. Le bon vent nous favorisa ce jour-là, et j'eus, pour la première fois de ma vie, l'agrément ou plutôt le souci d'aller à la voile en canot d'écorce. Notre frêle embarcation filait vite sur les flots agités et menaçait chaque fois d'enfoncer. Mes gens chantaient ; moi je n'étais pas trop rassuré, mais je dus chanter aussi ; car on ne comprend pas ici comment un prêtre, serviteur et ami de Dieu, puisse avoir peur. À la fin je m'habituai au danger. Grâce à notre bonne voile, nous parcourûmes en peu de temps une longue distance.\n\nLe lendemain, un peu après midi, nous n'étions pas loin du camp ; nous allons à terre une dernière fois, pour faire toilette. Je mets dans le sac ma vieille soutane de\nvoyage, pour en revêtir une autre plus convenable; sur ma poitrine brille la croix d'Oblat. Après une petite collation, on pousse encore au large. J'étais très-ému, et je disais plus fort : « Cor Jesu sacratissimum, da mihi animas! »\n\nBientôt on distingue les loges et les canots sur la grève. Mon sauvage tire deux coups de fusil : aussitôt c'est un va-et-vient général dans le camp, et les sauvages accourent en me saluant par des fusillades. En débarquant, les hommes viennent me toucher la main, ainsi que les deux femmes chrétiennes. Tous les autres se tiennent à l'écart, les enfants tenant les robes de leurs mères. Je vais à eux et leur donne la main.\n\nLes sauvages d'alentour, avertis par les coups de feu, arrivent à la hâte, à force d'avirons, sautent à terre et viennent, eux aussi, me serrer la main. Je reconnais mes néophytes. L'un d'eux, Étienne, que je n'avais pas vu depuis son baptême, ne se rassasi pas de me regarder, et sa physionomie est toute souriante de bonheur.\n\nQuand ma tente fut plantée, je réunis tout le monde ; ils s'approchèrent tous, moins un bigame et ses femmes. Je comptai plus de cent personnes. Je commençai par entonner le cantique du salut, qui fut continué et repris avec un entrain admirable, non-seulement par les quelques néophytes, mais par tous les infidèles. Ensuite, je leur dis combien je les aimais, et combien plus encore le bon Dieu les aimait. Je leur parlai de l'existence de Dieu, de l'immortalité de l'âme, du ciel et de l'enfer. Ces pauvres sauvages, assis à mes pieds autour de ma tente, m'écoutaient très-attentivement. L'émotion et les larmes me gagnèrent en entendant ce peuple, infidèle encore, réciter nos prières comme l'euissent fait de vieux chrétiens, dans l'attitude la plus recueillie, et sans se lasser un instant. Au dernier cantique, si connu de tous nos\nchrétiens, on entendait les voix des enfants se mêler à celles des grand’mères ; j’étais dans l’admiration. Dès ce premier soir, ils ne me quittèrent plus. Pendant les quatre jours que je passai avec eux, à peine si je pus reposer trois heures. Chacun voulait me montrer ce qu’il savait de prières et en apprendre davantage. La prière, le catéchisme, les cantiques ; on n’entendait pas autre chose dans le camp. Mes néophytes enseignaient leurs parents, leurs frères et leurs sœurs dans leurs loges, tandis que ma tente ne désemplissait pas de gens venant, à tour de rôle, faire moutre de leur science religieuse.\n\nLa conversion de ces infidèles est véritablement extraordinaire.\n\nCe n’est pas le Missionnaire qui est allé les instruire et les engager à croire les vérités chrétiennes ; Dieu a tout fait. Il faut dire aussi que ces Cris forment un peuple à part, et, comme le dit Antoine Morin, il n’y a pas dans tout le pays de sauvages aussi francs, aussi simples et aussi dociles. Les Cris sont voleurs de leur naturel, mais ceux-là font exception ; leur âme, si droite, a accepté la vérité dès qu’elle leur est apparue.\n\nLe lendemain de mon arrivée au camp sauvage, un vieux qui aime la religion, mais qui est encore arrêté par ses rêves superstitieux, on peut même dire diaboliques, vint me dire : « Je vais chercher un caribou. » Le caribou courait encore, et bien des chasseurs n’avaient pas eu la chance d’en tuer un seul. Le vieux se disait assuré de réussir ; l’Esprit le lui avait dit la nuit précédente. En effet, après midi, il arrive triomphant, avec de la viande fraîche, et fait préparer un grand festin. Or, c’était un vendredi. J’observai tout en silence. Je le vis inviter ses compagnons ; tout le monde refusa. Il comprit, mais il parut vivement contrarié, et se mit à crier : « Que tous ceux qui ne prient pas viennent manger ! » Un sauvage\nprotestant du fort Nelson et un infidèle se rendirent seuls à cette invitation.\n\nL'hiver dernier, le même vieux sauvage, se trouvant dans les bois avec sa famille, souffrait de la faim depuis quelque temps, et les Esprits ne lui venaient point en aide dans sa chasse. Il dit alors à son fils Étienne : « Mon fils, toi tu pries ; le prêtre t'a enseigné ; prie pour nous ; fais ta prière devant nous ; on va te suivre et dire comme toi. Peut-être le bon esprit que tu adores aura pitié de nous. » Étienne ne se le fit pas dire deux fois et, tous l'imitant, jusqu'au signe de croix, récitèrent le Pater, l'Ave et le Credo dans leur langue ; après quoi, le père et le fils partirent pour la chasse. Le soir, ils revinrent, ayant tué quatre caribous. Cependant, après avoir permis à sa femme et à trois autres de ses enfants de devenir chrétiens, le vieux n'a pas voulu laisser baptiser encore ses deux petits enfants, parce que, dit-il, ses rêves ne seraient pas heureux.\n\nLe dimanche de la Trinité, après la grand'messe, j'expliquai l'évangile du jour, admirablement adapté à la circonstance : *Ite, praedicate Evangelium*.... Je leur montrai une dernière fois la nécessité du baptême, ses effets et le sens des promesses solennelles que l'on y fait. Je commençai ensuite l'administration de ce sacrement. Je fis trente-quatre baptêmes, et la cérémonie dura jusqu'au soir. Ces hommes et ces femmes disaient avec foi et de grand cœur : « Je renonce à Satan ; je crois à Jésus-Christ, à la religion catholique, » etc.\n\nIl y a à peine un an, plusieurs d'entre eux passaient jusqu'à trois jours sans boire ni manger, et allaient dormir à l'écart dans les bois ou sur les branches des arbres, pour recevoir les révélations des Esprits. Au commencement, ils ne voulaient pas même entendre parler de la religion. Quel changement en peu de temps ! Ces braves\ngens venaient à moi comme à leur meilleur ami. Les enfants surtout ne me quittaient pas. J'ai remarqué que, contrairement à tous les autres sauvages, il n'y avait pas une seule cérémonie de nos rites qui les portât à sourire. En ce grand jour de leur baptême, je bénis leurs chapelets et leurs médailles, puis je leur donnai à tous une image du Sacré Cœur, qu'ils attachèrent immédiatement sur leur poitrine. Leur ardeur à chanter me rappelait un peu les pèlerinages des Provençaux à Notre-Dame de Lumières ; on sentait que le feu sacré s'était emparé de leurs âmes. Je fis encore, ce jour-là, cinq mariages, et j'entendis les confessions des néophytes.\n\nSur le soir, je fus dans de terribles angoisses : une femme, que j'avais baptisée, vint m'apporter son pauvre enfant, baptisé aussi : « Tiens, me dit-elle, voilà mon fils bien mal ! » Pris d'une forte fièvre, il soupirait et ne demandait plus la mamelle. S'il venait à mourir, la foi de mes néophytes ne serait elle pas ébranlée ? Il est vrai que, l'année dernière, un enfant, dans le même danger que celui-ci, étant mort entre mes bras, son père, quoique protestant, était venu m'apporter son second enfant à baptiser ; cependant j'étais perplexe. Que faire ? je n'avais pas de médecines à donner, et d'ailleurs l'enfant était trop petit. Ma prière n'était pas digne d'obtenir cette guérison. Je pris mon rituel et je récitai l'oraison Pro puero infirmo. Le lendemain, je n'osais pas entrer dans la loge des parents ; mais je m'informai, et j'appris que le petit malade était bien portant. Dieu m'avait protégé.\n\nNous voulions repartir de bonne heure, ce jour-là, mais nous fûmes arrêtés par le vent contraire. Quelques infidèles vinrent me demander de revenir encore l'été prochain, afin qu'eux aussi pussent recevoir le baptême. La doctrine chrétienne a pour eux un grand prestige. Ceux que le ministre méthodiste de Northward-House a baptisés\nne savent absolument rien de la religion, pas même un cantique; tandis que nos chrétiens savent les vérités né-cessaires au salut et plus encore, ainsi que les prières et de nombreux cantiques. Plusieurs même lisent aussi bien que moi dans les livres cris. J'ai reçu là-bas deux abjura-tions, et je regrette beaucoup de n'avoir pu aller jusqu'à la rivière du Rat, où il y a, m'a-t-on dit, plus de trois cents sauvages qui n'ont jamais vu le prêtre. J'irai les voir le plus tôt possible, ou plutôt je les attendrai, l'été prochain, au camp où je suis allé et où ils viennent tous les étés.\n\nMon très-révérend et bien-aimé Père, je l'ai dit à Mon-seigneur, il y a dans ces quartiers un bon peuple et un peuple nombreux à évangéliser; mais il est à proximité des missions méthodistes. Si nous ne nous hâtons d'aller chercher ces âmes, elles tomberont dans l'hérésie. On a bâti, au fort Cumberland, une mission qui a son impor-tance et qui sera toujours un pied-à-terre pour nous dans le chef-lieu du district, mais dont on me semble trop se préoccuper. Il n'y a pas un seul sauvage infidèle à con-vertir dans cet endroit, où ne se trouvent que quelques métis et une famille sauvage partie d'ici. Les protestants seront toujours plus difficiles à convertir que les infidèles; ceux-ci seront peut-être perdus à jamais, si vous n'al-lons à leur secours. Je crois sincèrement qu'il serait très-avantageux de bien établir la mission du Sacré-Cœur de Jésus. C'est d'ici qu'on irait voir les Cris de Nelson-River, qui, une fois convertis, viendraient tous les ans à cette mission, comme d'autres vont à l'île à la Grosse.\n\nRecevez, mon très-révérend et bien-aimé Père, la nou-velle assurance de mon respect filial et obéissant en N. S. et M. I.\n\nDonnald, O. M. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007627.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 13, "total-input-tokens": 18176, "total-output-tokens": 7263, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1448, 1], [1448, 3255, 2], [3255, 5116, 3], [5116, 6891, 4], [6891, 8719, 5], [8719, 10609, 6], [10609, 12384, 7], [12384, 14163, 8], [14163, 15992, 9], [15992, 17854, 10], [17854, 19702, 11], [19702, 21604, 12], [21604, 23357, 13]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false]}}]