[{"id": "93155f1347261e7d54b895f049951dda748491be", "text": "VICARIAT DE LA SISKATCHewan.\n\nMISSION DE SAINT-JEAN-BAPTISTE.\n\nLETTRE DU R. P. CAER AU TRÈS-RÉVÉREND PÈRE\nSUPÉRIEUR GÉNÉRAL.\n\n(Suite et fin 1.)\n\n« J'ai trouvé chez les Sauvages du portage à la Loche d'excellentes dispositions religieuses, mais une grande ignorance qui, du reste, ne doit pas surprendre, car ce poste n'a été visité que rarement et en passant, de sorte que ceux qui le fréquentent ont dû bien vite oublier le petit nombre de vérités que les Missionnaires ont pu leur enseigner. Le séjour de huit mois que je viens de faire au milieu d'eux leur aura fait du bien ; j'ai fait de grands progrès dans leur langue, et j'ai travaillé autant que cela m'a été possible à les instruire. Ils commencent à oublier l'épreuve que Dieu leur avait envoyée l'été dernier ; ma présence les console et les encourage : « Dieu m'a bien affligé, me disait l'un d'eux il y a quelques jours ; j'ai perdu trois enfants ; je n'avais pas le cœur fort, l'automne dernier, mais aujourd'hui je suis bien content. » En te voyant, il me semble voir le bon Dieu ; oui, je comprends maintenant ce que tu nous as dit, que Dieu est le seul père, le seul maître de mes enfants ; il peut\n\n1 Voir t. VII, p. 230.\n« les prendre quand il le voudra ; il n’a fait que me les\nprêter... » Je restai seul, éloigné de tout confrère, pen-\ndant huit mois, au portage à la Loche, et je ne pouvais\nespérer de sortir de cet isolement en retournant, au prin-\ntemps, à l’île à la Crosse, parce que Mgr GRANDIN devait\nalors se rendre à la rivière Rouge, où l’appelaient les in-\ntérêts de nos Missions. Ainsi, notre petit nombre nous con-\ndamne souvent à l’isolement, à un isolement long et bien\npénible. Personne, plus que nous, ne soupire après le\nmoment où nous deviendrons assez nombreux pour être\ntoujours au moins deux, selon l’esprit de notre institut et\nvotre désir souvent exprimé. Oui, il est bien pénible de\nvivre dans l’isolement auquel nous sommes si souvent\nréduits. Mais il est encore plus pénible de voir mourir les\nsauvages avant qu’ils aient eu le bonheur de connaître\nnotre sainte religion. Tous, nous aimons trop les sau-\nvages pour ne pas nous résoudre volontiers à supporter\ntous les sacrifices nécessaires, afin de leur faire connaitre\nles bienfaits et le prix de la rédemption. »\n\nRivière au Canot, 5 août 1866.\n\n« Je reprends, mon très-révéré et bien-aimé Père, la\nlettre que j’avais commencé à vous écrire il y a quelques\nmois déjà, et que j’ai dû interrompre.\n\n« Je rentrais, au commencement d’avril, de la mission\nque j’avais eu à donner aux sauvages du portage à la\nLoche. Mgr GRANDIN qui se préparait à partir pour la ri-\nvière Rouge fut très-heureux de me revoir. Peu après mon\narrivée à l’île à la Crosse, j’eus à entreprendre deux\nvoyages bien pénibles : l’un de trois jours sur la neige, au\nfort de l’hiver, l’autre de deux jours sur la glace fondante\ndu printemps. Le 2 mai, Mgr GRANDIN me quittait me lais-\nsant seul pour tout l'été à la mission de l'île à la Crosse. Quelques jours après le départ de Sa Grandeur, les Sauvages commencèrent à arriver pour la mission du printemps. Bien que l'absence de Monseigneur leur fût connue, ils vinrent en plus grand nombre que jamais. Aussi, pendant une quinzaine de jours j'ai été vraiment accablé de travail. J'avais tout à la fois à évangéliser deux nations sauvages et à régler les affaires matérielles de la mission. Mes forces ne tardèrent pas à m'abandonner; bientôt je tombai épuisé de fatigue, et depuis lors je suis resté dans un état de faiblesses qui va toujours croissant, et qui m'empêcherait absolument, s'il durait, de supporter les fatigues d'un voyage pareil à ceux que nous avons coutume d'entreprendre dans ce pays.\n\n« Pendant le temps de la mission j'ai consacré chaque jour toute la matinée à instruire et à confesser les Cris; la soirée entière, je la donnais à mes chers Montagnais. Il ne s'est présenté aucun incident qui mérite d'être mentionné. Nos Indiens se sont montrés, comme à l'ordinaire, pleins de bonne volonté. Les Montagnais surtout étaient heureux de voir qu'après une étude de six mois, je pouvais les comprendre, les confesser et leur donner des instructions, chaque jour, en leur langue.\n\n« Bien qu'à la rigueur un seul Père puisse suffire à donner la mission de l'île à la Crosse, comme j'ai dû le faire, il serait grandement à désirer qu'il y eût deux Pères à cette résidence, au moins pendant le temps de la mission. C'est une rude besogne pour un seul Père, et comme il ne peut se donner sans partage à deux nations à la fois, il court risque de voir les pauvres sauvages se décourager un peu, et même leur ferveur s'évanouir. À la fin de la mission que je donnai, deux cent soixante et dix sauvages s'approchèrent de la sainte table. Nous eûmes la procession ordinaire du très-saint sacrement, qui se fit\navec une piété admirable. J'aimais à penser que notre divin maître était plus honoré par les cœurs simples de nos Indiens et leur esprit naïf, que par cette pompe et cet éclat qui se déployent dans les pays civilisés, quand ils ne sont pas accompagnés d'un grand esprit de foi.\n\n« La famine obligea les sauvages à se retirer de la mission plus vite qu'ils n'eussent voulu, et que je ne l'aurais désiré moi-même. Au reste, mes occupations n'ont pas beaucoup diminué malgré leur départ. Vous connaissez déjà les œuvres qui sont à la charge de cette mission : celle de l'école et celle des vieilles sauvagesses me donnent ensemble soixante-cinq personnes à nourrir, chaque jour, et je n'ai autre chose pour arriver à ce résultat que la pêche du lac et la divine Providence. J'avoue ne pouvoir comprendre comment la mission pourra arriver, avec les moyens dont elle dispose, à continuer, moins encore à développer les œuvres que nous avons entreprises.\n\n« Aussi, ne serez-vous pas étonné d'apprendre que cet été je me suis vu dans la pénible nécessité de donner congé à tous les enfants de l'école, pendant un mois et demi. Je n'avais plus rien pour les nourrir. Je pris une autre résolution à laquelle je ne me serais jamais arrêté, si nos besoins avaient été moins grands. Je voulus aller moi-même sur les bords de la rivière au Canot surveiller quinze de nos travailleurs occupés à ramasser le foin qui est nécessaire pendant l'hiver à notre bétail. C'est des bords de cette rivière que je vous écris en ce moment; j'y suis fort embarrassé, n'ayant rien pour y nourrir mes hommes. Je suis obligé de faire chasser aux lièvres et aux canards; mais les efforts réunis de deux chasseurs ne nous donnent qu'une nourriture si peu abondante, qu'à coup sûr les hommes engagés à mon service refuseraient de se livrer au travail si je n'étais ici pour les encourager. Le poisson qui dans ces contrées\nest la ressource la plus ordinaire, nous a entièrement manqué pendant tout l'été.\n\n« Je ne veux point, mon très-révérend Père, laisser la plume, sans vous citer un fait qui vous montrera l'esprit de dévouement et d'abnégation de nos bonnes Sœurs, et en particulier de leur digne Supérieure. « Il m'en coûte beau-\n« coup, leur disais-je, quelques jours avant mon départ\n« pour la rivière au Canot, de m'éloigner de vous, puisque\n« mon absence doit vous priver de vos communions et d'as-\n« sister à la sainte messe. » — « Mon Père, me répondit la\n« Supérieure, nous aussi nous pouvons faire quelque sa-\n« crifice en faveur de la mission. Je suis convaincue qu'il\n« vous est nécessaire d'accompagner vos hommes. Allez\n« donc sans crainte à notre égard, le bon Dieu saura\n« bien nous dédommager des privations que votre ab-\n« sence va nous imposer. »\n\n« Daignez, mon très-révérend et bien-aimé Père, bénir\nle plus indigne, mais non le moins affectionné de vos\nenfants.\n\n« CAER, O. M. I. »", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007502.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 6690, "total-output-tokens": 2405, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1191, 1], [1191, 2904, 2], [2904, 4790, 3], [4790, 6680, 4], [6680, 7664, 5]], "primary_language": ["fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]