[{"id": "a4d9120355542a4991b9bf2ab65c4f11498b9c30", "text": "rosité d’un bourgeois du fort, notre cuisinier prépara un confortable déjeuner pour mes premiers communiants. Chacun eut sa part de pain, de viande et de thé : ce fut une improvisation des mieux réussies. La bonne grand’mère sortit la dernière de l’église et, après avoir fait quelques pas, elle rétrograda sous le coup d’un regret pour voir encore une fois le petit autel du sacrifice ; elle lui fit une grande révérence accompagnée d’un grand signe de croix. Je me disais : C’est son nunc dimittis. La fête terminée, elle repartit définitivement, appuyée sur son bâton et dirigée par la main de sa petite fille qui, elle aussi, avait communié ; bientôt elle disparut, pour aller sans doute, après un si grand bonheur, rendre le dernier soupir dans quelque solitude inconnue de la forêt. Que Dieu reçoive son humble servante : Beati pauperes spiritu, quoniam ipso rum est regnum caelorum ! »\n\nILE A LA CROSSE.\n\nLe R. P. LÉGEARD, dans une lettre datée du 10 janvier 1876, rend ainsi compte d’une cérémonie de première communion à l’île à la Crosse et du passage de Mgr GRANDIN.\n\n« Le jour du Patronage de saint Joseph les plus grands de nos enfants faisaient leur première communion. Jamais, à l’île à la Crosse, on n’avait vu une aussi belle cérémonie, jamais aussi notre petite église n’avait été si magnifiquement décorée. De grandes oriflammes ayant servi au couronnement de Notre-Dame de Sion, et apportées ici par un junioriste qui avait accompagné Monseigneur, se balançaient avec grâce au-dessus de l’assistance et transformaient l’aspect de notre sanctuaire.\n« Au commencement de juin, Mgr Grandin est enfin arrivé, nous ne l'avions pas vu depuis l'automne de 1872 ; aussi la joie a été grande. Nous avons profité de sa présence pour faire solennellement quelques cérémonies. Notre mission n'avait pas été consacrée au Sacré Cœur, suivant l'ordonnance du Chapitre général de 1873. La visite de Sa Grandeur nous offrait l'occasion d'accomplir cet acte religieux avec plus d'éclat, et nous choisimes pour cela le jour même du Sacré-Coeur, 4 juin 1875.\n\n« Les sauvages, ayant appris que Monseigneur devait venir ici, sont accourus ce printemps en plus grand nombre que jamais, et la mission a été une des plus belles dont j'aie été témoin. Elle a été clôturée par la plantation d'une croix de 35 pieds de haut, sur l'emplacement d'une autre croix renversée par le vent deux ans auparavant. Tous nos sauvages, hommes, femmes, enfants, alignés deux à deux, se rendirent en procession à l'endroit désigné pour la cérémonie, en chantant des cantiques en langue sauvage. La croix était portée par dix-huit hommes, choisis parmi nos métis, les Montagnais et les Cris. La procession offrait une pompe céleste, un ordre aussi satisfaisant que les processions de France.\n\n« Le lendemain, 21 juin, Mgr Grandin partait pour le lac Caribou, emmenant avec lui le F. Labelle, qui avait passé l'hiver ici. La cérémonie du départ fut bien touchante. Tous nos braves gens étaient rangés sur le rivage pour dire un dernier adieu à Sa Grandeur et recevoir encore une bénédiction, et à peine le canot eut-il gagne le large, que, pendant plus d'un quart d'heure, une fusillade bien nourrie, que je crois pouvoir évaluer sans exagération à mille coups de fusil, fit retentir tous les échos du voisinage. »\n\nDes notes de voyage de Mgr Grandin, et de quelques\nPères de son diocèse, arrivées postérieurement aux lettres dont on vient de lire des extraits, et par conséquent mentionnées ici, non d’après l’ordre hiérarchique, mais d’après l’ordre de réception, donnent jour par jour le détail des travaux et des souffrances de Sa Grandeur et de ses compagnons. Citons quelques passages de ce journal :\n\n« Le dimanche, 1er août, je terminai les exercices de la mission au fort Cumberland par une messe aussi solennelle que possible, à laquelle la plupart des catholiques suffisamment instruits eurent le bonheur de communier ; deux d’entre eux s’approchaient pour la première fois de la sainte table. J’administrai ensuite le sacrement de confirmation.\n\n« Le soir, profitant de la bonne volonté du bourgeois du district et des catholiques du fort, je pris possession d’une place pour une mission, et chacun me promit de fournir une certaine quantité de bois nécessaire à la construction d’une maison qui servirait de chapelle provisoire et d’habitation pour le Missionnaire. Je crains bien que leur zèle ne se soit ralenti, car je n’ai pu tenir ma promesse d’envoyer ce Missionnaire. Je le regrette infiniment ; nous n’avons pas de pied-à-terre dans ce vaste district du Cumberland ; les protestants au contraire y sont très-bien installés, aussi nos catholiques y sont exposés dans leur foi, et tout le monde nous désire, à l’exception des ministres.\n\n« Le lendemain, 2 août, je partais solennellement, c’est-à-dire accompagné jusqu’au rivage par les jeunes gens du fort et des environs, tant catholiques que protestants, et salué par de bruyantes détonations. M. Bellanger, qui s’était montré si aimable pour les PP. Blanchet, Bonald, et pour moi, eut la bonté de nous fournir de provisions. Je me séparai du P. Bonald, qui devait attendre encore quelques jours avant de partir pour le lac Caribou. Trois hommes montaient mon canot, sans compter un\njeune Américain. Nous dinâmes à l'embouchure de la Siskatchewan dans le lac Cumberland. Les chaleurs ayant fait fondre les neiges des montagnes Rocheuses, le fleuve croissait de jour en jour ; ce qui fut un obstacle nouveau pour remonter le courant. Nous rencontrâmes le steamboat qui venait d'Edmonton pour la première fois ; dans quelques années peut-être ces moyens de transport seront multipliés, et nous pourrons en profiter pour avoir nos effets à meilleur marché et dans un état de plus grande préservation. Déjà, cette fois, Mgr Faraut a pu remonter par ce steamboat, ce qui a été pour Sa Grandeur un avantage immense. »\n\nLe 9 août, Mgr Grandin arrivait au fort la Corne, poste assez important de la compagnie, situé sur la rive droite de la Siskatchewan. Sur la rive opposée se trouve une mission protestante dont le ministre venait de mourir quelques jours auparavant. « De tous les postes de la compagnie que j'ai visités, dit Monseigneur, c'est le premier où je ne trouve aucun catholique. » Malgré cela l'accueil fut très-hospitalier.\n\nLe 13, Mgr Grandin arrivait au Prince-Albert : « Je n'avais jamais vu cette place, dit-il ; elle est magnifique et les récoltes ont la plus belle apparence. A en juger par les maisons que j'ai vues, il peut y avoir trois cents habitants, et déjà il y a trois temples protestants. C'est là que l'Évêque protestant de la Siskatchewan a fixé sa résidence. Cette colonie m'a paru pleine d'avenir ; elle est établie sur la rive droite de la Siskatchewan, où les terres sont excellentes ; sur la rive gauche les terrains sont boisés. Mais les inondations de l'année dernière ont fait des ravages et plusieurs habitants même y ont trouvé la mort. »\n\nDu Prince-Albert, Mgr Grandin se rendit à Saint-Laurent, mission du P. André. Là se trouvaient réunis les PP. André et Fourmond, le F. Grandin, neveu de Monseigneur, au-\njourd'hui Prêtre; ce dernier venu là depuis quelques jours avec le P. Husson et les autres sujets de Mgr Faraud, ainsi que les FF. Fayard et Vantighen. Les Missionnaires du Mackenzie avaient continué leur voyage et Mgr Grandin n'eut pas la joie de les rencontrer. Mais le bonheur de causer longuement avec le P. André et de retrouver quelques-uns des siens fut une compensation au sacrifice.\n\nDe là Mgr Grandin continua sa route avec le F. Grandin, le jeune Américain et un Montagnais. Bien des encombrements et des accidents semèrent d'aventures cette dernière partie du voyage : des chevaux perdus, des essieux cassés, des rivières débordées, des marais où l'on s'embourbait ; mais le courage des Missionnaires était au-dessus de ces épreuves. Mgr Grandin cependant souffrait cruellement d'un mal d'oreilles. La présence de son neveu, l'habileté avec laquelle il savait aider son vénérable oncle, improviser la cuisine, préparer les campements, supporter les fatigues, adoucirent les souffrances du retour. Mais il était temps de retrouver Saint-Albert, après un si long voyage et de si pénibles stations.\n\nLe 31 août, l'Évêque rentrait dans sa ville épiscopale au son des cloches, et bientôt il oubliait dans la compagnie de ses Frères les souffrances de la visite pastorale.\n\n« Quand je suis quelque temps absent de Saint-Albert, dit-il, je trouve toujours à mon retour d'heureux changements. Outre plusieurs constructions achevées, je trouvais achevé le beau pont auquel on travaillait à mon départ ; je trouvais de magnifiques moissons prêtes à être récoltées ; l'aspect des hommes et des choses témoignait de la bonne direction de la maison et de la bonne volonté de tout le monde. Le P. Lestang était venu à ma rencontre ; le P. Charrière, novice, était occupé avec des Frères à couper les foins ; je ne pus les voir que le soir. Le lendemain de mon arrivée, je reçus plusieurs visites et visitai moi-même nos\nécoles. Le soir, nos novices entraient en retraite pour se préparer à leur Oblation. »\n\nL’Evêque de Saint-Albert parle beaucoup des autres et de leurs travaux, et très-peu de lui-même Son mal d’oreilles augmente à Saint-Albert, malgré une vie plus calme, et ses Frères en religion éloignés de lui verraient leur inquiétude grandir encore, si dans une lettre plus récente du P. Leduc, écrite de Saint-Albert, à la date du 5 janvier 1876, nous ne lissions cette phrase plus rassurante : « J’eus la consolation, en me jetant dans les bras de Monseigneur, de trouver Sa Grandeur beaucoup mieux et presque rétablie de la cruelle maladie qu’elle vient de faire. »\n\nLes Annales continueront dans les numéros suivants de donner des nouvelles de l’Évêque de Saint-Albert et des vastes missions confiées à son zèle.\n\nMACKENZIE.\n\nLes membres de la Congrégation ont appris de divers côtés la mort cruelle du cher Frère Alexis Reynard, tué et mangé par un Iroquois, son compagnon de voyage. En attendant les renseignements complets que nous donnera la circulaire nécrologique, nous croyons devoir consigner ici quelques détails sur ce tragique événement ; ils sont extraits d’une lettre du P. Leduc, écrite de la mission de Notre-Dame des Victoires, au lac la Biche, en date du 10 décembre 1876 :\n\n« Mgr D’Anemour arrivait ici le 27 juillet : grande fête et réjouissance à la mission. Hélas ! nous ne devions pas nous réjouir longtemps. Dès le lendemain, nous apprenions de bien tristes nouvelles au sujet du bon Frère Alexis Reynard, en route du lac Athabaskaw au lac la", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007583.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8304, "total-output-tokens": 3154, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1568, 1], [1568, 3342, 2], [3342, 5230, 3], [5230, 7092, 4], [7092, 9010, 5], [9010, 10568, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]