[{"id": "cf2937c0cdb24e7e6f1307ed73839c5ffbf5770d", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÈE\n\nN° 75. — Septembre 1881.\n\nMISSIONS ÉTRANGÈRES\n\nSAINT-ALBERT.\n\nJournal de voyage de Mgr GRANDIN (Suite) (1).\n\nSur la rivière la Loche, Portage-Mac-Leod\n15 juin 1880.\n\nMON TRÈS RÉVÉREND PÈRE,\n\nLe 25 mai, à midi, je partais du lac Vert, non plus cette fois en canot d’écorce, mais en berge, à cause des dangers que le débordement des eaux eût fait courir à une frêle embarcation. Nous n’avions que trois rames, mais notre marche n’en fut pas moins rapide pour cela, et la nuit ne la ralentit nullement. Nous nous laissions aller au courant qui nous pousse, en obéissant à la direction du gouvernail. Le 26, je fus privé de la consolation de dire la\n\n(1) Voir le numéro de juin 1881.\n\nT. XIX.\nmesse ; il était, en effet, impossible de faire relâche ; mais le 27, au matin, un vent favorable nous ouvrait un passage à travers les glaces du lac, nous arrivions à l'île à la Crosse. Quelques coups de fusil tirés de notre berge donnèrent l'éveil ; aussitôt on y répondit de la terre, et bientôt la fusillade fut si nourrie, qu'on eût dit une petite guerre. Peu après, j'étais entouré des PP. Legoff, Chapelière, Rapet et des Fr. Marcilly et Laudry. Je montai immédiatement à l'autel : c'était la fête du Saint-Sacrement. Après la messe j'adressai la parole à l'assistance ; elle était encore peu nombreuse à cause des difficultés que la glace opposait à la prompte arrivée des sauvages. Nous profitâmes de ce retard pour nous voir en famille et goûter le bonheur de la vie de communauté, ce qui est moins facile quand les sauvages sont tous réunis, car alors ils ne nous laissent plus un moment de liberté.\n\nIl y avait déjà cinq ans que je n'avais visité cette chère mission de l'île à la Crosse. À chaque visite, je constate qu'elle est en véritable progrès. Cette dernière fois encore j'ai pu faire cette consolante remarque. Le regrette P. Légeard, il est vrai, n'est plus là, la mort nous l'a enlevé, mais son souvenir est vivant, et bien que la reconnaissance ne soit pas la vertu des sauvages, je puis dire que la population est ici sous le coup d'un deuil profond. Cris et Montagnais, métis, catholiques, protestants, tous regrettent cet excellent Missionnaire qui savait se faire tout à tous, et chacun se trouve atteint personnellement par sa mort. Avant lui la mission avait déjà fait une première perte bien sensible, dans la personne d'une religieuse toute dévouée aux intérêts des habitants. Cette bonne sœur s'était employée pendant treize ans avec un grand zèle à l'éducation des petits sauvageons et à l'assistance des pauvres vieilles abandonnées. Elle était le meilleur auxiliaire des Missionnaires. Fort habile à la couture,\nelle rendait les plus grands services et, grâce à elle, les enfants étaient tenus fort proprement et convenablement vêtus. Elle raccommodait, réparait, remettait à neuf avec un merveilleux talent et nous épargnait bien des dépenses.\n\nLes Missionnaires de l'Île à la Crosse et ceux aussi du lac Caribou n'oublieront pas cette sainte fille.\n\nLe lendemain de mon arrivée, je fis ma visite au cimetière. À l'ombre de la croix principale placée au centre repose notre bon P. Légeard. Il attend la bienheureuse résurrection au milieu des sauvages qu'il a baptisés et instruits et qui l'ont précédé ou suivi dans la mort. À une extrémité du champ funèbre, il y a une autre croix que je distinguai tout de suite entre toutes, et aussitôt je me dirigeai vers la tombe qu'elle surmonte. C'est celle du cher F. Dubé; il repose entouré des petits garçons recueillis et morts à la mission et dont la plupart ont été soignés par lui avec la charité d'une mère. Je vais aussi réciter un De profundis sur la tombe de la sœur Dandurand, qui, elle aussi, a succombé à la peine. Elle est là, cette bonne sœur, au pied d'une croix de bois, et autour d'elle reposent dans la paix les pauvres sauvagesses, les petites filles qu'elle nourrissait autrefois et vêtit de l'industrie de son travail. J'ai les yeux pleins de larmes et le cœur plein de regrets, et je me dis que c'est dans ce champ tranquille, peuplé de tant de morts regrettées, que j'aimerais moi-même à trouver la place de mon repos.\n\nLe samedi 29 mai, des groupes de sauvages retardés par la glace arrivent; l'église est pleine et même elle est insuffisante. Autrefois elle était trop étroite; maintenant, malgré l'adjonction d'une sacristie et d'une tribune, elle ne peut donner place à tout le monde. C'est une preuve manifeste de l'augmentation de la population. Le P. Legoff,\nregistre en main, constate que cette augmentation est de 100 personnes, sur un chiffre de 700 à 800 Montagnais qui fréquentent habituellement la mission. Il n'y a pas ici d'insidèles ; tous les sauvages sont chrétiens et l'on peut même dire que leurs habitudes deviennent chaque jour plus conformes à leur foi. La véritable civilisation a pénétré dans leurs mœurs, et si le pays était plus favorable à la culture, ils deviendraient, à n'en pas douter, une peuplade toute transformée au point de vue temporel comme au point de vue spirituel. Les bords du lac, dans la portion cultivable, sont couverts de maisons qu'entourent de petits champs; des villages se forment ainsi, semés de distance en distance, jusqu'à 10, 20, 30 et même 40 lieues. Au printemps et à l'automne, les habitants montent en canot et viennent visiter la mission; ils y passent en moyenne de dix à quinze jours. À son tour le Missionnaire doit rendre la visite dans les villages, ce qui exige de longs déplacements. Les instruments aratoires et les outils de défrichement sont encore rares entre les mains de nos bons sauvages, cependant le besoin les rend inventifs et ils arrivent à des résultats de culture déjà satisfaisants. La chasse, qui diminue chaque jour, les oblige à être prévoyants et à demander à la terre ce que les bois leur refusent. Les animaux à fourrures disparaissent comme les autres, et avec eux la facilité des échanges; c'était, en effet, avec les fourrures qu'ils achetaient mobilier, instruments de travail, vêtements et autres objets utiles.\n\nAfin d'être aidés dans leurs efforts de colonisation, les sauvages m'ont prié d'intervenir en leur faveur auprès du gouvernement. S'il y a des sauvages dignes d'intérêt, assurément ce sont bien ceux de l'île à la Crosse. Vous ne sauriez vous faire une idée du nombre d'enfants qu'on m'a proposés, me priant de les élever dans notre orphe-\nlinat. J'en ai accepté plusieurs, plus même que le cher P. Legoff n'aurait voulu et plus que la prudence humaine ne le conseillait. La maison provisoire que nous avions bâtie après l'incendie, et qui depuis longtemps est exclusivement habitée par les enfants, menace ruine et il faut aviser à en avoir une autre plus solide et plus spacieuse. Le P. Légeard avait entrepris une construction de 80 pieds de longueur sur 75 de largeur, avec étage. Cette nouvelle maison était destinée à servir tout à la fois d'orphelinat et d'hôpital. Le bon Père est mort au moment où tous les préparatifs de construction étaient faits; les PP. Legoff et Chapelière ont eu à cœur de continuer son œuvre. Je dus m'opposer d'abord à l'exécution de ce projet à cause des dépenses qu'il eût entraînées; mais, tout aussi convaincu que les autres de l'opportunité d'une création de ce genre, je n'ai pas maintenu longtemps ma résistance. Je me suis contenté de réduire le projet à des proportions plus modestes et à remettre à des temps meilleurs la construction d'un hôpital complet. Toutefois, comme l'expérience m'a démontré que nos sauvages meurent du défaut de soins plus encore que de maladie, j'ai consenti à ce qu'un appartement fût disposé pour recevoir les vieilles femmes. Près de la mission, il y a une maison achetée par les Pères où ils entretiennent à leurs frais quelques vieillards infirmes. C'est aussi une sorte d'hôpital, de sorte que, sans soulager toutes les misères, nous courrons au plus pressé en recueillant parmi nos sauvages les plus abandonnés et les plus malheureux.\n\nLe dimanche 30 mai, j'ouvrais la mission par un office pontifical. M'adressant aux Montagnais, je leur dis que si je me trouvais parmi eux durant cette période d'exercices, c'était plutôt à titre d'auxiliaire des Missionnaires qu'à titre de directeur de leurs travaux. Le P. Legoff, en effet, parle la langue montagnaise dans la perfection, et\nmoi, qui l'ai beaucoup oubliée, je n'aurais jamais pu la manière avec assez d'aisance pour prêcher avec fruits pendant plusieurs jours. Aussi me borné-je au ministère de la confession. Nous avons ainsi donné trois missions simultanément en trois langues différentes. Les PP. Legoff et Rapet donnaient les exercices en montagnais à l'église ; le P. Chapelier les donnait aux Cris à la chapelle des Sœurs, et moi je réunissais dans la maison neuve la population parlant français. Les Sœurs et leurs enfants étaient mes auxiliaires pour le chant des cantiques.\n\nLe dimanche 6 juin, il y eut un second office principal à la suite duquel j'administrais le sacrement de confirmation à une vingtaine de sauvages. Le soir nous fîmes la procession du saint sacrement ; le reposoir était magnifique et les sauvages étaient enthousiasmés. Au retour, je reçus l'abjuration d'un métis protestant et lui conférai le baptême. Je ne sais comment les PP. Legoff et Chapelier ont pu suffire au travail. Au milieu de la mission, le dernier tomba malade, mais il ne voulut retrancher quoi que ce fût à son labeur. Prédications, chant des cantiques, catéchisme, confessions de jour et de nuit, confessions d'enfants, nos Pères acceptaient tout, et rien ne pouvait ralentir leur zèle.\n\nGrâce à un vent favorable, nous pouvons arriver à la mission du Grand-Portage le 15 juin. Cette mission est dédiée à la sainte Vierge sous le titre de la Visitation ; elle est fréquentée par environ deux cents sauvages, cantonnés sur les bords du lac la Loche et du lac Poisson blanc. Ces sauvages habitent des maisons. Le P. Legoff vient les visiter régulièrement deux fois chaque année.\n\nLe lendemain de mon arrivée, avant ma messe, je confessai à domicile un pauvre poitrinaire ; on l'apporta ensuite à la maison, où il communia, reçut le sacrement de confirmation, l'extrême-onction et l'indulgence in articulo\nmortis. Je passai ensuite ma journée à confesser pour préparer les sauvages à la communion, et le lendemain j'en confirmai vingt. Le lendemain je recommençai, et le 18, par les berges, je reprenais le chemin de l'île à la Crosse.\n\nMission de Saint-Joseph du lac Cumberland, 3 août 1880.\n\n— Le voyage de l'île à la Crosse à la mission de Sainte-Gertrude du lac Pélican s'est effectué lentement. Je comptais sur huit jours de voyage, je n'arrivai qu'à la quinzième journée. Notre canot était surchargé, et la pluie et le vent qui agitaient nos lacs rendaient nos sauvages timides et ne leur permettaient pas de se lancer à toute vitesse. Mon passage sur les divers points de l'itinéraire fut marqué par des faits providentiels. Dans un campement, je rencontrai une pauvre femme montagnaise qui se mourait ; ce fut pour elle la grâce du Nunc dimittis. Précédemment, j'avais baptisé un petit enfant, né la veille. Ailleurs nous rencontrâmes une famille qui ne venait pas à la mission de l'île à la Crosse et qui vivait dans une complète ignorance. La misère temporelle était grande aussi chez elle, et nous dûmes prendre sur nos faibles ressources pour l'assister. Le chef était un homme dur et bourru, imbu de quelques principes de protestantisme. Comme il voulait disputer et que je n'en avais guère le temps, je le laissai aux prises avec le Petit Michel, jeune sauvage qui m'accompagne dans mes voyages. Ce dernier n'eut pas de peine à lui faire comprendre la supériorité de la religion des Français sur celle des Anglais. C'est ainsi qu'ils distinguent en effet la religion catholique de la religion protestante. Le chef sauvage fut surtout frappé de l'argument tiré de la vie de sacrifice du prêtre catholique mise en parallèle avec la vie plus facile du ministre protestant. Il nous fallut, avant de partir, nourrir cette famille d'affamés, au risque de nous réduire nous-mêmes à manquer du strict nécessaire.\nAprès bien des souffrances et des fatigues endurées, surtout à un portage, nommé par les sauvages *portage du Grand-Diable*, à cause des difficultés qu’il présente, difficultés que j’avais déjà expérimentées, il y a vingt ans, en compagnie du P. Seguin et du F. Boisramé, pour y avoir été arrêté treize jours, nous arrivâmes à la mission de Sainte-Gertrude le jeudi 15 juillet, à dix heures du matin. Le cher P. Bonald était de retour d’un grand voyage depuis quelques jours seulement. Il se préparait à me recevoir solennellement, mais nous arrivâmes à l’improviste ; on n’avait pas aperçu notre canot, de sorte que les arcs de triomphe n’étaient pas dressés, la fusillade n’annonça pas mon arrivée, les sauvages n’étaient pas alignés, et le P. Bonald, qui voulait me complimenter, était déconcerté. Mais le contre-temps n’eût pas de fâcheuses conséquences. La nouvelle de mon arrivée se répandit vite, un coup de fusil en fut l’annonce et les sauvages arrivèrent bientôt de partout à la mission. Le maître d’école protestant, apprenti ministre, dont toute la raison d’être ici n’est que l’opposition à faire au P. Bonald, arrive lui-même, attiré par la curiosité.\n\nLe pauvre P. Bonald est tout seul ici, en compagnie d’un petit sauvage de dix ans qui lui sert de cuisinier. Comme compensation à sa solitude, il a un beau logement. Il y a peu d’habitations de Missionnaire aussi convenables. Le F. Némos a passé par ici, et l’on reconnaît facilement la trace de son passage. Lui et le F. Bowes sont nos deux constructeurs et nous ont rendu de bien grands services. La maison du P. Bonald n’est pas un palais, mais elle est bien. C’est une construction de 30 pieds sur 20, dont la moitié à peu près est consacrée à une chapelle. Hâtons-nous d’ajouter que la pauvreté y est grande. Il y a un tabernacle convenable, il est vrai, mais pas de ciboire ; il est remplacé par une petite custode qui ressemble\nassez à une montre; l'encensoir fait aussi défaut et bien d'autres objets encore.\n\nPour le consoler de sa pauvreté, le P. BONALD a le bonheur d'avoir de bons chrétiens. Il y a cinq ans, je visi- tais avec le P. BLANCHET le poste du lac Pélican. Il n'y avait alors qu'une croix de bois et une vingtaine de chré- tiens; aujourd'hui cette jeune mission est fréquentée par deux cents, presque tous excellents et fidèles à leurs de- voirs.\n\nA quelques journées de marche du lac Pélican, il y a bon nombre de sauvages protestants et infidèles. Le bon M. Antoine Morin, chargé du fort, va pour son com- merce visiter ces sauvages. Un jour, après avoir traité ses affaires avec eux, au moment de repartir, un coup de vent violent s'élève, le temps devient affreux et le voyageur est obligé de prolonger son séjour. Pour tromper ses ennuis il se met à chanter les cantiques catholiques. Les sauvages, ravis de ces chants, envoient au P. BONALD une députa- tion de jeunes gens pour le prier de venir les visiter. Le Père instruit d'abord les délégués et les congédie en leur recommandant d'être apôtres à leurs foyers. En effet, avec un grand zèle, ils redirent à leurs compatriotes l'ensei- gnement catholique que le P. BONALD leur avait donné. Plus tard, le Père put se rendre lui-même dans cette tribu, et grande fut sa joie de trouver des chrétiens dans un pays où l'on n'avait pas encore vu de prêtre catholi- que. Les protestants ont essayé de tous les moyens pour ébranler la foi de ces jeunes et fervents néophytes, mais jusqu'à présent ceux-ci ont résisté à toutes les séductions.\n\nMon séjour au lac Pélican devait être court, et le P. BONALD craignait beaucoup que ces bons sauvages ne pussent arriver à temps pour me voir. C'eût été une dé- ception. Contre toute attente, voilà que le 18 juillet, pen- dant que nous dinions avec Antoine Morin, nous aperce-\nvons sur le lac une flottille de canots chargés d'hommes, de femmes et d'enfants : c'étaient nos bons sauvages. Quel bonheur pour nous ! Le P. BONALD en pleurait de joie. Leur langue est différente de celle des Cris de la prairie ; je ne pus donc que balbutier quelques mots, mais le lendemain il y eut office pontifical, une vingtaine de personnes firent leur première communion et autant reçurent le sacrement de confirmation. Après le déjeuner, les principaux chefs de famille vinrent me parler de leur désir d'avoir une mission dans leur pays ; ils venaient de loin, et avaient, me dirent-ils, rencontré trente portages, tous moins périlleux et moins difficiles, je pense, que le portage du Grand-Diable. Je leur promis d'envoyer parmi eux le F. NÉMOS pour bâtir, quand il aurait terminé la construction de la mission du Caribou, mais à condition que d'ici là ils préparaient les matériaux nécessaires, et qu'ils s'engageraient à venir chaque année chercher le Missionnaire, à le nourrir et à le ramener. Ils souscrivirent à tout avec empressement.\n\nLe P. BONALD avait d'abord consacré sa mission au Sacré Cœur. Je n'ai pu accepter ce choix, parce que déjà au lac Canard nous avons ce vocable et qu'il y eût eu danger à confusion. Pour le même motif, nous avons dû changer le nom de la mission Saint-Laurent ; il y a déjà un Saint-Laurent dans le diocèse de Mgr TACHÉ, et les agents du gouvernement réclamaient. J'ai dédié la mission du lac Pélican à Sainte-Gertrude. J'ai cependant consenti à ce que la nouvelle mission sur la rivière Churchill fût dédiée au Sacré Cœur, et cela à cause de son éloignement déjà assez considérable de l'autre.\n\nLes sauvages ne m'avaient pas vu en violet : c'était pour eux un grand chagrin. Mais dans ces longs voyages, il me faut réduire mon bagage. À l'office pontifical, le P. BONALD m'assistait en chape et l'enthousiasme des\nsauvages fut indescriptible. Cette chape n’a été faite ni à Lyon, ni à Paris, mais elle vient du lac Caribou et est l’ouvrage du F. Guillet, qui l’a faite en réunissant divers morceaux d’étoffe.\n\nLes sauvages auraient bien voulu me garder plus longtemps, mais il fallait partir. Malgré les regrets du P. Bonald, toujours désolé de ne m’avoir pas reçu plus solennellement, je trouvais que la réception était splendide. Au départ, M. Morin sortit de son magasin quelques coupons d’indienne et quelques vieux lambeaux de soie que l’on hissa au bout de bâtons pour en faire des oriflammes et des pavillons ; une vive fusillade se fit entendre et ce fut au milieu de l’enthousiasme général et aussi des regrets universels que je m’embarquai. J’amenaï avec moi le P. Bonald et son petit orphelin, pour réunir au Cumberland le plus de religieux possible.\n\nLe 22 juillet, vers six heures du soir, nous arrivions au Cumberland. Un canot vient au-devant de nous, un sauvage s’avance et me remet un billet du P. Lecoq me priant de me rendre au fort directement, dont le gouverneur est catholique. Ces messieurs de la Compagnie se montrent généralement très bons et bien disposés à notre égard, et bien que, pour la plupart, ne partageant pas nos convictions religieuses, ils sont cependant pleins d’attentions pour nous. M. Belangé, sa digne épouse et leur nièce sont vraiment la providence du Missionnaire. Ils ont voulu me faire les honneurs de la réception, et ceci m’explique le message qu’on m’a envoyé pour me prier de me rendre au fort et non à la mission.\n\nM. Belangé appartient à une famille des plus honorables du Canada. Son père était, il y a peu de temps encore, gouverneur de la province de Québec ; deux de ses sœurs appartiennent à des communautés religieuses. Pour lui, il continue les honorables traditions de sa famille,\net pour la seconde fois il m’a reçu vraiment royalement. Et, puisque j’en suis à l’article des éloges et de la reconnaissance, je dois ajouter que M. Deschambault, au Caribou, suit les mêmes exemples et a pour nous les mêmes procédés de religieuse bienveillance.\n\nM. Belangé vient me recevoir avec sa famille ; le pavillon anglais et celui de la Compagnie sont déployés sur le fort, et sur la porte d’entrée se détache cette inscription : Welcome. Les cloches de la mission sont en branle, et une fusillade nourrie éveille tous les échos. Les PP. Paquette et Lecoq viennent eux aussi me recevoir.\n\nIl y avait là en ce moment un archidiacre protestant, lui aussi en quasi-visite épiscopale ; il dut être bien étourdi du tapage, et aussi bien vexé peut-être de la splendeur de la réception faite à l’évêque catholique.\n\nM. Belangé m’a préparé à souper. Du fort à la mission il y a environ 1 kilomètre. Ces deux établissements sont situés presque à l’embouchure de la Saskatchewan, dans le lac Cumberland ; le terrain est bas, humide et livré aux moustiques : c’est là le fléau de l’été. De petits feux avaient été allumés de distance en distance pour éloigner ces parasites incommodes, et ce fut sur une route ainsi tracée par la flamme et la fumée que la procession s’avança. J’étais sous un dais porté par M. Belangé et quelques vieillards. Nous arrivons à la chapelle, magnifiquement ornée. D’ordinaire elle est plus que suffisante à cause de la distance à laquelle les catholiques sont dispersés autour de la mission ; mais aujourd’hui elle est trop étroite.\n\nQuand le soir j’allai prendre mon sommeil après ces fatigantes journées, je trouvai un bon lit avec des draps ; mais tous ces soins et toutes ces attentions dont j’étais redevable à M. Belangé ne m’empêchèrent pas de\nsentir les cruelles morsures des maringouins et de passer une nuit blanche.\n\nLe 4 août, avant quatre heures du matin, nous sommes réveillés par le sifflet du steamboat qui passe. Il y a beaucoup de monde à bord, entre autres une Sœur de charité de Saint-Albert qui retourne à Montréal et une personne qui a passé aussi plusieurs années au service de nos missions. Il y a aussi un prêtre séculier qui s’était joint à la caravane de Mgr Clut, mais qui revient sur ses pas, décuuragé, je pense, par les difficultés et les souffrances de nos missions. Je vois aussi l’honorable M. Laird, lieutenant-gouverneur du Nord-Ouest et la première autorité du pays. C’était la première fois que je rencontrais ce haut personnage. Il avait visité Saint-Albert, mais en mon absence, et j’étais heureux de l’occasion qui s’offrait à moi de le saluer et de lui faire comprendre que le prêtre sait honorer l’autorité et aussi apprécier les services qu’on rend à la religion. Son Honneur me dit qu’elle désirait visiter la mission. C’était un dimanche. Je fis donner des ordres à la hâte ; on arbora des pavillons, on sonna les cloches. Le noble visiteur resta au moins vingt minutes dans ma chambre et fut on ne peut plus aimable. J’avais envoyé, pendant ce temps, le P. Bonald à bord dire une messe pour les passagers catholiques. Avant huit heures le steamboat reprenait sa marche.\n\nLe Cumberland est un lieu de passage ; le steamboat le traverse ; bien des étrangers s’y rencontrent, bien des sauvages y viennent et les protestants y sont en nombre. Aussi, bien que la mission ne soit encore qu’à ses débuts, nous avons là une école : c’est le F. Piquet qui la dirige.\n\nEn me rendant de l’île à la Crosse au lac Pélican, je laissai de côté la mission du lac Caribou. C’est là que se trouvent le P. Gasté, les FF. Némos, Guillet et Labelle.\nJe n'en suis passé qu'à 120 lieues, et cependant je n'ai pas osé pousser jusque-là ; ce coude m'eût pris du temps et je n'aurais pu rentrer à Saint-Albert qu'en trouvant sur mon chemin de la neige comme à mon départ. Le P. Gasté n'a pu se résoudre à abandonner les Frères pour venir me rejoindre, et les Frères n'auraient pu sans inconvénient interrompre les travaux de construction de l'église. Il a donc fallu que chacun fît son sacrifice, eux et moi.\n\n(Ici, Monseigneur s'étend longuement sur l'esprit de sacrifice et les vertus des Pères et Frères de son vicariat, puis il reprend :)\n\n26 août. En route de Carlton à Battleford. — C'est le 12 août que j'ai dû m'éloigner du Cumberland, non plus en canot d'écorce, mais en steamboat. Le voyage n'y a guère gagné en rapidité, car nous avons été ensablés pendant vingt-quatre heures. Le 18 août j'arrivais au Prince-Albert, véritable ville anglaise qui s'élève dans mon diocèse à 15 ou 25 lieues de Saint-Laurent de Grandin. Il y a là deux usines à vapeur ; j'y ai vu pour la première fois dans ce pays des constructions en briques. L'agglomération n'est pas encore considérable, mais les Anglais, Ecossais et Canadiens anglais qui s'y rencontrent sont tous des hommes entreprenants et décidés à faire fortune. Bientôt ce sera une véritable ville qui l'emportera sur Saint-Albert. Nous avons acheté un terrain et une maison et nous ne tarderons pas à avoir là une mission dédiée à saint Georges. En attendant, le P. André visite quelques catholiques.\n\nAu Prince-Albert je pus trouver chevaux et voiture pour m'amener à Saint-Laurent de Grandin. Les PP. Fourmond et Chabellière m'y attendaient ; ce dernier avait par mon ordre quitté la mission de l'île à la Crosse pour m'attendre à mon passage ; je l'envoyai à Carlton\npour y remplacer le P. MOULIN, que j'appelais près de moi pour quelques jours. Le P. VÈGREVILLE arriva à son tour de la mission Saint-Eugène, et le P. ANDRÉ, de sa mission du Sacré-Cœur de Stobart (autrefois lac Canard). Le 20 août je dînai en compagnie de cinq Pères et du F. GÈRENT. Après le dîner nous nous séparâmes de nouveau et chacun regagna sa résidence. Le soir, arriva le F. LAUDRY, que je fis passer de l'île à la Crosse à Saint-Albert. Le samedi 21, je visitai la mission Saint-Laurent, où j'admirai les jardins et les champs du P. FOURMOND.\n\nLe dimanche 22 août, j'officiai pontificalement et donnai la confirmation à une soixantaine de personnes. Après dîner je me rendis, en compagnie du P. MOULIN, à la mission du Sacré-Coeur. Le P. VÈGREVILLE nous y avait devancés avec ses chrétiens et une dizaine de confirmants, ce qui porta à soixante encore le nombre des confirmants de l'après-midi. Saint-Laurent, le Sacré-Coeur et Saint-Eugène, ces trois chrétiens réunis me fournirent un contingent assez considérable ; dans le nombre il y avait pas mal de jeunes gens récemment convertis à la véritable religion.\n\nL'installation de nos Pères dans ces diverses missions n'est pas encore complète. Ainsi, le P. ANDRÉ prend ses repas chez un voisin, à sa mission du Sacré-Coeur. J'en dis autant du P. VÈGREVILLE à sa jeune mission de Saint-Eugène.\n\nSeptembre 1880. De Battleford au fort Pitt.— Le 27 août au soir nous arrivons à Battleford, où nous trouvons les PP. LESTANG, LEDUC, HERT, BOURGEOIS et le F. BOWES.\n\nBattleford est la capitale du Nord-Ouest : c'est là que réside le gouverneur avec son entourage et les autorités du pays. On appelle Battleford une ville, mais vainement y ai-je cherché des maisons ; à part les habitations du gouverneur, des magistrats et des soldats, il n'y a pas\nune seule maison convenable. Le bureau du télégraphe, celui du journal (Saskatchewan Herald), sont de misérables baraques en bois. L'Eglise catholique et la mission sont en parfait accord avec la pauvreté de la cité naissante. La maison de Dieu est une misérable butte de 20 à 25 pieds carrés, couverte en chaume et qui fait pitié à voir. À Battleford il n'y a pas de bois ; cependant en face de l'église catholique s'élève l'église provisoire protestante, pas plus spacieuse que la nôtre, mais plus solidement construite. À cinquante pas de l'église est l'habitation des Pères, composée de deux sortes de bicoques informes, étroites et malsaines. Rien n'est pauvre comme la mission de Battleford, à l'exception peut-être de celle de Sainte-Angèle. Cependant nos Pères peuvent y vivre, parce qu'ils peuvent acheter de la farine et du lard, ou même s'en procurer à crédit : le steamboat passe là et le chemin de fer y viendra un jour.\n\nOù loger ? Nous sommes nombreux. La nécessité rend inventif ; la maisonnette des Pères et ma tente de voyage donneront asile à tout le monde. Mais j'ai convoqué là mes consulteurs pour parler affaires ; où trouver un appartement pour nous y retirer et être seuls ? Croiriez-vous, mon très révérend Père, que nous avons demandé l'hospitalité au bon Dieu ! Oui, c'est chez lui que nous allons tenir nos séances. On pourrait peut-être voir là une inconvenance, mais en réalité ce sont bien les seuls intérêts du bon Dieu qui nous occupent ; il le sait et daignera pardonner notre familiarité et notre sans-gêne. Cependant par respect nous entourons l'autel d'une espèce de rideau et, sous le regard de notre Maître, nous traitons des graves questions qui ont pour objet sa gloire et son règne dans les Âmes.\n\nCe jour-là même le courrier arrive de Carlton et m'apporte votre chère lettre du 16 avril. Merci, mon bien-\naimé Père, des renseignements qu'elle nous donne, nous vous remercions tous des mesures que vous prenez pour atténuer les effets de la persécution dans notre chère Congrégation. Nos missions ont un si grand besoin d'elle! Nous ne cesserons de prier pour que Dieu protège en France celle qui est notre mère.\n\nLe 1er septembre, je partis avec le P. LESTANG et deux Frères pour la mission de Sainte-Angèle, où nous arrivâmes le soir même. Après avoir lu la Vie de la vénérable Mère Marie de l'Incarnation, fondatrice des Ursulines de Québec, le P. LESTANG, touché des faits édifiants qu'il venait d'y rencontrer, se sentit inspiré de consacrer une mission à la fondatrice d'un ordre si méritant. Il a déjà éprouvé, dit-il, les effets de la protection de sainte Angèle et de sa fille spirituelle en Canada. Ce bon Père a bien besoin de ces secours surnaturels. Il vit au milieu de sauvages infidèles et affamés qui lui demandent la nourriture du corps avec plus d'avidité que celle de l'âme. Aussi exerce-t-il principalement son zèle auprès des petits enfants pour préparer une génération nouvelle. Il caresse et entoure de soins ces petits sauvageons faits pour inspirer du dégoût, et passe des journées entières à leur apprendre à faire le signe de la croix. Je dus moi-même subir l'influence de son zèle et en rentrant à Battleford, après m'être édifié au spectacle de sa pauvreté héroïque et de son dévouement tout apostolique, j'amenai avec moi pour l'instruire le fils du chef sauvage, un petit enfant de onze ans qui n'est pas encore baptisé.\n\nLes PP. BLANCHET et MÉRÉ viendront avec les FF. BOWES et LAMBERT bâtir à Battleford, à Sainte-Angèle et ailleurs; maisons, chapelles, tout est à faire. Le travail ne manquera pas à ces chers enfants.\n\nSaint-Albert, 24 septembre 1880. — Le 21 septembre, nous arrivions au fort Saskatchewan; le 22, jour anni-\nversaire de l'érection du diocèse, je rentrais enfin à Saint-Albert, après plus de six mois d'absence.\n\nÀ Notre-Dame de Lourdes, j'ai trouvé quelques Univers; je les ai lus d'un trait. Que de tristes choses j'ai apprises sur notre pauvre France! Nous sommes tous inquiets pour notre chère patrie, notre Congrégation et partant pour nos missions. Vous avez plus d'ennuis avec les sauvages de Paris que nous avec ceux du nord-ouest de l'Amérique. Je ne vous parle pas de nos missions de Bow-River; le P. Leduc, les ayant visitées pour moi, vous aura dit le bien qui s'y fait; vos pauvres enfants y souffrent, mais au moins vous pouvez compter que les Pieds-Noirs des prairies traiteront vos Missionnaires de l'Ouest avec plus d'égards que vous n'êtes traités en France par des gens qui se disent civilisés.\n\nAgréez, mon très révérend Père, etc.\n\n† Vital, évêque de Saint-Albert, o. m. i.\n\nCANADA.\n\nM. Claudio Jannet, professeur à l'Institut catholique de Paris, de retour d'un voyage qu'il fit au Canada il y a un an, a publié dans le Correspondant (1) ses observations dans une série d'articles portant ce titre: la Race française dans l'Amérique du Nord. Nous détachons du mémoire du savant écrivain quelques pages où il a dessiné rapidement le rôle joué par nos Pères dans la colonisation:\n\n«..... C'est un des traits les plus curieux des moeurs canadiennes que la vie des jeunes gens qui, au nombre de plusieurs milliers, vont passer l'hiver à abattre les bois d'œuvre dans les hautes vallées, loin de toute civili-\n\n(1) Le Correspondant, numéro de 10 juin 1881.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007664.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 24958, "total-output-tokens": 9782, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 750, 1], [750, 2698, 2], [2698, 4520, 3], [4520, 6401, 4], [6401, 8319, 5], [8319, 10198, 6], [10198, 12111, 7], [12111, 14013, 8], [14013, 15871, 9], [15871, 17738, 10], [17738, 19567, 11], [19567, 21346, 12], [21346, 23171, 13], [23171, 24941, 14], [24941, 26745, 15], [26745, 28594, 16], [28594, 30449, 17], [30449, 32013, 18]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]