[{"id": "725ee498433549e917351c8a48526f0825b2e1e7", "text": "tion de voir le résultat de sa bonne œuvre, au moins eut-il une large part dans nos prières de reconnaissance. Pendant le cérémonie on chanta le beau cantique au Sacré Cœur : Dieu de clémence.\n\nVoilà donc ce cher sanctuaire du Sacré-Coeur achevé et livré au culte, après de longues difficultés et bien des fatigues; que la gloire en revienne au Sacré Cœur de Jésus, au Coeur immaculé de Marie et à saint Joseph !\n\nFOURMOND, O. M. I.\n\nLETTRE DE Mgr GRANDIN A Mgr L'ÉVÊQUE DE LAVAL.\n\nCette lettre a été publiée par la Semaine religieuse de Laval dans son numéro du 24 juillet. Nous la reproduisons d'après cette feuille.\n\nEn campement sur les bords de la rivière Esturgeon,\nle 18 avril 1880.\n\nMONSEIGNEUR,\n\nIl y a un an, j'avais l'avantage de vous accompagner dans votre tournée de confirmation ; j'avais trop d'agrément à la fois ; outre l'honneur de voyager avec Votre Grandeur et son aimable grand vicaire, je rencontrais à toutes les stations d'anciens condisciples, des amis que je n'avais pas vus depuis bien des années et que je n'aurais revus qu'en Paradis, si Votre Grandeur ne m'avait procuré ce précieux avantage dont je lui suis vraiment reconnaissant. Je suis aujourd'hui en tournée de confirmation, à mon propre compte, et il me faut payer pour tous les agréments que j'avais alors. Ma calèche épiscopale n'est autre qu'une espèce de tilbury, que je laisserai dans quelques semaines pour voyager par eau en canot d'écorce ; mais, en revanche, j'espère finir ma tournée en bateau à vapeur, ce qu'autrefois je n'aurais jamais sup-\nposé possible dans mon diocèse. Je suis en route depuis le 12 avril, et ne serai pas de retour avant la fin de septembre ou le commencement d'octobre; je ne verrai pas autant de prêtres en six mois que j'en voyais en un jour avec Votre Grandeur; ainsi, hier, je quittais une mission, et je serais au moins trois semaines sans en rencontrer une autre. Je ne puis m'annoncer à huit jours près aux Missionnaires que je visite : quand j'arrive, on me reçoit ; et si, par quelques signes, on a pu se douter de mon arrivée, on tire force coups de fusil pour la célébrer. Je revois parfois encore d'anciens condisciples et des amis, toujours des Frères bien-aimés et je puis dire bien-aimants, avec lesquels je passe huit ou dix jours, afin qu'ils aient le temps de me voir à l'aise, de me faire part de leurs peines, de leurs consolations, et de me faire connaître leurs plans. J'ai souvent besoin, moi aussi, d'épancher mon cœur dans le leur ; ces fraternelles communications font notre force et notre joie. Je pleure en arrivant, je pleure en partant, on dirait que c'est une partie du cérémonial, tant cela se fait régulièrement. Je passe aussi de temps en temps dans des postes, dans des campements où il n'y a pas de prêtres ; je m'efforce alors d'y donner une petite mission, de baptiser des enfants et des adultes, de préparer à la première communion et à la confirmation des enfants de quinze à quatre-vingts ans. Ces braves gens, que je visite ainsi, ne manquent jamais de me demander un prêtre et une chapelle, je promets toujours le tout, et, pour ne pas mentir, j'ajoute : quand je pourrai. Mais, me dira Votre Grandeur, où dites-vous la messe, s'ils n'ont point de chapelle ? — Quelquefois dans une pauvre baraque, le plus souvent dans une petite tente de toile, que je porte avec moi dans mon voyage d'été. J'y suis seul, et les assistants sont dehors ; pour les autres cérémonies, je les fais en plein air, si le temps le permet; j'ai alors\nl'avantage de ne jamais atteindre la voûte avec ma mitre.\n\n— Et d'une station à l'autre, où couchez-vous donc? —\n\nToujours au même hôtel. Je me suis mis en voyage quand la neige était à peu près fondue; à peine étais-je parti, qu'il en est tombé de nouveau, et en telle abondance, qu'il y en a maintenant plus d'un pied en moyenne.\n\nJe suis arrivé hier soir sur les bords d'une rivière; une fois que bœufs et chevaux ont été dételés, un de mes hommes a pris une planche de charrette et a écarté la neige le plus possible, sur un espace de 6 à 8 pieds; puis je lui ai aidé à couvrir notre parquet de branches de sapin, après avoir d'abord monté la tente; pendant ce temps mon second engagé bûchait du bois pour la nuit et la journée d'aujourd'hui, car c'est dimanche et nous ne marchons pas. Je ne puis, bien entendu, causer qu'avec mes deux hommes, deux sauvages pur sang, mais sauvages chrétiens et un peu civilisés. L'un d'eux, que je regarde plus particulièrement comme mon enfant, parce que je l'ai élevé et tiré de la misère, porte le nom d'un prélat que je vénère : il s'appelle Sebaux; c'est ainsi que nous changeons les sauvages en Français, même par leurs noms. Après avoir soupé, quand mes sauvages ont eu conté toutes leurs histoires, visité leurs animaux, nous avons étendu une large peau de buffle sur notre matelas de branches de sapin, puis des couvertures de laine, et je me suis blotti sous cet abri et entre mes deux compagnons. Ce matin, à six heures, sans reveiller ces rudes chrétiens que je voulais laisser se reposer, j'ai fait du feu, fait fondre les glaces pour avoir de l'eau, fait ma toilette et mes exercices, et, à huit heures, j'ai dit la sainte messe dans cette tente où nous avons dormi et où j'ai maintenant l'honneur de vous tracer ces lignes, ayant pour table mes deux genoux; les autres jours, nous nous levons plus matin; à part cela, tout se\npasse comme aujourd'hui. Dans quelques jours j'aurai l'avantage de voyager avec le R. P. Végreville, qui va venir me rejoindre et sera pendant plusieurs jours avec moi, se rendant à une mission où il va résider et que je vais visiter. Mais j'ai parlé de bœufs et de charrettes; qu'est-ce que c'est donc que tout cet attirail? me dira Votre Grandeur. Jusqu'à présent, Monseigneur, les Missionnaires du diocèse de Saint-Albert attendent de leur Evêque la nourriture et le vêtement; Saint-Albert étant naturellement la mission la mieux fournie, c'est elle aussi qui va le plus souvent au secours des autres. J'ai donc trois charrettes, qui, outre ma tente et mes provisions, contiennent différentes choses que je laisserai dans nos premières missions. Si vos bons diocésains pouvaient percevoir ma caravane, ils ne pourraient croire que c'est un évêque en tournée de confirmation, mais un pauvre paysan qui déménage. En effet, outre les instruments nécessaires à la cuisine du campement, j'emmène des bœufs, des chevaux, etc., et je dois m'occuper un peu de tout cela. Aujourd'hui, plus que jamais, dans tout le Sud-Ouest de mon diocèse, nous devons être colons, afin de former nos sauvages à la culture et de les empêcher ainsi de mourir de faim; car la chasse leur fait complètement défaut. Mon établissement de Saint-Albert n'est autre chose qu'un orphelinat considérable et une ferme modèle; il faudrait, dans mon diocèse, vingt ou trente établissements de ce genre, et je n'en ai que trois.\n\nJ'avais, comme je l'ai déjà dit à Votre Grandeur dans le temps, l'intention de dédier une de mes missions à Notre-Dame de Pontmain. J'étais à peine de retour dans mon diocèse, qu'un de mes Missionnaires, du diocèse de Rennes, chargé d'une nouvelle fondation, me demanda de la dédier à Notre-Dame de l'Espérance. Je me hâtais\nd'acquiescer à sa demande. La plupart des Missionnaires de Saint-Albert sont du Maine et de la Bretagne, et ne peuvent manquer d'avoir une vraie dévotion à Notre-Dame de Pontmain. Les sauvages qui habitent cette partie de mon diocèse sont loin d'être des mieux disposés, et l'avenir de cette mission est tout en espérance. Daigne la Très Sainte Vierge chasser le démon, qui ne quitte nos pays qu'à regret, et semble appeler à son secours des suppôts de partout, pour nous doter d'une civilisation anti-chrétienne ! Pour mettre mieux dans notre intérêt notre Patronne, je voulus de suite montrer la préférence que j'avais pour cette mission, en la dotant d'une cloche, avantage que n'ont pas plusieurs autres missions comptant six ou huit ans d'existence ; et, en la donnant au Missionnaire, je lui promis d'aller la bénir au mois d'août prochain. Ici, ces bénédictions se font comme tout le reste, c'est-à-dire bien simplement : il n'est le plus souvent question ni de parrain ni de marraine. Le Missionnaire réclama une exception en faveur de Notre-Dame de Pontmain et je fus encore une fois de son avis ; il a voulu faire les choses aussi grandement que possible. J'ai cru, Monseigneur, que je ne pouvais ni ne devais choisir d'autre parrain que Votre Grandeur. L'évêque de Laval, qui peut appeler la Très Sainte Vierge son aimable diocésaine, voudra bien me permettre de le représenter dans cette cérémonie. J'ose en même temps prier Votre Grandeur de bien vouloir trouver une marraine, dévouée aussi au culte de Notre-Dame de Pontmain : je tâcherai de la faire représenter par une chrétienne des plus respectables du pays. Outre le titulaire de la mission qui me met dans l'obligation de demander à l'évêque de Laval d'être parrain de la première cloche chrétienne qu'on aura vue dans ces parages, la place elle-même porte un peu le nom de Votre Grandeur ; elle n'est connue jusqu'à présent que sous le\nnom de Lac-du-Marais; ce sera maintenant « Notre-Dame de Pontmain du Lac-du-Marais ». Si j'avais pu prévoir tout cela, j'aurais fait graver, sur ladite cloche, par le fondeur lui-même, cette partie si intéressante de la chronique de la nouvelle mission; j'espère qu'un de nos Frères pourra, avec le burin, réparer cette omission, et les registres compléteront cette importante notice.\n\nJ'ose compter sur votre acceptation, Monseigneur, en même temps que sur votre indulgence pour ma longue missive; ne pouvant parler qu'avec des sauvages, il est naturel qu'au risque d'être indiscret, j'aie prolongé si longtemps mon entretien avec Votre Grandeur.\n\nVeuillez agréer, etc.\n\nNous apprenons avec bonheur que Sa Grandeur Mgr l'évêque de Laval a bien voulu agréer l'invitation de Mgr l'évêque de Saint-Albert d'être parrain de la cloche de la mission de Notre-Dame de Pontmain du Lac-du-Marais et que Mme Emmanuel Turpin de la Tréhardière a été heureuse d'accepter le titre de marraine.\n\nMACKENZIE.\n\nMISSION SAINT-MICHEL.\n\nEXTRAITS D'UNE LETTRE DU R. P. ROURE À MGR CLUT.\n\nLe 16 novembre 1879.\n\nMonseigneur,\n\nVotre Grandeur sait dans quel triste état se trouvait la mission Saint-Michel et quelles difficultés nous avions à nous procurer du bois de construction et de chauffage. Aujourd'hui, grâce à Dieu et à un travail opiniâtre, nous sommes venus à bout de nous bâtir une maison. Le bon F. Boisramé m'arrivait le 20 septembre de l'année dernière; aussitôt nous dressâmes de concert le plan d'on", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007653.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8304, "total-output-tokens": 3217, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1541, 1], [1541, 3491, 2], [3491, 5371, 3], [5371, 7190, 4], [7190, 9097, 5], [9097, 10588, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]