[{"id": "69756fdb6e7fccba99e48ba5964223f9813111ee", "text": "RAPPORT\n\nSUR LE\n\nVICARIAT DU DIOÇÈSE DE SAINT-ALBERT\n\nLe vicariat de Saint-Albert a été établi en 1868 ; alors son personnel se composait de 14 Oblats, savoir : Mgr Grandin, à qui il était confié, 9 Pères et 4 Frères convers. Cette même année, il fut augmenté de 2 Pères, d'un Frère scolastique et de 2 Frères convers. En outre, Mgr Grandin, en retournant dans son vicariat, avait conduit avec lui 1 Prêtre, 1 diacre, 1 séminariste non encore dans les Ordres sacrés, et 5 jeunes postulants convers.\n\nLe vicariat comprenait alors sept principales missions ou résidences, savoir : dans le district de la Siskatchewan, Saint-Albert, Sainte-Anne, Saint-Joachim, Saint-Paul des Cris et Notre-Dame des Victoires, au bord du lac la Biche ; et dans le district de la Rivière aux Anglais, Saint-Jean-Baptiste à l'île à la Crosse et Saint-Pierre au lac Caribou.\n\nDepuis que le vicariat apostolique de la Siskatchewan a été érigé en diocèse, la résidence de Saint-Albert est devenue le siège de l'Évêque ; sa population, qui, en 1868, était de 600 âmes, s'est augmentée depuis d'environ un tiers ; elle est composée de métis canadiens, généralement bons catholiques, mais qu'il a fallu former à la vie chrétienne ; ils sont presque tous pauvres, fort\npeu industriels et encore moins économiques. Quelques étrangers venus du Canada et des États-Unis se sont mêlés à eux ; ce n’est pas ce qu’il y a de meilleur dans le pays ; si leur nombre augmente, ce sera pour Saint-Albert une cause de démoralisation.\n\nLa maison qui sert de résidence à l’Évêque et aux Pères est en bois, comme toutes les constructions de ce vicariat ; sans être ni spacieuse ni commode, elle leur suffit cependant. La chapelle qui servait de paroisse et de cathédrale étant devenue trop étroite et tombant du reste en ruines, on en construit une autre, plus vaste et plus digne de sa destination, à laquelle tous nos Pères et Frères ont dû travailler. Quoique non achevée encore dans l’intérieur, elle a cependant déjà été livrée au culte.\n\nÀ environ 30 mètres de la nouvelle église est la maison des Sœurs, bien insuffisante pour les œuvres auxquelles elles se sont adonnées jusqu’à présent : elles ont eu le soin des orphelins, leur ont fait l’école, ainsi qu’aux rares enfants qu’on leur envoie. Il faudrait aujourd’hui donner plus d’extension à leur école, afin de pouvoir lutter avec les ministres protestants, qui, partout où ils s’établissent, élèvent des écoles et s’emparent, par ce moyen, des nouvelles générations, auxquelles ils inoculent leurs erreurs. Il y aurait donc nécessité d’établir une école qui répondît aux besoins du pays, d’autant plus que la population comprend mieux aujourd’hui le besoin de l’instruction.\n\nDans notre mission de Saint-Albert, nos Pères ne s’occupent pas seulement de former des chrétiens, ils doivent aussi y former des agriculteurs ; les métis jusqu’à présent ne vivaient guère que du produit de la chasse ; mais, cette ressource ayant considérablement diminué et pouvant d’un jour à l’autre leur faire complètement défaut, il a fallu leur en procurer une bien plus abondante et surtout plus certaine, c’est celle qu’un sol riche et vaste peut leur\nfournir ; mais, pour amener les métis à cultiver la terre, il a fallu leur en donner l'exemple. Nos Pères ont à Saint-Albert une vaste ferme où, chaque année, ils enseiment de 30 à 40 arpents, même où ils pourraient enseigner beaucoup plus, si des bras ne leur manquaient. Ils ont actuellement soixante bêtes à cornes, bœufs ou vaches, et autant de chevaux. Les bœufs et les chevaux leur servent pour le labourage et pour les transports à faire aux différentes missions, pour les voyages des Missionnaires ; les vaches fournissent du laitage en abondance, ce qui leur permet de faire une grande provision de beurre, dont une partie est envoyée aux résidences qui n'en ont point et qui ne sont pas trop éloignées. C'est grâce aux Frères convers que nos Pères peuvent jouir du produit de leur ferme. Beaucoup de choses, qui ailleurs seraient considérées comme indispensables, manquent encore à cette ferme ; heureusement que la nécessité rend industriels ! C'est ainsi que nos Pères et nos Frères peuvent s'en tirer.\n\nNos Pères ont dû faire un moulin, afin de pouvoir se procurer de la farine ; malheureusement la première tentative n'a pas réussi, les grandes eaux du printemps l'ont emporté : ils ont dû en construire un autre sur un faible cours d'eau, pour ne pas l'exposer comme le premier à être emporté ; mais sur ce faible cours d'eau il aura l'inconvénient de ne pouvoir marcher que dans les grandes eaux du printemps.\n\nMission de Sainte-Anne. — La mission de Sainte-Anne, sur le lac qui porte ce nom, située à environ 75 kilomètres de Saint-Albert, est peut-être la plus complète des missions ou résidences du diocèse ; grâce à son ancienneté, elle possède une chapelle conventuelle qui a été nouvellement réparée, et une maison pouvant au besoin suffire au logement de deux Pères et de trois Frères. La\npopulation fixe à Sainte-Anne est d'environ 350 personnes ; cette résidence est en outre visitée au printemps par douze ou quinze familles de sauvages assiniboines. Les métis de Sainte-Anne, comme ceux de Saint-Albert, sont généralement de bons chrétiens ; mais, apathiques comme les sauvages, jamais ils ne rendront le moindre service aux Missionnaires, sans exiger d'eux un payement. Une pieuse et dévouée institutrice y fait l'école ; c'est la sœur du R. P. Lacombe. Grâce à l'industrie du R. P. Fourmond, qui a fait une chaussée pour avoir une chute d'eau, un moulin pourra y être construit, ce qui sera une ressource bien précieuse et pour cette mission et pour celles qui ne peuvent avoir le même avantage et qui cependant ont également besoin de farine.\n\nÀ cause de la proximité de cette résidence de celle de Saint-Albert, et vu surtout le nombre peu considérable des chrétiens qui s'y trouvent, assez souvent elle n'a pas de Missionnaires à poste fixe ; elle est alors desservie par un des Pères de Saint-Albert. Sainte-Anne a été choisie comme le lieu le plus convenable du vicariat pour le noviciat ; c'est la aussi que les scolastiques terminent leur cours de théologie, quand, bien entendu, on peut avoir des scolastiques venus des provinces, car ce vicariat n'a encore fourni aucun sujet.\n\nMission de Saint-Joachim d'Edmonton. — Edmonton est un poste important de la Compagnie de la baie d'Hudson, bâti sur les bords du lac Siskatchewan. Le chef de ce poste a fait construire, il y a quelques années, une chapelle dans l'intérieur du fort, à l'usage des nombreux serviteurs catholiques de la Compagnie qui s'y trouvaient ; il fit également construire une maison pour que le Missionnaire eût un chez-soi ; malheureusement, à ce chef très-bien disposé pour la mission catholique, quoique protestant, a succédé un protestant fanatique, dont le\npremier soin a été d'éloigner autant qu'il a pu les serviteurs catholiques pour les remplacer par des protestants, et l'école qu'y tenait le Fr. Schoen, lorsque le fort était peuplé de catholiques, est tombée, faute d'élèves, quand les protestants ont remplacé les catholiques. Il n'y a pas de Missionnaire à poste fixe à Edmonton ; quand un Père de Saint-Albert est disponible, il s'y rend de temps en temps pour y dire la messe le dimanche et donner ses soins aux rares catholiques qui s'y trouvent.\n\nMission de Saint-Paul des Cris. — Cette résidence se trouve sur les bords de la Siskatchewan à environ 45 lieues au-dessous du poste Edmonton ; cette mission fut fondée par le R. P. Lacombe, il y a six ans, pour favoriser l'évangélisation des sauvages cris de la prairie, et pour servir de boulevard contre les progrès du protestantisme chez cette nation ; car pour le moment elle n'est pas de grande importance, surtout sous le rapport matériel ; mais bientôt elle sera visitée par un bateau à vapeur, qui naviguera sur la grande rivière Siskatchewan, et si le projet d'un chemin de fer sur le territoire anglais, réunissant les deux océans, se réalise, ce poste aura nécessairement de l'importance et pourra servir de dépôt pour fournir au vicariat du Mackenzie les effets dont il pourra avoir besoin.\n\nMission de Notre-Dame des Victoires au lac la Biche. — Cette mission est située dans le diocèse de Saint-Albert, et en fait canoniquement partie ; mais, pour des raisons qu'on fera connaître ailleurs, elle dépend du Vicaire de mission du vicariat de Mackenzie ; il n'en sera donc point parlé ici.\n\nMission de Saint-Jean-Baptiste de l'île à la Crosse. — La mission de l'île à la Crosse est une des plus anciennes de ce diocèse ; elle est située sur les bords du lac qui porte ce nom. Cette mission a été rudement éprouvée ; deux fois\nl'incendie y a tout dévoré. Aujourd'hui elle est sortie de ses cendres, et sans avoir réparé entièrement toutes ses ruines, elle y travaille avec succès. Cette mission fut fondée pour évangéliser les Cris de cette région et les sauvages montagnais qui visitaient ce poste de traite, qui a servi d'abord d'habitation à nos Pères, avant qu'ils eussent élevé les constructions qui devaient les abriter. Cette résidence a deux Pères et deux Frères; des Sœurs grises de Montréal y ont un établissement, où elles élèvent des orphelins et font l'école. Sous le rapport matériel, cette mission est moins bien pourvue que celle de Saint-Albert; malheureusement les deux Pères qui en sont chargés ont une santé bien faible, sinon ruinée.\n\nMission de Saint-Pierre, lac Caribou. — Cette mission est la plus pénible et la plus difficile de tout le diocèse et même des trois vicariats du nord-ouest de l'Amérique, par son éloignement, les difficultés d'y arriver et les frais de transport qu'elle nécessite. Elle est visitée par les sauvages montagnais, qui s'y rendent au nombre de sept à huit cents; ils y viennent de très-loin et non sans de grandes difficultés; il leur est souvent impossible d'y amener leurs familles, et quand ces familles se rendent à la résidence, elles n'y demeurent que fort peu de temps, parce qu'elles n'y trouvent pas des moyens suffisants de subsistance, ce qui est cause qu'on ne peut leur donner l'instruction religieuse qui leur serait nécessaire. Une autre difficulté provient du manque de bois de chauffage; il y en avait suffisamment il y a douze ans, quand cette mission fut fondée; mais, depuis cette époque, la consommation qui s'en est faite a à peu près épuisé la provision de bois qu'on y avait trouvée; ce qui oblige les sauvages, quand ils viennent à la mission, à aller camper loin de notre résidence du lac Caribou, là où ils trouvent encore le moyen de se chauffer; mais cet éloignement\nest cause qu'ils ne peuvent entendre le son de la cloche,\net souvent ne peuvent se rendre aux exercices qu'on fait\nà leur intention. Si ces sauvages vivaient par groupes et\nen société, nos Pères pourraient les visiter, comme ceux\ndes prairies ; mais la pauvreté du pays qu'ils habitent les\nforce de se disperser par familles sur une vaste étendue,\nafin de pouvoir trouver un peu de nourriture, ce qui est\nun obstacle à pouvoir les instruire suffisamment et à les\nformer aux pratiques de la vie chrétienne. Les Pères de\ncette mission ont beaucoup à souffrir dans leur isolement\net à souffrir de toutes les manières.\n\nCette mission est visitée également par des Esquimaux.\nCes sauvages y viennent depuis que le P. Gasté les a\nvisités, mais on n'a pu encore en faire des chrétiens ; nos\nPères du lac Caribou ne connaissent point leur langue et\nn'ont pas le moyen de l'apprendre. Cette mission, sous le\nrapport matériel, est sans avenir : la culture y est à peu\nprès impossible, le bois de chauffage y manquera bientôt,\net les transports, pour y arriver et y porter les choses\nnécessaires, sont fort coûteux et très-pénibles ; il faut\nun grand dévouement aux Pères qui résident à cette\nmission, pour ne pas l'abandonner ; mais jusqu'à présent\nils n'ont pu se résigner à la quitter, à cause des quelques\nchrétiens qui la visitent. On peut cependant prévoir un\ntemps, qui n'est pas éloigné, où on devra abandonner ce\nposte ; mais la nécessité seule y obligera nos Mission-\nnaires.\n\nOutre les résidences, nos Pères du diocèse de Saint-\nAlbert ont encore à desservir plusieurs postes, où ils se\nrendent une ou plusieurs fois par an, pour y donner des\nmissions ; nous énumérons ici les plus importants : au fort\nJasper, au petit lac des Esclaves, au fort de la Montagne,\nau lac aux Tourtes, au lac du Bœuf ou Victoria, au lac\ndu Poisson, au fort Pitt. Nos Annales ont déjà fait con-\nnaître le mode de voyager, les fatigues et même les dangers de ces voyages, ainsi que la longueur et la durée des hivers dans ces régions. Le ministère et les travaux matériels sont toujours ce qu'ils ont été, et l'on peut dire que ce diocèse, s'il conservait les mêmes habitants, serait sans avenir, comme toutes les contrées peuplées par les sauvages de l'Amérique du Nord ; mais, si le projet de construire un chemin de fer, qui doit unir les deux océans et traverser toute la vallée de la Saskatchewan, se réalise, ce pays changera de face et sera peuplé, après quelque temps, d'habitants d'origine européenne. Ces immenses solitudes seront animées par la présence d'une population industrielle et hardie, qui fera sortir du sein du désert des villes et des villages. Il est à craindre que cette nouvelle population ne soit composée en très-grande partie de protestants, et que le diocèse de Saint-Albert ne devienne alors un peu trop in partibus infidelium.\n\nAvant de terminer ce rapport, je dois exprimer un regret au nom des Missionnaires du diocèse de Saint-Albert, c'est celui d'être en nombre insuffisant, et ils pourraient se plaindre aussi de n'avoir pas les ressources qui leur permettraient de faire tout le bien qu'ils désireraient. Dans beaucoup de localités, ils sont en face des ministres protestants, qui, avec l'or dont ils disposent, leur font une concurrence désastreuse. Il semble que les allocations relativement considérables que les conseils de la Propagation de la foi leur font devraient amplement suffire pour l'entretien de nos Missionnaires. Malheureusement il n'en est pas ainsi ; les objets de première nécessité, qu'ils peuvent leur venir que de l'Angleterre ou des États-Unis, leur reviennent très-cher, à cause des transports ; n'ayant qu'un nombre insuffisant de pères, ils sont obligés d'employer des serviteurs, qui travaillent fort peu et\ndépensent beaucoup. Leurs demeures, n'étant construites qu'en bois, ont souvent besoin d'être réparées, dans ce climat de fer, ce qui entraîne pour eux des frais assez considérables ; les voyages qu'ils doivent faire pour visiter les postes dont ils sont éloignés, et qui sont généralement assez longs, sont encore pour eux une cause de dépense. Quand nous comparons la vaste étendue qu'occupe le diocèse de Saint-Albert au petit nombre de Missionnaires qui y exercent leur ministère, il est facile de se convaincre qu'il est beaucoup trop insuffisant ; mais il n'est pas facile de remédier à ce mal ; l'administration générale ne peut lui fournir des ouvriers qu'autant qu'elle en a elle-même de disponibles ; la rareté des vocations aujourd'hui, et depuis quelques années, la met dans l'impuissance d'augmenter, comme elle le voudrait et comme il serait nécessaire, le nombre des Missionnaires et des Frères ; ce nombre, d'ailleurs, devrait être proportionné, non aux besoins des missions, mais aux ressources qu'un vicariat peut avoir pour faire vivre et entretenir ses Missionnaires. S'il y avait possibilité de fournir au diocèse de Saint-Albert, comme aux autres vicariats, le nombre de Frères convers qui lui est nécessaire, sans doute les dépenses seraient notablement diminuées et l'on procurerait à la plupart de nos Pères qui habitent ces régions les joies douces de la famille, dont souvent ils sont privés ; mais de nos jours les Frères sont rares, et il est à craindre qu'avec les nouvelles lois militaires ils ne le deviennent encore davantage par la suite.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007545.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 12456, "total-output-tokens": 4620, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1240, 1], [1240, 3154, 2], [3154, 4966, 3], [4966, 6821, 4], [6821, 8662, 5], [8662, 10583, 6], [10583, 12457, 7], [12457, 14336, 8], [14336, 15908, 9]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]