[{"id": "d6f5da696f9e9de2876621f0f514aea16e7107a4", "text": "M. GRANDIN A M. DE MAZENOD\n\nMontréal, le 1er juin 1860.\n\nMONSIEUR ET RÉVÉRENDISSIME PÈRE,\n\nJe suis à la veille de quitter Montréal pour me rendre à Saint-Boniface, en passant par Bytown (Ottawa). Je devais même être parti depuis plusieurs jours, mais, ici comme en France, j'ai rencontré des occupations qui ne m'ont pas permis de partir aussi vite que je l'aurais voulu.\n\nJ'ai trouvé, en arrivant ici, plusieurs lettres de la Rivière-Rouge : tous nos Pères vont bien ; ils procurent la gloire de Dieu, et tout porte à croire que le Seigneur couronnera de plus en plus nos efforts. Je dis que tous nos Pères vont bien, je dois excepter le P. LESTANG, qui n'est pas bien portant. Monseigneur TACHÉ a été lui-même malade pendant trois semaines, et il a manqué d'être victime de l'imprudence des sauvages, qui faisaient sécher de la poudre près du feu, dans un appartement au-dessus duquel Monseigneur se trouvait. Le feu a pris à la poudre, le plancher a sauté, la maison tout entière a été ébranlée, et Dieu merci, personne n'a été blessé.\n\nMa caravane a beaucoup augmenté ici : un jeune Canadien, qui demande à être frère convers, part en qualité de postulant. J'emmène de plus cinq religieuses, et Monseigneur l'Evêque de Montréal, qui nous est si dévoué et qui aime tant nos Missions, ne se contente pas de nous donner du monde, il veut prier le voyage de ceux qu'il me donne. Il embrasse avec ardeur mon projet de fonder un hospice à l'Île à la Crosse, et il croit qu'avec les aumô-\nnes que nous obtiendrons en France et avec celles qu'il nous procurera au Canada, et surtout avec l'aide de Dieu, nous pourrons bientôt faire quelques essais. Il a fait quêter les Sœurs qui partent avec moi dans toutes les églises de la ville; cette quête a été assez fructueuse, elle l'aurait été davantage si mon départ n'avait pas été si précipité. Je suis bien occupé; j'ai dû faire des courses pendant le jour et corriger des épreuves pendant la nuit, car j'ai pu faire imprimer mes cantiques sauvages. C'est à Bytown que je continue et termine ma lettre. Nous en partons tous demain pour aller rejoindre Monseigneur Taché; il me tarde de le voir et de jouir du bonheur qu'il éprouvera en me voyant si bien accompagné. Tous mes compagnons de voyage vont bien et se montrent toujours d'excellents religieux. Je désire pour ma part arriver bien vite à mon Ile à la Crosse pour reprendre ma vie ordinaire d'Oblat de Marie. Oui, Monseigneur, l'Evêque de Satala sera toujours votre fils Grandin, à qui vous avez donné la tonsure, les ordres-mineurs, le sous-diaconat, le diaconat, la prêtre et l'épiscopat, votre fils à tous les titres et fils soumis et reconnaissant.\n\n† VITAL, Evêque de Satala,\n\nO. M. J.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007451.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 2, "total-input-tokens": 2768, "total-output-tokens": 870, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1486, 1], [1486, 2692, 2]], "primary_language": ["fr", "fr"], "is_rotation_valid": [true, true], "rotation_correction": [0, 0], "is_table": [false, false], "is_diagram": [false, false]}}]