[{"id": "7bc74095d1df38341e58b714941abc535d062461", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÉE\n\nN° 91. — Septembre 1885.\n\nMISSIONS ÉTRANGÈRES\n\nVICARIAT DE SAINT-ALBERT.\n\nPersonne n'ignore les graves événements qui se sont passés, au printemps dernier, dans le North West Territory. L'insurrection des métis, soulevée par Riel et fortifiée par les sauvages insidieux commandés par le chef Gros-Ours (Big-Bear), a mis tout le pays en émoi. La guerre a porté ses ravages dans nos chères missions, et le sang a coulé. Deux de nos frères, le R. P. Fafard, du diocèse de Montréal, et le R. P. Marchand, du diocèse de Rennes, ont versé le leur pour la défense de leurs ouailles. Ce sont des martyrs de la charité, dont la mort glorieuse ajoute à notre nécrologe, où déjà sont inscrits tant de noms d'apôtres, une splendeur de plus. Nous commençons le récit de ces événements, bien qu'ils soient déjà connus de tous par les journaux ; nos Annales ne peuvent les passer sous silence.\n\nDans ce but, nous publierons plusieurs lettres de nos\nPères. On voudra bien, en les parcourant, se reporter aux dates diverses auxquelles elles ont été écrites. Ceci est absolument nécessaire pour comprendre les faits et pour se rendre compte des appréciations. On voudra bien aussi tenir compte du milieu dans lequel vivaient les auteurs de ces lettres en les écrivant, et de la difficulté où ils se trouvaient de donner des nouvelles toujours complètement exactes, à raison des distances et de la suppression des communications régulières.\n\nNous donnerons les principaux documents qui nous ont été envoyés, et dans l'ordre où nous les avons reçus. S'il y a des erreurs de détail, elles pourront être rectifiées par les documents qui nous parviendront plus tard. Nous laissons à nos correspondants toute la responsabilité de leurs jugements sur les hommes et les choses. Leurs rapports sont du plus haut intérêt, et nous les insérerons sans y rien changer.\n\nVoici d'abord une lettre du R.P. Fournond au Très Révéré Père Supérieur général, écrite avant les événements. Elle en est comme la préface, et nous y trouvons le portrait de l'agitateur du Nord-Ouest :\n\nGrandin, Saskatchewan, 27 décembre 1884.\n\nMon très révérend Père,\n\n..... L'extrême misère à laquelle la population métisse est réduite aujourd'hui par suite de la disparition du buffalo et par la sécheresse et les gelées, qui ont empêché les récoltes de mûrir, n'a fait qu'augmenter encore l'excitation générale. La neige commençait à peine à disparaître, au printemps, que, de tous les établissements de Prince-Albert et de Saint-Laurent, les métis anglais et français accouraient se réunir, à moitié chemin des deux places, dans une épinière, afin d'aviser aux moyens à prendre pour se faire rendre justice. Il fut\nd'abord décidé que personne ne serait admis aux délibérations qui allaient suivre, s'il ne s'engageait par serment à garder le secret sur leurs résultats. La plupart firent ce serment ; quelques-uns le refusèrent et furent exclus. Ainsi tout prenait l'aspect des sociétés secrètes : on se cachait comme des conspirateurs, et on s'enveloppait dans l'ombre des bois et dans le mystère du secret. Bien entendu, nous n'avions pas été consultés, comme d'ordinaire nous le sommes dans les assemblées ; non pas, sans doute, qu'on se défît de la légitimité de la cause, mais parce qu'on se défiait des moyens à employer pour la faire triompher. Nos gens étaient trop bien convaincus que nous ne les encouragerions pas dans cette voie. Tout en désapprouvant ces manières de faire, au moins étranges, nous dûmes nous tenir sur une grande réserve. Nous fûmes donc accusés de ne plus porter intérêt à notre peuple, de ne plus aimer ces chers enfants confiés à nos soins. Ces plaintes furent même exprimées assez amèrement et avec une grande émotion à Mgr Grandin, quelque temps après, dans une adresse qui lui fut présentée à la porte de la chapelle de Saint-Laurent, au sortir de la cérémonie de la confirmation.\n\nLe premier résultat des assemblées fut d'aller chercher Riel, alors exilé sur les bords du Missouri, dans l'Etat de Montana. On députa, à cet effet, trois délégués. Ils trouvèrent Riel faisant l'école aux petits enfants de la mission de Saint-Pierre, dirigée par les RR. PP. Jésuites. Nos gens en furent d'abord fort édifiés, et ils ne le furent pas moins des bonnes paroles qu'il leur adressa pour les porter à mettre avant tout leur confiance en Dieu. Après avoir pris conseil des révérends Pères, il se décida à se rendre à l'invitation qui lui était faite et qui lui paraissait être une manifestation de la volonté de Dieu. Toutefois, avant de partir, il engagea les délégués à l'accom-\npagner au tribunal de la pénitence et à la sainte Table, ce qu'ils firent avec cette foi qui distingue les métis et les retiendra toujours sur le bord de l'abîme. Leur long voyage pour revenir ici fut heureux, leur première visite fut pour le révérend Père.\n\n« Je suis parti, dit Riel, avec la bénédiction des révérends Pères de Saint-Pierre de Montana, je viens, à mon arrivée, réclamer très humblement celle des révérends Pères de Saint-Laurent. Je ne veux rien entreprendre que sous la direction du clergé et d'après ses conseils. »\n\nC'était la première fois que je voyais Riel; je fus enchanté de sa conversation et de son bon esprit; j'admirai la foi qui respirait dans toutes ses paroles, la douceur qui caractérisait sa physionomie et son élocution. Et cependant, ce visage, où se peignent la bonté, l'humilité et la modestie, s'anime parfois tout à coup et s'enflamme d'un feu terrible, et cela surtout quand on fait quelque opposition aux idées exprimées par l'orateur. Les droits de sa nation sont pour lui sacrés, et il jure de les défendre jusqu'à la mort. Dans ces moments d'exaltation, ce n'est plus le même homme: son regard de feu, l'éclat de sa voix, l'agitation de son épaisse chevelure, lui donnent un aspect qui vous effraye, et tout, dans sa personne, habite l'éloquence. On ne peut s'empêcher de dire : « Voilà un homme convaincu. »\n\nPlusieurs fois j'ai été témoin des discussions de Riel avec ses adversaires, une fois surtout avec l'honorable secrétaire du lieutenant-gouverneur du Nord-Ouest, Canadien français d'un grand mérite, d'une instruction solide et d'une logique serrée, mais calme et froid comme un homme d'Etat. Le contraste entre ces deux hommes était saisissant. Malheureusement pour Riel, comme pour tout orateur passionné, il lui échappe, dans ces moments d'excitation, des expressions trop fortes, qui nuisent à sa cause et l'ont, plus d'une fois, fait rappeler à l'ordre. Il\na cela de bon qu’il accepte humblement l’observation et désavoue ses écarts de parole. Mais cette éloquence passionnée ravit le peuple métis, qui le trouve incomparable et en fait un docteur en Israël, un Josué, un prophète et même un saint; en sorte que nous devons être, quand il s’agit de lui, d’une extrême réserve. Malgré notre prudence, il nous est arrivé souvent de voir nos expressions mal interprétées et l’affection de nos ouailles pour nous se refroidir.\n\nLe 5 septembre, je crois, S. G. Mgr GRANDIN, revenant du Caribou, voulut bien présider à Saint-Laurent une assemblée des principaux métis de la colonie, dans la salle d’école du couvent du Sacré-Coeur. Le local était comble; les orateurs parlèrent avec beaucoup de modération, quelques-uns même, comme sous l’empire d’une crainte respectueuse, inspirée par la présence de Sa Grandeur. Les discours se résumaient dans la pensée d’exprimer à Monseigneur la peine que l’on éprouvait du malaise existant entre les révérends Pères et la population, celle-ci toujours docile dans le passé, toujours décidée à l’être dans l’avenir, mais aussi, restant convaincue de la justice de sa cause. Sa Grandeur donna, avec sa douceur et sa charité habituelles, des explications si sages qu’elles satisfirent tout le monde, et que les visages les plus sombres finirent par s’épanouir. À la demande de Riel, Monseigneur donna pour patron principal à la nation métisse saint Joseph, et pour patron secondaire, saint Jean-Baptiste, premier patron des Canadiens-Français, avec fête nationale fixée au 24 juillet, un mois après les grandes fêtes nationales des Canadiens. La séance fut terminée par la bénédiction de Sa Grandeur.\n\nCependant, les bruits de ces agitations politiques, grossis par la renommée et par les rapports des journaux, parvinrent bientôt aux oreilles du gouvernement.\nIl répondit aux sourds et lointains grondements de l'orage par l'envoi d'un petit corps de cavalerie, lequel est caserné maintenant au milieu de la colonie, et semble, par sa présence, commander l'ordre et le calme.\n\nEnfin, après bien des assemblées, des délais et d'ininterminables discussions pour se mettre d'accord, Français et Anglais, ce qui n'a jamais été une petite tâche, la fameuse pétition qui doit ramener l'âge d'or dans ces immenses prairies a été rédigée et envoyée à destination, il y a de cela quelques semaines. Depuis ce moment, Riel paraît plus calme, quoique non sans inquiétude pour l'avenir. Il y a des nuages dans nos parages : la famine, ou tout au moins la misère, est à notre porte, et vous connaissez le proverbe : « Ventre affamé n'a point d'oreilles. » L'esprit de discorde a ici ses suppôts, qui ne cherchent qu'à soulever la tempête. Malgré ces symptômes mauvais nous ne perdons pas courage ; la pensée qui domine en nous et soutient notre espérance, c'est que la foi et le bon sens de nos chers métis les retiendront sur le bord de l'abîme, et qu'ils resteront fidèles à la voix de la religion, à laquelle ils doivent d'avoir été tirés de la sauvagerie.\n\nPriez bien pour eux et pour nous, Très Révérend Père, afin que l'année 1885, qui arrive et qui s'annonce sous de si tristes auspices, ne nous apporte, avec la bénédiction des SS. Cœurs de Jésus et de Marie, que paix, justice, patience, force et résignation. Qu'elle apporte aussi à votre cœur si paternel la grande consolation de voir tous ses chers enfants ne former qu'une famille de frères et de saints, dont je vous prie de bénir le plus indigne et le dernier de tous, qui désire toujours être votre très respectueux et très obéissant fils,\n\nFOURMOND, O. M. I.,\nDirecteur de la Mission de Saint-Laurent (Saskatchewan).", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007721.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8304, "total-output-tokens": 3063, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 995, 1], [995, 2720, 2], [2720, 4614, 3], [4614, 6531, 4], [6531, 8366, 5], [8366, 10176, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]