[{"id": "869b11745feaeb940961faff6795c1f845f96ae1", "text": "SAINT-ALBERT.\n\nLETTRES DU R. P. BONNALD.\n\nLac Caribou, 1er février 1877.\n\nMON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\n... L'année dernière, au mois de janvier, je me préparais à une mission que je devais aller faire à la nation des Cris des bois, de l'Est. Le 20 mars, après avoir embrassé le cher et vénéré P. Gasté et nos Frères, et touché la main à nos gens, assemblés sur la côte de la mission, je partais, les raquettes aux pieds, à la suite de deux traînes que conduisaient le F. Labelle et un serviteur montagnais. C'était un premier voyage à la raquette. Nous traversâmes l'immense lac Caribou, à l'entrée duquel nous rencontrâmes des traiteurs protestants, qui me reçurent fort bien. Dans leur hutte j'assemblai les quelques sauvages cris campés aux alentours. Je baptisai deux enfants, j'entendis sept confessions, et, à ma messe, je donnai la sainte communion à quatre personnes. Un vieux sauvage et sa femme furent seuls à ne pas se rendre ; elle, parce qu'elle venait d'être guérie par la médecine d'un jongleur, et lui parce qu'il est devenu indifférent depuis qu'il fréquente les protestants. Ces pauvres commerçants vivaient là fort misérablement, courant nuit et jour après les sauvages pour avoir leurs fourrures, et conduisant eux-mêmes leurs traînes, faute de chiens. Cette halte me fit du bien, et mes jambes étaient toutes neuves pour repartir le lendemain. Nous allions vers le sud, voyageant tout droit, par monts et par vaux, tantôt sur des rivières,\ntantôt sur de petits lacs, ou à travers des bois. Enfin, après neuf jours de voyage, nous arrivâmes au lac Pélican.\n\nLe F. LABELLE repartit le lendemain avec le Montagnais. Je m'ennuyai un peu ce jour-là dans ma solitude, pensant tout le temps au bon Frère qui venait de me quitter. En attendant l'arrivée de quelque sauvage, je me livrai à l'étude du cri. Grâce aux enfants et à toute la famille de mon hôte, métis catholique, je fis bientôt de véritables progrès ; aussi, quand les sauvages commencèrent à arriver par petites bandes, je pus leur parler dans leur langue. J'eus le bonheur de gagner leurs sympathies. On sut bientôt, dans les bois, que j'étais venu de loin pour voir les Cris ; aussi ces bons sauvages, en arrivant au fort, venaient tout de suite à moi pour me toucher la main, avec un air heureux qui me faisait plaisir.\n\nEn attendant leur arrivée en nombre plus considérable pour les premiers jours de juin, je me livrai aux travaux manuels. Matin et soir, après mon office, j'allais, la hache à la main, défricher l'emplacement de notre future mission. J'avais déjà fait un abattis de bois considérable, et j'allais continuer, quand j'eus la maladresse de me blesser au pied d'un coup de hache. J'en fus heureusement quitte pour trois semaines de retraite dans ma petite chambre. C'est pendant ce temps que toute une flottille de canots sauvages arriva à la place. Plusieurs restèrent longtemps, mais le plus grand nombre ne demeura qu'une semaine, et quelques-uns trois jours seulement. J'employai le jour et la nuit à satisfaire la sainte avidité d'instruction religieuse de ces excellents sauvages. Une famille surtout se distingua par sa foi vive. Je n'ose pas espérer d'en trouver jamais de pareille. Que le bon Dieu en soit béni et remercié à jamais. Pour moi, n'an-\nrais-je annoncé le saint Évangile qu’à cette famille, je mourrais content.\n\nLe ministre anglican vint à passer pendant ma mission. Notre entrevue fut assez froide, quoique polie. Je me permis de lui faire quelques questions, mais il fut très-réserve. J’appris cependant par lui quelques détails étrangers aux questions religieuses, tels, par exemple, que la maladie du R. P. Leduc et la mort d’un vieux ministre méthodiste, gelé dans la prairie. Après une heure de halte, le Révérend repartit, en promettant à ses ouailles de repasser prochainement.\n\nLa femme de mon hôte se démena fort pour procurer à son ministre la consolation de quelques baptêmes. Son zèle était redoublé par la reconnaissance, attendu que le ministre lui avait donné une belle robe et d’autres présents pour ses enfants. Cette femme parvint à décider une vieille sauvagesse, infidèle et sorcière, à laisser baptiser sa petite-fille de douze ans. Je l’instruisais depuis plusieurs semaines, et, n’ayant pu l’admettre encore avec les autres enfants que j’avais baptisés, je lui avais promis ce bonheur pour le dimanche suivant. Mais la pauvre enfant dut céder aux menaces de sa rude grand’mère. Au retour du ministre, elle fut ondoyée par lui, ainsi que la vieille femme d’un bigame, sans que ni l’une ni l’autre eussent à répondre à la moindre question religieuse.\n\nVers la fin de juin, je louai deux hommes et un canot, pour aller visiter quelques pauvres familles catholiques, établies au milieu des sauvages protestants. Je leur fis grand bien et je revins bien consolé. Je fis ensuite un voyage au Cumberland, pour y voir un Père que Mgr Grandin m’avait dit d’aller visiter. Je remontai sans l’avoir rencontré. En repassant à ma chère petite mission du Sacré-Coeur, au lac Pélican, j’aurais bien voulu y passer\nl'automne, mais la difficulté d'un retour tardif au lac Caribou et notre pauvreté ne me le permirent pas. Le F. Guillet, qui était descendu là avec les berges, avait pu, aidé d'un Cri, élever une petite maison, à côté de la croix. Nous repartimes ensemble sur les barques de la Compagnie. En m'éloignant, je confiai aux saints Anges gardiens les âmes des chers sauvages de ce quartier, encore faibles dans la foi.\n\nSur notre route, nous rencontrâmes quelques-uns de ces pauvres gens; ils n'auraient pas voulu me laisser repartir. Je leur promis de revenir les voir au printemps prochain. Il y a là une mission de grand avenir, si nous pouvons nous en occuper sérieusement. Les sauvages qui fréquentent cette place sont, les uns catholiques de vieille date, les autres catéchumènes; quelques-uns sont protestants, et le plus grand nombre est infidèle. De plus, ces sauvages sont parents de ceux qui fréquentent le lac Fendu, encore plus à l'est. Si Monseigneur pouvait envoyer là un Père qui sût parler le cri, ce serait l'occasion du salut pour un grand nombre. Cette nation nous désire et veut sérieusement devenir chrétienne. Si elle ne reçoit pas, par notre ministère, la parole de vie, le ministre protestant, qui est là tout près, viendra sûrement les tromper et les perdre. En ce moment, Monseigneur est accablé d'œuvres avec les missions des prairies et les paroisses des colons de la Siskatchewan. Il ne pourra pas probablement s'occuper des missions naissantes, malgré son grand zèle des âmes, et alors que deviendront les pauvres Cris de l'Est?\n\nLe R. P. Gasté m'enverra tous les ans visiter cette tribu; mais qu'est-ce qu'une visite pour tout un peuple disséminé? On ne voit pas le quart des gens, et ceux qu'on voit ne peuvent pas être instruits en si peu de temps.\nRevenu de ma mission depuis le 5 août, je me livre à l'étude du montagnais, affreuse langue ! dont je sais à peine les éléments....\n\nVeuillez bénir, mon très-révéré et bien-aimé Père, votre humble enfant en N. S. et M. I.\n\nBonnald, O. M. I.\n\nLac Pélican, le 22 juillet 1877.\n\nMon très-révéré et bien-aimé Père,\n\nC'est du pied de la croix, sur le bord de notre petit lac, que je vous écris cette lettre, en attendant le passage des berges du lac Caribou. Je vous ai déjà adressé ma lettre annuelle au mois de février dernier, mais je vous écris encore, parce que je crois vous faire plaisir en vous racontant ce que font ici ceux de vos enfants que la sainte obéissance y a envoyés.\n\nJe dois vous dire d'abord que, fidèle au programme indiqué dans ma dernière lettre, je suis allé faire un séjour de six semaines chez les Montagnais. Le 3 février, je quittai la mission du lac Caribou en compagnie d'un jeune Montagnais. Le F. Labelle m'accompagna avec la traîne à chiens, jusqu'à une petite distance du camp où les sauvages m'attendaient. C'était la première fois que j'allais vivre exclusivement avec de pauvres sauvages, habiter dans leur loge, partager leur nourriture, et les suivre partout. Mon dessein était de me familiariser par là à l'accent de leur langue si difficile. Ils étaient fiers de m'avoir pour compagnon, et ils me soignaient de leur mieux. La plus belle place de la loge était pour moi ; la meilleure part de la chasse m'était réservée, et tous, à l'envi, voulaient m'enseigner leur langue. Nous levions le camp\nà peu près tous les jours. J'avais à mon service deux de nos chiens, qui traînaient mon petit bagage. Tandis que les femmes, les enfants et le père cheminaient sur le lac la raquette aux pieds, à la suite des chiens avec tout le bagage du campement, les chasseurs parcouraient les bois, et revenaient le soir au rendez-vous convenu dès le matin.\n\nLes enfants, tout habillés de peaux de caribou, s'amusaient à courir et à se rouler sur la belle neige, et, comme ils étaient toujours autour de moi, j'attrapais bien des mots que je leur répétais : « Père, dis cela, criait l'un. — Père, disait un autre, dis ceci ; » et ainsi de suite tout le long du chemin. Nous faisions de petites journées.\n\nPour faire le campement, les femmes s'armaient de grandes cuillères de bois, écartaient la neige, et puis faisaient un tapis de branches de sapin. Sur seize longues perches, réunies par les bouts, on jetait la loge en peau de caribou, au centre de cette rotonde on allumait le feu, près duquel on préparait mon lit. Je pouvais ainsi facilement réciter mon breviaire. Quand je l'avais fini, les enfants venaient aussitôt me faire la leçon en montagnais, et se laissaient aller à leur habil et à leurs aimables bavardages. J'écrivais autant de mots que j'en entendais, et si personne ne parlait, j'étudiais la grammaire manuscrite de Msr Farnaud. Les chasseurs arrivaient dans la nuit, les glaçons aux cheveux et sur leurs habits. Nous ouvrions tous de grands yeux pour voir s'ils nous apportaient de quoi manger, car on vivait au jour le jour, et, comme on dit ici, au bout du fusil. Après le long silence qui est de cérémonie chez les sauvages arrivant de chasse ou de voyage, on entendait le récit de chaque chasseur.\n\nLe Montagnais est, de tous les sauvages peut-être, le plus sournois quand il arrive de la chasse. Je n'ai pu encore m'habituer à ce silence stupide, comme tant d'au-\ntres qui se résignent à attendre ; c'est-à-dire que de tous les curieux je suis le plus curieux. Mais quand nous vivions depuis quelques jours de mauvais poisson ou de pure viande pilée, j'étais bien aise de savoir si nos chasseurs nous feraient bientôt manger de la viande fraîche. C'est ainsi que bien souvent je les ai fait parler malgré eux, et ils me trouvaient singulier à cause de cela. Avant de prononcer une parole, le Montagnais laisse fondre les glaces dont il est couvert, puis quitte ses mitasses, souffle, soupire longuement, s'essuie la figure et les yeux, se verse du thé chaud, boit un coup, et enfin commence à parler : il a vu des pistes de martre ; il a trouvé des loges de castor ; il a vu des caribous, etc., etc.\n\nLes nuits étaient longues ; on veillait tard dans les loges. Après les fumeries, nos gens s'exerçaient à lire et à chanter. Pendant le Carême, nous récitions tous les soirs le chapelet. Les enfants disaient, chacun en leur particulier, leur prière du soir sur les genoux de leurs mères. Les nuits étaient très-froides ; impossible de dormir : je grelottais sous ma couverture et ma peau de caribou ; aussi je n'étais pas paresseux pour me lever quand Baptiste allumait le feu. Les sauvages, quoique moins couverts que moi, ne souffraient pas du froid, tant ils sont ingénieux pour s'en garantir. À la façon des chiens, ils dorment la tête sur les genoux, et demeurent immobiles dans cette position jusqu'au matin. Nous fûmes cependant favorisés de quelques beaux jours pendant le mois de février. Les vieux voyaient pleuvoir, pour la première fois, au cœur de l'hiver. Il y eut aussi des éclairs et du tonnerre, chose étrange dans ces pays et à cette époque.\n\nJe passai tristement la fête du 17 février. Un abcès à la main, lequel me fit beaucoup souffrir, m'empêcha de célébrer. Je passai le jour à essayer de prendre quelques\nfruits, au moyen d'un hameçon, à travers un trou pratiqué dans la glace. J'en pris assez, ce jour-là, pour la nourriture de tout le monde. Heureusement, le soir, en arrivant de la chasse, un de nos hommes apporta deux langues de caribou. Le lendemain nous étions riches de viande.\n\nJ'accompagnai plusieurs fois nos hommes à la chasse au castor. C'est un travail bien dur, mais qui rapporte beaucoup, quand il réussit. Dans la loge de terre, démolie à coups de pioche et de hache, on trouvait quelquefois jusqu'à huit castors. Nous étions alors dans l'abondance. Les femmes préparaient les fourrures, pour les vendre au fort, et la chair était réservée pour le réfectoire ambulant.\n\nJe commençais aussi à m'ennuyer beaucoup. Je ne pouvais, en effet, suivre la conversation, et j'étais incapable de célébrer, à cause de la rigueur du froid, qui fut excessif dans le mois de mars. Une fois, cependant, je tentai de le faire. La plaie de ma main commençait à se cicatriser ; mais je crus, un moment, que je serais obligé d'interrompre la messe. Je me gelais les mains à côté du feu, mais surtout la partie malade. Je pus enfin communier, mais je souffris beaucoup pendant la célébration du saint sacrifice.\n\nLe mercredi après le quatrième dimanche de carême, je quittai mes sauvages ; un jeune homme infirme consentit à être mon guide. Je mis sur ma traîne mon lit, ma chapelle et deux castors pour régaler le P. Gasté et nos Frères, et nous partimes pour retourner à la mission. J'étais content. Je marchai en avant au milieu des bois jusqu'à midi. Nous entrâmes alors dans l'immense lac Caribou. Le vent du nord soufflait avec violence. Mon jeune homme se gela les joues et le menton ; je n'aurais pas été épargné non plus si je ne m'étais couvert la figure avec mes mitaines. Enfin, le vendredi soir, nous\narrivâmes en vue de notre mission. J'en étais ému jusqu'à pleurer de bonheur. Je fus reconnu de loin. Le R. P. Gasté se promenait devant l'église, et les enfants accouraient tous à ma rencontre, les plus petits tombant dans la neige et se plaignant de ne pouvoir courir comme les autres. Pauvres enfants ! Il me tardait de les revoir, ils m'embrassaient et me disaient toute la peine qu'ils avaient eue de mon absence et toute la joie qu'ils avaient de mon retour. Je me réjouis de me trouver encore une fois avec mes frères, et je pris connaissance des bonnes lettres qui m'attendaient.\n\nLe R. P. Gasté vous racontera sans doute nos fêtes de Pâques. Les Montagnais y étaient accourus en grand nombre. Le Samedi saint, une jeune fille crise mourut, on peut dire, en odeur de sainteté après une courte maladie, quatre mois après son baptême. Si on écrivait la vie de cette chrétienne, il y aurait des traits magnifiques à signaler.\n\nQuelques jours après Pâques, je partis pour le pays des Cris de l'Est. La veille de mon départ, une femme protestante vint me demander à faire son abjuration ; comme elle était préparée depuis l'automne précédent, je l'admis de suite. Le 13 avril au matin, j'embrassai le R. P. Gasté et le F. Guillet et je donnai la main à tous nos gens assemblés sur la côte. Je partais pour longtemps. Nous avions une traîne à chiens conduite par un excellent Cri, et le F. Labelle m'accompagnait. Le dégel commençait trop tôt. Cela nous valut un bien triste voyage dans l'eau de neige sur la glace froide du lac. Enfin, Dieu soit béni ! pour quelques souffrances du voyage, nous avons eu ici le bonheur de voir de nouveaux et fervents chrétiens. Un jour avant d'arriver à la rivière Caribou, nous rencontrâmes les gens d'un excellent métis catholique, Antoine Morin, qui venaient à\nnotre rencontre avec deux belles traînes. Quand nous fûmes arrivés au petit Fort, le cher Antoine mit à notre disposition une maison, où je suis resté avec le F. LABELLE depuis le 19 avril jusqu’au 25 mai. Nous avions là des vivres, en viande sèche, que le F. LABELLE y avait transportées à la suite des gens qui étaient venus à nos fêtes de Pâques. Nous les épargnions, afin de pouvoir passer l’été au lac Pélican. Antoine nous donnait tous les jours du poisson, quelquefois du castor et du gibier. J’avais là une soixantaine de catholiques, en comptant les enfants. Deux fois le jour, je les réunissais chez moi. Ils firent tous leur devoir. Les enfants vinrent tous les jours au catéchisme et apprirent bien leurs prières. Il y avait là aussi quelques infidèles, mais tous de la pire espèce, à part un seul, et aussi quelques protestants fanatiques. Nos catholiques me consolaient beaucoup. Je n’étais là qu’en passant et pour attendre l’occasion de descendre au lac Pélican.\n\nLe 25 mai, je pris passage avec le F. LABELLE sur la berge de M. Thomas, un traiteur. Sur la route, je rencontrais quelques familles chez lesquelles je fis un baptême, deux mariages et j’entendis quelques confessions. Il y a de ces pauvres sauvages qui ne voient le prêtre qu’une fois par an. Ils s’empressent de lui ouvrir leur conscience qui souvent n’a rien de grave à se reprocher.\n\nLe 31 mai, nous arrivions à notre petite mission du Sacré-Cœur. J’étais heureux de l’occurrence. Le 1er juin, premier jour du mois du Sacré-Cœur, le vendredi, jour même du Sacré-Cœur, je disais la messe pour la première fois cette année à notre mission naissante consacrée au divin cœur de Jésus. Le lendemain soir, arrivèrent les Cris du lac Fendu. Ces bons sauvages fréquentaient autrefois le poste de Nelson-House, où se trouve un ministre méthodiste. Depuis quelque temps, ils se sentent attirés\nde notre côté, et c'est, je n'en doute pas, la miséricorde du bon Dieu qui appelle ces pauvres infidèles à notre sainte religion. Je revis avec bonheur mes catéchumènes de l'été précédent. Non-seulement, ils n'avaient pas oublié leurs prières, mais les infidèles qui les accompagnaient avaient appris d'eux les principaux mystères. Je fus touché jusqu'aux larmes de voir pour la première fois ces beaux jeunes gens, qui n'avaient jamais vu de Missionnaire catholique, faire si bien le signe de la croix et me réciter très-exactement le Pater, l'Ave, le Credo et plusieurs cantiques et invocations dans leur langue. Les premiers infidèles de cette nation, que j'avais rencontrés l'été précédent, s'étaient faits Missionnaires dans leurs bois, en instruisant leurs compatriotes. Le Tableau-Catéchisme exposé dans la loge du vieux Ostikwan était étudié et commenté tous les dimanches, et on venait de cent lieues à la ronde pour suivre sur le tableau l'histoire de l'homme sur la terre et le chemin qu'il doit parcourir pour aller trouver le bon Dieu dans le ciel.\n\nJe n'en finirais pas, mon très-révéré Père, s'il fallait dire en détail comment cette nation des Cris de l'Est, hier encore infidèle, est devenue chrétienne. Nous le devons certainement à la bonté infinie du cœur de Notre-Seigneur, à qui cette jeune mission a été consacrée. Le Patriarche de ces forêts de l'Est était venu cette fois voir le Missionnaire. Ce bon vieillard, quoique trigame, comprend l'importance de la religion et y croit de tout son cœur. Il veut absolument que tous ses enfants deviennent chrétiens, et il commence par donner l'exemple. J'ai déjà baptisé une de ses femmes qui l'a quitté; elle s'est trouvée très-heureuse de sa liberté dont elle s'est servie pour recevoir le baptême qu'elle désirait avec ardeur, surtout depuis qu'elle avait vu en rêve un homme habillé de blanc lui faire des signes de croix sur le front.\nLes enfants du vieux chef Ostikwan ont tous connu notre sainte religion par leur frère ainé, Gabriel, que j'ai baptisé cet été. Déjà sept adultes de cette nation ont reçu le baptême, ainsi que trois enfants. J'ai su que tous les autres soupirent après nous. Sans avoir jamais vu le prêtre, ni d'autres catholiques, ils s'éloignent instinctivement de la mission méthodiste, chantent avec ardeur quelques-uns de nos cantiques, se signent de notre signe sacré et récitent les premières prières du Catéchisme. Que c'est beau et que de fois j'ai pleuré de bonheur en voyant ces bons sauvages infidèles, assis autour de moi, apprendre avec amour leurs prières en les répétant sans jamais se lasser, se soufflant les uns aux autres les mots qui leur avaient échappé. S'ils sortaient de chez moi, c'était pour aller répéter ces prières avec quelqu'un de nos bons vieux chrétiens et revenir ensuite tout joyeux me faire constater leurs progrès.\n\nJ'étais en train de les instruire, quand le maître d'école de la mission protestante voisine vint exciter ses gens contre moi. Ce fanatique réunissait chez lui le plus grand nombre des Cris protestants de la place. Je n'avais chez moi que deux familles de l'endroit et mes chers sauvages du lac Fendo. Quelques protestants y étaient aussi venus, les uns par sympathie, les autres par curiosité. J'expliquais à tous les images catholiques appendues aux parois de mon appartement. J'affirmais clairement que la religion catholique est la seule établie sur la terre par Notre-Seigneur Jésus-Christ et que la religion protestante est l'œuvre du démon accomplie par un roi orgueilleux et impudique. La lie des protestants, tels que les concubinaires, les superstitieux, les jongleurs, complotèrent contre moi et leur rancune éclata au lendemain d'une fameuse jonglerie qui avait excité\nla terreur des sauvages et que je fis interrompre au milieu de la nuit. J'allai jusqu'à la loge mystérieuse où elle s'accomplissait et je leur déclarai combien ils offensaient le bon Dieu en implorant le secours de leurs fétiches, qui n'étaient autres que les démons. Le lendemain, grande honte pour les jongleurs, qui se hâtèrent de partir, et grande colère des protestants, qui me reprochaient de m'être moqué de leur religion. L'un d'eux entra chez moi, et, s'armant d'une bûche, courut sur sa femme, que j'instruisais dans ce moment : Tu auras ma religion ou tu n'en auras pas, lui dit-il; et il la prit par les cheveux et la traîna dehors. Les bons protestants ne désertèrent pas ma maison pour cela. Quand le pédagogue fut parti, ils ne manquèrent pas un dimanche, et plusieurs répondaient au chapelet. A la fin, une fille vint me dire qu'elle voulait se faire catholique, parce que, l'hiver dernier, dans une grave maladie, elle en avait fait le vœu si elle guérissait. Son frère aussi a les mêmes intentions. Je compte pouvoir les admettre à l'automne.\n\nJe suis resté au lac Pélican environ deux mois. Le F. Labelle a rendu notre maison habitable, et, pendant que j'instruisais les sauvages, il a défriché tout autour et préparé l'établissement de l'église. J'ai acheté un canot de pêche. Le F. Labelle a tendu toujours des rets pour nous fournir du poisson.\n\nLe R. P. Paquette nous est arrivé au commencement de juillet, avec Mathias, orphelin élevé à Saint-Albert. J'ai été bien heureux de voir arriver ce bon Père dans nos missions crises de l'Est. Nous pourrons maintenant aller au secours de ces pauvres sauvages tout à fait disposés à devenir chrétiens. Je pourrai aussi, sans inconvénient, retourner au lac Caribou et m'habituer à cette langue montagnaise que je ne parle pas encore. Je suis descendu ici au fort Cumberland pour m'entendre avec M. Belan-\nger sur nos projets d'établissement pour nos missions dans ce district. Le R. P. Paquette va, lui aussi, se rendre ici avec le F. Némoz, qui arrive de l'île à la Crosse. Je laisserai ici le F. Labelle pour aider le F. Némoz. M. Bélanger, premier officier du district, nous sera d'une grande utilité pour notre établissement. On va se hâter de profiter de ses bons offices. Je suis arrivé ici avant-hier et je repars demain avec les berges.\n\nVous voudrez bien excuser, mon très-révéré Père, l'incorrection de ma lettre. Je l'avais commencée au lac Pélican et je la termine ici au fort Cumberland, au milieu du tapage.\n\nLaissez-moi recommander à votre charité paternelle les besoins de ma pauvre âme ; daignez me donner votre meilleure bénédiction. Je me sens toujours pour votre Paternité les sentiments et l'affection d'un enfant reconnaissant de toutes vos bontés et plein de respect filial.\n\nBonnald, O. M. I.\n\nEXTRAIT D'UNE LETTRE DU R. P. MOULIN.\n\nMission Saint-Pierre du lac Caribou, le 6 février 1877.\n\n...Nous allons tous bien pour le moment et nous continuons à travailler, chacun selon sa spécialité, à l'œuvre qui nous est confiée. Longtemps avant nos belles fêtes de Pâques de l'année dernière, le R. P. Bonnald était parti pour la mission du Sacré-Cœur au lac Pélican, afin d'y voir les sauvages Cris et de les initier à la connaissance de la religion. Ce cher Père les trouva généralement bien disposés et goûta parmi eux beaucoup de consolations. Vous vous rappelez sans doute, mon très-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007620.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 19376, "total-output-tokens": 7521, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1470, 1], [1470, 3263, 2], [3263, 5050, 3], [5050, 6828, 4], [6828, 8361, 5], [8361, 10240, 6], [10240, 12105, 7], [12105, 13910, 8], [13910, 15711, 9], [15711, 17578, 10], [17578, 19484, 11], [19484, 21302, 12], [21302, 23172, 13], [23172, 24673, 14]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]