[{"id": "c5052eb46caa95b20c525c9805a2ba4738c7614e", "text": "PROVINCE ECCLÉSIASTIQUE DE SAINT-BONIFACE\n\nDu 16 au 24 juillet dernier, les évêques de la province ecclésiastique de Saint-Boniface, tous Missionnaires-Oblats de Marie Immaculée, se sont réunis en concile à Saint-Boniface, sous la présidence de Sa Grâce, Mgr Alexandre Taché, archevêque. Nous espérons recevoir prochainement quelques détails historiques sur la tenue de cette importante assemblée ; en attendant, nous publions l’Adresse qu’en a reçue le T. R. P. Supérieur général.\n\nAu Révérend Père J. Fabre, Supérieur général des Oblats de Marie Immaculée.\n\nRÉVÉRENDISSIME ET BIEN-AIMÉ PÈRE,\n\nNous voici, nous les Pères du premier Concile provincial de Saint-Boniface, tous Oblats de Marie Immaculée, pour vous offrir nos respects et nos hommages.\n\nLe fait même de cette réunion parle bien haut à qui a des yeux pour voir et des oreilles pour entendre ; il nous dit que ceux qui étaient assis dans les ténèbres et l’ombre de la mort ont vu une grande lumière ; il nous dit aussi que les membres de notre chère Congrégation, sous l’œil de Dieu, se sont élançés comme des géants à la conquête des âmes, sans se laisser jamais détourner de leur but par les Puissances de ténèbres, non plus que par les épreuves envoyées du ciel pour l’accroissement de leurs vertus et de leurs mérites.\n\nAvant eux et depuis longtemps, le premier évêque de Saint-Boniface, admirable par son zèle, son abnégation et son dévouement, aidé d’un trop petit nombre de coopérateurs, répandait à pleines mains la semence divine autour de lui ; mais le cercle de son action était nécessairement bien circonscrit : de là naissait une vive, une constante douleur dans ce noble cœur d’évêque. Au\nloin, bien loin dans le nord, à l’est, à l’ouest, de nombreux enfants demandaient du pain et le saint évêque n’avait personne pour le leur rompre.\n\nCe fut en 1844, après une fervente méditation, suivie d’une messe pour invoquer les lumières du Saint-Esprit, qu’une pensée déjà vaguement présente à son esprit, revêtit soudain une forme déterminée : « Je connais, dit-il, je connais Mgr de Mazenod ; son cœur est enflammé du désir du salut des âmes, et de plus, il est fondateur et Père d’une société de missionnaires, portant le nom de Marie Immaculée et ayant pour devise : Pauperes evangelizantur. Mes diocésains sauvages, répandus dans un pays immense, surpassent en pauvreté tous les autres pauvres. Mes vœux et mes prières seront exaucés, le secours arrivera et j’entonnerai mon Nunc dimittis. »\n\nNotre Révérendissime fondateur et Père, quand cette demande lui arriva, en fut effrayé, il s’exagérait certainement les périls : « C’est, disait-il, envoyer mes enfants à la mort. » Mieux inspiré ensuite par son zèle et la prière : « Fiat, s’écria-t-il, je m’imposerai ce sacrifice, in odorem suavitatis. » Il accepta donc ce champ de travail d’une immense étendue.\n\nLa pénurie était grande parmi les Oblats ; aussi les commencements furent petits. Au printemps de 1843, un Père encore jeune, et un petit novice de vingt-deux ans quittèrent Montréal pour se rendre à la rivière Rouge, considérée alors comme le bout du monde. En 1846, le novice de l’année précédente, devenu Oblat et prêtre, ayant pour mentor un saint missionnaire, plein de zèle et d’expérience, allait planter sa tente à l’île à la Crosse, au milieu des sauvages. Durant ce même été, deux nouveaux Oblats arrivèrent, et celui de 1848 nous en amenait deux autres.\nL'année 1850 fut marquée par un de ces événements providentiels où il faut reconnaître le doigt de Dieu. Ce fut durant cette année, en effet, que le premier prêtre Oblat, ordonné par le vicaire apostolique du nord-ouest, fut nommé évêque coadjuteur de Saint-Boniface. L'humble opinion qu'il avait de lui-même et une sensibilité exquise étreignant son cœur, lui firent verser d'abondantes larmes. Appelé en France pour y recevoir l'onction épiscopale de notre saint fondateur, il obéit. À son arrivée, ses craintes s'évanouirent et il sécha ses larmes, quand il apprit, de la bouche même de Mgr de Mazenod, que cette nomination avait arrêté sa main prête à signer l'ordre de notre rappel.\n\nNotre jeune évêque amena avec lui quelques nouveaux sujets. Sous la forte impulsion qu'il sut donner à tout, nos missions devinrent assez nombreuses pour exiger l'érection de quelques évêchés et vicariats apostoliques qui, par la volonté de Notre Saint Père le Pape, forment la province ecclésiastique de Saint Boniface.\n\nCes évêques réunis, pour leur premier Concile, à Saint-Boniface, se font un devoir de vous dire, très révérend et bien cher Père : Nous sommes vos fils; notre affection pour vous et pour la Congrégation est inaltérable, nous sommes et voulons toujours être,\n\nVos Oblats tout dévoués.\n\n+ Alexandre, O. M. I., archevêque de Saint-Boniface ;\n+ Vital, O. M. I., évêque de Saint-Albert ;\n+ Henri (Joseph), O. M. I., évêque d'Anemour ;\n+ Isidore, O. M. I., évêque d'Arindèle ;\n+ Paul, O. M. I., évêque de Marcopolis ;\nJ.-B.-Célestin Augier, O. M. I., délégué de Mgr l'évêque de Mélitopolis.\n\nSaint-Boniface, le 24 juillet 1889.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007781.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1624, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1665, 1], [1665, 3399, 2], [3399, 5031, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]