[{"id": "fd4d815f07c75a88e951abd906307b1c572ed161", "text": "histoires de chasse. Après le repas je récitaï les grâces, et les histoires recommencèrent. Le moment de fumer était venu ; le maître du logis fit les honneurs du tabac, il avait eu soin d’en faire hacher à l’avance, il en distribua une certaine quantité par groupes et chacun puisait au tas le plus voisin. Quand je crus le moment venu de me retirer, j’invitai tout le monde à la prière; je la récitaï à haute voix et chacun la répétait après moi.\n\nTel est, mon très-révérend Père, le récit fidèle, mais trop long peut-être, de ce qui s’est passé chez nous depuis ma dernière lettre. Vous voudrez bien me pardonner ces détails peut-être peu intéressants, pour ne voir que mon désir de vous tenir bien au courant de ce qui concerne vos enfants du lac Caribou, non moins que mon bonheur de pouvoir m’entretenir longuement avec vous.\n\nVotre enfant obéissant et tout dévoué,\nA. Gasté, O. M. I.\n\nP.-S. Grâce à Dieu, et aussi un peu à Notre-Dame de Lourdes, notre petit orphelin Simon paraît sauvé. Il court et s’amuse de plus belle.\n\nLe R. P. Bonnald écrit également de la Mission Saint-Pierre au lac Caribou :\n\n« L’été dernier j’étais au fort Cumberland, où je dus faire un séjour de plus de trois mois, par suite du retard du steamboat, qui n’amena dans son premier voyage aucune pièce pour le poste du Caribou. Le district du Cumberland est très-étendu; il forme la partie est du diocèse de Saint-Albert, et c’est la plus abandonnée. C’est le pays des Cris surnommés Maskégons, tous ou presque tous protestants. Les Missionnaires catholiques ont quelque-\nfois passé par là, mais jamais ils ne s'y sont établis. Nos Pères y font de temps en temps des apparitions pour visiter les catholiques, serviteurs de la compagnie. En quittant Mgr Grandin à Carlton, j'avais reçu de lui la recommandation de visiter toutes les familles métis catholiques disséminées dans les divers postes de ce district. Je les ai à peu près toutes vues. Ces pauvres gens font pitié. Les anciens sont assez instruits, mais les jeunes sont fort ignorants. Quand les parents ont appris à leurs enfants le *Pater l'Ave* et le *Credo* en français et à faire le signe de la croix, ils pensent que l'instruction religieuse est suffisante. Cette malheureuse génération qui grandit vit sans culte et sans sacrements au sein d'une atmosphère protestante. Et cependant, par une miséricorde admirable de Dieu, sur un nombre si considérable de familles, on n'en cite qu'une qui soit passée à l'hérésie, et encore faut-il dire que les enfants de l'apostat cherchent à se rapprocher de nous. Le long de la Siskatchewan, vers son embouchure, depuis le Cumberland jusqu'au lac Winnipeg, il y a trois postes de traite. Après le Cumberland c'est le Pas ; jadis il y avait là une petite chrétienté fondée par les Jésuites et visitée plus tard par les prêtres canadiens. Mais aujourd'hui elle a entièrement disparu : *non erat qui frangeret eis*. Dans les premiers temps que nos Pères remontaient cette partie sud-est de la Siskatchewan, Mgr Faraud avait rencontré quelques débris de cette chrétienté isolés sur la rive gauche, en face de la colonie protestante. Les sauvages de ce quartier se souviennent encore des premiers Missionnaires qui ont baptisé leurs pères, et il serait facile, je crois, de ramener ces pauvres égarés. Il y a deux ans, quelques-uns d'entre eux, à la vue du R. P. Gasté, disaient au guide des berges : *Ceux-là ressemblent plus aux véritables hommes de la prière que nos ministres anglais.*\n\nT. XIV.\n« En débarquant à ce poste je fus heureux de voir que tous les sauvages venaient me toucher la main avec force marques de respect, et cela à la barbe du ministre protestant, et à deux pas de son beau temple. Le bourgeois du fort me fit tous les honneurs de sa maison et de sa table en présence du chef du district. Je restai là un jour et demi en attendant les berges qui devaient transporter les fourrures au Grand-Rapide ; pendant ce temps je fis connaissance avec des métis et des sauvages de toute religion, et rencontrai un brave homme qui renonça au service de la compagnie, uniquement pour se rapprocher du prêtre catholique et faire baptiser et instruire ses enfants. Sa femme, qui était instruite, passa la journée à expliquer à tout venant le tableau-catéchisme que je suspendis à la muraille de sa maison. »\n\nLe Missionnaire, après avoir traversé le lac Bourbon, que les Anglais appellent Cedar lake, et passé par une succession de rapides, arriva au lac Winnipeg. Sa narration continue ainsi : « Nos barques firent halte en haut du dernier rapide, qui s'appelle avec raison le Grand-Rapide. C'est là que stationne le bateau à vapeur qui transporte les marchandises dans les divers comptoirs de la compagnie situés sur les rives de la Siskatchewan jusqu'à Edmonton. Je me disposai aussitôt à visiter les familles catholiques établies en bas du rapide. Nos gens allèrent décharger leurs fourrures au poste situé à l'entrée du lac Winnipeg. Je dressai ma petite tente à l'entrée du fort, mais l'aimable commis m'obligea à accepter sa chambre et son lit. Le lendemain, après ma messe, comme je finissais de confesser un homme, j'entendis les sauvages qui criaient de l'autre bord iskutewnapikwan ! le steamboat ! le steamboat ! En un moment tout le monde est sur la bord du lac, et nous voyons au loin les deux longues cheminées du vapeur qu'on attendait chaque jour. Bien-\ntôt son sifflement aigu se fait entendre, et est répercuté par tous les échos de la vallée. Les animaux domestiques fuient d'épouvante, mais nos gens sont dans la joie en voyant arriver chez eux pour la troisième fois ce signe de la civilisation. Le bateau passe devant nous sans s'arrêter, et va à deux milles plus haut déposer toute sa cargaison au pied du rapide. Je n'aperçus pas Mgr Faraud, qui était à bord ; mais le soir je traversai la rivière en canot, et j'allai me jeter dans les bras de Sa Grandeur. Avec quel empressement avide je questionnai Monseigneur et sur la France et sur la congrégation ! Il voulut bien satisfaire à toutes mes questions avec une aimable bonté. Je fus charmé aussi de voir le F. Lefebvre, qui accompagnait Monseigneur. Pendant quatre ou cinq jours j'évangélisai ça et là mes gens. Le rendez-vous du dimanche fut indiqué chez Mgr Faraud, au bateau de la Siskatchewan. En attendant, je dressai ma tente dans une petite clairière, et Monseigneur daigna lui-même ficher les piquets et m'enseigner le moyen de chasser les maringouins. Je passai toute la soirée du samedi à entendre les confessions, et fus touché jusqu'aux larmes de la foi de ces braves gens. Le lendemain, dimanche, je parcourus la côte en agitant ma clochette, et à mon appel tout mon peuple se réunit dans la salle principale du bateau. Je bénis trois mariages ; Monseigneur célébra la messe et donna quelques communions. Il adressa aussi en langue criée une allocution, qui dut faire beaucoup de bien. Le soir, une dernière réunion avait lieu autour de ma tente. Je reçus l'abjuration d'une adulte que je rebaptisai sous condition, et après une nouvelle instruction et la récitation du chapelet je clôturai ma mission.\n\n« M. Hamilton, inspecteur général de la Compagnie de la baie d'Hudson, m'autorisa à profiter du bateau pour remonter au Cumberland. En attendant le départ, j'allai\navec le F. Lefebvre choisir un terrain pour la mission catholique, selon la recommandation que m'avait faite Mgr Grandin. »\n\nArrivé au Cumberland, le Missionnaire fit ses adieux à Mgr Faraud. C'était le 5 juillet. Là, il dut stationner jusqu'à la fin du mois pour attendre Mgr Grandin. Le numéro de juin ayant rendu compte de cette rencontre, nous n'y reviendrons pas. Le P. Bonnald attendit encore au Cumberland jusqu'au 17 septembre, faisant tout le bien possible aux âmes qui l'entouraient. À cette date il partit définitivement pour le lac Caribou. Le voyage dura dix-huit jours et fut semé de tous les accidents ordinaires dont la répétition n'est pas une nouveauté pour les lecteurs, mais est un très-grand mérite pour nos courageux Missionnaires. Voici la dernière page des notes de voyage du R. P. Bonnald :\n\n« Huit jours après avoir quitté le lac Pélican, nous entrions dans cet immense lac Caribou parsemé d'îlots et terrible comme une mer pendant la tempête. Nous voguâmes avec une rapidité vertigineuse pendant une nuit et deux jours. Dans l'obscurité notre guide nous égara dans une baie. Nous essayâmes de partir à la clarté d'une aurore boréale, mais cette lumière fut de courte durée et il fallut attendre le véritable jour pour reprendre notre direction. Grâce au vent qui gonflait encore la voile, vers les cinq heures du soir, la côte de la mission était en vue. C'était cette chère mission dont m'avait parlé Mgr Grandin à Notre-Dame de Lumières. Nous arrivâmes à l'Angelus. Ce son béni, retentissant au bout du monde, faisait battre mon cœur. Le P. Gasté et le F. Labelle attendaient au débarcadère. Quelle réception fraternelle ! Quelle joie de se voir ! Le F. Guillet se met en quatre pour me régaler.\n\n« Vite, faisons la description de la mission. Vous seriez\nétonné, mon très-révéré Père, de nous voir si bien logés au lac Caribou. Le quartier de la mission, placé sur une butte de sable à 300 mètres du fort, forme un véritable carré. On dirait un vieux monastère du moyen âge avec son préau. Notre église forme une aile, la tribune fermée nous sert de chambre commune, le fond de l'église est séparé par une cloison et forme ainsi une petite salle pour les sauvages. Nous nous rendons à l'autre aile, parallèle à l'église, par un corridor en bois très-commode en hiver, et nous entrons dans une petite cuisine, séparée d'un hangar par un vaste espace où se trouve le poulailler, et aussi la chambre à coucher de notre grand'mère. Nous appelons ainsi une bonne femme qui n'a qu'un œil, mais bonne langue. C'est la femme forte de la nation. Mme Grandin, sur sa demande, nous a permis de la garder et elle nous rend de grands services. Elle est mon professeur de montagnais. Pour compléter la description de notre communauté, je dois dire que le clocher provisoire avec une cloison forme le quatrième côté parallèle au corridor. Toute la côte qui se trouve entre l'église et le lac est devenue notre jardin ; nos Frères y ont récolté une trentaine de barils de patates. C'est un prodige qui se renouvelle tous les ans à la mission. Nous sommes bien logés, bien chauffés ; le pain est rare, mais la viande abonde. On n'est donc pas trop mal ; les temps héroïques sont passés et les cheveux gris du R. P. Gasté disent assez qu'il n'en fut pas toujours ainsi. Plaise à Dieu que nos chers Montagnais se convertissent tout à fait !\n\nLe P. Bonnald avait fait précédemment un pénible voyage de la mission de Notre-Dame de la Paix à Saint-Albert pour ramener le corps de Louis Dazé, dont la mort a été racontée dans le numéro de décembre 1875. Ce fut au milieu de difficultés inouïes et à travers des dangers et\ndes souffrances de toutes sortes que le courageux Missionnaire accomplit son entreprise de charité. La neige, la faim, la solitude et ses immensités où rien n'indique la route, les obstacles de la nature et ceux des hommes, rien ne lui fut épargné des souffrances et des angoisses les plus cruelles. Dieu protégea visiblement le P. Bonnald, qui eut la joie de ramener la dépouille mortelle du dévoué serviteur de la mission. Cette œuvre de miséricorde, à on juger par les tribulations dont elle a été l'occasion, a dû être bien agréable à Dieu. À son arrivée à Saint-Albert, où sa longue absence avait semé tant d'alarmes, le P. Bonnald fut reçu au milieu des larmes de reconnaissance et de joie de l'Évêque, des Pères et Frères et même des bonnes sœurs qui avaient fait plusieurs neuvièmes successives pour que la Providence gardât sain et sauf celui qui exposait si glorieusement sa vie pour procurer une sépulture honorable à un ami de Dieu :\n\n« Quando orabas cum lacrymis, et sepeliebas mortuos, ego obtuli orationem tuam Domino. » (Tobie, XII, 12.)\n\nMACKENZIE.\n\nNous avons reçu de Mgr Clut des notes d'un long voyage accompli de la Providence au fort Nelson, mission Saint-Paul. Commencé le 20 mars 1878, ce voyage a duré, aller et retour, trois mois, et Mgr d'Erindel ne rentrait à la Providence, son point de départ, que le 29 juin. La première partie de la route a été faite en compagnie du R. P. Ladet, que Sa Grandeur devait laisser à la mission de Saint-Raphaël. Des fatigues inouïes, rendues plus insupportables par un froid très-vif et l'accumulation de la neige, ont ajouté aux difficultés du voyage et au mérite", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007586.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 7, "total-input-tokens": 9688, "total-output-tokens": 3712, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1554, 1], [1554, 3479, 2], [3479, 5361, 3], [5361, 7249, 4], [7249, 9033, 5], [9033, 10877, 6], [10877, 12503, 7]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false]}}]