[{"id": "0fdc0e51fb50629ce3e09ea1797f3fefe1ceee52", "text": "ligion. Les répugnances se changent alors en attrait, et ces natures honnêtes se corrigent bientôt au contact du prêtre. Voilà pourquoi le seul fait de la résidence parmi eux est d’une si haute importance. Ah! que ne sommes-nous plus nombreux ! *Parvuli petierunt panem et non erat qui frangeret eis*. Il faudrait suivre ces pauvres gens dans tous leurs voyages et ne les pas quitter d’une minute; tous les périls qui leur viennent du côté du vice et des ministres de l’erreur seraient conjurés si nous avions un plus grand nombre de missionnaires. Que Dieu souffle au cœur de tant de jeunes prêtres qui, dans les diocèses de France les meilleurs, attendent longtemps un poste et une occupation, le feu sacré du zèle et que sa bonté nous suscite des collaborateurs ! Qu’ils viennent prendre place à notre foyer misérable où pétille l’épinette des bois; et que, revêtus comme nous des fourrures arrachées aux animaux, ils couchent à la belle étoile sur un tapis de neige, en attendant les courses et les fatigues apostoliques du lendemain ! Les consolations ne leur manqueront pas, et les épreuves non plus, mais nous pouvons leur promettre que les premières l’emporteront de beaucoup sur les secondes; au service de Dieu et des âmes, dans ces déserts de l’Amérique du Nord, le cœur bat à l’aise et on vit dans un plus vif sentiment de la présence de Dieu.\n\nA. PASCAL, O. M. I.\n\nVICARIAT DE SAINT-ALBERT.\n\nRAPPORT DU R. P. GROUARD.\n\nMission de N.-D. des Victoires, lac La Biche, le 26 mai 1879.\n\nMON TRÈS RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\nJe viens vous présenter aujourd’hui un petit compte\nrendu de la mission de Notre-Dame des Victoires ; des occupations incessantes m'ont empêché de mettre plus tôt la main à ce travail. Votre charité paternelle excusera mon retard et vous fera, j'espère, accueillir ces lignes avec bienveillance.\n\nJe vous entretiendrai d'abord de nos œuvres spirituelles, et vous dirai ensuite quelques mots de nos travaux matériels.\n\n1° Œuvres spirituelles.\n\nPour se rendre compte du travail qu'offre ici l'exercice du saint ministère, il faut se rappeler que notre population est disséminée sur les bords du lac la Biche, dont la longueur n'est pas moins de 30 milles anglais. Bien que les habitations soient échelonnées de distance en distance, elles forment cependant trois groupes principaux : celui du nord-est, comprenant le fort de la compagnie de la baie d'Hudson et la grande baie ; celui du sud-ouest ou de la baie de la Rivière-aux-Chevaux ; et enfin celui du sud, où se trouve notre établissement. Ces trois groupes forment ce que nous pouvons appeler la paroisse de Notre-Dame des Victoires. Mais le lac la Biche est entouré d'une foule d'autres lacs de moindre dimension, dont plusieurs, abondants en poissons excellents, ont attiré diverses tribus de métis ou d'Indiens. Ainsi, le lac Ayape Sakahigan, situé à une journée de marche, au sud-ouest de notre mission, appartient à plusieurs familles de métis. Le lac Castor (Amisko Sakahigan), un peu moins éloigné à l'est, est occupé par une tribu de Cris, enfin le lac de Cœur (Mite Sakahigan), qui se nomme en montagnais lac du Bœuf pourri (Edjere man t'ue), est le point de réunion d'une tribu montagnaise. Deux bonnes journées de marche nous en séparent. Nous sommes chargés de cette population. Un si vaste terrain ne peut\nrecevoir régulièrement nos soins. Les gens le comprennent; aussi est-il admis parmi eux qu'ils doivent venir à la mission pour les principales fêtes de l'année, surtout pour Noël et Pâques, et que, de notre côté, nous leur ferons autant que possible quelques visites à leurs demeures respectives.\n\nIci même, à Notre-Dame des Victoires, nous exerçons le ministère paroissial. Tous les dimanches et fêtes nous avons grand'messe avec sermon. Le soir, à la place des Vêpres, nous nous contentons d'un cantique, de la récitation du chapelet et de la bénédiction du Saint-Sacrement. Nous devrons nous borner à cela jusqu'à ce que nous ayons un chœur organisé et des voix capables de chanter les psaumes. De temps à autre, nous avons un nombre assez consolant de confessions et de communions, ce qui prouve que la vie chrétienne s'implante de plus en plus au sein de notre population. Cet heureux résultat est dû en bonne partie à l'exemple des Sœurs Grises (de Montréal), dont une communauté, composée de cinq religieuses et de deux filles, est adjointe à la mission; et aussi à l'éducation que ces bonnes Sœurs ont déjà donnée à plusieurs enfants de ce pays. Elles ont actuellement chez elles vingt-cinq jeunes filles internes. La direction des Sœurs, leurs retraites annuelles et mensuelles, la confession et le catéchisme des enfants entrent naturellement dans le travail régulier de la Mission.\n\nDe plus, durant l'hiver, l'un de nous se rend chaque samedi au fort de la Compagnie, pour y célébrer l'office du dimanche, auquel viennent assister les gens qui habitent dans ce quartier. Un troisième Père ne serait pas de trop; il pourrait donner les mêmes soins aux familles de la baie de la Rivière-aux-Chevaux.\n\nIl va sans dire que nous devons visiter les malades, n'importe à quelle distance ils se trouvent, pourvu que\nce soit dans les limites de la Mission. Fort heureusement, le climat est très sain et notre race vigoureuse ; ce qui fait que, généralement parlant, vu le nombre assez borné de la population, nous n'avons que des cas de maladie assez rares. Cependant l'hiver dernier est venu changer cet état de choses et nous montrer que nous ne sommes pas à l'abri des fléaux qui affligent la pauvre humanité. La fièvre scarlatine a envahi notre pays en automne, et, trouvant sans doute qu'il faisait trop froid pour aller tourmenter ailleurs d'autres mortels, elle a établi ses quartiers d'hiver au milieu de nous et pris de force un billet de logement dans chaque maison. De là un surcroît de besogne, surtout pour le R. P. Collignon, qui, durant plusieurs semaines, a été, jour et nuit, obligé de courir aux malades. Nous avons été providentiellement préservés de l'épidémie, ou, du moins, grâce aux précautions et à la vigilance des sœurs, elle ne s'est manifestée que d'une manière assez bénigne parmi les enfants de l'école, tandis que presque chaque famille a eu à déplorer la perte de quelqu'un de ses membres.\n\nCes soins charitables des bonnes Sœurs et cet heureux résultat devraient, ce semble, faire ouvrir les yeux aux parents et les porter à nous confier plus volontiers leurs enfants ; mais la triste apathie qu'ils ont toujours manifestée pour l'instruction, apathie dont le R. P. Leduc se plaignait dans son dernier rapport sur cette mission, n'est pas encore secouée. Nos Sœurs ont employé tous les moyens. Elles ont invité plusieurs fois les gens à être témoins du progrès des élèves. Elles donnent l'instruction française et une religieuse irlandaise enseigne l'anglais. Plusieurs petits drames ont été joués par les enfants dans les deux langues, avec une intelligence des choses, une netteté de prononciation, une aisance de manières vraiment remarquables. Les gens en\nétaient ébahis. Eh bien, c'est tout au plus si, à la suite de ce succès, une demi-douzaine se sont décidés à envoyer leurs petits garçons à l'école. Le temps viendra, et il n'est pas très éloigné, où ils regretteront, mais trop tard, leur coupable indifférence.\n\nJe vous ai dit, mon très révérend Père, que notre ministère s'étend aux peuplades qui environnent le lac la Biche, mais que nous ne pouvons, pour bien des raisons, leur prodiguer des soins assidus. Nous devons nous borner à quelques visites passagères. Ainsi, il y a deux ans, le R. P. Collignon et moi nous allâmes passer une semaine au lac Ayape-Sakahigan, puis, une autre semaine, au lac Castor. L'année dernière, le P. Collignon fit seul cette visite. Tout en étant assez dépourvus d'enthousiasme religieux, les Cris de ces localités ont cependant fait de notables progrès dans la connaissance et l'amour des vérités chrétiennes.\n\nLa part qui m'est échue dans ces courses apostoliques est, sans contredit, la plus consolante : c'est le lac de Cœur, où sont établis nos Montagnais. Ils ne comptent pas plus de quatre-vingt-cinq âmes ; bien petit troupeau, sans doute, mais, a une seule exception près, formé de chrétiens excellents. Ma première visite chez eux date du mois de juin 1877. J'étais accompagné du R. P. Leser-rec, qui fut envoyé depuis au petit lac des Esclaves. Nous demeurâmes quinze jours entiers au milieu de ces bons sauvages, et, pendant tout ce temps, je puis le dire, leur vie fut presque celle de religieux en retraite. Ils ne manquèrent pas un seul exercice. Au premier coup de la clochette, ils quittaient tout pour venir à la hâte à notre maisonnette, la seule qu'ils eussent encore bâtie et qu'ils réservaient à leurs missionnaires. Les moments libres qui nous restaient après la prédication, les prières et les confessions, étaient employés à la lecture de l'histoire\nsainte que Mgr Faraud a fait imprimer à Paris en leur langue. Cette lecture, faite avec discernement et accompagnée d'explications, produit des effets merveilleux. Je ne puis parler, bien entendu, que des Montagnais dont je suis chargé; mais comme toute la nation possède les mêmes qualités, le même sentiment religieux, je suis sûr, à en juger par ceux du lac de Cœur, que tous les autres tireront de ce livre d'histoire sainte, outre plus de goût et d'entraînement pour la lecture, un attachement plus profond au catholicisme et une plus grande ferveur dans la pratique de leurs devoirs.\n\nDurant l'hiver de 1877-78, je fis un second voyage chez ces bons Montagnais. Je n'eus pas la peine de les exhorter à se confesser, mais ce fut plutôt eux qui me forcèrent pour ainsi dire à les confesser tous, du plus grand jusqu'au plus petit, et ils m'auraient regardé de fort mauvais œil si j'avais omis ou refusé d'en entendre un seul. Une trentaine d'entre eux ont déjà fait leur première communion, et leur amour pour Notre-Seigneur dans le Saint-Sacrement égale leur foi simple et naïve au mystère de nos antres. Ce progrès ne va pas jusqu'à leur donner encore des mœurs parfaitement policées. En voici la preuve : Durant mon séjour dans leur camp, un chasseur découvrit la loge d'un ours. Vous savez, entre parenthèse, que, dans nos parages, l'ours demeure engourdi tout l'hiver. Il s'engraisse assez en automne pour supporter impunément un jeûne prolongé jusqu'au printemps suivant ; puis, sa provision de graisse étant achevée, et les froids commençant leur œuvre d'engourdissement, il se creuse une tanière au pied d'un arbre déraciné où il entasse quelques branches sèches et s'y met à l'abri de la neige. Alors commence sa vie de quiétude parfaite, étant, jusqu'à la saison nouvelle, pour me servir d'une expression de Louis Veuillot, enfermé dans le lard de sa\nfortune faite. Or, un ours, pris dans ces circonstances, est une proie précieuse, non seulement pour sa fourrure, mais encore pour sa chair qui est succulente. Aussi, dès que le chasseur eut donné avis de son aubaine, on dépêcha en hâte quelques jeunes gens qui tuèrent la bête, la dépecèrent et l’apportèrent au camp. Toutes les marmites furent aussitôt mises en réquisition et remplies de quartiers d’ours. Puis, l’animal cuit à point, les hommes seuls se réunirent pour prendre part au festin. Les femmes n’en eurent que la fumée et peut-être aussi quelques os déjà passablement rongés. Cependant le chef m’avait envoyé un bon morceau de l’animal, présent que j’étais loin de dédaigner; mais je ne me crus point obligé d’imiter les pratiques montagnaises, et, tout en gardant une ration suffisante pour mon souper, je distribuai le reste à trois ou quatre vieilles qui étaient alors près de moi.\n\nLa gourmandise est-elle la seule cause qui pousse les Montagnais à exclure les femmes de leurs festins? Je n’oserais pas l’affirmer. Mettons qu’il y ait un quart de superstition, un quart d’injuste mépris, la gourmandise comptera encore pour la moitié. C’est ainsi que ces pauvres gens se dédommagent des longues privations qu’ils ont parfois à supporter.\n\nNous avons lieu d’espérer que leurs manières finiront par s’adoucir et deviendront parfaitement chrétiennes. Ils ont déjà fait de grands progrès dans ce sens. En voici une preuve : en septembre dernier, j’accompagnais les chefs de famille (seize hommes en tout) à un rendez-vous que leur avait fixé le gouvernement du Nord-Ouest. Je devais leur servir d’interprète ; or, voici qui m’édifia dans leur conduite durant les quelques jours que dura cette expédition. À chaque campement, lorsque leur repas était préparé, ils s’assayaient tous en cercle sur l’herbe de la prairie et le plus vieux de la bande récitait dévote-\nment le Benedicite, auquel les autres répondaient fidèlement. Le repas fini, ils récitaient de la même façon les Grâces, et ils ne se désistèrent pas de ces saintes pratiques au milieu des Cris infidèles ou protestants qui avaient été comme eux appelés au rendez-vous. La récitation des prières et du chapelet en commun est une pratique parfaitement établie chez eux.\n\nJ'ai déjà eu occasion de les visiter deux fois cette année. De leur côté, comme je vous l'ai dit, ils ne manquent pas de venir passer quelques jours à la Mission, afin de voir, comme ils disent, la maison de la Messe, et d'y recevoir les Sacrements avec plus de dévotion.\n\nSi nos catholiques, éparpillés comme ils le sont sur une vaste étendue, ne peuvent régulièrement venir à l'église, ils prennent leur revanche aux grands jours de fête et principalement à Noël et à Pâques. Ces jours-là, notre chapelle actuelle, malheureusement trop étroite, ne peut recevoir tous nos fidèles. La dévotion s'accroît avec la foule et pas un ne s'en retourne sans s'être purifié de ses fautes et s'être approché de la sainte Table. La fête de Noël surtout présente ici un aspect pittoresque. Notre beau lac est revêtu, sur une solide couche de glace, d'un tapis de neige d'une blancheur éclatante; ses bords sont couronnés au loin de forêts de pins, dont le feuillage toujours vert est entrelacé des perles et des cristaux qu'y forment les frimas; plus près se dessinent les maisons, au-dessus desquelles flottent de superbes panaches de fumée ondoyante (et ceci n'est point une simple figure de rhétorique, mais un fait que pourrait affirmer quiconque a séjourné dans le Nord). Au cours si abrégé et si rapide du soleil a succédé la marche silencieuse et lente de l'astre de la nuit, entouré de son brillant cortège d'étoiles étincelantes. Chaque flocon de neige sur le lac, sur le sol, sur les branches des arbres,\nsur le toit des maisons reflète et augmente sa douce lumière. Au loin, l’aurore boréale se jone dans les airs, déroulant tantôt ses lumineuses spirales et tantôt formant ses faisceaux capricieux. Le ciel est pur, l’air calme, la température modérée, 12 à 15 degrés de froid seulement. Mais l’heure sainte approche, et vous voyez sortir du bois ou glisser sur le lac les traîneaux des fidèles venant à la messe de minuit. Quatre chiens chargés de grelots et de sonnettes, dont le bruit perçant retentit de tous côtés, sont attelés à chaque traîneau, et, de ces voitures, il n’y en a pas moins d’une centaine. Bientôt nos chrétiens se pressent au pied de la crèche, chantent leurs plus beaux cantiques en l’honneur du divin Enfant, s’assoient à la sainte Table, rendent avec les anges gloire à Dieu au plus haut des cieux, et s’en retournent emportant avec eux la paix promise aux hommes de bonne volonté. Nous comptons, à la dernière messe de Minuit, environ cent cinquante communiants.\n\nTelle est la fête de Noël dont j’ai été témoin deux années de suite au lac la Biche.\n\nPour que cette description fût complète, je devrais mentionner le vacarme infernal que font les quatre cents chiens réunis alors autour de la Mission, lorsque l’un d’eux donnant le signal tous se mettent à l’envi à pousser de longs hurlements. On dirait que l’enfer cherche par ses cris à étouffer la voix de la prière ; mais il n’y peut réussir. C’est une ombre au tableau et la seule note discordante dans ce concert de la terre et du ciel durant cette nuit bienheureuse.\n\nEnfin, pour obvier autant que possible au défaut d’instruction religieuse causé par l’éloignement des familles, nous avons adopté le moyen suivant : quand les enfants sont en âge, nous les prenons à la Mission pendant un carême, les jeunes filles chez les Sœurs, et les garçons chez\nnous, et nous leur faisons chaque jour le catéchisme pour les préparer à leur première communion. Nous usons du même procédé quand quelque sauvage encore infidèle se présente à la Mission avec la volonté d'embrasser la religion catholique.\n\nTel est, mon très révérend Père, le tableau assez fidèle, ce me semble, de l'état de la mission de Notre-Dame des Victoires, au point de vue des œuvres spirituelles.\n\n2° Travaux matériels.\n\nIl y aurait sur ce point matière à un long chapitre, si l'on voulait entrer dans tous les détails; je vais au moins vous en indiquer le sommaire.\n\nEn tête vient la construction d'une église. Le bois de charpente était déjà transporté sur les lieux par les soins du R. P. Leduc. Durant l'été de 1877, le cher F. Bowes remania chaque morceau pour lui donner les dimensions convenables; puis, aidé du F. Lorfeuve, son apprenti, il fit toutes les coupes, tenons, mortaises, etc., si bien qu'avant l'hiver, nous pûmes dresser le corps de bâtisse, lequel mesure 70 pieds anglais de long sur 26 de large. Pendant ce temps, le F. Racette s'occupait à la scierie de scier les madriers et planches nécessaires; mais comme il fut obligé de quitter ce travail pour aller au fort Pitt avec nos charrettes, Mgr Faraut prit sa place, et, pendant six semaines, alla régulièrement faire la journée de sciage. Sa Grandeur poussa si activement la besogne, que nous eûmes assez de bois scié pour les châssis et les portes, le plancher, une palissade d'enceinte et une couverture en planches.\n\nL'automne arrivé, nos Frères charpentiers s'en allèrent camper dans le bois et y firent des abattis considérables, tant pour trouver les pièces nécessaires à la construction d'une berge que pour assembler les meilleurs\ntroncs d'arbres destinés au sciage, en vue de l'achèvement de notre église. La berge fut construite et lancée à l'eau au printemps 1878. Le toit de la chapelle, ou, du moins, la charpente du toit, fut dressée par les soins du F. Bowes; puis ce cher Frère nous quitta pour retourner à Saint-Albert, où il devait faire de nouvelles constructions, que l'on dit colossales, pour le pays. Qu'il me soit permis d'offrir ici l'expression de notre reconnaissance à Mgr Grandin, qui consentit à se priver plusieurs années des services de cet excellent Frère et à le prêter à Notre-Dame des Victoires, adoucissant ainsi autant qu'il était en son pouvoir la perte immense que notre vicariat venait de faire dans la mort tragique du pauvre Frère Alexis Raynard. Que nos remerciements suivent aussi le cher F. Bowes!\n\nNous avons continué, durant l'été 1878, le travail de l'église, dont nous avons posé et cimenté les planches, de sorte qu'elle est déjà complètement fermée; seulement, la neige en hiver et la pluie en été ayant fait défaut, nous ne pûmes faire marcher la scierie, et la construction devra subir un arrêt plus ou moins prolongé. Mais nous avons le bardage, qui remplace ici l'ardoise, à poser sur le toit, travail auquel le F. Lorfeuve est présentement occupé.\n\nLa chapelle n'est pas notre seule bâtisse en voie de construction. L'automne dernier, les FF. Lorfeuve et Milseens retournèrent au bois avec quelques hommes et préparèrent la charpente de deux vastes hangars, dont l'un mesure 72 pieds anglais de long avec un étage, et l'autre 75 pieds, avec le rez-de-chaussée seulement. Ce dernier doit servir de chantier pour la construction des berges et de remise pour les charrettes nécessaires aux transports des missions. Le premier servira d'entrepôt pour le bagage et comprendra, en outre, une glacière et un hangar de provisions. L'étage supérieur four-\nnira une place très commode pour la dessiccation du blé et de l'orge, laquelle ne s'opère jamais complètement dans ce pays à l'époque de la moisson. Nous devons aux soins et à la direction de Mgr Faraud d'avoir pu, ce printemps, dresser la charpente de ces deux bâtiments, dont l'achèvement viendra en son temps.\n\nLa ferme est ici l'objet de soins particuliers. Le climat, plus favorable qu'ailleurs, nous permet de cultiver les céréales et d'obtenir des récoltes passables. Le blé, l'orge, l'avoine, les pommes de terre réussissent généralement bien sur la côte Sud du lac, tandis qu'ils sont sujets à la gelée sur le bord opposé. Notre récolte de blé est en moyenne de 300 barils, mesure du pays qui équivaut à peu près au double décalitre ; de 100 barils d'orge et de 600 barils de pommes de terre. Quant à l'avoine, c'est à Monseigneur que nous en devons l'introduction dans notre ferme. Il y a trois ans, Sa Grandeur rencontrait quelques épis isolés et les garda précieusement ; l'année suivante, ces quelques épis devenaient des gerbes, et maintenant nous pouvons en semer un vaste champ. Le F. Milseens est chargé des travaux du laboureur et du soin du troupeau. Quant à la moisson, tous les bras valides de la Mission doivent contribuer à la faire. Monseigneur nous donne l'exemple et il ne laisse pas rouiller sa faucille.\n\nMais le culture n'est pas le seul souci de la ferme. Le fauchage des foins en est un plus grand peut-être. Notre troupeau de bêtes à cornes est considérable et nous sommes obligés de le garder à l'étable six mois de l'année. Il nous faut au moins vingt bœufs de travail. Et pourquoi ? Parce que nous avons de nombreux transports à faire : deux voyages chaque été au fort Pitt ; un chaque printemps au confluent des rivières la Biche et Athabaska ; voyages quotidiens en hiver pour amener ici le\nbois de chauffage et le foin ; enfin labour et autres travaux de la ferme durant la bonne saison. Ajoutez à ces vingt bœufs un nombre suffisant de vaches et de veaux pour remplir les vides que la vieillesse et les accidents occasionnent dans le troupeau, et vous jugerez par là du travail nécessaire à leur entretien. Nous ne pourrions les hiverner convenablement à moins de trois cents charges de foin, et, par charge, on entend ici la quantité qu’un bœuf ordinaire peut traîner sur la neige. Le R. P. Collignon dirige ces travaux importants et paye de sa personne, aidé du F. Milsen et de quelques hommes loués pour la circonstance.\n\nÀ la ferme est annexé un moulin à farine établi sur un étang à 2 kilomètres d’ici. C’est le F. Racette qui, chargé de battre le blé en hiver, est aussi chargé de le moudre. Comme ce moulin est le seul du pays, nous ne pouvons refuser aux habitants de s’en servir, mais souvent, au lieu d’être reconnaissants de cette complaisance, ils cherchent chicane à notre Frère meunier, qui, il faut le dire, sait bien les mettre à la raison.\n\nJ’ai dit un mot des voyages par eau et par terre que nous sommes obligés de faire chaque année. La situation de Notre-Dame-des-Victoires, par rapport aux missions de l’extrême Nord, expliquera ces multiples voyages. D’un côté cet établissement est rattaché par un chemin de charrettes à la rivière Rouge, et, par là, au monde civilisé. D’un autre côté, le lac la Biche appartient au bassin du Mackensie, où il se déverse par une rivière navigable à l’eau haute. Voilà un chemin naturel ouvert pour pénétrer dans les contrées du Nord. Une autre route existe, exploitée par la Compagnie de la baie d’Hudson ; route extrêmement difficile, coupée de nombreux portages. Tant que l’honorable Compagnie put transporter sur ses barques les objets nécessaires à l’approvisionnement des\nmissions, nous n’eûmes pas à nous inquiéter beaucoup de ce côté. Mais le jour vint où, obligée de multiplier ses importations pour payer les fourrures, dont le prix allait toujours croissant, elle se vit dans l’impossibilité de se charger du bagage des missionnaires catholiques, dont les établissements devenaient aussi plus nombreux. Cette circonstance critique aurait pu devenir un coup mortel pour nos œuvres sans la prévoyance de Mgr TACHE. Dès l’année 1856, ce zélé et courageux évêque voulut s’assurer par lui-même de la possibilité d’établir une communication par voie fluviale entre le lac la Biche et le lac Athabaska. Il s’aventura en canot d’écorce sur cette route inconnue et réputée fort dangereuse, descendit la petite rivière la Biche, puis la rivière Athabaska, dont il franchit les rapides, et arriva sain et sauf à la mission de la Nativité. Cette heureuse expérience fut, on peut le dire, providentielle, et l’avenir de nos établissements du Nord parut assuré. Aussi, lorsque le changement prévu depuis longtemps arriva et que la Compagnie déclara ne pouvoir plus effectuer nos transports, nous avions déjà une autre voie ouverte devant nous, celle du lac la Biche. Ainsi, ce poste devint non seulement un établissement religieux pour les gens du pays, mais encore un établissement d’utilité ou plutôt de nécessité publique pour nos missions plus éloignées. Afin de répondre à cette destination et d’atteindre ce but, nos travaux se sont énormément multipliés. Mais ne devons-nous pas nous estimer heureux de pouvoir, au prix de nos sueurs, entretenir les œuvres confiées à notre Congrégation dans le pays le plus reculé et le plus inhospitalier du globe? Tous nos travaux tendent donc vers cette fin principale; les constructions, la ferme, le troupeau, les voyages, toute l’activité matérielle, en un mot, de cette Mission, se développe et s’exerce au service du vicariat d’Athabaska-Mackensie :\nconstruction, réparation, agrès et équipement de deux berges montées par dix-sept hommes, faisant chaque année le voyage du lac la Biche au fort M° Murray situé au confluent des rivières Athabaska et de l'Eau-claire ; nourriture de ces hommes, qui sont doués d'appétits formidables, pendant trente ou quarante jours que dure le voyage. Jugez quelle brèche cela fait à notre récolte ! Expédition d'un convoi de dix-huit charrettes au fort Pitt, afin d'en amener le bagage des missions que les gens de la rivière Rouge viennent y déposer — deux voyages chaque été, durant chacun dix-neuf jours en moyenne. Six hommes y sont employés, mais un de nous, Père ou Frère, doit toujours être de la partie.\n\nL'hiver de 1877 à 1878 ayant été fort beau, nous n'eu- mes pas de neige, et partant pas d'eau dans la petite ri- vière la Biche, dont le défaut est d'ailleurs d'être toujours trop basse. La sécheresse continuant, il devenait impos- sible de naviguer sur cette rivière. À peine si de légers canots d'écorce pouvaient y passer. Il devenait donc ur- gent d'ouvrir un chemin de charrettes le long de cette rivière jusqu'au point où elle débouche dans l'Atha- baska. M° Faraud n'était pas sans inquiétude sur le ré- sultat d'une telle entreprise, sachant déjà par expérience les obstacles sans nombre qu'offre à un travail de ce genre un pays couvert de bois, coupé de ravins et de marécages. Il envoya le R. P. Collignon explorer le terrain avec un vieux métis qui connaît parfaitement les lieux. Le P. Collignon ayant tracé une ligne indi- quant la direction à suivre, repartit avec une escouade de bûcherons qui firent une trouée d'une largeur de 4 mètres sur une longueur d'au moins 80 kilomètres. Au bout d'un mois d'efforts et de fatigues, le P. Colli- gnon put annoncer à Monseigneur qu'il avait atteint la rivière Athabaska. Cette nouvelle nous causa la plus\ngrande joie. Sans doute, nos courageux ouvriers ne pu-\nrent aplanir toutes les collines, ni combler toutes les val-\nlées, ni éviter toutes les fondrières sur un si long par-\ncours, et nul charretier d'Europe n'oserait y aventurer\nsa voiture, mais nous ne sommes pas si difficiles et nous\ny lançons notre convoi de charrettes, chargées du bagage\ndes missions du Nord. Voulez-vous avoir une idée du pre-\nmier voyage effectué sur cette nouvelle voie? Le sol, que\nn'a encore pressé aucune roue, se défonce bientôt et les\nmille souches des arbres abattus relèvent leurs têtes,\ncontre lesquelles, bon gré mal gré, conducteurs, bœufs\net véhicules vont se heurter à chaque pas. Puis se pré-\nsente une lisière de terrain bas et marécageux. Le premier\nbœuf y laisse une profonde empreinte, le second enfonce\njusqu'aux genoux, le troisième jusqu'au poitrail et les\ncharrettes à l'avenant. Le quatrième bœuf en aurait par-\ndessus les cornes, si l'on ne prenait la précaution de jon-\ncher le sol de branches et de fascines à l'aide desquelles\nle passage peut s'effectuer. Or, cette succession de sou-\nches et de fondrières est presque ininterrompue. Aussi\nmainte voiture se disloque ou se renverse, ou même\nreste hors de combat. Mais peu nous importe, puisque\nnous arrivons enfin sur le bord du fleuve et que nos mis-\nsions recevront encore leurs approvisionnements. Avec\nle temps nous améliorerons ce chemin et nous le ren-\ndrons, j'espère, très praticable.\n\nÀ tous ces travaux de bâtisses, de ferme, à tous ces voya-\nges auxquels nous devons nécessairement prendre part,\nnous avons ajouté l'impression de livres en langues sau-\nvages. Nous avons débuté par un petit recueil de cantiques\nmontagnais, que nous tirâmes à quinze cents exemplaires.\nEnsuite nous entreprîmes la publication d'un livre de\nprières, cantiques et catéchismes à l'usage des Loucheux,\nlivre que nous avons terminé ce printemps. Or, notre\natelier ne compte qu'un nombre fort restreint d'ouvriers : le R. P. COLLIGNON et votre serviteur ; encore le bon Père me laisse-t-il seul les trois quarts du temps, dérangé qu'il est par sa charge d'économie. L'impression terminée, reste le pliage et la reliure, sans compter la fabrication du carton. J'ai pu heureusement relier une centaine de nos petits livres loucheux, qui sont maintenant en route pour Good-Hope. Les autres suivront à la demande qui nous en sera faite. Ce petit livre, de cent vingt pages, a été tiré à cinq cents exemplaires. C'est le premier que nous ayons en cette langue.\n\nEnfin, comme délassement, je me suis mis à peindre une toile représentant Notre-Seigneur descendu de la Croix. Je n'oserais pas mentionner cette œuvre, dénuée d'ailleurs de tout mérite artistique, si je n'avais constaté les fruits d'édification qu'elle a déjà produits. Ayant fini mon tableau, je le fis voir à un vieux métis, qui, tout ému, tomba soudain à genoux devant cette image de Notre-Seigneur, et se mit à réciter avec dévotion tout ce qu'il savait de prières. Ce genre d'approbation m'était plus précieux que n'eussent été les récompenses, prix et médailles que les jurys d'expositions sont chargés de décerner aux artistes.\n\nJe termine ce trop long rapport en vous renouvelant l'hommage de l'obéissance entière et de l'affection filiale, avec lesquelles je suis,\n\nMon très révérend et bien aimé Père,\n\nVotre très humble Fils en J.-C. et M. I.,\n\nE. GROUARD, O. M. I.\n\nP. S. — Dernière nouvelle locale :\n\nMgr FARAUD vient de s'embarquer sur nos berges pour faire la visite de nos établissements du Nord. Que Dieu le protège dans ce long et pénible voyage!", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007647.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 17, "total-input-tokens": 23528, "total-output-tokens": 9311, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1585, 1], [1585, 3307, 2], [3307, 5126, 3], [5126, 7002, 4], [7002, 8863, 5], [8863, 10728, 6], [10728, 12605, 7], [12605, 14477, 8], [14477, 16308, 9], [16308, 18031, 10], [18031, 19895, 11], [19895, 21723, 12], [21723, 23569, 13], [23569, 25487, 14], [25487, 27347, 15], [27347, 29245, 16], [29245, 30909, 17]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]