[{"id": "4740e1fb3178926f8c55fa194356f4f2ec08b422", "text": "sud de la rivière Bataille, à 40 milles de Battleford. Nous sommes à la merci des révoltés, et ils nous font toutes sortes de misères. Depuis que je suis ici, les sauvages ont mis ma Mission de Sainte-Angèle en cendres. Je suis en compagnie de mes chers chrétiens, métis et sauvages, et parmi eux il y en a de bien bons. Je partage leur captivité et leur infortune. Je prie sans cesse avec eux, et j'ose espérer que le bon Dieu, oubliant mon indignité et mon insuffisance, aura égard à ma bonne volonté et exaucera les prières de tous.\n\nCOCHIN, O. M. I.\n\nEXTRAIT D'UNE LETTRE DU R. P. BIGONESSE.\n\nNous trouvons ce document dans l’Etendard du 11 juillet 1885 :\n\nBattleford, 7 juin 1885.\n\nLe P. COCHIN est rendu ici avec moi depuis deux semaines. Il a été prisonnier deux mois environ chez les sauvages, qui l’ont forcé, lui et ses gens (les métis neutres), à se joindre à eux. Il a été témoin de la bataille du Cut Knife Creek, où trois cents soldats sont allés attaquer le camp de Poundmaker, composé de trois cent soixante sauvages environ. Les balles lui ont sifflé aux oreilles et effleuré le corps. Il a pu échapper à la mort en se jetant à terre et dans les bas-fonds.\n\nEn voyant venir les soldats, il essaya d’aller au-devant d’eux par des sentiers détournés, pour leur conduire ses gens prisonniers. Mais les soldats, ne le connaissant pas pour un prêtre, tirèrent sur lui de leur mieux. D’un autre côté, les sauvages, tenant pour suspects les métis, les gardaient. Cette bataille dura, le 2 mai, de cinq heures\ndu matin à midi : sept heures de temps. Les sauvages eurent cinq hommes tués ; les soldats, sept hommes tués et quatorze blessés non mortellement.\n\nLe P. Cochin enterra lui-même un soldat protestant, resté sur le champ de bataille. Le 23 mai, il vint ici du camp de Poundmaker, 50 milles de distance, avec vingt-deux prisonniers, retenus jusqu'alors par les sauvages. Le chef, ayant appris la défaite de Riel, confiait une lettre au P. Cochin pour traiter de la paix avec le commandant Otter. Le lendemain, le Père reportait une réponse au chef. Revenu à Battleford le 23, il portait, deux jours après, à Poundmaker et autres sauvages, un message du général Middleton, les sommant de se rendre, et revenait le lendemain, 26 avril, avec Poundmaker et ses conseillers, qui se rendirent et déposèrent une quantité d'armes à feu entre les mains du général. Aussi ce cher Père a beaucoup contribué, par ses longues courses à cheval et par ses conseils, au prix de bien des fatigues et des dangers, à protéger des vies et du côté des sauvages et du côté des troupes. Il a aussi grandement contribué à ramener à Battleford les métis forcés d'accompagner les sauvages.\n\nCe cher Père a même fait 40 milles pour aller indiquer aux soldats l'endroit où il avait inhumé le corps d'un des leurs, resté sur le champ de bataille à Cut Knife Creek.\n\nLe R. P. Provost s'attend à ce que son bon Ange le conduise jusqu'à Battleford. Il m'a écrit. Il chasse le Gros-Ours en compagnie du 65e bataillon.\n\nLe 2 mai, Poundmaker a crié à ses gens, à la fin de la bataille, de cesser le feu et de ne pas poursuivre les soldats, qu'ils auraient probablement massacrés avant leur retour à Battleford. « Si nous versons encore du sang, le bon Dieu va nous punir ! »\n\nLe chef Poundmaker est donc prisonnier. Il s'est mon-\ntré brave et plein de dignité. Il a protégé les blancs contre les vexations des sauvages, et cela plusieurs fois. Le Père ne trouve rien de reprochable dans la conduite des métis de Bressylor, retenus prisonniers avec lui dans le camp de Poundmaker.\n\nJ'attends Mgr Grandin cet été à Battleford, nous arrivant par le Fort-Pitt. Amen.\n\nA.-H. Bigonesse, O. M. I.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007729.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1193, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1519, 1], [1519, 3311, 2], [3311, 3670, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]