[{"id": "99ba42287c063a672011f29eeb25c3972343f820", "text": "que nos pauvres métis de la Saskatchewan, si bons auparavant et dont beaucoup sont vos parents, ont attiré sur eux tant de malheurs et même ont en quelque sorte apostasié dans la foi? S'il faut en croire ces récits que j'entends tous les jours et qui m'attristent de plus en plus, ce n'est pas en vain que Notre-Seigneur a dit à ses apôtres : « Celui qui vous méprise me méprise ; celui qui vous touche me touche à la prunelle de l'œil. » Ces menaces de Notre-Seigneur ne se sont-elles pas vérifiées et ne se vérifient-elles pas tous les jours? Quoi de plus triste que de rencontrer sur le chemin nos pauvres métis de la Saskatchewan si misérablement vêtus, eux qui, l'année dernière, avaient encore des établissements si prospères! J'ai versé tant de larmes que je n'en trouve plus pour pleurer de tels malheurs. »\n\nEt, en disant ces mots, Monseigneur éclata en sanglots. Beaucoup d'assistants pleuraient avec lui. La vue de ce bon et saint vieillard pleurant la perte de ses missionnaires et les malheurs de ses diocésains était de nature à arracher des larmes aux cœurs les plus durs. Les pleurs finirent éloquemment ce discours, qu'il ne put continuer, et l'assistance se retira pénétrée de compassion pour Sa Grandeur, si compatissante elle-même pour les maux de son peuple.\n\nCette cérémonie laissa de salutaires impressions.\n\nMonseigneur et le R. P. Leduc partirent mercredi pour Saint-Laurent.\n\nEXTRAIT D'UNE LETTRE DE M. FARAUD AU T. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Notre-Dame des Victoires, le 6 juin 1885.\n\n..... Nous étions déjà arrivés au 17 avril, et je n'avais pas la moindre idée de ce qui se préparait. Ce jour-là,\nvers les trois heures du soir, M. Young, agent de l'honorable Compagnie et juge de paix ou magistrat local, vint me visiter, accompagné de quatre personnes : Pakkan, chef cri de la station du lac du Poisson-Blanc ; M. Stennor, ministre presbytérien de la même localité ; Peter Eramus, interprète du gouvernement, et Alexandre Hamelin, métis qui a établi une petite maison de commerce à côté. Tous ces messieurs étaient terrifiés, et leur visage était décomposé par la peur. M. Young prit la parole et fit l'exposé suivant : « Nous sommes menacés, à courte échéance, de l'invasion des hordes des prairies. Le pillage et la mort sont à nos côtés. Le Gros-Ours (Mistahé-Maskwa), chef du Fort-Pitt, est en révolte ouverte contre le gouvernement et a juré de mettre à mort tous les blancs (les Européens) résidant dans le Nord-Ouest. Des paroles il est déjà passé aux actes. Établi auprès du lac La Grenouille (station et mission située entre le lac La Biche et le Fort-Pitt, plus près de celui-ci que de celui-là), à la tête de 700 à 800 farouches guerriers, il a déjà mis la garnison en déroute, pillé le Fort, pris les agents comme otages et il les garde sous sa surveillance. Au lac La Grenouille tout a été également pillé : les commerçants, l'instituteur-fermier, la Mission. Les personnes étaient conduites en esclavage entre deux haies de guerriers. À un moment donné, l'agent-fermier fit mine de vouloir retourner sur ses pas ; à l'instant même une balle lui traversait le cœur. Le R. P. Fafard, qui le précédait immédiatement, ayant tourné la tête pour jeter un regard sur la victime, était frappé lui-même au même instant. Tous les autres prisonniers faisant file ayant été fusillés, le jeune P. Marchand, qui était à la tête, pieusement occupé à réciter son office, sans même se détourner, recevait lui-même le coup mortel. Il fit encore quelques pas et vint tomber mort devant la porte du\nGros-Ours. (Des nouvelles ultérieures nous ont appris que les deux Pères furent jetés, tout habillés et couverts de sang, dans le caveau de leur chapelle dévastée. Au moment où les sauvages qui avaient apporté les corps allaient sortir, ils virent ou crurent voir le Grand Crucifix ou le tableau du sacré Cœur de Jésus prendre une figure menaçante, et leur faisant signe de la main qu'ils seraient punis. Pour se débarrasser de la vision, ils mirent le feu à la chapelle. Après l'incendie, on constata que les corps des deux martyrs avaient été entièrement consumés. Il ne resta, paraît-il, que les tibias de deux jambes, que le feu avait respectés.)\n\n« Le Gros-Ours a fait inviter par deux fois le chef Pakkan, ici présent, avec menace de vengeance s'il résistait, de venir au lac La Biche, d'exciter la haine et la cupidité des métis et des sauvages et de procéder ensuite au pillage du Fort, des commerçants, de la Mission, et d'enrôler ensuite tous les hommes valides comme soldats de la révolte et de traîner les récalcitrants comme prisonniers. Pakkan, trop honnête et trop intelligent pour ne pas comprendre les suites funestes, pour eux et pour tous, des crimes qu'on lui conseille, s'y refuse absolument. Il est venu ici pour nous avertir de nous tenir sur nos gardes et demander un peu de poudre pour se défendre, lui et les siens, dans le cas où le Gros-Ours viendrait l'attaquer avec ses guerriers. Métis et Cris, ajoute M. Young, veulent imiter Pakkan : se défendre et nous défendre. J'ai déjà convoqué les gens pour une réunion générale, qui aura lieu demain, au Fort, à l'effet d'organiser la défense. »\n\nA la suite de cet exposé, une assemblée se tint le soir même et durant tout le lendemain. J'avais conseillé au P. Collignon d'y aller, pour voir et entendre. Tous se dirent contents de leur situation présente, et promirent\nde défendre la colonie à main armée. Un premier détachement devait garder les avenues du Fort et le défendre. Les autres devaient rester ici. Il était entendu que dès que les gardes de la Mission sauraient que ceux du Fort étaient attaqués, ils iraient à leur secours et réciproquement.\n\nToutes ces fortes résolutions, l'ennemi absent, me trouvaient froid. J'étais à peu près certain que, si quelques-uns avaient vraiment le désir de nous défendre, le plus grand nombre était prêt à s'associer au pillage, s'il avait lieu.\n\nCependant l'anxiété était grande. Le temps pressait, et le Gros-Ours, s'il devait venir, ne pouvait tarder. Je n'éprouvais pas la moindre inquiétude pour ce qui me regarde : mourir, à mon âge, et mourir pour la cause de Dieu, me paraissait un bonheur, et aussi un honneur trop grand pour l'avoir mérité. Ce qui ne pouvait faire moins que de me préoccuper c'était la pensée que si l'équipement de nos Missions du Nord était volé, ces Missions étaient perdues. Je ne voulais, en ceci, comme en tout le reste, que l'accomplissement de la sainte volonté de Dieu. Or, comme je sais que cette volonté tend exclusivement au bien de ceux qui l'aiment, dans le sanctuaire secret de mon cœur restait debout et inébranlable la conviction que Dieu ne permettrait pas cela. Pendant cette première période de panique, les Pères et les Frères passaient la majeure partie des nuits à cacher dans le sable, dans les caves, dans les planchers, dans les étables, les articles indispensables pour empêcher nos Pères du Nord de périr : poudre, plomb, balles, fil de rêts, vin de messe. Jusque-là nous étions et nous restions seuls.\n\nDans la nuit du 25 au 26 avril, les émissaires du Gros-Ours arrivaient sur les bords du lac Castor (à peu près à 10 kilomètres d'ici). Ils n'étaient que dix, mais ils\nse disaient suivis par plus de cent. Les quelques Cris campés sur les bords du lac, éveillés en sursaut par les détonations de coups de fusil, en furent effrayés. Bientôt circonvenus par les émissaires qui les invitaient, au nom et par ordres écrits de Sa Majesté le Gros-Ours, à s’unir à leurs frères, à se ranger sous le drapeau des patriotes, sous peine, s’ils refusaient, d’être emmenés captifs, peut-être mis à mort, ils virent s’évanouir leurs bonnes résolutions de la veille. Ils auraient eu besoin d’être soutenus, conseillés, et ils étaient seuls et peu nombreux.\n\nBref, pressés, sollicités de montrer leur néopatriotisme en allant immédiatement piller le Fort de l’honorable Compagnie, ils y consentirent, bien qu’à contre-cœur, dans l’espérance encore qu’ils trouveraient quelques métis résolus, qui, leur prêtant main-forte, les empêcheraient de se rendre coupables de vol.\n\nIls trouvèrent en effet quelques métis du côté est du lac (habitants de la Grande-Baie). Ils venaient simplement prendre leur grosse part au pillage. Tous ensemble, donc, ils ordonnèrent au gardien du Fort, Pot-Pruden, de leur livrer les clefs. Il s’ensuivit une scène indescriptible : hommes, femmes et enfants se précipitèrent dans le magasin, envahirent la maison. En moins d’un quart d’heure il ne restait pas une épingle : objets de commerce, comestibles de toutes sortes, fourrures, tout avait disparu. Puis, à l’instar de tous les révolutionnaires, ils brisèrent les vitres, les portes, les tables ; les chaises volaient en morceaux sous la hache ; les livres de toutes sortes, déchirés en mille pièces, étaient emportés par le vent. Les femmes s’amusaient à déchirer les tapisseries et à se partager les robes de Mme Young, coupées, au préalable, avec des ciseaux. Ils avaient ordre de ne pas brûler, ils ne brûlèrent donc pas ; mais tous ceux qui ont vu ce petit\nFort après cet exploit disent qu’il présente l’image de la plus grande désolation.\n\nVers trois heures de l’après-midi, Pruden vint nous avertir de ce qui venait de se passer. Les pillards, dont le nombre grossissait toujours, devaient venir le lendemain matin à la Mission et la piller à son tour. La perspective n’était pas belle, et la frayeur s’était emparée de tous les cœurs.\n\nLa nuit de l’arrivée des émissaires du Gros-Ours, la vieille mère de notre bon et fidèle serviteur Julien Cardinal était partie en toute hâte, à travers bois et marais, pour venir nous avertir du danger. Elle était arrivée vers six heures du matin. Son fils Julien, averti le premier, après nous avoir donné l’éveil, partit à cheval pour prévenir tous les habitants de l’ouest du lac, les plus nombreux et les plus civilisés, que le moment du danger était arrivé et que tous ceux qui avaient le cœur fort devaient le montrer en se réunissant en toute hâte autour de la Mission, pour la défendre. Les chaleureuses paroles de Julien avaient été entendues, et, quand Pruden nous apporta la nouvelle de la prise ou, mieux, de la dévastation du Fort, déjà une quinzaine d’hommes armés étaient réunis. Le soir, il en arriva encore un nombre à peu près égal. C’était quelque chose, et, bien que ces gens ne fussent ni bien sûrs ni bien valeureux, ils savaient que la partie s’engageait avec des guerriers aussi poltrons qu’eux.\n\nAprès une nuit d’angoisses, le 27 avril au matin, je m’entretenais avec notre guide Louis Lavallée, lorsqu’un coup de fusil retentit à quelque distance de nous. Un moment après, nous aperçûmes un sauvage, seul, tout armé, se dirigeant de notre côté. Les plumes multicolores de son bonnet et les bigarrures rouges, jaunes et noires, de sa figure, nous indiquaient que c’était l’ambassadeur du\nGros-Ours. Il s’avança amicalement, touchant la main à tout le monde. Ses genoux, s’entre-choquant, indiquaient la crainte que lui inspiraient nos gardes.\n\nIl s’assit, et, bientôt entouré de tous nos soldats assis sur leurs talons, il leur dit : « Je viens en ami ! Le Gros-Ours nous a envoyé pour savoir quelle était votre opinion : Êtes-vous du parti de Riel ? Suivez-vous le gouvernement ? C’est ce qu’il nous importe de savoir. Pour soutenir la lutte nous avons besoin d’hommes, et de poudre, dont nous sommes fort mal fournis. Pouvez-vous, voulez-vous nous accorder ces deux choses ? Nous ne sommes pas venus pour faire mal à qui que ce soit. Tous, le Gros-Ours le premier, nous regrettons les meurtres qui ont été commis au lac La Grenouille, par quelques étourdis, contre l’ordre et la volonté des chefs. Nous sommes tous convaincus que ces assassinats feront grand tort à notre cause. »\n\nAprès un moment de silence, nos volontaires répondirent, d’abord de vive voix, puis par écrit : « Vous saurez que nous n’avons pas d’opinion politique bien prononcée. Nous sommes du parti du gouvernement qui nous donnera la paix et la tranquillité dont nous avons besoin avant tout. Nous sommes tous pauvres et avons grand’peine à faire vivre nos familles. Nous ne saurions les quitter sans danger. Personne d’entre nous ne consent à devenir soldat du Gros-Ours. Quant à la poudre, nous en avons très peu. Il nous la faut d’abord pour vivre, et le peu qui restera, nous ne saurions vous le céder. Nous la gardons pour nous défendre, dans le cas où l’on viendrait nous attaquer. »\n\nLe messager se retira sans rien dire ; il avait peur, mais il n’était pas content de cette réponse. À peine à quelque distance, il fit dire à nos preux que S. A. le Gros-Ours serait fort mécontent de leurs réponses ; qu’il se vengerait très certainement en envoyant cent cinquante à deux\ncents de ses meilleurs guerriers, pour s'emparer de force et de leurs personnes et des choses qu'ils lui refusaient; que dans huit ou neuf jours au plus, juste le temps requis pour l'aller et le retour du lac La Biche au lac La Grenouille, ils seraient là.\n\nNos gens avaient épuisé toute leur valeur et leur courage dans leur réponse. Le feu, poussé par le vent à travers des combustibles amassés, ne se propage pas avec plus de rapidité en étendant ses ravages que la peur chez nos sauvages. La panique était générale. On voyait des ennemis partout. Le lendemain 28 avril, à neuf heures du matin, tous nos soldats avaient pris la fuite. Les familles alarmées venaient prendre leurs enfants à l'école. Tous, affolés par la peur, partaient sans savoir où ils allaient, sans provisions, sans secours d'aucune sorte, abandonnant leurs maisons aux voleurs, ne pensant plus à leurs semences.\n\nDans cet affolement général, nos Sœurs firent chorus. Il était impossible de les retenir plus longtemps. Bien que ma conviction fût qu'elles seraient plus exposées au danger ailleurs qu'ici, je consentis à leur départ. Durant la nuit du 28 au 29, elles se transportèrent avec un petit bagage sur une île située à 3 kilomètres d'ici, où nous avons une petite maison de pêche. Elles se figuraient, les pauvres Sœurs, que, si les Cris venaient, ils ne pourraient pas aller les trouver là. Les alarmes et la peur recommencèrent et augmentèrent sur la terre d'exil.\n\nDonc nous restions seuls, ou plutôt, je me trompe : il nous restait le fidèle Julien et le courageux Hamelin, résolus à verser leur sang plutôt que de laisser les Cris s'emparer de l'équipement de nos Missions, ou toucher à nos personnes. Nos Frères étaient calmes et résolus à combattre au nom du Seigneur. Ils n'eussent pas été les moins braves en cas d'attaque.\nIl faut avouer pourtant que la position était critique, le danger réel et le moment solennel. Nous avions à craindre que nos Cris du lac Castor, ne voulant pas rester en arrière dans l'attente de la venue des autres, n'oubliassent leurs bonnes résolutions et que, nous sachant seuls, ils ne vinssent nous attaquer eux-mêmes. Dès le premier jour et les jours suivants, ils envoyèrent un des leurs pour nous dire que nous n'avions rien à craindre d'eux, mais que nous avions tout à craindre des bandes du Gros-Ours, qui viendraient très certainement. Un pauvre sauvage est si incoustant. Nous croyions à leurs promesses, et nous agissions comme si nous n'y croyions pas.\n\nLes 28, 29 et 30 avril furent des journées pénibles. Durant la nuit du 30, vers onze heures du soir, M. Young, qui avait été à Edmonton pour avoir des nouvelles exactes, arrivait. Il nous apprit qu'une armée de 6000 à 7000 hommes : 2000 se dirigeant vers le lac Canard, 1500 vers la rivière Bataille, et de 1000 à 1200 vers Edmonton, était arrivée dans le pays ; que partant l'émeute ne saurait tenir longtemps. C'était encourageant, mais nous restions sous le poids de la menace du Gros-Ours. Comme il y avait encore trois jours avant la date extrême fixée par l'émissaire, M. Young, après nous avoir consultés, se décida à faire appel à toutes les bonnes volontés, à l'effet de former une petite armée de volontaires. Il envoya tout autour du lac, poursuivit lui-même les fuyards dans la petite rivière La Biche. Là il ne recruta personne, la peur était encore trop grande, mais bien d'autres qui s'étaient peu éloignés, ou qui, moins effarouchés, n'avaient pas quitté leurs maisons, répondirent à son appel. Le 4 mai au soir, il enrôlait 27 hommes, leur promettant, au nom du gouvernement, solde et ration. La nuit donc du 4 au 5 mai, la moitié de la garde mobile veillait autour de nous ; l'autre devait garder le jour. Au premier danger, un signal\nconvenu de quatre coups de fusil devait les réunir tous. C'était quelque chose.\n\nM. Young, après avoir reçu l'assurance de tous les pillards de son Fort qu'ils n'avaient tout pris que pour le soustraire aux gens du Gros-Ours ; qu'ils avaient regret de ce qu'ils avaient fait et étaient prêts à tout restituer, partit le 5 mai pour aller rejoindre sa femme et ses enfants, qui avaient suivi la population. Il devait les conduire à Edmonton, via Tawatinau, et revenir ensuite pour approvisionner la colonie. Le même jour, il envoyait un courrier au général Strange, à Edmonton, pour lui demander un piquet de soldats pour nous protéger. Le courrier devait se hâter et, dans huit jours au plus, nous apporter des nouvelles.\n\nEn somme, tout semblait s'apaiser. Le 6, le 7, le 8 mai se passèrent sans que l'ennemi parût. Nous commençâmes à croire qu'il ne viendrait pas. Le malaise continuait quand même. Nos volontaires continuaient leur garde de nuit et de jour.\n\nLe mardi 12 mai, je fis mettre notre berge à l'eau, et nous allâmes, à travers les glaces, délivrer nos prisonnières de l'île. Que de bénédictions je reçus là!... Cependant notre garde perdait patience ; nous ne recevions aucune nouvelle. Le 17, nous eûmes une nouvelle alerte : l'ennemi était là, nombreux, bien armé, décidé à tout. On l'avait vu de ses yeux, entendu de ses oreilles ; l'affolement recommençait, les Sœurs voulaient repartir ; nos soldats improvisés parlaient de prendre la fuite. Julien, toujours Julien, partit seul, à cheval, pour prendre des informations sur la cause véritable de l'alarme. C'était une bourde. Le visionnaire faillit se faire une mauvaise affaire.\n\nL'anxiété augmentait : que signifiait ce silence absolu de trois longues semaines ? Le vendredi 22 mai, Julien et\nson beau-frère partaient à travers la forêt, prenant le chemin le plus court, résolus de ne pas retourner sans avoir recueilli des informations sûres. Le 28, ils étaient de retour, porteurs d’une grande lettre sur l’adresse de laquelle était écrit ce mot en gros caractères : VICTOIRE. L’armée était victorieuse au lac Canard, et Riel prisonnier; victorieuse à la rivière Bataille ; le Gros-Ours avait levé le camp et se dirigeait par les prairies vers Carlton. Ce fut un soulagement et une joie, quoiqu’il nous restât encore l’apprehension que des bandes séparées se jetassent sur nous, mourantes de faim, avides de pillage. Un petit festin fut servi à nos très mobiles soldats, puis avant la nuit ils se dispersèrent.\n\nUne seule pensée devait nous occuper désormais : faire partir au plus tôt nos berges. Les rameurs s’offraient en grand nombre. Nous hâtâmes les préparatifs, et, le mercredi 3 juin, nos deux berges, portant 825 kilogrammes, se mettaient en route à trois heures du soir. Le R.P. COLLIGNON les suivit. La veille, nous avions expédié 825 kilogrammes pour les missions de Saint-Charles et Saint-Bernard. Après toutes les craintes, ce départ fut un immense soulagement. Le soir du même jour, le colonel Ouimet nous envoyait quatre hommes pour nous demander si nous avions besoin de soldats. Nous répondîmes que les soldats auraient pu être utiles un peu plus tôt, mais qu’actuellement nous pouvions nous en passer ; que le malaise dans lequel vivaient les sauvages plus ou moins coupables exigerait l’envoi d’un juge accompagné de huit ou dix officiers de police en uniforme, pour rétablir la paix. Nous attendons ce juge d’un jour à l’autre.\n\nJe n’avais voulu vous donner qu’une idée générale de nos inquiétudes et des dangers auxquels nous avons été exposés. J’ai fini par vous faire un assez long rapport. Vous ne le trouverez, je pense, pas mauvais.\nIl ne me reste plus, très révérend et très aimé Père, qu’à me recommander, ainsi que toutes nos œuvres, à vos saintes prières, et à vous assurer de ma constante estime et persévérante affection. Tout continue d’aller bien ici.\n\n† HENRI, Év. d’Anemour, O. M. I.\n\nLETTRE DU R. P. COCHIN.\n\nSainte-Angèle, le 28 avril 1885,\ncamp des sauvages rebelles.\n\nIl y a un mois environ que nous sommes en guerre dans les environs de Battleford. Les métis catholiques de Bressylor, mes paroissiens, étaient bien tranquilles, lorsque, sans être attendu, M. J. Mac-Kay, fermier-instructeur des sauvages, arriva de la réserve Strike him on the back. Ce bon monsieur faisait ici beaucoup de bien, et il assistait les sauvages en prenant même sur son nécessaire. Sa charité ne put empêcher que, le lundi 30 mars, il ne fût réveillé en sursaut, avant le lever du soleil, et immédiatement pillé. Les mêmes sauvages, qu’il avait souvent secourus, entrèrent chez lui comme une bande de brigands, demandant la bourse ou la vie. « Tous les magasins sont pillés à Battleford, dirent-ils ; si tu veux vivre, donne-nous à chacun 50 piastres. » Un d’eux, tirant son couteau, dit : « Si on te frappe, je veux mourir avec toi, parce que tu as été charitable ; mais tu vas rester avec nous comme prisonnier, et nous ne répondons pas de ta vie quand les autres arriveront. » Pendant cette scène, les deux enfants de M. Mac-Kay, deux petites filles, se réveillaient épouvantées et poussaient des cris déchirants. Les sauvages, poursuivant leurs recherches, visitèrent l’écurie, prirent un cheval du propriétaire et un", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007727.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 16608, "total-output-tokens": 6636, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1633, 1], [1633, 3530, 2], [3530, 5373, 3], [5373, 7176, 4], [7176, 9035, 5], [9035, 10831, 6], [10831, 12696, 7], [12696, 14511, 8], [14511, 16434, 9], [16434, 18197, 10], [18197, 20066, 11], [20066, 21648, 12]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false]}}]