[{"id": "81e225f2d13ad4100250ff72634a18f0c188a154", "text": "de railler les catholiques de leur ignorance. Une phrase favorite était : « que les presses, les journaux, les lumières et la science ne sont pas en honneur parmi les papistes. » Comment vont les choses à cette heure ! La presse catholique de Saint-Joseph est le plus vaste et le plus florissant établissement de ce genre à Jaffna. Livres catholiques et journaux en sortent chaque jour. Bon nombre de jeunes gens y trouvent un emploi en qualité d'imprimeurs, de compositeurs, graveurs, relieurs et fondeurs de types. Le Catholic Guardian a non seulement fait pâlir l'éclat du grand luminaire protestant, le Morning Star, qui décline rapidement vers l'horizon, mais promet, sous la direction de l'éditeur actuel, de prendre place au premier rang des journaux de Ceylan.\n\nEt ce n'est pas un médiocre mérite que, tout en poursuivant aux besoins spirituels de leur troupeau, les Missionnaires catholiques soient aussi pleins de sollicitude pour les nécessités corporelles, non seulement de leur coréligionnaires, mais de tous les malheureux indistinctement ; durant le choléra et la famine de 1877-78, ils ont été, dans le vrai sens, les membres de la Commission du choléra et de la famine à Jaffna : fait que notre gouvernement trouve désagréable d'admettre, mais qui jamais, jamais ne sera contredit.\n\nSAINT-ALBERT.\n\nEXTRAITS DES LETTRES ADRESSÉES AU T. R. PÈRE SUPÉRIEUR GÉNÉRAL.\n\nLe R. P. Hert écrit de Battleford, en date du 24 janvier 1879 :\n\nIl me semble vous avoir dit déjà dans mes lettres pré-\nvéidentes que la mission de Battleford était encore à ses débuts. Elle y était surtout à mon arrivée dans la capitale du Nord-Ouest. En effet, point de bâtiment où l'on pût célébrer la sainte messe, point de maison pour abriter le Missionnaire, point d'ornements, bref, tout manquait. Peu à peu je suis arrivé à achever une construction qui doit servir d'église. Ce n'est rien d'extraordinaire, c'est même très misérable. Il n'y a pas trois nefs, à peine y en a-t-il une, et lorsqu'on fait la génotlexion, il faut bien prendre ses mesures afin de ne pas renverser les voisins : voilà pour la dimension. Quant à la beauté, il ne faut pas la chercher. Figurez-vous une chaumière avec quatre petites fenêtres et vous aurez l'église de Battleford ; l'intérieur cependant présente un peu l'aspect d'un édifice destiné au culte.\n\nLa veille de la fête de l'Immaculée Conception, j'ai fait faire un autel par les métis ; ils ont fait ce travail gratis. C'est moi qui ai dû faire le plan et diriger les ouvriers. J'ai orné cet autel de chandeliers venus de France et de chaque côté j'ai placé des tableaux représentant le Sacré-Cœur de Jésus et le cœur Immaculé de Marie. J'ai ensuite acheté quelques mètres d'étoffe rouge (le rouge est très recherché dans ce pays), j'en ai confectionné un devant d'autel et des tentures pour le fond du sanctuaire. C'est ainsi que mon église s'est trouvée ornée pour la fête de l'Immaculée Conception.\n\nLa fête de Noël si chère à tous les chrétiens, l'est surtout à ceux de ce pays. Il est d'usage de déployer ce jour-là, pour la décoration de l'église, tout le luxe possible. Je n'ai pas manqué de suivre une si louable coutume, et dès le 23 je me suis occupé de l'ornementation. Des métis sont allés chercher de jeunes sapins qu'ils ont placés de chaque côté de l'autel. Un marchand de Battleford m'a cédé, pour la fête, toutes les étoffes rouges\net bleues dont j'avais besoin, j'ai réuni toutes les lampes et bougies dont on pouvait disposer et j'ai découpé dans du carton des inscriptions pour la circonstance. Plusieurs jours auparavant j'avais exercé des chanteurs et des chanteuses.\n\nGrâce à ces préparatifs la fête fut splendide ; jamais dans le pays on n'avait vu rien de si beau. Un grand nombre de protestants, pour ne pas dire tous, sont venus à la messe de minuit, et il va sans dire que tous les catholiques y assistaient. La chapelle était trop petite pour la foule. La messe fut chantée avec entrain. À l'offertoire, après l'élévation, à la communion et après la messe on exécute des cantiques en français, en anglais, en latin et en cri. Tout alla si bien que le lendemain des protestants me dirent qu'ils ne s'attendaient pas à une si belle cérémonie et qu'ils avaient trouvé le service trop court. J'avais craint de le faire durer trop longtemps, et à cause de cela je m'étais abstenu de prêcher. Le journal de la localité, la seule feuille qui se publie dans le Nord-Ouest, a rendu compte de la cérémonie dans les termes les plus flatteurs.\n\nAprès Noël, les fêtes se succédèrent rapidement, ce qui me donna un surcroît de travail considérable, car je ne manque jamais de prêcher en anglais et en français, chaque dimanche et chaque jour de fête.\n\nUn nouveau progrès pour la mission de Battleford, c'est la petite maison qui sert d'abri au Missionnaire. Je l'occupe seulement depuis le nouvel an. Il m'avait été impossible de la mettre en état plus tôt, faute de planches. Cette demeure n'est ni spacieuse, ni fort élevée. Elle se compose d'une chambre unique qui sert de tout. L'absence de plafond permet de voir toujours le toit et même, en me tenant debout, il m'est facile d'y atteindre.\n\nComme vous le voyez, cette mission est en voie de\nprogrès ; cela ne va pas vite, mais avec le temps tout s'organisera. J'ai remarqué, il y a quelques jours, qu'on ne distinguait pas assez l'église des autres édifices ; aussitôt j'ai fait faire une grande croix et maintenant le signe de notre salut se dresse sur l'église et indique la maison de Dieu à nos chrétiens.\n\nLes lignes suivantes sont extraites d'une lettre du F. Némoz et datées du lac Chitec, mission du Sacré-Cœur, le 12 janvier de cette année :\n\nJe suis seul ici pour vingt-cinq jours. Le R. P. Bonnald est parti pour la mission Saint-Pierre, au lac Caribou, le 26 décembre dernier. La santé de ce cher Père n'est pas des plus brillantes et quoique jeune encore, il a déjà l'air vieux. Le 30 décembre il a dû se trouver à l'entrée du grand lac Caribou, et justement ce jour-là les grands froids ont commencé à se faire sentir et durent encore. Je crains bien qu'il ne se soit gelé le visage et si cela n'est pas, comme je le désire, je suis convaincu qu'il aura eu besoin de se donner beaucoup de mouvement pour n'avoir pas trop à souffrir. Il voyage avec les gens de la compagnie de la Baie d'Hudson, qui sont allés porter un express au bourgeois en charge de ce poste. Un des meilleurs marcheurs du district se trouve avec eux, les fortes journées qu'il fait sont quelque chose d'extraordinaire. Le P. Bonnald est accompagné du sauvage qui lui sert d'engagé ici pour l'hiver, mais il est loin d'être habile voyageur. Nos chiens ne sont pas non plus de forts marcheurs.\n\nDéjà le 11 décembre précédent le R. P. Bonnald m'avait laissé seul pendant dix jours pour se rendre à la mission Saint-Joseph. Une nuit, pendant son absence, je m'éveillai en sursaut, suffoqué par la fumée. Je couchais sur quelques planches que j'avais posées sur trois so-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007633.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5536, "total-output-tokens": 2093, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1500, 1], [1500, 3375, 2], [3375, 5188, 3], [5188, 6947, 4]], "primary_language": ["fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]