[{"id": "e3aa3bb6eaf4b435e87294bcac4487db4bda8572", "text": "sure du R. P. Moulin, frappé ce matin d’une balle égarée. Par une protection visible de N.-D. de la Miséricorde dont nous célébrons la fête, la blessure n’est pas grave. J’ai pu, malgré la fusillade qui nous entoure, faire entrer quelques soldats canadiens qui ont emmené le cher blessé à l’ambulance. Le général vient à l’instant de nous dire que la balle a été heureusement extraite et que la guérison ne sera pas longue.\n\nL’armée canadienne a le dessus. Nos gens se sont retirés en grande partie sur la rive opposée de la Saskatchewan ; une bande seulement tient encore dans un ravin tout près d’ici, en sorte que nous sommes maintenant hors de danger et en liberté. J’en profite pour vous rassurer par cette lettre. Les religieuses se portent bien.\n\n(Missions catholiques.) FOURMOND, O. M. I.\n\nLETTRE DU R. P. PROVOST AU T. R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Raphaël du lac Froid, 19 juin 1885.\n\nMon Très Révérend et Bien-Aimé Père,\n\nIl y a déjà longtemps que j’aurais dû vous écrire. J’étais en train de le faire à Montréal lorsque l’ordre m’arriva de suivre le 63e bataillon comme aumônier dans l’expédition du Nord-Ouest.\n\nNos Pères ou les journaux vous ont appris que nous avions laissé Montréal le 4 avril pour arriver à Winnipeg le 10 et à Calgary le 12. Dans ces différentes missions, j’ai rencontré la plupart de nos Pères, et j’y ai éprouvé d’une manière bien sensible le bonheur d’appartenir à une famille religieuse. De Calgary à Edmonton, j’ai rencontré les R.R. PP. SCOLLEN et GABILLON ; à Edmonton, le R. P. GRANDIN. J’ai visité la belle mission de Mgr GRANDIN\nà Saint-Albert, et ce cher Seigneur m'a reçu avec toute l'affection de son grand cœur. J'y ai vu toutes ses belles œuvres. Il m'a montré avec orgueil ses petits sauvages occupés à travailler la terre, le bois, etc. Il a avec lui un des fils de Poundmaker, un célèbre chef sauvage qui vient de se soumettre à Battleford, grâce à l'intervention du R. P. COCHIN, dit-on. Je n'ai été que quelques heures à Winnipeg et à Saint-Boniface; huit jours à Calgary, huit jours à Edmonton et un jour à Saint-Albert.\n\nJ'ai pu aller voir le R. P. BLAIS dans sa petite mission du Fort-Saskatchewan. De là, nous sommes descendus par la rivière du même nom au Fort-Pitt, où nous avons commencé à voir les horreurs de la guerre barbare que les sauvages ont faite aux blancs : des cadavres exposés depuis longtemps à la voirie, les magasins pillés, brûlés et saccagés. Tout est désert sur notre passage; pas un pouce de terre ensemencée; les maisons barricadées ou détruites.\n\nLe 27 mai, nous laissions le Fort-Pitt, et le lendemain nos soldats eurent un engagement de deux ou trois heures avec la bande du Gros-Ours, le plus vilain sauvage du Nord-Ouest, qui avait alors une quarantaine de prisonniers blancs, au nombre desquels le R. P. LE GOFF et les sauvages, chefs de sa mission.\n\nNous nous retirâmes vers le Fort-Pitt pour revenir quelques jours après. Nous n'y retrouvâmes plus les sauvages : ils avaient décampé, laissant une grande partie de leur butin, une centaine de charrettes, des wagons, des lits de plume, des sacs de farine et du lard. Là, je trouvai une boîte-chapelle que l'on croit être celle du R. P. FA-FARD. On me remit plusieurs feuillets du registre des baptêmes, mariages et décès, un manipule et autres objets.\n\nNous étions campés à quelques milles, lorsque le soir, vers dix heures, trois prisonniers échappés entrèrent dans\nnotre camp conduits par la sentinelle. C'est d'eux que j'ai appris que le R. P. Le Goff, que nous croyions mort, était vivant, et que ses sauvages avaient fui les rebelles en leur abandonnant une quarantaine de bêtes à cornes.\n\nDe là nous passâmes au lac d'Oignon (Onion's lake), où était la mission du R. P. Marchand, aujourd'hui brûlée et sacagée. Il n'en reste absolument rien que quelques boisseaux de patates dans un caveau que nous supposons appartenir à la Mission.\n\nVingt milles plus loin est le lac La Grenouille. J'ai eu la douloureuse consolation d'aller m'agenouiller sur la tombe de nos chers PP. Fafard et Marchand, massacrés le 2 avril par les sauvages. Leurs corps, trouvés dans la cave de leur chapelle, avaient été enterrés par la colonne de nos soldats qui descendait par la voie de terre. J'ai bien regretté de n'être pas avec cette colonne, car j'aurais pu leur rendre moi-même ce devoir. Il ne reste absolument rien de la Mission; tout est brûlé. Cependant le cimetière est en bon état, ainsi que la cloche. Elle a été respectée par les vandales, et on la voit encore sur sa charpente à côté de l'église en ruines.\n\nDu lac La Grenouille, poursuivant toujours la bande du Gros-Ons, nous sommes arrivés à la mission du lac Froid, d'où je vous écris et où nous sommes depuis douze jours. C'est ici que le R. P. Le Goff s'est présenté au général pour savoir à quelles conditions ses sauvages pourraient rentrer sur leurs réserves, car quelques-uns s'étaient compromis. Je fus envoyé avec le P. Le Goff pour traiter avec eux. Nous étions porteurs d'une lettre que nous devions lire à la tribu et qui lui enjoignait de se rendre sans condition. C'était un peu raide. Cependant, avec l'aide de Dieu, tout marcha bien. Le camp des sauvages était à 15 ou 16 milles d'ici. Deux sauvages étaient venus nous chercher. Les guerriers décidèrent, séance", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P007725.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4152, "total-output-tokens": 1655, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1587, 1], [1587, 3420, 2], [3420, 5280, 3]], "primary_language": ["fr", "fr", "fr"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]