[{"id": "7bb0882837d638f54f2fe200148481424e427faa", "text": "nage, et bon nombre de gens ont dû rester dehors faute de places.\n\nQuoiqu'on fût en semaine, tout Gigny était là, en habits de fête, avide de voir d'imposantes cérémonies religieuses, d'entendre de la belle musique et surtout de la belle éloquence.\n\nAu risque de blesser des modesties qui s'oublient, nous dirons qu'ils ont été servis à souhait, et le R. P. Michaux, des Oblats de Marie, chanoine de Metz, qui s'est fait entendre pour la première fois en Bourgogne, nous permettra de saluer en lui un apôtre dont la parole émue, sympathique et vibrante a le don de toucher les cœurs et de remuer les foules.\n\nLa procession a été fort belle et fort longue : les reliques des saints, portées par huit prêtres en dalmatique, avaient pour garde d'honneur plus de soixante-dix hommes, et c'est au milieu des respects de tous qu'elles ont traversé les rues de Gigny.\n\n— On lit dans le journal le Manitoba, du 31 juillet, sous ce titre : CALGARY, les lignes suivantes :\n\nSaint-Eugène (Carlton), 6 juillet. Dans le district de Saint-Laurent plusieurs paroisses sont en germe, c'est-à-dire elles n'ont encore ni prêtre ni chapelle. De ce nombre est Saint-Eugène (Carlton). Entre le lac Canard (Mission du Sacré-Cœur) et cette future paroisse, la distance est de 19 milles. Le R. P. Fourmond a été choisir l'emplacement de cette nouvelle église. Le bois pour la maison du Père, qui servira provisoirement d'église, est presque tout rendu sur la place.\n\nLe nom de Saint-Eugène a été donné à cette nouvelle paroisse, en souvenir de Mgr Eugène de Mazenod, fondateur des Oblats de Marie Immaculée.\n\nDimanche dernier, c'était fête à la Mission de Calgary. On inaugurait un bel orgue-harmonium, qui venait d'arriver de Montréal sans accident. Le cher Frère Foiry faisait résonner avec habileté l'excellent instrument dans notre nouvelle chapelle. Le P. Vantielem chantait la messe et donnait un excel-\nlent sermon en anglais. Il est bon de savoir que ce cher petit Père belge, depuis son arrivée au milieu de nous, s'est donné de tout cœur à l'étude de la langue anglaise, travail qui est couronné de succès.\n\nQuand dernièrement le R. P. Lacombe était sur le point de laisser Montréal pour nous revenir, un de ses frères en religion, de concert avec les filles de sa Congrégation, lui offrait de payer un harmonium pour la Mission de Calgary. Dimanche dernier, tout le monde admirait la libéralité des donateurs. Cet ami du P. Lacombe, c'était le bon P. Lauzon, de la maison des Pères Oblats de Montréal. Ces bonnes filles, qu'il dirige, c'étaient les filles de Marie, qui forment une des plus belles congrégations de Montréal. Ces demoiselles, sans compter d'autres donations, veulent payer par leurs petites industries cet harmonium de Calgary. Toutes les fois qu'il retentira dans notre chapelle, il redira la charité des bienfaitrices de nos Missions. Veuille le bon Dieu les récompenser au centuple!\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009633.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4520, "total-output-tokens": 905, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1886, 1], [1886, 2889, 2], [2889, 2889, 3]], "primary_language": ["fr", "fr", "None"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]