[{"id": "11b94d53a683cb1d10205935525f5a2c749aee42", "text": "MISSIONS\n\nDE LA CONGRÉGATION\n\nDES OBLATS DE MARIE IMMACULÉE\n\nN° 106. — Juin 1889\n\nMISSIONS ÉTRANGÈRES\n\nVICARIAT DE SAINT-BONIFACE.\n\nMISSION DU SACRÉ-CŒUR.\n\nLETTRE DU R. P. MAGNAN, SUPÉRIEUR,\n\nAU T. R. P. SUPÉRIEUR GÉNÉRAL\n\nLac Qu'Appelle, le 25 janvier 1889.\n\nMon très révéré et bien-aimé Père,\n\nDans son remarquable rapport, écrit pour le chapitre général de 1887, Mr. Taché désignait notre district sous le nom de district de l'Ouest. Ce district, qui comprenait alors les quatre résidences de Qu'Appelle, de l'École industrielle, de la Montagne de Bois et de Saint-Lazare (Fort-Ellice), a été modifié depuis. La Mission de Saint-Lazare en a été détachée pour faire partie de la maison de Saint-Laurent (lac Manitoba), et aujourd'hui le district de l'ouest ou de Qu'Appelle se compose de la maison du Sacré-Cœur, de l'École industrielle, de la résidence\nde la Montagne de Bois, et de plusieurs autres Missions, prêtes à devenir des résidences quand nous aurons un plus grand nombre de missionnaires, notamment : le Très-Saint-Cœur de Marie (au lac Croche), Notre-Dame de l'Espérance (à la montagne de Tondre) et Notre-Dame de Bon-Secours (réserve de Pasqwa). J'aurai à vous dire un mot de chacune de ces résidences et Missions.\n\nQuoiqu'elles aient été restreintes, les limites de notre district mesurent encore une très grande étendue : environ 220 milles de l'est à l'ouest et 210 milles du sud au nord, soit une superficie de 46 200 milles carrés, où nous avons passablement à voyager, comme vous pourrez vous en convaincre par les détails qui suivent.\n\nLa population dont nous sommes chargés dans ce district s'élève à plus de 5 000 âmes. Plus de 3 750 sont des sauvages, le reste se compose de blancs de toute nationalité, mais surtout de métis. Cette population est très disséminée et se répartit en trente centres très éloignés les uns des autres. Un tableau synoptique, que je vous envoie avec cette lettre, vous renseignera plus exactement à ce sujet et vous indiquera nos Missions déjà établies, ainsi que celles que nous ne pouvons encore visiter que transitoirement.\n\nSans autre préambule, voici une courte notice sur chacune de ces Missions.\n\nTout d'abord un mot de notre maison du Sacré-Cœur. Cette maison est située assez exactement au centre de tout le district dont elle est le principal établissement. À part le R. P. Hugonnard qui réside à l'École industrielle et le R. P. Saint-Germain qui stationne à la Montagne de Bois, tous les autres missionnaires sont de résidence à la maison du Sacré-Cœur. C'est de là qu'ils partent pour visiter les différents postes où nous avons des Missions ; et c'est là qu'ils reviennent pour les retraites mensuelles, etc.\nComme vous pouvez en juger par quelques photographies que vous recevrez avec cette lettre, cet établissement est maintenant à peu près au complet. Les constructions qui y ont été faites pendant les dernières années n'ont pas coûté moins de 38000 francs. Notre église est bien convenable. Le sanctuaire est orné d'une très belle statue du Sacré-Coeur, valant 350 francs et offerte par nos pauvres paroissiens. On y remarque aussi deux tableaux fort jolis, représentant la sainte Vierge et saint Joseph. Tout l'intérieur revêt un cachet de simplicité et de proté qui porte à la piété. On aime à y prier : c'est une réflexion que j'ai souvent entendu faire. De plus, à toutes les grandes fêtes, notre bon frère Doyle sait ajouter encore à son mérite par des décorations où se révèlent son goût, son talent et sa piété. Nous y avons régulièrement l'office paroissial tous les dimanches et fêtes. Enfin le concours du R. P. Hugonnard et de tout le personnel de l'École industrielle nous permet de donner à nos cérémonies religieuses un éclat et une pompe qui ne se rencontrent pas dans bien d'autres paroisses, même en des pays plus civilisés.\n\nNos catholiques aiment beaucoup à venir à ces offices. Il y en a qui font assez régulièrement un trajet de 15 à 20 milles, même pendant les froids rigoureux de l'hiver, pour venir à la messe le dimanche. J'ai connu un sauvage âgé de 66 ans qui, tous les dimanches, faisait 40 milles à pied pour venir à l'église. Dans bien des cas, pendant l'été, notre église est trop petite pour contenir tous ceux qui viennent, d'un peu partout, à nos offices.\n\nIl y a déjà, malheureusement, un certain nombre de protestants établis dans les limites mêmes de notre paroisse, et la population catholique ne s'élève pas à plus de 500 âmes.\n\nLe nombre de nos catholiques a été diminué ici tout\ndernièrement par le départ d’un bon nombre de familles métis qui sont allées s’établir ailleurs. Les éléments divers dont se compose cette population exigent de notre part, pour l’exercice du saint ministère, la connaissance du français, de l’anglais et du cris.\n\nL’école de la Mission est aussi sur un bon pied. L’édifice, qui avait été construit par le comité des syndics et qui était leur propriété, nous appartient maintenant. Nous en avons fait tout dernièrement l’acquisition afin de pouvoir exercer une plus grande influence sur la direction de l’enseignement. Il est à quelques pas de l’église et sur le terrain même de la Mission. C’est une très bonne bâtisse, construite il y a un peu plus de deux ans et pouvant recevoir une cinquantaine d’enfants. Il y a actuellement de 25 à 30 enfants qui fréquentent régulièrement cette école pendant l’hiver et de 40 à 50 pendant l’été. Le nombre des élèves inscrits en 1888 est de 74. L’instituteur est un jeune métis qui a été élevé chez nos Pères de Saint-Laurent et qui a fait un brillant cours d’études à Saint-Boniface. Nos métis sont tout fiers de voir un des leurs aussi capable.\n\nLe supérieur de la Mission est lui-même le président du bureau des syndics. De cette manière, l’école, tout en étant légalement organisée en district et recevant pour cette raison une forte subvention du gouvernement, se trouve tout à fait sous notre contrôle. C’est heureux, car ici, comme ailleurs, il se rencontre pas mal d’esprits faux qui voudraient faire croire à nos gens que le prêtre n’a rien à voir dans la direction des écoles.\n\nNotre maison, quoique d’une grande simplicité, est très confortable et assez spacieuse pour répondre aux besoins d’une communauté religieuse, et nous n’avons qu’à nous féliciter d’avoir suivi en tout les avis dictés par l’expérience de Mgr Taché pour la construction de cet établissement. Outre une salle de réception, un parloir,\nun réfectoire, une chapelle intérieure, et une salle de récréation, on y compte sept chambres pour les missionnaires. À part cela, il y a aussi, attenante à notre résidence, une bâtisse de même genre pour les domestiques et autres employés de la maison. Je ne crois pas exagérer en disant que ces deux constructions avec les dépendances valent 20 000 francs.\n\nDepuis un an, nous sommes quatre Pères et un Frère convers de maison ici. Mais assez habituellement il ne s'y trouve qu'un Père, pendant que les autres vont visiter les différents postes qui dépendent de notre Mission.\n\nC'est ainsi que nous avons à desservir la Mission de Saint-Joseph de Dauphinois. Cet établissement situé à environ 30 milles au nord du lac Qu'Appelle, se compose de 35 familles métis qui se sont fixées dans cette localité depuis trois ans. Il n'offre guère d'espérance pour l'avenir, et nous ne voulons faire aucune dépense sérieuse pour l'améliorer. Il y a là une assez bonne école fréquentée par une moyenne de 25 à 30 enfants. La maison d'école nous sert en même temps de chapelle. Tous les mois, un des Pères va y dire la messe, et il visite les malades quand il y a lieu, etc. Pendant l'été, il y passe quelques semaines pour faire le catéchisme aux enfants et les préparer à la première communion.\n\nTous les deux ou trois mois, nous allons aussi exercer le même ministère dans un autre établissement situé à un peu plus de 15 milles à l'est d'ici, et dans la vallée même de Qu'Appelle. Il y a là deux familles de blancs et une dizaine de familles de Métis, dispersées sur une superficie de 5 ou 6 milles et dans l'impossibilité de venir à notre église. Ils n'ont pas d'école catholique, et leurs enfants sont obligés de fréquenter des écoles mixtes, ce qui nécessite une plus grande surveillance de notre part et plus de soin à les bien instruire.\nCe serait ici le lieu de dire un mot de la Mission de la Montagne de Bois, située au sud-ouest de notre district, à environ 120 milles du centre, mais je n’en connais guère autre chose que ce que Mgr Taché en a dit dans son rapport de 1887. Le P. Saint-Germain vient souvent à la Mission du Sacré-Cœur dont il est un des visiteurs les plus assidus. Depuis que Monseigneur a écrit son rapport, un district scolaire a été organisé à la Montagne de Bois, et, autant que je puis savoir, il y a de 40 à 50 enfants, au moins, inscrits pour cette école.\n\nJusqu’au mois de mai de l’année dernière, nous étions aussi chargés de visiter, tous les mois, les colons catholiques établis auprès des gares de Qu’Appelle et de Broadway. Mais la desserte de ces deux Missions a, depuis, été confiée à des prêtres séculiers, qui, au nombre de trois, visitent et desservent maintenant les catholiques groupés auprès des différentes gares du chemin de fer Canadien-Pacifique.\n\nCeci nous permet de donner plus de temps à nos Missions sauvages, qui sont de beaucoup la partie la plus importante du ministère qui nous est confié. Au risque d’être un peu monotone et d’abuser de votre patience, j’essaierai de vous faire connaître les principales de ces Missions.\n\nIl ne faut pas, mon très révérend Père, vous attendre à de bien grands résultats. Jusqu’en 1884, il n’y a eu à Qu’Appelle qu’un seul missionnaire. Il lui était évidemment impossible de s’occuper sérieusement des sauvages. À peine pouvait-il quelquefois les visiter en passant. Le soin des catholiques blancs et métis lui donnait plus d’ouvrage qu’il ne pouvait en faire ; outre qu’il fallait alors s’occuper plus qu’aujourd’hui de créer des ressources et des revenus pour vivre. Voilà deux ans seulement que nous sommes plus de deux à Qu’Appelle, et\nencore a-t-il fallu, afin de pouvoir exercer le ministère auprès des sauvages, que les Pères, qui sont tous jeunes et nouveaux ici, apprissent les langues sauvages auxquelles tous étaient complètement étrangers.\n\nNous avons actuellement cinq centres de Missions sauvages que nous visitons régulièrement trois ou quatre fois par an, et même plus souvent pour quelques-uns. Un Père réside dans chacun de ces centres une moyenne de trois ou quatre mois.\n\nLe premier de ces centres est la Mission de Notre-Dame de Bon-Secours, située sur la réserve de Paskwa à une quinzaine de milles au sud-ouest de Qu'Appelle. Il y a là environ cent catholiques, dont la plupart sauvages Sau-teux. Vous vous rappelez encore quelle circonstance toute providentielle a donné lieu à un véritable mouvement de conversion dans cette réserve. Il y a cinq ans le R. P. Hugonnard était appelé auprès d'une pauvre sauvagesse mourante. Cette femme privilégiée se convertissait, et, au bout d'une journée, elle mourait en vraie prédestinée, exerçant sur son lit de mort les fonctions d'apôtre et de missionnaire et emportant dans la tombe l'assurance de la conversion de son mari et d'un bon nombre de ses autres parents. Ceux qui promirent alors tinrent leur promesse, et aujourd'hui, les Asham (c'est leur nom), qui autrefois étaient renommés pour leur fanatisme, sont nos meilleurs catholiques, de vrais chrétiens. Ils nous ont beaucoup secondés dans la conversion d'autres sauvages.\n\nActuellement nous avons à Notre-Dame de Bon-Secours un bon noyau de catholiques qui font continuellement des sacrifices bien généreux pour leur religion. Tout auprès d'eux, un ministre presbytérien a ouvert une école où il offre de nourrir et de vêtir les enfants qui la fréquentent. En outre, il prodigue aux parents eux-\nmêmes des présents de toute sorte. Mais ses efforts ont été sans succès auprès de nos catholiques, qui toujours ont suivi les avis de leurs missionnaires, et je ne crois pas qu'il y ait aujourd'hui un seul enfant catholique dans la belle école du ministre. Ceci peut passer pour de l'héroïsme aux yeux de ceux qui connaissent l'extrême pauvreté de nos sauvages et la vénalité à laquelle ils sont si enclins. Nous visitons maintenant cette Mission bien régulièrement. Il n'y a encore là qu'une modeste chapelle bien construite, sur le bord d'un très joli lac, et aussi une pauvre petite maison pour la résidence du Père qui visite cette Mission.\n\nAprès bien des difficultés et des tracasseries de la part des agents du gouvernement, nous avions pu en 1887 y faire reconnaître une école catholique ; mais à cause de la difficulté d'y réunir un nombre suffisant d'enfants et pour d'autres raisons, nous avons cru devoir la supprimer, et aujourd'hui la plupart de ces enfants sont à l'École industrielle de Qu'Appelle.\n\nDepuis que nous pouvons nous occuper régulièrement de ces sauvages, il y a eu des conversions relativement considérables, et surtout nous avons la consolation de constater un mouvement de conversion bien sensible. Parmi les sauvages non convertis, on remarque beaucoup moins de préjugés contre notre sainte religion. Quand j'allai la première fois chez ces sauvages, il y a quatre ans, on nous regardait un peu comme des êtres malfaisants et on nous fuyait. Aujourd'hui le prêtre est le bienvenu dans toutes les maisons et nous avons toute confiance que Notre-Dame de Bon-Secours, patronne de cette Mission, daignera bientôt amener tous ces pauvres sauvages à la connaissance et à l'amour de son divin Fils.\n\nDe la Mission de Notre-Dame de Bon-Secours, le prêtre visite deux autres réserves situées, l'une à 13 milles plus\nà l’ouest et l’autre à 30 milles. Cette dernière est la plus importante et une des plus populeuses. Monseigneur désire que nous en fassions une Mission régulière, et l’a placée sous le vocable de Notre-Dame de Bon-Conseil. Le chef de la localité était autrefois renommé pour ses dispositions hostiles à la religion : le R. P. Hugonnard se rappellera longtemps avec quel mépris il en a été reçu quand il voulut aller recruter chez lui des enfants pour son école, il n’y a que trois ans. Ses dispositions sont bien changées depuis, et même il a mis un de ses enfants à l’École industrielle, ce qui est de bon augure.\n\nÀ quelques milles au nord-est de Notre-Dame de Bon-Secours, et précisément sur la rive nord du même lac qui avoisine cette Mission, vivent environ deux cents Sioux formant la réserve de Standing Buffalo. C’est notre Mission de Notre-Dame des Lumières. Les Sioux sont les sauvages qui nous donnent les meilleures espérances. Pendant que le R. P. Décorbe était à Qu’Appelle, il avait pu les visiter un peu et gagner bien vite leur affection et leur confiance. Il avait même baptisé un bon nombre d’enfants et quelques jeunes gens, dans l’espérance de pouvoir les instruire davantage plus tard, mais son départ pour le Fort-Ellice l’a obligé de renoncer à ses chers Sioux, qui sont demeurés jusqu’à présent dans une grande ignorance de la religion. Aujourd’hui, le R. P. Chaumont est leur zélé missionnaire. Ayant commencé à étudier leur langue au printemps dernier, il la parle passablement maintenant. Il a passé une partie de l’automne au milieu de ses chers néophytes et il y demeurera probablement jusqu’à la fin de l’hiver pour leur enseigner le catéchisme et se perfectionner dans la connaissance de la langue. La chapelle rappelle la grotte de Bethléem. Ce n’est rien autre chose qu’une pauvre étable, que nous avons fait réparer et approprier le mieux que nous avons pu. Nous\nn'avons pas pu nous procurer d'autre logis dans la réserve. Le Père compte actuellement quatre-vingt-dix chrétiens ou aspirants, et il espère beaucoup pour le reste de la bande. Ces sauvages, en effet, montrent de meilleures dispositions que ceux des autres tribus, tels que Cris ou Sauteux, et l'expérience prouve qu'une fois convertis, ils sont meilleurs chrétiens. Ils sont plus laborieux et montrent beaucoup plus de caractère. Le fait suivant vous en fera juger.\n\nIl existe encore dans la Réserve deux ou trois cas de polygamie. Le mari d'une de nos jeunes chrétiennes apprit à ses dépens, l'autre jour, ce que nos chrétiens en pensent. Il arriva, un soir, avec une seconde compagne, qu'il prétendait introduire au foyer domestique; mais Julie, sa véritable épouse, tout indignée, jette dehors son païen de Sioux, lui administre une bonne volée de bois vert et enfin lui ferme la porte au nez. Celui-ci tout confus, dut aller ailleurs chercher un gîte pour la nuit. Cette réception le ramena à de meilleurs sentiments. Il congédia sa femme numéro 2 et vint faire ses excuses à sa véritable épouse, qui ne voulut rien décider avant d'avoir consulté le missionnaire.\n\nLe Père a eu beaucoup de consolations depuis qu'il s'occupe de ces sauvages et il aurait plus d'un trait édifiant à raconter. Un grand avantage, c'est que nous avons dans cette réserve une bonne école qui fonctionne bien depuis près de trois ans.\n\nNous nous occupons actuellement d'y établir, en outre, une école industrielle où les enfants seront formés aux différentes carrières de la vie civilisée. Déjà même certains subsides ont été obtenus du gouvernement à cet effet. Une telle école, si nous pouvons réussir à bien l'organiser, nous sera d'un secours bien précieux pour civiliser et christianiser ces sauvages.\nÀ environ 50 milles au nord du lac Qu’Appelle, à la montagne de Tondre, se trouve notre belle Mission de Notre-Dame de l’Espérance où nous comptons maintenant 158 catholiques. Nous y avons une propriété de 160 acres de terre et une pauvre maison-chapelle, située sur le bord d’un très joli petit lac. C’est notre pied-à-terre pour quatre réserves de sauvages que nous pouvons facilement visiter de là. Le site de cette Mission est réellement des plus beaux et offre l’avantage d’être sur la limite même d’une réserve de Sauteux parmi lesquels nous comptons déjà soixante-dix catholiques.\n\nCe n’est que depuis deux ans que nous pouvons visiter cette mission régulièrement. Auparavant, le prêtre ne pouvait y faire qu’une trop courte apparition de temps en temps. Les quelques catholiques qu’il y avait là étaient donc bien ignorants, et Dieu sait ce qu’il a fallu de peine et de patience pour les instruire et les former aux habitudes de la vie chrétienne. Le R. P. Camper, notre vicaire de Mission, a eu la consolation d’administrer la confirmation à quarante et un de ces chrétiens l’été dernier.\n\nDans ces nouvelles Missions, notre premier soin est de bien instruire les catholiques qui s’y trouvent et de tâcher d’en faire de bons chrétiens. Mais nous ne négligeons pas non plus les pauvres païens et si nous ne pouvons pas encore enregistrer un grand nombre de conversions, nous sommes heureux de constater un grand changement dans leurs dispositions. Un événement assez extraordinaire arrivé l’été dernier n’a pas peu contribué à disposer les sauvages en faveur de notre sainte religion.\n\nUn de ces païens, dont j’oublie le nom, grand homme de médecine et fameux jongleur manifestait toujours le plus grand mépris pour notre religion et nous recevait toujours avec le plus grand dédain. L’été dernier, au\nmilieu d'un violent orage, juste au moment où il commençait ses jongleries pour conjurer le tonnerre, il fut foudroyé et tué raide avec trois ou quatre de ceux qui l'assistaient. Un métis nous a assurés que ce jongleur avait justement commencé ses magies dans l'intention de se moquer de quelques-unes de nos cérémonies religieuses. Quoi qu'il en soit, cet événement a produit un grand émoi parmi les sauvages païens. Le chef, qui est catholique, en a profité pour leur donner une bonne leçon, lorsque les cadavres furent inhumés. Aujourd'hui, la femme du grand magicien a renoncé aux superstitions païennes et est une de nos humbles catéchumènes.\n\n*Notre-Dame de l'Espérance* est dotée d'une excellente école. M. Dennehey, notre intelligent et dévoué instituteur, a toujours mérité des mentions très honorables de la part des inspecteurs du gouvernement. Et l'agent du gouvernement, quoique protestant, est tout glorieux du succès de cette école. Des subventions ont été votées par le gouvernement pour nourrir et vêtir les enfants, et faire de cette école une sorte d'école industrielle.\n\nDe cette même Mission dépendent trois autres réserves sauvages où nous avons déjà quelques catholiques. Elles sont à 15 et 20 milles de Notre-Dame de l'Espérance, et dans des directions opposées. Deux de ces réserves sont habitées par des Cris et l'autre par des Sauteux. Le P. Campeau se propose même de pousser, l'été prochain, jusqu'au lac des Noisettes, à 70 ou 80 milles plus au nord, où il y a deux camps de Sauteux formant une population d'environ 340 âmes.\n\nCette Mission de Notre-Dame de l'Espérance me paraît être une des plus importantes que nous ayons, et il serait bien à désirer qu'un missionnaire pût y résider continuellement. Les protestants semblent concentrer leurs efforts de ce côté-là. Ils y ont trois écoles, et tous les\nmaîtres qui y enseignent sont des ministres. Vous comprenez alors combien ces pauvres sauvages sont exposés. Jusqu'à présent nous avons dû nous contenter de l'espérance d'y avoir plus tard une résidence. La Mission est sous la garde de Marie pendant l'absence du missionnaire.\n\nA une moyenne de 18 milles au nord-est du lac Qu'Appelle, se trouvent les quatre réserves de la Montagne de Lime (1). Les sauvages, tous Cris, y sont dispersés sur une superficie de quelques milles seulement et forment une population de 325 âmes. C'est notre Mission de Notre-Dame des Anges. Cette Mission est toute nouvelle. De fait, cette année seulement le prêtre a commencé d'y séjourner quelque temps pour instruire quelques-uns de ces sauvages et les préparer, soit au saint baptême, soit à la première communion ; jusque-là nous n'avions pu visiter ces sauvages qu'en passant. Ceux qui désiraient se faire baptiser venaient à la Mission du Sacré-Cœur, où nous les instruisions.\n\nCes sauvages, autrefois assez farouches et dont quelques-uns se sont signalés pendant les troubles de 1885, sont aujourd'hui bien disposés à notre égard. Comme nous n'avons pas encore de chapelle, un des chefs a mis sa maison à notre disposition pour toutes les fois que nous irons dans ces réserves. Tout nous fait espérer que ce chef se convertira bientôt, et sa conversion facilitera beaucoup celles des autres sauvages de son camp. Actuellement nos chrétiens, dans les quatre réserves, ne sont qu'au nombre de 29. C'est beaucoup, cependant, pour le\n\n(1) Nous risquons une observation à l'adresse de notre correspondant. Montagne de Lime ne serait-il pas la traduction incomplète de Lime mountain ou de Lime stone ? Et alors, pourquoi ne pas traduire Montagne calcaire ou Pierre à chaux, au lieu de traduire un mot et non l'autre ? — Sous toute réserve. (La Rédaction.)\npeu de temps que nous avons pu consacrer à ces sauvages. En 1897-88, nous avons baptisé parmi eux dix enfants nés de parents païens et cinq adultes. Tout dernièrement, un païen nous a encore promis de faire baptiser quatre de ses enfants. L'automne dernier, j'ai eu le bonheur de préparer à la première communion cinq de ces sauvages : deux âgés d'une vingtaine d'années, deux autres âgés d'environ cinquante ans, et le cinquième un enfant de soixante-dix ans. Parmi ces cinq, une pauvre femme m'a beaucoup édifié par ses excellentes dispositions. En visitant les sauvages à domiole au printemps dernier, je l'avais trouvée malade et dans le plus grand dénuement : pas de poêle, une pauvre hutte ouverte à tous les vents et à peine quelques haillons pour se défendre contre le froid ; pour toute nourriture, quelques restes de galette bien dure. Pas une plainte cependant, quoiqu'elle fût assez souffrante. Reconnaissant le prêtre : « Ah ! que je suis contente, dit-elle, de voir enfin l'homme de la prière ! Je ne connais pas encore les paroles de la prière, mais, tous les jours, depuis que je suis malade, je demande au Grand Esprit de me donner assez de force pour me rendre à la Maison de la prière et me faire baptiser. » Sa joie redoubla quand je lui promis de venir bientôt l'instruire et la baptiser. Je me proposais, en effet, d'aller immédiatement l'instruire. Mais je ne pus tenir ma promesse qu'au bout de quelques mois, me contentant, en attendant, de la visiter de temps en temps et de l'encourager. Cette pauvre païenne voulut se montrer chrétienne avant même d'être baptisée, et sachant que les Priests jeûnent au printemps, elle voulut jeûner elle aussi, et quel jeûne ! passant la journée sans rien prendre, se contentant de manger le soir son pauvre morceau de pain dur. Aussi je puis dire qu'elle était déjà préparée aux deux grands sacrements après lesquels elle soupirait, et\nqu'elle reçut avec les plus beaux sentiments de piété et de dévotion. Pendant tout le temps que je passai à instruire ces sauvages, elle ne manqua pas une instruction. Pourtant elle était encore malade, il faisait bien mauvais temps et sa demeure était assez éloignée de l'endroit où j'enseignais le catéchisme.\n\nDepuis l'automne dernier, je visite ces sauvages au moins tous les mois pour les entretenir et les affermir dans leurs bonnes dispositions. Il faut bien les surveiller car, là aussi, le ministre protestant cherche à faire des prosélytes à l'erreur. Les presbytériens viennent d'y construire une vaste école, et leur ministre fait feu et flammes pour y attirer les enfants. Heureusement, ses efforts n'ont pas été bénis fructueux jusqu'à présent. Nous lui avons un peu coupé l'herbe sous les pieds. Voyant, en effet, que ces messieurs bâtissaient une école, nous avons dirigé nos efforts de ce côté-là, afin d'attirer les enfants à l'école du R. P. Hugonnard. Celui-ci en a aujourd'hui un bon nombre : entre autres, les enfants de deux chefs.\n\nOutre les baptêmes que nous avons enregistrés, j'ai eu dernièrement le bonheur de baptiser, à l'insu de leurs parents, quatre petits enfants que je trouvais mourant et qui sont aujourd'hui dans le ciel, plaidant auprès du bon Dieu la cause de leurs pauvres parents infidèles.\n\nEnfin, quelques mots sur une autre Mission sauvage ; celle du Très-Saint-Cœur de Marie, au lac Croche, à environ 60 milles à l'est de Qu'Appelle. C'est la dernière dont je parle, mais elle est bien la première en importance, et je regrette vraiment de n'être pas à même de vous donner des statistiques qui puissent vous la faire connaître d'une manière plus exacte. Je n'ai pas les registres de cette Mission, qui sont conservés au lac Croche, et les PP. Page et Gampeau, qui seuls pourraient fournir\nles renseignements nécessaires, sont précisément en train de visiter cette Mission depuis la mi-décembre. Il y a là quatre réserves de sauvages, Sauteux et Cris, formant une population de 850 âmes. De là, les Pères desservent aussi un établissement de Hongrois, à une vingtaine de milles plus à l’est, et bon nombre d’autres blancs, épars çà et là. Au témoignage des deux Pères, les sauvages de ces réserves sont ceux qui se montrent le mieux disposés en faveur de la religion, et un missionnaire qui résiderait continuellement au milieu d’eux aurait de grandes chances de les convertir. De cette résidence, le missionnaire pourrait aussi aller visiter trois autres réserves de sauvages Assiniboines et Cris, situées à la montagne d’Orignal, à 60 et 80 milles au sud du lac Croche. Jusqu’à présent il ne nous a été possible de faire que quelques apparitions bien courtes chez ces sauvages. Comme nos autres Missions, celle du Très-Saint-Cœur de Marie est travaillée par le ministre protestant, qui réside auprès des sauvages et qui cherche à les gagner par toutes sortes de moyens. Il a peu réussi jusqu’à présent, mais nous craignons beaucoup que ces sauvages ne finissent par se laisser attirer par les dons de tout genre qu’il leur prodigue.\n\nLe P. Page, qui a passé deux ans dans cette Mission, y a fait construire, l’année dernière, une petite chapelle et une autre bâtisse attenante à la chapelle pour la résidence des missionnaires. Ce même Père y avait trouvé des ressources suffisantes et s’était procuré la plupart des choses nécessaires pour faire de cette Mission une assez bonne résidence ; mais, à cause du nombre trop limité de missionnaires, il a dû être rappelé à Qu’Appelle, où résident actuellement tous les missionnaires, et d’où ils rayonnent dans les différentes Missions sauvages, en attendant que du renfort nous permette d’éta-\nblier des résidences fixes, au moins dans les principaux centres. Vous avez remarqué que toutes ces Missions sont placées sous le patronage de la très sainte Vierge. Ainsi groupées, et formant comme une couronne autour de notre Mission centrale dédiée au Sacré Cœur, nous avons toute confiance qu'elles seront bénies et que notre bonne mère du ciel, à qui elles sont confiées, saura attirer à son divin Fils les âmes dont ses missionnaires la chargent.\n\nJe ne saurais terminer cet exposé sur nos Missions sauvages sans parler de l'école industrielle de Qu'Appelle qui est peut-être l'œuvre la plus importante de toutes nos Missions, tant pour le bien qu'elle produit actuellement que pour les résultats plus grands à espérer dans l'avenir. Cette institution est une œuvre bénie de Dieu, et nous, missionnaires, qui avons la consolation de voir de près le bien réel opéré par son moyen au milieu des sauvages, nous ne saurions trop remercier le bon Dieu et ceux qui ont contribué à nous procurer un moyen si efficace de civilisation et d'évangélisation.\n\nLe programme de cette école répond exactement aux besoins actuels des sauvages. Outre l'instruction qu'ils y reçoivent comme dans les autres écoles, leurs enfants y sont initiés aux différentes branches de l'industrie. Ainsi formés, ils pourront vivre honorablement plus tard, et feront des citoyens utiles à la société. Mais c'est surtout au point de vue de la religion que cette école a une importance majeure et qu'elle est appelée à donner les résultats les plus consolants, tant pour les enfants mêmes, qui y sont formés aux habitudes de la vie chrétienne, que pour leurs parents et amis, vivant sur les réserves.\n\nMsr Taché dit dans son rapport de 1887 : « L'impression favorable, que les enfants de l'école font sur les tribus\ndans les rangs desquelles ils sont recrutés, contribue évidemment au mouvement heureux vers la grâce, qui se remarque depuis quelque temps parmi ces sauvages. »\n\nCette assertion est très vraie. Déjà notre institution a fait mûrir des fruits précieux de sanctification. Les sauvages commencent à comprendre que bientôt il leur faudra renoncer à leurs superstitions et adopter les coutumes et la religion des blancs.\n\nSollicités par un grand nombre de sectes, ils se demandent de quel côté est la vérité, où est la vraie religion du Grand Esprit. À l’école industrielle, ils ont entendu la réponse de Notre-Seigneur Jésus-Christ aux envoyés de Jean-Baptiste : *Surdi audiunt, mortui resurgunt, pauperes evangelizantur*. Ils ont pu voir à l’œuvre le véritable prêtre, comparer son zèle, sa charité et son dévouement, bien connus d’eux tous, avec le faux zèle et le prosélytisme du ministre de l’erreur. Ils ont pu voir à l’œuvre l’humble cœur de charité, et admirer l’abnégation, le dévouement et la piété personnifiée dans ces femmes de la prière, comme ils les appellent ; et ils ont pu reconnaître bien vite où est la véritable religion.\n\nAprès avoir admiré, ils sont allés rapporter cette réponse à leurs frères de la Prairie. Plusieurs fois je les ai entendus moi-même faire des remarques tout à fait favorables à notre sainte religion au sujet de cette école. Sans doute, les conversions n’ont pas encore été très nombreuses ; bien des difficultés, bien des préjugés, s’y opposaient ; cependant les ennemis de l’œuvre commencent à battre en retraite, et le prêtre, qui, il n’y a que trois ans, était reçu comme un être dangereux, est maintenant le bienvenu chez presque tous les sauvages.\n\nMais le bien direct que cette école est appelée à opérer, c’est surtout auprès des enfants, qui y sont formés aux habitudes de la vie chrétienne et qui nous préparent\nainsi des générations croyantes pour l'avenir. En les rendant bons chrétiens, on en fait aussi des auxiliaires précieux pour le missionnaire. Retournés dans leurs réserves, ils ne pourront manquer d'exercer une grande influence auprès des leurs. Déjà des résultats de ce genre ont été obtenus par des enfants de l'école rentrés momentanément ou définitivement dans leurs familles. Par leur piété et leurs bons exemples, ils ont été l'étoile dont le bon Dieu s'est servi pour éclairer leurs pauvres parents infidèles et les appeler à la grâce de la foi. Les parents n'ont pu se soustraire à l'influence de la vertu qui brillait dans leurs enfants, ils n'ont pu résister longtemps à leurs sollicitations, et eux-mêmes sont venus adorer le Dieu des Priants. L'été dernier, le R. P. Campeau a eu la consolation d'instruire toute une famille, qui est aujourd'hui une excellente famille chrétienne. Celle qui, après Dieu, lui a ménagé cette consolation est une humble enfant de l'école industrielle, qui, voyant son père malade, est allée le visiter, lui a parlé de la beauté, des consolations et des espérances de notre sainte religion, et ne l'a quitté qu'après l'avoir déterminé à se faire chrétien. La conversion des autres membres de la famille n'a pas tardé à suivre, et aujourd'hui cette jeune indienne jouit de son bonheur. Revenue à l'école, elle édifie toutes ses compagnes par son bon exemple.\n\nD'autres enfants aussi, qui sont retournés auprès de leurs parents, produisent de très bons effets dans leurs réserves. Non, il n'est pas douteux que cette école ne soit appelée à faire un grand bien. C'est un moyen très efficace de procurer la gloire de Dieu et l'honneur de notre chère famille religieuse à qui cette œuvre est confiée.\n\nMais à l'heure qu'il est et avec les développements que l'établissement a pris, peut-être que quelques modi-\nfications seraient nécessaires, surtout pour ce qui a rapport au personnel de l'école. Le P. Hugonnard, qui est comme l'âme de toute cette institution, a beaucoup trop d'ouvrage maintenant, il n'est pas assez secondé par les employés laïques qui l'aident comme assistants. Le Père a trop à faire, et, pour tenir jusqu'à présent, il a fallu tout son zèle et toute son énergie bien connus. Mais ses forces s'épuisent, et il ne pourra certainement pas résister au train de vie qu'il mène. La seule surveillance ou administration extérieure de l'œuvre demanderait à elle seule tout le temps dont le Père peut disposer. Il a à s'occuper de tout et de tous. Tous, en effet, à l'école, s'adressent à lui, et à tout moment: les enfants, les sauvages, les agents et les autres employés du gouvernement, tous les employés de la maison. Les visites à l'école sont très multipliées, tant de la part des blancs que de la part des sauvages. Et il faut une attention toute particulière pour recevoir et traiter ces derniers. Chacun d'eux s'attend à être traité comme s'il était le seul à qui on eût à répondre. Puis, c'est toute une affaire que de dissiper leurs préjugés, et de gagner leur confiance. Si l'on veut trop brusquer, bonjour!... et c'est fini pour le sauvage et pour les enfants. Or, il faut savoir qu'il y a une moyenne de dix sauvages par jour, qui visitent l'établissement.\n\nOutre l'occupation ordinaire à l'intérieur de la maison, il y a les voyages, relativement nombreux et prolongés, du R. P. Principal, surtout dans les réserves sauvages; voyages nécessaires pour recruter des enfants et tenir les parents dans de bonnes dispositions, et aussi pour tenir tête aux ministres protestants, qui font des efforts inouis dans le sens de l'opposition : voyages qui font en outre beaucoup de bien, parce qu'ils disposent les païens en faveur de notre sainte religion. Enfin, il y a la corres-\npondance considérable à laquelle le Principal doit s'as-\ntreindre. Il suffit de connaître un peu la routine suivie\ndans les bureaux du gouvernement pour avoir une idée\nde cette correspondance et de l'assujettissement auquel\nelle soumet. Le Père a quelquefois quinze à vingt lettres\nofficielles à expédier à Régina.\n\nAvec cela, et bien d'autres occupations que je ne puis\nmentionner, le Père ne peut suffire à la tâche, et surtout\nil ne peut s'occuper comme il conviendrait de la partie\nprincipale de sa charge, c'est-à-dire de la direction et de la\nformation morale des enfants. Si, au moins, les assistants\ndu Père pouvaient le suppléer en cela. Mais eux-mêmes\ndemandent bien souvent à être repris dans leur conduite.\nLes Sœurs suffisent bien pour l'éducation des filles, et il\nn'est pas besoin de séjourner très longtemps à l'école\npour être frappé de la différence qui existe entre les\nfilles et les garçons sous le rapport de la civilité, de la\npiété et de tout ce qui constitue une éducation chrétienne.\nLa raison en est bien simple. Les filles trouvent chez les\nbonnes Sœurs qui les dirigent et les suivent continuelle-\nment, des cœurs qui les aiment, les avis et les instruc-\ntions dont elles ont besoin ; puis elles les voient mettre\nen pratique ce qui leur est enseigné. Les religieuses sont\nvéritablement pour elles des mères et des modèles.\n\nIl y a bien peu de tout cela avec les jeunes gens et les\nautres employés qui doivent seconder le Père, soit\ncomme assistants, soit comme patrons d'ateliers. Ils ne\ncomprennent pas leur mission. Ce ne sont en réalité\nque des mercenaires, qui feront justement assez pour\nconserver leur position. Et je crois qu'il est bien difficile\nde trouver mieux chez les laques. Ces assistants ne\ndonnent pas toujours le bon exemple comme ils devraient\nle faire dans la position où ils sont. Ils feront bien ce qui\nest nécessaire pour accomplir la lettre des commandes-\nments, mais c'est tout. Ils ne surveillent pas suffisamment les enfants, et bien souvent, pendant les absences du P. Hugonnard, j'ai vu les enfants laissés complètement seuls des demi-journées entières. Il est facile de comprendre les conséquences qui doivent suivre de cela.\n\nIl me semble qu'il serait nécessaire de donner au R. P. Hugonnard un autre Père pour le seconder. Il y a abondamment de l'ouvrage pour deux, vu le nombre considérablement grand des enfants qui doivent être formés à cette école. Actuellement, il y en a cent quarante, et ce nombre ira toujours en augmentant. La présence d'un autre Père assurerait au P. Hugonnard les avantages de la vie de communauté. Puis, ce nouveau Père, tout en s'occupant de la direction et de l'éducation des enfants, pourrait exercer un ministère continuel auprès des sauvages qui visitent l'établissement par centaines chaque année. Là, les circonstances sont plus favorables que partout ailleurs pour faire du bien aux sauvages, dissiper leurs préjugés, et les déterminer à se convertir.\n\nLoin des leurs, ils sont à l'abri du respect humain ; puis le bon accueil et les soins qu'on leur donne les disposent toujours bien favorablement à l'égard de notre sainte religion. Quelle facilité, en outre, de faire connaissance avec eux et d'apprendre leur langue! Ce serait ainsi un apostolat continu et très fructueux. Mais actuellement nous n'avons pas de Père à mettre là. Et puis, il faudrait pour cela avoir l'autorisation du gouvernement.\n\nEn 1888, il y a eu à l'école industrielle 9 baptêmes, 13 premières communions, 31 confirmations et 3 sépultures. Mais il est temps que je termine cet exposé déjà bien long.\n\nPar tout ce qui précède, vous avez pu voir, mon très révérend Père, que l'ouvrage ne manque pas ici. Et il ne manquerait pas pour quatre ou cinq missionnaires de\nplus, Le R. P. Saint-Germain, déjà âgé, a assez d'occupation avec ses chers chrétiens de la Montagne de Bois. Le R. P. Hugonnard a plus qu'il ne peut faire à l'école industrielle. Le reste de la basogne est pour les quatre Pères de la maison du Sacré-Cœur : c'est-à-dire visiter plus de 4500 âmes dispersées sur une superficie de plusieurs milliers de milles carrés. Comme l'indique le tableau qui accompagne cette lettre, il y a dans notre district, sans compter la Montagne de Bois et la Mission du Sacré-Cœur, vingt-huit postes (établissements de blancs ou réserves sauvages) qu'il faudrait visiter séparément. Sur ces 28 postes, 24 au moins sont isolés de tout autre à une distance de plus de 10 milles ; 10 le sont à plus de 40 milles, et 5 le sont à plus de 100 milles.\n\nÉvidemment, il nous est impossible de les visiter tous et d'y avoir partout des Missions régulières jusqu'à ce que nous soyons un plus grand nombre de missionnaires. Ainsi, sur ces 28 postes, il y en a 6 que nous n'avons pas encore pu visiter ; il y en a 14 que nous n'avons pu visiter que transitoirement. Pour les 8 autres postes, nous les visitons régulièrement, et un des missionnaires y réside assez longtemps trois ou quatre fois par an.\n\nNos occupations comprennent donc : 1° le ministère paroissial que nous exerçons à la Mission du Sacré-Cœur (lac Qu'Appelle) ; 2° les visites mensuelles à Saint-Joseph de Dauphinois ; 3° les visites semi-mensuelles chez Ross, et bon nombre d'autres visites auprès des colons groupés en différents endroits du district. Isolés, comme ils le sont, loin de l'Église, entourés de protestants, ils demandent des soins et une surveillance toute particulière ; 4° les visites et la desserte des Missions sauvages.\n\nToutes nos Missions ici ont leur contingent particulier de besoins et de travaux, et rien de plus vrai que ce que Mgr Taché dit dans son rapport de 1887. « Ceux qui\nexercent le saint ministère au milieu de populations homogènes, définitivement établies par groupes nombreux, ne peuvent guère se faire l'idée de ce qu'il faut de travail, dans nos déserts, pour acquérir la connaissance des langues, courir en tous sens après des familles dispersées, et traiter avec des nations nullement en harmonie de mœurs, d'habitudes et d'idées. »\n\nIl y a l'étude des langues; il nous faudrait savoir sept langues ici : le français, l'anglais, le hongrois, le cris, le sauteux, le sioux et l'assiniboine. Il y a les longues distances à parcourir pour visiter les nombreux postes. De fait, ce sont des voyages presque continuels pour deux ou trois des Pères. Il y a le nombre assez considérable d'instructions et de préparations au saint baptême pour les adultes, et à la première communion : préparations qui demandent beaucoup de temps ; d'abord, parce que nous trouvons toujours ces gens complètement ignorants des vérités de notre sainte religion et qu'il faut tout leur enseigner nous-mêmes, prières et catéchisme ; ensuite, parce que nous tenons beaucoup à bien instruire ceux que nous voulons admettre au baptême et aux autres sacrements. Un bon chrétien vaut mieux et fait plus de bien que plusieurs chrétiens à demi-instruits.\n\nQuelquefois, il nous faudra donner autant de temps, et même plus, pour instruire et préparer à la réception des sacrements 4 ou 5 personnes que d'autres en consacrent, dans les centres civilisés, à préparer 60 ou 80 enfants à la première communion. Ainsi, pour l'année 1888, nous avons eu 83 baptêmes et 70 premières communions (non compris le lac Croche) ; eh bien, sur ces 83 baptêmes, j'ai rencontré 9 cas différents où il a fallu donner aux catéchumènes une préparation spéciale. Pour les premières communions, il a fallu aller instruire les enfants dans cinq localités différentes, et préparer, en outre,\nd'autres personnes à domicile, pour des raisons qui les rendaient incapables de venir prendre part aux préparations générales.\n\nPuis, c'est la fondation et l'entretien de nos écoles, soit chez les blancs, soit chez les sauvages : rien ne se fait si nous n'y mettons la main. En réalité, il faut tout organiser nous-mêmes et quelquefois enseigner.\n\nEnfin l'économat absorbe beaucoup de temps. Le nombre des formalités de régence a été bien diminué depuis quelque temps, mais c'est encore une lourde charge et une grande perte de temps pour celui qui a le soin du temporel. Ce sont des dérangements presque continuels et il n'est guère possible, avec cela, de s'occuper à quelque chose de sérieux. On prend les meilleures résolutions le matin, et le soir arrive avant qu'on en ait exécuté la moitié.\n\nIl s'agit de pourvoir à tout : approvisionnement, frais de voyages, constructions, subsistance des différentes Missions et des missionnaires, etc. Il faut s'industrier pour trouver des revenus suffisants à l'entretien de nos œuvres. Actuellement, il serait nécessaire de construire des écoles ou des chapelles dans plusieurs de nos Missions ; et j'espère bien que nous y réussirons.\n\nPar ici, c'est à la lettre que nous réalisons notre devise « Pauperes evangelizantur ». Tous nos catholiques sont bien pauvres, blancs comme sauvages, et en général plus disposés à recevoir du prêtre qu'à lui donner. La peine qu'il faut prendre pour les habituer à l'entretien de leurs missionnaires, nous ferait volontiers renoncer au bénéfice que cela nous rapporte si nous ne considérions pas comme un devoir d'habituer nos catholiques à se charger de la subsistance du prêtre. L'économat, je le noterai aussi, est ici quelquefois une cause de difficultés pour l'exercice du saint ministère. Il faut absolument\nque le même Père s'occupe du temporel et du spirituel auprès de nos catholiques et, avec toute la bonne volonté possible, bien souvent nous ne pouvons éviter des froissements assez pénibles.\n\nÀ propos du temporel, je dois ici rendre justice à notre bon Frère Doyle, qui, malgré une santé très délicate, montre beaucoup de bonne volonté et de dévouement dans l'accomplissement de ses fonctions. Il est un peu notre factotum : cuisinier, boulanger, menuisier, sacristain.\n\nQue n'avons-nous plusieurs de ces bons Frères convers ! C'est là un désir que nous exprimons bien souvent ici. Quand nous voyons nos maisons de noviciat abondamment fournies de sujets, nous nous réjouissons bien cordialement et nous demandons avec anxiété si, de ce nombre, il n'y en aura pas quelques-uns pour nous ; nous attendons impatiemment le jour où quelques-uns de ces bons Frères coadjuteurs prendront la route de Qu’Appelle. À coup sûr, ils y seront les bienvenus.\n\nDans les conditions où nous nous trouvons à Qu’Appelle, vous comprendrez facilement que nos statistiques ne peuvent pas produire des chiffres aussi élevés que dans d’autres Missions. À cause de l’isolement de nos catholiques, il nous est impossible encore d’organiser de ces associations ou congrégations dont d’autres maisons s’honorent à juste titre ; mais cela n’empêche pas qu’il y a ici beaucoup de bien à faire. Et nous ne pouvons pas ne pas reconnaître que le bon Dieu bénit les travaux de vos enfants.\n\nEn 1888, nous avons enregistré : 1° 83 baptêmes dont 41 de sauvages, parmi lesquels nous comptons 18 adultes, 2° 70 premières communions, plus 13 à l’école industrielle ; 3° 188 confirmations. Sa Grâce Mgr Taché, qui n’avait pas donné la confirmation ici depuis deux ans, a eu le bon-\nheur de confirmer cette année 147 personnes, dont 30 étaient encore païennes il y a deux ans. Le R. P. Vicaire est allé lui-même donner la confirmation à 41 chrétiens, à la Mission de Notre-Dame de l'Espérance : en tout, 188 confirmations ; 4° un peu plus de 600 communions pascals ; 5° 11 mariages ; 6° 4 abjurations ; 7° 27 sépultures. Il y aurait encore à donner la statistique pour le lac Croche, mais je n'ai pas le registre de cette Mission.\n\nOutre les baptêmes publiquement enregistrés, il y a la catégorie de ceux que nous avons administrés, à l'insu des parents, aux enfants sauvages que nous jugions en danger de mort : environ une dizaine.\n\nEn sus de l'école industrielle, nous avons dans notre district 3 écoles pour les blancs, fréquentées par 140 enfants, et 2 écoles pour les sauvages, comptant 78 élèves.\n\nComme j'ai eu occasion de le remarquer à propos des Missions sauvages, il s'est opéré depuis quelque temps un grand changement dans les dispositions de nos indigènes et un mouvement marqué de conversion au christianisme. Cela n'est pas douteux pour quiconque, ayant pu les visiter il y a quatre ou cinq ans, voit ce qu'ils sont maintenant. Hélas ! les protestants s'en aperçoivent bien et les voilà qui font des efforts désespérés pour attirer ces sauvages dans le camp de l'erreur : magnifiques écoles, où les enfants reçoivent gratis pension, logement et instruction, voire même présents de toutes sortes : tout est mis en jeu. Sans doute ces moyens ne sont pas très propres à gagner la confiance des sauvages, mais ce n'en est pas moins une terrible tentation pour eux, si pauvres et naturellement si faibles devant l'appât des avantages matériels. Dans les seules limites de notre district, les protestants ont aujourd'hui sept écoles pour les sauvages.\nDans quatre de ces écoles, les enfants peuvent recevoir pension et logement. Bientôt ils en bâtiront une autre à Indian Head et le gouvernement fera construire à Regina, l’été prochain, une vaste maison pour y établir une école industrielle protestante. Et tous ces maîtres d’école sont des ministres, ou au moins des aspirants. Vous voyez que si le bon Dieu et notre bonne mère du ciel, à qui toutes nos Missions sont confiées, ne nous assistent pas d’une manière toute particulière, il y a bien à craindre pour ces pauvres sauvages. Il faut continuellement être sur le qui-vive pour garder nos pauvres catholiques contre les sollicitations de ces ministres de l’erreur. Pour leur tenir tête, il faudrait être plus nombreux et organiser nos Missions de manière à avoir des résidences fixes chez les sauvages, notamment à Notre-Dame de Bon-Secours, chez Paskwa, à Notre-Dame de l’Espérance (la montagne de Tondre) et au Très-Saint-Cœur de Marie (le lac Croche). Ces Missions seraient prêtes à recevoir chacune deux missionnaires, qui de là rayonneraient dans un certain nombre de réserves voisines. Les missionnaires surveilleraient et affermiraient dans la foi les catholiques que nous avons déjà. Et, quoique ne pouvant comme les ministres prodiguer les dons de la fortune, nous pourrions facilement montrer aux sauvages quelle est la religion qui inspire le véritable zèle et le vrai dévouement. Puis, ces résidences, qui aujourd’hui ne sont qu’une cause de dépenses continues sans revenus, pourraient, elles-mêmes, avec un peu d’industrie de la part des missionnaires, offrir des ressources presque suffisantes à leur entretien.\n\nLe bon Dieu nous bénit en nous donnant et en nous conservant tous la santé. Les PP. Campeau et Chaumont, dont la santé nous inspirait tant de craintes, il y a deux ans, sont maintenant bien portants ; et je puis vous\nassurer qu'ils tirent bon parti de ce don que Dieu leur accorde.\n\nNotre établissement, sans être très prospère, est en assez bonne condition. Nous avons encore des dettes, il est vrai, mais c'est que depuis cinq ans il a fallu renouveler toutes les constructions de la Mission et débourser, de ce chef, au moins 35 000 francs. Nous avons aussi acheté un certain nombre de terres, situées près de l'église, afin de les réserver pour l'établissement des futurs colons catholiques. Enfin, il nous faudra probablement faire encore de nouvelles dépenses pour bâtir des écoles et des chapelles dans les Missions sauvages.\n\nMais j'abuse trop longtemps de votre patience et je termine cette longue lettre. J'espère, mon très révérend Père, que l'intention avec laquelle elle est écrite me fera pardonner tout ce qu'elle a de défectueux.\n\nDaignez bénir tous vos enfants de Qu'Appelle et leurs œuvres. Je ne saurais affirmer que nous sommes des hommes parfaits, mais je puis vous dire que tous nous aspirons à le devenir, à être de bons Oblats. Une chose aussi que je puis assurer, c'est que l'union et la charité fraternelle règnent ici. C'est véritablement le quam bonum et quam jucundum quand nous pouvons nous réunir. La proximité de la voie conduisant aux Missions de Saint-Albert et du Mackenzie nous procure souvent le plaisir de donner l'hospitalité à plusieursde nos confrères, et Dieu sait si nous savons apprécier ce bonheur! C'est ainsi qu'à différentes époques, nous avons eu le plaisir et l'honneur de recevoir Nos Seigneurs Grandin et Clut, les RR. PP. Lacombe, Leduc, Gendreau et plusieurs autres.\n\nVeuillez agréer, etc.\n\nJ. P. MAGNAN, O. M. I.\n| LOCALITÉS OU AGRAVES | NOM OFFICIEL | NATIONALITÉ | DISTANCE de SORTIE RÉSIDENCE du S. C. | POPULATION |\n|----------------------|--------------|-------------|---------------------------------|------------|\n| Lac Qu'Appelle.      | Lebel, P. O. | Blancs de tentationnalité, sur-tout métis. | 1 mile.    | 560        |\n| Montagne de Lime.    | Saint-Joseph de Dauphiné. | Métis de langue française. | 30 N. E. | 190        |\n| Vallée de Qu'Appelle.| Blackwood, P. O. | Métis et ennemis. | 16 S.-E. | 756        |\n| Montagne de Bois.    | Willow Bench. | Métis et ennemis. | 148 S.-E. | 350        |\n\nRÈSERVES SAUVAGES\n\n| Nom | Sioux | O. | 200 |\n|-----|------|----|-----|\n| Notre-Dame de Lumières. | Standing Buffalo. | 15 | S.-O. | 192 |\n| Notre-Dame de Bon-Seours. | Paqawza. | Sauteux. | 30 | S.-O. | 187 |\n| Mus-Cow-Pe-Tungs. | Mos-kow-Pe-Tungs. | 45 | S.-O. | 314 |\n| Notre-Dame de Bon-Conseil. | Pin-Pot. | Cris. |\n| Location                  | Name                        | Tribe          | Population |\n|---------------------------|-----------------------------|----------------|------------|\n| File-Hills                | Notre-Dame des Anges        | Pec-Pee-Kee-Sis.| 15 N.-E.   |\n|                           | Okanese                     |                | 99         |\n|                           | Star Blanket                |                |            |\n|                           | Little Black-Bear           |                |            |\n|                           | Mus-Kon-Equohn               | Saulteux       |            |\n|                           | Gordon                      |                |            |\n|                           | Day Star                    | Cris.          |            |\n|                           | Kah-Wah-Kah-Toose           |                |            |\n|                           | Yellow Quill                | Saulteux       |            |\n|                           | White Cap                   | Sioux          |            |\n| Touchwood Hills           | Pas encore visités          |                |            |\n| Moose Woods               | Visités seulement en passant.| American Sioux |            |\n| Moose-Jaw                 | Pas encore visités          | Foremost-Man   |            |\n| Long Lake                 | Pas de nom chrétien         | Yellow Sky     |            |\n| Indian Head               | Très-Saint-Coeur de Marie   | The Man who Took the Coat | |\n| Crooked Lakes             |                             | Ochossawance   |            |\n|                           | Ka-Ke-Wista-How             | Saulteux       |            |\n|                           | Cowissess                   |                |            |\n|                           | Sakimay                     | Cris.          |            |\n|                           | Pheasant Rump               | Assiniboines   |            |\n|                           | Ocean Man                   |                |            |\n|                           | White Bear                  |                |            |\n\n*Note:* Il y a de plus un établissement de Hébreux à environ 30 milles à l'Est de la mission du Sacré-Coeur, et un bon nombre de métis et de blancs dispersés çà et là dans notre district établi près des différentes postes que nous avons à visiter régulièrement. Ce qui est à plus de cinquante familles la population étant sous nos soins chargés.\nP. S.—Voici quelques renseignements fournis, depuis, par les pères Campeau et Page sur la Mission du Très-Saint-Cœur de Marie (lac Croche). On y compte 355 catholiques, dont 120 Hongrois ; ce qui élève d’autant le chiffre de la population catholique donné dans ce rapport. Pour l’année 1888, il y a eu à la Mission du Très-Saint-Cœur de Marie 20 baptêmes, 17 premières communions, 4 mariages, 180 communions pascales, 5 sépultures : ce qui fait pour le district de Qu’Appelle en 1888 : 103 baptêmes, 89 premières communions, plus de 780 communions pascales, 13 mariages et 32 sépultures.\n\nMISSION DE SAINT-ALBERT.\n\nLETTRE DU R. P. RAPET, SUPÉRIEUR DE L’ILE-A-LA-CROSSE.\n\nMission Saint-Jean-Baptiste, Ile-a-la-Crosse,\nle 1er janvier 1889.\n\nRÉVÉREND ET BIEN CHER PÈRE,\n\nQu’il me soit permis, au commencement du nouvel an, de vous offrir, au nom de toute la communauté, nos meilleurs souhaits de bonne année. Daigne le Seigneur vous combler de ses plus abondantes bénédictions et vous conserver longtemps encore à l’estime et à l’affection de vos frères. Nous le désirons de tout notre cœur. Qu’il plaise à Dieu de nous exaucer !...\n\nDepuis le dernier rapport sur notre chère petite mission plus de dix ans se sont écoulés. Il est plus que temps, je pense, de vous donner un aperçu succinct sur les divers événements qui se sont succédé dans notre maison depuis la dernière lettre envoyée à l’administration générale par le si regretté P. Légeard.\n\nLa mort de ce bien-aimé confrère a fait un vide immense,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009641.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 48106, "total-output-tokens": 16640, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 856, 1], [856, 2676, 2], [2676, 4493, 3], [4493, 6402, 4], [6402, 8237, 5], [8237, 10028, 6], [10028, 11810, 7], [11810, 13649, 8], [13649, 15547, 9], [15547, 17337, 10], [17337, 19147, 11], [19147, 20982, 12], [20982, 22819, 13], [22819, 24718, 14], [24718, 26552, 15], [26552, 28405, 16], [28405, 30193, 17], [30193, 32053, 18], [32053, 33901, 19], [33901, 35792, 20], [35792, 37701, 21], [37701, 39529, 22], [39529, 41423, 23], [41423, 43291, 24], [43291, 45088, 25], [45088, 46831, 26], [46831, 48611, 27], [48611, 50462, 28], [50462, 52113, 29], [52113, 53034, 30], [53034, 55544, 31], [55544, 57046, 32]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]