[{"id": "01f1a844d56217b6945253aab291cde2b0f5ef24", "text": "MISSIONS DE LA SISKATCHewan.\n\nJOURNAL DE MONSEIGNEUR GRANDIN.\n\nMissions de Saint-Albert, 17 novembre 1869.\n\nMON TRÈS-RÉVÉREND PÈRE,\n\nJe pensais avoir au moins deux mois de repos et de tranquillité à Saint-Albert avant d’entreprendre mon long voyage du lac Caribou. J’en aurais profité pour faire mes lettres et étudier un peu. Mais, bernique ! Je n’ai bientôt plus qu’un mois à ma disposition et je ne vois guère de tranquillité possible pendant ce temps. C’est égal, au milieu du mouvement perpétuel où la patience se perd quelquefois, je vais commencer mes lettres. Je n’aurai pas même l’avantage du silence et de la solitude de la nuit, mes yeux ne me permettant plus guère d’écrire à ces heures-là.\n\nSans autre préambule, je vais reprendre mon journal de voyages et de missions où je l’avais laissé l’année dernière, à l’île à la Crosse. Je ne sais si je vous l’ai dit, j’ai séjourné à cette mission depuis le 15 mai jusqu’au 21 juin. Deux jours avant de partir, au moment où nous n’osions presque plus y compter, nous fûmes tous comblés de joie par l’arrivée de Mgr Faraud et de Mgr Clut. Bien qu’ils vinssent nous faire lever à deux heures du matin, nous ne trouvâmes nullement leur arrivée intempestive. Il n’y\navait alors que peu de sauvages au poste ; notre petite réunion de famille fut plus libre et nous pûmes nous occuper plus à l'aise des intérêts de nos missions, ce qui était le but de notre entrevue. J'oubliai, au moins pour un temps, les peines et les inquiétudes que me causaient la maladie du P. Légeard, et bien d'autres misères qui ne peuvent manquer à un vicaire des missions.\n\nArrivé le 19 juin, Mgr Clut partit le 20. J'étais presque jaloux de son bonheur : il allait vous voir et probablement assister au prochain concile. Le 21, je partais moi-même, laissant Mgr Faraud à l'île à la Crosse occupé de cette mission si éprouvée, en attendant les moyens de retourner dans son vicariat.\n\nJe laissais le P. Légeard malade, le P. Caer sur le point de retourner en France. Le Fr. Bowes était parti depuis huit ou dix jours en compagnie de quelques sauvages, pour tracer et ouvrir un chemin par terre depuis l'île à la Crosse jusqu'au lac Vert. Enfin je laissais le Fr. Guillet à la veille de s'engager pour les lointaines et pénibles missions du lac Caribou. Depuis ce temps, je n'ai encore pu recevoir une seule ligne de l'île à la Crosse, et j'ignorerai probablement jusqu'à la fin de janvier si ces chers voyageurs ont été heureux dans leurs pérégrinations et si le P. Légeard a pu se remettre de sa maladie.\n\nPour le Fr. Bowes, il se dirigeait vers le même point que moi ; seulement, je voyageais par eau et lui par terre. Il faisait de longs circuits pour éviter les lacs et les marais, s'ouvrant un passage la hache à la main. Je le rencontrai le 23, nous ne pûmes échanger que quelques mots. et le 27 il vint me rejoindre au lac Vert, mission de Saint-Julien, où je l'attendais depuis le 24. J'avais à reprendre dans cet endroit les chevaux que j'y avais laissés au mois de mai précédent et mes charrettes à l'autre extrémité du\nlac. Probablement nous ne serons plus exposés, une autre année, à laisser ainsi les chevaux et les charrettes à différentes places ; le Fr. Bowes nous assure que le chemin sera très-praticable ; il est à moitié fait et j’espère que la Compagnie le fera achever. Je regarde l’ouverture de ce nouveau chemin comme un avantage de la plus haute importance pour l’île à la Crosse. Il y a quatre ans, nous avons pu ouvrir le chemin du lac Vert à Carlton. Bientôt les Frères de l’île à la Crosse pourront aller chercher avec leurs bœufs, sans le secours de personnes à gages, leurs différentes marchandises, soit à Carlton, soit au lac la Biche, soit même ici à Saint-Albert. Ils ne feront point ce travail sans difficultés, mais les difficultés seront incomparablement moindres qu’elles n’étaient auparavant, et les frais seront aussi moins considérables.\n\nLe 4 juillet, je terminai ma petite mission au lac Vert, et le 5, nous nous mimes en route pour l’autre côté du lac. Le Fr. Bowes s’y rendit par eau afin de m’y devancer et de réparer nos charrettes ; moi, je dus, accompagné de mon jeune homme, conduire les chevaux par voie de terre, à travers un bois si touffu que, lorsque j’arrivai le soir à l’extrémité du lac, mes vêtements étaient en lambeaux.\n\nLe 12 nous arrivions à Carlton. Le Fr. Scollen m’y attendait avec les charrettes de Saint-Albert. Ce cher Frère avait accompagné le P. Dupin chez les Cris des prairies. Une fois sa mission finie, au lieu de m’attendre au fort Pitt suivant l’ordre qu’il en avait reçu, il était venu fort heureusement m’attendre à Carlton, tandis que le P. Dupin, avec un tout jeune homme, s’en retournait à saint Paul donner congé au P. Rémas, qui s’y ennuyait beaucoup. Je passai six jours à Carlton, très-occupé à confesser quelques centaines de personnes qui y étaient de passage. Le Fr. Scollen était chargé de préparer au baptême quelques vieilles\nsauvagesses, que j'eus la consolation de baptiser le jour de mon départ.\n\nLe 15, la caravane arrivait de la rivière Rouge ; une Sœur venant du Canada avec trois jeunes tertiaires en faisaient partie. Je recevais les marchandises que j'avais fait emballer à Paris ; mais, par suite d'un accident éprouvé au passage d'une rivière, j'avais perdu presque toutes mes notes et beaucoup d'adresses s'étaient effacées : il me fallut tout ouvrir pour faire le partage de chaque mission. Bien que je fusse aidé en cette besogne par nos chers Frères, elle m'occasionna tant de fatigue que j'en fus malade. Heureusement j'étais chez un digne ami qui, quoique protestant, nous est tout dévoué.\n\nPendant que je voyageais du côté de l'île à la Crosse, du lac Vert et de Carlton, nos Pères voyageaient et combattaient d'un autre côté.\n\nLe P. Dupin faisait son apprentissage parmi les Cris des prairies. Parti de Saint-Paul avec le Fr. Scolem et un tout petit jeune homme, ils errèrent pendant plusieurs jours sans pouvoir trouver le camp des sauvages qu'ils cherchaient. Enfin ils en rencontrèrent un, mais non celui qu'ils voulaient. C'était un camp de protestants, où l'on comptait quatre ministres avec leurs dames. Il paraît que, selon les idées de la secte (c'étaient des méthodistes), ces ministres, hommes et femmes, tenaient leurs assemblées en plein air afin de recevoir plus immédiatement les communications de l'Esprit. Nonobstant ce petit travers, le P. Dupin m'écrivait qu'il avait appris à être Missionnaire, en voyant la peine que prenait l'un de ces révérends pour former quelques chrétiens à chanter et à prier ; tandis que moi, ajoute-t-il, je ne pouvais que lire les sermons que le Fr. Scolem composait (en quoi il n'y a rien d'étonnant, puisque l'on sait que le P. Dupin est encore trop nouveau dans ces pays pour en connaître la langue).\nMais il paraît que le digne ministre ne les édifa pas toujours. La présence des Missionnaires catholiques le gênait; il voulut leur susciter des embarras. Il eut lieu de s'en repentir, car le Fr. Scolen, parlant facilement le cris et l'anglais, pouvait se défendre avec avantage. Le Frère fut attaqué publiquement, il répondit publiquement; le pauvre ministre sortit humilié du combat et, comme si ce n'était pas assez, il fut encore vertement blâmé par ses coreligionnaires. J'ai recommandé au P. Dupin et au Fr. Scolen de vous faire part des détails de cette mission.\n\nPendant que le P. Dupin et le Fr. Scolen étaient à la prairie, le P. Rémas s'ennuyait à Saint-Paul, complètement désert à cette époque. Pour charmer ses loisirs, ce cher Père, aidé du postulant A. Perraud, imagina de faire de la chaux, de réparer la maison et d'embellir la petite chapelle, en quoi il a parfaitement réussi. Personne, dit saint Paul, ne fait la guerre à ses propres dépens; or nos deux travailleurs n'avaient que du pé-mikan, c'est-à-dire de la viande sèche pour tout potage, tandis que dans le parc il y avait de la viande sur pied. Ils imaginèrent donc encore, toujours en vertu de la même faculté d'invention, peut-être quelque diable aussi les poussant, ils imaginèrent d'abattre une vache, et ils en virent la fin avant le retour du P. Dupin. Quand celui-ci revint au logis, nos deux amis passèrent huit jours à le plaisanter sur sa défunte vache, puis il partirent tous les deux pour le lac la Biche.\n\nDans le même temps, deux autres de vos enfants faisaient la guerre au diable sur un autre point de la prairie. Le P. André et le P. Fourmond suivaient nos métis dans leur chasse d'été. Eux du moins ne furent pas contrariés par des ministres protestants et n'éprouvèrent que des consolations. Je vous envoie la lettre que le P. André\nm'écrivait à son retour, et Votre Paternité pourra se faire une idée de leurs travaux.\n\nLe 17 juillet au matin, je m'éloignais de Carlton par nos moyens de grande vitesse, c'est-à-dire que j'étais à cheval et que Baptiste, ce jeune homme qui m'accompagne depuis dix ans, conduisait dans un wagon américain la religieuse dont j'ai parlé et une de ses compagne. Je comptais me rendre au lac la Biche et arriver encore à Saint-Albert en même temps que la caravane qui allait cheminer de son côté à petites journées. J'avais compté sans les accidents de route. La grande vitesse de nos pays est exposée à bien des retards. Plus de trois heures avant le coucher du soleil, nous traversions une rivière. L'essieu de notre voiture se brisa. Si c'eût été une de nos voitures ordinaires, la forêt nous aurait fourni une pièce de rechange, mais c'était une voiture de première classe et, à raison même de sa perfection, il était impossible de la réparer faute des outils nécessaires. Bref, après la recherche et l'appel à notre secours du Fr. Bowes, qui marchait du côté de la caravane, après des essais de réparations et des tentatives inutiles de nous remettre en route, il fallut renoncer à notre véhicule et prendre une charrette du pays. Malgré tous ces retards, nous arrivâmes le 28 au soir au lac la Biche.\n\nLe lundi 2 août, je prenais la direction de Saint-Albert, emmenant avec moi le postulant Perrault, qui allait y faire son noviciat, et laissant Baptiste pour le remplacer au lac la Biche.\n\nPendant deux jours, nous n'étions d'autre difficulté que celle de traverser une dangereuse rivière et, bientôt après, de nous trouver presque sans eau au milieu des marais et des lacs desséchés. Le 4, nous arrivâmes sur le chemin de Saint-Albert à peu près en même temps que la caravane. J'étais si fatigué, qu'au lieu de\nla devancer, je me joignis à elle et j’arrivai à Saint-Albert le 8 au soir.\n\nJe trouvai tout le monde heureux et joyeux. Les deux Pères qui avaient accompagné les chasseurs à la prairie, étaient de retour et avaient, comme moi, bien besoin de repos. Mon arrivée, l’arrivée des caisses et des lettres d’Europe apportèrent d’intéressantes distractions. Nous primes une octave de vacances. Nous finîmes notre retraite du mois le 14. Ce jour-là, le Fr. Perrault commença son noviciat. Dès le lendemain de l’Assomption il fallait se préparer à de nouveaux départs.\n\nEn effet, le 17 je partais pour Saint-Paul avec le Fr. Scolen. Quelques jours après, le P. André et le P. Bourgine devaient suivre les chasseurs à la prairie. Le P. Leduc, secondé par le P. Fourmond, restait à Saint-Albert, chargé de la colonie de ce nom, de la mission de Saint-Joachim, distante de trois lieues ; de la mission de Sainte-Anne, distante de douze ; chargé du noviciat auquel il faut faire la classe et donner une direction suivie ; chargé de conduire les travaux d’une grande culture ; chargé enfin de réaliser les préparatifs d’une construction d’église.\n\nLe 21 août à neuf heures du soir, le Fr. Scolen et moi nous frappions aux portes de la mission de Saint-Paul. Le P. Dupin était couché et se pressait peu de nous ouvrir. Pauvre Père ! il avait de bonnes raisons pour excuser sa paresse. Depuis plusieurs jours il était occupé à faucher du matin au soir. La mission était alors complètement déserte : il ne restait qu’un vieux sauvage aveugle rejeté par ses enfants et recueilli par nous. Le P. Dupin n’avait alors absolument personne auprès de qui il pût exercer son zèle. Je venais passer deux mois avec lui pour lui aider à faire la mission quand le temps en serait venu, pour me familiariser un peu avec la langue criée et sur-\ntout pour adoucir sa solitude. En attendant le retour de nos gens, nous lui aidâmes à faire ses foins, et je vous assure qu’il n’a pas souvent d’aussi bons ouvriers à sa solde, ni aussi faciles à contenter. Je lui demandai un jour ce qu’il allait me donner pour mon travail : « Monseigneur, me répondit-il, ce soir je vous donnerai un peu de sucre pour mettre dans votre thé, » Ainsi fut fait. Les métis ne sont pas si accommodants.\n\nLes foins terminés, j’ai fait dans les environs plusieurs excursions, dans le but de trouver un emplacement plus convenable que l’emplacement actuel pour la mission. Il faudrait rencontrer dans un rayon peu étendu une terre cultivable, une bonne pêcherie, du bois de chauffage et de construction. Il faudrait de plus que cet emplacement fût à la portée des sauvages. Malgré le nombre de mes courses, je n’ai pas rencontré ces avantages réunis. Du reste, n’étant pas en mesure d’opérer bientôt ce changement de résidence, nous continuerons d’étudier le terrain. La Providence fera sans doute aboutir nos recherches quand elle nous aura donné le moyen de les utiliser.\n\nJ’ai fait encore un autre voyage de quatre jours, à cheval, avec le Fr. Scolet et un sauvage. Cette fois je cherchais du sel. Nous avons beaucoup de peine à nous procurer cet article indispensable et je voudrais bien le trouver dans le pays, afin de diminuer nos énormes frais de transport. J’ai en effet rencontré un sel magnifique d’aspect et qu’on peut utiliser, je pense, mais non pour assaisonner les aliments.\n\nPendant mon séjour à Saint-Paul, le pauvre vieux sauvage aveugle dont j’ai parlé, a jugé à propos de se laisser mourir. Le P. André l’avait autrefois baptisé et n’avait pas cru alors qu’on put faire autre chose pour ce pauvre homme, peu capable d’instruction. Plus tard, le P. Rémas, après l’avoir instruit de son mieux, l’avait admis à\nla première communion. J'ai eu moi-même la consolation de le communier pour la seconde fois à l'article de la mort, et de lui donner la confirmation. Nous lui avons rendu tous les services que ses enfants lui refusaient. Nous l'avons veillé jusqu'au dernier soupir. C'est le Fr. Scolen qui lui a fermé les yeux. Nous étions absolument seuls pour lui rendre les derniers devoirs. Le P. Dupin a fait son cercueil, le Frère et moi l'avons enseveli, tous ensemble nous l'avons porté à notre chapelle, puis, après avoir chanté les prières du rituel, nous l'avons placé sur une charrette à bœufs et conduit au cimetière. Nous chantâmes encore les prières d'usage sur le corps auprès de la fosse. Enfin, le P. Dupin et le Fr. Scolen fermèrent la tombe pendant que je récitaïs avec eux le chapelet. J'avais dit en plaisantant au P. Dupin qu'un Evêque n'assistait pas à un enterrement, si ce n'était un enterrement de première classe. «Mais, comment voulez-vous, me dit-il, que nous chantions à deux, les trois nocturnes ?» Sans chanter les trois nocturnes, je crois que nous avons fait réellement un enterrement de première classe.\n\nCependant vers le commencement d'octobre, les sauvages arrivaient par bandes de dix et de vingt familles, passaient deux ou trois jours à la mission et s'en retournaient ensuite se nourrir de poissons à peu près à six lieues de là. J'ai pu me convaincre de trois choses pendant mon court séjour à la mission de Saint-Paul : d'abord que cette mission n'est point à la place qui convient. Malgré tous les travaux accomplis pour la culture du sol, la production ne rémunère pas les efforts. Ce qui est décisif surtout, c'est que les sauvages n'y peuvent résider longtemps. En second lieu, j'ai vu par moi-même qu'il y a du bien à faire parmi ces sauvages, trop souvent représentés comme inconvertissables à la foi et à la morale\nchrétiennes. Le P. Lacombe n'en a rien cru et il a bien fait. J'ai confessé un bon nombre de ces nouveaux chrétiens, et, bien que pour la plupart membres de familles infidèles, bien qu'ayant sous les yeux les plus tristes exemples, ils se confessaient en vrais chrétiens, et plusieurs en chrétiens instruits. Ils sont désagréables. Ils ne sont pas reconnaissants envers nous ; mais ce n'est pas ce que nous sommes venus chercher. Enfin, j'ai pu me convaincre que le meilleur moyen d'instruire et de christianiser les sauvages, ce n'est pas de les attendre dans un fort où ils vont faire leurs échanges, ou même dans un poste fixe quelconque; on peut dans ces circonstances faire du bien, mais seulement aux chrétiens et aux catéchumènes, nullement convertir les infidèles et les instruire ; ils ont alors trop de distractions. Le meilleur moyen, le moyen unique de convertir et d'instruire les infidèles c'est d'aller vivre avec eux, de les accompagner dans leurs divers campements pendant une partie de l'année. C'est une mission bien pénible, mais que l'expérience prouve être indispensable. Et je suis bien décidé pour ma part à essayer ce genre de vie et de ministère à mon retour du lac Caribou. Je ne serai pas le premier ; le P. Lacombe a montré que c'est possible, le P. Dupin et le Fr. Scollen ont marché sur ses traces et, dernièrement, tous ceux de vos enfants qui étaient réunis ici il y a quelques semaines, m'ont assuré avec un dévouement admirable que je pouvais disposer d'eux et les envoyer vivre à la prairie, soit avec les Cris, soit avec les Pieds-Noirs. Nous avons nos misères, bien-aimé Père, ce n'est malheureusement pas en cela que nous sommes le plus pauvres ; mais une chose bien consolante me paraît certaine : c'est que chacun est plein de zèle, de bonne volonté, de dévouement.\n\nCependant le temps de quitter Saint-Paul et de revenir à Saint-Albert arrivait. Le 17 octobre j'officiais à un petit\nposte situé à 6 lieues de Saint-Paul. Plusieurs des nouveaux chrétiens communièrent et quatre-vingt-sept reçurent la confirmation. Le lendemain je devais partir pour Saint-Albert, en compagnie du P. Dupin et du Fr. Scolen auxquels je tenais à procurer cette consolation. Mais, apprenant qu'une vingtaine de familles se rendaient à Saint-Paul, j'y renvoyai le Fr. Scolen qui, au lieu de huit à dix jours passés en famille, dut vivre pendant un mois, tout seul, au milieu des sauvages. Le P. Dupin et moi, nous arrivâmes à Saint-Albert le 20 octobre. Le P. André était de retour de sa mission de la prairie, le P. Bourgine ne se fit pas attendre ; le P. Végreville, venu du lac la Biche pour faire exécuter divers ouvrages de forge au Fort, demeura avec nous pendant toute la retraite annuelle. Nous nous trouvions ainsi réunis au nombre de sept Pères, deux Scolastiques et cinq Frères convers. Nous n'avions jamais atteint ce chiffre dans nos réunions, depuis que je suis Missionnaire. Le jour de la Toussaint, vous aviez parmi nous quatre nouveaux fils : le P. Fourmond faisait ses vœux perpétuels, le P. Bourgine des vœux de cinq ans, les FFr. Lambert et Grezeau leurs vœux d'un an. Nous avons tous répandu de bien douces larmes ce jour-là. Une pareille retraite couronnée par une semblable fête fait oublier bien des peines. Trois jours après nous avions encore un nouveau sujet de joie : le Fr. Doucet recevait les ordres Mineurs, et le Fr. Blanchet la tonsure. Après le dîner il fallut se séparer.\n\nÀ toutes ces fêtes, il manquait quelqu'un : le cher P. Lacombe. Depuis quelque temps il nous vient de Benton, ville toute nouvelle des États-Unis qui s'élève vers la source du Missouri, un certain nombre d'aventuriers ; ils affirment que Benton serait une voie avantageuse pour faire venir nos approvisionnements. Comme ces approvisionnements sont très-considérables et augmentent chaque\nannée en proportion de l'étendue donnée à nos missions, le transport est pour nous une source de dépenses extraordinaires que je rêve sans cesse de diminuer. Ce sont surtout les caravanes qui coûtent. Il faut en organiser trois avant que les marchandises nous arrivent : Mgr Taché en organise une pour aller les chercher à Saint-Cloud, dernière station du chemin de fer, une autre pour nous les amener de Saint-Boniface à Carlton, et il nous faut ici en équiper une troisième pour aller les chercher à cette dernière localité. Toutes ces caravanes doublent le prix de nos marchandises, outre que c'est surtout dans ce trajet que celles-ci sont endommagées ou gâtées. Ainsi cette année encore, tout le thé acheté pour les missions de mon vicariat s'est trouvé gâté arrivé à Saint-Boniface. C'est pour nous la monnaie usuelle, elle va nous faire défaut. Les marchandises de Mgr Faraud ont été aussi passablement endommagées. Vous savez l'accident qui m'est arrivé l'année dernière. Il est certain que si nous pouvions abréger ce voyage en caravane, nous ne manquerions pas de rendre nos pertes moins fréquentes et nos dépenses moins lourdes.\n\nJ'ai donc voulu savoir à quoi m'en tenir sur le chemin de Benton : j'ai envoyé le P. Lacombe, s'assurer de la vérité des rapports qu'on nous faisait. Il résulte de ses explorations qu'on peut se rendre aussi facilement d'ici à Benton que d'ici à Carlton. Cesseraient donc deux caravanes de moins. Si cher que soit le transport de la Nouvelle-Orléans à Benton, il ne peut évidemment équivaloir aux frais de deux caravanes. Ce n'est pas tout ; par cette voie les marchandises m'arriveraient directement à Saint-Albert, d'où il me serait bien plus facile d'approvisionner nos autres missions. Il est vrai que pour aller à Benton, il nous faut traverser un pays habité par des sauvages dangereux, il est vrai qu'il y aurait par ailleurs des dé-\npenses à faire : un agent à entretenir, etc. Néanmoins, je reste persuadé que, tout compte fait, nous dépenserions beaucoup moins. Ces sauvages, si dangereux qu'ils soient, n'empêchent pas un bon nombre d'étrangers d'aller et de venir entre Benton et nos contrées. Si le gouvernement canadien, maître, dit-on, de notre pays maintenant, n'ouvre pas de nouvelles voies de transport plus avantageuses que les anciennes, je ne doute pas qu'en peu d'années la voie de Benton ne soit aussi fréquentée que l'est aujourd'hui celle de Saint-Boniface et de Saint-Paul. J'attendrai, et dès que je verrai mon avantage quelque part, j'en profiterai.\n\nLe P. Lacombe a fait ce voyage promptement : il s'est rendu au Canada par cette voie et il est revenu par Saint-Boniface. Il serait arrivé ici pour la retraite annuelle s'il n'avait trouvé à Carlton toutes les marchandises de Mgr Faraud.\n\nLe P. Végréville avait organisé au lac la Biche une caravane pour aller les y prendre; mais la caravane de Saint-Boniface se faisant trop attendre, le P. Végréville était reparti avec ses chevaux et ses charrettes, en sorte que tous les effets de Mgr Faraud étaient condamnés à passer l'hiver à Carlton et pouvaient manquer d'arriver à temps à destination. Grâce au secours du digne M. Clarke de Carlton, le P. Lacombe put transporter toutes les caisses du vicariat Mackenzie jusqu'au Fort Pitt. Il est vrai que par suite de cela nous n'avons pas reçu les nôtres, mais ce retard a moins d'inconvénients pour nous.\n\nL'hiver approchait, il fallait se hâter; déjà la rivière charriaît de nombreux glaçons, le P. Lacombe, impatient d'atteindre le terme de son voyage, veut traverser cette rivière malgré le vent qui souffle avec violence. Tout à coup, au milieu de la rivière le bac vient à caler, deux ou trois charrettes sont entraînées avec leur charge par\nle courant, tout l'équipage est à l'eau. Le P. Lacombe et plusieurs hommes courent le plus grand danger. Non contents de sauver leur vie, ils veulent sauver leurs colis, ils ne s'en tirent qu'après avoir gelotté plusieurs heures dans une eau glaciale. Malgré cet accident qui avait failli être si funeste, le P. Lacombe arrivait ici le 5 novembre, après avoir passé une journée à Saint-Paul pour y installer sa sœur qui, elle aussi, vient se dévouer aux travaux de nos pénibles missions.\n\nAprès s'être reposé quelques jours à Saint-Albert, le P. Lacombe est parti ce matin pour le lac Sainte-Anne, il en reviendra demain avec le P. Bourgine; tous les deux se rendront ensuite à Saint-Paul; la le P. Lacombe prendra le P. Dupin et l'introduira chez les Cris, il s'en reviendra par Saint-Albert, et ira ensuite visiter les Pieds-Noirs.\n\nLundi dernier, 16 novembre, le P. André partait pour le fort la Montagne, mission de Saint-Liguori. Dans quelques jours le P. Fourmond se rendra à Sainte-Anne pour y passer l'hiver avec les deux scolastiques. Le P. Leduc fait le catéchisme. Et moi, tout en vous écrivant, je suis infirmier de deux de nos bons Frères qui s'avisent d'être malades bien mal à propos. Je ne suppose pas que leur état soit grave; cependant je ne laisse pas que d'être inquiet.\n\nJe ne vous ai pas parlé, bien-aimé Père, de notre mission de l'île à la Crosse; je n'en ai absolument pas de nouvelles depuis que j'en suis parti. J'ai reçu une seule lettre du lac Caribou. Le P. Gasté, qui avait été gravement malade, était alors très-bien. Le P. Le Goff était allé visiter le fort Cumberland et plusieurs autres postes. J'ignore complètement le résultat de ces missions. Ce que je n'ignore pas ce sont les privations de tous genres au prix desquelles elles se font, et le courage avec lequel\nvos enfants les supportent. Là, comme ici, dans tout le vicariat, vos fils, bien-aimé Père, sont vraiment dignes de la famille : tous absolument, je suis heureux de vous le dire, veulent le bien et s'efforcent de le faire.\n\nCarlton, 26 janvier 1870.\n\nMON TRÈS-RÉVÉREND PÈRE,\n\nLe 28 décembre dernier, je quittais de nouveau Saint-Albert pour me rendre au lac Caribou. J'ai passé à Saint-Paul des Cris où j'ai rencontré le P. Lacombe. Il revenait du camp des sauvages où il avait laissé le P. Dupin et le Fr. Scolen. Cette mission des prairies est réellement fructueuse mais aussi hérissée de difficultés. J'ai quitté Saint-Paul le 3 janvier, suis arrivé au fort Pitt, mission de Saint-François-Régis, le 9 ; j'y ai fait faire le jubilé aux chrétiens qui s'y trouvent. J'en suis reparti le 13, suis arrivé le 17 au matin au fort de la rivière Bataille : c'est un nouveau poste où j'ai trouvé un grand nombre de métis libres, sans compter les serviteurs de la Compagnie. Quelques jours plus tôt, j'y aurais trouvé un nombreux camp de sauvages. J'y ai passé quatre jours bien occupé. La Compagnie n'a pas encore de fort véritable à cette place ; elle y redoute les Pieds-Noirs. Le chef-traiteur pense qu'une mission catholique serait pour le fort une plus sûre protection que tous les bastions possibles. Tout me manque pour fonder de nouvelles missions. J'ai cependant promis, si on voulait nous bâtir une maison dans le fort, d'y envoyer un Père ou deux qui évangéliserait les postes où je n'ai fait que passer. On devrait de plus nous assurer un terrain spacieux, pour y fonder une mission quand nous en aurions les moyens.\n\nJe suis arrivé à Carlton le 22. J'aurais voulu aller à une\njournée de marche plus loin où se trouve un village de métis, mais impossible ; le ministère et mon courrier ne me le permettent pas.\n\nJ'ai reçu d'excellentes nouvelles de l'île à la Crosse et du lac Caribou. Le P. Léger dont la santé m'inquiétait si fort, est parfaitement rétabli, et il en profite, ainsi que tout le monde, pour la plus grande gloire de Dieu. Pour moi, mon révérend Père, j'ai repris ma vie de voyages et de campements. Depuis Saint-Paul jusqu'ici, le froid a été des plus piquants : un de mes hommes s'est gelé le pied ; peu s'en est fallu qu'il ne fût infirme pour la vie : c'est ce jeune homme qui est avec moi depuis tant d'années. Heureusement il s'est aperçu à temps de l'envahissement du froid, il a pu se dégeler et se réchauffer, et il continuera son voyage. Le même jour, deux métis de la rivière Bataille se gelaient, l'un la main, l'autre les deux pieds. Ce dernier perdra probablement au moins les orteils.\n\nEn me rendant au lac Caribou, je passerai à l'île à la Crosse, et y séjournerai quelque temps. Malgré notre pauvreté, je voyage plus en grand seigneur que je n'ai jamais fait jusqu'à présent : je suis accompagné de deux hommes capables, j'ai quatre chiens pour me traîner, autant que les chemins et le froid le permettent.\n\nJe suis avec le plus profond respect, mon très-révéré Père, votre fils dévoué et obéissant.\n\n† Vital, O. M. I.,\nEvêque de Satala.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009566.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 23754, "total-output-tokens": 8549, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1218, 1], [1218, 3057, 2], [3057, 4946, 3], [4946, 6789, 4], [6789, 8618, 5], [8618, 10434, 6], [10434, 12248, 7], [12248, 14104, 8], [14104, 15955, 9], [15955, 17880, 10], [17880, 19771, 11], [19771, 21653, 12], [21653, 23486, 13], [23486, 25288, 14], [25288, 26971, 15], [26971, 28364, 16]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]