[{"id": "186fe9ce36e1a806341a0b33c2efd15fa0e2d5ce", "text": "l'auteur de ces lignes s'estimera heureux d'avoir été choisi de Dieu pour faire entrer dans l'Église les prémices de la tribu des Onéidas en les instruisant et en les préparant à la grâce du baptême, et ce sera pour lui une consolation d'avoir été le premier prêtre qui ait offert le Saint Sacrifice et fait couler le sang de la divine Victime sur cette terre livrée depuis de si longues années à l'hérésie et à l'infidélité. Ce sera un nouvel accomplissement de l'oracle du Prophète : *Lætabitur deserta et invia, et exultabit solitudo et florebit quasi lilium. Germinans germinabit et exultabit lætabunda et laudans* (Is., ch. XXXV) : « La terre qui était déserte et sans chemin se réjouira, la solitude tressaillira d'allégresse et fleurira comme le lis. Elle produira des germes abondants et éclatera en accents de joie et de louange. » Puissions-nous voir bien-tôt la réalisation de ces vœux !\n\nBurtin, O. M. I.\n\n---\n\nVICARIAT DE SAINT-BONIFACE.\n\nLETTRE DU R. P. CAMPEAU AU R. P. BOISRAMÉ,\nMAÎTRE DES NOVICES A NOTRE-DAME DES ANGES (LACHINE).\n\nLac Qu'Appelle (Lebret), le 21 février 1889.\n\nMon révérend Père,\n\nQuelques détails sur nos missions vous feront-ils plaisir ? J'ose l'espérer. Et d'abord vous serez heureux d'apprendre que le bon P. Chaumont, maintenant bien rétabli, est devenu le missionnaire infatigable des Sioux. Il possède déjà assez bien la langue pour enseigner le catéchisme, les prières, et même pour entendre les confessions. Il a passé, parmi les Indiens de cette tribu, les mois de décembre, de janvier et une partie de février,\ntout occupé à instruire les enfants et quelques adultes des grandes vérités de notre sainte religion. Ces Sioux, établis à une dizaine de milles de notre résidence, sont au nombre de deux cents. Ils montrent les meilleures dispositions et donnent les plus belles espérances. Déjà un grand nombre d'enfants de cette Réserve ont été baptisés. Plusieurs adultes ont aussi reçu le saint baptême, et quelques-uns sont morts, depuis, dans de saintes dispositions. Le R. P. Supérieur a l'intention de bâtir, dans leur Réserve même, une petite école industrielle, qui sera dirigée par les Sœurs grises. Nous comptons déjà environ quarante enfants sioux prêts à y entrer, dès qu'elle sera ouverte. Inutile de vous dire que le P. Chaumont secondé fortement les desseins du R. P. Supérieur. Il faut le voir, le crayon à la main, tracer les plans, calculer les quantités de pierres ou de bois qui doivent entrer dans la future construction. Pour encourager le R. P. Supérieur, il termine invariablement ses calculs par ce mot : « Ça ne coûtera pas cher. »\n\nLe R. P. Supérieur, tout en dirigeant la paroisse, mission du Sacré-Cœur, tout en veillant à ce que nous ne manquions de rien pour nos voyages et nos missions, voit de temps en temps à la montagne de Lime, nouvelle mission sauvage établie à 20 milles environ de notre résidence. Dieu a daigné l'encourager et bénir ses travaux. Il compte déjà quarante-six catholiques. C'est Notre-Dame des Anges (tel est le nom de la Mission) qui lui amène ces pauvres enfants des bois, pour qu'il les instruise et qu'il les baptise. C'est elle aussi qui les défend contre les séductions de l'erreur. Le ministre presbytérien a bâti, cet été, dans cette Réserve, une magnifique école en pierre ; mais, malgré tous les présents qu'il a prodigués aux sauvages, il n'a pu avoir, jusqu'à ce jour, un seul enfant. Il finira bien par en obtenir\nquelques-uns ; mais aucun de ces enfants ne consentira jamais à se faire protestant.\n\nLe R. P. Hugonnard, principal de l'école industrielle de Qu'Appelle, grand homme du gouvernement, le kitche mekateokonate, le grand prêtre, comme l'appellent nos sauvages, réussit toujours au delà de toute espérance. L'an dernier, il demandait au gouvernement d'agrandir son école, déjà trop petite pour contenir les enfants sauvages venus de toutes les Réserves. Cet été, le gouvernement a construit, pour les petites filles, une bâtisse qui a coûté près de 13 000 piastres, dit-on. Déjà il n'y a plus de place, et le nombre des enfants fixé par le gouvernement est dépassé. Cette école est vraiment une merveille pour nous. C'est là que se forment, pour l'avenir, des chefs de familles catholiques, qui iront ensuite s'établir dans les nombreuses Réserves qui nous entourent. Cette école est pour nous d'une importance majeure. C'est le moyen le plus sûr et le plus efficace de civiliser et de christianiser les sauvages. Aussi chacun de nous se fait-il un devoir d'attirer le plus grand nombre possible d'enfants. Grâce à Dieu, nos catholiques nous ont grandement consacrés à ce sujet, car, malgré les efforts inouis en sens contraire, malgré les promesses réitérées des ministres qui nous entourent, tous nos enfants catholiques sont abrités contre l'erreur, soit dans cette école, soit dans les écoles catholiques des autres Réserves. Vraiment le doigt de Dieu est là. Les ministres leur offrent des habits, des couvertures, des animaux même ; les sauvages, naturellement, aiment beaucoup à recevoir, ils sont très pauvres, ils souffrent parfois même de la faim, et cependant ils trouvent dans leur foi et dans leur amour pour la vraie religion le courage quasi-héroïque de refuser tous ces avantages pour sauvegarder l'âme de leurs enfants. Bon nombre de païens imitent l'exemple de nos\ncatholiques. Aujourd'hui, nous comptons près de cent quarante enfants dans l'école industrielle de Qu'Appelle.\n\n*Soli Deo honor et gloria!* La semaine prochaine il y aura grande fête. Une des filles de l'école des Sœurs doit se marier avec notre engagé, bon métis catholique.\n\nQue vous dire encore ? Vous parlerai-je de mes courses continues chez Paskoua, à la montagne et au lac Croche, Missions confiées à mes soins ? Trois Missions, c'est beaucoup pour le personnage que vous connaissez ; et encore, lorsque je les visite, ne puis-je me contenter de mes chrétiens ; il faut passer dans les autres Réserves et envahir le champ d'action de mes voisins, qui, je vous l'assure, ne sont pas jaloux. Dans le mois d'août, Touch-Wood a donné au R. P. Camper un baptême d'adulte et quarante et une confirmations. Cette Mission possède également une école régulièrement fréquentée par plus de trente enfants. M. Dennegs, qui la dirige avec zèle et dévouement, a obtenu jusqu'à ce jour les meilleures notes des inspecteurs protestants. Cet excellent maître prépare en ce moment quelques sauvages au baptême, pour ma prochaine excursion apostolique.\n\nÀ Paskoua, j'ai eu aussi, cet été, quelques baptêmes, entre autres celui d'un adulte, mort ensuite dans de bonnes dispositions. Dernièrement, au lac Croche, dans le mois de janvier, j'ai baptisé une vieille jolie Sauteuse, âgée d'environ quarante et quelques années. Trois autres adultes m'attendent pour ce printemps. Pendant que j'étais occupé à instruire mes sauvages du lac Croche, le P. Page, mon compagnon, visitait les blancs dispersés au loin, puis venait passer une quinzaine de jours chez les Thongrois, bons catholiques établis à 23 milles de White-Wood. Le bon Dieu a béni son ministère. Il a eu la consolation d'instruire et de baptiser une adulte protestante. Vous le voyez, révérend Père, tous vos anciens\nnovices, actuellement à Qu'Appelle, font vaillamment leur devoir au poste que l'obéissance leur a assigné. Quel bien nous pourrions opérer au milieu des sauvages, si nous étions plus nombreux ! Partout où j'ai été, à la montagne de Lime, chez Paskoua, au lac Croche, j'ai entendu le même cri : « Père, nous ne voulons pas prier la prière des protestants, c'est la robe noire qu'il nous faut. » Au fort Ellice, où j'ai été dernièrement pour payer une courte visite au P. Decorby, les sauvages protestants eux-mêmes nous invitent à venir dans leurs Réserves ; ils nous confieraient leurs enfants, si nous pouvions avoir une école industrielle ou un internat. Je suis persuadé que partout les païens seraient heureux, eux aussi, de nous confier leurs enfants, si nous pouvions résider dans les centres de missions et avoir des écoles. Dernièrement, les habitants du lac Croche envoyaient au R. P. Camper une pétition, signée de deux cent vingt-sept catholiques et de plusieurs païens influents, demandant avec instance que des prêtres viennent résider au milieu d'eux. « Hâte-toi, disaient-ils, d'envoyer des prêtres au milieu de nous. Tu le sais, nous aimons notre religion, nous aimons la robe noire. Mais qu'il est triste de passer des semaines et des mois sans voir la robe noire ! Qu'il est triste le dimanche pour nous ! Qu'il est triste d'être malades et de n'avoir pas près de nous la robe noire pour nous encourager et nous assister ! Tu le sais, il y a encore ici autour de nous bien des sauvages qui ne prennent pas. Le ministre protestant essaye de les tromper par tous les moyens possibles ; mais ils ne prieront pas la prière protestante. S'il y avait des prêtres ici, ils finiraient tous par prier comme nous. » Hélas ! pourquoi faut-il que notre petit nombre ne nous permette pas de profiter davantage des dispositions de ces bons sauvages, évidemment touchés de la grâce ! Filii petierunt panem, et non erat qui frangeret\n... Presque à chacune de mes visites nous avons la joie de donner le baptême à quelques païens soit enfants soit adultes. Quelle moisson ne recueillerions-nous pas, si nous pouvions résider au milieu de ces pauvres gens! Ah! mon révérend Père, priez pour nous, priez pour nos sauvages! *Mossis quidem multa, operarii autem pauci.*\n\nTH. P. CAMPEAU, O. M. I.\n\n---\n\n**UNE CONVERSION.**\n\nSous ce titre, nous lisons dans la *Semaine religieuse de Grenoble*: Notre compatriote le R. P. Hugonnard, missionnaire oblat de Marie, nous adresse de l'école sauvage industrielle du lac Qu'Appelle (Amérique du Nord), à la date du 22 mars 1890, l'intéressant récit suivant:\n\nPaskoua (ou Paskoi) était un des principaux chefs sauvages qui signèrent le traité avec le gouvernement canadien en 1874. Il choisit sa Réserve à l'ouest du fort Qu'Appelle, le long des lacs, à 16 milles de notre école sauvage. Il avait alors six femmes et vingt-huit enfants. Un pareil ménage devait nécessairement le tenir éloigné de notre sainte religion; aussi personne ne la détestait plus que lui. Il était, de plus, profondément attaché à ses superstitions dont la principale, appelée *danse du soleil*, est pour les sauvages, un acte de culte public rendu au démon. Plusieurs fois, chaque année, Paskoua y convoquait sa bande, et tous devaient y assister, car il ne permettait à aucun de ses sauvages de se faire catholique.\n\nCependant, en 1880, une femme de sa Réserve se convertit à son lit de mort, grâce, sans doute, aux prières d'un de ses enfants décédé l'année précédente après avoir reçu le baptême, et à une médaille de la sainte Vierge dont elle avait hérité de ce même enfant. Avant de mou-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009644.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8948, "total-output-tokens": 3289, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1557, 1], [1557, 3425, 2], [3425, 5304, 3], [5304, 7167, 4], [7167, 9103, 5], [9103, 10772, 6]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]