[{"id": "bad5354c12182125572446388241c1175dab4ef7", "text": "LETTRE DU R.-P. LACOMBE,\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nVicariat de la Saskatchewan, mission de Saint-Paul des Cris, 12 mai 1870.\n\nLe R. P. Lacombe ouvre sa relation en nous manifestant les sentiments de bonheur dont son âme est consolée. Il se plaît à nous dire combien il aime sa vocation et le ministère qu’il remplit auprès des sauvages. Déjà, dès sa première enfance, l’affreuse misère de ces familles errantes, privées tout à la fois des biens de la vie présente et des espérances de la vie future, avait le privilège de l’émouvoir et de lui inspirer une compassion profonde. Plus tard, la pensée de se dévouer à l’évangélisation des contrées du Nord donna un commencement de satisfaction à ce sympathique entrainement. Enfin, aujourd’hui le Missionnaire surabonde de joie, au sein des privations et des souffrances inséparables de ses travaux, puisque à ce prix il lui est donné d’enfanter à Jésus-Christ des âmes pour lesquelles, selon son expression, il semble qu’il a été fait exprès. Sa santé n’a fait que s’affermir. Les marches forcées, les longs voyages à la raquette, la faim, le froid n’ont ébranlé ni son tempérament ni sa résolution. L’hiver dernier il a fait comme en jouant 900 milles, c’est-à-dire environ 300 lieues, en grande partie sur la neige, raquettes aux pieds. L’étude des langues, accompagnée pour l’ordinaire de tant de dégoûts et de si fréquents découragements, n’a pas eu pour lui de graves difficultés.\n\nLe P. Lacombe se reconnaît redevable à la divine Providence de tous ces avantages et se propose, en conséquence, de travailler avec une ardeur croissante, au salut des âmes.\nVoici maintenant sa relation :\n\nMON TRÈS-RÉVÉREND ET BIEN-AIMÉ PÈRE,\n\n« L'automne dernier, après avoir rendu compte à Mgr Grandin de la mission que Sa Grandeur m'avait confiée, et qui était de trouver une nouvelle voie de transport entre les pays de la côte orientale et nos contrées, par le Missouri ou le long de ses bords, je revenais à Saint-Paul des Cris pour préparer notre mission d'hiver. Je devais aller installer le P. Dupin et le Fr. Scollen chez les sauvages des prairies. En quelques jours nos préparatifs furent faits. Trois chevaux, deux trains, longues de 12 pieds et larges de 44 pouces, une tente de cuir, un poêle en tôle, des provisions de bouche et nos couvertures en pelletteries composaient tout notre attirail. Le lendemain de la fête de l'Immaculée Conception, nous nous mettions en route, la joie dans le cœur, le froid sur la figure.\n\n« Après neuf journées de marche, nous arrivions au camp des Cris, à la grande satisfaction de tout le monde. Il y avait cent loges qui formaient un village volant. Notre tente fut dressée au milieu, comme devant être la maison de Dieu et de la prière. Les quelques jours que je devais passer là pour initier le P. Dupin, je les employai à préparer les sauvages à la fête de Noël. Tous les jours nous disions la messe. Notre tente de cuir pouvait recevoir jusqu'à cent personnes : elle se remplissait plusieurs fois, et j'affirme que malgré la rigueur de la saison, nous n'y avions pas froid. Enfin la nuit de Noël arriva. Grande excitation dans le camp. Malheur à qui serait resté endormi ! Tout le monde voulait saluer l'enfant Jésus à minuit ; il fallait être prêt.\n\n« Laissez un instant Paris, mon bien-aimé Père, mettez vos habits d'hiver et venez visiter notre camp. Quelle\nnuit claire et brillante ! mais surtout quel froid ! Voyez-vous ces cônes de neige disposés par ordre à peu de distance les uns des autres, avec un panache de fumée sur chacun d’eux : c’est le village que vos enfants évangélisent. Au milieu, vous remarquez une tente plus large et plus élevée, c’est l’église, ou plutôt c’est l’étable de Bethléem transportée au milieu des prairies. Un certain tumulte pacifique et joyeux règne dans le camp, et fait une singulière impression sur votre âme, au sein de cette immense solitude, rendue encore plus profonde par les ombres de la nuit : on se prépare pour la messe de minuit. Silence ! le mystère s’opère ; tout le monde est à genoux pour adorer le Fils de Dieu devenu le Fils de l’homme ; les chefs et les communants entreront pour la première messe, les autres auront leur tour à l’une des six messes qui doivent se succéder jusqu’à midi. Je vous invite maintenant à entrer dans notre basilique improvisée. Voici notre petit autel, décoré de deux cierges pour tout luminaire ; ici est la crèche, dans laquelle le Roi de gloire s’est fait chair : *Verbum caro factum est*. A nous, les Missionnaires, les envoyés, les anges de Dieu, les porteurs de la bonne nouvelle, à nous l’office des esprits bienheureux : *Gloria in excelsis Deo et in terrá pax hominibus bonae voluntatis… Annuntio vobis gaudium magnum*. Toutes les instructions de la nuit et du jour seront le commentaire de ce texte. Quelle est belle notre Bethléem des prairies ! qu’ils sont beaux nos bergers enveloppés dans leurs fourrures ! que j’aime à les voir ces pasteurs des grands troupeaux de buffalos, prosternez devant l’agneau sans tache qui ôte les péchés du monde !\n\n« C’est assez, mon révérend Père, nous vous remercions de votre visite. Retournez maintenant dans vos belles églises. Vous aussi vous avez la messe de minuit et les autres offices de ce jour de Noël ; vous avez tout à sou-\nhait pour la satisfaction de l'ouïe et pour la satisfaction des yeux ; mais vous avez beau faire, rien ne vaut la touchante pauvreté de Bethléem. Bienheureux donc les pauvres, et vivent les sauvages !\n\n« Noël passé, je laissai le P. Dupin avec le Frère continuer la mission pendant l'hiver; ce qu'ils ont fait jusqu'au commencement de mars. Pour moi, revenu à Saint-Paul dans la première moitié de janvier, je repartais presque aussitôt, me dirigeant par Saint-Albert vers le camp des Pieds-Noirs.\n\n« Ce voyage avait été résolu peu auparavant, de concert avec Mgr Grandin, lorsqu'il allait visiter l'île à la Crosse et le lac Caribou. Après nous être entretenus longuement sur ce sujet, il fut convenu que j'entreprendrais cette mission, s'il était possible d'arriver au camp des Pieds-Noirs sans courir un danger évident. Je reçus à genoux la bénédiction de notre digne Vicaire, et nous nous séparâmes pour aller chacun où nous appelait la volonté de Dieu.\n\n« L'hiver était exceptionnellement rigoureux ; la campagne s'annonçait très-rude. Après trois campements de nuit, j'étais arrivé à Saint-Albert où j'employai trois jours en préparatifs de voyage.\n\n« L'automne dernier, plusieurs métis de la mission de Saint-Albert m'avaient promis de m'accompagner chez les Pieds Noirs. Mais, le temps venu, tous refusaient de le faire, et me dissuadaient d'entreprendre ce voyage. Après avoir consulté Dieu et pris l'avis des Pères de la mission, je me décidai à partir sans homme engagé. Je ne fus point cependant laissé seul. Je trouvai à me joindre à trois métis qui allaient traiter dans la même nation.\n\n« Le premier jour de février je quittais Saint-Albert avec mes trois compagnons. Nous avions chacun un cheval à notre usage. La neige tombant jour et nuit, nous fûmes bientôt obligés de chauffer nos raquettes, et d'ouvrir\nnous-mêmes un chemin à nos chevaux qui enfonçaient jusqu'au ventre. Le neuvième jour seulement, nous arrivions au pied des montagnes Rocheuses, à un établissement de pelleteries. Je pensais y trouver des sauvages qui m'auraient emmené avec eux dans leur camp. Je fus bien contrarié d'apprendre que six jours auparavant dix d'entre eux avaient quitté le fort pour retourner vers leurs gens. On disait que le camp était loin, et qu'aucun cheval n'était capable de s'y rendre par un temps de neige. Les employés du Fort, pensant me garder avec eux le reste de l'hiver, employaient toutes les raisons et tous les moyens de découragement. Mais ce n'était point à eux que j'étais envoyé par la volonté divine. Aucun de mes compagnons de voyage ne voulait aller plus loin. J'allais être abandonné à moi-même ; mais, au moment où je m'y attendais le moins, un jeune homme, sauvage de la tribu des Piéganes, se présente à moi et offre de m'accompagner partout, en assurant qu'il connaît le pays et qu'il me rendra tous les services possibles. Je le reçus comme un ange Raphaël et, le lendemain, je parlais à la suite de ce guide qu'il me semblait tenir de la divine providence.\n\n« Au bout de trois jours nous étions sortis des forêts qui longent le pied des montagnes Rocheuses, et nous entrions dans la grande prairie. Le soir de la quatrième journée nous campâmes auprès de quelques trembles secs qui nous fournirent assez de bois pour faire du feu pendant la nuit. Nos chevaux, creusant la neige avec leurs pieds, se nourrissaient de quelques brins d'herbe, et se reposaient un peu, par un froid de 35 à 40 degrés. Malgré ce régime plus que sévère et les souffrances contre lesquelles la longueur de leur poil ne les protège pas complètement, nos chevaux supportent très-bien la marche et nous rendent d'utiles services. Le lendemain matin nous partions avec du bois sur nos traînes, car nous ne devions pas en trou-\nver à notre campement de la nuit suivante. Le sixième jour, une neige abondante nous empêchait de reconnaître notre direction ; nous avions perdu le sentier déjà plusieurs fois recouvert et par conséquent peu marqué que nous avions suivi jusque-là ; le mal de neige commençait à gagner nos yeux ; nous allions nous trouver bien embarrassés si cette situation se prolongeait ; ce fut à ce moment que le ciel nous envoya quelques-uns de ceux que nous cherchions. En faisant effort pour découvrir au loin quelque indication sur notre route, je crusapercevoir quelques personnes en marche à l'horizon ; nous tournons de ce côté et avant la fin du jour, je me trouvais en compagnie de deux familles de Pieds-Noirs. Nous campâmes ensemble dans le désert. Ces sauvages me donnèrent des informations sur le camp que je cherchais, et me racontèrent toutes les nouvelles courantes. Ils me dirent que, pour eux, ils étaient à la recherche d'un certain nombre de leurs parents ; qu'ils pensaient les rejoindre dans cinq jours. Hélas ! ils ne les ont jamais rejoints, car j'ai appris à mon retour qu'après s'être séparés de moi, ils avaient été tous détruits par leurs ennemis, aux mains desquels ils étaient tombés. Avant de me séparer de ces pauvres gens, j'essayai de les détourner de la direction qu'ils voulaient prendre ; je les engageai à me suivre, mais ils furent sourds à mes invitations. Il semble que j'avais le pressentiment de quelque malheur.\n\n«Nous mimes encore trois jours avant d'arriver au camp de la tribu. À la fin du troisième jour, nous étions en vue de mes chers sauvages. Aussitôt qu'ils aperçurent mon petit drapeau blanc décoré d'une croix rouge, une nombreuse procession d'hommes, de femmes et d'enfants accourut à ma rencontre en poussant des cris de reconnaissance. De toutes les bouches on entendait : « L'homme divin est arrivé !... Celui qui a le cœur bon, je l'aime ! »\nJ'entrai ainsi dans le camp escorté par l'hosanna des sauvages. La plus grande loge fut mise à ma disposition. Le reste du jour fut employé à recevoir les condoléances des principaux de la tribu. Je fis une grande fumerie : le calumet de cérémonie passa de bouche en bouche, et fit plusieurs fois le tour de l'assemblée. Quoique je ne parle pas bien la langue de ces sauvages, cependant je pus leur dire quelques mots, et leur exprimer la joie que j'éprouvais de me trouver au milieu d'eux.\n\n« Je ne pouvais pas demeurer plus de trois semaines au milieu des Pieds-Noirs. J'ai employé tout ce temps à enseigner les prières, à faire chanter quelques cantiques, à répéter quelques leçons de catéchisme, mais surtout à étudier la langue. Vous n'aurez pas de peine à comprendre la difficulté que j'y rencontrais : saisir les sons et les fixer par l'écriture, en deviner le sens, découvrir les règles grammaticales, ce n'est pas petite affaire. Enfin cependant, en peu de jours je fis bon nombre de découvertes, et j'étais heureux des progrès qu'avec le secours de Dieu j'avais réalisés.\n\n« De leur côté, les sauvages se montrèrent très-désireux et empressés de connaître la religion. Ils me consolaient beaucoup par la bonne volonté qu'ils mettaient à s'instruire. J'étais grandement dédommagé des quelques souffrances que j'avais endurées pour me rendre auprès d'eux. Ils me traitaient vraiment comme un chef et comme un père, et ne cessaient de me questionner sur les vérités de la religion. Je leur montrais ma croix et leur disais que ce crucifix était l'image du Fils de Dieu, mis à mort pour notre salut. Au premier abord ils étaient étonnés et même scandalisés d'entendre une pareille affirmation : Scandalum gentibus. Un jour que je leur expliquais le Décalogue, je leur dis en finissant : « Eh bien ! voulez-vous prendre cette loi et la suivre, puis-\n« que la forme du culte que vous avez suivi jusqu'à pré-\nsent n'est qu'une invention du démon ? » Un vieillard se\nleva et me répondit ainsi au nom des autres : « Bien cer-\ntainement nous acceptons la loi que tu nous offres ; elle\nest bien plus facile à pratiquer que celle que nous avons\nsuivie jusqu'ici, laquelle ne nous est d'aucune utilité\npuisque nous ne travaillons que pour le mauvais génie. »\nEn parlant ainsi, il montrait ses mains dont plusieurs pha-\nlanges avaient été coupées et offertes au soleil, ses bras,\nsa poitrine, ses épaules qui portaient les traces des cruau-\ntés qu'il avait exercées sur lui pour se rendre les génies\nfavorables.\n\n« Quand le temps vint de m'en retourner, je partis avec\nune quinzaine de familles qui voulaient m'accompagner\njusqu'au fort des montagnes Rocheuses. Après quelques\njours passés ensemble dans ce fort, je me séparai d'elles\navec regret, pour revenir à Saint-Albert. Mais, avant\nd'avoir le plaisir d'embrasser mes chers confrères, mon\ncœur devait être déchiré par un bien triste spectacle.\n\n« A quelque distance de la rivière Siskatchewan, comme\nje cheminais avec mes hommes, j'aperçois tout à coup\ndes sauvages qui accourent à moi en pleurant. Ils avaient\nété entièrement dépouillés, et portaient deux des leurs\nqui étaient en outre blessés. Ils appartaient à la nation\ndes Pieds-Noirs, et étaient les seuls restes des familles\nmassacrées par les Cris-Assiniboines près du fort Edmon-\nton, à huit milles de Saint-Albert. Ils n'avaient pas mangé\ndepuis trois jours ; ils pataugeaient pieds nus dans l'eau\net dans la glace. Pauvres gens ! Je ne pus retenir mes\nlarmes à la vue de tant d'infortunes. Mais cela n'était pas\nsuffisant ; il fallait les secourir. Je leur distribuai tout ce\nqui me restait de provisions ; je lavai et bandai les plaies\ndes blessés, je leur donnai de quoi se couvrir, et enfin je\nleur prêtai deux chevaux. Pour moi, je devais aller à\npied, mais je n'avais plus que quelques lieues à faire. J'étais heureux d'avoir sauvé la vie à des malheureux, et d'avoir procuré à la personne du Prêtre une influence encore plus grande parmi les sauvages. Le lendemain j'arrivais à la petite communauté de Saint-Albert, et tous ensemble nous remercions le Seigneur du bien qu'il avait voulu opérer par son indigne serviteur. C'était au commencement de la semaine sainte ; les Pères me retinrent jusqu'aux fêtes de Pâques, et me firent donner une retraite aux métis de la localité.\n\nVoilà, bien-aimé Père, ma tâche terminée. Pardon, si dans ce récit j'ai été obligé de parler des fatigues que j'ai endurées. Je n'ai vraiment pas lieu de m'en glorifier tant elles ont été surpassées par les faveurs et les consolations d'un autre genre. J'avoue, du reste, que celles-ci étaient nécessaires à ma faiblesses. Dieu nous ouvre parmi ces tribus des prairies un chemin qui n'est pas sans épines, mais un chemin qui donne accès à des moissons déjà mûres. Puissent des vocations nombreuses d'ouvriers évangéliques, puissent le zèle, le courage, la sainteté de nos Pères égaler le travail et donner satisfaction à tous les besoins ! Ces peuples délaissés et dont on redoute trop les instincts de cruauté et de pillage, nous appellent à grands cris : *Transite ad nos*, *adjuvate nos*, *perimus*, nous disent-ils du fond de leurs solitudes comme du sein de leur ignorance. Moi qui déjà ai eu occasion de les visiter quelquefois et de les instruire un peu, moi qui les connais et qui en suis connu, moi qu'ils appellent leur père et leur protecteur, ne suis-je pas obligé d'être auprès de Votre Paternité l'interprète de leur bonne volonté et de leurs plus ardents désirs ? »\n\nLe P. Lacombe termine sa lettre par quelques réflexions attristées, au sujet de la funeste influence produite sur les indigènes par le commerce des blancs. Ceux-ci, avec la\nprévention de leur apporter la civilisation, ne leur apportent souvent qu'un surcroît de vices et des instruments pour les servir. Par leur insatiable avidité, ils épuisent les productions du pays, et obligent les familles à se retirer d'abord, à mourir bientôt de privations. Les anciens parmi les sauvages vont sans cesse répétant qu'ils sont aujourd'hui plus malheureux, que leurs guerres sont plus meurtrières, que leurs animaux diminuent dans des proportions effrayantes, étant obligés d'en faire une plus grande destruction, afin de payer de leurs fourrures le prix énorme des ustensiles qu'on leur vend. Pendant l'hiver dernier, dans l'espace de quatre mois, entre le poste de Carlton et le fort de la Montagne, espace de 550 milles, plus de trente mille buffles ont été tués et plus de la moitié étaient des femelles, les seules dont la peau soit estimée comme fourrure.\n\n« Puisque les choses en sont arrivées à ce point, continue le P. Lacombe, qu'il est impossible d'entraver le mouvement qui amène des étrangers au milieu des sauvages, plutôt au ciel que les Indiens obtiennent toujours des autorités locales une protection particulière ! Mon opinion, que je donne non comme incontestable, mais comme celle d'un Missionnaire qui a passé de longues années avec les peuples dont il plaide la cause, qui connaît leurs mœurs, leur genre de vie, leur caractère et tout ce dont ils sont capables ; mon opinion est qu'on ne devrait permettre qu'à une seule compagnie de marchands de traiter avec eux, et par ailleurs, laisser toute liberté à leurs Missionnaires. Je dis que nos sauvages de l'Amérique du Nord ne sont pas aptes à recevoir une complète civilisation, telle du moins que l'entendent ceux qui la leur offrent en dehors de la vraie religion. Le sauvage, dans les conditions d'existence où il demeure, est capable de connaître le vrai Dieu, les dogmes et la morale de la reli-\ngion chrétienne. À vrai dire, c'est bien ici la seule civilisation véritable. Mais, encore une fois, dans l'ordre purement humain, il n'est capable que d'une demi-civilisation, et encore faut-il qu'il la reçoive de ceux qui ne sont conduits par aucune spéculation, mais uniquement par l'intérêt de l'humanité souffrante. Un vieux sauvage à cheveux blancs, le vrai patriarche de sa tribu, me disait un jour : « Pour nous sauvages, Dieu ne nous a faits qu'à moitié, « vu que nous vivons à la façon des animaux, et ne con- « naissions pas la manière de le servir. Mais il vous a laissé, « à vous qui êtes ses ministres, le soin de nous finir en per- « fectionnant son ouvrage. » Oui, pauvre sauvage! et c'est la mission qui nous a paru la plus belle, la seule que nous ambitionnons, celle que nous voulons accomplir au prix de tous les sacrifices et de notre vie même.\n\n« Je finis, mon très-révéré et bien-aimé Père, cette lettre déjà trop longue. Veuillez continuer de prier pour nous tous, mais surtout pour les Pieds-Noirs et leur indigne Missionnaire, qui est votre enfant tout dévoué en Jésus-Christ et Marie immaculée.\n\n« Lacombe, O. M. I. »\n\nEXTRAIT D'UNE LETTRE DU R. P. MOULIN,\n\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nMission de Saint-Jean-Baptiste (île à la Crosse),\n16 août 1869.\n\nIl y a peu de monde à la mission pour le moment. Hier, fête de l'Assomption, la plupart des gens du fort ont pu s'approcher de la sainte table. Hier encore nous est mort un petit sauvage. J'ai bien admiré la résignation", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009567.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 11, "total-input-tokens": 16328, "total-output-tokens": 6000, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1614, 1], [1614, 3355, 2], [3355, 5263, 3], [5263, 7087, 4], [7087, 8998, 5], [8998, 10889, 6], [10889, 12744, 7], [12744, 14654, 8], [14654, 16542, 9], [16542, 18433, 10], [18433, 19934, 11]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false]}}]