[{"id": "218ee15fcc9f2aa93bca3d7f4fb600440f273bcb", "text": "pour aider Sa Grandeur. La semaine qui précéda la Toussaint fut la plus pénible; nous bousillâmes nos deux maisons trois jours durant, je fis ensuite le plancher de notre pauvre chapelle, pendant que Monseigneur et le Frère faisaient avec des perches chargées d'écorces un plafond à notre baraque. Je passai de là à la porte de la chapelle et de la porte à l'autel. Puis il fallut songer à orner cette pauvre petite chambre de boue pour la rendre digne de la présence de notre grand Dieu.\n\nEnfin, tout étant prêt pour le recevoir, il vint habiter notre pauvre toit d'écorce, ce Jésus! comme il habita sous celui de Bethléem; il vint partager notre affreuse misère et nos sueurs.\n\nC'est dans cette chapelle qu'au commencement de ce mois nos sauvages se sont réunis en grand nombre; nous leur avons fait une petite Mission, et quatre des plus instruits ont été baptisés.\n\nPetitor, O. M. I.\n\nJournal de Mr Grandin.\n\nNous sommes arrivés avec le R. P. Petitor jusques auprès de Mr Grandin; ne quittons point ce cher Seigneur. Accompagnons-le dans le long voyage qu'il vient d'exécuter. Il en a écrit le journal fidèle. Commencé le 4 juin 1861, ce journal ne se termine que le 15 juillet 1862. Nous le publions in extenso : l'Évêque, le Prêtre, le Missionnaire, le Religieux, l'Oblat de Marie Immaculée s'y peignent sous des traits qui ne peuvent qu'exciter l'admiration. Avec quelle joie notre Bien-aimé Fondateur n'aurait-il pas pris connaissance de ces lignes qui lui étaient destinées, mais qui ne sont arrivées qu'après sa mort!\n\nSur le lac du Bœuf, le 4 juin 1861.\n\nMonseigneur et Révérendissime Père,\n\nL'amour si tendre que vous portez à vos enfants ne vous permet pas de les perdre de vue; j'ai même pu me convaincre\nque plus ils sont éloignés de votre personne, plus votre cœur est près d'eux. Je vous suis pas à pas. M'écriviez-vous il y a quelques mois, au milieu de vos neiges et de vos glaces presque sans fin. Je veux vous faciliter, Bien-aimé Père, le voyage que je viens d'entreprendre; il sera si long et si pénible, qu'il vous serait impossible de m'accompagner, quelque généreuse que soit votre affection. J'espère qu'il vous offrira cependant des consolations, car je vais visiter les différents membres de la famille disséminés par petits groupes dans ces immenses contrées du nord. Vous me suivrez pas à pas, et moi je serai heureux lorsque, comme en ce moment, une voile légère me permettra d'avancer dans ma course et de m'entretenir avec mon père, je me consolerai dans les retards et les différents accidents du voyage parce que, tout pénibles et ennuyeux qu'ils seront, ils me fourniront l'occasion de m'entretenir avec celui dont on peut dire que la conversation ne saurait causer d'amertume. Cette lettre ne vous arrivera donc que bien tard, car je ne la terminerai qu'à mon retour. Je ne vous promets pas, Monseigneur, de vous rendre compte chaque soir, ni même chaque semaine, de ce qui pourra intéresser Votre Grandeur, mais dès que j'aurai le temps, je reprendrai la plume. Je n'aurai le plus souvent pour table que mes genoux, pour toit que le ciel, lequel encore ne sera pas toujours pur, mon écriture déjà belle par elle-même s'en ressentira, mon papier, à force d'être roulé et plié en différents sens, n'ayant point de tiroir pour le serrer, finira par être malpropre et illisible. N'importe! je réclame d'avance votre indulgence, ou plutôt, je ne la réclame pas, je sais positivement qu'elle m'est déjà acquise.\n\nSamedi dernier, 1er juin 1861, la barque où je me trouve aujourd'hui est partie de l'île à la Crosse. Il ne m'a pas été possible d'y monter ce jour-là, la Mission n'était pas assez avancée. La plupart de nos sauvages, arrêtés par les glaces, n'avaient pu arriver que la veille, et il s'en trouvait parmi eux un nombre assez considérable que je devais confirmer, puis je voulais présider à notre belle procession de la Fête-Dieu, que beaucoup de sauvages n'avaient pu voir jeudi\ndernier. Le dimanche donc, dès huit heures du matin, le Frère Boisramé et les Sœurs avaient terminé trois beaux petits reposoirs, l’un près de la maison des Sœurs, l’autre près de la nôtre et un troisième sur une montagne qui domine le lac et qui est surmontée d’une grande croix qui n’a pas moins de quarante pieds de hauteur. Au pied de cette montagne se trouvait le campement des Crees. Plusieurs sauvages encore infidèles avaient accompagné leurs parents chrétiens. Ces pauvres gens ne savaient plus où se placer quand la procession déroula ses rangs; ils auraient voulu tout voir et ils n’osaient regarder en face. Le chant les émerveillait, la beauté de nos ornements, celle du dais, dont le ciel était de flanelle blanche et le tour de papier découpé en dentelle et festonné de rubans, tout cela les plongeait dans le ravissement. J’aurais voulu avoir votre dignité, Monseigneur, pour ne pas diminuer aux yeux des sauvages la grandeur du Dieu anéanti que je portais entre mes mains. Quelques jours auparavant j’étais simple manœuvre, cette fois je voulais être Evêque tout de bon. Mes ornements étaient magnifiques, un diacre et un sous-diacre en dalmatiques m’assistaient, j’avais un porte-crosse, un porte-mitre et même un beau petit porte-queue en habits rouges. Peut-être, hélas! quelques sauvages étaient-ils plus frappés de tout cet appareil que de la présence du Dieu de l’Eucharistie, mais pendant qu’ils se cachaient dans leurs loges, n’osant regarder que par des trous, je priais leur Sauveur et le mien de leur faire connaître sa puissance et son amour en s’emparant de leur cœur.\n\nÀ onze heures, toutes nos cérémonies étaient terminées. Nous nous mettons à table, nous mangeons bien peu, car, au moment du départ, l’appétit n’est pas gros. Nous rentrons de nouveau à l’Église, je récite tout bas mon itinéraire, l’émotion m’empêchant de le réciter en chœur, je bénis encore une fois tout mon monde et j’embrasse les Pères Végréville et Moulin qui continueront seuls la Mission, et le Frère Dubé, dont l’état de santé m’inspire de bien vives inquiétudes. Enfin, je m’élançais dans un canot d’écorce qui m’attendait sur le rivage ainsi que le Frère Boisramé. Aussitôt une décharge de coups\nde fusil se fait entendre, les employés du fort et les sauvages semblent se défier à qui brûlera le plus de poudre et cela tant qu'ils voient notre canot. Mais il a bientôt disparu; il est monté par trois vigoureux sauvages qui n'ont pas les poignets engourdis, et le Frère Boisramé unit encore ses efforts avec les leurs. Notre marche est si rapide, que nous rejoignons le soir même la barque partie la veille, et nous pouvons faire avec ceux qui la dirigent les exercices du dimanche soir, c'est-à-dire chanter un cantique, réciter le chapelet et les prières de l'Archiconfrérie.\n\nLe lendemain, 3 juin, nous partons dès trois heures du matin avec un vent favorable, mais la glace qui recouvre encore en partie le lac du Bœuf ne nous permet pas d'en sortir. Dans la matinée, nous rencontrâmes quelques familles sauvages qui se rendaient à la Mission; je pus confesser un malade de la bande. À midi, je payai la consolation que j'avais éprouvée la veille en assistant à notre belle procession par la rencontre d'un malheureux qui, depuis sa conversion, s'était assez bien conduit et qui, aujourd'hui a éloigné sa femme légitime pour en prendre une autre. Je ne lui dis que quelques mots; je lui annonçai que je ne serais plus son Père, puisqu'il avait rejeté Dieu et pris le diable pour maître, et je finis en lui interdisant l'entrée de l'Eglise. S'il eût été présent à la Mission dimanche, il aurait été si affligé de ne pouvoir prendre part à la procession, qu'il serait revenu, j'en suis sûr, à de meilleurs sentiments. Quant à sa complice, elle s'excusa en disant que ce n'était pas sa faute. *Il le veut, lui, je ne puis pas dire non*, me disait-elle. Vous vous souvenez, Monseigneur, de ce que je vous ai dit autrefois de l'esclavage de la femme à l'égard de l'homme parmi ces peuplades sauvages.\n\nLe soir, la glace ne nous permettant pas d'aller plus loin, nous campâmes de bonne heure, et ce matin nous n'avons pu partir que fort tard, le passage étant encore plus difficile qu'hier. Ce retard m'a permis de célébrer la Sainte Messe. Après le déjeuner, nous nous sommes cependant mis en marche à travers la glace et afin de décharger la barque et de faciliter ses mouvements, ceux qui n'y travaillaient pas ont\npris la route de terre. Le Frère Boisramé a été excepté. Ce cher Frère ne peut supporter la nourriture du voyage, cet excellent pâté, le pennican, dont Votre Grandeur a vu un échantillon l'année dernière; il a été malade toute la nuit, et il était si faible ce matin, qu'il a dû rester dans la barque. Son état m'inquiète, nous sommes encore si éloignés du terme de notre voyage!\n\nJusqu'à midi, nos hommes s'épuisent en efforts inutiles, la glace ne leur permet presque pas d'avancer. J'étais sur la côte à m'ennuyer, parce que j'avais oublié de prendre avec moi ma bibliothèque de voyage, un sac renfermant mon Bréviaire, mon exemplaire des Saintes Règles, le Nouveau Testament et l'Initiation, la Théologie de Gury et enfin du papier, des plumes et de l'encre. Si je l'avais eu, j'aurais pu vous écrire sur la terre ferme. Découragés de se faugner en vain, mes sauvages ont gagné le rivage, nous avons fait du feu et nous avons diné. Pendant ce temps le vent s'est levé, il nous a ouvert en moins de deux minutes un passage à travers les glaçons; nous avons tendu notre voile et nous sommes partis.\n\nA peine étions-nous embarqués, qu'un gros ours jaune se dresse sur la côte en face de nous. Dans un instant tous les fusils sont bandés et dirigés vers l'animal féroce, mais il n'attend pas la salve qu'on veut lui envoyer : il se sauve et fait bien. Chacun regrette sa peau et sa viande, je regretterais moi aussi sa viande, qui aurait pu prolonger nos provisions de voyage. Le Frère Boisramé surtout aurait bien voulu faire connaissance de suite avec cette nouvelle espèce de nourriture, il lui semblait qu'elle aurait bien valu le pâté. Mais malgré tous ces regrets inutiles, je remerciai Dieu de tout mon cœur de ne pas avoir vu cette bête pendant que je me promenais seul sur la côte peu de temps auparavant; le moindre mal qu'il pouvait me faire était de m'épouvanter beaucoup.\n\nUne heure après cet incident, nous arrivons à l'entrée de la rivière la Loche. Deux de nos hommes montent sur un canot d'écorce et prennent le devant. Quelques coups de fusil se font bientôt entendre, ce sont nos hommes qui tuent un gros ours jaune, celui que nous avions déjà vu ou un autre qui lui\nressemblait. Mes sauvages font force de rames, nous n'allions plus à la voile, je serre vite mon encre et mon papier, et dans quelques instants nous sommes près de nos chasseurs, que nous félicitons de leur succès. Le Frère Boisramé, tout malade qu'il est, ne se possède plus de joie, dans un instant il est hors de la barque, et après s'être bien assuré de la mort de ce dangereux animal, il le considère en tous les sens, lui prend les pattes, lui ouvre la gueule, contemple ses dents, sa langue, etc. Cet événement semble lui redonner la vie; puisse le morceau de viande qui nous a été remis le guérir entièrement! En moins d'un quart d'heure l'ours est découpé et placé sur notre barque. Nous campons assez tôt pour que le guide ait le temps de faire les parts de chacun. Aujourd'hui, 5 juin, le Frère va mieux : nous avons déjeuné tous les deux avec des côtelettes d'ours.\n\nMission de la Visitation, Grand-Portage la Loche, lundi 10 juin.\n\nLe 6 juin au soir, nous avions atteint le fort du Portage la Loche. Le cher Père Séguin s'y était rendu depuis deux mois afin d'apprendre le montagnais et d'instruire les sauvages. Il a eu besoin, je vous assure, de tout son zèle pour supporter sa position. Certes, il n'est point agréable de prêcher une Mission à des sauvages dont on ne sait pas la langue. Je ne doute pas qu'il n'ait reçu bien des compliments sans que son humilité ait couru le moindre danger. Le Seigneur a été avec lui, il fait du bien et il a fait aussi de grands progrès dans la connaissance de la langue montagnaise.\n\nMon arrivée dans ce poste est célébrée de la même manière que mon départ de l'île à la Crosse, par force coups de fusil; les hommes de la barque, les employés du fort et les sauvages paraissent prendre à tâche de se surpasser les uns les autres. Nous nous trouvions à l'endroit même où les filets de pêche avaient été tendus. C'est de ces filets que tous attendaient leur nourriture pour le lendemain. Mais les poissons effrayés de la fusillade prirent le large, et le lendemain tout le monde jeûna, excepté nous, qui avions nos provisions de voyage. Ainsi la fête dut-elle finir le soir même.\nJ'ai appelé ce poste Mission de la Visitation de Marie. C'est une Mission bien pauvre, puisque nous n'y avons pas même une maison; cependant nous la visitons régulièrement, car, outre qu'il y a beaucoup de sauvages, c'est un passage et même un rendez-vous pour les employés de la Compagnie, lorsqu'ils transportent les marchandises et les fourrures. Le chef traiteur du poste céda sa demeure au R. P. Séguin, qui m'y reçut comme chez lui. J'y passai deux jours et deux nuits, occupé presque continuellement à entendre les confessions. Je donnai de plus deux exercices dans la journée. Le Père Séguin, de son côté, ne manquait pas d'occupation, il enseignait le mot à mot du catéchisme et des prières.\n\nHier, dimanche, notre maison ne pouvant contenir la moitié des fidèles, je chantai la Messe aussi pontificalement que possible en plein air. Afin de nous préserver du vent, nous fimes un abri avec nos couvertures. L'autel consistait seulement en quelques planches recouvertes d'une nappe avec garniture de rubans rouges, le devant d'antel était aussi rouge avec différentes décorations que l'on trouvait magnifiques. Pour tout luminaire, une chandelle de graisse, qui s'éteignit plusieurs fois et que nous fûmes même obligés de déposer à terre afin de l'empêcher de couler et de s'éteindre. Enfin, le R. P. Séguin et le Frère Boisramé remplissaient les fonctions de chantres, prêtre assistant, diaire, sous-diaire, acolyte, bedeau, etc. J'officiai avec crosse et mitre, jamais on n'avait rien vu de si beau, et je suis certain qu'à Marseille même on n'en a jamais vu autant. Mais ce que Votre Grandeur eût certainement admiré, c'était la piété et la tenue si édifiante de ces pauvres gens, dont trente et un eurent le bonheur de communier et dix-neuf furent confirmés. Vous trouverez sans doute, Monseigneur, que ce nombre est bien minime, mais ces sauvages, ne voyant le Prêtre que rarement, ne peuvent pas être suffisamment instruits pour communier; tous ne sont pas même baptisés. Vous trouverez peut-être aussi que nos cérémonies ainsi mutilées ne sont pas trop convenables, et qu'il serait mieux de s'en abstenir. Les sauvages ne se doutent pas qu'il manque quelque chose à nos cérémonies, et\ntoutes tronquées qu'elles sont, je suis certain que si tous les sauvages pouvaient en être témoins, le tabac et les couvertures des ministres protestants les tenteraient peu ou point du tout. Si le transport offrait plus de facilité, je voudrais porter avec moi tous les attributs pontificaux, un bel ornement, une chape splendide. Mais il me faut de toute nécessité réduire mon mobilier à la plus simple expression. Jugez-en vous-même : une cassette de trois pieds de longueur, d'un pied et demi de profondeur et d'un pied de largeur, contient ma chapelle et le linge dont je devrai me servir pendant douze à quinze mois. On comprendra qu'avec cela je ne puis guère avoir des choses de fantaisie. Je serai obligé de laisser ma crosse à Athabaskaw, et quand je voyagerai sur la glace, je devrai même me défaire de ma cassette et me contenter d'un simple sac. Ainsi, Monseigneur, si l'Épiscopat me dispense du vœu de pauvreté, il ne me met pas dans la nécessité d'y manquer. Mais je m'oublie, continuons notre voyage.\n\nJe laissai à l'extrémité sud du portage le Père Seguin, qui maintenant va voyager avec moi, et le Frère Boisramé, et je me rendis de suite au lieu où s'étaient réunis les employés du fort Athabaskaw qui transportaient les fourrures d'un bout du portage à l'autre. Tout en marchant, j'eus l'avantage d'être baigné comme il faut et même un peu plus qu'il ne faut par une pluie abondante, mais un bon feu me sécha complètement. Je récitaï les prières du dimanche soir avec ces voyageurs au nombre de trente à quarante, leur fis une petite instruction, partageai leur souper et dormis sous un bon petit abri qu'ils me préparèrent. Ce matin, n'ayant pas ce qu'il me fallait pour dire la Messe, je me suis rendu ici, extrémité nord du portage, où j'ai trouvé plusieurs familles sauvages qui n'avaient pu prendre part à la Mission. Je les ai confessées et demain, avant de quitter ces lieux, il y aura encore plusieurs communions et trois confirmations.\n\n(La suite au prochain numéro.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009550.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 13422, "total-output-tokens": 5134, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1719, 1], [1719, 3924, 2], [3924, 6131, 3], [6131, 8351, 4], [8351, 10537, 5], [10537, 12669, 6], [12669, 14869, 7], [14869, 16866, 8], [16866, 16866, 9]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]