[{"id": "49fef7380b33d9c7e873dc7eb8973ef6d9af1f19", "text": "MISSIONS DE SAINT-ALBERT.\n\nLETTRE DE MONSEIGNEUR GRANDIN, ÉVÊQUE DE SAINT-ALBERT\nAU T. R. P., SUPÉRIEUR GÉNÉRAL,\n\nVers le milieu du lac Vert, en route pour Saint-Albert,\npar Carlton, 15 août 1870.\n\nMON TRÈS-RÉVÉREND PÈRE,\n\nSi mes différentes lettres vous sont parvenues, vous avez eu connaissance de mon départ de Saint-Albert, le 28 décembre dernier, pour me rendre au lac Caribou, où je suis arrivé le 9 mars seulement, après avoir passé cinq jours avec nos Pères à Saint-Paul des Cris, trois jours à la mission de Saint-François-Régis du fort Pitt, un jour et deux nuits à la rivière Bataille, poste nouveau et important où je voudrais pouvoir placer un ou deux Pères. Ensuite j'ai passé cinq ou six jours à Saint-Joseph de Carlton, où j'ai en vain attendu vos lettres; un jour à Saint-Julien du lac Vert, quinze jours avec nos Pères de l'île à la Crosse : dans toutes ces localités, j'ai préparé nos chrétiens à la grâce du jubilé. J'avais, vous le voyez, peu de temps à leur donner, ce qui est d'autant plus regrettable que les pauvres gens sont éloignés du prêtre ; mais, dans l'impossibilité de faire les choses comme il le faudrait, j'ai dû me contenter de les faire le moins mal possible. J'étais aussi obligé de ménager mes forces pendant le voyage, afin de les réserver pour le travail qui m'attendait à chacune de ces stations; aussi j'avais pour moi seul quatre forts chiens esquimaux qui ont pu me trainer\nÀ peu près tout le temps. De Saint-Albert à l'île à la Crosse, j'étais accompagné de deux hommes qui m'ont beaucoup aidé : l'un d'eux est ce jeune homme qui m'accompagne depuis près de dix ans ; ce n'est plus un enfant, c'est un homme fait, et très-utile pour ces sortes de voyages. L'autre, quoique bon, était peu capable ; je l'ai remplacé à l'île à la Crosse par le bon Alexis, cet homme si dévoué qui sert les Missionnaires avec tant de charité depuis douze ou quinze ans.\n\nMalgré la force et le courage de mes chiens, je dus cependant marcher à la raquette devant eux pendant quatre ou cinq jours. La neige était tellement épaisse, qu'ils ne pouvaient s'en tirer.\n\nJ'aurais voulu ne passer que peu de temps au lac Caribou : je prévoyais que les événements qui se passaient à la Rivière-Rouge auraient du retentissement dans nos missions de l'Ouest ; d'autre part, sachant que Mgr Faraud s'était rendu au lac la Biche, et que Mgr Clur devait revenir d'Europe au mois de juin, j'aurais voulu hâter mon retour pour rencontrer ces prélats que je désirais voir ; mais le cher P. Gasté tenait à me faire voir tous ses sauvages, et là, contrairement à ce qui se passe dans les autres missions, les sauvages ne sont jamais tous réunis : c'est un va-et-vient continuel. J'avais une autre raison de rester, c'est que je ne me sentais pas la force de voyager sur la glace. Ma santé était si chétive, qu'une promenade d'un demi-mille à pied suffisait pour me fatiguer et me rendre malade : j'aurais fait mon testament, si j'avais eu quelque fortune ; je toussais toujours beaucoup, et souvent jusqu'à cracher le sang. Pour ces motifs, je me décidai à rester avec nos Pères jusqu'au 13 juin, et je pus ainsi m'édifier à loisir du spectacle de leur zèle tout apostolique et de leur régularité vraiment religieuse. D'un autre côté, ma présence faisait aussi un peu diversion à leur long isolement,\ncar cette mission semble réunir toutes les privations et toutes les difficultés. Les sauvages n'y peuvent résider que peu de temps; de là l'impossibilité de les bien instruire. Le bien s'y fait néanmoins, mais insensiblement. Si le progrès n'est pas plus rapide et plus visible, ce n'est certes pas la faute de nos Pères, dont le zèle demande plutôt à être modéré que stimulé. Ils vont donc chercher les sauvages dans leurs campements qui sont disséminés à grande distance; ils font pour cela des voyages à la raquette, de trois, de dix et même de dix-sept jours. J'ai cru devoir modérer cet excès de zèle. Ces voyages ont sans doute d'excellents résultats; mais ils ruinent les santés, sans compter qu'ils sont très-dispendieux. Ils entreprennent parfois des excursions encore plus longues. Ainsi le P. Gasté s'est rendu jusque chez les Esquimaux. Je ne vous parlerai pas ici de son voyage, il m'en a envoyé une relation que je vous transmets telle que je l'ai reçue, avec prière de vouloir bien la communiquer à ces messieurs de la propagation de la foi à qui je l'annonce. Quand le R. P. Gasté fut de retour de son long et pénible voyage, le R. P. Legoff en entreprit un autre dans une direction opposée. Il visita trois ou quatre postes de la compagnie de la baie d'Hudson, où résident bon nombre de chrétiens vraiment abandonnés. Jugez si le diable en doit faire des siennes, dans ces postes éloignés, où le Prêtre, s'il y passe quelquefois, ne peut absolument s'arrêter. Dans ce voyage, le P. Legoff a fait beaucoup de bien et surtout empêché beaucoup de mal. Pour moi, je ne sais quel sera le résultat de ma visite à notre mission du lac Caribou. J'ai cru devoir me montrer très-sévère envers les sauvages; je leur ai reproché sans aucun ménagement leur indifférence, leur manque de reconnaissance envers le Missionnaire et leur peu de zèle à se faire instruire. Je leur ai dit que s'ils ne montraient pas plus de bonne vo-\nlonté, j'allais leur enlever leurs Missionnaires pour les\nenvoyer à d'autres peuples qui profiteraient mieux de\nleur dévouement. Cette menace les a effrayés; ils sont\nvenus m'offrir leurs excuses, et, tout en les blâmant, nous\nnous disions en nous-mêmes que si les chrétiens en Eu-\nrope étaient entourés de pareilles difficultés, ils se mon-\ntreraient peut-être moins généreux que nos Montagnais.\nLes sauvages ont pu croire que mon intention était de\nleur enlever en effet leurs Pères, car, ayant besoin du\nR. P. Legoff pour une autre mission, je l'emmenai avec\nmoi, ainsi que le Fr. LALICAN, dont la santé est malheu-\nreusement minée. Il ne restait donc pour le moment que\nle P. Gasté avec le petit Fr. Guillet, qui, par une permis-\nsion spéciale du souverain Pontife, fait son noviciat au lac\nCaribou. La position de nos Pères s'est beaucoup amé-\nliorée par la présence de ce cher Frère dans la mission :\nil s'acquitte admirablement des soins du ménage ; il blan-\nchit et raccommode le linge à merveille ; le linge d'église\nest propre, la chapelle bien tenue et décorée avec goût.\nMais ce n'est qu'une pauvre baraque peu solide, et qui\nne peut même abriter notre modeste autel contre la\nneige et les pluies. Une autre baraque sert d'habitation\naux Pères ; elle se compose de deux pièces d'environ\n18 pieds de long sur 15 de large. On y est à l'abri du\nfroid, mais en temps de pluie l'eau y pénètre de toutes\nparts, et la boue tombe sur les lits, sur la table, sur les\nlivres ; impossible d'y entretenir la propreté. J'aurais bien\nvoulu leur faire construire une habitation plus convenable,\nmais j'ai dû me borner pour le présent à faire préparer le\nbois pour de nouvelles constructions, lesquelles seront\naussi extrêmement modestes, car je n'ai pu trouver dans\nles environs du bois assez gros pour en faire des planches.\nQuant à la mise en œuvre de ces matériaux, il nous a\nfallu la renvoyer à une autre année, et je ne sais encore\nquand nos chers Pères auront un abri contre la pluie.\n\nMalgré notre pauvreté, les fêtes religieuses ont été belles pendant mon séjour dans cette mission. Les offices pontificaux ont été fréquents et j'ai eu la consolation d'y voir assister jusqu'aux Esquimaux encore infidèles, car il n'y en a pas encore de chrétiens dans mon vicariat. Nous avons fait une magnifique procession du très-saint-sacrement le dimanche avant mon départ. Avec du papier et quelques bouts d'étoffe, le petit Frère avait réussi à faire un magnifique reposoir : les sauvages en étaient émerveillés ; malheureusement ils étaient peu nombreux.\n\nLe 15 juin, après la bénédiction du très-saint-sacrement, trois de vos enfants, mon très-révéré Père, partaient de l'extrémité nord du lac Caribou ; deux y restaient encore et tous pleuraient comme des enfants ; celui qui aurait dû se montrer le plus ferme était comme un vrai bébé. Pendant que nous pleurions, les sauvages brûlaient leur poudre en notre honneur, et déjà loin de la mission, nous entendions encore la petite cloche et la fusillade de ces braves gens. Le 26 au soir nous arrivions au poste de la Rivière-au-Rapide, où nous avons dû nous ennuyer jusqu'au 9 juillet. Je pensais que les bateaux par lesquels nous devions partir allaient m'apporter mes lettres, mais je fus trompé : elles avaient pris une autre direction ; je ne les recevrai sans doute qu'à Carlton. Ce contre-temps m'a bien contrarié et dérangé. Le 21 juillet nous arrivions à l'île à la Crosse, et comme en ce moment les sauvages n'étaient pas réunis, je pus me donner à loisir la consolation d'assister à un petit examen des enfants. J'ai vu et entendu plusieurs petits sauvages parler, écrire, calculer et chanter en français avec tant de perfection, qu'on ne se serait jamais cru en pays sauvage. Nos bonnes Sœurs grises ont pour les former un tact tout particulier, avec un zèle et un dévouement au-dessus de tout éloge. Que je\nvoudrais pouvoir multiplier ces établissements ! Notre vieux Fr. Dubé, que je craignais de ne plus retrouver en ce monde, est toujours chargé des petits garçons, quand ils ne sont point en classe. Je crois que si l'on voulait hâter sa mort, il faudrait lui enlever ses enfants. Il ne marche plus qu'à l'aide de bâtons ; il ressemble à un cadavre ambulant, et cependant il se fait encore craindre et respecter de ses enfants. Son unique désir est de vivre pour eux, de mourir au milieu d'eux et de reposer à côté de ceux qui l'ont déjà précédé dans l'éternité. Si je vous signale particulièrement le Fr. Dubé, c'est surtout en raison de son âge, car son zèle et son dévouement sont des qualités communes à tout le personnel de la mission de l'île à la Crosse. C'est le R. P. Moulin qui est principalement chargé du travail de cette mission ; il en a plus qu'il n'en peut faire. Le R. P. Legrand a passé à différentes reprises une partie de l'hiver dans un petit village que les Cris de l'île à la Crosse forment aujourd'hui à quelque distance de cette mission, il leur a fait beaucoup de bien et s'est rendu capable d'exercer avec facilité le saint ministère en leur langue ; il va maintenant profiter de la santé qui lui est revenue et de la connaissance des langues qu'il a acquise, pour travailler dans les postes environnants. Pour le R. P. Legoff, il est déjà peut-être parti pour le Grand-Portage, où il va passer quelques mois, avec ces chrétiens nombreux, mais jusqu'ici trop négligés, malgré toute notre bonne volonté. Nos bons Frères, de leur côté, travaillent activement à l'œuvre de Dieu, surtout en améliorant la position des Pères.\n\nLe 1er août, je partais de l'île à la Crosse, après avoir marié mon compagnon de voyage à une orpheline, élève de nos Sœurs. Je sais que nos saintes Règles nous défendent de nous occuper de mariages, et cependant ici je ne crois pas aller contre leur esprit en m'en occupant et en\nrecommandant à nos Pères de s'en occuper, car c'est une des œuvres les plus importantes de notre ministère. Les bons mariages font les bonnes familles, et c'est le moyen le plus efficace de régénérer nos populations. En mariant ce jeune homme, je faisais un grand sacrifice, car désormais je ne puis plus espérer de l'avoir pour compa-\ngnon dans mes longs voyages : les Sœurs aussi perdaient une utile auxiliaire en la personne de cette orpheline qu'elles élevaient depuis onze ans ; mais elles compren-\nnent que leur école est destinée à être une pépinière de familles chrétiennes. À notre départ de l'île à la Crosse, nous formions une petite caravane de huit personnes. Outre les jeunes époux, dont je viens de parler, et qui amenaient encore une autre élève des Sœurs, obligée par raison de santé de quitter l'île à la Crosse, j'avais avec moi le Fr. LALICAN, le Fr. PERREARD, le Fr. LERICHE, qui n'a pas encore pu faire son noviciat, et enfin Alexis. Nous nous mettons en bateau, car on ne part pas autre-\nment de l'île à la Crosse ; mais, après un voyage d'une demi-journée, nous trouvions des bœufs et des char-\nrettes. Je dois vous dire que nous entreprenons tout bon-\nnement d'ouvrir un chemin par terre pour aller de l'île à la Crosse au lac Vert. L'année dernière, le Fr. BOWES, aidé de quelques hommes, avait fait le tracé du chemin ; depuis, la compagnie y a fait travailler. Nous continue-\nrons ces travaux, afin de pouvoir faire le trajet avec des charrettes. Cette voie de communication est de la der-\nnière importance pour la mission de l'île à la Crosse qu'elle rend indépendante de la compagnie, sans laquelle nous ne pouvions jusqu'ici nous rien procurer. C'est pour nous une grande dépense, elle nous coûtera encore bien des souffrances, mais le succès sera pour nous une ample récompense, et nous pouvons dire que nous avons déjà réussi. Nous nous mettons donc en route avec trois char-\nrettes chargées de tous nos effets, de nos provisions et surtout de tous les outils et ferrailles du Fr. LERICHE. Nous sommes donc obligés d'aller à pied, souvent dans l'eau jusqu'à mi-jambe, mais je n'en suis pas trop fatigué, parce que nous voyageons lentement. Après avoir ainsi cheminé pendant quatre ou cinq jours, nous trouvons une autre charrette laissée là par nos ouvriers qui travaillent à faire la route. Nous y attelons un de nos bœufs, et je puis dès lors me faire trainer de temps en temps, ce qui me procure un peu de repos. Le 10, nous arrivons sur les bords de la rivière aux Castors, que nous trouvons gonflée par les pluies récentes. Après l'avoir sondée à divers endroits, nous reconnaissons qu'elle n'est pas guéissable, et nous sommes forcés de nous arrêter et de construire un radeau pour la traverser.\n\nPendant ce voyage, j'ai pu dire la sainte messe tous les matins ; nous faisions aussi, tous ensemble, la prière du soir, la lecture spirituelle suivie de la récitation du chapelet. Vous voyez que ce voyage n'était pas sans quelque agrément ; mais, le 11, je n'eus à ma messe que les deux femmes ; tout le monde dut travailler sans relâche à la construction du radeau, car le temps pressait. Nous n'avions plus de provisions que pour deux repas, et nous ne savions pas à quelle distance nous étions encore du poste du lac Vert. À dix heures nous pûmes commencer la traversée : au deuxième voyage, Baptiste et moi conduisions le radeau, les autres restèrent pour traverser ensuite avec les bœufs et les charrettes déchargées. Je ne m'entendais pas trop dans ce genre de navigation, nous eûmes bien du mal à maîtriser le courant et, arrivés à terre, je fus réduit à me servir de ma ceinture en guise de câble pour amarrer notre radeau à un arbre. Ne vous figurez pas, mon très-révéré Père, une ceinture d'évêque en belle soie, avec glands d'or, etc..., non, nous som-\nmes plus modestes dans ces régions ; ma ceinture est tout simplement une corde de crin qui peut me servir en cas de besoin de corde pour conduire mes bœufs, et de câble pour amarrer mon navire. J'avais laissé sur l'autre rive Alexis avec les Frères qui devaient tenter la traversée avec les charrettes et les bœufs. Deux de ces animaux se mirent à l'eau sous la conduite d'Alexis et du Fr. Perréard, et s'avancèrent fort bien tant qu'ils trouvèrent fond ; mais bientôt ils perdirent pied et se laissèrent aller au gré du courant avec charrette et cocher. À force de cris et de coups, on s'efforçait de les diriger vers la rive, quand la force du courant fit chavirer la charrette du Fr. Perréard. Le bœuf une fois sur le dos, et embarrassé de son attelage, ne pouvait plus nager, et devait nécessairement se noyer ; pour notre cher Frère, il était libre, mais malheureusement il ne savait pas nager ; plusieurs fois il alla au fond et revint sur l'eau en jetant un cri. Baptiste et moi, nous nous épuisions en efforts inutiles ; ne sachant pas nager, nous ne pouvions lui porter secours. Alexis seul aurait pu le faire, mais tout occupé de son bœuf et de sa charrette, il ne voyait pas le danger du Frère. Enfin il entend nos cris, voit le péril où était le Frère, se précipite vers lui, le saisit ; mais aussitôt nous les voyons disparaître tous deux dans le courant : leurs vêtements les empêchaient de nager et le pauvre Frère n'avait plus de force. Cependant ils reviennent à la surface de l'eau, mais sans pouvoir gagner terre, le courant les entraînait toujours. Enfin Baptiste trouve une longue branche au moyen de laquelle nous réussissions à les tirer à terre. Le Frère était sauvé et je le remis aux soins des infirmières. Cependant Baptiste était déjà occupé à sauver l'attelage abandonné par Alexis, tandis que celui-ci s'efforçait d'opérer le sauvetage de la charrette et du bœuf du Fr. Perréard, que le courant avait déjà eu-\ntraînés bien loin. Il nageait derrière la charrette faisant de vains efforts pour la pousser vers la rive. Alors je me mis à l'eau et saisissant quelques longues branches qui se trouvaient là, je pus atteindre le bœuf et l'attirer avec la charrette vers la terre. En un instant l'attelage est coupé, mais le pauvre animal était déjà mort. Je revins à notre campement, et à la vue du pauvre Fr. Perréard je ne pus contenir mon émotion, que la surexcitation du moment avait d'abord empêché d'éclater. Ce bon Frère était sauvé, mais en ce moment une autre inquiétude terrible vint m'assaillir, et je n'osais même pas en parler à mes compagnons. Le Fr. Leriche est bon nageur, et je fus saisi de la pensée qu'il avait peut-être voulu voler au secours de son Frère, et avait lui-même été emporté par le courant. Heureusement mes craintes étaient sans fondement : ce bon Frère était trop éloigné et n'avait pu rien voir de ce qui venait de se passer.\n\nBaptiste et Alexis, s'étant un peu remis en prenant une bonne tasse de thé chaud, remontent sur leur radeau et vont prendre tout ce qui restait encore sur l'autre rive. Puis ils se mirent à dépecer le bœuf noyé, qui nous fournit de la viande dont nous avions grand besoin. Cependant le chef commerçant du fort du lac Vert, ayant appris que nous étions en route, avait envoyé quelques hommes au-devant de nous. Je me mis avec eux en route pour le fort, où je passai un jour et deux nuits pour y donner les secours de mon ministère aux bons chrétiens qui habitent ce poste. L'accident de la rivière aux Castors nous avait fait perdre beaucoup de temps, et quoiqu'on me procurât des chevaux et que je pusse ainsi prendre le devant sur notre caravane, je n'arrivai à Carlton que le 23. Les autres, avec les charrettes, n'arrivèrent que le 28.\n\nLe R. P. André, qui avait passé une partie de l'été à Carlton, en était parti depuis quelques semaines pour\nporter ailleurs les bienfaits de son ministère ; mais à peine était-il parti que la petite vérole éclata dans le fort. Il y avait dans le voisinage un ministre presbytérien : ses coreligionnaires réclamèrent à plusieurs reprises le secours de son ministère, mais le révérend se garda bien de les venir voir. Le premier commis lui-même se trouva être du nombre, mais sous l'empire de la peur on ne connaît point de privilèges, et le révérend se contenta de lui envoyer une belle lettre où il l'exhortait à bien mourir. Quand elle arriva le malheureux commis était déjà à l'agonie, et je n'arrivai que deux jours après sa mort. Jugez si je fus bien reçu : tout le monde était heureux de me voir, les protestants comme les catholiques. Ma présence releva un peu leur moral et fit plus pour combattre le mal que tous les remèdes de la médecine. Je les visitai tous sans distinction, et je passai le jour et la nuit presque en entier au chevet de ces pauvres malades.\n\nNos Frères sont tous arrivés avec les charrettes, mais je les ai aussitôt dirigés sur Saint-Albert ; pour moi, je n'ai pas cru devoir m'éloigner d'ici dans les circonstances actuelles. Avant-hier j'ai enterré un de nos orphelins du lac la Biche, que j'avais administré auparavant. Le chef du fort, craignant que tous ne devinssent victimes du fléau, m'a prié de m'éloigner avec les familles ; il pensait que c'était le meilleur moyen de les soustraire à une mort certaine. Hier matin donc, 27 août, nous avons quitté le fort, et nous sommes venus camper ici sur les bords d'un petit lac dont j'ignore le nom. Je n'ai point de malades en ce moment, mais j'ai beaucoup de travail. La maladie et la mort sont d'éloquents missionnaires, et ces pauvres gens qui n'avaient pas profité du séjour du P. André parmi eux, en expriment aujourd'hui leurs regrets. Il faut voir leur zèle à se faire instruire et leur empressement à se confesser. Je leur fais quatre instructions par jour,\nsans parler de la sainte messe, du chapelet et de la prière du soir en commun.\n\n† Vital Grandin, O. M. I.\nEvêque de Saint-Albert.\n\nLETTRE DU R. P. LEDUC,\nAU T.-R. P. SUPÉRIEUR GÉNÉRAL.\n\nSaint-Albert, 22 décembre 1870.\n\nMon très-révérend et bien-aimé Père,\n\nLe compte rendu que je vous adresse aujourd'hui pour l'année 1870, vous fera connaître les travaux de vos enfants dans cette partie ouest de l'immense vicariat confié à la sollicitude de Mgr Grandin. Vous connaissez déjà en partie nos peines et nos consolations, vous y prendrez une large part. Puissent ces lignes vous parvenir et vous intéresser !\n\nÀ la fin de décembre 1869, Mgr Grandin quittait Saint-Albert pour aller visiter les missions de l'île à la Crosse et du lac Caribou, à l'extrémité est de son vicariat. C'était un long et pénible voyage de huit mois, qui devait s'effectuer tantôt en traineau à chiens, tantôt en canot, à cheval ou en charrette. J'accompagnai Monseigneur jusqu'à environ 8 kilomètres de Saint-Albert, et, après avoir reçu sa bénédiction, je revins m'occuper de mes œuvres.\n\nTout en exerçant le saint ministère au milieu de notre population blanche, métisse et sauvage de Saint-Albert, j'ai chaque jour à m'occuper de comptes, de marchés, d'entreprises, et surtout à aviser au moyen de nous procurer des vivres. En comptant les deux communautés, la nôtre et celle des Sœurs, les orphelins et les orphelines, les serviteurs et les servantes, nous sommes une cinquantaine de personnes à Saint-Albert. Mon grand souci, cha-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009611.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 17758, "total-output-tokens": 6688, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1420, 1], [1420, 3308, 2], [3308, 5239, 3], [5239, 7173, 4], [7173, 9105, 5], [9105, 11032, 6], [11032, 12941, 7], [12941, 14833, 8], [14833, 16773, 9], [16773, 18667, 10], [18667, 20607, 11], [20607, 22116, 12]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false]}}]