[{"id": "d9a19983abe3dc202c7db5d72d8d78df0082930e", "text": "LETTRE DU R. P. LEDUC AU R. P. MARTINET,\nSECRÉTAIRE GÉNÉRAL.\n\nSaint-Albert, le 29 décembre 1872.\n\nMON RÉVÉREND ET BIEN CHER PÈRE,\n\nJ'aurais dû vous adresser plus tôt quelques détails sur nos Missions de la Saskatchewan et vous rendre compte des travaux entrepris, des missions données par les Pères de Saint-Albert ou des résidences environnantes. C'est à vous que j'adresse aujourd'hui ce rapport annuel. Puissait-il vous intéresser un peu ! Celui qui vous l'adresse ne saurait oublier le Père qui, pendant deux ans, fut pour lui un excellent directeur et un charitable supérieur au scolasticat d'Autun.\n\nAu commencement de l'année 1872, la communauté de Saint-Albert se composait de S. G. Mgr Grandin, notre révérendissime vicaire ; du R. P. Leduc, du R. P. Dupin, du F. Scollen, scolastique ; des FF. CC. Bowes, Perréard, Alexandre Lambert, Paul Grezeau et François Leriche. Pendant tout l'hiver, Monseigneur nous a donné l'exemple de l'étude en travaillant lui-même à se perfectionner, sous la direction de notre cher Frère irlandais C. Scollen, dans la connaissance de la langue anglaise, langue qui, dans peu d'années, sera indispensable aux Missionnaires de la Saskatchewan. Jusqu'à présent nous n'avons eu aucun ministère à exercer auprès des populations anglaises dans ce pays, mais nous comptons avant peu sur une immigration catholique d'Irlande ou du haut Canada ; il nous faudra nécessairement connaître bien l'anglais. Tout en enseignant cette langue à Saint-Albert, le F. Scollen faisait son cours de philosophie sous la direction du R. P. Leduc. Monseigneur et moi étions spécialement chargés de l'exercice du saint ministère à Saint-\nAlbert. Le R. P. Dupin, chargé de faire journellement le catéchisme aux enfants et de desservir la Mission de Saint-Joachim au fort Edmonton, s'est acquitté avec zèle de ce double emploi. Il a pu préparer, pour la fête de Pâques, bon nombre d'enfants des deux sexes à la première communion et au sacrement de confirmation. Notre population métisse de Saint-Albert a, bien certainement, été pour nous un sujet de consolation l'hiver dernier, par l'assiduité qu'ont montrée nos chrétiens à s'approcher des sacrements et à assister aux différents exercices de piété auxquels nous les avions invités spécialement pendant le Carême. Les quarante heures, qui ont précédé, ont parfaitement été suivies ; il y a eu, on peut dire, communion générale de nos bons métis. Ici nous n'avons point, comme en France, à déplorer les scandales du carnaval : c'est, Dieu merci, une chose complètement inconnue. Ce temps est un temps de prière et nullement de dévergon- drage. Chaque soir, pendant la sainte quarantaine, nous avons eu la consolation de voir accourir en foule nos chrétiens à l'église. Chaque soir, avant la bénédiction du très-saint Sacrement, nous leur adressions une instruction tantôt en cri, tantôt en français. Monseigneur et le R. P. Dupin traitaient les commandements de Dieu ; le F. Scollen et moi nous expliquions les sacrements. Le mercredi et le vendredi, l'instruction était remplacée par l'exercice du chemin de la Croix.\n\nDans ce même temps, le R. P. Lacombe était à Saint-Paul des Cris avec nos deux plus jeunes Pères, les Rr. PP. Doucet et Blanchet. Ce cher P. Lacombe, tout en donnant ses soins aux quelques familles métisses groupées autour de la Mission, et aux sauvages qui pouvaient de temps en temps passer par sa résidence, le P. Lacombe, dis-je, mettait la dernière main à ses ouvrages en langue crise et enseignait cette langue à ses deux compagnons.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009714.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 2, "total-input-tokens": 2952, "total-output-tokens": 1060, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1651, 1], [1651, 3523, 2]], "primary_language": ["fr", "fr"], "is_rotation_valid": [true, true], "rotation_correction": [0, 0], "is_table": [false, false], "is_diagram": [false, false]}}]