[{"id": "39010e28f4d9e9430b80902a54e00b57cee743e0", "text": "contre les hérésies; qu'ils la supplient de soutenir et d'encourager ses Oblats!\n\nExcusez-moi, bien-aimé Père, et voyez toujours en moi un fils respectueux et soumis.\n\n† Vital, O. M. I.,\nEvêque de Saint-Albert.\n\nMISSION DU LAC PÉLICAN, DISTRICT DE CUMBERLAND.\n\nPar deux lettres successives, adressées au R. P. Soul-\nlier, le R. P. Bonnald, missionnaire du lac Pélican, donne les intéressants détails suivants:\n\nLac Pélican, le 6 décembre 1889.\n\nMon révérend et cher Père,\n\nÀ la veille de partir pour un long voyage vers la baie d'Hudson, où nous allons célébrer pour la première fois les belles fêtes de Noël, je vous adresse cette lettre, que le courrier de la Compagnie prendra en passant, pendant mon absence.\n\nVeuillez avoir la bonté de demander pour moi, à Mme la Présidente de l'Œuvre apostolique de Paris, la faveur d'un envoi comme celui qui s'est perdu en 1884. Nous en avons grand besoin.\n\nUn grand nombre de sauvages du fort Nelson, enrôlés jadis dans la secte des méthodistes, ont reçu la grâce de la vraie foi. Dans les différentes visites que je leur ai faites, j'ai reçu environ deux cents abjurations. Ils sont aujourd'hui de fervents catholiques.\n\nDepuis longtemps je désirais avoir pour eux, dans leur pays, une chapelle où ils viendraient prier et être témoins de nos saintes cérémonies. Mais la caisse vicariale ne pouvant nous y aider, il a fallu attendre longtemps. Enfin, petit à petit, nous sommes parvenus à construire une cha-\npelle, avec une petite habitation pour le missionnaire. C'est le bon P. CHARLEBOIS qui est allé achever les travaux l'été dernier. À son retour, il m'a apporté des lettres des sauvages, qui me supplient de leur accorder le bienfait de la messe de minuit, à Pakitawagan.\n\nNos bons sauvages catholiques du lac Pélican et de Pakitawagan ont une excellente pratique, qui leur attire les bénédictions de Dieu : la visite quotidienne du très Saint-Sacrement, durant tout le temps qu'ils passent auprès d'une église. Je pense bien que Notre-Seigneur aura de fidèles adorateurs dans la nouvelle chapelle de Pakitawagan. Cela me fait espérer aussi que, bientôt, ce qui reste de protestants dans ce pays entrera dans le giron de la véritable Église.\n\nNous n'avons pas eu de visite pastorale depuis 1884. Mais elle nous est annoncée pour le printemps prochain. Je m'en réjouis beaucoup, car, chaque fois, c'est un véritable triomphe pour notre sainte religion.\n\nL'évêque anglican, d'ailleurs très poli, a passé ici à peu près inaperçu, l'été dernier, accompagné de son archidiacre, qu'on appelle le vénérable. Ce « vénérable » est un métis qui parle fort bien le cri et qui, dans son sermon, a poussé une pointe à notre religion en parlant de la communion sous les deux espèces, ce qui ne l'a pas empêché de donner la galette en espèce et en substance à tous ses coreligionnaires, indifféremment, concubinaires et adultères publics ; préalablement, cependant, il y avait eu un simulacre de confession, car chaque fidèle allait, à tour de rôle, parler seul en secret au ministre.\n\nÀ mon retour de Pakitawagan, j'espère pouvoir vous écrire un petit rapport.\n\nVeuillez bien prier pour moi, mon révérend Père, et agréer l'hommage de mon respect et de mon entier dévouement.\n\nBUNNARD, O. M. I.\nPelican Narrow's, district de Cumberland,\nle 17 janvier 1890.\n\nMon révérend Père,\n\nVoici le récit que je vous ai promis de mon voyage sur le fleuve Churchill, près de la baie d'Hudson.\n\nParti, le 12 décembre, de la Mission du lac Pélican, j'ai été de retour le 31. A moitié chemin, j'ai fait une halte dans un village indien, à l'embouchure de la rivière Esturgeon, affluent du Churchill. Il y a six maisons et une loge. Ces bons sauvages, tous mes enfants spirituels, font la chasse aux fourrures et la pêche aux esturgeons, et avec succès. Une famille que nous avions rencontrée en chemin, mourant de faim et manquant de tout, s'était jointe à notre caravane pour venir quêter au village. En effet, l'abondance de l'esturgeon dans ces parages permet aux habitants de fournir aux mendiants de quoi vivre pendant quelques jours.\n\nLa maison d'Alexandre Costal, que j'avais choisie pour hôtel, fut trop petite pour contenir tous les chrétiens, à la messe du dimanche. Pour dédommager les absents, j'allai les visiter tous, m'asseoir à leur foyer et leur conter quelque bonne histoire, qu'ils sont toujours avides d'entendre.\n\nJe repartis le lendemain, en leur donnant rendez-vous à Pakitawagan, pour la messe de minuit.\n\nPakitawagan est la Mission naissante du Sacré-Cœur de Jésus. En 1878, j'y faisais ma première visite, et, l'été dernier seulement, après onze ans d'attente, j'ai pu y faire bâtir une chapelle, avec une maison pour le prêtre.\n\nEn y arrivant, cette fois, le 18 décembre, je fus heureux d'y voir tout bien préparé, surtout à la chapelle. J'employai mon temps à orner l'autel de mon mieux et à faire une crèche ; car j'avais apporté le bel Enfant Jésus du\nlac Pélican. Nos sauvages allaient voir, pour la première fois, les fêtes de Noël, après lesquelles ils soupiraient depuis si longtemps. Malheureusement, un grand nombre n’avaient pas été avertis à temps, et ils étaient trop loin pour arriver. Je dépêchai un sauvage au camp le plus rapproché. Le 24 décembre, de deux points opposés arrivaient douze traîneaux de sauvages, avec femmes et enfants. Je les confessai tous, et en préparai sept à leur première communion.\n\nEn attendant l’heure de minuit, nos chrétiens, campés dans les quatre maisons de Pukitawagan, s’essaient aux cantiques de Noël. J’allumai cinquante bougies autour de la chapelle et à l’autel, et je couvris d’un voile l’Enfant Jésus.\n\nUn peu avant minuit, au son de la cloche, tout notre monde se réunit à la chapelle. Nous commençâmes par chanter : Venez, divin Messie. Ces bons sauvages désiraient voir l’Enfant Jésus. Je l’ai découvert, à la fin du cantique, en entonnant : Il est né le Divin Enfant. Les yeux de nos Indiens se sont dès lors fixés sur cette image du Divin Sauveur, sans pouvoir s’en détacher. C’était, pour eux, comme une vision du Ciel. Cet enfant si joli, si bon, si aimable, leur semblait vivant. J’ai profité de leur sainte émotion pour leur expliquer le mystère du jour et les encourager à suivre fidèlement, jusqu’à la mort, les enseignements de notre sainte religion, pour mériter le bonheur de voir à découvert et d’aimer éternellement notre Divin Sauveur. « Ah ! Némievegiten » (je suis content), disait chaque sauvage en contemplant la sainte image.\n\nCes bons Indiens, plus pauvres que les bergers de Bethléem, ont voulu faire à Jésus, comme les Mages, des présents de roi. Un vieillard, vêtu de peaux de lièvre, lui offre une fourrure de martre ; un autre lui apporte quel-\nques bolettes. C'était plus que l'obole de la veuve. Chacun a voulu se montrer généreux. Tous exprimaient leur reconnaissance d'avoir une église, où l'on viendra désormais, de tous les environs, pour prier, se confesser, assister au saint sacrifice.\n\nCette joie de l'âme, que le bon Dieu a accordée à ces bons chrétiens en cette circonstance, les a dédommagés du jeûne forcé qu'il leur a fallu subir. Le pain de la parole divine et le pain de vie ne leur ont pas manqué ; mais le pain que le mauvais esprit proposait à Notre-Seigneur dans le désert leur a fait défaut. Pas de viande, très peu de poisson et quelques pommes de terre, voilà, je ne dis pas notre régal ni notre réveillon, car nous n'avons eu ni l'un ni l'autre, mais de quoi vivre bien chétivement pendant deux jours. Je leur ai fait grand plaisir en leur donnant quelques poignées de farine, pour se faire de la bouillie. Ils sont partis joyeux, bien que l'estomac léger, par un froid très rigoureux, sanctifiant leurs souffrances par le doux souvenir de la messe de minuit, de l'Enfant Jésus et de la sainte communion. Ils portaient le scapulaire sous leur chemise, le chapelet à leur cou, et le livre de prières enveloppé dans un petit sachet et soigneusement placé sur le traineau.\n\nDe mon côté, je revenais au lac Pélican, en compagnie d'une vingtaine de sauvages, qui devaient s'arrêter chez eux à mi-chemin. Il faisait un froid rigoureux. Courir après les chiens et les traineaux était le seul moyen de maintenir la chaleur vitale. Malheureusement pour moi, le souffle me manqua vite, et je me voyais condamné à grelotter sur mon traineau. Même au campement, on gérait devant le feu, où flambaient les géants de la forêt. En faisant notre prière, le dos tourné vers le feu, le givre s'attachait à nos cheveux, aux cils des yeux et à la barbe. Aussi notre sommeil fut-il court. Je voulais marcher, car\nnous entrions dans les bois ; mais mon sauvage ne le vou-\nlut pas. « Embarque, dit-il ; enveloppé sur le traîneau,\net à l’abri du bois, tu n’auras pas froid ; tandis que, si tu\nmarchais, comme il fait noir, quelque branche pourrait\nte blesser au visage. » Et vous pouvez croire qu’il faisait\nattention à ce que le traîneau ne versât pas.\n\nJe les aime, ces pauvres enfants des bois, car je les con-\nnaissais. Ils ont bien des défauts, mais peu de vices et beau-\ncoup de vertus. Ils sont sincèrement attachés à leurs mis-\nsionnaires ; ils cherchent à leur épargner la souffrance tant\nqu’ils peuvent. Ils aiment à se confesser, et se confes-\nsent très bien. Dans le village où je m’arrêtai deux jours,\nje fis semblant de ne pas faire attention à un homme qui\na longtemps résisté à la grâce et qui, depuis son baptême,\nparaît très indifférent. Tous se confessèrent ; il ne res-\ntait plus que lui. Je ne l’appelai pas. Dans la nuit, il\nm’envoya son fils pour me dire : « Moi, seul, je fais pitié.\nToi, prêtre, tu as entendu les confessions des autres, et\ntu ne fais pas attention à moi. » Aussitôt, je prends mon\nsurplice et mon étole, et je vais trouver le pauvre mécon-\ntent. Il était assis, avec sa femme, dans sa hutte en terre\net en bois. Sa femme le laissa seul avec moi ; je m’in-\nstallai près du foyer sur une bûche de bois, et le brave\nhomme se confessa de tout son cœur.\n\nLe lendemain, je célébrai la grand’messe, à laquelle\nvinrent assister tous les absents de la messe de Noël ;\npuis je passai le reste de la journée à entendre les con-\nfessions des enfants, à instruire les plus ignorants et à\nchanter avec eux des cantiques.\n\nLe 14 décembre, nous repartions, pour arriver au\nlac Pélican. Mais nous dûmes camper encore à moitié\nchemin. Le froid devenait plus intense. La nuit fut ter-\nrible. Les arbres craquaient dans la forêt. Le meilleur\nmoyen de résister au froid était de nous remettre en\nmarche. Nous partimes. Nos chiens allaient bien par cette température et dans la nuit. Ils allaient si bien, que nous arrivions à la Mission avant le lever du soleil.\n\nVoilà, mon révérend Père, un bien fade rapport, tracé au courant de la plume. Veuillez m'excuser et n'y voir qu'une preuve de ma bonne volonté.\n\nPriez pour moi, et croyez aux sentiments respectueux et affectueux de votre dévoué frère en Notre-Seigneur et Marie Immaculée.\n\nBonnald, O. M. I.\n\nLETTRE DU R. P. DONAT FOISY AU R. P. BOISRAMÉ,\nMAÎTRE DES NOVICES A NOTRE-DAME DES ANGES.\n\nMission Saint-Paul des Piéganes, le 7 avril 1889.\n\nMON RÉVÉREND ET BIEN CHER PÈRE,\n\nC'est le temps de faire mon tour au noviciat, si je veux être fidèle à ma résolution d'y venir régulièrement chaque année.\n\nDepuis ma dernière lettre, mon révérend Père, je suis établi à 13 milles du fort Macleod, sur la Réserve des Piéganes. Pendant plus d'un an, j'ai été le compagnon du R. P. Legal, que j'ai remplacé souvent pendant ses voyages à Macleod, Pincher-Creek et sur la Réserve des Gens du Sang. J'ai pu, de la sorte, m'habituer, petit à petit, à diriger cette petite Mission moi-même, et, depuis le 1er janvier, je suis devenu le curé proprement dit des Piéganes, le P. Legal ayant fondé une nouvelle Mission chez les Gens du Sang, à 20 ou 25 milles d'ici. Il a bâti là une bonne maison d'école, grâce aux secours qu'il a pu recevoir du département indien et de deux bienfaiteurs et amis du R. P. Lacombe. Je suis ici avec le bon et dévoué F. Jean", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009647.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 7, "total-input-tokens": 10424, "total-output-tokens": 3785, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1453, 1], [1453, 3231, 2], [3231, 4902, 3], [4902, 6674, 4], [6674, 8546, 5], [8546, 10448, 6], [10448, 11945, 7]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false]}}]