[{"id": "b2132c26f0623dfaeefed96677779cfc492ac2e5", "text": "... Presque à chacune de mes visites nous avons la joie de donner le baptême à quelques païens soit enfants soit adultes. Quelle moisson ne recueillerions-nous pas, si nous pouvions résider au milieu de ces pauvres gens! Ah! mon révérend Père, priez pour nous, priez pour nos sauvages! *Mensis quidem multa, operarii autem pauci.*\n\nTh. P. CAMPEAU, O. M. I.\n\n---\n\n**UNE CONVERSION.**\n\nSous ce titre, nous lisons dans la *Semaine religieuse de Grenoble*: Notre compatriote le R. P. Hugonnard, missionnaire oblat de Marie, nous adresse de l'école sauvage industrielle du lac Qu'Appelle (Amérique du Nord), à la date du 22 mars 1890, l'intéressant récit suivant:\n\nPaskoua (ou Paskoi) était un des principaux chefs sauvages qui signèrent le traité avec le gouvernement canadien en 1874. Il choisit sa Réserve à l'ouest du fort Qu'Appelle, le long des lacs, à 16 milles de notre école sauvage. Il avait alors six femmes et vingt-huit enfants. Un pareil ménage devait nécessairement le tenir éloigné de notre sainte religion; aussi personne ne la détestait plus que lui. Il était, de plus, profondément attaché à ses superstitions dont la principale, appelée *danse du soleil*, est, pour les sauvages, un acte de culte public rendu au démon. Plusieurs fois, chaque année, Paskoua y convoquait sa bande, et tous devaient y assister, car il ne permettait à aucun de ses sauvages de se faire catholique.\n\nCependant, en 1880, une femme de sa Réserve se convertit à son lit de mort, grâce, sans doute, aux prières d'un de ses enfants décédé l'année précédente après avoir reçu le baptême, et à une médaille de la sainte Vierge dont elle avait hérité de ce même enfant. Avant de mou-\nrir, elle obtint de son mari la promesse qu'il se convertirait, ce qu'il fit avec cinq autres familles de sa parenté, et cela malgré l'opposition bien connue du chef, qui n'en devint que plus hostile à notre sainte religion. Aussi, lorsqu'il s'agit de se prononcer entre une école catholique et une école protestante pour sa Réserve, son choix fut vite fait; il envoya ses enfants à l'école protestante.\n\nEn 1884, quand j'allai, avec le R. P. Magnan, donner une mission sur sa Réserve, il réunit tous ses hommes et les amena devant notre tente, espérant nous effrayer. Il nous dit qu'il en connaissait plus long que nous sur l'autre vie; qu'il y était allé lui-même; que les sauvages, faits de terre noire, avaient une autre religion que les blancs, faits avec de la terre blanche; qu'ils avaient une autre destinée, etc., etc., et enfin il conclut en nous ordonnant de sortir de sa Réserve. Bien entendu nous n'en fimes rien.\n\nL'automne passé, je réussis, à force de bonté, à obtenir que deux de ses enfants vinssent à notre école industrielle. Peu après, il tomba malade. J'allai le visiter plusieurs fois, mais sans grand espoir de le convertir. Dans la première semaine de mars, j'y retournai de nouveau. Il avait abandonné sa maison pour se mettre en tente sur une hauteur. « C'est là, disait-il, que je veux être enterré, et je veux aussi que, sur ma fosse, on laisse ma tente avec du tabac et des provisions. » En me voyant entrer, il dit d'un air moqueur : « Ce Français (ce qui, en sauvage, veut dire catholique) a cru que j'étais mourant et il est venu, sans doute, pour donner une bonne direction à mon âme, comme s'il en était capable! » Je ne répondis rien à cette boutade, mais, peu après, je lui dis : « Paskoua, je sais que tu détestes la religion; cependant, je viens te voir, parce que je t'aime et aussi parce que c'est mon devoir. Le bon Dieu me punirait si je te lais-\nsais aller en enfer sans t'avertir. Tu n'as plus longtemps maintenant à choisir entre le ciel et l'enfer. Je ne veux pas t'ennuyer en te parlant longuement de religion. Je veux te dire que, si tu meurs sans être baptisé, tu n'as que l'enfer à attendre pour l'éternité. Je vais maintenant partir. Quand tu voudras me voir, tu n'auras qu'à me faire demander ; que ce soit le jour ou la nuit, n'importe à quelle heure, je m'empresserai de venir. » — Il me répondit qu'il ne voulait pas prier, parce que plusieurs de ses enfants étaient morts sans prier et qu'il voulait les revoir dans l'autre monde. « Tu te trompes, lui dis-je. La vue de tes enfants dans l'enfer ne serait pour toi qu'un nouveau supplice ajouté aux autres. Il n'est pas vrai qu'il y ait un ciel pour les blancs et un ciel pour les sauvages. Dieu aime également tous les hommes ; il les punit ou les récompense également tous, selon leurs œuvres et non d'après leur couleur. » Je le quittai, après avoir caché dans son lit une médaille de saint Benoît, et, en arrivant, je mis en prière nos cent dix petits sauvages chrétiens.\n\nQuelques jours après, au commencement de la nuit, un de ses fils arrive à l'école industrielle et me dit que son père veut me voir. Je pars immédiatement et, vers 11 heures du soir, j'étais chez le malade, après avoir fait 30 kilomètres sur un lac gelé. À peine étais-je entré qu'il me demanda de l'emmener chez nous. Je lui fis observer qu'il était trop malade pour faire un si long trajet, mais que, s'il voulait, je prendrais soin de lui dans sa tente. Il se recoucha sans mot dire. Je compris qu'il avait quelque velléité de se convertir, mais qu'il n'osait le faire devant les autres sauvages, tous païens. Je le veillai toute la nuit, lui parlant de temps en temps de religion ; mais il ne répondait pas ou ne donnait qu'une réponse évasive. Embrasser notre sainte religion en pré-\nsence de ceux devant qui il l'avait si souvent vilipendée était une humiliation trop grande pour lui. Il fallait, pour braver cette humiliation, un courage héroïque que, seule, une grâce extraordinaire pouvait lui donner. Mais il avait au ciel deux anges qui intercédaient pour lui, deux enfants qu'il avait laissé baptiser à l'article de la mort. Le lendemain matin, je crus devoir le presser un peu plus. Il me répondit en sauteux, langue que je ne comprends pas bien et que personne des assistants ne voulut m'interpréter en langue crise. Ils me dirent qu'au lieu de l'ennuyer ainsi, en lui parlant de religion, je ferais beaucoup mieux de m'en aller; que, s'il voulait être baptisé, il saurait bien le dire, et que, d'ailleurs, eux-mêmes ne voulaient pas que je le baptise. Je répliquai que j'étais venu ici sur sa demande et que, s'il désirait le baptême, personne ne m'empêcherait de le lui donner. Je m'adressai de nouveau au malade; mais il était intimidé et garda le silence. Voyant que je ne pouvais rien gagner, je me décidai à partir, le cœur bien triste. Je fis lentement quelques centaines de verges sur mon traîneau; mais, à mesure que je m'éloignais, je sentais une voix intérieure qui me reprochait de quitter le malade avant qu'il eût positivement refusé le baptême. Je revins sur mes pas et j'allai chercher un sauvage chrétien qui pût me servir d'interprète. Chemin faisant, je priai de toute mon âme la sainte Vierge et saint Joseph, et, me souvenant de ce qu'affirme sainte Thérèse qu'elle n'avait jamais rien demandé à saint Joseph sans l'obtenir, je conjurai ce grand saint de toucher cette âme, lui promettant, en retour, de dire plusieurs messes d'actions de grâces et de donner au mourant le nom de Joseph, si j'avais le bonheur de le baptiser. J'arrive donc avec mon interprète chez le malade et je commence à l'instruire en cris, langue qu'il comprenait. Pour toute réponse, il\nse tourne de l'autre côté et me dit qu'il est fatigué. Je n'insiste pas, mais je me décide à passer de nouveau la nuit auprès de lui, dans l'espoir de trouver une occasion favorable.\n\nAu commencement de la nuit, je lui demandai s'il comprenait bien les instructions que je lui donnais. « Oui », me dit-il. Je lui parlai du baptême. « Je verrai plus tard. — C'est un mauvais calcul, répliquai-je. Beaucoup de malheureux sont maintenant en enfer pour avoir renvoyé leur conversion à plus tard. N'écoute pas les autres. Si tu vas en enfer, ils ne viendront pas souffrir pour toi... Veux-tu que je te baptise ce soir ou aimes-tu mieux attendre à demain ? — Demain », me dit-il. Les deux principaux de sa bande étaient, en ce moment, près de nous. Dès qu'ils s'aperçurent que le malade parlait sérieusement de se convertir, ils firent chacun plusieurs discours, soit pour le détourner, soit pour m'intimider. L'un d'eux, qui s'appelle « le Ciel-toujours-clair », me disait : « Pourquoi l'ennuies-tu en lui parlant de religion ? Tu sais bien qu'il n'en voulait pas lorsqu'il était bien portant. Il est maintenant trop malade pour savoir ce qu'il fait », etc., etc. Il finit par me répéter : « Nous ne voulons pas que tu le baptises. — Je suis ici au nom du bon Dieu, lui dis-je, et c'est à Dieu que j'obéirai. Si Paskoua veut se faire baptiser maintenant, ce n'est pas parce qu'il a perdu connaissance, mais parce qu'il ne veut pas aller en enfer. À la mort, on pense souvent autrement que pendant la vie. Tu me défends de le baptiser ; tu veux donc qu'il aille en enfer ? Tu as, maintenant, de la peine à le voir souffrir et tu voudrais l'envoyer brûler en enfer pour toujours ? Voyons, voici un feu, mets-y donc la main pendant une heure et ensuite tu parleras. S'il va dans l'enfer, est-ce vous qui l'en sortirez ? Si tu marchais la nuit par un chemin où il y a un\nprécipice que tu ne reconnusses pas, je t'en avertirais et je n'écouterais pas ceux qui me défendraient de te le dire. Quand tu seras mourant comme lui, si je peux t'aider à aller au ciel, personne ne m'en empêchera. »\n\nCe fut le tour de l'autre sauvage : « Si nous savions qu'il y a un enfer, dit-il, nous nous ferions tous baptiser ; mais il n'y en a pas. Les sauvages baptisés ne peuvent entrer ni dans le ciel des blancs ni dans le ciel des sauvages. Nous voulons voir notre chef dans l'autre vie et nous ne voulons pas que tu le baptises. Sors d'ici. » Je lui répondis : « Si tu ne sais pas s'il y a un enfer, tu dois écouter ceux qui le savent, et moi je le sais. Ce que je vous dis, ce n'est pas ma parole, c'est la parole du bon Dieu. Dieu ne fait pas de différence entre les sauvages et les blancs ; il ne regarde pas la couleur de la peau, mais le cœur. Un sauvage qui meurt avec un cœur pur va au ciel, et, s'il meurt avec un péché mortel ou sans être baptisé, il va dans l'enfer, comme les blancs. »\n\nJe dus réfuter plusieurs fois ces objections et autres semblables, dans la crainte qu'elles ne fissent impression sur le malade. Je passai encore la nuit près de son lit, lui prodiguant mes soins et surtout l'instruisant. Vers le matin, lorsque je vis la plupart des assistants endormis, je lui parlai de nouveau de la nécessité du baptême. Il me répondit : « Je veux me faire baptiser. » Deux de ses femmes qui étaient dans une tente voisine, à quelques pieds seulement du malade, entendirent sa réponse et l'une d'elles vint me sommer de sortir immédiatement. Sur mon refus, elle se mit à pleurer. Les autres, réveillées par le bruit, accoururent aussitôt, et ce fut une scène indescriptible de cris et de pleurs. Cependant, sans me laisser intimider, je suggérai au malade les actes de foi, de charité et, surtout, de contrition, qu'il répétait après moi, baisant ma croix avec amour. Je dis au ma-\nlade à haute voix : « Maintenant, si tu veux être baptisé, lève-toi. » Il se dresse aussitôt sur son séant ; mais une de ses femmes s'avance, le pousse avec violence et le fait tomber sur son lit en disant : « Couche-toi donc ; qu'est-ce que tu fais là ? » Il se relève de lui-même et, de son bras défaillant, repousse sa femme en lui disant : « Est-ce toi qui es le maître de ma vie ? » Sans perdre de temps, j'ouvre mon sac des malades pour prendre l'eau baptismale ; elle était gelée. Que les quelques minutes qu'il fallut pour faire fondre la glace me parurent longues ! C'était le moment décisif de cette lutte qui se poursuivait depuis plusieurs jours ; les femmes, les parents, les prétendus amis entouraient le moribond et l'accablaient de reproches. Enfin, l'eau baptismale étant prête, je suggérai au malade un acte de contrition ; il baisa de nouveau ma croix, puis il avança son front et je versai l'eau du baptême au milieu d'un redoublement de cris et d'impréca tions. Satan était vaincu ; et, chose étonnante, quand on ne connaît pas les mœurs de ces sauvages, à peine avais-je achevé d'administrer le saint baptême au malade, que les cris et les pleurs cessèrent. J'étais désormais reconnu comme son maître. Jusqu'à sa mort, qui arriva le lendemain, je ne le quittai pas, mangeant avec les sauvages, prenant un peu de repos de temps en temps sur une peau étendue par terre, à côté d'un feu allumé au milieu de la tente. Je suggérai souvent au malade des sentiments de foi, d'espérance, de charité, de reconnaissance et de contrition. Il s'unissait à moi et baisait ma croix avec des sentiments qui me touchaient profondément. Après sa mort, je l'ensevelis moi-même et le fis porter à la Mission, où je le mis dans un cercueil.\n\nLe lendemain, beaucoup de ses parents et plusieurs sauvages vinrent au service. Je profitai de l'occasion pour leur donner une instruction. Je me fis l'interprète des\ndésirs et des derniers sentiments du mourant à leur égard. Beaucoup entraient dans une église pour la première fois. Aujourd'hui, une croix plantée sur sa tombe porte cette inscription : « Ici repose Joseph Paskoua, chef indien, mort le 15 mars 1890, âgé de soixante-dix ans, régénéré par le saint baptême »,\n\nJ. HUGONNARD, prêtre, O. M. I.\n\nVICARIAT DE SAINT-ALBERT.\n\nLETTRE DE Mgr GRANDIN AU T. R. P. SUPÉRIEUR GÉNÉRAL.\n\nEvêché de Saint-Albert, le 6 avril 1889.\n\nMON TRÈS RÉVÉREND PÈRE,\n\nJe pense vous avoir dit que le P. Le Goff a quitté sa Mission de Saint-Raphaël et s'est rendu au Canada civilisé, dans le but d'y faire imprimer plusieurs ouvrages en montagnais. Cette langue étant, je crois, la plus difficile de toutes celles qui se parlent dans notre immense Nord-Ouest, je ne voudrais pas, pour beaucoup, que le fruit de plus de vingt-cinq années de travail fût perdu pour nos sauvages et surtout pour ceux de nos Pères qui seront, un jour, appelés à continuer notre œuvre. Le Père quittait donc sa Mission au mois de décembre dernier, y laissant le cher P. Pénard, arrivé depuis peu de temps, qui pouvait à peine balbutier quelques mots dans la langue du pays, mais qui pouvait, au moins, dire la sainte Messé, faveur grandement appréciée de sauvages bons chrétiens, comme le sont nos Montagnais. Le P. Le Goff n'avait pas une petite tâche à remplir. Le tout n'était pas de trouver une imprimerie et de corriger les épreuves. Il fallait avoir de quoi payer. L'impression seule, sans compter la reliure (et les livres pour les sauvages doivent être reliés solide-", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/P009645.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 8, "total-input-tokens": 11946, "total-output-tokens": 4536, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1671, 1], [1671, 3561, 2], [3561, 5442, 3], [5442, 7349, 4], [7349, 9211, 5], [9211, 11126, 6], [11126, 13037, 7], [13037, 14610, 8]], "primary_language": ["fr", "fr", "fr", "fr", "fr", "fr", "fr", "fr"], "is_rotation_valid": [true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false]}}]