[{"id": "40e46a343f091012cef7e01d1696cf8a96e5704d", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY JANUARY 27, 1883.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nPractically all business transacted.\nBranches at Prince Albert, Regina, and Saskatoon.\nBanking House established in 1882.\nBranches at Prince Albert, Regina, and Saskatoon.\n\nJ. LESTOCK REID\nDominion Land Surveyor.\nPRINCE ALBERT\n\nA.C. PATTERSON,\nForeman Gardener.\nPRINCE ALBERT\n\nSTANDARD TIME\n\nTELEGRAPH OFFICE.\n\nNOTICE.\n\nWith the great advance in communications by telegraph and telephone, it becomes necessary for everyone to be aware of the time differences between various cities. The Standard Time Act of 1884 established a uniform time zone across North America, which is now known as Central Standard Time.\n\nMEETING\n\nThe Annual Meeting of the Saskatchewan Rifle Association will be held in the Town Hall on Wednesday, Feb. 1st, at 8 p.m.\n\nMEETING\n\n20 DAYS GRACE.\n\nLast and Final Notice\n\nWe beg to inform all parties indebted to us that our books are now closed, and all accounts net paid after the 20th inst. will be considered as in the hands of our solicitor for collection.\n\nCLEARING SALE\n\nMILLINERY AND FANCY GOODS\n\nSHANNON & MCLEOD\n\nFISHING\n\nTO AGENTS\n\nW. R. FISH.\nClearing Sale.\n\nParlor Stoves\nBox Stoves\n\nAcme Skates\n\nT. J. Agnew's\nClearing Sale.\n\nHaving on hand a large stock of\nFancy Goods and Toys\n\nWhich have been disposed of at reasonable prices, I have decided to offer the balance of these goods at cost.\n\nCall early and take advantage of this offer, which will remain open until February 15th.\n\nT. N. Campbell's\nThe Prince Albert Times\nSaskatchewan Review.\n\n$2.50 per annum\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJob Printing\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. Maveety\nPublisher and Proprietor.\n\nTHE GLOBE\n\nThe oldest established and the leading newspaper of Canada.\n\nDaily Globe, Morning Edition.\nWeekly Globe, Saturday Daily Globe.\n\nTo advertisers—\n\nAs an advertising medium, The Globe has no equal in Canada. Its circulation, which appears at hand of its editorial office, is far in advance of any other Canadian newspaper. The Globe is in a position as the leading newspaper of Canada, both in point of circulation and influence.\n\nThe Globe Printing Co., Toronto.\nCOMMUNICATIONS.\n\nA FAIR CRITICISM.\n\nSir,—Under the heading \"Whiskey in the Northwest\" in the last number of the Monitor, Page 16, I publish a communication from a correspondent here which is a tissue of misrepresentations and gross misstatements. Though the matter may only be laughed at here, it is perhaps as well to notice that there is a large element who take an interest in our welfare, and I hope you will kindly allow me space for a few words in reply. The correspondent begins by saying \"Major Perry has incurred the displeasure of the people in this place.\" That he incurred the displeasure of a section of the people is true, but was it implied that the whole community? How about those citizens who are memorial to the Government in support of Major Perry, and those who have nothing to do with the question? These all belong to \"the people of this place.\" What right then has this correspondent to make such false inferences on one side and put Major Perry, as their object of resentment, on the other? The correspondent further says \"Major Perry in last year's report stated that the people here were a unit in opposing the law breaking, the defeat, the go as you may rely on it,\" to my correspondent, he added still further, but the same result. This monstrous statement and its repugnance to the least grain of common sense is the slightest thing that a truck driver could have penned such a glaring slander. And the writer so obtuse as not to see that by trying to create animosity against the people of Prince Albert, he really brings a most serious charge against himself. It is evident that he has undertaken to champion. I have not read the report referred to, but I take it that the statement made is not accurate. Were it as this unscrupulous advocate avares, Major Perry would have been the first to dispense with the law and the constable in his place. But the constable was there, and Major Perry in the place. Again, referring to illicit trade, the correspondent excuses the constable for not arresting because it is difficult to obtain direct proof. Every one knows how the nature of the trade is, and the difficulty of smuggling, but when the writer proceeds to say that proof is hard to obtain because of the secrecy of the trade, he states what is not true and the lie must be buried in the grave. There is, however, fortunately, black sheep in every flock, but it is needless to say this community as a whole is opposed to law breaking, opposed to law breaking in every shape. It is also opposed to calumny and false witnesses, and ought to be treated as officially \"sold\" against the author of this slanderous communication. We credit it to be directed at Prince Albert, and it might be directed at anyone. It is impossible to obtain convictions against illicit liquor traffickers here. There is no foundation for the statement that the majority of the cases brought on for trial have resulted in conviction and severe penalties. In fact, it is said that more than half of these operations have not invariably been sustained on appeal. The magistrate tries to be fair, but the difficulties of giving effect to the foreigner's opinions of prosecutors (whether having a pecuniary interest or not) are too strong to withstand. And they are apt to insist on sufficient proof in every case before convicting. Individual cases are not tried in detail, but the general impression is that the majority of the cases brought on for any offence. It is their duty to protect the innocent and less than to punish the guilty. A harsh sentence does not make charges in the Witness indictment, the minor details are mostly distorted, misrepresentations are made, and instead of saying what real motives may have prompted the conclusion of this piece of legislation, the correspondent seems to interfere with the cordial relations existing between the police and civilians dealt. It is quite a curious contradiction to hold P rising true to the principles of the rule of law, yet to be so anxious to see the laws of Prince Albert for sympathy. I am sure that the decision of local magistrates and higher judges have not always been in conformity with the wishes of informants and presenters. Yours, etc.,\n\nPrince Albert, Feb. 25, 1888.\n\nGENERAL NEWS.\n\nWinnipeg, Jan. 16.—The funeral of ex-Judge Ryan was held on Thursday afternoon at the hospital chapel, the face cathedral, where requiem mass was celebrated. The streets and the sidewalks of the Opposition were crowded attending the funeral. Among the pall bearers were Mr. D. Curry, Lloyd Mr. Herbert Smith, and some others interested in the cathedral cemetery.\n\nJan. 17.—There is a welcome on hand for Mr. McPhail, who visited the Northwest adjoining the Athabasca river with a view to the development of the lumbering region. He is preceded by Warden Robins and Mr. McPhail by Mr. McPhail, inspector of prisons in his annual report.\n\nP. T. BARNUM WRITES A STORY.\n\nThe following appears in a newspaper story for the evening, by the famous showman, P. T. Barnum, appears this week in the columns of The New York Family Paper. It is a story of the adventures of an American boy, who became the hero of \"My Plucky Boy Tom,\" and who was brought up by a kind old man, and forced to work in the fields. The story is thrilling, and will appeal to young and old alike.\n\nPRINCE ALBERT\n\nBREWERY!\n\nAMBER—Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROND\n\nXMAS CARDS\n\nIn Endless Variety at\n\nCANN'S BOOKSTORE\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder is made from the finest quality of flour, and is guaranteed to be free from all impurities. It is used by the best bakers in the world, and is highly recommended by them.\n\nBUFFALO HALL!\n\nGETTING READY FOR THE HOLIDAYS\n\nOur last week's advertisement had the desired effect. Many new customers called, and large purchases were made from our long range of goods. We still show choice selections in:\n\nLadies' Staple and Fancy Lines, which must be sold\n\nThis week we will devote attention towards reducing our COMFORTER, QUILT & BLANKET GOODS\n\nAnd Our Hammond Stock of Men's Wear in Full Suits, Odd Pants, Overcoats, Underwear, Fur and Cloth Caps, Mitts and Moccasins.\n\nBig Bargains will soon be given in any of the above Goods. Our Grocery Department is now fully stocked.\n\nChoice New Bean Coffee, Byron and Blend Peas, New Java and Mocha Coffee pure and fresh ground daily.\n\nAnd a full line of all other Staple Groceries and Canned Goods. Never before has the public been offered such quantities and so greatly reduced prices. You should remember this and put your money only where you can get variety and value.\n\nBETTS & GWINNNE.\n\nIMPORTANT NOTICE.\n\nOwing to the long delay of our goods in transit, we have made a sweeping reduction in every department, consisting of:\n\nPlaques, Venetian, Dress Lawn, India Linen, Muslin.\n\nIrish Diaper Linen, Cashmere, All-wool Dress Goods.\n\nFurniture Cretonne, Pillow Cotton.\n\nWhite and Grey Flannel, Boys' and Men's Top and Undershirts, Tapestry Carpets and Mitts.\n\nLadie's Winter Jerseys, Boys' Jersey Suits.\n\nLadies' and Gentlemen's Persian Lamb Caps.\n\nR. C. WIGMORE & CO.'S.\n\nGRAND UNION LIVERY STABLE,\n\nOpposition is the Life of Trade.\n\nA PRINCIPAL LIVERY, POST AND STABLE RIGGING.\n\nThe stable is situated near the public square, in Prince Albert to give you a start, the stable is well known throughout the town, and is visited by many of the prominent citizens.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888012701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 2476, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1248, 1], [1248, 2404, 2], [2404, 2404, 3], [2404, 10121, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]