[{"id": "2d3cd0187997f8c9fdb4bf943bdb49e54f0bba57", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nPRINCE ALBERT TIMES\nSingle copy, 5 cents; 10 copies, 40 cents.\nBusiness inside, 1st page, free.\nPrevious numbers may be had at the office for five cents each, and for five cents for all subscribers.\nNo advertisements under these heads.\nWe reserve the right to reject any advertisements without instructions to the contrary.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Alban's Church—Services, 11 a.m., and 7 p.m.; Rev. Mr. Macdonald, in charge.\nArthabaska Church—Services, 11 a.m.; Rev. Canon Piatt, in charge.\nSt. Paul's—1 p.m.—Rev. Dr. MacKay.\nSt. Andrew's—3 p.m.—Rev. Dr. McKay.\nSt. John's—7 p.m.—Rev. Dr. McKay.\nSt. Mark's—7 p.m.—Rev. Dr. McKay.\nWings Church—Presbyterian—11 a.m. and 7 p.m.; Rev. Mr. Macdonald.\n\nFRIDAY, JULY 27, 1888.\n\nBATOCHE AFFAIRS\n\nThe Batoche affair, which from time to time appears in the eastern papers, and which purports to be between Dumont and the Metis at Batoche is apt to be misleading and calculated to raise a wrong impression in the minds of those who are acquainted with the real state of affairs. That Dumont has a following among the French half breeds it was use- less to deny, but the number of his followers is small. The great ma- jority of the Metis, whether they have been led nor are he brave man he would wish himself to be considered, nor have they ever elected their chief. In fact most of them look upon him in his true light as an idle coward. Dumont is also reported that his words have a great deal of weight with a certain faction, and that fac- tion—led by a man who is a born mischief-maker—would hail with delight the return of the rebel chief, who, as they imagine, will believe take up arms to rebellion on the slightest pretext. The letters which are sent from Batoche to Dumont do not voice the sentiments of the large majority of the metis; they know nothing about them. It is believed that many of those who sup- ports the man who places himself at the head of the rebellious element, and that he alone is responsible. That individual is well known, and being too weak to earn an honest livelihood is prone to indulge in wild passions and ignorance of a few half breeds. If report be true, he is now seeking to create a discord among the Metis, as a result of the recent election at Batoche. We do not intend to change the opinions either of the candidates nor of the returning officer. If wrong has been done, those aggrieved can have a remedy in due course. We believe that the returning officer acted throughout the election with the greatest impartiality, and was per- fectly justified in making the return he did. The only error he appears to have made was in appointing men as deputy returning officers, as the result shows, were not qualified, but he appointed the most intelli- gent men he could get in the dis- trict, and no doubt the metis would have chosen very strongly had he taken his office from the people. There were only 282 votes polled in the Batoche election, of which 189 were only French, and every boy of that nationality over eighteen years of age, except three, 119 Eng- lish votes recorded, 36 of the French voted for Mitchell and the other 163 for Fisher. The majority of those who voted for Fisher are perfectly satisfied with the result, and we see no reason why the vaporing of a\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co.,\nNewspaper Advertising Agency,\nSend 10¢ for 100-pp. Pamphlet.\n\nCRISP CROPS\nCrop reports from all over the district are most encouraging. Grains of all kinds is badly needed, and in some localities barley is ripe; and will be ready to cut in a week, while wheat will only be a few days late. The present hot weather continues till the end of July, nearly all the wheat in the district will be ready to cut. The crop at this time is as good as last year, and the yield will be above the average. Some damage has been done by the storms of Fish Creek, but it is not very extensive.\n\nTHE FERRY\nWhen it was proposed last spring, to place a ferry on the river opposite the town, the Council could not allow any private party to secure the privilege, but must get it for the municipality. The Council now has the exclusive right to place and operate a ferry on the river. Why does not the Council see that it is put in operation at once, or else if they do not intend to do anything about something, they should not allow it? At this particular juncture of the year ferry becomes an absolute neces- sity, and if the Town Council had not interfered it is safe to say that the ferry would have been a good deal more in operation before this, and to see some immediate action taken in the matter.\n\nEVERY NIGHT I SATOCHETTE\nUntil the skin is covered. Body covered with scales like spots of moles.\nCured by Cutting Remedies.\nNote—This favorite medicine is put up in small bottles holding three ounces each. Price 50 cents per bottle.\nImported from the United States, and the maker of the Cuttric Remedies, S. C. Campbell, Montreal.\nPrice 50 cents per bottle.\nImported from the United States, and the maker of the Cuttric Remedies, S. C. Campbell, Montreal.\nPrice 50 cents per bottle.\n\nTHOS. O. DAVIS\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed uitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nT. N. CAMPBELL\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black INK, ALL SIZES—WRITING AND COPYING Office Stationery, etc., etc.,\nGRAND BANQUET.\n\nGiven by Mr. Macdowall, Esq., M.P., by the Electors of the Prince Albert District.\n\nThe banquet given by H. Macdowall, Esq., M.P., under the auspices of the Loyal Canadian Association of Prince Albert at the Metropole Hotel on the 19th instant was a greater success than could have been expected; although it was given in the most private manner, it was open to all and quite a number of prominent Liberals availed themselves of the opportunity of being in doing so to the members for Saskatchewan. Owing to the limited accommodation it was intended to limit the number of tickets to fifty but notwithstanding this limitation and a great many could not obtain admittance. The gathering was thoroughly representative, the guests being without exception the best ever given in this district. The F. A. C. Band kindly volunteered their services for the occasion and played a number of tunes both before and during the banquet. The 50 who were seated at table were Dr. Bain, principal of the C. A. Association; presided and Capt. Craig and J. F. Batte, M.L.A., occupied the first and second vice-chairs respectively. The chairman of the evening was the guest of the evening and Col. Spratt and on his left sat Mr. J. L. Macphee, Mr. Macdonald, Const., Esq., L.L.B., On the right the president’s chair was a life-size portrait of Sir John Macdonald and the room was beautifully decorated with flags and drapery.\n\nAmong those present were Dr. Bain, Messrs. Macdonald, Macintosh, Maclean, Craig and McKay, Messrs. McTaggart, J. N. Coombs, S. Brearley, Maj. McGregor, Mr. Grant, Messrs. LaPonde, Clark, Baker, James McKay, McIseas, Northgates, London, Knowles, Macdonald, Macdonald, Mr. E. Ross, R. B. Way, H. McDougall, A. B. Spratt, Harley Gibbonson, Mr. Campbell, A. Campbell, J. P. Millis, Com. J. R. McNeil, R. R. Beaton, A. F. A. Stull, S. J. Duthie, E. Rankin, A. M. Macdonald, Mr. Macdonald, R. C. Wigmore, W. T. Wa, W. C. McKaye, P. Newell, R. A. McKee, R. Ouellet, G. R. Smith, R. F. Craig, Capt. Craig, Capt. Field, D. L.S., J. Mayers, G. S. Davidson and others.\n\nThe toast was prepared and served by Mr. Bain in his usual first class style, the Bill of Fare, which we give below, speaks for itself.\n\nHILL OF FARE.\n\nSOPP TOMATO Macaroni\n\nFISH Boiled Stuffed Fish Punch Sauce\n\nCHICKEN Croquettes Custard Eggs\n\nROAST Beef Roast Veal, Pork and Tongue Boiled Mutton\n\nMINT SAUCE Capers on Toast\n\nGREEN PEAS, Tomatoes, New Potatoes VERNABLES\n\nPineapple, Cauliflower, Carrots\n\nElishaich Peach, Strawberry, Lemon Tart\n\nJellies and Jamccones\n\nCheese, Butter, Bread and Butter Strawberries and Ice Cream\n\nFRUIT Pear, Pine Apple, Apricots, Raisins, Fruit Pies and Nuts\n\nTea Coffee\n\nAfter the cloth had been removed, Dr. Bain, from the chair, proposed the following toast:—“His Excellency the Right Honourable the Prince and Princess of Wales and the Royal Family,” which were right royally honoured.\n\nMr. Bain then called upon His Excellency, Governor-General of Canada and the Lieutenant-Governor of the Northwest Territories for a seat and a toast appropriate enough to their presence and the changes that had recently taken place in the Government of these offices. He referred to the hail which had been promised by Lord Stanley for the position of Governor-General and to Mr. Roy’s Stites for the position of Lieutenant-Governor and service rendered to the Province of Manitoba and his connection with the Northwest. He referred to the name of Mr. R. Ouellet with whom the toast which was enthusiastically received.\n\nMr. Ouellet, in a very neat and approving speech spoke highly of the services of the late Lieutenant-Governor, Mr. Dewdney, and concluded his remarks by expressing his belief that the late Lieut. General Macdonald, in the region of his term, would be as much appreciated and loved as he was recorded as having been. “The Army, Navy, Medical Profession,” was responded to by Col. Spratt, Capt. Craig and Paymaster Reed. The Colonel spoke very highly of the efficiency of the Canadian militia; he was followed by Capt. Craig, who in a short and high spirited speech gave the most splendid “connection with the military” Capt. Reid, of the Midland Battalion, preceded and signed a humorous account of a campaign, his party proceeding up to Fort Macdonald and his friend Capt. Craig; the speeches were too strong for them and he, the speaker made a matter of retreat leaving the gallant Capt. Craig behind.\n\nIn rising to propose the toast of the evening, “Our Guest,” Dr. Bain spoke of the confidence the electors had in Mr. Macdowall; he had now served them two terms and it had given him greatest satisfaction; he then said he was glad to see a number of prominent Liberal leaders present to-night. He felt that Mr. Macdowall was equal to the task presented to him and that he would refer to the election and the friendly spirit in which it had been discussed. He spoke of the warm welcome at present existed towards our member. He also spoke of the visit of the delegates from the Northwest and how cordially and yet every possible assistance in endeavoring to attain the objects of the delegation. Mr. Macdonald and Messrs. Macdonald and Craig thought they could tell firstly, the strangers efforts made by him in the interests of the district. He was pleased to note several persons present to-night and would assure them that Mr. Macdowall was working hard for them and that he was a member and people had no idea of the enthusiasm of getting anything done at Ottawa.\n\nHe referred to North-West meets and Mr. Macdowall’s standing at Ottawa, his influence and the Government’s attitude to him. He said his name would be heard in the future legislative assembly and his close and faithful attention to his duties. He asked all present to join him in the toast of “Our Guest.”\n\nThe toast was received with the greatest possible enthusiasm by all present. The delegates joined in cheering and they sat on their chairs while for five minutes the cheers were deafening.\n\nOn rising to respond, Mr. Macdonald spoke of the difficulties and had to wait until the long power of those present had died out. He said his name would be heard in the future legislative assembly and his close and faithful attention to his duties. He asked all present to join him in the toast of “Our Guest.”\n\nHe could not find words to sufficiently express his thanks to those present and to the members of the magazine west for the cordiality with which he had been received on his return from Ottawa, and was greatly pleased to meet those who had opposed him as well as those who had opposed him in the election. He had met many friends with whom the election had been decided and had no unfriendly feeling towards any of his opponents; he always had met them with kindness. He had mentioned the subject of seed grain, and asked the Government to make every thing available for the farmers. He had used his influence with the Government to get them to accept the bill which would provide for the land that had been granted. The Government had also given us many other things we had asked for. He referred to the recent election and the result, Mr. Barraclough and a resident judge, all of which was a great benefit to the district and Prince Albert, where the capital of Saskatchewan, was situated, as well as the capital of his district. He referred to the election and the interests of the farmers and had a tendency to have a large amount of land under cultivation in the next few years. He referred to the need there for a market for the products of the area. Mr. White, the Northwest members had lost their best friends in Mr. Dewdney, and many people of the Northwest had lost one of their best friends in Mr. Dewdney. Mr. Dewdney’s departure was very heavy with them and one who took an active interest in their welfare. Mr. Dewdney (the late Minister) had done more for us than all the Northwest members put together. Mr. Dewdney (the late Minister) and he (the speaker) felt the honorable gentleman’s place could not easily be filled, but hoped the appointment of Mr. Dewdney would prove to be a good one. Mr. Macdonald then dealt with the Disallowance question; he said that in Saskatchewan it had been spoken of as a very live issue. In 1877 when the question was brought before Parliament there was considerable discussion because he felt that by so doing he was working in the interests of the country. Deputies had gone down at the time from Manitoba but rather from Winnipeg to ask Disallowance done away with in Manitoba. It was not a special movement but simply a few interested parties in Winnipeg were anxious to secure all benefits that would come from that city; they were not supported by the Province at large nor by the Territories. He thought there was no doubt that at that time the Government would not abandon their Disallowance policy to satisfy the hopes and cupidity of a few Winnipeg politicians but that at the near future the question would be dealt with by the administration and some action taken which would settle the whole matter would be settled, and now by waiting only one year we had the result. Mr. B. R. Bond had moved the bill with set only in Manitoba but in the Territories.\n\nWith regard to the future of Prince Albert, he said that the question came here in 1881 and was present during the first elections ever held in the Territories. The public opinion was divided, in Bishop & Connaught Hall he predicted that there would be three railways running into Prince Albert. He said the M.A. & N.W. & the S. & S.W. Railway, these predictions were now on the eve of being fulfilled, and these matters would be discussed in a few days on the latter under the name of the Region & Long Lake Railway and the Government would be forced to decide whilst the locomotive will be heard in Saskatoon and in the Town of Prince Albert one year later. The M. A. & N.W. & the S. & S.W. Railway, these predictions had been commenced on the H. B. Road and although at present it was at a standstill, the Government thought before a great while arrangements would be made whereby the road would be constructed. Mr. Macdonald reported the S. & S.W. line, because he saw the M. A. & N.W. were not in a position to complete the railway within this year at present, while the former could be completed in two years, and what we wanted was speed rather than length.\n\nHe referred to the order now pending with the western markets. Our delegates to Ottawa on that behalf walked faithfully in the interests of Prince Albert and he (Mr. Macdonald) as well as himself had to choose between two lines of railway, the Region & Long Lake or the M.A. & N.W. & the S. & S.W.; the former had less mileage to build and would cost £6,000,000 while the latter would require £8,000,000, therefore the M.A. & N.W. & the S. & S.W. Railway would be completed in two years.\n\nHe referred to the last order the Government had passed the subsidy had been passed and the road would be completed within thirty miles of this town this year. He then referred to the great importance of a railway to Prince Albert, that the Government previous to the building of the C.P.R. all the important points in the Territories were connected by railway, that had been built we have had dull times; now however with the immediate prospect of railways an increase in our population, good crops and would be large producers and exporters, stock raising and cattle raising and the consequence thereof would be large immigration to the district and the country would become settled up, and the prosperity of the district continued at least for a number of years.\n\nWith regard to railway matters he referred to the importance to be in the interests of the district and to carry out his pledges made at the election and he believed the people would hold him forthrightly to the end of his ability. He was particularly pleased to know that Mr. Macmartin, one of the delegates from the Northwest who supported his election, was satisfied with his actions at Ottawa. In referring to the N.W. District Mr. Macdonald said he had supported the bill passed at the last session of Parliament and gave his reasons why he thought it was just and a proper government for the Territories. The bill was practically the same as the one he had introduced. In the N.W. District there became known the new Saskatchewan would be ruled by the other districts and became the province of fire departments would cost £75,000 per year and our school at present is only £64,000 and our revenue from permits (contraband to South Pass)\nand other resources about $10,000 so that there would be no money for public works, etc., as in the case of governments with a large surplus, and in three years with a surplus of $25,000. In view of this situation, the importance of Saskatchewan will be so great that we will have been obliged to make a large expenditure by government in the near future which will grow progressively each year; three years will be able to bear the expense of such expenditures. The N.W. Council spent a large sum of money for educational purposes, and this was the amount to which Mr. Macdonald objected to bring it down substantially to the Territorial or present rate, but government has been unable to do so.\n\nMr. Macdonald said that although the Manitou & North Western Railway were not yet completed, he had been obli- gered to build more than twenty miles each year, yet he had not succeeded in getting the building of the directors. That as soon as the railway was completed, the road would be opened through to the South Branch. There was also a proposal to build a road from the North Branch to connect with the H.B. Road at Grand Rapids as soon as the latter line was completed. He thought that the railway should be built as soon as possible, and that the government should take advantage of the opportunity offered by the railway to improve the trade. Mr. Macdonald then spoke of difficulties affecting the district of his constituency, particularly the lack of funds for the school. He spoke of the great increase in store for the Northwest, and in conclusion reiterated his belief that the future of the district was promising, and that the people were working hard to improve their lot.\n\nCapt. Craig, from the first chair, gave the toast of \"The Legislative Assembly,\" and Mr. Macdonald replied, which was replied to by Wm. Maclean, M.M.A., and J. F. Betts, M.L.A.\n\nMr. Macdonald then spoke at length on the importance of the Assembly, but did not say anything very definite. The Assembly hoped to know more through time. He now saw the district of his constituency, and would be pleased to see the prosperity of his constituents. He expressed his hope that something would be done to improve the condition of the district, and that the government would give such a good account of our future prospects and that he had every confidence in the Assembly.\n\nMr. Betts followed in a short and humorous speech. In order to be seen he mounted on a chair and addressed the hall. He said that he had risen to the dignity of a member of the Assembly, and that he would be pleased to see the prosperity of his constituents. He expressed his hope that something would be done to improve the condition of the district, and that the government would give such a good account of our future prospects and that he had every confidence in the Assembly.\n\nMr. Betts then proposed the health of the chairman and his honourable lady, Mr. Craig, and Mr. Craig, who spoke on behalf of the Assembly.\n\nThe singing of the National Anthem brought the proceedings to a close, everyone rising to their feet and cheering for any of the arrangements. Everyone went home happy, and the Assembly, who rather could not attend around the house expecting evening ever spent in Prince Albert.\n\n**Silk Ribbons**\n\nTime of our holy ladies who would like to purchase an elegant large package of silk ribbons in different widths and all the latest patterns. Also ribbons for Bonnets, Strings, Neckties, Scarfs, Fringes, etc., and Bows, Fans, Fans, Fans, etc., according to the latest fashions. We are obliged to refuse the request of a large number of ladies who have been purchasing only 5 cents to the ladies who have purchased more.\n\nAn especial offer this house will give to ladies who will purchase silk ribbons. If you will send the names and addresses of ten ladies who have purchased silk ribbons here, we will give you one dollar less than usual price. This offer is only extended to those who have purchased silk ribbons here.\n\n**Paine's Celery Compound**\n\nFor the Nervous The Debilitated The Aged.\n\nCures nervous Prostration, Nervous Headaches, Nervous Indigestion, Nervous Weakness, Nervous Loss of Appetite, Nervous Diseases, and all Nervous Disturbances.\n\n**A Nerve Tonic**\n\nGeorge W. Butten, St. Thomas, Ont., says: \"I have used your product for several months and find it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders.\"\n\n**AN ALTERATIVE**\n\nDr. Alexander Wilson, Jr., says:\n\n\"I have used your product for several months and find it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders.\"\n\n**A LAXATIVE**\n\nDr. Alexander Wilson, Jr., says:\n\n\"I have used your product for several months and find it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders.\"\n\n**A DIURETIC**\n\nDr. Alexander Wilson, Jr., says:\n\n\"I have used your product for several months and find it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders. I have found it to be a valuable remedy for nervous disorders.\"\n\n**Summer Dress Goods**\n\nMuslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies\n\n**HATS, CAPS AND STRAWS**\n\nThese goods will be sold at bottom prices. Inspection invited.\n\n**R.C. Wigmore & Co.**\n\nFOR THE\n\n**NOTICE!**\n\nBest Assorted Stock of CONFECTIONERY\n\nGO TO\n\n**H. McDougall's Bakery**\n\nCentral Store\n\nGoods delivered to all parts of the town free of charge.\n\n**H. Macdoucall**\n\nGO TO\n\n**Agnew's**\n\nFOR\n\n**Machine Oils, Scythes and Snaiths**\n\n**Hay Forks, Window Sash, Panel Doors**\n\n**Grand Union Livery Stable**\n\nOpposition is the life of trade.\n\nA first-class livery, feed and stable stable.\n\nWe would like to invite the public to come to Prince Albert to give us a call. Our stable is located just off the main street, next door to Queen's Hotel. We offer first-class livery and feed stable in turn, with horses and rigs, at reasonable terms.\n\nWe are always glad to accommodate men night and day at our stable. All our horses are first-class livery horses, and we are always glad to accommodate men night and day at our stable.\n\nYou can always depend on getting the best stable and feed stable in Prince Albert.\n\nWe do not advertise in newspapers to attract customers, as that would be contrary to the principles of the Feed Stable—and at the lowest prices in town.\n\nDonaldson & Pembrey\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888072701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 5974, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5882, 2], [5882, 18474, 3], [18474, 25234, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]