[{"id": "e2eb4231f88f1e769ed409e40ff0fd7502e22208", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JANUARY 14, 1867.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTrades General Banking Business.\nIntelligent, Reliable Service.\nNames Discounted.\nSpecial rates available at all points in the Dominion.\nCollections undertaken and promptly attended to.\nBank of Canada.\nWilliam M. Ulmer,\nNotary Public, etc.\nPrince Albert\n\nSTEPHEN BOWEN,\nSolicitor of the Supreme Court of Justice in England.\nAdvocate, Notary Public, etc.\nLate McLennan & Elliot.\nPrince Albert\n\nH. W. NEWLANDS,\nAdvocate, Notary Public.\nPrince Albert\n\nA. H. M. HOPSON, B.A.,\nNotary Public.\nRiver Street, Prince Albert\n\nW. R. GUNN, M.A.,\nAdvocate, Notary Public, Conveyancer.\nPrince Albert\n\nD. A. STACCHIOSE,\nDentist.\nPrince Albert\n\nROYAL MAIL STATION\nWeekly between Prince Albert and Prince Albert Station every Tuesday morning. Passengers are requested to arrive by 9 o'clock.\n\nLESLIE & SCOTT.\nJ. D. HANNAFIN,\nCommission Agent and Collector.\nOffice - First Street\n\nFURNITURE\nCheaper than ever.\nFor the next thirty days I will sell at 30 per cent less than usual.\n\nGILBERT E. CARTER.\nWILLIAM KNOX,\nCarpenter, etc.\nOffice and Workshop.\n\nBLACKSMITHING\nThe McCauley Bros. have erected a new blacksmith shop on the west side of Church Street near River Street where they will be prepared to do all kinds of blacksmithing in American style and at moderate rates.\n\nMCCALL BROS.,\nGeneral Blacksmiths.\nChurch Street.\n\nTHE OLD RELIABLE.\nA large supply of the good old weight clocks.\nNice line of nickel clocks, Waltham, Elgin, etc.\nFine interchangeable spectacles. Call and see them at the Post Office Jewelry Shop.\nRepairing done neatly and warranted.\n\nR. B. WAY\nQUEEN'S HOTEL\nLeading Hotel in Saskatchewan.\nT. O.H.M. has been appointed in the Queen's Hotel in Saskatoon on Sunday, January 14th.\nThe word must be sent by telegraph or mail, and will be sent to the largest in the Northwest. The hotel is situated among elevators and warehouses in the leading grain markets of Manitoba.\n\nTHOS. ORAM\nProprietor.\nPRINCE ALBERT\nPlanning Mills and\nSash and Door Factory\nOur FINEST AND MACLAY'S\nSash, Doors, Frames, Blinds, Moulding, and Builders Furnishings made in the best manner.\n\nA. GOODFELLOW\nPrince Albert\n\nBOOTS AND SHOES\nSlippers, All Sizes and Kind for Ladies' Girls' and Children's Wear.\nMoccasins, Overshoes, Boots for Ladies, Gentlemen, Children, Men, Girls, Socks and Shoes, All Sizes and Kind.\n\nSPECIALTY.\nGum Rubbers and German's Felt Stockings, Suitable for Teamsters and Lumbermen.\n\nCHEAP FOR CASH.\nSHANNON & McLEOD\nCall and See\nThe New Fall Stock of\nHATS & BONNETS\nAlso Woollen Goods, Caps, Hoods, Scarfs, Mitts, and Fur Trimmings.\nA large assortment of feather, caps, and specialty in low prices.\nCanadian Woolen Mills, and Berlin Wool all at reasonable prices.\nMrs. J. A. Fraser's\nCampbell's Block.\n\nNOTICE.\nWe are offering the balance of our Woollen and Dress Goods!\nFor the Next Thirty Days at REDUCED RATES.\nMcCALL BROS.,\nGeneral Blacksmiths.\nChurch Street.\n\nPRINCE ALBERT BREWERY.\nPure and Sparkling AMBER-(Hop)-ALE.\nDelivered to all Parts of the Town.\nMcINTOSH & GERRARD.\n\nTELEGRAFIC.\n(By Special Dispatch.)\nWINNIPEG, Jan. 12.\nA special extra Canada Gazette was issued last evening proclaiming the Act granting representation to the North-West. The Act was afterwards withdrawn by special dispatch. The whole explanation was that copies had been issued before the order of council was passed.\nA big flood mill is being erected by Mitchell, of Montreal, at Regina, which will have a capacity of one thousand barrels a day, and will be the largest in the Northwest. It will also include storage, grain elevators and warehouses in the leading grain markets of Manitoba.\n\nHis Lordship Bishop Macdonald, Rev. Father John Lee, and Mr. Smith, who left for the east a few days ago by way of Chicago, will proceed direct to Europe without stopping at Regina, as there are no American cities as far as their intention. Archbishop Taché has returned from Europe. In about a month he expects to leave for Rome to be installed at the general meeting of the Oblate Order, which takes place in April.\n\nThe Liberal Conservative Association of Winnipeg met last night and elected Mr. J. H. Macdonald as its candidate for Commissioner.\n\nSir John Lester Kaye is in the city and has completed arrangements for the Department of Agriculture for the establishment of ten large farms in the Northwest. He leaves for England early in the spring to appeal for subscriptions on his farms to be commenced in the spring.\n\nIt is understood that there has been no new appointments under the Territorial Act recently put into operation in the North-West. The officers in each district will continue to perform their duties as formerly. In all probability Alberta will remain divided as at present, with offices at Calgary and Edmonton.\n\nMr. Daly has been appointed Commissioner of the North-West Territories. It is stated that papers for the Dominion elections have been issued, and that the returns will be sent to Ottawa by February 1st, polling on the 15th.\n\nWINNIPEG, Jan. 12.\nThe political situation is still the topic of conversation throughout the West, and eastern and central Canada and both parties are making preparations.\n\nSir John is in the city, having conferred with the leaders of the party and endeavoring to strengthen the newspaper situation. Provincial elections will take place on February 15th, except probably in the North-West. The withdrawal of notice of proclamation has been due to the fact that the signature of Lord Salisbury has not been omitted, but it will doubtless be signed shortly.\n\nSir Charles Tupper will immediately enter the cabinet as Minister of Finance and head the Conservative party of Nova Scotia.\n\nThe situation in Winnipeg is uncertain. The Conservatives have made no movement toward the election, while the minister to Sir Donald A. Smith, though there is a difference of opinion. The Liberals talk of nominating Isaac Campbell.\n\nLord Eldonshay, better known as Sir Samuel Leonard, died suddenly while having conferences with Lord Salisbury. Death resulted from failure of the heart muscles.\n\nEastern morning papers today contain no indication of Dominion election, but reports probably will be heard soon in Halifax. No report has yet been received from Regina, but it is expected that a Northwest representation will not be proclaimed until Saturday.\n\nDeputy Sheriff Ross returned from St. Louis last night. Mr. Ross and Chester Thompson left for Portage la Prairie by special train.\n\nThe annual meeting of the Bandits was held at Assiniboia last week on Tuesday evening, but owing to a poor attendance the meeting was called off. Mr. Davis' store, business, the election of officers, etc. Full attendance requested.\n\nCHIT-CHAT LOCALS.\nGathered over our Reporter's desk:\nD. H. Macdonald, O. E. Hughes, R. W. C., and Thos. McKee, Writer.\nP. A. Saturday on Saturday last.\nPeter Sinclair, while yawning a few days ago, dropped his pipe out of joint.\nIt was a tight right.\nThe third annual meeting of the Agricultural Society will take place at Prince Albert Feb. 1st, etc., at the Catholic church. Quite a number just now and we hope the Council will take steps to prevent them running away.\nMr. Bartle, the new teacher for east end school, arrived on last Monday afternoon, and commenced his duties on Tuesday.\nUse Clark's Syrup Tar and Wild Cherry.\nWith a good show and improve their appearance. For sale at Clark's Store.\n\nThe demand for the Queen's Own Rifles is very great, and the excitement run high for some time past.\nForty-one took oath last week.\n\nUse our new Conditions Powder. Will give a good show and improve their appearance. For sale at Clark's Store.\n\nThe demand for the Queen's Own Rifles is very great, and the excitement run high for some time past.\nForty-one took oath last week.\n\nFor chapped hands, sore hips, rheumatism, etc., use Clark's Glycerine Salve. It heals the skin and relieves pain.\nCal. Spurton left on last mail for Edmonton.\nOn the return trip Mr. Spurton departed a number of his friends from his residence and enjoyed themselves crossing the prairies and spending a few days in the little town of Edmonton.\nA pleasant trip and a speedy return.\nWe again urge the Dominion Government, but against all parties will be re-elected, to purchase Morrison & McLeod's book for 1916.\n\nSamuel & McLeod are clearing out old goods at cost price.\nMr. Morrison & McLeod's selection of men's, ladies', Misses and Boys' Skating Boots, also a large selection of men's, ladies', Misses and Boys' Hats and Slippers, of all sizes and sizes.\n\nWalter Cook, who lives in the vicinity of Beaver creek, Tom Rogers, crossing the prairies his old black horse, with the aid of his dog, secured a victory over a lance. Not so bad Tom.\n\nUse Clark's Syrup Tar and Wild Cherry.\nThe first carnival of the season in the Saskatchewan Hunt took place last evening. Though the weather was not very cold, the attendance was expected. Mr. Cook took the prizes of Miss and Miss Anne Cook, and Mr. Cook took the prize of P. A. C. band was present.\n\nWe visited O. Nelson's store, the second block, the other day and examined the new display of clothing cutters, which Mr. Nelson has ordered. We also examined his harness from the Taylor & Co., of Winnipeg, which took over forty-five pieces last fall, and we consider them the finest harnesses that have ever been imported into the country.\n\nMr. Goumas, Inspector of Police Works, at St. Boniface by invitation of the council, gave an account of a couple of months, touching upon the construction of the new police station. Mr. Goumas has been superintending the erection of the courthouse and jail building and gave an interesting explanation of the locking and the arrangement of the cell doors. The court-room was fitted up by the Inspector and contains a substantial building at much less cost than was expected.\nDOMINION ELECTIONS\n\nThe Dominion elections, apart from the Northwest—were expected to take place on the 15th of February. We treat them as a great opportunity to strengthen our belief that the people of Canada prefer the present Government—or policy pursued by the present Government—to any other. They believe that they would be better off in a government for the benefit of all the nations of the world, and not for foreigners; that they believe in Canadianism for Canada, the same as the Americans believe in Americanism.\n\nA convention composed of friends of the country and those interested in different settlements of the northwestern district, will take place next Friday, the 21st inst., at Prince Albert, for the purpose of nominating a candidate to canvass for the constituency. It is to be hoped that sectional considerations will not be allowed to interfere with the selection of a suitable person, but that all will submit to the majority rule. Mr. Hughes, who was elected chairman, has been very active in the movement and has been very successful in getting the support of prominent men.\n\nTHE BRITISH CRY (\"\")\n\nRepeal is again being agitated in Nova Scotia, and Hon. A. G. Jones, one of Mr. Macdonald's ministers, and the leader of the Liberal party, has announced his intention to stand for the constituency of Halifax. His decision is based on the fact that he is convinced that repeal is essential for the prosperity of Nova Scotia.\n\nINDIAN AFFAIRS\n\nThere is an election going on in Prince Albert, N.W.T., and Mr. Campbell has been elected chairman of the committee. The Indians have been promised a great deal, but it remains to be seen whether these promises will be fulfilled.\n\nBIDDING FOR NOVA SCOTIA\n\nThe Hon. Timothy Warren Anglin, who represented a Nova Scotia constituency for many years, has retired from politics. He has been replaced by Mr. Blake, who has promised to do everything in his power to improve conditions in Nova Scotia.\n\nT. N. CAMPBELL\n\nJUST RECEIVED A LARGE STOCK OF MUSICAL INSTRUMENTS\n\nAccordeons, Harmonicas, Violins, &c., &c.\n\nGAMES OF ALL KINDS, PAGETT'S BOOKS WITH TALLY CARDS, FIELD AND COLORED GAME COMPLETE, CHESS, BACKgammon, &c., &c.\n\nLATEST NOVELTIES IN TOYS, WHICH FOR THE NEXT WEEK I WILL SELL AT COST FOR CASH.\n\nTHE WEST END STORE\n\nLadies' Six-Button Kid Gloves in White, Cream and Delicate Shades, And Full Lengths in Silk Thread, Just Received at CHAS. MAIR'S WEST END STORE,\n\nALSO Fashionable Laces in Cream, White and Black.\n\nA select assortment of Christmas Cards, very artistic, and at prices which everybody can afford to pay.\n\n'79. '87.\n\nCLEARING SALE!\n\nALL REMAINING PARLOR STOVES AT COST.\n\nT.J. AGNEW\n\nWM. STOBART & CO.\n\nGeneral Merchants\n\nAND Indian Traders.\n\nWM. STOBART & CO.\nCOME THIS WAY!\n\nNo Deviation in the Path that Leads to the\n\nBUSIEST STORE IN THE COUNTRY\n\nOur Patronage is Daily increasing, and why Is there a reason for it, or does it merely happen that to-day our trade is much larger than yesterday, and to-morrow it will be larger than to-day? We know this is a community of sensible people, who not only have a reason, but a good one, for any acts they commit. When you see increasing numbers\n\nFlocking to a Particular Store!\n\nYou can put it down as a Fact that there is something there worth having. One or two may be deceived, but a crowd is never misled, and this growing trade of ours is positive proof that we have won the confidence of the public. We are the friend of every economical buyer of\n\nStaple and Fancy Dry Goods,\nDress Goods, Silks,\nMantles and Carpets,\nGent's Furnishings and\nReady Made Clothing.\n\nALSO FULL LINES OF\nGENERAL GROCERIES\n\nWhich will always be found unsurpassed in quality and price,\n\nFlour, Feed & Provisions\n\nALWAYS IN STORE\n\nOur Stock in this Department is simply immense, and is one of the best assorted in the North West.\n\nJust opened out, another large lot of\n\nChina Tea Sets and\nPainted Granite Ware\n\nDirect from the old country. All new Styles and Patterns, and Prices Low.\n\nGLASSWARE\n\nIn Endless Variety. An examination of Our Store respectfully solicited.\n\nFarmer's Produce taken in exchange\n\nHighest Prices Paid for Furs.\n\nWe value your patronage, and we want it. When you come into our store, our anxiety is to look to your interest, to please you, to save money for you, and to have you feel that it is to your profit to trade at\n\nJ. M. CAMPBELL'S\nGreat General Store of Prince Albert\nEDITORIAL NOTES.\n\nIf the present government of Northcote the Premier, brings forth a good man, and the present Imperial Government, weak at least one of its chief mainstays.\n\nAndrew Lepine, who was concerned in the late Red River troubles, who seems most likely to be during the late troubles, has obtained the reinstatement of all his civil rights, which he had lost accepting a commission of the then Governor.\n\nWe have received a special number of the Kingston Whig, in which is given a history of the Whig party and its prominent citizens for the last half century. To old Kingstonites, the illustrations, portraits, writings and old faces, and the historical reminiscences, cannot but prove interesting.\n\nThe Torrens system of land tenure went into operation in the North-west Territories on January 1st. The adoption of this system so early in our career will prove a great boon to people who are not yet settled, but owing to the fact that the transfer from the Crown will be made under it in many cases and land will be sold by those few hands since patents were issued, it will avoid future complications. Under the Act, the surveyor-general may make no appointments save where made as yet, and the present officers will continue to hold their positions.\n\nAt Halifax Mr. Anglin said:—They (the Government) have mismanaged affairs in the Northwest by sending out to the people who came there, the men who went there, when they were ashamed to appoint to any other position in Canada, but sent them through for such unfortunate people—to take care and ill treat them. While there may be an odd black sheep in every flock, there have to be hundreds to make up the Indian department officials of the Northwest, as a body, will compare very favourably with any other branch of the public service or the hon. gentlemen who slander them. Besides many of them were appointed by the late Sir John A. Macdonald. At the momentality of the Indians, it is notorious fact that it was a very few orders long before any Canadian officials came into the country.\n\nCURLING.\n\nThe first game of the season on the Saskatchewan lake was played on Friday last between teams chosen by the President and Vice-President, and resulted in a victory for the latter's team by five goals. The following were the players and the score:\n\nPresident—McGillivray, Macdonald, Stewart, Ross.\nVice-President—Stewart, Ross, Macdonald, Northcote, Neilson, skip—H. T. Campbell.\nScore—President 5, Vice-President 4.\n\nThe single-handed match for Dr. Bain's medal is now going on, and will be concluded on Monday next.\n\nA safety or double barrelled breech-loading pin fire gun, with 100 cartridges shell for same, will take place at Buckley's Billiard Hall on Wednesday evening, January 19th. Tickets, 5¢.\n\nST. LAURENT.\n\nVICE PRESIDENT—McGillivray, Macdonald, Stewart, Ross.\nPresident—Stewart, Ross, Macdonald, Northcote, Neilson, skip—H. T. Campbell.\nScore—President 5, Vice-President 4.\n\nTERRITORIAL NEWS.\n\nBATTLEFORD.\n\nThe Herald of Dec. 20th says:—Mr. E. M. Smith, of the Battle River reserve last week, and discovered the disease which had been reported to him as smallpox was the scourge. He said the disease was not as prevalent on the reserves, but it is now connected with their treat- ment by the Government, or, as he terms it, the Government. They have an abundance of fresh beef and fish in addition to bacon, and it is said by those who have been amongst them that much of the sickness is due to their gluttony.\n\nCOMMUNICATIONS.\n\nEDMONTON.\n\nThe Bulletin, Dec. 11th says:—Jas. Noon, absent from Saddle Lake on Thursday, where he has been th- ing out the crop of the Indian settlement. Telegraph communication was opened with Fort Saskatchewan on Wednesday. W. H. Smith, Esq., has returned.\n\nA blackfoot half-breed who has been in the employ of J. Norris, senior, for some time past, was dangerously injured Tuesday of this week, and is now confined in the police cells here. He was examined by Capt. Griesbach on Friday morning, and will be taken to Ft. Saskatchewan today.\n\nA LITTLE HASTY.\n\nBy the Editor of The Times.\n\nWhen I thought to call attention to a reference in the Winnipeg Weekly Free Press of Dec. 23rd to a letter of Rev. Dr. Jardine, written to the editor of the Sketch, with regard to the farmers of this district. It seems to me that that gentleman has been a little hasty in his remarks regarding the condition of this place. Dr. Jardine \"on arriving\" at Prince Albert, in a wonderful short space of time, found that \"a few good Scotch farmers\" were successful, \"but they were very few,\" and that \"there is a great increase in the number of industrious and intelligent men\" come and settle here, the country as regards Prince Albert will go the way of the rest.\n\nDr. Jardine, \"on arriving\" here, without having had time to get to the conclusions that he \"very soon\" will arrive at, and ignorant, and that these \"intelligent Scotch farmers\" were Scotch. Now Mr. Elliot, I am not sure, but I believe he was Scotch, but his doctrine is certainly demonstrative from Dr. Jardine in behalf of other settlers west of the Rocky Mountains. Let him go west, south and east of Prince Albert, and he will see equally as prosperous and intelligent Scotch farmers as the population of Providence in the drought of the last three years, at which we do not rejoice. These people made the country their home, and where they have gained experience in farming, having been a considerable time engaged in occupations other than farming, they are now farmers, as Dr. Jardine thinks they are others that are as industrious and intelligent, and have the determination to \"do or die\" as the Scotch farmers of the East.\n\nI think Dr. Jardine would do well to acquire a little more experience of the difficulties of the West, and his conclusions, he would attain what he apparently lacks. He not only shames a straightforward and respectable class over the districts west of this our country a barn by such representations that they cannot be easily eradicated from the eyes of the world.\n\nIf Dr. Jardine is a gentleman, which his title would denote, he should retract his expression made, as if he were, without due reflection, and apologize.\n\nBy giving space to this letter in your valuable paper you would confer a favor on a great many industrious and intelligent farmers, and Mr. Elliot.\n\nC. A. Adams.\nRed Deer Hill, Jan. 9th, 1877.\n\nANSWERS TO MYSTERY.—Are you disturbed by the constant crying of your child? Is he a child suffering and crying with pain? If so, give him a dose of Dr. Smith's Soothing Syrup for children. This Syrup is a powerful sedative, and will immediately stop the child's sufferings. It is also useful in cases of diarrhea, dysentery, and other intestinal complaints. It is easy to administer, and gives the child energy and cheerfulness. It is also excellent for children suffering from rheumatism, and is a valuable remedy for the treatment of various ailments. It is available in twenty-five cent bottles. Buy it now and take no other kind.\n\nWM. HUDSON.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder never varies. A barrel of strength and wholesome flavor is always guaranteed. It can be sold in connection with the manufacture of flour, or as a separate article. Sold only by the wholesale grocers. Sold only by the wholesale grocers.\n\nGO TO CANN'S BOOK STORE\n\nFor Stationery, School Books, ETC.\n\nNOTICE.\n\nAll parties having claims against us will please send them in at once, and all parties indebted to us will settle their accounts at once, as we wish our books closed.\n\nBalance of stock at hand and under cost for cash.\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nRUSSELL & DAVIS.\n\nWHOLESALE & RETAIL Butchers.\n\nGAME IN SEASON.\n\nBranch Sales—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\nBROWN'S BRICK STORE.\n\nBUFFALO HALL!\n\nOur books for 1886 show the largest year's business we have enjoyed since opening in Prince Albert.\n\nWe start the New Year with Fresh Goods (which arrived too late for our Holiday Trade) in\n\nRaisins, Currants, Dates, Fect & Jam and Canned Goods, Oysters, Finnan Haddie, Etc., Etc.\n\nAll Winter Goods in our Dry Goods and Clothing Department are now being offered at Greatly Reduced Prices.\n\nBETTS & Gwynne.\n\nSTOVES!\n\nA Further Reduction of 20 per cent. will be given on all BOX AND PARLOR STOVES Remaining on hand.\n\nCamp Stoves and Piping AT BOTTOM FIGURES.\n\nI have a first-class workman, and will execute all orders for Tinsmith's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\nA FULL STOCK.\nJ. R. McPhail.\n\nCOAL OIL\n\n75c per Gallon.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS, Sideboards, Cupboards, Bureaus, Washstands, Sofas, Easy Chairs Bedsteads, Mattresses, Cot, Cradles, And all kinds of Chairs, Etc., which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\n\nSaleroom, First Door West of Bank.\n\nW. B. GOODFELLOW.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887011401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5636, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 9959, 1], [9959, 12705, 2], [12705, 14373, 3], [14373, 23433, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]