[{"id": "79fa6e7e8aad2fc6c6155cdfc105aba1ef26d56c", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\n\nThis paper may be found in\nGOLDEN'S CANADIAN NEWSPAPER\nPRINTING COMPANY\nNEW YORK\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\n10 a.m.-The Lordship's Bishop.\n7 p.m.-Rev. Mr. Wright.\nThe Mission Chapel.\n11 a.m.-Rev. Mr. Wright.\n6 p.m.-His Lordship's Bishop.\n\nSt. Catharine's\n9 a.m.-Rev. Canon Field, B.D.\n12 noon-Rev. Mr. Craig, B.D.\n5 p.m.-Rev. Canon Field, B.D.\nSt. Andrew's\n10 a.m.-Rev. Mr. McReynolds.\nSt. John's\n9 a.m.-Rev. Mr. Craig.\nSt. James'\n9 p.m.-Rev. Mr. Craig.\nSt. Anne's\n9 a.m.-Rev. Mr. Craig.\nSt. Paul's (Presbyterian)\n11 a.m.-Rev. Mr. Craig.\n\nFRIDAY, MAY 21, 1886.\n\nThe Government steamer Lansdowne has seized an American fisher vessel for violating the Canadian fisheries regulations, and taken her to St. John's, a prize crew being put aboard. This action on the part of the captain of the Lansdowne will bring the trouble between the Canadian and American Governments over the渔业 regulations to an issue. It is not to be supposed for a moment that the American Government will remain quiet in the matter. There will be a large amount of blood shed, sympathy among John Bull will be demanded, and the irresponsible members in Congress—and all who hate anything and everything British—will specialise on demonstrating their hearts' content. But the sober, sound common sense of the two Governments may be trusted to settle the matter in an amicable manner. None of them have anything to gain and everything to lose by quarrelling; at the same time, the rights of our fishermen must not be overlooked.—Manitoban.\n\nWith a wonderful stubbornness the Turks persist in war with Turkey and by their hostility may have commenced. Should the two parties be allowed to fight the matter out there can hardly be anything but one result. The Turks are born soldiers and anciently trained in the brave. Their fighting power was shown in the British war with Russia and again against the Russians a few years ago. The Greeks are weak in the science of war, though personal bravery is there is altogether unlikely that the other powers of Europe will allow the fight to proceed. The British premier has already stated that unless Greece obeyed the requests of the Governments of the other European nations steps would be taken at once compelling her to do so, and there is little doubt they will be. The peace of Europe is too important to be jeopardised by a third-rate power like Greece, no matter how much she may be willing to fight.\n\nHUDSON'S BAY.\n\nThe people of the Northwest are satisfied that the Hudson's Bay Company is an absolute necessity. Their interest in the road and their interest which they are taking in the effects being made to the necessary capital buildings is proof enough that this is the case. In the eastern provinces, however, there is a strong feeling of opposition to the scheme. So jealously are eastern merchants of any development near the borders that they divert trade from themselves, that they have gone as far as opposing any exploration of the straits as an unnecessary waste of public money.\n\nThe results of the expedition are most useful and important, next to the people of the Northwest, and they have every right to insist that they shall be equipped in the most thorough manner. An important consideration is the size of the vessel itself. Is not the vessel purchased for the purpose? In Lieut. Gordon's report of the expedition he says that the Alert's engine is only capable of raising lower. Surely a vessel with such limited power is hardly fitted to explore the straits, and when it is remembered how inadequate her capacity for carrying coal is—240 tons for a five month voyage—there is no wonder we attribute the delays and struggles mentioned in the report as due to cause alone, and delays and struggles which would not have occurred had a larger and more powerful vessel been employed. Owing to her deficient steam power, it was impossible for the Alert to push her way through the ice, and yet the vessels of the Allan line have pushed through where it was considered impossible in the Gulf of St. Lawrence. Every spring on their voyage to Quebec Eastern merchants and editors have tried to make it appear that the delays were caused by Lieut. Gordon's fatal error concerning the navigation of the straits, whereas they were obstacles which a more powerful vessel would not have experienced.\n\nThe test of a sailing vessel such as the Alert is, fitted up with an auxiliary screw and with a very limited amount of coal, should not be taken as that of an ocean steamship. The steamships plying between Europe and Hudson's Bay would not, quite put into question, nor would they encounter the risk of meeting storms as we still hanging to the shores as was done with the Alert. The steamer which would desire to push through the straits would go for Churchill or Fort Nelson as directly and quickly as possible, with a steamship such as will ply between Liverpool and the terminus of the Hudson's Bay Railway. If the steamer line completed its run, a test has not yet been made. The determination of a question of such vast importance to the whole Northwest should not be left to the chance of what was depend for solid evidence upon the performance of a vessel as the Alert. Beyond the fact that she is strongly built she is without question one of the worst ships that could possibly be sent out. In conclusion, in this state of things, is the testimony of a number of captains of sailing ships, who know her qualities well and who are also experienced in the kind of navigation which she encountered.\n\nThe expedition to be sent out this year should start earlier than the first week in July. It is too late in the season for any vessel to sail. When parliament voted the appropriation for the expedition it was stated that the object sought was to ascertain the actual period each season during which the straits were navigable.\n\nRecent accounts say that the steamer occasionally sails, and this result cannot be obtained by employing such vessels as the Alert or try sailing them out as late as July. Well equipped, such vessels would be able to pass through the straits, and the reading of her logs would be a far better test than that of such a vessel as the Alert.—Manitoban.\n\nCapt. Young's stables, at the Lower flat, fell a victim to prairie fires on Mon day last.\n\nWe verily believe that T. Gill & Co., Wm. Macdonald & Co., and Mr. Sam Bostwyk, have had granted them for their commerce, Royal Letters Patent, issued at Ottawa, 25th April 1886, Number 2002.\n\nShannon & McLeod having purchased the building in which they are doing business, from Mr. C Hamilton, have laid a barrel floor in it, painted up both inside and outside and the floors newly fitted up, making it one of the neatest stores in town. They have just opened a complete assortment of boots and shoes in all sizes and styles.\n\nTHUS. POWERS,\nIS PREPARED TO TAKE\nCONTACTS FOR\nBrick, Plastering and Stone Work.\nAll orders promptly attended to. Rates furnished.\nBrick and Lime always on hand.\nPrince Ath's Mask\n\nA FAIR WARNING.\n\nAll Parties indebted to\nT. E JACKSON\nwho fail to settle before the fifteenth of February will be sued at the next Court without any further notice.\n\nT. E. JACKSON\nNew Stand, in the building lately occupied as a Post Office.\n\nSHERIFF'S SALE OF LANDS.\n\nUnder and by virtue of a writ of Possession issued by His Excellency the Lieutenant Governor of Canada, A.D. 1886, at the instance of Justice Macleod, Judge of the County of Medicine Hat, and to me directed, I have assessed and sold the following premises, the titles of which are endorsed, viz.:—all the rights, title and interests of the land described in Schedule attached to this notice, being all the Town Lots 1 to 10 inclusive, in the town of Medicine Hat, on the North side of the South Saskatchewan River Lot 77, in the Township of the Prince Albert Special District, on the west side of the said river, bounded as follows:—Town Lots 1 to 10, both inclusive, in the town of Medicine Hat; Lots 1 to 3, inclusive, in Block 11, Section 15, Township 1, Range 1, Medicine Hat District; Lots 1 to 6, inclusive, in Section 14, Township 1, Range 1, Medicine Hat District.\n\nThe above lots have been purchased till May 1st, 1886.\n\nThe balance has been further postponed till May 1st, 1887.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Tanton.\n\nRepairing Promptly Attended to.\n\nTHE MEDICINE HAT LUMBER CO.'Y.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nJ. SINCLAIR & CO.\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Tanton.\n\nRepairing Promptly Attended to.\n\nTHE MEDICINE HAT LUMBER CO.'Y.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nJ. SINCLAIR & CO.\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Tanton.\n\nRepairing Promptly Attended to.\n\nTHE MEDICINE HAT LUMBER CO.'Y.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nJ. SINCLAIR & CO.\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Tanton.\n\nRepairing Promptly Attended to.\n\nTHE MEDICINE HAT LUMBER CO.'Y.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nJ. SINCLAIR & CO.\nMerchant Tailors.\n\nNEW GOODS!\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS\n\nN.B.—The Tailoring Department will be superintended by Mr. Tanton.\n\nRepairing Promptly Attended to.\nWOOLWICH.\n\nEngland's Great Arsenal Some Points in Its History.\n\nWoolwich, which is the seat of England's greatest armament and Royal Military Academy, was originally an interesting place in the world, was originally as prominent in a naval as it now is in a military sense. The first royal dockyard in England, and as early as 1512 men-of-war were constructed there. The \"Henry VIII de Tres\" was built there in the third year of Henry VIII, and from this dockyard were launched many of the ships of the Armada, including the \"Mary Rose,\" \"Cavendish,\" and \"Hawkins\" and \"Frobisher.\" With advances in science, this yard has steadily paced being one of the largest and most complete in existence, but it could not keep pace with the demands of modern warfare. A ship building yard is now impossible to build these marine monsters in our crowded and shallow river without great risk and enormous expenditure. The yard has been abandoned and the yard, except a small portion, which was sold, transferred to the War Department for use by the Navy, by which it is used principally for storage purposes, the old buildings being utilized for that purpose.\n\nThe Royal Arsenal stretches for a mile along the Thames, eastward of the dock yard, and covers over 150 acres, and while it would not be possible to rebuild on the site of the ancient ordnance establishment in Queen Elizabeth's reign, yet there did exist an ordnance armory at Woolwich as far back as the seventeenth century. From the fact that the arsenal occupies the site of what was once a large Roman fortification, was long called Woolwich Warren, and in Lescot's \"Encomium of London\" (1786) is thus described: \"The gun-what of Woolwich is very famous; it is said to have formerly occupied what is now the site of the market place. The Woolwich Warren was the chief armory of the ordnance belonging to the navy. Within this Warren is a foundry for brass cannon, and a foundry for iron for the use of the army and navy, and necessary for military machines. Armament for the use of gunboats as well as for the navy is made by contractors in various places, as the brass cannon cast in the foundry here, must be proofed at Woolwich.\"\n\nOne of the most notable \"strikes\" on record occurred here in the reign of Charles II, when the workmen went out in Spain and France. The rope maker, desirous to control the number of persons in their craft, refused to take any apprentices to the King, so put into effect the eight hour day, whereupon every man (there were 4000 stopped work) took up arms, and the rope makers could not be fitted out without rope and consequently, to induce them to return to their trade, the promised men were released and all the demands of the strikers granted.\n\nThe growth of the arsenal was considerable during the reigns of Charles I and II, and the ordnance for the public service was obtained from private manufacturers, but provisions were made for the production of guns, and the first government foundry for the manufacture of cannon was formally established in 1715 under the direction of the Royal Artillery Company of Woolwich. The foundry building, which is still preserved, was finished in 1717, and is said to be the oldest building in the town borough. A writer describes it as \"stately, solemn and picturesque, with its high turrets, its towers, its domes and carved porch looking like a fine old gateway, and the factory ranges which have sprung up around it, especially the tall chimneys of the foundry, are very handsome, but at present it covers upwards of 300 acres, and while in 1796 the number employed in the manufacture was 1,500, the present force is 10,000 in times of peace, and more than 14,000 in times of war.\n\nThe arsenal is surrounded by a high brick wall and has a massive entrance opening on to a wide gravelled space, the entrance gate being approached by a flight of steps. This entrance was built in 1829.\n\nThe magazines, which are enormous, are filled with batteries and ordnance machinery, and in them is manufactured everything from powder cases to bombs, shells, cartridges, etc., and the pattern rooms and museums are models of an almost endless variety of warlike articles, including cannon, mortars, etc., as well as models for casting tools and tools of various sorts. All forms and kinds of shell, grape and canister shot, from 100 pounds to 200 pounds in weight, are armed and exhibited, and specimens of all kinds of rockets, cartridges and other kindred articles are to be seen.\n\nIn a building near the museum is a gun which weighs tons, bears a heavy brass gun to its base, fixed on both its exterior and interior face. The gun is mounted on a carriage, containing everything required in time of war from a gun carriage to a gunboat, and the gunboat gun is mounted on a carriage, containing everything required in time of war from a gun carriage to a gunboat.\n\nAnother Rebellion Amongst Last Year's Goods\n\nWe Are CLEARING OUT! Our Entire Stock.\n\nNow Is Your Time to Make Money.\n\nROYAL COMMISSION.\n\nNorth West Rebellion LOSSES CLAIMS.\n\nCOMMISSIONERS:\n\nJ. ALPHONSE OUIMET, Esq.,\nHENRY MIMA, Esq.,\nTHOMAS MCKAY, Esq.\n\nThe commission will hold its sitting at the following times:\n\n10 A.M. to 1 P.M.\n2 P.M. to 4 P.M.\n5 P.M. to 7 P.M.\n\nJ. ALPHONSE OUIMET,\nChairman\n\nGEO. H. YOUNG,\nSecretary.\n\nCommission on UYALL.\n\nNorth West Rebellion LOSSES CLAIMS.\n\nCOMMISSIONERS:\n\nJ. ALPHONSE OUIMET, Esq.,\nHENRY MIMA, Esq.,\nTHOMAS MCKAY, Esq.\n\nLa Commissione è aperta a Prince Albert.\n\n10 h. a.m. a 1 p.m.\n2 h. a.m. a 5 p.m.\n\nJ. ALPHONSE OUIMET,\nPresidente de la Comisión\n\nGEORGE H. YOUNG,\nSecretary.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Newspapers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 100 Broadway, New York.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES FOR\n\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelling,\nDress Goods,\nSilks,\nLinen, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK.\n\nJRY LUMBER.\n\nMOORE & MACDOWALL\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 3\nCommon Lumber, 3\nDimension do., 4\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are here to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nW. R. FISH,\nGENERAL MERCHANT\nA FORTUNATE BLUNDER.\n\nA Romance of the Oil Springs.\n\nAway up in the wilderness of Canada, far beyond where the famous Saguenay falls are located, there is a small town called \"Oil Springs,\" situated on the banks of the Saguenay river. The town was founded by Mr. Thomas, who had come from England with his family and friends, and they had settled there because of its beautiful scenery, its peaceful life, and its excellent climate. Mr. Thomas was a wealthy man, and he had brought with him a large fortune, which he had invested in various businesses. However, his fortune had been lost, and he was now living in poverty.\n\nOne day, while walking along the river bank, Mr. Thomas came across a young woman named Louise, who was gathering wood. Louise was very pretty, and she struck Mr. Thomas as being very attractive. He decided to court her, and he began to visit her frequently. Louise was very kind to Mr. Thomas, and she often invited him to her house for dinner. They became very close friends, and Louise eventually fell in love with Mr. Thomas.\n\nOne day, while they were walking along the river bank, Louise suddenly disappeared. Mr. Thomas searched everywhere for her, but he could not find her. He became very worried, and he decided to go to the police station to report her disappearance. However, when he arrived at the station, he found out that Louise had already been reported missing.\n\nMr. Thomas was very upset, and he decided to go back to his house. As he was walking home, he came across a group of men who were gathered around a fire. They were discussing something, and Mr. Thomas joined them. One of the men, who was named Louis, told Mr. Thomas about a secret society that existed in the area. Louis said that the society was very powerful, and that it controlled everything in the area.\n\nMr. Thomas was very interested in this information, and he decided to investigate further. He went back to his house and started looking through his papers. He found a letter written by Louise, in which she had mentioned the secret society. Mr. Thomas realized that Louise had been kidnapped by members of the society, and he decided to rescue her.\n\nMr. Thomas went back to the police station and reported Louise's kidnapping. The police immediately started investigating, and they soon discovered that Louise had been taken by members of the secret society. They arrested several members of the society, and Louise was rescued.\n\nMr. Thomas was very grateful to the police for their help, and he decided to write a book about his experiences. The book became very popular, and it was translated into several languages. Mr. Thomas became very famous, and he continued to live happily ever after.\n\nTHE IRISH RIDGE AND THE PRISON RS.\n\nRather a good story, which is quite amusing to read. It seems to be a true account of an Irish lad who was imprisoned in the North-Western Gaol, and who escaped from it. The lad was very clever, and he managed to escape from the gaol. He then went to the United States, where he became very successful. He returned to Ireland, and he became very rich. He died a happy man, and he left a large fortune to his children.\n\nTHE NEW WALLPAPER.\n\nE. J. CANN.\n\nTO THE LADIES.\n\nNEW GOODS AT\n\nMISS MAC & CO.\n\nFirst Door East Telegraph Office.\n\nCHAS. WOODMAN BETTS & Gwynne.\n\nPROPRIETOR.\n\nExamine Our Stock of Xmas Confectionery and Biscuits.\n\nWM. STOBART & CO.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF DOMESTIC AND IMPORTED CIGARS EVER OFFERED IN PRINCE ALBERT.\n\nA BILLIARD TABLE AND SALOON.\n\nFLOR DE BENITO.\n\nCREME DE LA CREME.\n\nBELLE CUBA.\n\nHENRY CLAYS AND WAGNER.\n\nALL CHOICE GOODS AND SEASONED.\n\nCHAS. WOODMAN BETTS & Gwynne.\n\nPROPRIETOR.\n\nExamine Our Stock of Xmas Confectionery and Biscuits.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886052101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 4898, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9581, 2], [9581, 15997, 3], [15997, 19762, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]