[{"id": "ef9fa7a6d76218e27b7d7027a409d826b43899d3", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVENTY\nPRINCE ALBERT N.W.T.\n\nTERR - $1.00 minimum in advance.\n\nSingle copy, 10 cents. Copy can be inserted in the paper. Rates quoted in terms of local pay. All advertisements inserted without instructions will be inserted under bid. All letters to be addressed to the Proprietor.\n\nThis Paper may be found at the following locations:\n\nThe Morning Star (Chief Editor, Mr. G. W. M. Toomey of New York.)\n\nSunday Church Services:\nSt. John's Church\n6 p.m., Sunday morning.\nSt. Paul's Church\n6 p.m., Sunday morning.\n\nMonday Church Services:\nSt. Mary's Church\n6 p.m., Monday night.\nSt. Andrew's Church\n6 p.m., Monday night.\n\nSchools\nSome time ago a public meeting was held to decide what steps should be taken to provide increased school accommodation, at which meeting the trustees promised to build a schoolhouse. But nothing more has been done by the trustees as yet towards carrying out the instructions they received. What were the reasons for the delay we do not know, but we have heard that most of those attending at present are still in school at the end of January. This being the case, the sooner the trustees proceed to business the better, or they find themselves without school accommodation at the end of the year.\n\nCOLONIZATION SOCIETIES.\nThe settlers of Saskatchewan recently held a public meeting at which they passed a resolution asking the Temperance Colonization Society to take advantage of the offer made by the Government to secure lands of the Society off the lands held without school accommodation at the end of the year.\n\nAn ordinance is now on foot to incorporate a new town called Regina. The town will have a mayor and council elected by the voters.\n\nMERCY.\nIf every government showed a disposition to be merciful to a wronged foe—if over the perquisites of mercy was exercised to the fullest extent consistent with expediency, we think that our present rulers would have so acted. But within reason, we cannot deny that there is a feeling in this district that the government went too far when it respected Dumont, Dumas and Garneau—who were scarcely known to bands—by making them what right which that had forfeited by taking up arms against the government, and it is possible that this may prove to be the case. However, we trust that all will be well when the new legislature takes into account how the people feel about such conduct from the government.\n\nThe reason why was the manner in which the government treated its opponents. In its recent issue, the Edmonton Bulletin—a recent issue—endeavors to show how the policy of the government with regard to both the rebels has been taken. Not only has the government attempted to intimidate, but it has also used its influence to prevent any party from obtaining justice through the courts.\n\nCOLONIZATION SOCIETY.\nSome days ago, a public meeting was held to discuss the question of providing increased school accommodation for the schools in the parish. At this meeting, the trustees promised to build a schoolhouse. But nothing more has been done by them in carrying out the instructions they received. What were the reasons for the delay were not known, but we have heard that most of those attending at present are still in school at the end of January. This being the case, the sooner the trustees proceed to business the better, or they find themselves without school accommodation at the end of the year.\n\nA special meeting of the Council was held on Wednesday evening. All the members present except His Worship the Mayor were present. The attendance was good and the award made to the member who made the best speech.\n\nSHERIFF'S SALE OF LANDS.\nUnder the provisions of an order in the Saskatchewan District Court, Prince Albert, the sheriff is empowered to sell lands belonging to the Natives of the district for failure to pay taxes. The amount of money due at present amounts to nearly two million dollars.\n\nNEW GOODS.\nJUST ARRIVED.\n\nGENTS' FURNISHINGS.\n\nAn Ordinance to amend, and consolidate an ordinance, and amend other ordinances relating to the sale of land in the Nome, Paskatow, Estevan, and Moose Lake Districts, Province of Ontario, Canada.\n\nPayable strictly in advance.\n\nThe Weekly Edition Will Contain the News of the Week, Selected Miscellany, an Interesting Serial, and Special Departments of Peculiar Interest to the House Circle. No effort will be wanting to make our Weekly a welcome visitor every where.\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—550 columns in all—and the price will be placed at the very low price of $1.50 PER ANNUM.\n\nTHE LION REAPER!\n\nON TERMS AT\n\n$50 $75 $100\n\nT.J. AGNEW.\n\nTHE WEEKLY SUN!\n\nJ. SINCLAIR & CO.\n\nCanada—North West Territories.\n\nMerchant Tailors.\n\nNEW GOODS.\n\nJUST ARRIVED.\n\nCENTS' FURNISHINGS.\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nNEW GOODS.\n\nJUST ARRIVED.\n\nCENTS' FURNISHINGS.\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nNEW GOODS.\n\nJUST ARRIVED.\n\nCENTS' FURNISHINGS.\nMASONIC ADDRESS.\n\nFollowing is the address adopted by\n\nKnights Lodge A.F. & A.M., at the\n\nlast meeting held in this city, and\n\nforwarded to Rev. E.K. Matheson,\n\nof Leithbridge, one of the members\n\nof the lodge, expressing the regret of\n\nthe lodge at his departure from this\n\ndistrict:\n\nTo Rev. the Rev. E.K. Matheson, S.W.\n\nKnights Lodge A.F. & A.M., No. 16\n\nG.R.M.\n\nDear Brother and Fellow Mason, We, the\n\nofficers and brethren of Knights Lodge,\n\nA.F. & A.M. No. 16 G.R.M., desire\n\nto express our very sincere regret at\n\nyour leaving this jurisdiction.\n\nBy your chivalrous character we have\n\nlearned to look up to you as one of\n\nMasonry's brightest lights, and also as\n\none of its most Worshipful Master, for\n\nhigh duties you are so ably fitted.\n\nWe fully sympathize with your par-\n\nticulars, and extend our sympathy\n\nby your removal from amongst us.\n\nIn your new home, although amongst\n\na race of kind people, we trust you\n\nwill meet with joy, the society of many\n\nBrothers who will learn to esteem\n\nyou as a chivalrous knight, a pattern to\n\nall who see you. In bidding you adieu,\n\nwe earnestly pray that the Great\n\nArchitect of the Universe may still con-\n\nsider you as one of His chosen, and\n\nin your quitting efforts do good.\n\nOn behalf of the lodge,\n\nW.R. MARKLEY, W.M.\n\nR.W. WAY, Secretary.\n\nIn obedience to instructions received,\n\nGarnett, the man who has been con-\n\nvicted for the murder of Mr. Henry\n\nHumboldt, has been taken to Regina,\n\nwhere he will stand his trial. His re-\n\nmoval to Regina, will, of course, cause\n\ngreat excitement and loss both to the crown\n\nand to himself, but all concerned will\n\nhave to submit.\n\nLANSDOWNE.\n\nCANADA.\n\nVICTORIA by the Grace of God of the\n\nProvince of Canada.\n\nWHEREAS, the Hon. J. H. Clarke, Esq.,\n\nSecretary of the Agricultural Society,\n\nhas requested me to issue a Proclamation\n\nin connection with the fall show which\n\nwill take place on the 30th of September.\n\nThe Board of Directors of the Royal\n\nBank of Canada, being desirous of\n\naiding the Agricultural Society in their\n\nendeavours to encourage the production\n\nof superior quality of grain, have\n\ndecided to make an exhibition in it.\n\nIt was also decided that the Board of\n\nDirectors, many of the directors having\n\nex-\n\npressed their high appreciation of\n\nthe value of such exhibitions, believe\n\nthat they do, the farmers together and\n\naffording them an opportunity to exchange\n\nideas on current topics.\n\nThe Secretary was instructed to invite\n\nthe P.A.C. Band, as an honour band\n\nto be kindly asked to make the show a success.\n\nThe following communication was read\n\nfrom the Hon. R.O. Hagley, M.N.W.C.\n\nJ. H. Clarke, Esq.,\n\nSecretary of Ag. Society.\n\nSir, As the North-West Council may\n\nnot have had time last week to call the atten-\n\ntion of your committee to the matters mentioned in the enclosed memorandum,\n\nwhich bear on the agricultural interests\n\nthere, I am glad to receive from your\n\nsociety (the council) the opportunity of\n\ngiving any suggestions you may feel fit to make,\n\nas well as any others you wish to do so.\n\nI should like to meet these matters and\n\nsubjects appertaining to the matter. I trust\n\nthat your committee will give my suggestions\n\nevery attention and consideration, and\n\nencourage me to remain.\n\nYour obedient servant,\n\nJ. H. Clarke, Esq., M.N.W.C.\n\nFollowing is memorandum of ordi-\n\nnance—Ordinance respecting stallions,\n\nMares, and Sows, and Amendments,\n\nStain Animals, Production of Sheep,\n\nAmendments, Driving of Horses or Car-\n\nriages, Hauling Animals, To En-\n\nforce Ordinance Respecting Trees,\n\nClearing Tree planting, Marking of Stock,\n\nReceipt and Preferential rates, Fences,\n\nMarking of Cattle, and Amendments\n\nregarding Diseases in Animals, Prairie Fires.\n\nThe following committee was appointed\n\nto meet Mr. J. H. Clarke, Wm. Miller,\n\nMr. A. Scott, C. Stanfield, Mr. H.\n\nMiller, Mr. A. Adams, Adam Mcleish\n\nand Capt. Craig, with the Secretary.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\n\nFactory Cotton,\n\nFlannels,\n\nSheetings,\n\nTowellings,\n\nDress Goods,\n\nSilks,\n\nLinen, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Advertising Advertising Bureau, 10 Spring St., New York.\n\nWe are prepared to Contract for Buildings of any size in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nA TRIP DOWN THE SASKATCHEWAN AND OTTER LAKE WINNIPEG.\n\n(Continued from last Number)\n\nOn Wednesday evening the North-West Mounted Police came on board and passengers who wished to land at Lake Winnipeg were landed. Among them we noticed Mr. Edmondson, Mr. Harvey of Prince Albert District, and Mr. Gowan of Winnipeg.\n\nThe Cobille arrived at the east end of the lake about three o'clock in the afternoon, and then the steamer started for the Northwest, to the delight of all those eastern bound. Learning that the steamer was going to visit the Portage on Friday, we boarded on Thursday evening after bidding farewell to our friends who came from Winnipeg. We were very much pleased with our stay at Grand Rapids having been very pleasant establishment and our great desire to revisit again.\n\nThe Cobille started early on Friday morning, and after getting a few miles out on the lake had to stop for a while owing to the very high sea and anchored about a mile from our place of starting, and remained there until about two o'clock when we again set sail. We were not only a short time when the sea again got very rough, but the wind also began to blow, and the steamer became cumbered. At first it seemed quite pleasant, but what a sudden change! However, the steamer was able to keep her course, and, after turning pale, and violent waves were made for the coast, the steamer again took up her course at first, but the scene changed, and among the rocks we hung up the sight, and the steamer was obliged to go back to the Cobille. We were finally convinced of the truth of the old saying, \"There's no place like home,\" and Capt. Bell, aware of the Cobille, thoroughly understands the good old ship, and also thinks from the way she acts when she gets into trouble, that he thoroughly understands the Captain who has been navigating her for over 10 years. We had only been away seventy-five miles when we had to anchor again, and we remained there till the following morning. We had dinner before us, and a dreadful storm arose, the thunder crashed loud and long, the lightning flashed and the rain fell in torrents, and the Cobille pitched and rolled so that tables and chairs were overturned, and we thought that we would be thrown either off the deck or into the sea, but we were saved by the rocks to the west of us, driven out into the open sea, and racing along the coast, we were glad and thankful for the sea, but with both anchors set, little distance was made like the compasses of Quicksand and slow as the snail's pace, under the command of her brave and noble skipper, to weather many a gale and storm as we plowed through the night.\n\nSunday morning opened dark and cloudy, but the steamer continued her course more traversing the treacherous waters of Lake Winnipeg. The day was most agreeable, though being no clergyman on board, I could not say how long as best we could.\n\nEarly in the morning the steamer began to land, and the North-West men, being Canadians and the North-West men, then the boys all seemed so happy and with one accord cried, \"Out of town!\" and then the steamer would have a smile in the old old days.\n\nAbout 8 p.m., we met the Princess near Pembina House with whom a number of passengers on board, taking up the pleasure of Lake Winnipeg, probably they would have been very disappointed if we experienced the day previous.\n\nIt was here that a happy smile passed over the faces of our boys when for the first time they entered the steamer, and they looked upon that which cheers the weary and makes the poor feel rich. Here they met the Princess, who was waiting when she saw one of the waiters from the Princess, six feet six, carrying a large bundle of newspapers into the lower deck of the Cobille, but as she still thirsted and their mouths still watered, they reached Selkirk to taste fine buns and cakes.\n\nThe delay at this place was an impulsion upon the brave wanderer of passes, who had been delayed for some time, in reason of coming there to spend another weary day on water. We do not attach any importance to this, but it is a fact that it is higher authority. After a long delay, again separation, but being unable to get a boat, we returned to another one again east. The Monday we had a pleasant view and reached Selkirk, where we were obliged to remain for a day in consequence of freight under way.\n\n---\n\n**HARDWARE.**\n\n**AMMUNITION!**\n\n**SHOT,**\n\n**ALL SIZES OF**\n\n**SHELLS and**\n\n**WADS.**\n\nDupont's Celebrated Ducking Powder.\n\nLoaded Shells always on hand.\n\n---\n\n**J. L. JOHNSON & CO.**\n\n1879.\n\nBuffalo Hall!\n\nRECEIVED PER STEAMER MARQ IS\n\nDry Goods,\n\nClothing,\n\nGroceries,\n\nProvisions\n\nEvery Department fully assorted—Special Bargains in\n\nDress Goods, Embroideries, Prints, Sheetings and Plain Cottons.\n\nMaple and Fancy Groceries, Fresh Hams,\n\nSpiced Roll Bacon, Maple Sugar and Maple Syrup\n\nThe Largest Stock of Clothing in Town.\n\n---\n\n**BETTS & GWINNE.**\n\nFURNITURE.\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all\n\nThe Latest Designs!\n\nwhich I am selling at reasonable rates to make room for a large stock coming up by boat.\n\nCall and inspect my stock and get prices.\n\nSalesroom, First Door West of Bank\n\n---\n\n**W. B. GOODFELLOW.**\n\nWM. STOBART & CO.\n\nGeneral Merchants\n\nAND\n\nIndian Traders.\n\n---\n\n**WM. STOBART & CO.**", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886082701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3761, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5173, 2], [5173, 10022, 3], [10022, 15386, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]