[{"id": "ab8abee72989aa678342f934413c3684e83a36b5", "text": "THE PRINCE ALBERT TIMES\n\nWEDNESDAY, MARCH 21, 1883\n\nTHE OPPOSITION ORGAN.\n\nAs Dr. Porter has seen fit to announce that he will be present both in private and on the public platform, we do not hesitate to say that we shall be glad to see him in connection with the contest now going on for the representation of this district by the people.\n\nDr. Porter has stated on the public platform that we refused to publish anything handed to us by him. This statement is not true, and we feel sure that its falsity can be clearly proven. So far as that is concerned, this paper will not fail to do so.\n\nWe have always been willing to publish his grievances in his own person, but he refuses to come forward and make them known through the press.\n\nThe Prince Albert Times will therefore take no part in the discussion of this question.\n\nTHE REALIZATION.\n\nDr. Porter stated at the outset of the election that he had been compelled to offer himself as a candidate. In his letter published in THE TIMES at the time he said that he was requested to come out by a number of friends, and that he thought it best to accept the request.\n\nIf that request contains the name only of those friends who have not yet filled their canvassers' lists, then it is evident that he cannot have been asked to offer himself as a candidate. In his letter published in THE TIMES at the time he said that he was requested to come out by a number of friends, and that he thought it best to accept the request.\n\nTHE CAMPAIGN.\n\nThe Prince Albert Times has been obliged to give up its usual space for the publication of the speeches made by the candidates. It has been found impossible to get the speeches printed in time for publication.\n\nThe Prince Albert Times has been obliged to give up its usual space for the publication of the speeches made by the candidates. It has been found impossible to get the speeches printed in time for publication.\n\nNotice of Dissolution.\n\nA full and complete assortment in this line, including Ashton's Celebrated Prints.\n\nYarns\n\nNotice is hereby given that the undersigned will sell by mail order in Canada, Prince Albert, N.W.T., under the name of Hurd & Baker.\n\nHandkerchiefs\n\nQuilts\n\nBlankets\n\nSmallwares\n\nSEWING MACHINES!\n\nAttention! Ladies!\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS,\n\nPrince Albert - N.W.T.\n\nPRINCE ALBERT\n\nREAL ESTATE AND AUCTION ROOMS\n\nMESSRS. PETERSON, HANAFIN & KEENAN\n\nREAL ESTATE AGENTS,\n\nDoug Peterson, J. D. Hanafin, H. Keenan.\n\nOYSTERS, OYSTERS, OYSTERS.\n\nWe have just received a few cases of fresh oysters, which will be sold at cost.\n\nAT THE ROCK BOTTOM STORE.\n\nALSO A FEW CASES\n\nDRY GOODS, GROCERIES, BOOTS and SHOES,\n\nRUBBERS, CROCKERY and NICKLE PLATED CUTLERY.\n\nOur Master: Small Prices and Quick Return.\n\nH. Walters, F. G. Baker.\n\nTHOMAS O. DAVIS\n\nHorse Shoe Store,\n\nGeneral Merchant\n\nPrince Albert, N.W.T.\n\nWOODBINE BILLIARD PARLOR\n\nThe Palace Saloon of the North West.\n\nTwo Doors west of the Horse Shoe Store, River Street.\n\nTwo First Class Billiard and D.O. Tables.\n\nCroquet nightly.\n\nTom Davis - Prop.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company owns 7,000,000 acres in the Great North-West, and is now ready for sale 500,000 acres already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Red Portage, Portage la Prairie and Boucherville, N.W.T.\n\nThe Government of Canada offers an excellent opportunity for settlement, and the land is being sold at very reasonable prices.\nGRAND ANNUAL CLEARING SALE!\n\nSTILL GOING ON AT BUFFALO HALL\n\nOur business improves every month.\n\nCAUTION:\n\nReliable goods sold at fair profits, and advertising facts only.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nLARGESTOCK MEDICAL HALL,\n\nCONSISTING OF\n\nDrugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc.,\n\nAND ARE NOW OPENED OUT\n\nALSO ON HAND A GOOD SUPPLY OF\n\nPatent Medicines,\n\nINCLUDING\n\nFellow's Syrup,\nSt. Jacob's Oil,\nEclectic Oil,\nPain Destroyer,\nBlack Oil,\nBurdock Blood Bitters,\nVegetable Discovery,\nCod Liver Oil Emulsion,\nMedical Discovery,\nAugust Flower,\nEtc., Etc.\n\nJ. O. DAVIS & CO.,\nGENERAL MERCHANTS,\nand\nSouth Branch.\n\nTERMS--CASH.\n\nT. E. JACKSON,\nIn our New Premises, next door east of Farmers' Home and north of Old Presbyterian Church.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883032101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 1274, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3508, 2], [3508, 3508, 3], [3508, 4534, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]