[{"id": "8a25a76d0db3aa6744bdcfb5511cb06fe2c1e878", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nFRIDAY, JULY 23, 1886.\n\nAdvice from various portions of the Canadian Northwest indicate that the drought has done less damage to crops than might have been anticipated. On the heavier lands no injury whatever has been suffered, and even from the lighter lands a good yield is promised. The recent showers cannot fail to have a beneficial effect in promoting vegetation of all kinds. One thing at least is certain, and that is that no damage from frost need be apprehended this season. All important points that have been brought before us will be completed before there is any likelihood of any such visitation.\n\nThe Official Gazette contains the appointment of Lawrence W. Herchmer and Wm. Pierce to be commissioners of police for British Columbia under the public works act of 1885. Mr. Herchmer is a member of the St. Mary's congregation of the Roman Catholic Church.\n\nHis Lordship the Bishop will preach, as a rule, when at home, at St. Mary's in the morning and at St. Catherine's in the evening.\n\nSt. Mary's Church\n\nSt. Mary's Chapel\n\nSt. John's Church\n\nSt. Andrew's Church\n\nSt. James' Church\n\nSt. Anne's Church\n\nSt. Paul's Church\n\nFRIDAY, JULY 23, 1886.\n\nA dispatch from Yokohama announces the sailing of a second tea-laden ship, whose cargo is to be transferred to the Canadian Pacific Railway for conveyance across the continent.\n\nThe Canadian Pacific company appear to have been thoroughly satisfied with the result of sending an exhibition car through the eastern provinces and are now preparing to repeat the operation next fall. There can be no question as to the wisdom of this policy. The more that is shown of this country the more it is appreciated.\n\nPoundmaker, the well-known Indian chief, will no longer be a source of uneasiness to the Canadian Government. He has been expelled at Crowfoot's camp through the bursting of a blood vessel. There has been a good deal of dispute as to whether Poundmaker was a good or bad Indian, but there is now no longer any question; agreement, if we accept the opinion of the average westerner that the only good Indian is the dead one.\n\nThe Dominion Government is said to have decided upon a general amnesty for all engaged in the uprising in the Saskatchewan district last year. This proclamation will be followed by another for delivery. No exception can now be taken to a policy of mercy. Peace has been permanently restored, and even the feelings of bitterness generated by the unfortunate struggle have passed away. It is now time that all remembrance should be blotted out save of those loyal men who were called upon to pay with life or limb for Riot's supreme folly.\n\nWe will place on banks of Saskatchewan River, at Medicine Hat, ready for rafting:\n\nDressed Boards, $25 per m.\nScantling and Joist, up to 18 ft., 25 \"\nFlooring, Ceiling and Siding, 30 \"\nShingles, 4 \"\nTar and Brown Paper, 4cts \" lb.\nDoors, 2f 6in x 6f 6in, 1 1/2 \"\nDoors, 2f 8in x 6f 6in, 1 1/2 \"\nDoors 2f 10 x 6f 10 1/2 \"\n\nSASH FROM $1.80 TO $2.80 PER PAIR GLAZED\n\nAbove prices for cash only.\n\nCorrespondence solicited.\n\nTHE MEDICINE HAT LUMBER CO.'Y.\n\nW. T. FLAY, Manager\n\nP.S.—Bills cut to order.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—60 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week,\n\nSelected Miscellany,\n\nAn Interesting Serial\n\nand Special Departments of peculiar interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor everywhere.\n\nParties intending to subscribe are requested to send their names with the price of subscription to the office of THE MANITOBA SUN.\n\n12 Market St., E., Winnipeg.\nOUR LOCAL INDUSTRIES.\n\nThe Brick-Making Works.\n\nA few days ago we had the pleasure of making a visit to the brick works of Mr. Chester Thompson, near Guelph, Ont., and were struck with the neatness and orderliness of the premises, and one that promises to be of much importance in the future development of our town.\n\nWe visited the works situated on the grounds adjoining south-westward from the H. E. Co.'s grist mill, and just outside the boundary of the Township of Prince Albert. The works are very extensive, and the willow bank and are scarcely visible to one approaching from the town until he is within a short distance right into the midst of the busy scene.\n\nWe admit that what we saw was quite unexpected, and we were not prepared for such an enterprise. Our astonishment was therefore all the greater when everything seemed so well ordered and carried on in such a manner as to show that a great deal of thought and care had been given to the management of the works.\n\nA practically inexhaustible supply of water has been provided, and the works are now in full operation. We were struck with the neatness and orderliness of the premises, and one that promises to be of much importance in the future development of our town.\n\nThe Lindsay School Picnic.\n\nIn the Editor of The Times.\n\nSir,—Nestling among the tiny lake and grassy hills of this beautiful spot, lies a charming hamlet, the seat of Lindsay, which was my first home, and where I spent my childhood.\n\nOn Saturday last the country in the vicinity of Lindsay and Duke Lake was visited by a large number of people, who came to see the wonderful transformation that has taken place in this part of the Northwest. Crops were everywhere abundant, while the fields were covered with wheat, oats, and corn. The scene was one of great beauty, and the people were greatly pleased with what they had seen.\n\nThe Lindsay School Picnic was a great success, and the children had a most enjoyable time.\n\nCOMMUNICATIONS.\n\nJ. M. Campbell's Grocer.\n\nAnd Dry Goods Merchant,\n\nPrince Albert, Sask.\n\nDry Lumber.\n\nMoore & Macdowall.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 100 Broadway, New York.\n\nAGENTS\n\nWe are prepared to Contract for Buildings at any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTELEGRAPHIC.\n\nTHE VERY LATEST NEWS BY WIRE.\n\n(Wire Special Telegraph.)\n\n27th July, 1886. Sir John A. Macdonald, Prime Minister of Canada, has sent a message to the Governor-General of Canada, calling upon him to proclaim a state of emergency in the province of Quebec. The message reads:\n\n\"I have received information that there is a threat of civil unrest in Quebec. I therefore urge you to declare a state of emergency to maintain order and protect the peace of the province.\"\n\nThe Governor-General has responded to Sir John's message by declaring a state of emergency in Quebec.\n\nThe situation remains tense as Canadian officials work to prevent any further violence.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nPaints, Paint Oil, Machine Oil, Scythes, Snaths, Glass Putty Cut Nails, General Shelf and Heavy Hardware.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE!\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all the Latest Designs which I am selling at reasonable rates to make room for a large stock coming up by boat. Call and inspect my stock and get prices.\n\nW. B. GOODFELLOW.\n\nBuffalo Hall!\n\nOUR SUMMER STOCK IS NOW COMPLETE.\n\nLadies should examine our stock of Fancy Dress Goods, Prints, Cottons, etc., Cloths and Furnishings.\n\nFamilies should be entirely supplied from the Finest Stock of Staple & Fancy Groceries.\n\nEver Opened Here.\n\nBETTS & Gwynne.\n\nWM. STOBART & CO.\n\nNEW GOODS AT MISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nIndian Traders.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886072301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 1995, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3947, 2], [3947, 6397, 3], [6397, 7945, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]