[{"id": "d140f4c64221fd758158706b9ac575a9b8589f30", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETY\nPRINCE ALBERT N.W.T.\nTHERE'S $1.50 per month in advance.\nSingle copies 10 cents each.\nIn no case will price be increased in this paper. Single copies 15 cents per month.\nAdvertising accepted without limit for first insertion, and at per line for all subsequent insertions.\nNo contracts made under three months.\nNo advertisements accepted for less than $1.\nAdvertisements without instructions will be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETY, Proprietor\n\nSUNDAY CHURCH SERVICES\nSt. Albert's Church—Morning 10 a.m., and\nSunday School 12 noon. Incumbent is\nRev. Mr. MacKay.\nSt. Paul's Church—Morning 10 a.m.—Rev. Canon\nH. J. Horwood, Rector.\nSt. John's Church—Morning 10 a.m.—Rev. Dr.\nMcKay.\nSt. Mark's Church—Morning 10 a.m.—Rev. Dr.\nMcKay.\nSt. Matthew's Church—Morning 10 a.m.—Rev.\nDr. McKay.\nSt. Peter's Church—Morning 10 a.m.—Rev. Dr.\nMcKay.\n\nTHIS PAPER may be found at\nBOWMAN & Co.'s News Agency. Advertising\naccepted without limit for first insertion.\nAdvertising without instructions will be\ninserted until further notice.\n\nFRIDAY, SEPT. 21, 1898.\n\nWe congratulate the electors of East Assiniboia on their having returned the Hon. Mr. Dewdney by acclamation, as well as having secured such a representative as they have in the Minister of the Interior. Mr. Dewdney's entire sympathies are still always with us and the Northmen and we can not evidently look forward to an era of contentment on the part of the settlers, for we believe convinced that the new Minister will take prompt action to remove the difficulties which may be existing in local regulations and will strive faithfully to carry out the wishes of the people and to promote the welfare and prosperity of the country. Although in his present capacities of Lieutenant-Governor and Indian Commissioner many complaints were made against Mr. Dewdney, and those politically opposed to him resorted to every conceivable method to disparage his character, yet they have been unable to prefer one direct charge against him, and to-day, after having for seven years treated his slanderers and villains with the contempt which they deserved, he is now elected in the Territories where he is best known that no one could be found reckless enough to oppose him in the recent election in East Assiniboia.\n\nYellow fever is raging in Florida and is spreading with amazing rapidity in that State. The fatality is very great.\n\nLast week's papers bring the announcement that the last rail has been laid on the Red River Valley Railway, so that the people of Winnipeg have a line of railway to connect with the C. P. R.\n\nThe Northern Pacific has commenced work on the branch line from Winnipeg to Portage and Morris to Brandon. These branches have to be completed by November 1, 1899, under the terms of the agreement recently entered into between the Provincial Government and the Northern Pacific Railway, so that western Manitoba will soon have good railway facilities.\n\nWith reference to the Regina and Long Lake road, in which we are more directly interested, the talk is still that all necessary arrangements have been made for its immediate construction through Alberta. We have not yet heard of any contract being let, and as the season is getting late, the probabilities are that nothing will be done this year.\n\nThe Greenway Government do not appear to have made a very creditable bargain with the Northern Pacific. The railway company appears to be going to settle. The Government is widely condemned for its action in the matter. In the local Legislature, when the contract was voted on, Mr. Isaac Campbell, M. P., and Mr. McNeil, M. P. F., voted against it. The Greenway-Martin railway deal is condemned by Griz and Toric alike, the Free Press being particularly severe in its criticism of the Government.\n\nOn Thursday a party of our folk rode out to the home of Hon. Theo. Makin, Mr. James Haggith, T. N. Campbell, W. R. Gurney and James McKay, succeeded in bringing back 300 lbs. of vicinity beef from Dog Hill. Under the influence of one of the rigs was caught in a regular Dakota cyclone which did considerable damage, but by the abundant use of shaggyapp and portions of under garments the party succeeded in getting back to town. T. N. Campbell got down the last load, but was shot. Next.\n\nThe annual Dinner at Island Lake is held at the Methodist Church in that settlement a great success, and the ladies who were instrumental in getting it up were most attentive and most kindly enjoyed by everyone present, and especially the ladies who came from town.\n\nThe P. A. C. Band were in attendance and kept things airy all afternoon. The weather was very mild and sunny and quite a crowd was building the church. The drive, both going and coming, was very merry and enjoyable.\n\nSILK RIBBONS:\n\nThose of our lady readers who would like to purchase silk ribbons may find them at Russell & Davis by mail in different widths and all the latest styles. Silk neckties, cravats, strings, neckwear, scarfs, trimming, etc., can get an astonishing big bargain. Address Russell & Davis, wholesale Ribbon Manufacturing Co., 100 yards $1.50 cents to the address—give below.\n\nCampbell's Cathartic Compound (Liquid.)\n\nNote.—This favorite medicine is put up in oval bottles holding three ounces each. It is sold by all dealers in drugs, and the name of the inventor, S. E. Campbell, is written across the face of each bottle. It is also sold in Canada by wholesale dealers, and will be shipped promptly.\n\nCampbell's Cathartic Compound\nCures Chronic Constipation,\nCoughs, Catarrhs, and all Complaints arising from a disordered state of the Liver, Kidneys, Bowels, and other organs.\nDyspepsia or Indigestion, Biliousness, Headaches, Heartburn, Loss of Appetite, Nervous Debility, Nausea, or Vomiting, &c., &c.\nPrice 50 cents.\nSend for sample.\nRUSSELL & DAVIS\nWHOLESALE AND RETAIL\nButchers\nBeef, Pork, Mutton, Sausage,\nBacon, Ham and\nGAME IN SEASON.\nRUSSELL & DAVIS\nRIVER STREET.\n\n\"BELL'S ORGANS\nUnapproached for Tone and Quality.\nCATALOGUES FREE.\nBELL & CO., Guelph, Ont.\n\nHORSE SHOE STORE\n\nJust arrived—A Large Consignment of\nChoice Groceries, Canned Goods,\nPickles, Sauces, etc.\nFifty Chests Choice Congo Tea\nWhich we will sell until further notice at 25c per lb.\nFresh importations in\nFancy Dry Goods, Millinery,\nRibbons, Hosiery, etc., etc.\nFull Lines of Windowcurtains\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\nJust arrived—Large Stock of\nPATENT MEDICINES, STATIONERY, ETC. ETC.\nBOOTS AND SHOES ARRIVING WEEKLY\n10,000 CHOICE CIGARS!\nAt Manufacturers' Prices. Also a Full Line of\nMEN'S AND BOYS' LIGHT SUMMER SUITS\nIN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\n—GENTS FURNISHINGS\nA LARGE STOCK OF\nImported Tweed suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nGENERAL NEWS.\n\nThe following is the latest news regarding the terms of union of Newfoundland into the Dominion of Canada, who were to have left today, but have abandoned the project, owing to the heavy losses for the season. The reason given is that the existence of the present troubles between the United States and Great Britain may tend to prejudice the interests of Newfoundland if she joined the Canadian confederation.\n\nA large number of the fishermen returned by boat from operations in many parts of New Brunswick. While some of them, back again, others returned empty-handed. The hay, oats, and other fodder crops have matured equally as much damage from the continued wet weather, which retarded their growth, as the crops generally.\n\nThe Northwest Assembly meets for the transaction of business about the 1st of October. Ross, of Moose Jaw, seems to be the favorite for speaker. The appointment of Mr. MacLelland as minister of the interior was confirmed by the legislative board at Suther-land and Second in East and West Asia. Hamilton, for Albertville, Beta, and Schomberg, for St. John's, were also appointed for Assiniboia West.\n\nThe Territorial Council will meet to elect its president on the 23rd. The appointment of Mr. MacLelland as Quebec legislature councillor for Mills Lake was confirmed by the council.\n\nGeorge Puddifoot, the famous quaker, who was attacked by paralysis while playing a game of crib at Kinross, died recently.\n\nThe Hon. George L. Stansfield family and suite left Quebec Monday morning for Toronto.\n\nEdward Biddle, of North Fredericks- burg, has been asked to pay $500 or stand a second trial for assault. Mr. McCorle, of the same township, said he had been badly treated by the prisoner in the case to proceed.\n\nThe members of the locomotive works at Montreal are negotiating with the government for eight feet of land purchased by the company. If an agreement is reached the company will erect a building for the employees' mess-room and bowling alley.\n\n100 cents good Dry Wood for sale at Walters & Baker's.\n\nOn Tuesday evening last the band went out to do the town and performed at the Town Hall. Mr. and Mrs. Swanson received the boys most cordially and a pleasant time was spent. Mr. Agnew and Mr. Pearsall are certain to be missed by the band. Mr. Agnew or Mr. Pearall are certain to be missed by the band. Mr. Agnew or Mr. Pearall are certain to be missed by the band.\n\nTHE GOVERNORS.\n\nEarly last spring Hill & Mason, of Sim- iliana, wrote to Mr. Moore, of Picton, Ontario, for a quantity of the poison which he had recommended for the extermination of the rabbits in Australia. Mr. Moore had heard of its success in destroying \"gophers,\" the pests of this country, and received from him a most encouraging reply. He also sent his own experience, a bottle containing 600 grams of chicken poison, with full in- structions for use, which was followed. Mix the poison with water, allowing the same to lie three or four days to germinate. Then mix with meal or short. The experiments were very successful, and the gentlemen referred to say that they have gained the upper hand of the pests. Many rabbits have been killed from them. Large numbers have been found dead, and an examination proves them to be killed. A few remain- ing around the mission are now far. It is to be hoped that this means of rid- ing the country of such destructive pests will be adopted throughout the province. Mr. Pearsall has kindly offered to give further supplies of the miracle substance to any who desire it.\n\nCOMMERCIAL. We think the agricultural societies in this district should do something toward the extermination of these pests, and urge all those in charge so that all correspondence will be got through with and the death toll be raised by the destruction of the pests in the spring. This poison may be also used for the destruction of larger animals than the rabbit, such as swine, calves, etc., and is destructive to sheep and young animals.\n\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nEvery Department\n\nCall and Examine Our Stock\n\nJ.M.CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of\n\nLUMBER FOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nThis is what Johnson's Fluid Beef claims to be.\n\nJohnson's Fluid Beef\n\nStrengthening and Invigorating Power\n\nAgents for Thor, Cook & Sons, Ltd., London, Ont.\n\nPrepaid Tickets\n\nTo bring passengers from Canada and Country.\n\nMoney Orders and Drafts on all points in Great Britain and the Continent.\n\nBaggage checked through for the ship by which you sail.\n\nWrite for particulars. Correspondence answered.\n\nG. H. Campbell\n\nGeneral Railroad and Steamship Ticket Agent.\n\n471 Main Street. - Winnipeg, Man.\n\nHeadquarters for all Lines, as under:\n\nAllen, Dominion, State, Dominion, German, White Star, Lloyd's (Bremen Line), Cunard, Direct Hamburg Line, French Line, Anchor, Italian Line, and every other Line on the Atlantic or Pacific Oceans.\n\nPublication of \"Campbell's Steamship Guide,\" containing full information regarding all Lines, with Time Tables and sailing dates. Send for it.\n\nAGENT FOR THOR, COOK & SONS, LTD., LONDON, ONT.\n\nTo bring passengers from Canada and Country.\n\nMONEY ORDERS AND DRAFTS on all points in Great Britain and the Continent.\n\nBaggage checked through for the ship by which you sail.\n\nWrite for particulars. Correspondence answered.\n\nG. H. Campbell\n\nGeneral Railroad and Steamship Ticket Agent.\n\n61 Main St. and C.P.R. Depot, Winnipeg, Man.\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, Sept. 9.\n\nMr. L. O. Houghton, the new wire farmer of Montana for harvest duties for the fall, has been appointed by Mr. R. B. Gordon, resigned.\n\nThe first At Home House under the new regime of Gordon & Co., will be held Tuesday next, 11th inst., when Miss Royal will be \"At Home\" from 4 to 6 p.m.\n\nA call for tenders for the new Mount Polley Mine was issued last week. Tenders received up to the 25th inst.\n\nPeople driving through rural districts may notice the absence of the usual signs on roadways warning of the dangers of driving at night or during the day. A prominent just came in from the Valley reporting a crop in one case of more than 30 bushels per acre. In addition to the harvest is necessary to cut the grass.\n\nThis morning the last rain which the country has seen was on the 17th inst. Since that date the most desirable weather has prevailed, clear and cool nights, and the crops are now in such a fine state that of bringing the entire crop to maturity, but also of giving the land a chance to rest. The harvest and no doubt enhanced opportunity of pushing their harvest operations and achieving in the rich production of our grain and hay.\n\nFrom the Leader, Sept. 11.\n\nMr. Macdonald, of the Mark Lewis Express, has returned from his trip to the north today. Mr. Macdonald and Mr. Macdonald have been engaged in the grain trade for many years, and they have always been known for their honesty and integrity. They have been very successful in their business and have built up a large customer base.\n\nOn Saturday night there was a joint meeting of the Board of Trade and Town Council to arrange a plan of action to receive the farmers of the coming harvest season. The Mayor and Mr. Macdonald telephoned this morning making arrangements.\n\nFORT MACLEOD.\n\nFrom the Gazette, Sept. 6.\n\nIt is probable that arrangements will be made shortly for a telephone exchange at Macleod.\n\nThe Indians were started out of town on the gallop by the police last week, as they had been heard to say that they would not pay against these miscreants who were expected every time a lodge is located near town.\n\nWhat might have proved a disastrous fire took place at the eastern extremity of the town on Monday last night, or rather about an hour's distance away. Frank Foster's hay stack, containing about ten or twelve tons, caught fire, and in a short time the whole was burned to the ground. A number of citizens turned out, and the police fire brigade with their hose were called upon to help, but all efforts to save the stable or stack were useless. If a high wind had been blowing toward the fire, ending one of the prevailing west winds, the results might have been most disastrous. The cause of the fire is unknown.\n\nCALGARY.\n\nFrom the Herald, Sept. 5.\n\nTalk about harvest weather! It is difficult to remember what cloudy weather looks like.\n\nDoesn't the dust shooting season appear to open too early? This year ducks will be \"hopping\" for some time yet, and a large number of these birds' ducklings are being shot, if report speaks truly.\n\nAn auspicious day in the history of Calgary and Alberta was the 31st day of August, 1883. Forming an epoch in the annals of the city, the erection of Fort Calgary, as the place was then called, will long be remembered by those who witnessed its rise. The first inhabitant of the City of Calgary was a man named Mr. Smith, who lived in a small house on the banks of the Bow River.\n\nFrom the Tribune, Sept. 6.\n\nThe First Presbyterian Church Society held its annual meeting Friday night at Sandy Wilson's house where the old officers were present. The meeting was a success and between twenty and thirty members attended.\n\nSheep Creek held their annual meeting to-night.\n\nOU'APPELLE.\n\nThere is a movement on foot in town to get a reading room and library established.\n\nThere was a heavy rain last night, but the sun is now shining again, so it is expected to do any harm to the grain crop. The farmers are now engaged in harvesting the dry land will do good to root and garden plots.\n\nThe work is being done under direction of Mr. Smith. The task is getting the wheat into the barns.\n\nHarvesting is nearly completed in this neighborhood, and the general report is that the harvest will be good.\n\nThe government has decided to acquire a couple of acres of land in the Regina district for a certain time every day, that the public may come and see the work being done.\n\nEDMONTON.\n\nFrom the Bulletin, Sept. 1.\n\nGrain was being cut at Lesser Slave Lake, Alta., Sept. 1st.\n\nButter sells at $25 cents to $35 cts. per pound and eggs at $30 cents to $40 cents per dozen.\n\nF. S. Smith, who has a crop of wheat that will be ready to cut next week when the harvest judge estimates will be made, has been reported as having a small band of buffalo near his place. He says that he has heard that hunters succeeded in killing one.\n\nHe sells all his goods in town and has a large stock of goods.\n\nR. C. WIGMORE & CO.\n\nAll parties indebted to R. C. Wigmore & Co. are requested to make an immediate settlement.\n\nInterest charged on all overdue accounts.\n\nR. C. WIGMORE & CO.\n\nONE MORE Great Clearing Sale.\n\nFOR THE Best Assorted Stock or CONFECTIONERY.\n\nGO TO H. M'Dougall's BAKERY.\n\nH. M'Dougall's BAKERY.\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.\n\nADVERTISERS Can learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Howell & Co., Newspapers, Books, Stationery, etc., 10 Spruce St., New York. Send 10c for 100-page Pamphlet.\n\nDonaldson & Pembroke, T.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888092101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 4533, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7348, 2], [7348, 12974, 3], [12974, 18554, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]