[{"id": "2a1e28fbabb0a7a47c056912dfd298695a0556fa", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m. His Lordship the Bishop.\n12 noon. His Lordship.\nThe Mission Chapel.\n11 a.m. Rev. A. H. Wright.\n12 noon. His Lordship.\nSt. Catharine's.\n12 noon. Rev. J. W. Macdonald, B.D.\nSt. Paul's.\n1 p.m. Rev. Canon Petch, B.D.\nSt. Andrew's.\n3 p.m. Rev. E. Matheson.\nSt. John's.\n4 p.m. Rev. J. W. Macdonald, B.D.\nSt. James'.\n6 p.m. Rev. Archdeacon MacVey, B.D.\nSt. Anne's R. Catholic.\n6.30 p.m. Rev. Peter Andre.\nSt. Paul's (Presbyterian).\n8.30 p.m. Rev. Mr. McWilliam.\n\nFRIDAY, MAY 14, 1886\n\nThe Duke of Connaught paid a private and unofficial visit to the Colonial Exhibition buildings at South Kensington. His Royal Highness spent a long time in the Canadian pavilion, which was intro-\nduced to the Hubbard collection of natural history specimens from Manitoba and the Northwest. It is a thousand pites that the Canadian exhibit will reach London in time for the opening of the exhibition. Her Majesty the Queen officially opened the exhibition.\n\nHon. Mr. Thompson has given notice of resolutions respecting the administration of justice in the Northwest. They provide for the repeal of the enactment respect-\ning stipendiary magistrates now in force, and for the establishment of a Superior Court of civil and crimi-\nnal jurisdiction, to consist of five judges, with a yearly salary of $1,000 each. It also contemplates a division of the territory into 15 judicial districts and a reduction of the each a sheriff and clerk of court, the sheriff's salary to be $500 and fees.\n\nAn order in council has been passed transferring the following tracts from Dominion control to that of the Government of Manitoba and the Northwest Territory: Saskatchewan Falls, Prince Albert to Carlton Forks to Batchewa; from St. Laurent to Duck Lake; from Ba-\ntoche to Gabriels and from Duck Lake to Gabriels.\n\nThe Kingston Area says: Mexico has just set an example that is worthy of emulation in the way of handing over to justice fugitives on\nmands without any mention in her petition. Mr. H. Scott charged with theft having forged paper to the extent of from $1,250 to $1,500 on the Merchant's Bank at Winnipeg was followed to Mexico. The Mexican authorities informed Scott that he would be taken back to Canada if he could prove that his mother would let him take him. He found him-\nself in a difficult position, although legal barriers were sought to be raised to prevent his re-\nmoval the Mexican authorities never-\ntheless took him over and placed him under the impression that no extra-\ndition arrangement exists between this country and Mexico. All the more honor to them then for not interfering to shelter a criminal.\n\nAnother attempt is being made to send a party to explore Hudson's Bay. It is not an exploration of the straits that is wanted this time, but a settle-\nment of the question as to whether or not there is a strait between the mainland through the great unex-\nplored peninsula between Hudson's and Ungava Bays. A glance at the map shows that this is very likely to be the case. Several large rivers empty their waters into Ungava Bay, the river Kowesh or South river being the largest; several large rivers also empty their waters into Hudson's Bay on its eastern border between the latitudes of 55° and 65°. There may possibly some connection between the two bays, but whether the ice which packs into Ungava Bay will allow of such a connection is another matter.\n\nAmerican capitalists have made arrangements to develop the mines in the neighborhood of Lake Winnipeg. They will take the ore to England. During the summer months, work is to be done, the finest canes can only be grown being only 25 cents a ton, while that on pig iron is six dollars a ton. It is expected that the company already employs two hundred men, and arrangements are being made to establish several im-\nportant manufacturing enterprises to supplement the blast furnaces. It is seen that with so much rail-\nway traffic that will be sent by the projected in the Canadian North-\nwest, the smelting works might be established in Manitoba near the mines instead of in Dakota. The Government should do something to encourage the establishment of smelting works in Canada. Iron is generally regarded as the backbone of a nation, and no country has a better supply than Canada. It is natural that Canada, if it does not want to be said for other Sierra Leone or Guinea, should make itself a home for the mining industry. The most skilled emigrants are interested in the following display. We have a wheat pipe apple tree from Alabam whose leaves are in-\ntended for making new fashionable dress-\ning gowns. Ragshingles from the mica plates strained by the longest rope from gold and diamonds to iron and coal from the coasts from the Hind-\nuks to the coldest cabin woods of the north, peat and turf of different charac-\nters will pour into the Kensington exhi-\nbition. Australia will send in her wood and meat, her sugar, oranges, apples, rice, copper, gold and op-\nals, tea, coffee, and wool. New Zealand will be much behind the other Australian colonies. South Africa will be the front with her diamonds though, after all the vast array of wines from Australia, U.S.A., South Africa, Ceylon, because there will still be little mitigation of the regret at the prospect of start-\ning singles from the vineyards of the old world to the China. Canada will display her maple leaf, her timber, her model farms and cattle ranches, her fish from cod to cod-\nfish.\n\nThe exhibition might be con-\nceived as only extensive length. Great Britain and her colonies to pre-\nsent all the earth can produce. A world's exhibition could not be more comprehensive or more varied. Such an aggregation is a noteworthy event from a national standpoint. It will bring the nations of the Brit-\nish Empire and of British tradition as tending to bind, more closely to-\ngether widely separated colonies pur-\nchasing interests even more widely divergent. It will be a grand land-\nmark point a gaining opportunity for extending trade by acquiring valu-\nable information as to the wants of the colonies represented. Amidst such a gathering Canada will make her name alone. Her resources will be clearly exposed into, and it is hoped that this northwestern por-\ntion of the Dominion will be placed in a favorable light. There is no part of the British Empire with greater prospects and deserving of greater attention.\n\nTHE COLONIAL EXHIBITION\n\nThe Manitoba Govt. May 3rd says: The Colonial Exhibition will have excited so much interest and been so well attended by the ladies of the City. It is officially opened by Her Majesty the Queen. There will be a wide field of competi-\ntion, and one third of the human race will contribute to the show. India is not a country but a collection of countries. Not are the colonies any easier to classi-\nfy. Canada, reaching as she does from the Atlantic to the Pacific, can fill up the whole space between the eastern stretch of the American conti-\nnent. The West Indies are not ho-\nmogeneous. But when we come to the mainland, we have colonies. Hundreds of thousands of Canadians and as many more from the Falkland Islands, from which to collect examples of the means by which our fellow-subjects prosper and grow rich. Australia is in itself a continent and contains the sugar planters of Queensland, the sheep breeders of the south coast, who offer almost any crop of any climate, whilst in New Zealand we have a region not unlike the Cape Colony. In the Cape-\ntown Xmas we find an almost perfect garden perhaps, but equally more striking, and though there is little to be said for either Sierra Leone or Guinea as homes for our own race, yet the climate and tempera-\nture in the most distant emigration are interested in the following display. We have a wheat pipe apple tree from Alabam whose leaves are in-\ntended for making new fashionable dress-\ning gowns. Ragshingles from the mica plates strained by the longest rope from gold and diamonds to iron and coal from the coasts from the Hind-\nuks to the coldest cabin woods of the north, peat and turf of different charac-\nters will pour into the Kensington exhi-\nbition. Australia will send in her wood and meat, her sugar, oranges, apples, rice, copper, gold and op-\nals, tea, coffee, and wool. New Zealand will be much behind the other Australian colonies. South Africa will be the front with her diamonds though, after all the vast array of wines from Australia, U.S.A., South Africa, Ceylon, because there will still be little mitigation of the regret at the prospect of start-\ning singles from the vineyards of the old world to the China. Canada will display her maple leaf, her timber, her model farms and cattle ranches, her fish from cod to cod-\nfish.\n\nThe exhibition might be con-\nceived as only extensive length. Great Britain and her colonies to pre-\nsent all the earth can produce. A world's exhibition could not be more comprehensive or more varied. Such an aggregation is a noteworthy event from a national standpoint. It will bring the nations of the Brit-\nish Empire and of British tradition as tending to bind, more closely to-\ngether widely separated colonies pur-\nchasing interests even more widely divergent. It will be a grand land-\nmark point a gaining opportunity for extending trade by acquiring valu-\nable information as to the wants of the colonies represented. Amidst such a gathering Canada will make her name alone. Her resources will be clearly exposed into, and it is hoped that this northwestern por-\ntion of the Dominion will be placed in a favorable light. There is no part of the British Empire with greater prospects and deserving of greater attention.\n\nTHE MEDICINE HAT LUMBER COY.\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n3RD ST., PRINCE ALBERT, SASK\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES\nFOR\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinens, etc.\n\nGO TO\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 17 feet extra.\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nNO LIGHT IN THE WINDOW.\n\nAs the train sped along in the night,\nWith drivers, passengers, as usual upon\nThe car, the conductor, who was often\nFrequently peering out of the window\nInto the darkness. The night was dark,\nAnd the moon was not visible, but there\nWas a short of snow over the landscape, in\nShape, and yet the conductor looked in\nWith his eyes open, and he held his\nHead in a way that made it seem, too, as\nIf he were looking out of the window pane.\n\nLooking through the window glass, he could\nSee the lights of the locomotive passing by,\nWith a certain brightness.\n\nThe conductor looked intently at them,\nAnd then he turned back to the window\nAgain, with a look of curiosity.\n\n\"Ah,\" he said, \"going to be married and\nPut the road, going to marry a farmer's\nDaughter. Worth much?\"\n\n\"Aye,\" replied the conductor.\n\nFurther remarks in a similar vein came\nFrom the passengers, but they continued\nTo look out of the window. Suddenly\nThe whistle of the locomotive gave a loud\nNoise, and the conductor seemed to react\nStill more intensely to what he had seen,\nFaster his gaze upon some object in the\nDistance, then fell back in his seat\nWith a cry of despair upon his lips.\n\nThe passengers gathered round to see\nWhat had happened, and the conductor\nRushed towards the window. Suddenly\nHe rushed back into the baggage car, and\nThe conductor seemed to react still\nMore intensely to what he had seen.\n\nSome weeks ago little girl has been ill\nNight after night she was not well, but\nThis morning she seemed to be recovering\nHer health. She was now able to walk\nAnd even run, and her parents were\nHappy to see her improve so quickly.\n\nINVESTING IN CANADA.\n\nLarge sale at Phil. Lee & Co., Montreal.\n\nCal. M. Jefries, of Lake Superior, who\nHas been engaged in lumbering for many\nYears, has just returned from an\nExhilarating business trip to Canada. While\nStaying there, he visited several towns\nAnd cities, including Toronto, Quebec,\nMontreal, and Ottawa. He was impressed\nBy the vast forests of Canada, which are\nRich in timber and other resources.\n\nHe also visited several lumber camps\nAnd saw firsthand the operations of\nTimber companies. He was struck by\nThe efficiency and organization of these\nCompanies, and he believes that Canada\nOffers excellent opportunities for investment\nIn the lumber industry.\n\nHe recommends that investors consider\nInvesting in Canadian lumber companies,\nWhich offer stable returns and potential\nGrowth. He also suggests that investors\nConsider purchasing shares in Canadian\nForestry companies, which are likely to\nBenefit from the increasing demand for\nTimber products.\n\nHe concludes by saying that Canada\nOffers a promising investment opportunity\nFor those interested in the lumber industry.\n\nWARNING.\n\nA LARGE STOCK OF THE LATEST STYLES\nOF FURNITURE!\n\nPRICES\n\n75 per cent. below any prices quoted by dealers here.\n\nFurther notice will be given on what day this sale opens.\nSale Room will be in central part of town.\n\nW. E. GOODFELLOW.\n\nHardware.\n\nPOST OFFICE BOOK STORE\n\nWall Paper\n\nLATEST PATTERNS\n\nE. J. CANN.\n\nTO THE LADIES.\n\nNEW GOODS\n\nAT\n\nMISS MAG & CO.\n\nFirst Door East Telephone Office.\n\nC. EDONIA BREWERY\n\nEAST END.\n\nThe proprietors of the above concern is\nPrepared to supply families and others with\nThe best quality of beer and ale at reasonable\nPrices.\n\nBilliards Table and Saloon\n\nFlor de Benitos\n\nCrema de la Crema\n\nBelle Cuba\n\nHenry Clays and Wagner\n\nALL CHOICE QUINOS AND SEASONED.\n\nCHAS. WOODMAN BETTS & Gwynne\n\nProprietor\n\nExamine Our Stock of Xmas Confectionery and Biscuits.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886051401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10184, 2], [10184, 10965, 3], [10965, 14490, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]