[{"id": "a1118a6e990836bf92f9def61d73fdcf1d812057", "text": "The fourth annual exhibition of the Lorne Agricultural Society was held here on Thursday in beautiful weather. The proceedings were of the most gratifying nature. The turn out of exhibitors and spectators was large, and we shall give a full description, with prize list, in next issue.\n\nA recent issue of the London Times has a letter from Mr. J. C. Hawkins, who says that the expression of what undoubtedly is the prevalent feeling in Canada with regard to commercial union with the United States. The gist of the matter is, that if the Dominion house barrier were abolished, Canadian manufactured articles would certainly be swamped by the surplus products of the States. It is a well-known fact that the accumulated wealth of years could be lavished in endeavoring by American political magnates in the task of underselling, at any cost and any sacrifice, the obstinate Canadian producers, for the purpose of eventually establishing their own supremacy and obtaining a monopoly of the Canadian market.\n\nThe Canadian Pacific company can congratulate itself upon the success which has attended its efforts to persuade the British Government to subsidize it for carrying the mails by the sea route. The time is drawing near when the line before the eyes of the world than anything that has yet occurred. It will be the means of inducing the tourists and travelers to take this route on their way to China and Japan, and thus the plain influence is felt that, as the British Government has put its endorsement on the line by subsidizing it to carry the mails, it must be the quickest route. Canada will have attracted attention to the front and attracting the notice of the countries at the other end of the earth. Some of these days the British Government will see the advantage of the route, not only for postal purposes, but for military transportation.\n\nWhat must be the mental condition of the man who has nothing to do? How does he put the day in, and to what does he look forward when he sees his wife and children in the sun shining in the morning? Most people have their business to look after, or their work to do in the factory or shop, but in every community there are some who have nothing to do, and find no manner to drag out an existence day after day and year after year. It must be hard work. An object in life justifies an existence. Those who have no object in life therefore not only fail to find their own existence justified by the community by continuing to exist. How would it be if some strange transformation of the conditions of existence were to be suddenly thrust aside, the conditions of primitive life were re-established and every man had to go out and shoot or fish or dig up roots with his hands in order to secure his daily existence? Surely those who would prefer people who go gathering through life would look rather foolish if left to their own devices. What will they then do when the next period after they leave this one. They will be forced to earn their food and will always be at their heels. It may be observed that those whose purpose in life is simply to kill time usually succeed in killing not only themselves but others also. If the worst turns a father can do for his boy is to give him a good trade or profession. One of the worst is to leave him a lot of money to do with as he pleases.\n\nThere seems to be more discussion over the appointment of Mr. Joseph Chamberlain as the British representative on the fisheries commission than there ever has been. Mr. Chamberlain is a man of marked ability and has for some years been looked upon as the most likely man in England to succeed Gladstone. He is clever enough to see which side is winning the battle and for ten years has quit the Gladstone ranks on the Irish question, seeing that the English people would never consent to let Ireland go. His instincts and prejudices are English and he would have been quite at home with Mr. Gladstone than in company with Lord Salisbury or even Lord Harrington. When they were colleagues in the same Cabinet Chamberlain used to say that he would rather serve under Lord Salisbury than Lord Harrington. He called him an anti-chamber politician and the Rip Van Winkle of British politics. He announced that the Radicals had been born in the hold long enough and that they ought to be allowed to work on the quarter deck whereas they spent all their time. Mr. Goschen he pleasantly referred to as an English mummy. Fancy if in Canada one member of the D. C. T. A. Board of Directors, to talk to criticizing his colleagues! People would never get over it. It is easy to see that Mr. Chamberlain is not altogether at his ease in his present position. He should not give the impression that his undoubted support in putting Ireland under the provisions of the Crimes Act, and it is clear that he still keeps in view Mr. Gladstone's minute. We shall see how he looks after British interests in the future affairs.\n\nSocialists have been pushing them selves into notice in New York by holding a meeting and shouting \"Down with the United States.\" There are in the United States about nine millions of people and a few more Socialists, and it is only fair to assume that the nine millions will be able to hold their own against the few score. In Chicago the Anarchists who were very convinced that socialism was really still awaiting the judgment of the higher court to which their case was appealed. That they will go to the gallows no one now believes. Had they been charged for murder or for sedition, the moral effect throughout the republic would have been great. Expressing one's opinions about property and the right of the people is one thing; murder is another. Such violent characters have responded to the invitation of the republic to leave the shores of foreign lands and come to the land where liberty prevails in its greatest extent that our cry should be up on the part of the law-abiding element to close the gates. The people who come bring their peculiar sentiments with them. They change their skin but their character remains the same. The Americans are an easy going people, but once they make up their minds to suppress a nuisance they do not let the grass grow under their feet. Some day they will awake and realize that to allow the Socialists and Anarchists, and for a time matters will be lively.\n\nMr. Wm. Tait is erecting a storehouse on Church-street.\n\nThe Rev. Archdeacon J. A. MacKay, Rev. A. H. Murray, Mr. Hardie and Mr. Maclean have returned from other business. They expect to return in a couple of weeks time.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Repose, Woolen Holland in Slate and Yellow, Door Matts, Curtain Cloths, Silk Corded Cloakings, Empire Cloths, Blanket and Garnet, Fine Croctones, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Breezy Veiling, Ladies' Silk Ties, Timsh, etc., etc.,\n\nALL AT LOW PRICES.\n\nSome large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds. Inspection is solicited.\n\nPRINCE ALBERT BREWERY!\n\nPure and Sparkling AMBER--(Hop)--ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERROD\n\nRUSSELL WHOLESALE & RETAIL Butchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS.\n\nBROWN'S BRICK STORE.\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, Sept. 13.\n\nA dangerous insane man named John Ruprecht was brought into Regina last week from Touchwood Hills.\n\nThe Board of Education met last week. There was a partial attendance. The draft of a new Ordinance was submitted and adopted.\n\nThe largest and most continuous rain of the season fell on Sunday night. It rained throughout the night and Monday and was accompanied by a very high wind.\n\nThe lecture on \"True and False Ideals of Education,\" recently so faithfully delivered here by Mr. F. A. Davis, has been published in the Winnipeg North-West Review.\n\nThe value of goods imported through the Canadian Pacific Railway for August was $2,832, and the amount of duties $692. The amount entered as free was $4,572.\n\nMr. Davies, M. P., is in a private letter informed that he will be able to make his appearance at the next session of Parliament.\n\nMr. Hamilton received a telegram yesterday from Mr. B. S. Smith, informing him that the arrangements for extraditing the prisoners held in Montana, for the murder of Mr. Smith's son, have been completed, and that he had left for home. As soon as the necessary papers are returned from Washington the prisoners will be brought back.\n\nFORMULED.\n\nFrom the Gazette, Sept. 13.\n\nThe Rev. Chancellor Foster of Maple Creek is now on a visit to his friend Mr. Redpath. Both of these gentlemen are members of the Church of England and the Methodist Parsonage. They left for Prince Creek last Saturday where they were engaged in visiting the Rev. Mr. Redpath among his flock of several times. Missourian circumstances is one of the reasons prompting Mr. Foster to go there. He is expected to arrive at Maple Creek on Wednesday and at Fischer Creek on Sunday.\n\nNews was received on Saturday that a white man had been killed near the vicinity of Lees Creek, and that the Indians were not expected to live. Inspector Smith was immediately sent out, but found there was no truth in the report, which was started by the Indian himself.\n\nFrom the Athabasca, Sept. 13.\n\nThe Historical Society has received several additions to its library lately. Among these may be mentioned the latest volume of the Transactions of the Royal Society of Canada, Vol. IV, obtained through the kindness of Mr. W. J. T. Smith, Secretary of the National Historical Society of Glasgow, Scotland, and several reports of the Friendly Museum, Cambridge, Mass.\n\nLETHBRIDGE.\n\nFrom the News Sept. 14.\n\nThe N. W. M. C. & N. Co. are now preparing and about to issue their last copy of the Lethbridge Times. It will be opened for public sale tomorrow morning, when, after being transferred to the hands of Mr. H. E. Smith, it will be handed over to the Lethbridge Chamber of Commerce at the close of the morning session.\n\nThis number of the newspaper of the Federation movement was a special edition, and was printed at Mr. Cox's. The total cost of printing was $4,400. The number is to be a leader, bearing with mannered roof and is to be situated east of the N. W. M. Police barracks.\n\nMr. C. A. Margrath paid a visit to the Mormon settlement on Lee's Creek last week and reported that he had heard much praise of the settlement over there, and says they have made more progress than any other settlers have done there this year.\n\nAt 12:30 on Monday last the steamer of firewood was loaded. It was seen that one of the large hay stacks being put in for the N. W. M. police was also loaded. A man was seen carrying a couple of logs from the kitchen of the constables' quarters, and they immediately started off to see the cause, but so quick did the steamer get away that before they got to the canal the whole stack was a sheet of flame. As nothing could be done to save it, the attention of the men was directed on another and much larger stack, and by the application of water it was saved. The steamer will be charged $80 or $90. About one third of the canal around the hay was also burned.\n\nBATTLEFORD.\n\nFrom the Herald September 10.\n\nWar Department proposes to erect a large building to be used as a public hall.\n\nInspector Brooks and Sergt. Woodall went on Wednesday's stage on route for Regina.\n\nLt. W. F. Fleet, D. D. G. M., will visit Battle Lodge A. F. A. A. M., on Monday evening.\n\nP. F. Williams, Indian Agent, arrived here a week ago and at once assumed the duties of his office.\n\nA large number of cows and milk cattle recently sent from Saskatchewan last week was sold to David Cooper for five dollars. The cows are all tame and four are milking.\n\nThe contracts for supplying beef to the Mounted Police and the Indian Department in this district have been let. The Mounted Police will pay $9 and the Indian Department $10.35 per 100 pounds.\n\nQuite a large number of our citizens attended the Roman Catholic Church on Thursday afternoon to witness the marriage ceremony of Mr. W. J. Barker and Miss Gertrude Dunnington, and extend their congratulations to them.\n\nEDMONTON.\n\nFrom the Bulletin, Sept. 3.\n\nWm. Anderson, Indian Agent, has been most entirely recovered from his recent serious illness.\n\nW. C. Carter has arranged the contract for the sale of oats required at Edmonton and Ft. Macleod.\n\nF. Lumsden, lawyer for Battisford, has a large calf of hounds and a good horse for the school.\n\nThe self binder in J. Walter's field on Wednesday cut up and bound two pigs, which formed part of the crop for this year.\n\nAn egg hatchery was bought by a local farmer.\n\nIt was reported to Mrs. Thomas Anderson that a cow was stolen from her yard, and was spotted by a cow and a bull.\n\nSept. Grindrod left for Red Deer, where he expects to purchase three to lay and a large polo steer.\n\nA police detachment went north on Tuesday to arrest one Robert Charles, who is wanted for killing a man at Big Lake, who is accused of killing an old Indian woman who had become insane during the spring at Fort Macleod.\n\nOil prospectors have hit a strike still for the past week or two owing partly to a leak in the drill and partly to their haven. Before quitting a depth of sixty feet had been reached with evident indications, the remaining oil is supposed to be at least 200 feet.\n\nLethbridge Times\n\n$2 50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY.\n\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWe wish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do.,\n\n\" Over 1/2 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nGENERAL NEWS\n\nOttawa, Sept. 17.—In reference to the Believing sea stories of last season, it is alleged here that a branch of faith has been opened in the presence of the American authorities at Sitka, where it is said that Secretary Bayard, on receipt of the news from Sitka, stating the grounds on which the American flag had been raised, at once telegraphed ordering the restoration of the vessel and asked Mr. Bayard to immediately form the British Minister at Washington of his having done so. The message was sent by Mr. Bayard and his successor to carry out the instructions but before the latter arrived, the former had been arrested and the telegram might not be authentic. He denies having received any further instructions from Washington and refuses to act on Mr. Bayard's telegram. It is understood that this matter will be referred to the Privy Council by the Minister of Fisheries.\n\nPrince, N.W.T., Sept. 16.—Mr. Gold Spring Ross arrived here yesterday morning from Washington on a visit to his brother, who owns a farm four miles from here. Mr. Ross had been in Washington only two days when he landed, he accidently shot a neighbor called Mr. Lovell the ball passing through his body. There are very little hopes of his recovery.\n\nToronto, Sept. 17.—It is stated that Mr. John Macdonald, who resides in this city, is in connection with the appointment of a superior court judge. The names of Mr. F. Macdonald, of Toronto, and Mr. P. Murray, of this city, are mentioned in this connection.\n\nMontreal, Sept. 18.—The Lacrosse championship match yesterday between Ontario and Quebec was witnessed by a magnificent exhibition of the game and resulted in a victory for the former by three goals to two. Over 5,000 people witnessed the game.\n\nKingston, Sept. 18.—Yesterday morning an order was received from Ottawa that the battery of heavy guns from \"C\" battery to be sent to New Brunswick to form part of \"C\" battery. A similar number will be taken from \"B\" battery at Quebec.\n\nOntario, Sept. 18.—The Government have been requested to call the attention of Canadian manufacturers to the splendid opportunity of displaying their goods at the Exposition Universelle at Brussels.\n\nRichmond, Que., Sept. 18.—The Hon. Mr. Alexander, M.P., and Lady Alexander visited the town today and were most enthusiastically received.\n\nMontreal, Sept. 17.—Canadian Pacific Railway Company announced yesterday that the week ending Sept. 14th, $240,000; same week last year, $219,000.\n\nOttawa, Sept. 18.—Advisers to the Fisheries department state that Canadian fishermen have had very good catches this year.\n\nLondon, Sept. 18.—Dillon, in an interview with a United States Press correspondent, today, declared it was impossible to deny the growth of agitation against the fisheries in Ireland. The district most disturbed was that of south Galway. The new agent of estates there was shortly after appointed, and was assured that trouble would result. Dillon expected that the leaders of the national movement would be able to control the situation. He would not be surprised if within a month or two the majority of them, including himself, were providing them.\n\nDublin, Sept. 18.—Archbishop Walsh has written a letter in which he says that the Irish people at the moment being led to adopt a more militant attitude on the question of a conference with their tenants, he learns the opportunity to effect settlement may now be lost.\n\nParis, Sept. 18.—In a duel to-day Maurice Bertrand, son of Sir Samuel Bertrand, was killed. A journalist named Albert, who had written an article reflecting upon the famous actor.\n\nWashington, D.C., Sept. 17.—The friends of the condemned anarchists held a meeting yesterday to consider what they may do to prevent the execution of the sentence by the Supreme Court of the United States.\n\nSan Francisco, Cal., Sept. 17.—The schooner Flor de Lis, arrived from the South Seas today. The captain reports that the vessel was bound for the garrison on Panay, the largest island of the Caroline group and takes formal and personal leave of the group.\n\nJersey City, N.J., Sept. 17.—Mrs. Ford, who claims that she lost her three children and $17,000 of her own money, arrived here yesterday and refused all food with the intention of starving herself to death, and will give no further information.\n\nDetroit, Mich., Sept. 17.—The town of Ironwood, in the copper range, is now in a state of siege, and the citizens of the town are at the mercy of the flames.\n\nNottingham, N.Y., Sept. 17.—Joseph Thomas, an old soldier of the United States army, a veteran of the war of 1812, died yesterday, aged 96.\n\nIMPOSING CEREMONY.\n\nThe Consecration of St. Boniface Cathedral.\n\nAfter long and arduous missionary efforts extending considerably over half a century, the present church of Roman Catholicism in Manitoba was consecrated for its high purpose on Sunday afternoon. Archbishop Père of Montreal officiated at the ceremony, which was the most impressive in the history of the diocese. All the ceremonies were conducted in accordance with the ancient Roman rite. Every precaution had been made for the event and the interior of the cathedral was beautifully decorated. The design never presented a more attractive appearance, while the solemn rise of the towers seemed to give the church an impressive air to the whole scene. The significance of the occasion was emphasized, not only by the presence of St. Boniface, but by the appearance of the church for miles around, large numbers of whom came to witness the consecration ceremony towards the cathedral. The weather was simply perfect and a more glorious day could hardly have been wished for. As part of the ceremony was to take place outside the cathedral, walls had been erected around the church so that by half past seven the space around the church was densely crowded. In the evening the occasion was celebrated in style, and the appearance of flags and pennants could be seen at various distances unfurled to the breeze.\n\nTHE WEST ON THE RAILROAD QUESTION.\n\nWhile out at Deloraine recently His Excellency Hamilton had a short drive with Mr. Alexander, M.P., and in the course of a couple of hours they saw what they feared would be the result of the construction of the Red River railway. They thought that the result was probably, judging from present appearances, they might be led to benefit by the construction of the railway. The honour of the construction to a man. An examination along the line where he touched, Mr. Hamilton expressed many expressions of satisfaction. Referring to the statement Mr. Hamilton said: \"As soon as we can get the proper railway lines, we will take up the question of western railroad connection. It is the subject of our policy to give railway facilities to the west, and we shall see how it goes. Being asked about the probability of raising the necessary funds by the sale of provincial bonds, he said: \"While work was held by a large number of people, they were prepared to take the trouble of buying the bonds to put them on the market. A leading merchant said he would give two cents of his time to dispose of those bonds, and he was satisfied he could place a great many thousand in the hands of the public. General feeling was that it would be better to place them abroad if possible.\"\n\nMrs. J. F. Reita was the Hon. L. O'Brien's special first prize for best solo exhibition. Mrs. Thos. Swanston for fancy table cover.\n\nMr. Gingras, of Winnipeg, who is just up from Montreal where he attended school, returned home yesterday. Last year, he was away from home, arrived by mail stage on his way to Oshawa lake in the spring.\n\nMr. McKee of Cape Breton, who has been here since last fall on a visit to his friend, left by mail stage on Wednesday for home. The young man returned with him that he might once more meet his eyes upon his old home and receive the glad welcome of relatives and friends.\n\nESTABLISHED 1879.\n\nUPRIGHT AND BOX Heating Stoves Heating Drums\n\nAmerican Coal Oil\n\nJ. R. McPhail.\n\n1879.\n\nBuffalo Hall!\n\nAGAIN ON THE LEAD\n\nWe have now open and ready for inspection a large bulk of our FALL AND WINTER Dry Goods, Clothing and Men's Furnishings\n\nRecently purchased in the east. The balance of our stock will arrive in a few days.\n\nWe claim to show the largest, most complete assortment, and by long odds the best value in Men's Underclothing ever offered in Prince Albert. We have now on the road something choice in LADIES BLACK AND GOLD JERSEYS BETTS & Gwynne.\n\nCLEARING SALE!\n\nNuns' Veiling, Merino, Ginghams, Wincies, Boys' Jersey Suits,\n\nThe above will be sold at a close margin on cost.\n\nPillow Cotton and Twilled Sheeting.\n\nR. C. Wigmore & Co.'s.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating\n\nWORSTEDS,\n\nIN ENGLISH AND AMERICAN LINEN.\n\nCANADIAN TWEEDES\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887093001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5414, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7534, 2], [7534, 14526, 3], [14526, 23493, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]