[{"id": "ad97dd7ea313293e4cb8b7a12a6257fa1272978a", "text": "WANTED.\n\nFor the Prince Albert Post Office.\n\nA Secy-Treasurer\n\nFor the School Board.\n\nAndres, stating salary expected, to\n\nJOHN STEWART.\n\nWANTED.\n\nWanted, for the Prince Albert Post Office.\n\nAn Assessor\n\nFor the School Board.\n\nAddison, stating salary required, to\n\nJOHN STEWART.\n\nEncourage Home Manufacture.\n\nWASHINGTON MACHINES\n\nMADE TO ORDER.\n\nPrice $10. Give Them a Trial.\n\nBells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co., will be promptly attended to.\n\nNATHANIEL ACORN\n\nPRINCE ALBERT.\n\nPUBLIC NOTICE.\n\nPublic Notice is hereby given that the Secretary of the North West Territories has appointed Mr. Nathan Acorn as Assessor for the School Board.\n\nThe new policy act is to be enforced.\n\nThe Territorial system of land tenure will be introduced in the North West.\n\nLiberal grants of land are to be given to those who build houses in the North West.\n\nMay I mention, Mr. McNaughton, is to be elected President of Manitoba.\n\nThe evidence is strong against the North West Territories.\n\nThe Crown Government is to change the charge to high taxation.\n\nThe Canadian government are at Canada very way loose.\n\nTheir services are being further required.\n\nGen. Stewart is recovering from his wound.\n\nGen. Earl has had some heavy fighting on the Iron Ore coast, but was very successful.\n\nThe French have been victorious in a late engagement in China, carrying away a large number of prisoners.\n\nA new political alliance between France and United States is anticipated.\n\nCURLANDIA.\n\nOn Tuesday last a match was played between Curlandia and Prince Albert, the result of the day's play being a victory for the Curlandia team by eight shots.\n\nNo. 1 Rink.\n\nNo. 2 Rink.\n\nNo. 3 Rink.\n\nNo. 4 Rink.\n\nNo. 5 Rink.\n\nNo. 6 Rink.\n\nNo. 7 Rink.\n\nNo. 8 Rink.\n\nTHE SCHOOL BOARD.\n\nThe first meeting of the Prince Albert Public School Board took place on Monday, February 2nd, all the members being present.\n\nThe first business done was to elect a secretary for the Board.\n\nIt was moved by Mr. Macdonald, seconded by Mr. Macdonald, that the Board be instructed to advertise in the newspapers for a secretary.\n\nMoved by Mr. Macdonald, seconded by Mr. Macdonald, that the Board be instructed to advertise in the newspapers for a teacher.\n\nConsiderable discussion ensued as to the advisability of engaging a secretary to conduct the school. Mr. Macdonald stated that he had heard that much work should be done by members of the Board. This was answered, however, that the secretary instructed to advertise.\n\nThe secretary was instructed to apply for a teacher, and a half dozen copies of the North West ordinances.\n\nThe Board will place themselves in communication with the trustees of the Methodist Church in order to secure the use of their building as a schoolhouse.\n\nThe Board then adjourned till Feb. 15th.\n\nWeather.\n\n(There are no weather observations and none thermometer readings taken in connection with the Dominion Signal Service.)\n\nTemperature, January 1st, 1905:\n\nSunday. 1st 22° 28°\nMonday. 2nd 28° 30°\nTuesday. 3rd 30° 35°\nWednesday. 4th 35° 40°\n\nTemperatures below zero.\nFRIDAY, FEBRUARY 6, 1885.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nTERMS.—Eight pages at six cents per number; in no case will publication be suspended until payment is made.\n\nNo advertisement inserted for less than twenty-five cents, unless instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's,\n11 a.m., The Rev. Principal Priest.\n7 p.m., Rev. A. H. Wright.\n\nThe Mission Chapel,\n11 a.m., Rev. Mr. Macdonald, Chaplain of St. Mary's Church.\n3 p.m., Liturgy service and morning School.\n7 p.m., Rev. A. H. Wright.\n\nSt. John's,\n10 a.m., Rev. Mr. Macdonald.\n12 noon, Rev. Mr. Macdonald.\n\nSt. Patrick's,\n11 a.m., Rev. Canon Potts.\n\nSt. Andrew's,\n10:30 a.m., Rev. Mr. Macdonald.\n\nSt. John's,\n3 p.m., Mr. R. Hilton.\n\nSt. James',\n11 a.m., Mr. Macdonald.\n7 p.m., Mr. R. Hilton.\n\nNegropinon,\nRev. F. P. Sheard.\n\nSt. Anne's, R. Catholic,\n12 noon, Mr. Macdonald.\n7 p.m., Rev. P. Sheard.\n\nMt. Pleasant Presbyterian,\n11 a.m., Mr. Macdonald.\n7 p.m., Mr. Macdonald.\n\nC. Methodist Church, Gouzen,\np.m., Mr. Calhoun Parker.\n\nC. Methodist Church, Mission,\np.m., Mr. Calhoun Parker.\n\nFRIDAY, FEBRUARY 6, 1885.\n\nHUDSON'S BAY ROUTE.\n\nIt is much to be regretted that the press and people of the North-West are not more attentive to the subject of the Hudson's Bay route, which is more prominently to the front than they appear to do. It may certainly seem to us in the Territories that it is a matter of some importance at this juncture, and in the interests of its inhabitants Manitoba cannot secure what is so much to be desired with regard to this, it is useless for us to interfere, and that we had better devote ourselves to getting such returns as may accrue to us more immediately within our reach. It should none the less be remembered that the mightiest rivers are formed and fed by little rills, and however remote the advantages possessed by each may seem to him or herself should be used. A large proportion of the inhabitants of these Territories consists of people who have been and still are engaged in eastern provinces, with whom they correspond, and who must take a lively interest in their welfare, and there can be no doubt but that the opportunity offered by the advantages of the Hudson's Bay route among the people of the eastern provinces generally might be materially enhanced by a judicious use of private correspondence. That there exists a strong necessity for the establishment of public opinion in this end in this regard is unfortunately only too evident, although it is not so easy to see how this end may be accomplished.\n\nIn the present state of matters, it behooves the whole Dominion to secure the prosperity of the Territories, for undoubtedly the people in the eastern provinces have got the idea very firmly fixed in their minds that so long as the Hudson's Bay route remains open, the advantage of the route will be enjoyed by the eastern provinces, and that the people of the Territories will be left behind.\n\nToronto merchants say the published crop reports of the North-West are either misleading or their customers in that section are not truthful, if the harvest was so good then there would be reason why money should not be more plentiful and old accounts wiped out. It might surely occur to them that an abundant harvest does not necessarily mean an over-supply of cash. It is said that the farmers are in want of proper facilities for sending it to market—the profits go in cost of transportation—therefore it is not fair to blame the farmers for not making the most of their crops. The Hudson Bay route opened and they will soon handle a good deal more of our cash.\n\nMr. Clark's Vegetable Sugar—Casted and Billets Livery. For handsome, strong, healthy, clean, and salable, 25 cents per box.\n\nIrking Pile—Soap and saddle. The symptoms are moisture, like perspiration, and inflammation, itching, increased sensitiveness, very disagreeable at night; also, as if pinworms were crawling in and about the rectum, the patient is restless and anxious. If allowed to continue, very serious results may follow.\n\nSWAYNE'S OINTMENT—For all skin eruptions, eczema, itch, Tetter, Heat, Salt Eruption, Scalp Head, Ringworm, Rashes, etc., Blisters, all easily applied. Swayne's Patent, 25 cents per box.\n\nJAMES SINCLAIR\nMerchant Tailor.\n\nGENTS' FURNISHINGS\n\nCHESTER THOMPSON\nGeneral Blacksmith.\n\nRepairing Factory Machinery a Specialty.\n\nJAMES SINCLAIR\nMerchant Tailor.\n\nGENTS' FURNISHINGS\n\nC. D. NORTHROPES,\nWatchmaker and Jeweller.\n\nA LARGE STOCK OF Watches, Clocks and Jewellery.\n\nKEPT CONSTANTLY ON HAND.\n\nPublic Notice.\n\nNotice is hereby given by the undersigned that all persons are hereby warned not to enter upon or take possession of any part of the premises herein described.\n\nPROOF-MONEY—Dated Oct. 24th, 1884 for $100.00 Jan. 1st, 1885, the cheques made by the undersigned, payable to the order of Mr. J. Montgomery, at Prince Albert, Saskatchewan. A certain cheque dated Oct. 24th, 1884 for $100.00 Jan. 1st, 1885, the cheques made by the undersigned, payable to the order of Mr. J. Montgomery, at Prince Albert, Saskatchewan.\n\nPRICES TO SUIT THE TIMES\n\nJ. M. CAMPBELL\nNEW GOODS.\n\nMEDICAL HALL.\n\nBURDOCK BLOOD BITTERS,\nBurdock Healing Ointment,\nBurdock Pills,\nBurdock Hypophosphites.\n\nTHERE'S A BUCHA AND USEFUL PREPARATION FOR WOMEN.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nKEEP PROMPTLY ATTENDED TO.\n\nGREEN APPLES\n\nAT\nMARKLEY & CO'S\nTHOS. POWERS,\nCONTRACTS.\n\nfor\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nPRICES TO SUIT THE TIMES\n\nJ. M. CAMPBELL\nNEW GOODS.\n\nMEDICAL HALL.\n\nBURDOCK BLOOD BITTERS,\nBurdock Healing Ointment,\nBurdock Pills,\nBurdock Hypophosphites.\n\nTHERE'S A BUCHA AND USEFUL PREPARATION FOR WOMEN.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nKEEP PROMPTLY ATTENDED TO.\n\nGREEN APPLES\n\nAT\nMARKLEY & CO'S\nTHOS. POWERS,\nCONTRACTS.\n\nfor\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nPRICES TO SUIT THE TIMES\n\nJ. M. CAMPBELL\nNEW GOODS.\n\nMEDICAL HALL.\n\nBURDOCK BLOOD BITTERS,\nBurdock Healing Ointment,\nBurdock Pills,\nBurdock Hypophosphites.\n\nTHERE'S A BUCHA AND USEFUL PREPARATION FOR WOMEN.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nKEEP PROMPTLY ATTENDED TO.\nTHE DYNAMITERS.\n\nLondon, Jan. 26.—The excitement over the dynamite outrage has remained unabated today, and every move and development is eagerly watched by the public. The authorities are vigilantly guarding against the possibility of further attacks, as well as striving to find out the author of Saturday's work. The letters recently received, disclosing the dynamiters' plans, tended to incite them to greater efforts.\n\nWestminster Hall and the Tower were closed today to everyone except those officially interested in inspecting the buildings. The approaches to all public buildings are rigidly guarded, and nobody is allowed to enter without submitting to the closest scrutiny. The Tower and Parliament houses were surrounded by sentries. Immense crowds of people visit the vicinity of the ruins daily. Visitors are forbidden admission to Windsor Castle.\n\nTHE DYNAMITER SUSPECT.\n\nInterest was greatly centred today in the prisoner Cunningham, who was arrested at the Tower on the day of the explosion. The prisoner was conveyed to Bow Street Station by a strong guard of police, suspected of complicity in the explosion at the Tower of London. He is 16 years of age, of medium height, dark hair and eyes, short stature, and sinister expression. He willingly answered the questions put to him, which he answered within sight to a glimpse of the alleged dynamiter. The prisoner gave his full name as James Gilbert Cunningham, and asserted that he was an Englishman.\n\nInspector Hubberley deposed that he examined the prisoner at the tower; that he (the prisoner) was confined and gave contradictory answers to his questions. The prisoner, the inspector said, had given a wrong address as the place of his abode, and then stated he lived in Scarborough street, Whitechapel, worked on the docks at Liverpool until the beginning of last year, when he came to London to try to better himself. He formerly resided in America. The inspector further stated that the prisoner was known at his lodgings as Dalton. His luggage had been searched, but the contents had not been made known to the public.\n\nThe examination of Cunningham tended to convince the police that they had secured a person who had a guilty knowledge of Saturday's crime. It was stated that Cunningham was a native of Cork, that he lived for five years in the United States, arriving in England during last autumn. He was described as an Irishman who was well carried out, until the close examination in court, when he forgot himself and threw off his slow, stammering manner. Cunningham is the only suspect now in jail.\n\nTHE INFERNAL MACHINES.\n\nIt is known that the infernal machines used to cause the disaster were fired by sulphuric acid, which worked through the fuse and exploded the cap beneath. The police occupy twenty minutes time to allow the conspirators to escape before the explosion took place.\n\nCUNNINGHAM'S REVELATIONS.\n\nIt is reported that Cunningham has made important revelations, in consequence of which all trains leaving London for the western towns are accompanied by detectives.\n\nDAVITT'S OPINIONS.\n\nMichael Davitt interviewed today about the London outrage, said the dynamite operations had spread throughout Ireland, and fewer in America than was generally supposed. He said he believed the recent outrages in Ross were not actuated by nationalistic or blood-thirsty motives. He said he thought the dynamiters would be more dangerous in the near future. In conclusion, he said the best way to combat the dynamiters was by showing them that the manipulating of Irish grievances in Britain would be futile. He said that the Irish should continue to use King's only expression of goodwill to wards Ireland.\n\nEMMANUEL COLLEGE\n\nPRINCIPAL:\n\nThe Rev. W. R. FLETT, B.A.,\nCantab., Late Foundation Scholar of Sydney College, England.\n\nTHE NEXT TERM BEGINS ON\n\nMonday, January 12th.\n\nBesides the ordinary subjects read at a Public School, each pupil is taught the Elements of Scientific Agriculture.\n\nA Laboratory is provided, where the Principles of Elementary Qualitative and Quantitative Chemical Analysis are taught.\n\nSpecial Evening Lectures to Students Reading for the Matriculation Examination of the University of Saskatchewan.\n\nFor further particulars apply to the\n\nREV. THE PRINCIPAL,\nEmmanuel College, Prince Albert, Sask.\n\nBuffalo Hall!\n\nStill continues to be a source of annoyance to general businessmen.\n\nFRESH GOODS THIS WEEK:\n\nTeas, Tobaccos, Sugars, Oatmeal, Canned Goods,\n\nOur prices for the past three months have given the greatest satisfaction. It is our intention to clear out the bulk of our stock remaining at still greater reductions.\n\nThe public will do a wise thing if they examine fully our lines in Dry Goods, Clothing, Mitts, Moccasins, Fare, Groceries and Provisions before purchasing.\n\nThe largest stock of Ready Made Clothing.\n\nThe largest stock of Pure Mills and Macaroni.\n\nThe largest stock of Groceries and Provisions.\n\nAnd the largest reductions from old time prices will be found at Buffalo Hall.\n\nNOTICE.\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nATHLETIC RECORDS.\n\nRunning, long jump—In America, C. H. Biggs, with weight, 25½ yds.; in Ireland, P. Davis, without weight, 23½ yds.; in England, J. G. Smith, 23½ yds.; in America, E. W. Johnson, 21 feet 6 inches; at Guelph, Ont., J. S. Murray, New York, 22 feet 8 inches; Standing, long jump—With weights, in America, G. W. Hamilton, Toronto, Mich., 5½ inches; at East St. Louis, Ill., 12 feet 6 inches; in England, J. Graveson, 13½ yds.; with no weight, in America, W. F. Ross, St. Louis, Mo., 14 feet 9 inches; Standing, high jump—P. Davis, Dublin, Ireland, 6½ ft.; M. Brooks, London, Eng., 6 ft.; E. W. Johnston, Belfast, 6 ft.; and John West, Brockton, Mass., 6 ft.; Standing, high jump—E. W. Johnston, Baltimore, Md.; J. Andrews, Halifax, N.S.; A. T. Andrews, and E. Moore, Portland, Maine, Eng., 6 ft.; Standing, hop-step-and-jump—Thos. Barrows, Boston, Mass., 46½ yds.; John Blair, Harrisburg, Pa., 48½ yds.; R. Knox, London, Eng., 47½ yds.; Standing, hop-step-and-jump—with weights, D. Anderson, London, England, 50½ yds.; J. Andrews, Halifax, N.S., 50½ yds.; Standing, 2 hops and jump—D. Anderson, Manchester, Eng., 30½ yds.; Standing, Middle distance—G. H. Hendrickson, Princeton, New Jersey, 81½ yds.; Three, standing jumps—with weights, G. Hamilton, St. Albans, Eng., 30½ yds.; W. S. Lawes, San Francisco, Calif., 30½ yds.; Standing, pole vault—J. H. Baxter, New York, 10½ ft.; Standing, 2 hops and jump—D. Anderson, Manchester, Eng., 30½ yds.; Standing, Middle distance—G. H. Hendrickson, Princeton, New Jersey, 81½ yds.; 100 yards—J. D. Armstrong, Montreal, 10¼ sec.; 220 yds.—J. Moffat, Montreal, 27½ sec.; 400 yards—J. D. Armstrong, Montreal, 51¾ sec.; 880 yards—J. Moffat, Montreal, 1 min. 9½ sec.; 1 mile—J. F. Scholz, Toronto, Ont., 4 min. 33 sec.; 2 miles—Kempner (Indian), Montreal, 11½ min.\n\nCANADIAN.\n\nOttawa, Jan. 26.—Mr. Davies, Post Office Inspector, who was in Chicago in connection with the arrest of A. R. Campbell, the Canadian man robber, has left that city. He has not given any such information from Stewart as may yet implicate others in respect to the crime.\n\nLt. Colonel Trutch, the Dominion Government agent for British Columbia, arrived here yesterday afternoon.\n\nThe liquor men of Stewart, Dundas and Glengarry will enter a new action to test, in the Supreme Court, the capital punishment law.\n\nMontreal, Jan. 26.—A suspicious looking box was found in the post office building but was opened by the police. It was at once removed to the police station. The box weighed three pounds, and contained a quantity of dynamite. Experts have been called for examination.\n\nSpecial prayers were offered yesterday in several of the city churches for the safety of the British soldiers in the South.\n\nThe Boulevard to St. Hubert's Island and the Condominiums, the latter covered entirely with sugar maple, is now finished. Several leading members of the Ice Carnival Committee drove across the Boulevard yesterday afternoon.\n\nThe majority of those enjoying the drive were American visitors.\n\nA very interesting and valuable arrangement has been arrived at between the North Shore and Canadian Pacific railroads.\n\nDr. Enock, a physician of high standing, will appear Monday for the benefit of the sick.\n\nToronto, Jan. 26.—The graduates of Trinity University met tonight to decide upon the proper course of action to take.\n\nThe house of Mr. Smith was in the most excellent, but it was decided to engage the services of Mr. Smith.\n\nThe right of way has been taken and has been placed upon the endowment fund.\n\nMISS MACKAY CO.,\nCARRIAGE HOUSE.\n\nESTRAY HORSE.\n\nUnder and by virtue of ordinance No. 9 of 1883 of the North-West Territories, it is notified that a Rockingham pony, the property of Mr. Smith, has been stolen. The horse is described as being 14 hands shoulder, black mane and tail, in an excellent condition.\n\nThe right of way has been taken and has been placed upon the endowment fund.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nSTEWART DRY LUMBER.\n\nBROS., TRADERS,\n\nGENERAL MERCHANTS,\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nCARD\n\nOn and after Thursday I will cut down all water gas 50 per cent, for cash, as all other prices are already reduced to their lowest points.\n\nMen's Arctic Overalls, $2 25.\nChildren's Overalls, $1 50.\nLadies' Overalls, $1 50.\nHome made Shirts, 50c.\nHome made Slacks, 50c.\nHome made Gloves, 60c.\nMufflers, Cloaks, Kid Mitts, Caps, Macintoshes and Baskets must go.\n\nFancy, every pair, 45c.\nEnglish, heavy, pair, 80c.\n\nThis is the chance. All first class goods.\n\nFull lines in Groceries.\n\nFish, Fish, Pork, Lard, Tobacco, Oats, etc., always on hand at regular prices.\n\nT. O. DAVIS\n\nNEW MILLINERY\n\nFANCY GOODS.\n\nWOOL GOODS.\n\nLADIES' CLOAKS.\n\nFUR MUFFS.\n\nCAPS.\n\nMISS MACKAY CO.,\nCARRIAGE HOUSE.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885020601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 5414, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3082, 1], [3082, 9387, 2], [9387, 14864, 3], [14864, 20573, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]