[{"id": "279a648786a99a6584f3fbaa44551c0ed04c264a", "text": "NEW YEARS.\n\nThe closing hours of the old year are fast passing away, and before we again meet our readers, the year eighteen hundred and eighty-two will have been numbered with the past. At this season each year most men cease and unhinge will pause for a moment and take a retrospect of the past, and form new resolves for the future. The year that is now closing has been like the last, full of its joys and sorrows, and its lessons have brought sorrow and disappointment to many, who entered upon it with bright hopes of happiness and success. Whilst to others, it has been a year of continual prosperity in business, and of domestic happiness. So it will ever be, in the ever changing vicissitudes of human life. It behoves us then to enjoy and improve the present, laying the foundations of a future existence, which will reflect all around well. It is indeed a wise provision that, the gift of prescience is withheld from humanity. How miserable would it be if it were otherwise. If we could see into futurity, if it were the evils that are to befell us, and which we could not prevent, how wretched would be our everyday lives! no enjoyment of the present, nothing but the very prospect of rear of evil come, which would render our lives unendurable, and make us long for death to terminate our misery. Yet, it is best that the veil of futurity should hide the future from our sight, so that we can (only for a brief space) enjoy the pleasures of our present existence whilst we can, trusting to Providence to care for the future.\n\nThe year just closed marked by the success of British arms in Egypt, where the rebellion led by the Arab Pasha has been crushed by the English troops, under Sir Garnet (now Lord) Wolseley, will known Canada as the leader of the Red River Expedition; and who since has then has added many fresh laurels to his brow. There is always a dark side to every picture, and in this case of victory is saddled by the thought (that although the life of life outside was remarkably small yet there will be many a once happy home in old England, which will mourn the absence of some dear ones, whose blood has been poured out on the sands of Egypt.\n\nIn our own Dominion, no event of national importance has occurred. Peace and plenty reign within our borders, and the labors of the husbandman have been crowned with abundant success. No intestine strife, or fear of foreign invasion has disturbed the harmony of our people, whose eyes are bent to promote the welfare of their country, to the development of this great country, and the advancement of their own individual fortunes. One of the most remarkable events in our own history is the unexampled rapidity with which the Canadian Pacific Railroad is being built. The road has been pushed forward at the rate of four miles a day, a fact unparalleled in railroad engineering, and more than a road a point nearly three hundred miles west of Winnipeg. Emigrants have poured in by thousands during the year to settle the fertile lands of the great North West, and no doubt during the next year more will be bought than numbers will be largely increased during the coming year, when greater building facilities will be afforded.\n\nAnd the prospects for the New Year are brighter still with the certainty of two (if not more) railways being commenced (one of which is said will be finished by the spring), lines of telegraph connecting with the eastern Provinces, and a weekly mail established, the future of Prince Albert is assured. Full of hope then, and faith in a glorious future, we bid farewell to the Prince Albert year, and bid God speed to our readers on a prosperous and all a happy and a prosperous new year.\n**A CARD.**\n\nTo Messrs: Acorn & Cross.\n\nThe pump which you have put in my well is giving entire satisfaction being easily worked and keeps the water in the house at all times.\n\nYours Truly,\n\nE. H. Ross.\n\nPrince Albert, Dec. 20th, 1882.\n\n---\n\n**Hay for Sale**\n\n**T J AGNEW**\n\nHas just received\n\n5,000 feet Glass—14½ x 18¾, 30 tons.\n\nAcres and Headless.\n\nWhite Lead.\n\nCook Shores.\n\nPowdered Coats.\n\nCutter Runners and Shafts.\n\nLamp Chimneys.\n\nBuilding Paper.\n\nPacking Paper.\n\nUnion Charms.\n\nTwenty sled loads to arrive next month.\n\n---\n\n**Wholesale & Retail**\n\n**TAILOR AND BARBER.**\n\nCall on Sealey, the Tailor, for your Clothes.\n\nFit Guaranteed.\n\nCutting a Specialty.\n\nHair Cutting and Shaving.\n\n---\n\n**JAMES SCOTT**\n\nGABLE HOUSE.\n\nPRINCE ALBERT.\n\n---\n\n**PRINCE ALBERT BAKERY.**\n\nI beg to announce to my customers and friends that I have commenced making bread for the last two months and am now prepared to supply any quantity that may be required by the public.\n\nBread, cakes, pies, etc., etc., etc.\n\nCONSTANTLY KEPT ON HAND.\n\n---\n\n**BREAD, CAKES, PIES.**\n\nAnd other things too numerous to mention.\n\nAll orders promptly attended to, and charged.\n\nOrders sent prepaid for Bread, Wheat, Rye, Oatmeal, etc.\n\n---\n\n**W. R. BELL**\n\nWAREHOUSING\n\nAT\n\nFORT QU'APPELLE.\n\n---\n\n**Ladies' Champion Prize.**\n\nA handsome Silver Cup (not to be sold at the same time) will be awarded to the best lady marksman at the shooting range. The prize will be given to the lady who scores the highest number of points during the season.\n\n---\n\n**MERCHANTS AND DEALERS**\n\nWe make the necessary charges for delivery at the shop, owing to lack of accommodation. Personal attention by members of the firm in receiving goods at shop.\n\n---\n\n**GUY BRO'S & CO.**\n\nFort Qu'Appelle.\n\n---\n\n**Real Estate**\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY LOCATED IN PRINCE ALBERT\n\nC. M. AIR,\n\nP. O. DRAWER R,\n\nPrince Albert, N. W. T.\nFarmers' Restaurant.\n\nMeats at all Hours.\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY.\nProducer for Real Estate.\n\nThe undersigned having purchased a number of Lots on the HURD and BAKER ESTATE, wishes to inform the public that they are now on the market.\n\nHARRY E. HURD.\n\nImportant to Farmers.\n\nEngine and Threshing Machine\n\nLottery opened by Thomas Murray, Esq., and all having been thoroughly tested, will be ready in a few days to attend to all whom may require their services.\n\nExaminers may depend on having their claims heard to their satisfaction.\n\nApply to D. L. SHANNON or W. JOHNSON.\n\nN.B. Murray, Simpson & Johnson will have another first-class engine and thresher to run next season in connection with the one lately purchased.\n\nMADLEY & CLARKSKILL.\n\nGENERAL DEALERS.\n\nMAIZE BLOCK. Price Albert, N.W.T.\nCash Paid for Grain.\n\nJ. L. JOHNSON & CO.\n\nHave just received a large and general assortment of stock of Hardware.\n\nALSO\n\n500 GALLONS OF COAL OIL.\n\nNo. 1 Campbell's Block, Prince Albert.\n\nJ. SINCLAIR,\n\nMERCHANT TAILOR.\n\nI have just received my New Goods and am now showing the finest Tweeds ever imported to Prince Albert.\n\nA full Line of French, English, Irish, Scot and American Fabrics, English and French Worsted Beavers and Cheviot Overcoatings, Dress, Linen and Serge Shirts.\n\nMen's Underclothing a Specialty.\n\nFor Caps, Gloves and Mitts, Socks and Stockings.\n\nCall at No. 1 Campbell's Block, newly fitted up with the latest fashions.\n\nOrdered Clothing specially selected to order on the shortest notice.\n\nA Good Fit Guaranteed.\n\nJ. SINCLAIR, Merchant Tailor.\n\nPRINCE ALBERT PLANTING KILLS AND SASH AND DOOR FACTORY.\n\nDOORS, SASH, &c.\n\nKeep constantly on hand, and machine work executed by skilled hands.\n\nAlso estimates for building gates, and poles furnished when required.\n\nGOODFELLOW BROS'.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and Estimates furnished when required.\n\nResidence near Presbyterian Church.\n\nCLOTHING!\n\nThe Cheapest Going.\n\nOur prices have been considered the lowest in Canada for many years in order to close out our balance of stock, and we offer a Reduction of from Ten to Twenty per cent. on all orders.\n\nCHOICE OVERCOATS STILL ON HAND.\n\nCall early and get the selection.\n\nKERR & HAMILTON,\n\nJ. M. CAMPBELL,\n\nBegs leave to state to his Friends and the Public generally, that he has recently purchased the business of Mr. Murray, late of this place, and is now engaged in the sale of Choice Overcoats, Boots and Shoes, all well made.\n\nClothing and Great Furnishings.\n\nPrice Black and Coloured Merinos.\n\nAt prices that cannot but suit you.\n\nRemember the price of the old stand.\n\nJ.M. Campbell.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITFD\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\nHudson's Bay Co'y.\n\nFarming Lands!\n\nFor Sale in Manitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nAlso\n\nTown Lots\n\nFor Sale\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and elsewhere.\n\nJ. Dryden, Land Commissioner.\n\nStobart, Eden & Co.,\n\nGeneral Merchants and Indian Traders.\n\nSeven Cases of Fancy Goods\n\nJust received from England containing Ladies', Girls' and Children's Underwear, Ball Dresses, Ladies' Mantles and Paletots, Ladies' and Maids' Winter Jackets, Ladies' and Maids' Costumes, and other articles too numerous to mention.\n\nCall and see our new stock at the old stand which everybody knows.\n\nGRAND WANTED.\n\n3,000 Bushels of Grain\n\nOats and Barley.\n\nHighest cash price paid for good grain.\n\nApply to\n\nJohn Wymerkirch,\n\nPrince Albert, N.W.T.\n\nThe Cable House.\n\nThe Best Beer and Cigars\n\nOf the Finest Brands always on hand.\n\nWholesale and Retail.\n\nJohn Wymerkirch, Prop.\n\nFurniture Store\n\nC. Carter & Son\n\nWould estimate to the people of Prince Albert and the surrounding country that they have a large stock of furniture, and have opened their business.\n\nRed Brick Store\n\nOpposite the H.B. Mill.\n\nDry Goods, Groceries, Etc., Etc.\n\nDry goods, groceries, etc., etc.\n\nNext House to Scott's Farms.\n\nCaledonian Restaurant\n\nOpposite the H.B. Mill.\n\nMeals at All Hours.\n\nLivery and Feed Stables.\n\nIn connection with\n\nS.H. Miller.\n\nTroy, C.P.R. West.\n\nNotice.\n\nR.B. Way,\n\nPost Office, Prince Albert, N.W.T.\n\nWatches, Clocks and Jewellery\n\nIn the Market.\n\nCutlery! Spoons and Forks!\n\nGoods all warranted as represented.\n\nSpecial attention to repairing watches.\n\nG Carter & Son,\n\nPrince Albert.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJob Printing.\n\nWe have duplicated the order for stationery, which unfortunately was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSpink & Maveety,\n\nProprietors.\nNEW STORE.\n\nNEW GOODS.\nNEW PRICES.\n\nWALTERS & BAKER\n\nHave just Opened a Complete Assortment of\nDry Goods, Clothing,\nBoots and Shoes,\nGroceries & Provisions,\n\nIn the store formerly occupied by J. O. DAVIS & CO.\n\nThe public are invited to call and inspect the stock before purchasing elsewhere.\n\nH. WALTERS, F. C. BAKER.\n\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\n\nJust arrived, a Large Assortment of Raphael Tuck's Prize Exhibition Cards.\nCall early and make your selections.\n\nA LARGE STOCK OF\nMusical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T\n\nHORSE SHOE STORE.\n\nSanta Claus is now open.\n\nToys, Toys, Dolls, Dolls,\nHoliday Gifts of all kinds, Work Boxes,\nDressing Cases, Writing Desks, Etc., Etc.,\nThe Finest Selection in Town.\n\nFURS.\n\nLady's Sets Persian Lamb, Gent's Persian Lamb and South Sea Sea Capes, Muffs, Gloves and Moccasins at reduced prices.\n\nArctic Overshoes — Felt Boots\nFelt Socks, Children's and Ladies' Boots, etc.\n\nClothing\n\nFull line in Gent's Furnishings, General Dry Goods, Tea, Tobacco, Pipes, Patent Medicines, Toilet Soaps and Perfumery, or anything you want good and cheap.\n\nCall at The Horse Shoe.\n\nTHOMAS O. DAVIS,\n1879. 1882.\n\nAFTER FOUR YEARS.\n\nWe beg to tender our sincere thanks to our numerous customers for the very liberal patronage we have received during the past four years, and on drawing to a close this our most successful year's trading, we wish to express the hope that our business relations with all may continue to be such as to warrant a continuance of their favors in the future.\n\nHoping for all a happy and prosperous New Year.\n\nWe remain,\n\nYours truly,\n\nBETTS & Gwynne.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882122701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 3237, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3694, 2], [3694, 5597, 3], [5597, 8599, 4], [8599, 10800, 5], [10800, 12623, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]