[{"id": "d47c48d3428adb20867a2ac2e3b1f43426053a21", "text": "THE PRINCE ALBERT TIMES,\nWEDNESDAY, DECEMBER 6, 1882.\n\nOUR WANTS AND WISHES:\n\nWe publish to-day a memorial presented to Sir John Macdonald, at Ottawa last spring, on behalf of the people of Prince Albert, which was prepared, at his special request, by two of our most prominent residents. It is well known that the memorialists who presented this memorial, are not unfriendly to the present administration, but the contrary, and that therefore it was conceived in a hostile spirit, but most emphatically the opinions of men of experience in the North West, and who are thoroughly conversant with its wants and its history. A reply was promised, but the matter was allowed to fall into abeyance from Manitoba and the Territories, the memorial was probably docketed, and it is now considered right to publish it. Although the memorial alludes to the want of organization, as a means of cure for the evils which afflict us, it does not refer in that connection to the transference of the public lands to the proposed new province. We believe this cannot be its object, we think almost the entire groundwork of complaint, and had the discreet and just policy, which it indicates, been carried out, the disaster which has befallen the administration of the late general elections in Manitoba might have been less severe. The same complaint with regard to the delay in issuing patents to companies entitled to them by side-roads and improvements, there is as it does here, and had the Act, which was introduced at the last Session of the Dominion Parliament to remedy this evil, not been withdrawn, in the eleventh hour, and some pledges be given as to the public lands, a serious defeat might have been converted into a crowning victory. For in Manitoba as in the North West Territories it is a party that is considered first, but the public interests. If injustice is done, if right measures are delayed, the people seek expression of their discontent and indignation at the polls by a negative vote. It is not that they are in love with the former administration, but that they are bent upon having justice done to the country. This is a discretion which may seem very nice, and possibly unintelligible to the eastern mind, but it is a well understood one here. No one who has visited the North West Territory, forgets for a single instant that dreary period which elapsed between the fall of the Macdonald administration in 1873, and that of the Mackenzie Government in 1879; the administration which came in with the potato blight in the east, and with the locust in the west. No one forgets that trying time, when the poor farmers of Manitoba, driven to despair, sent repeated appeals from their crude sod-houses, from the Dominion Government, and were compelled to give mortgages in security for the pitance which was granted them with a grace. No one forgets the long years of stagnation and inertia of that administration in all enterprises of practical utility in the North West, its vast expenditure in making surveys and surveys, (though more than enough have built a railway from Winnipeg to (Saskatchewan) its paltry achievements, its espionage. No one forgets the agitation which prevailed in Manitoba, and the clamour amounting almost to vindictiveness, and which was rapidly hurrying her into rebellion, a feeling inflamed as well by the extreme insensibility with which the government of the people was received. We will see member (when matters in Manitoba however, that may be easily and more almost at a crisis), a visit paid to Ottawa by a life-long supporter of the liberal party in Ontario, and an old personal friend of the Premier, Mr. Mackenzie, who knew what things were afoot, so determined to go down and put them right. Mr. Mackenzie \"kent\" what he \"kent\" and he \"kent\" that Mr. Kaspar Kersten \"kent\" Mr. MacKenzie wanted nothing but receive him with open arms and \"tumble\" to his experienced opinions at once. To his utter bewilderment, however, to his astonishment, upon his arrival at the Capital, that he could not even get an audience with the great man. Chaffing with wounded amour propre, he paced the corridors day after day, and at length entered into a groan-room where he found the Premier, deep in a mass of dreary detail which could entice the Legislature for a little longer, but not much longer, into his old friend's warm chamber, and was told that he (the friend) had come down to tell him that things were going to the bad in Manitoba. Mr. Kaspar Kersten knew it too, and more than Manitoba than you or I. I don't want to hear about Manitoba. I don't care that (snapping his fingers) for Manitoba.\" And this was doubtless said in such an attitude that unaccountably able, the hon. member Mr. Mackenzie, who has done good work in his day for Ontario, but who short-sighted and ill-advised thought that the North West Territories would be neglected, and that the North West, being short-handed, would be unable to carry on with unexampled rapidity, and that moreover, it would be compelled under the stipulated terms. It is true this is anticipated with caution, meretricious to the industrial interests of this country. Yet it is a present to the whole North West, and it is not of this matter that our people immediately complain. The communities of the North West Territories are rapidly increasing, and every year the area is widened, and yet there is no internal organization to provide for the necessities of the times. This state of things is plainly set forth in the memorial, and which we publish today, and which wonder is so much that such a condition exists, but that the powers that be allow it to exist. The desire and determination of the North West people is to be heard, and to be heard with like privileges, and under conditions to equal with those of the other provinces. Nothing short of this will satisfy them. We do not want subordination, we want provincial autonomy, and the control of our public lands. Now we think that it is in this matter that we come into collision with eastern prejudices. We believe that Sir John and his Cabinet are aware of the necessity of concession, in these great matters, but he has behind him, all the narrow-mindedness of the Eastern provinces. Go where we will, in Ontario, Quebec, (our mother and step-mother land of Provinces) we meet with the threadbare statement, that the North West is a purchase of property of the Eastern provinces, and must be handled by them in their own interest and independently of the feelings and interests of its inhabitants. It would be easy to demolish this absurd position, but we have space to do so. There is one obvious argument,\nHudson's Bay Co'y. The Prince Albert Times\n\nFarming Lands!\n\nFor Sale in Manitoba & North-west\n\nThe Hudson's Bay Company own 500,000 acres in the Great Fertile Hills, and now offer for sale 50,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTown Lots\n\nFor Sale\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goucheen, N.W.T.\n\nThe above will be disposed of at reasonable prices, and on easy terms of payment.\n\nFull information regarding these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nCLOTHING!\n\nThe Choice of Clothing\n\nOn our display are a fine selection of\n\nCHOICE OVERCOATS\n\nin many styles.\n\nKerr & Hamilton,\n\nJ.M. Campbell,\n\nNow is the Time to Advertise\n\nAdvertise.\n\nAdvertise.\n\nAdvertise.\n\nEvery merchant in the Territories deserves an increasing his business should advertise in THE TIMES.\n\nEvery investor in the North-west should advertise in THE TIMES.\n\nMerchants in Manitoba and the other Provinces wishing to establish a business in the Territories will find it greatly to their advantage to advertise in THE TIMES.\n\nSettlers in the North-west will find THE TIMES a most acceptable offering of goods and friends in the past, thereby saving long letters.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which unfortunately was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETY,\n\nProprietors.\nMEMORIAL.\n\nTo the Right Hon. Sir John L. Macdonald, M.P., K.C.B., &c., &c.\n\nSir,\n\nAccording to the instructions which the members of the honourable House have thought fit to give me, I am directed to bring this memorial before your lordship, and if possible, to procure its success.\n\nThe undersigned respectfully submit, that in the present advanced state of the affairs relating to the Crown lands of the North-West, the question of settlement and cultivation of such lands is of the greatest importance and interest to the Country. The question is now becoming one of great political and national consequence, and requires the most prompt and vigorous action from those who are charged with the administration of public affairs. The question is also of vital importance to the Native population of the North-West, who are anxious and eager to have their claims and wishes heard and attended to in a proper manner.\n\nIn conclusion, we respectfully renew our request to your lordship, that you will lend your influence to this question, and that you will take such measures as may be necessary to promote the successful settlement of the Crown lands of the North-West.\n\nWe are, Sir,\n\nYour obedient servants,\n\n[Signature]\n\nWEDNESDAY, DECEMBER 6, 1882.\n\nMEMORIAL.\n\nTo the Right Hon. Sir John L. Macdonald, M.P., K.C.B., &c., &c.\n\nSir,\n\nAccording to the instructions which the members of the honourable House have thought fit to give me, I am directed to bring this memorial before your lordship, and if possible, to procure its success.\n\nThe undersigned respectfully submit, that in the present advanced state of the affairs relating to the Crown lands of the North-West, the question of settlement and cultivation of such lands is of the greatest importance and interest to the Country. The question is now becoming one of great political and national consequence, and requires the most prompt and vigorous action from those who are charged with the administration of public affairs. The question is also of vital importance to the Native population of the North-West, who are anxious and eager to have their claims and wishes heard and attended to in a proper manner.\n\nIn conclusion, we respectfully renew our request to your lordship, that you will lend your influence to this question, and that you will take such measures as may be necessary to promote the successful settlement of the Crown lands of the North-West.\n\nWe are, Sir,\n\nYour obedient servants,\n\n[Signature]\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\nJust arrived, a Large Assortment of Raphael/Tuck's Prize Exhibition Cards.\nCall early and make your selections.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nHORSE E TO THE FRONT!\n\nI HAVE JUST RECEIVED THE LARGEST AND ONLY STOCK OF\nXmas Presents\nAND\nHoliday Gifts\n\nEver offered in Prince Albert, which I will sell at 25 per cent below usual prices.\nLadies, come and see for yourselves. I intend to sell at reasonable figures.\n\nALSO JUST RECEIVED LARGE STOCK OF\nClothing, Furs, Arctic Overshoes, Cree Moccasins\nMADE FROM CANADIAN MOOSE.\n\nSHIRTS. SHIRTS. SHIRTS.\n\nThe only assorted stock in town. Give me a call and satisfy yourself that I will give you the worst of your money.\n\nTHOMAS O. DAVIS,\nSign of The Horse Shoe.\n\n1879. 1882.\n\nBETTS & Gwynne.\n\nOwing to the rapid growth of our trade we find our premises too small for the volume of business. We have in consequence decided to make room by clearing out our entire stock of\n\nBOOTS\nAND\nSHOES.\n\nParties requiring goods in this line will find it to their advantage to examine our stock at once.\n\nEvery Pair Reduced 25 Per Cent. for Cash only\n\nW. J. CARTER, PRINCE ALBERT\nBuilder and Contractor.\n\nPLANNING MILLS AND\nSASH AND DOOR FACTORY,\nSASH, SASH, &C.\n\nPlans and Estimates furnished when required.\n\nResidence Near Presbyterian Church.\n\nGOODFELLOW BRO'S.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882120601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 2857, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6667, 2], [6667, 6667, 3], [6667, 8155, 4], [8155, 10626, 5], [10626, 12140, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]