[{"id": "115cda273d59b3d2d3433a2651ed81e358e5a8ae", "text": "THE PRINCE ALBERT TIMES\nAND BASKETCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nNEW COURT HOUSE.\n\nAGRICULTURAL SOCIETY.\n\nTHE QUEEN'S BIRTHDAY\n\nPARLIAMENTARY CANT.\n\nJAMES SINCLAIR\n\nJ. G. DAVIS & CO.\n\nFARMERS' RESTAURANT.\n\nNOTICE.\n\nPUBLIC NOTICE.\n\nFURNITURE\n\nOFFICE AND WORKSHOP.\n\nNATHANIEL ACORN.\nBuffalo Hall!\n\nClose Buyers Still Patronize\n\nTHIS OLD RELIABLE HOUSE.\n\nWe Need Money and are Willing to Sacrifice our Goods to get it.\n\nOver due accounts should be attended to at once to avoid costs.\n\nBETTS & GWYNNE.\n\nHARDWARE!\n\nA FULL STOCK OF Powder, Shot, Shells, and Gun Caps.\n\nGarden Tools, Glass, Cut Nails and General Shelf Hardware.\n\nAT J. L. JOHNSON & CO.'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal, and United States promptly attended.\n\nPRINCE ALBERT - N.W.T.\n\nCAMPBELL'S BLOCK, G. D. NORTHGRAVES, Watchmaker and Jeweller.\n\nA LARGE STOCK OF Watches, Clocks and Jewellery.\n\nKeeping Promptly All\nRED DEER HILL.\n\nFrom an occasional correspondent.\n\nSeeding is being pushed rapidly forward. Wheat and oats will form a large proportion of the crops.\n\nMr. Cook's seedlings were destroyed by prairie fires, as also two stacks of hay belonging to Mr. John Hodgson and Mr. Bishop.\n\nA.C.M. Church was lately opened here. The dedication service will not be held until summer.\n\nMr. Moses Brown recently left St. Vital City.\n\nAfter a brief but severe illness Mr. A.M. Smith recovered his feet on the morning of April 6th, 1884, and his remains were interred in the Mission cemetery.\n\nThe school was formally opened Monday last, and we have now entered our sixth year. We sincerely sympathize with the bereaved relatives and friends.\n\nA meeting composed of French and English half-breeds, was held at Lindsay school house on Tuesday last; the object of the meeting was to consider and pass a set of resolutions which have been passed at previous meetings, and resolve that the same be sent to the government of Canada, by said French and English half-breeds.\n\nThe substance of resolutions passed was substantially the same as with the addition of two, viz., one protesting against the participation of the French members in the election, while the other is agreed to sending a delegation to Louis Riel. Opposition was made by the English half-breeds, who objected to the manner in which the chairman, Mr. Andrew Spencer, conducted the business in which he said it was impossible that they could be expected to fight themselves to the death over a matter of food.\n\nThe whole meeting was left to commence. The meeting ended without any resolutions as presented by the French. It appeared to be the mind of the meeting to adjourn, but Mr. Spencer insisted instead of having to send out all of our men to meet the resolutions concerning the surrendering of the territory of the North West Territories into the Union. With the aid of all their means, the French members could not do this, but as was stated in the resolutions, it will only mean to get the government to make a treaty with the Indians, but Canadians from Ontario with guns, one of the latter taking the lead, opening fire, and killing the Indians, and then saying that they were doing it for the purpose of driving the Indians out of the country.\n\nRed Deer Hill, May 13, 1884.\n\nCORRESPONDENCE\n\nWe do not hold ourselves responsible for the views expressed by correspondents.\n\nAGRICULTURAL SOCIETY.\n\nTo the Editor of The Times.\n\nSir, — As I have promised a short time since, I am obliged to send you some news, allow me to state that our Agricultural Society has been getting along very well, thanks to kind contributors and advisers. Of course this being the first of the kind in this district, there were many difficulties at first. A board has been elected, and the whole thing is started in a way that will give satisfaction to the farmers, which is said by the business community to be the proper thing, though they say that the farmers should reign in favor of the mercantile community taking that part, in being supplied with goods, etc., which the business community could afford to better. Of course this is all talk at present, but the farmers are anxious to see something done. In June, it is their intention to hold a general meeting in Prince Albert with a view to electing officers, and to have the majority of the directors to make Prince Albert the central place for the quarter of the district. The plan seems to be working, and though he did not dictate or suggest anything to that effect, still to make Prince Albert the center of the district would be greatly appreciated by the experienced adviser and help in different ways. For instance such men as the Hon. L. Clarke, Hon. Mr. Macdonald, Messrs. Swanson, Kennedy and Hughes and Col. Spear, with other gentlemen, who are interested in the success of the institution, either with funds or advice, for both are acceptable. We feel sure that the members will gladly interest themselves in it, but we are unfortunately not acquainted with them as yet. We are glad to hear that Mr. Clarke has taken the lead only with a subscription of $100 towards his fund and has been assisted by several others.\n\nIn the width of the Society for all funds to take an active part in the proceedings.\n\nWe have received several letters from any friends of a similar nature, chiefly as to making Prince Albert the center or headquarters of the district. We are glad to find that the Society of accommodation in case the exhibition in the fall is held here. Also, the Albert Agricultural Society would also be grateful to any gentleman, not giving any stated sum, should they be disposed to give something in particular.\n\nThe by-laws will be printed as soon as the price list, and will appear in the local newspapers in a few days.\n\nCHAS. ADAMS, Sec. Texas.\n\nThe Housewife.\n\nA popular domestic journal for American housewives will be sent for one year free to every lady who will send us the name and address of 10 married ladies between 25 and 40 years of age. We pay paper for every piece of housekeeping in existence. This offer is made only to those who are willing to send us copies, as we know every lady who once sees The Housewife will subscribe for it. Regular price $1.00 per year. Address THE HOUSEWIFE, Rochester, N.Y.\n\nA. SPROAT, Agent.\n\nPRINCE ALBERT.\n\nBaking Powder Absolutely Pure.\n\nTHOS. POWERS,\n\nIs Prepared to Take CONTRACTS\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nPrick and Lime always on hand.\n\nNOTICE.\n\nA Public Meeting of the Lorne Agricultural Society.\n\nWill be held at Trenton Hall, Prince Albert, Wednesday, the 4th of June next.\n\nAt 10 O'CLOCK P.M.\n\nAll persons interested in the affairs of this Society and those wishing to become members are respectfully invited to attend.\n\nCHAS. ADAMS, Sec.\n\nKirkpatrick P.O., May 13, 1884.\n\nSEEDS\n\nAgricultural, Garden and Flower seeds (various), Timothy, clover, grass seeds, tree seeds, carefully selected seed. Send for illustrated catalogue (free application).\n\nE. E. KEITH & CO., Seedsmen and Grain Dealers, Winnipeg.\n\nPUMPS!!\n\nDRY LUMBER.\n\nMOORE & MACDONALD\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDONALD.\n\nSt. P., H. & M. Railway. MARKLEY & COY.\n\nGENERAL MERCHANTS.\n\nPrince Albert.\n\nNOTICE.\n\nI hereby intimate that all my accounts are now closed, and will be submitted to the creditors to settle them immediately, if not paid, will be added to N.B. On and after this date I will keep no book accounts. Terms strictly cash.\n\nWM. GORDON.\n\nPATENTS.\n\nNOTICE.\n\nI would respectfully inform the public of Prince Albert and vicinity that I have leased Michael Scheer's Blacksmith Shop where I will be happy to see all who will favor me with their patronage.\n\nMY NOTICE OF FAIR PRICES.\n\nISAIAH MCALL.\n\nGeneral Blacksmith.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884053001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 2086, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 305, 2], [305, 1058, 3], [1058, 8353, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]