[{"id": "28710d4f40596cd7249cf170e0271d8870ebe035", "text": "FRIDAY, FEBRUARY 25, 1887.\n\nFOR SALE.\n\nAMERICAN COAL OIL\n\nAT\n\nT. J. AGNEW'S\nT. N. CAMPBELL\n\nJUST RECEIVED A LARGE STOCK OF\n\nMUSICAL INSTRUMENTS\n\nAccordeons, Harmonicas\nViolins, &c., &c.\n\nInformation to Electors.\n\nThe following is the qualification of electors as prescribed by the Parliament Act:\n\nEvery person qualified to vote at the election must be an elector of the constituency in which he resides, or a resident within the electoral district, and who has been registered as such for at least six months immediately preceding the election.\n\nIf any elector finds that his name is not included in the polling division to which he belongs, he may apply to the Returning Officer for a certificate of inclusion before the polling day, and if the same is granted, he may then vote.\n\nIf any elector finds that his name is not included in the polling division to which he belongs, he may apply to the Returning Officer for a certificate of inclusion before the polling day, and if the same is granted, he may then vote.\n\nLATEST NOVELTIES IN TOYS,\n\nWHICH FOR THE NEXT WEEK I WILL SELL\n\nAT COST FOR CASH.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Repos, Window Island in Black and Yellow, Door Matting, Crumpled Paper, Bedding, Chalkings, Empress Cloth in Black and Garnet, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beccio Veiling, Ladies' Silk Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds. Inspection is solicited.\n\nSTOVES!\n\nA Further Reduction of 20 per cent. will be given on all\n\nBOX AND PARLOR STOVES\n\nRemaining on hand.\n\nCamp Stoves and Piping\n\nAT BOTTOM FIGURES.\n\nI have a first-class workman, and will execute all orders for Tinsmith's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\n\nA FULL STOCK.\n\nJ. R. McPHAIL.\n**ADDRESS**\n\nTo the Electors of Saskatchewan:\n\nGentlemen:\n\nAt the request of a number of friends in the District of Saskatchewan, I beg to offer myself as an eligible to your suffrages at the coming election as a member for the Federal Parliament.\n\nShould I be returned as your representative I shall use every endeavor to secure the local interests of the District, and shall urge on the Government the necessity of pushing on Railway communication to Prince Albert, Battleford, and Saskatoon.\n\nThe building of a bridge across the South Saskatchewan River;\n\nThe granting of assistance to the railway to Hudson's Bay;\n\nThe fixing of wages for the laborers to all Appointments Board heads of Families born in the Territories between 1870 and 1885;\n\nThe recommendation of the permanent system by which the liquor question may be treated;\n\nThe speedy payment on a liberal scale of all just claims against the Government;\n\nThe procurement of seed grain free on account of the peculiar circumstances in which the settlers of this district find themselves;\n\nThe amendment of the Land Acts in such manner as to secure congratulation to the people;\n\nThe granting of positions under Government to local men;\n\nThe purchasing of supplies needed for public institutions situated in the district in which they are consumed;\n\nThe formation of a Legislative Assembly to deal comprehensively with the future of Saskatchewan; I appear to every elector in the district for support during the ensuing year.\n\nI am, gentlemen,\n\nYour obedient servant,\n\nD. H. Macdonald.\n\n**Avocats du District de Saskatchewan:**\n\nMessieurs,\n\nA la demande d'un nombre d'amis intéressés dans le District de Saskatchewan et d'un certain nombre de citoyens consentants, j'ose solliciter votre suffrage pour être élu pour le Parlement Fédéral.\n\nSi j'étais élu, je ferai tout mon possible pour que le gouvernement fasse preuve de toute sa volonté pour obtenir l'établissement d'un pont sur la rivière Saskatchewan du Sud ;\n\nLa construction du chemin de fer de la baie au centre bis ;\n\nLa révisorisation de la base des salaires pour les travailleurs employés à tous les postes ;\n\nLa trêve des travaux de la voie de chemin neigeux ;\n\nLa révision des lois sur le montage de la Saskatchewan pendant cette période ;\n\nLa formation et la reconnaissance des positions au plus haut niveau ;\n\nLa création d'un conseil pour la gestion des ressources naturelles ;\n\nLa recommandation des lois relatives à la colonisation des territoires nouvellement colonisés.\n\nJe serais honoré si vous prêtez une mains tendue à cette cause.\n\nCordialement,\n\n[Votre signature]\n\n---\n\n**AVIS D'ÉLECTION**\n\nDistrict Electoral de Saskatchewan:\n\nSavoir:\n\nUn appel est donné au peuple de négocier des élections au cours du prochain mandat, après coup, pour la formation d'un Conseil pour administrer la Saskatchewan.\n\nPar conséquent, je prie toutes les personnes qui ont voté non seulement pour leurs propres intérêts, mais aussi pour ceux des autres électeurs, de faire preuve de générosité et de voter pour moi lors de la prochaine élection.\n\nN.B.- Le vote est obligatoire pour tous les citoyens admissibles âgés de 18 ans ou plus.\n\n---\n\n**Buffalo Hall!**\n\nOur books for 1886 show the largest year's business we have enjoyed since opening in Prince Albert.\n\nWe start the New Year with Fresh Goods (which arrived yesterday) for our Holiday Trade.\n\nRaisins, Currents, Dates, Peet & Jimbo & Canned Goods, Oysters.\n\nPinnin Badgie, Etc., Etc.\n\nAll Winter Goods in our Try-Goods and Clothing Department are now being offered at greatly reduced prices.\n\n---\n\n**Betts & Gwynne**\n\n**Caledonia Brewery**\n\n**East End**\n\nThe proprietors of the above concern in connection with the newly erected Distillery, hope to soon add to their regular stock their choice selection of beer, either in kegs or cases.\n\nFlat Irons 60 per case,\n\n1 Lb. Sugar 18¾ cts. per Lb.\n\nRags for the keg & case.\n\nIn any case odd can delivered to all parts of Balmoral and District.\n\nA Billiard Table and Saloon\n\nCarried Moderate.\n\n**Chas. Woodman**\n\n**Proprietor**\n\n**Notice!**\n\nPlease take note of the changes in the School Districts which will take place on Thursday, the 24th Day of February.\n\nFor the purpose of borrowing the sum of thirty-three shillings sixpence from me, in order to pay the present rate of interest, the sum of twenty-eight shillings ninepence, the last day of the month, the rate of interest will apply from the 1st day next following the date of the interest then due.\n\nThe qualifications of voters shall be as stated in the rules laid down by the School Board of Education, 1885.\n\n---\n\n**C. D. Northgraves**\n\nWatchmaker and Jeweller,\n\nA. T. N. Campbell's New Star\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and Jewellery\n\nKept constantly on hand.\n\nRepairing promptly attended to.\n\n---\n\n**Bell's Organs**\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBell & Co., Guelph, Ont.\n\n---\n\n**Other Notices**\n\nFree access to all libraries.\n\n\"Free Access\" gives every person free use of the latest newspapers and periodicals without charge.\n\n---\n\n**Additional Notes**\n\nFree press access to all reputable papers.\n\nFoot not visible.\n\n---\n\n**Mr. Smith's Advertisement**\n\nEndorsed with a flourish.\n\n---\n\n**Mr. Jones' Invitation**\n\nYang Kong Smith has an invitation in his name.\n\n---\n\n**Mr. Brown's Announcement**\n\nBought a horse recently.\n\n---\n\n**Mr. Green's Notice**\n\nOld Mr. Smith had a horse bought him recently.\n\n---\n\n**Mr. White's Advertisement**\n\nIdeal Vendor for all horse products.\n\n---\n\n**Mr. Black's Notice**\n\nNinth Avenue, Prince Albert.\n\n---\n\n**Mr. Red's Advertisement**\n\nIdaho Springs, free hot mineral water.\nELECTION NOTES.\n\nMr. Macdonald will leave for Portage la Prairie tomorrow evening, in company with Messrs. Hughson and Macdonald.\n\nMr. Lord will visit Bathurst town district. Messrs. Gray and Craig will also proceed to Bathurst and endeavour to make the election there for Lord.\n\nA dispatch from Brandon states that Mr. Macdonald's majority will be over one hundred.\n\nA number of men were seen digging holes on the night of the election, and escape was also dangling from a number of domiciles. It is supposed that the new king will try their strategies by buying themselves.\n\nMr. Lord left Brandon yesterday for St. Louis, where he held a meeting last night. He hopes the agreement with Mr. Macdonald will hold joint meetings, and will not break the peace. His colleagues would be there on the same day Mr. Gunn will meet him at night.\n\nWhen the news arrived that the Commons had passed an amendment to the Constitution Act, Sir John Macdonald wrote to Sir Leonard Tilley that a great change in the situation was going to take place. The government was now obliged to act, and Sir Leonard Tilley would have been obliged to yield, but Sir John Macdonald would not have been able to do so. Sir Leonard Tilley would have been obliged to yield, but Sir John Macdonald would not have been able to do so.\n\nA meeting was held at Brandon last night, and Sir John Macdonald spoke about forty people being present. Speeches were made by Edward Dickens on behalf of the Reformers, and Mr. Macdonald spoke on behalf of the Liberals. Mr. Macdonald stated that the government was opposed to any measure that would affect the interests of the province.\n\nMr. Macdonald will be in the North-West District next week.\n\nMail Contract.\n\nFor the last two years parties have been engaged in the struggle for the control of the Roman Catholic Church in Canada. The result of this struggle has been that the Roman Catholic Church in Canada is now under the control of the Roman Catholic Church in the United States.\n\nIt is reported that Mr. Macdonald will be in the North-West District next week.\n\nRussell & Davis, Butchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and Game in Season.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRussell & Davis, Brown's Brick Store.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887022501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 2459, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2046, 2], [2046, 7665, 3], [7665, 9938, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]