[{"id": "baeb7570d25ed2a1cfdef5d760230311a61dedd5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SK., FRIDAY, OCTOBER 6, 1888.\n\nBANKINGHOUSE\nOF\nMacarthur & Knowles\nPrince Albert, N.W.T.\nPrince Albert, N.W.T.\nBanking House.\nPractically all Banking Business.\nInterest Discounted.\nNotes Discounted.\nLoans Available at all points in the District.\nCollections undertaken and promptly attended to.\nBANKERS—MERCHANTS Bank of Canada\nWILLIAM M. MACLACHLAN.\nAdvocate, Notary Public.\nMoney to loan on fixed mortgages of improved land property, at fair rate of interest.\nPRINCE ALBERT, SK., N.W.T.\nBERWICK & MCKAY.\nAdvocates, Solicitors, Notaries Public,\nEtc.\nPRINCE ALBERT, SK.\nSTEPHEN BOWEN.\nAdvocate, Notary Public.\nJames McKeay.\nH. W. NEWLANDS.\nAdvocate, Notary Public.\nPRINCE ALBERT, SK.\nW. R. GUNN, M.A.\nAdvocate, Notary Public, Conveyancer Etc.\nPRINCE ALBERT, SK.\nC. R. STOVEL.\nDENTIST.\nOffice over the Hudson's Bay Co.'s Branch Store, Taft's Block.\nPRINCE ALBERT, SK.\nJ. LESTOCK REID.\nDominion Land Surveyor.\nPRINCE ALBERT, SASK.\nA. C. PATTERSON.\nForwarding Agent.\nAll goods attended to and shipped immediately.\nOrders filled and forwarded by express.\nOrders solicited.\nPRINCE ALBERT, SK.\nROBERT THOMSON.\nSign and Ornamental Painter.\nCalligraphy and Paperhangings on Short Notice.\nDecorative Painting a Specialty.\nROYAL MAIL STAGE\nWeekly.\nReceipts at Prince Albert Station, Prince Albert, SK., every Monday morning. Passengers leave every Tuesday morning. Passengers leave every Wednesday morning. Passengers leave every Thursday morning. Passengers leave every Friday morning.\nLESON & SCOTT.\nR. T. BICKLEY.\nAuctioneer, Accountant, Estate and General Agent.\nHas on hand a number of\nTOWN LOTS\nWhich will be sold cheap on easy terms.\nAlso some\nIMPROVED FARMS.\nPRINCE ALBERT, SK.\nQUEEN'S HOTEL\nT. GRAHAM, Proprietor.\nLeading Hotel in Saskatchewan.\nOpen by day or night.\nThe bar is supplied with the finest brands of cigars, beer, cider, and blackwood brandy. Noisy attention paid to the travelling public.\nTHOS. ORAM.\n\nTHE LATEST NEWS:\nPublic Notice is hereby given that His Excellency the Lieutenant Governor has been pleased to order that Sittings of the Legislative Assembly of the Province of Saskatchewan shall be held within the limits of the Town of Prince Albert, on the following days:\nBATTLEFORD, Tuesday, November 6th.\nPRINCE ALBERT, Tuesday, November 13th.\nBy Command,\nLt. Col. Gordon, Secretary.\nLieutenant Governor's Office, Regina, Oct. 2nd.\n\nFOR A FULL LINE OF\nGroceries,\nConfectionery and\nFancy Goods\n\nGo to\nR. T. GOODFELLOW,\nCurrent River and McKay Street.\n\nAnother Nice Lot of\nWatches, Rings,\nSleepy Buttons, etc.,\nJUST ARRIVED AT THE\nPOST OFFICE JEWELLERY STORE\nCall and examine, and at the same hour have your watch set to correct standard time.\n\nR. B. WAY\nMarriage Licences Issued.\n\nBOOTS AND SHOES\n\nGet goods here for their fashionable shape and superior quality.\nAre in half sizes and in numerous widths, all styles and colors.\nCustom Work made and repaired.\nBy buying your Boots and Shoes at our store, you have the best of the dollar.\nCome in and see what we are doing.\n\nS. McLEOD & COY.\nNOTICE.\n\nMISS AULD\n\nHaving secured the services of a First-class Dress & Mangle Maker.\n\nIn the East, I will be able to supply all requirements of dress and mangle work.\n\nROYAL MAIL STAGE\nLOOK HERE!\n\nW. SHANNON & CO.\nFor spring and summer wear for ladies, boots, shoes and slippers.\nFull lines of\nTrunks, Valises and Shoulder Bags\nLadies' and Children's Hose.\nTo be disposed of at the lowest living prices.\n\nWM. SHANNON & CO.\n\nTAX SALE\nLatest Provincial Public School District No. 4, N.W.T.\nList of Lots to be sold for Taxes—\nName—Dunlop Hepburn.\nDesignation—Lot 1, Section 17, Township 30, Range 20, W.M.S.\nAmount due—$50.00.\nAmount paid—$25.00.\nAmount remaining—$25.00.\nTotal amount, with interest—$31.25.\nTerms—Payment in full.\nNotice is hereby given that the above lands will be sold for the balance of the taxes due thereon, viz., $25.00, on the 1st day of December next, unless sooner paid, according to the requirements of the Act of Parliament made in connection therewith by the Indian Agent.\n\nHAFTER DEED,\nIndian Officer, Regina.\nSept. 19th.\n\nTHE BAZAAR.\n\nThe Ladies Aid Society of St. Paul's Presbyterian Church took advantage of Thursday being exhibition day, and held a bazaar in aid of the church funds. The sale was a great success, and the proceeds will be used to purchase a new piano. The sale included a variety of items such as jewelry, clothing, and household goods.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nWigmore's Clothing Sale is still going on. Good dry Goods for sale at Walker & Baker's.\n\nLeaves, subscriptions for the Deaf, etc., are now available at James's Bookseller's.\n\nRice's Paint Sale, Warren's Safe Co., Kindall's Spark Cure, and Poppas at J. Jackson's.\n\nMr. Jackson's son is erecting a fine stable in rear of his premises on Church Street.\n\nMr. Chan, May appear from Monday last Sunday. Mr. Chan and family will remain at the lake for some time yet.\n\nMr. Wilson, who has been visiting us for several weeks, has just arrived back in town on Wednesday last.\n\nMr. Warren has received balance of the gold bullion of which he brought in from Montana last spring to Moses J. B. and B. Mack.\n\nThe trip was finished by the middle of August along the South Branch west from Bashico and stacking was all done by mid-week.\n\nMr. McCann, clerk in the I.D., was in town this week and is accompanying Mr. McCann on his tour of paying the Indians.\n\nThe annual Missionary Meeting of the Methodist Church of Prince Albert will be held on Sunday, the 21st instant, at the Wesleyan Church, 1st and 2nd.\n\nBy the new post office regulations only stamps will be taken for registration in addition to the regular rate. This will apply to both letters and packages.\n\nThere will be no service in the Methodist Church on Sunday week, the 14th inst., the parishioners of Rev. Mr. How will attend the Sunday School afternoon Missionary Meeting.\n\nWe would wish that those farmers who experience any loss by fire this year would please let us know so that we may report the result of their experiments; we would like to get the facts from our readers as to how much the yield.\n\nAs will be seen by an advertisement in another column the Mounted Police are about to receive large quantities of provisions, etc., to be delivered at the barracks here at Athabasca. This is a good chance for the farmers to send in their surplus. Tenders are also asked for, for the erection of transport sheds at the barracks here.\n\nMr. R. T. Goodfellow got back from Winnipeg this week.\n\nWalker & Baker's Black Tea for 40 cents per pound is excellent in flavor and strength. We would advise you to try it.\n\nWigmore's Great Clearing Sale is still going on. Bargains are to be had everywhere.\n\nOn the latter trip of the party from Prince Albert, Mr. Porter and Capt. John McKay, whom he found was suffering from dropsy of the heart and lungs, were obliged to turn back when the doctor felt no improvement whatever.\n\nThe Rev. A. Peters, of Saskatoon, will preach here on the 21st and a public meeting will be held on the evening of the same day when addresses will be given regarding the work of the church in the various mission fields. A collection will be taken up for the church's use. A cordial invitation is extended.\n\nWe have great pleasure in congratulating Capt. Young on his promotion to the rank of major in the Canadian Mounted Police. Capt. Young is a native of Bathurst, New Brunswick, and has served with the 50th Regiment in the Indian mutiny and also in the Mauai rebellion in New Zealand, and is now in the capable hands of Second Expedition.\n\nFor ladies Jackson and Jermy's new line of ladies' underwear is now at Walker & Baker—they are selling at cost.\n\nSubscribe for your newspapers as Cass's Bookseller. Subscriptions received at Walker & Baker's, the Post Office, and Foreign Publications at lowest rates.\n\nADVICE TO MOTHERS.\n\nIf you have a child suffering from rheumatism or your own rheumatic condition, you should take a bath of Mrs. Warren's Remedy. It is a powerful anti-rheumatic remedy. (Registered.) It contains, besides its powerful anti-rheumatic qualities, a large amount of iron and other valuable ingredients. It is recommended as a cure for rheumatism, rheumatic fever, rheumatic pains, rheumatic affections of the joints, and is the prescription of one of the best physicians in the world. Price five cents.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETY\nAT PRINCE ALBERT N. W. T.\nTERMS—50¢ per annum in advance.\nSingle copies 2¢ each.\nIn no case will pages be inserted in this paper. Business local 15 cts. per line.\nTransient advertisements 10 cts. per line.\nNo advertisements will be taken for all other\nquartet insertions.\nNo advertisements under three cents.\nNo advertisements inserted for less than 10¢.\nAdvertisements without instructions will be treated as such.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETY, Proprietor\n\nSUNDAY CHURCH SERVICES\nSt. Alban's Church—10:30 a.m.—Rev. Canon C. J. Macdonald, D.D., Rector.\nCathedral—10:30 a.m.—Rev. Canon C. J. Macdonald, D.D., Rector.\nSt. Andrew's—10:30 a.m.—Rev. Dr. Macdonald, D.D., Rector.\nSt. James'—10:30 a.m.—Rev. Dr. Macdonald, D.D., Rector.\nSt. Matthew's—10:30 a.m.—Rev. Dr. Macdonald, D.D., Rector.\nSt. Mark's—10:30 a.m.—Rev. Dr. Macdonald, D.D., Rector.\n\nTHIS PAPER may be found on\nBOWMAN & Co.'s list at 8c per copy.\nButten's list at 8c per copy.\nWe have contracts to be made for it in NEW YORK.\n\nFRIDAY, OCT. 5, 1888.\n\nTHE EXHIBITION\nThose who have attended the annual exhibitions of the Lorne Agricultural Society during the past five or six years will have noticed a marked improvement each year; but the exhibition held this week was by far the most successful held to date, and would have been considered a fair idea of the capabilities of the district. It is very much to be regretted that owing to our distance from the railway, people from the east are unable to visit our Shows and we are unable to send delegations to examine our crops and other contents. A good exhibit of the products of a district is the best advertisement that a district could possibly have, for the reason that it is the most reliable. The exhibit of thoroughbred and grade cattle shows a great improvement over former years, there being some herds on exhibition which would take a first place anywhere in Canada. Some of our farmers have expended large sums of money in improving their stock and they should not be discouraged if, for some time, they get no adequate return. The display of roots and cereals at this show do much to show what can be done and adapted both for Agriculture and Horticulture, while the dairy products on exhibition could not be surpassed in quality. We are pleased to note the increased interest taken in the exhibition by the farmers, and others, an interest which we earnestly hope will be kept up and which will result to the advantage of the district. It is rather unfortunate that there is no building in the town in which these exhibitions can be held; the Agricultural Society should make an effort to secure land while prices are low and erect a suitable hall; we feel confident that if the matter is pressed hard little, if any, difficulty would be experienced in its accomplishment. We congratulate the Society and its officers on the great success of the exhibition. A full report will appear in our next issue.\n\nWe are happy to state that the difficulty which arose between the Town authorities and the Mounted Police owing to the arrest of the town constable by the latter and which at one time threatened to come before the courts, has been amicably and satisfactorily settled. The Mounted Police will not hereafter interfere in matters over which the town has jurisdiction unless called upon to do so, and as it is as it should be, and will tend to preserve the good feeling existing between Police and citizens.\n\nThe following Call says:\nThere is probably no portion of the North-West Territories so badly in want of railway facilities as the southern part of Assiniboina. During the last few years the settlers have been filling up with settlers who are doing well on the lands which they have taken up, and the result is that the grain is stored in storehouses and the flour is stored in stores. The natural facilities are favorable to success, but owing to the present lack of railway facilities, the settlers are unable to secure a ready market. They have frequently made known their wants and have anxiously looked for relief.\n\nThe above language might be more truthfully used with regard to the District of Saskatchewan; there is no portion of Canada more in need of railway facilities than this district, and the Call should know it, and no district has a better right to expect relief from the government in that respect than ours.\n\nThe Hudson Bay Railway scheme has fallen through and it is not likely that it will be revived for some time. It is to be regretted that the Company did not receive such assistance from the government of the Province of Manitoba as would have enabled them to prosecute the construction of that road to a successful and speedy end. The project of building a railway to Hudson's Bay has been regarded by many people as Utopian, but we believe that it is a question of time when the carrying trade of the North-West will be done through that route. The country may yet reach that stage of prosperity and development that would warrant the opening up of the H. B. route, but as the volume of trade increases and our exports become great, as they surely must, the necessity for that our natural outlet will become more apparent.\n\nThe coroners have had to use one of their rooms in one of their Town Hall for a prison. There are three cells all very strongly and securely fastened, but they lack the convenience of a good matress, a cell and which should be put in.\n\nMr. R. S. McKenzie, wife and family of Deuel were in town Monday. Mr. McKenzie's father, Mr. McKenzie, has been in Prince Albert since his arrival in the country. Mr. McKenzie was on his way to Edmonton when he fell ill and his family thought their travel money would be returned by John Smith's Reserve and pay for the doctor's services or medicines.\n\nThe friends of Mr. Porter will regret to learn of the death of his brother Albert who was a member of the telegraph department. Mr. Porter said \"Ah! left Prince Albert last fall for his home in Nova Scotia where he has had poor health, but now that he is better he was better able to leave for the west where he had an appointment. Since then he was again taken ill, which resulted in his death at Woodside. We extend our sincere sympathy to the Deuel and other members of the family in their bereavement.\"\n\nDepot Post Office Inspector Porter arrived by the last mail stage and has re-established a new order office. Mr. Porter has been very well pleased with the way in which the depot post master handled Mr. Way, conductor of the best train in the west. He said that this is one of the very few offices at which there is seldom, if ever, a mistake made. Mr. Porter said that he could get orders on any many order offices in the world, at rates from ten to fifty cents each, sometimes even more. A gentleman made that an person can get an order for more than $100 in one day, made in favor of the same person.\n\nThe depot post office has been made a Custom post of every office very shortly for books, parcels etc.\n\nHORSE SHOE STORE\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\nFifty Chests Choice Congo Tea\nWhich we will sell until further notice at 75¢ per lb.\nFresh importation in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\nFull Lines of Windowcurtians\nIn Lace, Tapstry and Japanese, Fancy Blinds and Shade Rollers.\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC\nBOOTS AND SHOES ARRIVING WEEKLY\n10,000 CHOICE CIGARS!\nAt Manufacturer's Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS IN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\n\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS In all varieties, from the best manufacturers in the Dominion SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black INK, ALL Sizes—Writing and Copying Office Stationery, etc., etc.,\nTERRITORIAL NEWS\n\nCALGARY.\n\nFrom the Tribune, Sept. 19.\n\nDestructive fires are raging in the Up-\nper Red River Country, Manitoba. Rains\nhave started, but have been turned over and the fires cannot be checked.\n\nThe Blackfoot and Stoney have been\ngoing to the North-West Mounted Police\nfor help to put out these destructive\nfires. Everything seems to be progressing\nfavorably for the Haywood House on the\ncoast of the 26th. The ladies are very\nenthusiastic about the project and will provide all the necessary aid and\nassistance. A committee will be formed\nto purchase the hall with the assistance\nof the local, suitable matters, extravagance,\nand a general good time may be expected.\n\nLETHBRIDGE.\n\nFrom the News, Sept. 19.\n\nThe shaft for the N.W.M. & Co. Ltd\nmine near Lethbridge, Alberta, has been\ndrilled and will be hoisted about a month\nafter an entrance is being worked from the\nmain drift.\n\nA man named Leslie was arrested near\nLethbridge last evening with a charge of whiskey\nin his possession. He had been out for\na long time and was carrying two cases\nof Milwaukee beer and five five-gallon kegs of whiskey was seized.\n\nARNADALE MISSION.\n\nAfter crossing the North Saskatchewan\nRiver the traveller will find himself on\na flat plain, climbing the high bank of\nthe river by the serpentine trail, the\ntraveller will find himself about 200 feet\nabove the level of the river. After\ncrossing the river he will enter the\ncountry, and after travelling about half\na mile he will come to where the trail\nmeets the road leading to the lake\nLake and the other to Arnadale Mis-\nsion, in Montana's Reserve.\n\nThe Missionary Society of Canada and\nArnadale Mission is the largest forest\nfor mixed farming in the Territories. There\nis section after section where it is one\nunbroken forest of pine, spruce, fir,\ncedar and small alder; the soil, is sandy\nloam. There is lots of wood for all pur-\nposes, plenty of water and excellent\npasture for cattle. It is a fine place\nin a year for the farmers of the larger\nsettlements in the district. After a drive\nof about seventeen miles the traveller\nwill see the mission buildings of the reserve\nare seen, and about eight miles farther on\na height is found in the residence of the\nlate Mr. McKay, who built the present\nchapel. The latter was erected about\nthree years ago, and, with the exception\nof a very few Indians, the work was done by the Indians themselves;\nit is a log building with siding on the\noutside, lathed and plastered inside and\nvery attractive. Mr. McKay and his\nson, the Rev. Mr. McKay and his\ndaughter and family are now preparing\nfor the school which they have taken to\nchristianize these Indians and make them\nself-supporting. Miss McKay is the\nschool teacher and has thirty-five pupils,\nall of whom are far advanced for\nthe short time they have had an instruct-\ning teacher. Miss McKay, A. A., says\nthey are taught to sew and knit. Miss\nMcKay has taken two first prizes for the\nbest teaching in all the Indian schools.\n\nThe Indians were working hard, their\ngood crops and their grain all stacked and\nare now waiting for the thresher.\n\nThe people on the reserve are greatly\ninterested over a letter which appeared in\nThe Times about six weeks ago, which\ncalled attention to the fact that the Indians\nwere not doing as much as they could\nfor the reserve, and the Indians were\n\"betting in a reckless way,\" and \"that\nit was time to encourage them to work\nmore for such purposes.\" Next week (this)\nhad \"One Who Was Present\" given\na straight account of the whole proceed-\nings and gave a full report of what was\ndone, for instance, told about the maga-\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's Store.\n\nHaving enlarged our premises to double\ntheir original size, we would respectfully\nattract the attention of the travelling public to\nour establishment.\n\nWell and river water almost at our door.\n\nWe have also some fine cows, horses,\nand other stock for sale at reasonable prices.\n\nNEILSON & McBEATH\n\nSOUTH FROM KNEE TO ANKLE\n\nThis entirely new. Fresh a mass of\nthe finest quality. Grown by\nthe best conditions. Carried by\nthe best horses.\n\nFor three years I was almost crippled with\nthis disease, but now I am well again. It is\nnot only a cure, but a prevention. This\ndisease was one mass of disease. Some\nyears ago I was obliged to give up my\nbusiness because of this disease. Now I\nthink about one third the size of the\ndiseases. I have tried every kind of medicine and got\nno relief except from this. I have used\nthis for three years and have never had\nany trouble since. I am now able to\nwork and enjoy life.\n\nJ. M. CAMPBELL\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of\n\nLUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness\ndensity and quality. The Variety of New Goods in\nEvery Department\n\nIS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nWELLS, RICHARDSON & CO.\n\nIMPROVED Butter Color.\n\nEXCELS IN STRENGTH, PURITY, BRIGHTNESS\n\nAlways gives a bright, pure, smooth, buttery flavor, never\nloses its color, nor does it alter the Buttermilk. Used\nby thousands of the best families in the West. Wells,\nRichardson & Co.'s Improved Butter Color.\n\nTHOMPSON & CO., P.O. Mississauga.\n\nBABY'S skin and scalp preserved and\nprotected from the effects of the cold.\n\nHOW MY BACK ACHES\n\nBack Ache, Kidney Pain, and\nother rheumatic affections. Pain relieved in one\napplication. The most effective and only pain-killing\nremedy.\n\nPaine's Celery Compound\n\nUSES Nervous Provocation, Nervous Weakness, Nervous Indigestion, Liver Complaints, and\nall affections of the Nervous System.\n\nWEAK NERVES\n\nPaine's Celery Compound is a Nerve Food, Protects\nthe Nervous System, and gives the wonderful strength, it\nspeeds up the circulation.\n\nRHEUMATISM\n\nPaine's Celery Compound, proving the\npower of celery to heal and soothe, and\ngives the wonderful strength, it speeds\nup the circulation.\n\nKIDNEY COMPLAINTS\n\nPaine's Celery Compound quickly restores\nthe kidney power. This remedy powers combined with its\ntonic effect makes the best remedy for all kidney complaints.\n\nDYSPHAGIA\n\nPaine's Celery Compound strengthens the\nnerves and gives the nerves of the digestive\nsystem a powerful stimulus so that it cures even the\nworst case of Dyspepsia.\n\nCONSTIPATION\n\nPaine's Celery Compound is a natural\nlaxative, giving easy and natural\nrelief. It is easily digested and immediately ready for\nuse to use.\n\nWELLS, RICHARDSON & CO., P.O. Mississauga.\n\nG. H. CAMPBELL\n\nGeneral Railroad and Steamship Ticket Agent,\n\n471 MAIN STREET, WINNIPEG, MAN.\n\nHeadquarters for all Lines, on orders.\n\nAgents for all Lines, on orders.\n\nA. M. SIMMONS,\n\nWhite Star Line,\n\nLloyd's Liverpool Line,\n\nCunard,\n\nGulf,\n\nOcean,\n\nAnother,\n\nItalian Lines,\n\nand every other line, including the Atlantic and Pacific Ocean.\n\nHolder of Campbell's valuable Gold.\n\nTickets issued on receipt of deposit, and\nTravel Bills and setting down. Book for it.\n\nAGENT FOR ALL LINES, ON ORDERS.\n\nPEAPAY TICKETS\n\nto bring your family to the OM Country, at lowest rates, also\n\nMONEY ORDER AND DRAFTS\n\non all points in Great Britain and the Continent.\n\nBAGGAGE\n\nshipped through to your destination on the ship by which you sail.\n\nWrite for particulars. Correspondence answered.\n\nG. H. CAMPBELL,\n\nAgent.\n\n471 Main St. and C.P.R. Depot, Winnipeg, Man.\nTOWN COUNCIL\n\nA special meeting of the council was held on Friday evening last to consider the action of Const. Leslie, of the N.W.M.P., in interfering with the town council in the discharge of its duties. All the members were present and they decided to prosecute Leslie.\n\nThe Town Council held a regular meeting on Monday night at the Hall. Worship Mayor Blake presiding. The councillors present were: Agnew, Davis-Stewart, Donaldson, Johnston and McPhail.\n\nCOMMITTEE\n\nA communication was received from Sept. Perry re disturbance with the town council. The committee due consideration to the council's failure to maintain order. They reminded them of the very definite instructions given by Sept. Perry in writing to Mr. B. D. Davis to perform their obligations to assist the town constable in every way to preserve the peace in the town, that they would be charged in case of Const. Leslie's actions.\n\nJ. H. Howard, secretary of the Lorne Agricultural Society, asked the council to reconsider the charter of the society. The council went into committee of the whole on this matter and after they came out reported that they had instructed the Lorne Agricultural Society from the funds of the corporation be given to them on condition that they would place an equal amount in a fund for improvement in lands and buildings in the municipality or for some other valuable purpose among expenditures to be made in 1889 or 1890.\n\nRETIREMENT\n\nA petition was received from H.R. Gavrin and others for improvements in the East End which was referred to the Board of Works.\n\nThe Chairman of the Board of Works presented his report after a fine deal of cross firing, in which no one was hurt, the report was adopted.\n\nThe present acting secretary of the A. Society, who had been doing good work towards the interests of the society, went on his way rejoicing when the council adjourned.\n\nDUCK LIKE\n\nAs large, if not the largest, wedding week in this country, both sides of Tuesday night were filled with people. Parents, sons, married, to all of whom Father, eldest daughter of our colony, tenderly gave her hand. The day and evening dancing was continued and kept up. Over 300 persons took part in the festivities.\n\nMr. Bonomi, D. L. S., is here, but your correspondent cannot account for what business. Rumour has it that he is making some plans for the future.\n\nBy now many more reports have been going the rounds that Mr. John Macdonald would be at the clocks Sunday next and people are looking forward to such an event.\n\nYou have no doubt noticed that grain from this district has taken first prize at your exhibition. It is now being fed to the flour ground here. We are sorry to note that some of our cattle have not been exhibited.\n\nOur mill has ceased running for three weeks to make necessary repairs made and to put in some new machinery and another effort will be made.\n\nThe many friends of the Rev. Mr. Kay, of Snake Plain, will be pleased to hear that he is recovering greatly improved and he is now recovering fast.\n\nAt the rifle range, on Saturday last, the postponed match from the regular meeting was shot off, the first prize list being the highest score of the day, and was competed by by those members who did not win a prize at the annual meeting. Other prizes were awarded for the match which wholly collected by Mr. John Stewart, who deserves great credit for encouraging the sport and for his crack shots.\n\nThe following rifles were used in the period in the order named: Const. Cameron, T. N.; Const. Taggart, Const. Maclean, J. D.; Mr. Mavor, Const. Johnston, T. N.; Mr. Johnson, J. Sinclair; J. Sanderson, T. N.; Campbell, W. H.; Hughes, H. W.; Newlands and J. Hughes. The highest score was by Hughes Match which was shot at a re-feeding target, 200 yards distance with similar scores by Const. Cameron assisted by Sheriff Hughes, was won by Sergt. Parker, who made the very good score of 75 points, thus allowing the team match against Maclean's team off in which the Saskatchewan association were third, and for the second time with a score of 74 points against 76 points for Maclean.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nW. STOBART & CO.\n\nIndian Traders\n\nGeneral Merchants\n\nPrince Albert and Duck Lake\n\nSASK.\n\nRUSSELL & DAVIS\n\nWHOLESALE AND RETAIL\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham and\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\n\nHOTEL STREET.\n\nPRINCE ALBERT\n\nBREWERY\n\nPure and Sparkling\n\nAMBER---Hop---ALE\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERARD\n\nGet Your SCHOOL SUPPLIES\n\nAT CANN'S BOOK STORE\n\nADVERTISERS can learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Rowell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York City.\n\nDonaldson & Pembroke.\n\nRUFFALO HALL!\n\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\n\nNow in stock will be sold\n\nFOR TWO WEEKS ONLY\n\nAT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne\n\nR. C. W. & CO.\n\nAll parties indebted to R. C. Wigmore & Co. are requested to make an immediate settlement.\n\nInterest charged on all overdue accounts.\n\nR. C. Wigmore & Co.\n\nONE MORE Great Clearing Sale.\n\nFOR THE Best Assorted Stock of CONFECTIONERY\n\nGO TO H. McDougall's\n\nBAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall\n\nGO TO AGNEW'S FOR\n\nStoves\n\nStoves\n\nHeating Drums\n\nStovepipe Coal Oil\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888100501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 7439, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8413, 1], [8413, 16712, 2], [16712, 24318, 3], [24318, 29908, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]