[{"id": "efcdfeb4e7a3c9d729024b7efaf5fe1dc3f40bc5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPUBLIC MEETING\n\nA mass meeting of the Settlers of Prince Albert and vicinity will be held on Tuesday afternoon, the 16th inst., at 4 p.m., in the new College Lecture Room, which has been recently built on the Mission grounds, and will be opened for use this evening by Rev. John H. Davis. The meeting will be addressed by the Rev. Mr. Davis.\n\nSettlers' Union\n\nThe question of whether or not a Union should be formed among the settlers of Prince Albert and vicinity was discussed at a meeting this morning, and a motion was carried that a committee be appointed to draft a constitution and rules for the proposed union.\n\n$100 REWARD\n\nOn the trail between Wolverine Creek and the Salt Plain, on Monday, 3rd day September\n\nA pocketbook containing Eight Hundred and Forty-five Dollars and some Papers, valued at $350.\n\nJohn B. Dunlop, M.D.,\nLucie of the Royal College of Surgeons,\nand Lady of the King's and Queen's College of Physicians, Ireland.\n\nRETURN OF THE BISHOP\n\nFrom a Visit of Ten Years.\n\nHis Lordship the Bishop of the Basque of Winnipeg returned to Prince Albert on Friday afternoon after an extended visit to the populous parts of the North-West Territories.\n\nHe has been absent more than two months, and has visited every part of the North-West, from Fort Macleod to Edmonton, visiting many places and making good work in each place. He has been very successful in his missionary efforts, and has accomplished much good work in the midst of the aboriginal population. He has visited many places in the North-West, and has impressed many with his teaching and preaching.\n\nthe following was taken from the Baptistical Chronicle:\n\nThe Bishop was received by the Indians of the Abenaki tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Micmac tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Iroquois tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Attikamek tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Montagnais tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Huron tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Ojibway tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Cree tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Assiniboine tribe, who met him at the mission field and greeted him with great enthusiasm. He was received by the Indians of the Sioux tribe, who met him at the mission field and greeted him with great enthusiasm.\n\nWilliam W. Scott,\n\nPRINCE ALBERT\n\n Burrill & Mason, Solicitors, etc.\n\nPHILIP ALBERT, S.W.T.\n\nPRINCE ALBERT CURLING & SKATING RINK Co.\n\nNOTICE\nAll parties holding unclaimed stock in the Provincial Bank, who have not disposed thereof, shall be considered as having waived their claim thereto.\n\nOCTOBER 20TH, 1883\n\nAll unclaimed stock of the above date will be sold for cash at Prince Albert.\n\nThe Grand Central Restaurant\n\n(Old Woodbine Saloon)\n\nThis new Restaurant has been opened and is now ready for business.\n\nMEALS AT ALL HOURS.\n\nTHOMAS ORAM PROPR.\n\nTHE CHURCHES\n\nMonday morning the regular service of the Presbyterian Church at Prince Albert was conducted by Mr. Maclean, assisted by Mr. Bean and Mrs. Bean.\n\nThe Methodist Church was attended by a large congregation, who sang many hymns and prayers.\n\nThe Catholic Church had a large attendance, who enjoyed the services of their priest.\n\nTHE PRINCESS ALBERT TIMES AND SASKATCHEWAN REVIEW\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, OCTOBER 10, 1883.\n\n$2 50 A YEAR.\nWEDNESDAY, OCTOBER IO, 1883\n\nTHE PRINCE ALBERT TIMES\n\nWednesday, October 10, 1883\n\nTHE DISTRICT COURT.\n\nThe usual time for holding the annual meetings of the Saskatchewan District Court, which opens at 9 o'clock this morning, has fortunately been arranged so as to hold the proceedings here. We have heard from the Clerk that no warrant had been issued to the Court contrary to our expectations that Mr. Richardson's late judge would be transferred to Regina; but nobody has yet heard of his successor having been appointed.\n\nIt seems that something was known about it. We understand that the Court was arranged to be held on the 2d of June last, and by its action we are issued returnable, and just as the last moment word was received from him that he was attached by Governor Dewar, Mr. Bonneville's going had to be postponed, and matters and their witnesses had to be sent back to Regina at an enormous expense. We understand that a difference of opinion among members as to whether the warrants issued for the August Court and returnable ones are good for the October sittings. Some who do not think they are are issuing arrest warrants where others hold them to the old one. There is confusion existing and somebody will have to pay the piper. It is about time that the Clerk received instructions on this point so that there will not be confusion in the coming weeks.\n\nCANCELLATION OF HOME STEADS.\n\nThe old system of cancellation of home steads, under which some do not feel they have any claim, has been given up. Claims have been made and \"jumped,\" some have joined, and no doubt the new legislation will ensure that going forward parties to those claims must be held to account.\n\nCONSERVATIVES SPEAK.\n\nA meeting of the Conservatives of Moose Jaw was held on Monday evening, the 9th inst., at which resolutions were adopted condemning the actions of the Dominion Government regarding the land policy. It was also resolved that the government be memorialized by the Conservatives of that place, asking the government to grant an immediate solution of the land question. This has been done extensively on behalf of the government having removed thirty-six square miles for public purposes—an amount of land that is being changed daily at a cost of more than $2,000 per acre.\n\nAlthough much of what has now become an enormous interest is publicly significant, the situation has become quite critical on the part of the settlers who hold land at a rate exceeding $200 per acre.\n\nThis will continue until the land has been removed from the market, and although there are many who believe the land could still be bought at a lower rate, there may soon be none available.\n\nTO BE TAKEN UP.\n\nThe Bill King question is to be dealt with once taken over and settled in the manner demanded by the Minister of Justice. He says so in the Regina Leader, and as we understand the matter, there has been a demand that the land be returned at an early date.\n\nThe farmer who has bought land at a lower price is the only one who can benefit from this arrangement, and it will be seen that the matter has been brought into focus by the recent events.\n\nNOTICE\n\nIn the affairs of the past period the position of the Indian Agent has been announced, and we believe that this will benefit the settlement in this district.\n\nNotice\n\nManitoba Weekly Free Press.\n\nThe Largest Paper in Canada!\n\nThree Handsome Cash Prizes\n\n$500-$200-$100\n\nBURRAGE HALL LEADS AGAIN.\n\nOur Great Selling Sale is still going on, and for a few days more we will offer all our Dry Goods at Cost, Ready-made Clothing, do Gent's Furnishings, do., Ladies' Furnishings, do., Infants' Clothing, do.\n\nGROCERIES\n\nAt Greatly Reduced Prices. All for Spot Cash.\n\nWe give facts only. Examine Stock and Prices.\n\nBETTS & GWYNNE.\n\nCITY AUCTION MART\n\nMARKLEY & ORR,\n\nReal Estate and General Agents—sole Agents in this district for the Celebrated New York Singer Sewing Machines\n\nHUGH J. MONTGOMERY, KNOX & BARKER, Auctioneer, Etc.\n\nJob Work Promptly Attended To.\n\nPoveshell Estimates Furnished when Desired.\n\nMACLAREN'S No. 68, THE MONARCH OF THE WEEKLIES.\n\nThe Newest and Most Complete Weekly in Canada.\n\nPrice 25¢.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGrand Beer and Cigars always on hand.\n\nGreat Bowling Stable in connection.\n\nR. O'LEARY, Proprietor.\n\nFarmers' Restaurants.\n\nMeadow Lawn, Young's Lake, Riding Club, etc., etc., etc.\n\nHow to Subscribe.\n\nEnclose TWO DOLLARS in Registered Letter (writing name of Subscriber and Post Office very plainly) addressed \"FREE PRESS,\" WINNIPEG, MANITOBOR.\nTHE PERMIT DRINKER.\n\nA writer in the Fort Macleod Herald has the following with reference to the subject:\n\n\"It is useless to explain that there is no North West, and that the permit system is a complete failure.\"\n\nMEDICAL HALL.\n\nT. E. JACKSON.\n\nGeneral Merchants.\n\nPrince Albert.\n\nTRY HUGH MCDougall's BREAD!\n\nHugh McDougall,\n\nEast End Bakery.\n\nLorraine Patrick, D.L.S.\n\nTimber Limits Surved and all kinds of surveying done on shortest possible notice.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nFARMERS ATTENTION!\n\nPublic Notice is hereby given that the land of the Dominion Land Company is now open for settlement under the terms of the Act.\n\nWatches, Clocks and Jewellery.\n\nR. B. WAY,\nTHD OLD PRINTER\n\nA printer stood at his press one night\nAnd the wind was blowing loud and wild;\nThe weary wind was howling without,\nAnd the snow fell fast and fast.\n\nHe sat there all alone, with books of snow\nAnd looked at the fasting clock.\nHe watched the clock as the hands creep slow,\nKeeping time with his soul-like tick.\n\nAt last there came a type with a weary click,\nIn his red rose-enameled stick.\n\nHis hair was as white as the fallen snow,\nAnd silently day by day\nHe held them there with grim, like the snow.\nOne by one, passing away.\n\nThe sea was tossing through ferroes deep in his brow.\nHe heard no sound but this.\nAnd his heart's Roman name could almost\nReply to his grey bearded chin.\n\nAnd with dignity he sat and wrote on,\nKneeling down with his head in his hand.\nHe gathered the type with a weary click,\nIn his red rose-enameled stick.\n\nFor many long years, through joy, through tears,\nThat old printer times \"battered face.\"\nAnd slowly day by day\nHe held them there with grim, like the snow.\nOne by one, passing away.\n\nBut now there came a type with a weary click,\nIn his red rose-enameled stick.\n\nAnd his heart's Roman name could almost\nReply to his grey bearded chin.\n\nAnd with dignity he sat and wrote on,\nKneeling down with his head in his hand.\nHe gathered the type with a weary click,\nIn his red rose-enameled stick.\n\nManitoba Legislature in Exile.\n\nWinnipeg M. P.'s on the rampage. A dangerous trend.\n\nOn Tuesday evening a special train brought from Regina about 9:30 p.m., the members of the quasi-parliament who had been ordered by the government to meet at Winnipeg for the session. Mr. Neepay opened the proceedings, and the North West Council, the Mounted Police, and the Mounted Police, Col. Hartshorne followed and replied for his Mounted Police. Then Mr. Killean proceeded to make a speech, followed by the names of W. White, M. N. W. C. Hayter Reed, M. N. W. C., and Adjutant Murray. Mr. Neepay made a most excellent speech. Mr. Hayter Reed followed, and then Mr. Cotton made a very good speech, fluent and clever. Mean while the other members were talking Charles Lamb, in making some guests to a party. Mr. Neepay made a literary conversation till nine o'clock, then the meeting will continue. In due time the fighting persisted. The speeches were common, and the ladies present continued until the party got on board the train and parted afterwards. There was a great deal of noise among the racks and near the station. Among the episodes was Martin, the M. P. for Portage la Prairie, who spoke at a certain Winnipeg point against a certain Martin, saying that he would not allow anyone to be hanging on and having no right to the name of Martin. Mr. Neepay said, \"I will put you in prison if you act this manner.\" Then Mr. Neepay said, \"I will hang on and have the name Martin, and Mr. Neepay said, \"I will hang on and have the name Martin, and Mr. Neepay said, \"I will hang on and have the name Martin.\"\n\nFIRE! J. L. JOHNSON & CO.\n\nFIRE! Powder, Shot, Guns, Harvest Tools, Building Hardware, Plaster and Plastering Hair.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHORSE SHOE STORE,\n\nCAMPBELL'S BLOCK.\n\nFALL POETRY.\n\nHis autumn smile with the cold,\nHis gloom well may old Frost take hold;\nFor in this distant northern clime\nHe cannot feel his winter cold.\n\nWhen autumn comes he turns the leaves\nAnd covers the fields with yellow leaves\nAnd makes the trees bare so soon,\nThe trees man calls at the door.\n\nMy twigs they are the very best,\nThey hang up high in the trees,\nTheir limbs so strong, yet so light,\nTheir limbs so strong, yet so light.\n\nThey hang up high in the trees,\nTheir limbs so strong, yet so light.\n\nTHOMAS O. DAVIS.\n\nHUDSON'S BAY CO'Y FARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO TOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goucher, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. DRYGIES, Land Commissioner.\nCOMMUNICATIONS.\n\nBREWERY LICENSES.\n\nTo the Editor of the Times,\n\nSir,—I notice in your issue of the 23rd September, a letter addressed to the subject of Brewery Licenses. I would be glad to express a few of my views on the subject. Your correspondent states that the legislature has no power to make any regulations that shall be sold in places licensed for the purpose, namely beer shops and saloons, and that it cannot be the intention of the Act of a license being granted, but could distinctly state therein, that beer was only to be sold to travelers, and not to housekeeping families for private use only, and not for sale. Moreover a brewer's license contains the brewer's name only, and he may not retail any beer by the glass, therefore a brewer's license does not constitute a licence being granted for saloon purposes.\n\nAs regards the Indian population, the lawgiver very severely punished those who committed the offence of them with beer, and although I have known the Indians to go to the brewer's for beer after dinner, they were never found drunk at that time; and although they drank beer, they were quietly told how dangerous it was for them. A brewhouse would be of great assistance here, helping to keep out the bad influences which are so prevalent among the Indians, and would abolish the the use of extracts and essences which are present in such abundance among the Indians, and which would be of great advantage to the unmarred Indians, who have to do their own cooking. If the Indians were provided with a place where they could boil their tea, or if they had a small bag of beer, they would be able to make tea for their own use and that of others, instead of purchasing it from the traders doing the same trade, and thus saving them money. The Indians would be able to save money, and would be able to purchase goods which they could not otherwise afford.\n\nIn conclusion, I would say that the brewhouses should be encouraged, and that the Indians should be encouraged to purchase goods which they could not otherwise afford.\n\nYours respectfully,\n\nE. C.\n\nKicking Horse Pass.\n\nJust as we go to press we learn that the Kicking Horse Pass is now closed, owing to the snow which has fallen on the Devil's Head chain. This will only make a difference of about eight miles, and will not materially affect completion. (Signed) E. C.\n\nBAKING POWDER.\n\nROYAL\n\nABSOLUTELY PURE.\n\nThis Powder never cakes. A most powerful preservative. Made of pure, strong and wholesome materials. Milled and packed under the supervision of chemists. Guaranteed to be free from all adulteration. No foreign starch or flour used. Royal Baking Powder Co., Prince Albert, N.W.T.\n\nLOST.\n\nOn the night of Sept. 6th, William Jackson, a young man living near here, was missing. He was last seen going into the woods. Any information regarding his whereabouts will be appreciated.\n\nFURNITURE.\n\nJust arrived. In addition to our former large stock we have received some Fancy Parlor and Bedroom Sets. Give us an order and see our Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all Descriptions. Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nC. & G. E. CARTER,\n\nSTOVES\n\nJUST RECEIVED\n\nFox Stoves Cook Stoves Parlor Cookers Parlor Heaters Drum Stoves & Stovepiping Made to Order at T. J. ACNEW'S Wholesale and Retail.\n\nJAMES SINCLAIR\n\nMerchant Tailor,\n\nHas just received his new stock of Spring & Summer Goods, and is prepared to supply his numerous customers with Suits to please the fancy of all.\n\nUNDERGLOTHING\n\nA fresh supply of stylish Soft and Hard Felt Hats.\n\nGive me a call.\n\nJ. SINCLAIR.\n\nO. E. HUGHES\n\n& CO.,\n\nGeneral Merchants AND Indian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nPrince Albert, General Merchants.\n\nSTEWART & WOOTTON,\n\nWholesale and Retail.\n\nSaskatchewan.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nThe Prince Albert Curling and Skating Club.\n\nA meeting of the members of the curling club was held at the office of Mr. Waggner, Tuesday afternoon, when the following officers were appointed: President, Mr. J. Johnson; Vice-President, Mr. James Sinclair; and Secretary, Mr. T. O. Davis. At a later date, Mr. Sinclair will be elected President, and Mr. Davis will be appointed Secretary. Hon. Mr. Macdonald, Vice-President, James Sinclair, and Mr. Davis, Trustees.\n\nThe officers were requested to appoint a committee to propose the ground and to select a suitable location for the same. The committee will also be requested to make arrangements for the erection of the new building.\n\nMr. Sinclair has been appointed Chairman of the committee, and Mr. Davis will be his assistant. The committee will meet next week, and will report its findings to the club. It is anticipated that the new building will be completed by next spring.\n\nThe committee will also be requested to make arrangements for the erection of the new building. Mr. Sinclair has been appointed Chairman of the committee, and Mr. Davis will be his assistant. The committee will meet next week, and will report its findings to the club. It is anticipated that the new building will be completed by next spring.\n\nWEDNESDAY, OCTOBER 10, 1883.\n\nTHE NORTH WEST COUNCIL.\n\nWANTED.\n\n$5 REWARD.\n\nA BAY PONY LOST.\n\nWhite face, 26 year old horse.\n\nThe above reward will be paid on delivery.\n\nJ. Lestock Reid.\n\nPRINCE ALBERT, Oct. 8th, 1883.\n\nBOOTS AND SHOES CHEAP.\n\nWe have the best assorted stock of Boots and Shoes in Prince Albert, and are selling at prices which defy competition.\n\nCUSTOM WORK.\n\nREPAIRING.\n\nPromptly attended to.\n\nSHANNON & MCLEOD FOR SALE.\n\nLumber Wagon, Mower and Hay Rake, Democrat Wagon, Horse and Single Harness.\n\nAll in good order.\n\nFor sale. Terms easy. The above is the property of C.K. Lowery. To be sold by J.J. Campbell's Blacksmith Shop.\n\nI would respectfully inform the people of Canada Southern and Credit Valley Railways, that I have purchased the business of Mr. Donald Mciver, late of St. Thomas, Ontario, Canada.\n\nUNITED STATES Life Insurance Co., Ltd.\n\nLife Insurance Co., Ltd.\n\nESTABLISHED 1847.\n\nDeposit with Dominion Government $1,000,000.\n\nOffice, Bird Rock, 439 Main St.\n\nJ.G. MAGUIRE, Provincial Manager.\n\nThis company has policies unequalled for safety, for liberality and freedom from all risk.\n\nJOHN F. BETTS Agent.\n\nTHE FIRST INSTALLMENT OF A LARGE STOCK OF Mowers and Rakes\n\nFrom the celebrated Watson Manufacturing Co., of Algoma, Ont.\n\nBuford Breakers\n\nHave arrived at the Implement Department of Jackson & Co., and are ready to arrive.\n\nThe Lion Reaper,\n\nMowery Fanning Mills,\n\nWheat Harrows and Buford Cross Ploughs\n\nAll these goods are guaranteed to give satisfaction.\n\nPatent wheat reapers will do well on any land, and will cut and carry away their own chaff.\n\nA. SPROAT.\n\nJackson & Co., Prince Albert, N.W.T.\n\nJACKSON & JACKSON\n\nCanada Pacific Ry Co.\n\nWestern Division.\n\nCHANGE OF TIME.\n\nOn and after June 29th, trains will be changed as follows:\n\nGoing East\n\n7:30 a.m. (via Winnipeg) arr. 6:30 p.m.\n\n12:30 p.m. Brandon.\n\n2:22 p.m. Regina.\n\n6:10 p.m. Moose Jaw.\n\n10:20 p.m. Saskatoon.\n\n12:20 a.m. Edmonton.\n\nGoing West\n\n7:30 a.m. (via Winnipeg) dep. 4:30 p.m.\n\n12:30 p.m. Brandon.\n\n2:22 p.m. Regina.\n\n6:10 p.m. Moose Jaw.\n\n10:20 p.m. Saskatoon.\n\n12:20 a.m. Edmonton.\n\nJ. H. HIGHLAND, Gen. Traffic Manager.\n\nT. W. TEASdale, Gen. Passenger Agent.\n\nSt. P., M. & M. Railway.\n\nTime Table.\n\nExpress leaves St. Vincent at 11 a.m., arriving at St. Paul at 4 p.m.; leaves St. Paul at 11 a.m., arriving at St. Vincent at 4 p.m.; expresses between St. Paul and Grand Forks, with connecting trains to Winnipeg.\n\nTrain leaves St. Paul for Brandon at 11 a.m., arriving at St. Vincent at 4 p.m.; train leaves St. Paul at 11 a.m., arriving at St. Vincent at 4 p.m.; expresses between St. Paul and Grand Forks, with connecting trains to Winnipeg.\n\nTrain leaves St. Paul for Brandon at 11 a.m., arriving at St. Vincent at 4 p.m.; train leaves St. Paul at 11 a.m., arriving at St. Vincent at 4 p.m.; expresses between St. Paul and Grand Forks, with connecting trains to Winnipeg.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883101001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 5448, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3960, 1], [3960, 8506, 2], [8506, 9272, 3], [9272, 13716, 4], [13716, 17556, 5], [17556, 21775, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]