[{"id": "955d5d038270cf922dc35666253460a46119af5a", "text": "EDITORIAL NOTES.\n\nIt appears from a parliamentary return made by the British Government that the total number of persons killed in Ireland during the last four years was thirty-one, of whom seven were killed in 1883. The amount of compensation awarded to the heirs of the victims was £15,000. The amount to be paid to the relatives of those who were killed or injured is fixed by the Lord Lieutenant and is rated at £200 per case, although the family of the deceased in which the injury is done. It will be seen therefore, that Ireland does not get all her amends for nothing.\n\nSpain seems to have a better mode of putting her discontented criminals to death than have some other countries. In Spain, the prisoners are executed by firing squad, and the bullets used are specially designed for this purpose. They are made of lead, and are pointed at both ends. When the prisoner is shot, the bullets pass through his body and explode inside, causing instant death.\n\nThe Woman Physician.\n\nThere is a great medical work for women doctors. Every woman physician who makes a study of this book will find it invaluable. It contains practical advice on how to treat various ailments, as well as information on how to care for oneself and one's family.\n\nCHOERA.\n\nThis dreadfully epidemic is among the most dangerous diseases known to man. It is caused by a bacillus which is extremely contagious and can be spread easily through contact with infected persons or contaminated water. The symptoms include fever, vomiting, diarrhea, and dehydration. Treatment involves administering fluids and antibiotics to prevent complications such as shock and kidney failure.\n\nJAMES SINCLAIR\n\nMerchant Tailor.\n\nJ. O. DAVIS\n\nGeneral Merchants\n\nSask.\n\nTHE WEST END HOUSE.\n\nOpen Door to All.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nEast End Bakery.\n\nBread unsurpassed by any west of Winnipeg.\n\nNine Loaves for $1.\n\nHugh McDougall\n\nEast End Bakery.\n\nPUBLIC NOTICE.\n\nAll persons are hereby notified that it is now possible to purchase land in the district of Dundurn, near the town of Dundurn. The land is being sold without authority by public auction, and anyone interested should apply to the Interior Minister for details.\n\nFURNITURE.\n\nJust arrived. In addition to our large stock of furniture we have:\n\nFancy Parlor and Bedroom Sets.\n\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\n\nChairs of nearly all descriptions.\n\nCradles & Cribs for the Babies.\n\nRocking Chairs for the Ladies.\n\nMattresses Single & Double to suit Customers.\n\nG. & C. E. CARTER,\n\nKNOX & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER.\n\nWells Sunk and Pumps Made and Repaired.\n\nOrders sent to J. L. Johnson & Co., will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert.\nCORRESPONDENCE.\n\nLOUIS RIEL VISIT.\n\nLouis Riel visited Prince Albert on July 18, 1884. He discussed the situation in the North-West Territories with Prime Minister Macdonald. Louis Riel expressed his concern about the treatment of the Métis people and the government's actions regarding the Red River Rebellion.\n\nLOST AND FOUND.\n\nNew Spring Goods.\n\nJ. H. Campbell's\n\nDry Goods and Groceries\n\nStoves, Ploughs, etc.\n\nNEW GOODS!\n\nMEDICAL HALL.\n\nDRUGS, SPICES, FANCY GOODS.\n\nAtkinson's Perfumery, Lubin's and Lamberton's Perfumery, Pear's and Colgate's Fancy Soaps, Hair Dressing, Scott's Electric and Infants' Celluloid, Horn and Glandolin Tooth Brushes, Tooth Picks, Brass Pumps, Tin Pots, Bottles, Etc.\n\nT. K. JACKSON,\n\nAT THE OLD STAND.\n\nWATCHES, LOCKS, TOOLS, ETC.\n\nR. B. WAY,\n\nPUMPS!!\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nNOTICE.\n\nThe Department of Indian Affairs has announced that the Government will provide free land to settlers in the North-West Territories. The land will be surveyed and divided into sections of 160 acres each.\n\nWILLIAM CROSS,\n\nBOOTS AND SHOES CHEAP.\n\nBoots AND Shoes\n\nCUSTOM WORK\n\nREPAIRING\n\nSHANNON & McLEOD\n\nPRINCE ALBERT, SASK.\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings, Ready-made Clothing and Table Oil Cloths, Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Bonanza Smoking Tobaccos.\n\nPure Lime Juice and Fruit Syrups.\n\nNOTICE!\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that after June 30th their terms will be net cash to all who do not make satisfactory settlement of their accounts to that date.\n\nN.B.—A good supply of American Coal Oil now on hand.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc.\n\nOrders for Books (transatlantic, British, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert—N.W.T.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, PROPS\n\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884071801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 1418, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2860, 2], [2860, 2860, 3], [2860, 5301, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]