[{"id": "133b22fc29d0793bc987bca06a6b0c549e06c065", "text": "**FRIDAY, APRIL 13, 1867**\n\n---\n\nTHE PRINCE ALBERT TIMES\n\nAND SASKATCHEWAN REVIEW.\n\nPUBLISHED BY\n\nJ. D. MAVEETY\n\nAT PRINCE ALBERT N.W.T.\n\nTERMS.—25¢ per annum in advance.\n\nSingle copies, 5¢ each; post free.\n\nIn no case will pages be inserted in this paper which are not paid for in full.\n\nNo advertisement inserted for less than $1.\n\nAdvertisements without instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVETT, Proprietor.\n\n---\n\nSUNDAY CHURCH SERVICES\n\nST. ALTIN'S AND ST. MATTHIAS' PARISHES.\n\n(From Thursday) 6th May—Sunday Services conducted by Rev. A. W. Hume.\n\nSt. Matthias' Church—8.45 a.m.—Rev. Canon PFEIFFER.\n\nSt. Patrick's Church—9 a.m.—Rev. Mrs. Macdonald.\n\nSt. Andrew's—10.30 a.m.—Mr. Maurice.\n\nSt. John's—1 p.m.—Mr. Skelly.\n\nSt. Joseph's—4 p.m.—Ven. Archdeacon McKay.\n\nSt. Peter's—5.30 p.m.—Rev. Mrs. Macdonald.\n\nSt. Paul's—6.15 p.m.—Rev. Mrs. Macdonald.\n\nMethodist Church—St. David's—Rev. Prichard.\n\nLucas and Webster—9 a.m.—Rev. Mrs. Smith.\n\nEmu Church—Rev. Wilson.\n\nEnd—Rev. C. C. STEPHENSON, Pastor-in-Charge.\n\n---\n\nTHIS PAPER MAY BE FOUND ON EVERY HAND IN BOUDOIR AND NEWSPAPER.\n\nNewspaper Advertising Bureau\n\nFamous Newspaper Advertising Bureau.\n\nOur newspaper advertising bureau offers our advertisers the best facilities for placing contracts not only in Canada but in all parts of North America.\n\n---\n\nFRIDAY, MAY 13, 1867.\n\nTHE LIQUOR QUESTION.\n\nThe Calgary Club, of the Irish club, was met for breakfast on April 3rd.\n\nIn no place in the Northwest, perhaps, are the evils of the present system so strikingly prominent as in Calgary.\n\nIt has been said that no place is more evil than Quebec, and mention made of its saloon and gambling houses.\n\nThat is true, but Calgary holds an equal or an even greater preponderance of these evils.\n\nThe Vice-Bishop visited Calgary last year and spoke from the pulpit against the consumption of liquor.\n\nThe Catholic ladies of Calgary have formed an association to promote temperance among their members.\n\nThe question now arises, How can we combat the vice? What is the best plan?\n\nThe Catholic ladies have taken a direct stand against liquor.\n\nThey have held public meetings and have petitioned the government for legislation.\n\nThey have also formed an association to assist in the formation of temperance societies.\n\nThe question now arises, How can we combat the vice? What is the best plan?\n\nThe Catholic ladies have taken a direct stand against liquor.\n\nThey have held public meetings and have petitioned the government for legislation.\n\nThey have also formed an association to assist in the formation of temperance societies.\n\n---\n\nTHE PRINCE ALBERT TIMES\n\nAND SASKATCHEWAN REVIEW.\n\nPUBLISHED BY\n\nJ. D. MAVEETY\n\nAT PRINCE ALBERT N.W.T.\n\nTERMS.—25¢ per annum in advance.\n\nSingle copies, 5¢ each; post free.\n\nIn no case will pages be inserted in this paper which are not paid for in full.\n\nNo advertisement inserted for less than $1.\n\nAdvertisements without instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVETT, Proprietor.\n\n---\n\nSUNDAY CHURCH SERVICES\n\nST. ALTIN'S AND ST. MATTHIAS' PARISHES.\n\n(From Thursday) 6th May—Sunday Services conducted by Rev. A. W. Hume.\n\nSt. Matthias' Church—8.45 a.m.—Rev. Canon PFEIFFER.\n\nSt. Patrick's Church—9 a.m.—Rev. Mrs. Macdonald.\n\nSt. Andrew's—10.30 a.m.—Mr. Maurice.\n\nSt. John's—1 p.m.—Mr. Skelly.\n\nSt. Joseph's—4 p.m.—Ven. Archdeacon McKay.\n\nSt. Peter's—5.30 p.m.—Rev. Mrs. Macdonald.\n\nSt. Paul's—6.15 p.m.—Rev. Mrs. Macdonald.\n\nMethodist Church—St. David's—Rev. Prichard.\n\nLucas and Webster—9 a.m.—Rev. Mrs. Smith.\n\nEmu Church—Rev. Wilson.\n\nEnd—Rev. C. C. STEPHENSON, Pastor-in-Charge.\n\n---\n\nTHIS PAPER MAY BE FOUND ON EVERY HAND IN BOUDOIR AND NEWSPAPER.\n\nNewspaper Advertising Bureau\n\nFamous Newspaper Advertising Bureau.\n\nOur newspaper advertising bureau offers our advertisers the best facilities for placing contracts not only in Canada but in all parts of North America.\n\n---\n\nFRIDAY, MAY 13, 1867.\n\nTHE LIQUOR QUESTION.\n\nThe Calgary Club, of the Irish club, was met for breakfast on April 3rd.\n\nIn no place in the Northwest, perhaps, are the evils of the present system so strikingly prominent as in Calgary.\n\nIt has been said that no place is more evil than Quebec, and mention made of its saloon and gambling houses.\n\nThat is true, but Calgary holds an equal or an even greater preponderance of these evils.\n\nThe Vice-Bishop visited Calgary last year and spoke from the pulpit against the consumption of liquor.\n\nThe Catholic ladies of Calgary have formed an association to promote temperance among their members.\n\nThe question now arises, How can we combat the vice? What is the best plan?\n\nThe Catholic ladies have taken a direct stand against liquor.\n\nThey have held public meetings and have petitioned the government for legislation.\n\nThey have also formed an association to assist in the formation of temperance societies.\n\nThe question now arises, How can we combat the vice? What is the best plan?\n\nThe Catholic ladies have taken a direct stand against liquor.\n\nThey have held public meetings and have petitioned the government for legislation.\n\nThey have also formed an association to assist in the formation of temperance societies.\n\n---\n\nTHE PRINCE ALBERT TIMES\n\nAND SASKATCHEWAN REVIEW.\n\nPUBLISHED BY\n\nJ. D. MAVEETY\n\nAT PRINCE ALBERT N.W.T.\n\nTERMS.—25¢ per annum in advance.\n\nSingle copies, 5¢ each; post free.\n\nIn no case will pages be inserted in this paper which are not paid for in full.\n\nNo advertisement inserted for less than $1.\n\nAdvertisements without instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVETT, Proprietor.\n\n---\n\nSUNDAY CHURCH SERVICES\n\nST. ALTIN'S AND ST. MATTHIAS' PARISHES.\n\n(From Thursday) 6th May—Sunday Services conducted by Rev. A. W. Hume.\n\nSt. Matthias' Church—8.45 a.m.—Rev. Canon PFEIFFER.\n\nSt. Patrick's Church—9 a.m.—Rev. Mrs. Macdonald.\n\nSt. Andrew's—10.30 a.m.—Mr. Maurice.\n\nSt. John's—1 p.m.—Mr. Skelly.\n\nSt. Joseph's—4 p.m.—Ven. Archdeacon McKay.\n\nSt. Peter's—5.30 p.m.—Rev. Mrs. Macdonald.\n\nSt. Paul's—6.15 p.m.—Rev. Mrs. Macdonald.\n\nMethodist Church—St. David's—Rev. Prichard.\n\nLucas and Webster—9 a.m.—Rev. Mrs. Smith.\n\nEmu Church—Rev. Wilson.\n\nEnd—Rev. C. C. STEPHENSON, Pastor-in-Charge.\n\n---\n\nTHIS PAPER MAY BE FOUND ON EVERY HAND IN BOUDOIR AND NEWSPAPER.\n\nNewspaper Advertising Bureau\n\nFamous Newspaper Advertising Bureau.\n\nOur newspaper advertising bureau offers our advertisers the best facilities for placing contracts not only in Canada but in all parts of North America.\n\n---\nMR. JUSTICE MCGUIRE.\n\nSpeaking of the judge appointed for this district, Mr. Justice Why (Liberal) of the 25th, says:\n\n\"It is now in order for the friends of Mr. T. H. Maguire, Q. C., to congratulate him on his appointment to the position of judge of the Supreme Court of the District of Saskatchewan, N.W.T. The choice was made at an early time, and was confirmed at the Cabinet meeting on Saturday, and the Governor formally gave his consent. It can hardly be doubted that this is an accomplished fact, and only a matter of time, possibly less than a month, until Mr. McGivney ceases to be a member of the Kingdom's service.\n\nAppointments to public office now, days, civil or judicial, are influenced by political considerations. The appointments in the Northwest territories having been made, correctly, the present Government was not only justified in doing it, but it was rewarded by appointment to the same those who were friendly to it. Over the administration of the new territories, there will preside over the Albertans, Judges McLeod and Robson; over Saskatchewan, Judge Whyte. We have no reason to object to the selection of these men, and, the territorial council has, in honouring a serving member of the Conservative party done them also a great service. We do not disparage the abilities of the learned gentlemen and his fitness for the discharge of the duties that have been assigned to him. Mr. Maguire has always been a useful citizen. He has given his attention to a multitude of matters, and he is very likely to be heard when he begins to argue with credit for his fidelity. A member of the bar, of the Committee of the law society, and a member of the church, he has been ready to do whatever he thought was best, and he has got into the habit of taking a leading position in all of them. Political, legal and other friends will, of course, congratulate him, but the press congratulates him as a journalist. It may not be generally known, but he is a fact reporter, that he has had a couple of years acting as editor of the News and rendered a service the termination of which our contemporary newspapers regret. He is a man of well read politi sly, and wrote as the better second journalism of today are writing. He has been able to attract the people in the topics of the house. He did not oblige his personal ability to colour his columns, and did make free with the personality of others, and as a result no one could have enjoyed the reading of his columns. He is the second person connected with the press of Kingston to ascend the bench; the first was Mr. Justice Whyte, and Mr. Joseph Ryan, whose pen, while a student and barrister-at-law in Kingston, through the medium of the News, was engaged in framing newspaper attacks, the pungency of some of which has been felt even to this day.\n\nEDITORIAL NOTES.\n\nOur old friend is enjoying good health and spirits, and seems fair to lead his party to victory at the next election.\n\nSir Richard Cartwright thinks one Senator is enough for the Northwest, while Mr. Blake does not think so. The latter is right, and the former is wrong.\n\nThe Regina Leader says—A question or two days ago about the House of Commons being able to add members to the best looking man in the House, and it was unanimously decided Mr. Fisher was the best looking man, and to say that Mr. Macdonald was absent at the time.\n\nRumour is abroad again against watery stories about intended Indian and Half-breed ridings. Because a few Indians and half-breeds are not entitled to vote this time of the year, and a few lazy Metis are kicking because the Government has not given them the land they ask for, and a great deal more than that, there is no inducement for them to go and vote. They are lazy, and those who circulate such stories have little wit with those who believe them should get third rate jobs, and be sent to the Governor's grave in the place where the hair is thin. This process is warranted to prevent sniping.\n\nThe St. John's sealing steamers have done very badly this year.\n\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nFrom the Bulletin, April 16th.\n\nR. Logan and J. Fraser returned from Beaver Lake last Saturday last. Mr. Logan purchased Colin Fraser's herd of moose last winter near the lake, for $100. Many were killed around the lake when Messrs. Fraser and Logan were there. A few geese had arrived also, twenty-five were killed, and old and young, one was killed while they were near the lake, and six are reported in the same locality.\n\nThe usual police horses and stores at the Saskatchewan was well attended, a number of parties from Edmonton, Fort Qu'Appelle, Clavet Bar being present. G. A. Bird, who was formerly bidding was spirited and the prices realized high. Nine horses were sold at $400, ranging from $300 to $500, average price being $385. Twenty saddles were sold from $4 to $10, three guns from $75 to $125, and there was a large number of boots and shoes, valises, bottles, etc. The total amount realized was $750.\n\nBATTLEFORD.\n\nFrom the Herald of April 23.\n\nA neat marble tablet has been placed in St. George's Church to the memory of Mr. Robert K. Wilson, chief of the Metis' Indians in 1885. It was erected by the fellow employees of the deceased in telegraphing the news of his death.\n\nThe Mr. K. division are raising up their wagons and transport outfit preparatory to taking the route to the North West Mounted Police. Their departure is not yet determined on.\n\nTenders are asked for the erection of a bridge across the Battle river.\n\nThe police was called last week that a small posse had made its appearance on a Sweet Grass reserve, on Battle river, and had arrested a man named Smith. He found that the suspected case was only one of cutaneous eruption. The Indians were very frightened, and the man was quite quiet in his own mind, as he had already and the small posse did not fear taking it again.\n\nGENERAL NEWS.\n\nCANADIAN.\n\nOne hundred and four degrees were given in Macdonald University last year.\n\nGustave Charles August Bujon was sentenced to the penitentiary for 30 days, charged with defrauding the public in Belgium to the extent of $100,000.\n\nThe Ottawa committee reports the April 10th, that the city's tax revenue for April was $14,430 last year. At Montreal they were $63,908, against $37,708, and inland revenue $162,314, against $100,000.\n\nMrs. Rattray of Hamilton, attempted to shoot her husband on the 30th. The attempt was successful.\n\nA fire recently destroyed Mr. Gordon's store and an adjoining dwelling house, loss heavy.\n\nFred Morley of Mrs. Hon. Oliver has been appointed sheriff of Toronto.\n\nBishop Binney, of Nova Scotia, is dead.\n\nTerritorial stonemasons, carpenters and plumbers have gone out on strike.\n\nRev. Dr. Dowling, of Paris, has been consecrated bishop of Peterborough in succession to Bishop Macdonald, at St. Mary's church, Hamilton.\n\nCapt. Samuel Bedson has been appointed adjutant of the 3rd.\n\nA catalogue prepared by the Department of Agriculture on Saturday says five steamers left Liverpool this week, bound for Canada, carrying 2,276 tons English, a large proportion agricultural and many with capital.\n\nC. Neill, prominent detective, died at Regina on the 30th.\n\nFears are entertained at Amberstouch, Ont., that the scholastic Louis O'Neill has gone down with all his board.\n\nThe late Alexander Mitchell, of Milne, leaves an estate worth eight million dollars.\n\nSpecialists from Paris declare that poppy fever is gaining ground in France rapidly.\n\nThere is an epidemic of diphtheria among Nancy, Troy, and Spalding, and the poppy fever demand the liberation of Alsace Lorraine from the German yoke.\n\nRUSSELL & DAVIS,\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham and\n\nGAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY.\n\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\" \" Over 75 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings at cheap rates any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL\n\nAn adjourned meeting of the Town Council was held in the Council Chamber on Monday evening last.\n\nPresent—Mayor Macarthur and Counsellors Agnew, Bain, Braden and Stevenson.\n\nThe minutes of the last meeting were read and adopted.\n\nCoun. Agnew introduced a by-law to amend By-law No. 18.\n\nA resolution was received from Joseph Courtenay, J. R. McPaul, L. Clarke and others, asking for certain improvements in the east end of town. Referred to the Board of Works.\n\nA communication was received from Mr. Gibson, District Surveyor of Telegraph poles in reference to removal of telegraph poles on River Street.\n\nCoun. Agnew was instructed to see that the poles put in the proper place when removed.\n\nOn motion of Couns. Stewart and Bain, two members, Couns. Agnew and Agnew were appointed a committee to wait upon Provost Dominance in reference to the cemetery.\n\nStreet Inspector reported, after viewing the matters referred to him on Kay street, two on Queen and two on King street. Referred to the Board of Works.\n\nOn motion of Couns. Stewart and Bain, the Health Inspector was instructed that he would examine on or before the 10th day of January next.\n\nOn motion of Couns. Bain and Agnew, the Mayor and Couns. Stewart and Bain ordered the Secretary to be directed to draft a petition to the Governor General in Council for a grant of land on the north side of the river for the purpose of a public park for the town, and to present the same at the next meeting of the Council.\n\nThe by-law to amend By-law No. 18 was read a first and second time.\n\nOn motion of Couns. Agnew and Stewart, the Mayor was requested to send a Committee of the Whole to consider the whole of the petition by law No. 18, Coun. Bain moved that they do.\n\nAfter considering the by-law the committee rose and the chairman reported, when the by-law was read a third time and a first and second time when the Council resolved itself into a Committee of the Whole to consider the petition by law No. 18, Agnew moved that the by-law was not fit for the consideration of the Committee.\n\nThe by-law to regulate the licensing of hotels, restaurants, saloons, places of public resort or accommodation, places having wine and spirit licences, etc., etc., was read a second time and ordered to be signed and numbered.\n\nTELEGRAPHIC.\n\nQUEENSTOWN, May 9.\n\nAn experimental line will likely be located near Winnipeg.\n\nPerley and Grindley, two gentlemen largely interested in aviation, visited here recently. They are interested in the extension of the Canadian Pacific Railway's branch line to the Souris district.\n\nNothing further has been done in disallowances since Mr. Macdonald visited here after the legislature, but the entire government could not well grant a private interview, but if they desired to see us we would arrange another time.\n\nAt the request of Mr. Van Horne, Home will visit Montreal to adjust freight rates. Freight rates will likely be made national. Mr. Macdonald, Carling, of East Room, has introduced a bill to repeal the Scott Act.\n\nChimney bulkheads being public property have been run in thirty yards.\n\nCapt. Price resumed the debate in the British House of Commons last evening on the subject of the proposed House appoint a committee to examine into the charges of falsification made by Mr. Gladstone's amendment and in its rejection by a vote of 317 to 233. Sir John Lubbock said that no breach of privilege had been committed when the motion was then adopted.\n\nOne hundred and seventy-eight men were employed in the Namakwa coal mine by fire damp.\n\nTOWN MATTERS.\n\nThe order given by the Town Council that persons having muncie, fifth and sixth stories under their premises must deposit an $8 insurance fund for each street, must be a surprise to most people. Certainly of making a nuisance is one of the things which ought to be taken care of in the place referred to. If our Council are desirous of doing something to improve the sanitary condition of the health, we beg to inform them that there are three dead horses in the bluff in front of the school house and that it would be well to have them buried before the hot weather comes on.\n\nThe resolution stated at the last week's meeting of the Council instructing the Clerk to communicate with Mr. Macdonald and ask whether the Government intended to furnish any assistance for Government buildings here, did not do much credit to the former. When asked why they would not assist us in building public buildings within our corporation, we think it is the least we could do to assist in the erection of such buildings as thing as being too greedy and we are afraid this is a case in point. Besides we are not sure that the Government would ever assist in the erection of such buildings as those where the Government supply free protection for Government buildings. If they would do so, and allow us to use the building, we would like to be assisted.\n\nThe by-law to regulate the licensing of hotels, restaurants, saloons, places of public resort or accommodation, places having wine and spirit licences, etc., etc., was read a second time and ordered to be signed and numbered.\n\nThe new steel bridge on the M. & N. W. railroad over the Mississippi river has been completed. It is the only steel bridge on the road and is a splendid piece of work. The total cost of the bridge will be between $30,000 and $30,000. The first train to run across it was a special combination E. Baker, Mr. Spencer Folsom, and other officials of the road. An extension of ten miles of the road is now under way.\n\nThe Spanish Government of Santo Domingo, with 800 regular soldiers, attacked several thousand rebels at Monte Morro, defeated them after a hard battle, capturing the guns of the insurgents and killing many prisoners. The rebels of Monte Morro were routed and burned, only the Chinese residents being spared. The natives claimed that the Spaniards used cannon.\n\nHod carriers in Chicago have made a demand for an increase in wages from 22 to 25 cents an hour.\n\nAMERICAN AND FOREIGN.\n\nA fire in Kankakee, Ill., on May 1st, destroyed property to the value of sixty thousand dollars.\n\nGen. de Bourgoing, French Minister of War, has published a decree in the war pamphlet entitled \"The Next Franco-German Battle.\" It embodies the theories of French military training and tactics put into practice by Bourgoing since he became Minister of War. The publication also tends to remove the wax from, and the fear of foreign invasion which is so apt to inspire confidence in the prowess of the army.\n\nDress Goods, all shades Irish Diaper Linen, India Linen, Muslins, Nuns' Veiling, Silk Gloves, Cottons, Ginghams, Prints, Wincies, Ladies' Jerseys Boys' Jersey Suits, Ready-made Clothing, FROM FOUR YEARS UP—AT R. C. WIGMORE & CO.'S. 1879.\n\nFOR A CHEAP BABY CARRIAGE NEW SPRING GOODS WILL ARRIVE NEXT WEEK.\n\nClearing Sale will continue until New Goods ARE OPENED BETTS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware, House Furnishing hardware Carpenter's Tools, Paints and Oils, Barbed Fencing Wire, Stoves and Tinware.\n\nALSO A FRESH STOCK OF Groceries, Teas, Tobaccos, Etc.\n\nCALL AND GET PRICES.\n\nJ. R. McPhail,\n\nTHE WEST END STORE\n\nJUST ARRIVED, NEW GOODS AT CHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Reppa, Window Silk Curtain Lace and Yellow, Door Matting, Bed Cloths, Silk Corded Couchings, Empress Cloths Black and Garnet, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Breeze Veiling, Ladies' Silk Ties, Finsel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Readymade Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds inspection is solicited.\n\nW.R. Fish's.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887051301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 5753, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6633, 2], [6633, 15299, 3], [15299, 23078, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]