[{"id": "f1002278eb10d9e0507cbd3a21860bf6e6d63079", "text": "A FAIR PROSPECT.\n\nWith the opening year the prospect for Prince Albert Settlement looks extremely bright, and as its advance has been thus far there is abundant promise that the year of grace one thousand eight hundred and eighty-three will see us further on the highway to prosperity and success. Communication with the East is not to be restricted to one railway solely for we have the great railway intelligence and direction of the Pacific Western and Northwest Railway Company intent pushing on their line to Prince Albert as rapidly as possible. The line so far completed has already been graded a distance of fourteen miles west of Gladstone and will be ready for the iron in the spring. The capital of the company has been greatly strengthened, and this is a guarantee of earnestness in the prosecution of the two outlets that in near future we will be well provided for some time, and when other projects, now before Parliament, are carried out, Prince Albert will assuredly become a great railway centre. And then we are to have a weekly mail service by telegraph from Prince Albert to Edmonton, and the advantages of a mail being once in a week will have been very great, still the correspondence decently put off until much longer. The representations made to Ottawa from time to time must bear fruit ere long, and the establishment of a weekly mail service is stepping stone to a semi-weekly and finally daily one. The telegraph line from Capelle has been pushed on as far as Touchwood Hills, and there is no reason why there should not be telegraphic communication with the rest of the world before another six months are gone by. This, however, depends very much on our selves, and we urge that assistance asked for and reasonably given to us. For building and all other work the telegraph would be of much more service at the present time than a weekly mail even. In Prince Albert we have as far as we know, many mills. Some there are likely to be filled before long. Building material of all kinds has about run out, the demand during the past year having greatly exceeded the supply. The increased capacity of Messrs. Moore & Macdonald's new mill will supply to a certain extent the deficiency in the matter of lumber before the next six months are over. We hope the new mill of Messrs. Macdonald and McKay to draw supplies from. But our future stores and residences must be of brick. Mr. E. Waldo and Mr. Thos. Powers have been for sighted enough to see this, and both of them will commence the manufacture of brick on a large scale before many months. Coal must be the future fuel of the Settlement. But we have coal at most at our doors, but more so, and we are pleased to notice that companies are being actively formed to work the rich beds that lie along the Saskatchewan River. As there are numerous building companies to be filled during the year, the demand on both saw mills and brick yards will be almost more than they can meet, so both industries promising to be of a permanent character. Then there are many more wants that it is quite unnecessary to enumerate here. They will be, no doubt, rapidly filled as the country becomes settled up, and the inducements held out to settlers and others are of such a nature that we are fairly warranted in expecting a large increase to the population of the Settlement before another twelve months have passed. Take hold together the prospect for Prince Albert very fair indeed, and shall certainly manifest itself in the coming year short of our expectations. With one brick blocks, salient residences, Saskatchewan coal, increased postal facilities, telegraph communication, and the assurance of the presence of dealers in the near future, we may boast of rapidly approaching to that degree of civilization enjoyed by the older Provinces of this vast Dominion of ours.\n\nRAILWAY MATTERS.\n\nDuring the last six weeks there has been more or less anxiety on the part of the public to learn what progress was being made in connection with the South Saskatchewan Valley Railway. Pending negotiations between the parties more particularly interested in the scheme, the company has been unable to give any definite information regarding the progress of the enterprise. It is now known that the parties have been able to sign the contract to build the railway, and the company has been instructed to commence proceedings at once to compel the conveyance, and we may now confidently look forward to the completion of the railway in the spring. We need not here enter into a recapitulation of the details of the agreement between the Railway Company and Messrs. McLean & Watson, the trustees, have been instructed to commence proceedings at once to compel the conveyance, and we may now confidently look forward to the completion of the railway in the spring. We need not here enter into a recapitulation of the details of the agreement between the Railway Company and Messrs. McLean & Watson, the trustees, have been instructed to commence proceedings at once to compel the conveyance, and we may now confidently look forward to the completion of the railway in the spring.\n\nEDITORIAL NOTES.\n\nA communication in another column of this paper states that the proposed telegraph line will be completed by the end of June. It is high time that something was done about it, more particularly as there appears to be some delay in the matter of the weekly mail. No one who has had any experience with the railway is finished, it would be well if a meeting were called at an early date and decide what is to be done. There is an understanding that the connection with Prince Albert will be made, and the latter supplies the point. If the people of Prince Albert want a telegraph line, and we think we can satisfy answer for them that they do, and that they are willing to supply the price as settled at once, so that operations can be hurriedly pushed on without any spring opening.\n\nThe club medal, presented by Col. Spink, will be played for on Saturday next, at 2 p.m., at the club rooms. There will be a match between the married men and the players to be selected from those who make the highest bid.\n\nWe are pleased to see by a late issue of the Prince Albert Times that Col. and Mrs. Spink have visited the villages of Southampton, county of Prince Albert. The curators of Southampton this year have been very active in collecting and exhibiting the same, and have also shown very active interest in curating a life model of the pioneer days.\n\nThe first patents granted for lands in the North West Territories have at last been issued, having been obtained for the lands of Messrs. McLean & Watson. We congratulate Mr. McLean on being the first to obtain a patent, and we trust that many more will be obtained soon. In consequence of the issue of these patents, we are informed that Mr. McLean will be able to sell his land, and our friend Col. Spink will, we expect, have a little more to do than he get through with.\n\nTHE PRINCE ALBERT TIMES\n\nSPINK & MAVETY.\n\nPRINCE ALBERT, N.W.T.\n\nJ. O. DAVIS & CO.,\n\nPrince Albert and South Branch.\n\nSTEWART & WOOTTON,\n\nPrince Albert, N.W.T.\n\nJ. O. DAVIS & CO.,\n\nPrince Albert and South Branch.\n\nPRINCE ALBERT TIMES\n\nSPINK & MAVETY.\n\nPRINCE ALBERT, N.W.T.\n\nJ. O. DAVIS & CO.,\n\nPrince Albert and South Branch.\nA TOUCHING INCIDENT.\n\nJackson was an old man, his eyes full of tears instead of being hungry when he thought about his wife. His face showed the same expression when he looked at her. He was a man who worked hard all his life, but now he could only sit by the fire and think of the过去的 days.\n\n\"Good day, sir,\" said Jackson, \"where do you come from?\"\n\n\"I'm coming from the next town,\" replied Luka, smiling.\n\n\"Glad to see you, sir,\" said Jackson, taking off his hat.\n\n\"Amen,\" said Luka, placing his hat on his lap.\n\nJackson stood up and walked over to Luka. \"I've heard that you're a good worker,\" said Jackson.\n\n\"Yes, sir,\" replied Luka, \"but I'm not the best.\"\n\n\"To be honest,\" said Jackson, \"I don't think you're the worst.\"\n\n\"No, sir,\" replied Luka, \"but I'm not the best either.\"\n\nJackson stood there for a moment, looking at Luka. \"Tell me what happened to your family,\" said Jackson.\n\n\"I lost my wife,\" replied Luka, \"and my children are with another woman.\"\n\nJackson nodded. \"I'm sorry to hear that,\" he said.\n\n\"I know,\" replied Luka, \"but we'll get through it.\"\n\n\"Amen,\" said Jackson, placing his hand on Luka's shoulder.\nFOR SALE\n\nCheap Good Horse and Double Lumber Harness.\n\nHARRY E HURD\n\nGRAND UNION\n\nLivery & Sale Stables,\n\n4 Nechet Street, Prince Albert.\n\nHorses and Cattle always in hand.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in Town.\n\nWe will send the arrival of all regular trains convey passengers to our place.\n\nS. J. DONALDSON, Prop.\n\nTRY\n\nHUGH M'DOUGALL'S BREAD!\n\nHugh M'Dougall\n\nEast End Bakery.\n\nJ. M. Campbell,\n\nNew Goods Arriving Daily.\n\nA TREATISE ON THE ART OF BAKING, COOKERY, CONFECTIONERY, CLOTHING AND GROCERIES.\n\nJ. M. Campbell.\n\nAsh & Robbins,\n\nCONSUMPTION\n\nPositively Cured.\n\nASH & ROBBINS,\n\nWAREHOUSING\n\nAT\n\nFORT QU'APPELLE.\n\nReal Estate\n\nCHOICE BUILDING LOTS\n\nC. MAIR,\n\nP.O. Box 250, Fort Qu'Appelle.\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nWALTERS & BAKER,\n\nGeneral Merchants,\n\nPRINCE ALBERT - N.W.T.\n\nHODGSON,\nSUMMER & CO.,\nWholesale Importers or Dry Goods.\nSwallmores,\nFancy Goods,\nJewellery.\nDrugists' Sundries, etc., etc.\nBeads a specialty.\nWHOLESALE ONLY.\n\nMcDermott and Bannatyne Sons,\nWINNIPEG\n\nTHE GABLE HOUSE,\nTHE BEST BEER AND CIGARS\n\nR. B. WAY,\nPotatoes.\n\nPUMPS!\n\nAcorn & Cross,\nJames Scott,\nGABLE HOUSE.\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\nPiano Manufacturers,\n117 KING ST. WEST,\nNEXT TO ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPanos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL\nAND FINISHED IN FIRST-CLASS STYLE.\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT - N.W.T.\nSEE HERE!\n\nA. L. ASHDOWN\n\nTHE MAN TO BUY\n\nYour Goods\n\nFROM\n\nTHOMAS O. DAVIS,\n\nGeneral Merchant,\n\nHORSE SHOE STORE,\n\nRIVER STREET.\n\n1879. 1883.\n\nAs a proof that close buyers are alive to their interests, and that we practice what we advertise, our store has been engaged with customers during the past week, more people being served than during any one week this season.\n\nGRAND ANNUAL CLEARING SALE!\n\nSTILL GOING ON AT BUFFALO HALL\n\nOur business improves every month\n\nCAUSES:\n\nReliable goods sold at fair profits, and advertising facts only.\n\nS. W. VANLUYEN.\n\nPRINCE ALBERT.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883021401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 2685, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7309, 2], [7309, 8438, 3], [8438, 9201, 4], [9201, 10235, 5], [10235, 10808, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]