[{"id": "cfc8056ea9bf730b5320949d51c523b2ca7a0c79", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAEVETEY\nPRINCE ALBERT N. W. T.\n\nFRIDAY, MARCH 29, 1889.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's Church—Services, 11 a.m., Rev. Mr. MacKay, in charge. Address: St. Albans Church, Prince Albert.\n\nSt. Mark's Church—Services, 10 a.m., Rev. Mr. MacKay, in charge.\n\nSt. John's Church—Services, 10 a.m., Rev. Mr. MacKay, in charge.\n\nDuck Lake Church—Services, 10 a.m., Rev. Mr. MacKay, in charge.\n\nTHIS PAPER MAY BE OBTAINED AT THE OFFICE OF THE PRINCE ALBERT TIMES, PRINCE ALBERT, SASKATCHEWAN.\n\nFRIDAY, MARCH 29, 1889.\n\nOur Ottawa despatches seem to indicate that all negotiations between the Government and the Long Lake Railway Company have ended in smoke. No arrangements have been arrived at which would ensure the continuance of that road, and our prospects of railway communication this year appears to be nil. It is evidently not the fault of our members or of his colleagues from the North whether such is the case. Our despatches indicate that the Government were urged by the North-Western members to grant a subsidy to the road in question; their request was refused. It will now be in order to take some other action but we feel convinced that it will be a waste of time to petition or assist in any way to road coming in here at the present time. Should every person in the district sign a petition, judging from the past, we believe that it will not only fail to do us any relief. The settlement is in a bad plight and assistance must come soon. It is useless to try to disguise the fact that we are not receiving the fair and liberal treatment to which we are entitled, at the hands of the Government. But the question arises: What can we do in order to obtain a remedy? The Government are storing, we are weak and helpless and have not a constituency worth speaking about which sympathizes with us. It is useless to make threats of secession, rebellion or annexation, as we notice a few of the agitators of \"5,\" in this town, appear inclined to do.\n\nWe believe it is the intention to have a mass meeting of the settlers in this district next week. The terrible effects of the embarking on united action to secure railway communication for Prince Albert. We need not say that we are in hearty sympathy with such an object, as we believe a railway to be a pressing and absolute necessity and essential to prosperity, to the extent of the existence of our community. We have grave doubts, however, as to whether any beneficial result will be attained by such a meeting. We do not require to represent our case to the Government. It has been presented to them so often in the past few years that they cannot possibly be in ignorance of our condition. We have strong reasons to suspect, however, that the promoters of this proposed meeting have other objects in view, but will withhold further information until after the result of the meeting.\n\nIt is almost certain that the Regina & Long Lake road will remain as it is at least for another year, and almost equally certain that next fall will not bring us any nearer to a railway. What then shall we do? Can we not appeal to the authorities to do what they are evidently opposed to doing? Will it better our cause by calling meetings and passing votes of censure on the part of Mr. MacKay?\n\nWe answer, no! If we do see, it behoves us to do the best we can to eke out a livelihood; to work as we have done in the past with a determination not to succumb to adverse circumstances and receive our portion very cheerfully. We treat the future as living until the proper time arrives for rendering it service.\n\nThis week's despatches brings the news of the death of John Bright. In him England loses one of her greatest statesmen. It is hard to say to whom of the great political leaders he behoved. He was a strong advocate of the principles of free trade, and took a great interest in the advancement of the laboring classes and the amelioration of their lot. He was a member of Parliament for several terms and was one of the finest speakers in the English House of Commons, where he sat as a member for Birmingham.\n\nDuck Lake.\n\nThere are only two cases of real sickness among the non-res' men, both of whom are consumptives. Com. Gallagher, of Battleford, is in this district buying cattle; he speaks highly of the soil but thinks Duck Lake far ahead of it.\n\nOn Monday evening last Wm. Ditch, of Carlton, was much obliged. It's a boy named Robert Smith, who had been following telegraph lines on Monday last. Ducks and geese made their appearance last week and many have hatched. Eggs are now selling at 15 per dozen. Sanding has commenced at Carl and the crops are looking good. Mr. Leech put in eight bushels of wheat.\n\nWe regret to say that latest reports from the asylum say that Mr. Nunn is still there.\n\nThe meeting to elect officers of the militia for the Town of St. Paul's, Prince Albert, was held last night. Mr. X. Raisone was elected president; Mr. Champlaine, vice-pres.; Mr. G. L. Smith, secretary; Mr. J. T. Trans, treasurer. The meeting was well attended, considering the state of the roads.\n\nA young man is a great medium after marriage. Some weeks ago a suggestion was made here should get married and prove himself. He has since taken our advice. We refer Mr. Lovell, of the Indian Department here.\n\nDe. Bain, of your town, paid a visit yesterday and visited and remained until Wednesday. He is very popular having with a good man.\n\nH. Mitchell, of A., arrived here on Thursday last. He took ill on the stage, but is now rapidly recovering.\n\nSHERIFF'S SALE OF LANDS.\n\nMarch West Territory—By virtue of an Order in Council, dated February 26th, 1889, the lands of James P. Fraser, at the sale of lands held under the March West Act, will be sold by public auction, at the offices of the North-West Territories, Judicial District of Prince Albert, on the 1st day of April, 1889, at 12 o'clock noon.\n\nOWEN H. HUNT, Sheriff of said Judicial District.\n\nSheriff's Office, Prince Albert, 18th February 1889.\n\nHORSE SHOE STORE.\n\nJUST ARRIVED—LARGE ASSORTMENT\n\nDRESS GOODS!\n\nComprising Nuns' Veiling, Sergees, Cashmere, New Prints, Muslins, Scarves, Ladies' Trimmed Hats, Children's Hats FULL RANGE LATEST STYLES MEN'S American Felt Hats.\n\nLatest in Men's, Youths' and Boys' Clothing\n\nCall Early and get Your Choice—Prices Lower than ever\n\nTHOS. O. DAVIS.\n\nR. C. WIGMORE & CO.\n\nMen's and Boys' Underclothing\n\nMen's Cardigan Jackets\n\n1,000 Remnants of Carpets, cheap\n\nA Full Line of Dress Goods\n\nChoice Selection of Ladies' Hosiery\n\nMen's Overcoats at cost for cash\n\nMitts and Moccasins\n\nA Facing Inventory, Filling Our Stock,\n\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., e.c.,\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\n\nTrowsering and Overcoating\n\nWORSTEDS,\n\nIn English and American Lines,\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS\n\nIn all grades\n\nSATISFACTION AND A GOOD FIT GUARANTEED.\n\nRobertson & Robertson.\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nMAGNIFICENT STOCK NEW GOODS\n\nCall and Examine Our Stock\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOU OUN,\n\nSec.-Treas\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alta.\n\nMahaffey & Clinkskill,\nBattleford, Sask\nNORTHWEST MATTERS\n\nThe following is an extract of a speech delivered in the House of Commons by Mr. Macdonald, on February 29th, on motion for an address to His Excellency the Governor General, in reply to the memorial addressed to the Government by the Legislative Assembly of the Northwest Territories which sat recently at Regina.\n\nMr. Macdonald: \"In this is a question which interests particularly those members who have been connected with the North-Western Districts. I will ask permission to occupy a few minutes of the time of the House in regard to it. One of the difficulties from the North-Western Districts, in which I am called upon to take special attention, is the demand made by the Dominion Government paying them to make arrangements for the immediate construction of a railway to the settlements on the North Saskatchewan River, where heavy sympathies are centred around that important point. In the preamble they first state that the building of the Canadian Pacific Railway had cut off the settlers from the east, and that, in consequence of that, the people were unable to find means of getting off the land, and that the result was that the consequence was they were being brought into a most undesirable state of poverty. I do not think there is any question at this time on that subject because I am happy to state that arrangements are being carried on by a certain railway company, the Canadian Pacific Railway Company, of the road to Prince Albert and Battleford, which I hope will be concluded next session, and will give us the needed railway communication. If these arrangements are not concluded at that time, I shall be obliged to lay before the House and shall then have an opportunity to go further into the details in regard to the subject. I will simply say now, that I have had a conversation with the Minister of the Interior and his colleagues that there is a great necessity, in fact, to have a railway connection with the land grants for railways in that country should be located at once, if any work is to be done there. It is extremely necessary that these undertakings should come to an actual settlement, and that security is worth until they know where these lands are, the lands being security for building the railway.\"\n\nThere was another question to which our representative referred, and that was the granting of scrip to the half-breeds of the Northwest. This question has raised a great deal of discussion in the House before. The half-breeds in the Northwest, the members of the Northwest Assembly have petitioned the honorable gentlemen in charge of affairs of this country that scrip should be granted to the children of all half-breeds who were born before March, 1853. They consider this a very justifiable thing to do, because the new arrangement was not made with the half-breeds in the North-west until after the election, and they went to their seats without any scrip to them. We know that the half-breeds in Manitoba were settled with in 1870, but the half-breeds in the North-west were settled with in 1883, and my honorable friend from Assiniboia (Mr. Davis) very wisely and very well pointed out that half-breeds in the North-west were a different class, in a way, from the half-breeds in Manitoba, they were in a much worse condition than the half-breeds in Manitoba as the Blackfoot Indians would have to the Cree Indians; consequently, when a settlement was made with the half-breeds in Manitoba, it did not follow that a settlement was made with the half-breeds in the North-west. Mr. Davis pointed out that a settlement was not made with them, and no steps were taken to settle them or to help them, therefore, to hear the honorable member's views here self in a manner that will enable me to say to my half-breeds in the North-west that they are likely to be treated, because no settlement has been made with them, they had no word in making the treaty, and when they came forward they accepted what was given them, but with this protest, they demand that this scrip-award be 'laid aside' until such time as they were treated fairly.\n\n\"I wish also to say a few words in reference to the scrip being granted to the N.W. Police. During last session Parliament this matter came up on a motion by my honorable friend for West Assiniboia, and it was promised at that time that the matter would be looked into. I urged at that time, very strongly, that this scrip should be given to the police, because I believed they deserved it. They are, as everybody knows, a very fine body of men. They are the bulwark of the safety of the district, but before the rebellion occurred they did a greater duty than they did during the rebellion. They did a great duty for Canada. It will be remembered that the Indian Department was organized throughout the Dominion, the mounted police were organized throughout the vast territory, and I believe the credit of a great measure, is due to the police force. They are the bulwark of the country, and I believe the country ought not to control the country without shielding a single drop of blood. This is a matter of very grave importance, and I believe that the police force has been called to it, and that it may appear to be a very small matter. I believe the mounted police, the first mounted police force in the country up to the present time, have done their duty thoroughly, and are as anxious to discharge their duty for the rendering down the rebels as the provisional corps sent up there from Quebec, Ontario, and other places. They are entitled to serve the interests of the Dominion at large, and whatever the government does for the other Provinces, still they are doing their duty by their country, and if ever there was a case where I thought it only a matter of justice that all the corps should be rendered alike.\"\n\nSASKATCHEWAN INSTITUTE.\n\nThe regular fortnightly meeting of the Saskatchewan Institute was held in the hall of the Roman Catholic Church. There was a large attendance of persons notwithstanding the bad state of the roads. During the absence of the rector, the Rev. Dr. Mackay read an able and highly interesting paper on the subject of the Roman Catholic church. He spoke of the importance of the church in the life of trade. A good fish!\n\nIt is a trite saying, offered for the solace of disconsolate lives, that there are no good fish in the sea as we before knew them. But this does not hold good in the case of W. R. Fish, the Merchant.\n\nHe keeps a full line of General Goods at his establishment. He is the only Fish in this line of business, and can tell a good story of himself if necessary. He is always willing to assist anyone from attending to his numerous customers. He is sure to please, as he has one of the best stocks in town. Call on him.\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889032901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 3457, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7183, 2], [7183, 7541, 3], [7541, 14378, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]