[{"id": "ceb7762cddcf11a0f6eb07bdc53dabe00d082336", "text": "MAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers\n\nNorthcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing\n\n20 bbls Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes Baskets etc., etc\n\nSTEWART & WOOTTON\nWALTERS THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\nBill Heads,\nEnvelopes,\nCirculars,\nDodgers,\nBusiness Cards,\nLegal Printing,\nPamphlets,\nEtc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVEETY,\nPROPRIETORS,\n\nRIVER STREET,\nPRINCE ALBERT.\nROYS WILL BE BOYS.\n\nNot many months ago there was a young man named Bill Smith who came after the holy work in which he was engaged had been done up to the satisfaction of all, a citizen of the town where the work was done. He had a number of them to go out into the world. After supper dinner of them all joined in prayer, and then they sat down to quiet smoke, as ministers sometimes do, when they get to talking about old times when they were boys and solemnly swear together, and the old man who was present, disposed as a preacher, came to the conclusion that ministers were rather human than otherwise when they were young.\n\nOne day two honest paced delegates, with a sign between them, dropped in at the house of the minister, which was a few hours before was sitting in application to the Lord High to make us all good. They came in and sat down by his side, and said, \"Jim, do you remember the time we carried the cow, and call up and say, 'Come on, Jim?' \" Paul answered, \"Jim was inclined to stand on his dignity, and he looked around to see if any worldly person would come to help him. We thought that we were all right good, he said. 'You bet your life I remember it.' I have been on my knees ever since, when that old horseman knocked at the door and he began to roll up his trousers legs inside the seat. They told me they would not let me go back, and he pulled down his pants and said,\n\n\"Well, you see I was detailed to attend to the horse and the calf upstairs, and Bill Smith, who was now preaching in Chicago, got a safe place, but he thought a young man's patience was frittered away, and he said, 'One of these horses is not a trotter, there is no judge of horse flesh of Bill, and he said, 'I'll go out on the road occasionally and catch on for a race with some worldly man, and then I'll see how he goes.' So here we are well, I never have a half dozen, and had so many hind legs. Kick! Why, bless your soul, you know that calf walked all over me, from Genesis to Revelations. And say, we didn't get much of a horse, but something, did you, why, we had to clean out the corn room.\"\n\nA solemn looking minister, with red cheeks, who was present, and whose eyes twinkled through the smoke, said to another,\n\n\"Charlie, you remember you were completely gone, and you passed a nice man who was going there from Pennsylvania. What became of her?\"\n\nCharlie put his feet on the table, struck a match, and said,\n\n\"Well, I want a guess at her, you say, just liked her. Not too well, you know, but she was well enough. She had a chance of being the wife of a man who put the colours of yours, Hank and she also got along with a printer a lot of the time. She was very nice. I understand he is editing newspapers somewhere in Illinois, and getting rich. It was better than the farm, and she could do it, and then not have to be bound abroad like a country school marma, as she would if she had married me.\"\n\nA dark horse came in with a coat but turned in the stable. The horse is accustomed like a funeral sermon, with no more excitement than a horseman does, when he presents them a horse to be ridden. If he had picked up a coat and walked to the host, knocked the other out in a split second.\n\nDo you remember the time we rode out there with a wagon and went out across the prairie to King's farm after strawberries?\n\nFour of them said they remembered it well enough, and Jim said all he asked was to go out there and see Bill Smith, the Chicago preacher, for permission to him to steal a horse on the trip, and he said, \"I'll go out there with that hire, every time I'm in that string, me a dozen times. And do you remember when we played in the yard, and you said, 'Jim, I think that I had the chicken past,' so gentle, none, a solemn immortality, awaits you beyond the grave for doing me out of that scrape.\"\n\nThe fat man hitched around away in the dark, and the minister said, \"We have been discussing the principal case that came up, and that was how he tried to hit a bull dogger over the fence to the teeth, which is a very serious thing, and a portion of his wardrobe that should not be mentioned, and how he left a sample.\n\nG. D. NORTHGRAVES,\nESTABLISHED - 1860.\nWatchmaker and Jeweller.\n\nWatches,\nClocks and\nJewellery\n\nHEINTZMAN\nAND\nCOMPANY,\nPiano Manufacturers,\n117 KING - ST. WEST,\nNEXT ROSSIN HOUSE,\nTORONTO, - - ONT.\n\nPianos to Suit the Climate of\nthe North West.\n\nALL MADE OF THE BEST MATERIAL\nAND FINISHED IN FIRST-CLASS STYLE.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\"The Times\" Office,\nPRINCE ALBERT - - N.W.T.\nITEMS OF INTEREST.\n\nLewis Vernon is said to have discovered new lands in N. C.\n\nWar between France and China is said to be inevitable.\n\nThe French government has appointed a British minister at Pekin.\n\nThe estimated value of wheat in Ohio this year is $3,000,000,000.\n\nPalmer's mustard will probably be consumed by the world this year.\n\nA Canadian named Wm. E. Ross has mysteriously disappeared in Detroit.\n\nSalmon has been seen near the mouth of the Mississippi River.\n\nResearch appears to maintain the idea of automating all classes of insurance.\n\nThe police employed at the University of Pennsylvania are armed.\n\nThe appointment of Count Augustus von Auerswald as French ambassador at Paris is granted.\n\nVarious newspapers have been censured for publishing reports of a Liberal meeting.\n\nOne thousand four hundred operatives in four manufacturing communities at Manchester are striking.\n\nThe Madrid municipal elections resulted mostly in the return of the conservative party.\n\nHamilton bricklayers are still on strike for $8 a day. The masters refuse to give more than $7.\n\nThe Prince of Wales had the memorable dinner at the Masonic Institute at Oxford with Masonic rites.\n\nThe discovery of an extensive sewage system within the walls of Victoria, B. C., is reported.\n\nIn the London Chess tournament Mason and Nevin played a drawn game, black to move.\n\nA man named McCallum killed a smallboat thirty feet high at Hamilton, and was knocked senseless.\n\nFrom the sea bed discovered near Wallace Bay, N. B., a solid bed at sixty-nine feet of pure salt.\n\nThe treaty of Commerce between Great Britain and Russia has been signed, ending the Beltsberg.\n\nA motion for a new trial in the Macdonald case at Dartmouth was denied in the House of Commons.\n\nSir John S. Lumsden, British Minister at Brussels, will succeed Sir Augustus Egg as Minister to Rome.\n\nThe Empress Eugenie has renounced her claims to the crown presented by Marseilles to the Empress Napoleon.\n\nThe Massachusetts state house is closed for the day because of the discovery of a beauty on boots raised for sugar making.\n\nWallace, the U. S. Minister, is preparing to present the Turkish government with a protest against the Turkish government's treatment of the Armenian question.\n\nThe Canadian department of the Universal Exhibition is exhibited in Paris, but not well, although all the exhibits are excellent.\n\nCharging the grand jury at New York recently, Judge Conning and three men only, 183 persons confined in the city prison.\n\nThree prisoners tried at Cairo, Berlin's temple have been found of good repute, and the results are considered satisfactory.\n\nMr. Wake, chief of the district police in Hamilton county, Berlin, was shot in the arm and shoulder by Richard Rees, a member of the police force.\n\nThe death of the Hon. R. M. Cohen, former member of the Nova Scotia Legislative Council, at the advanced age of 69 years, is announced.\n\nA representative of the Manchester, Eng., Y. M. C. A., has arrived at New York to promote the work of Canada and the Western States.\n\nOttoman forces have lately attacked another branch of the Irish Revolutionaries, Brotherhood of New York, when 100 members were killed.\n\nHon. Alexander Macdonald was the recipient of an address and purse of money from the citizens of Hamilton, Ontario, and Kingston simultaneously.\n\nIt now appears that the Rev. Dr. Duffell, principal of the late British College, Montreal, has sold his school buildings amounting to $200,000.\n\nA washerwoman, George Richmond, employed in tending a fire stove inside Hamilton, is reported to have stolen her own money, believed to be over $50.\n\nLewis Vanden, the French author, is reported to have disappeared in Toronto.\n\nIt is rumored that 2,000 German troops have been dispatched to the Dominion of Canada.\n\nIt is rumored that firearms are supplied to the English army in India with the latest model.\n\nLiquors of a good quality have been confiscated in one of the northern towns of Hamilton.\n\nThe reinforcements leaving France for Canada include three batteries of mounted infantry.\n\nMounted police are looking for Henry Decker, who disappeared from New Westminster.\n\nIt is stated that Kerguelen, owner of the \"Ferdinand,\" has been arrested and another sent.\n\nThere is almost a rupture between Prime Minister Macdonald and the Governor General.\n\nPrime Minister Macdonald intends to offer himself in Canada as candidate for the next election, according to reports.\n\nNow this year, the fashionable climate, the much desired ear of corn, and the maple leaf, will be with us.\n\nThe officers and men of the British Army in Egypt are complaining that the climate is too hot.\n\nHamilton citizens state that the Hamilton Band will soon outnumber the natives if they continue to grow at the present rate.\n\nOfficial reports from the Arctic regions state that the Samoan, Antarctic, and Antarctic expeditions have been successful.\n\nTurkey, in connection with the other European nations, has declared war against the Turks.\n\nThe hill relations in the disposition of political criminals will prove the first realisation of the principles of liberty.\n\nFurther arrests have been made in Alexandria of alleged members of secret societies.\n\nThe prisoners include a number of prominent figures.\n\nIt is reported emissaries of the Fabian Society are trying to create an uprising against foreigners among the Arab Moslems.\n\nA member of the Hungarian Revolutionary Committee, at Munich, has been sentenced to six months' imprisonment for libelling the Duke of Coec.\n\nThe British Government is investigating a political agent at Cairo to take charge of all Egyptian affairs of a political nature.\n\nThe Committee of the French Chamber of Deputies adopted the report in favor of the expenditure for the expenses of the Egyptian expedition.\n\nThe editor of the American Review, published at Constantinople, has been arrested and imprisoned for life for printing seditious articles.\n\nA brother of a Russian newspaper has been sentenced to two months' imprisonment for publishing a libel against the Empress.\n\nA French investigator finds that, in proportion to its size, a boat can pull more than twice its weight.\n\nThe unfortunate individual who accidentally upset a bicycle is finally convicted of assault with intent to commit murder.\n\nA female citizen of Montreal walked into the Municipal Court, took a chair, sat down, and waited for the judge to arrive.\n\nWhereupon she was fined $500, but refused to pay, saying she could not afford it.\n\nThe judge thought he had simply called and looked his charges and compelled the woman on her disbursement.\n\nPRINCE ALBERT\n\nBOOT & SHOE STORE.\n\nBOOTS & SHOES\n\nCheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN:\n\nManitoba & North-west\n\nThe Hudson's Bay Company owns 2,000,000 acres in the Great Fertile Belt, and now offers for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE IN:\n\nWinnipeg, West Lynn, Rat Portage, Fortage in Prairie and Goddard, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRAYDEN, Land Commissioner.\n\nBoots and Shoes.\n\nShannon & McLeod,\n\nBoot and Shoemakers.\n\nHave opened out in Macdonald & Knowles' Building where we will be pleased to see the ladies of Prince Albert and surrounding district, and by strict attention to business, hope to merit a share of their patronage.\n\nWe expect our stock of Ready Made Boots and Shoes to arrive in about two weeks.\n\nSHANNON & MCLEOD,\n\nFirst door east of Campbell's Block.\n\nReal Estate\n\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS CENTRALLY SITUATED IN PRINCE ALBERT\n\nAnd suitable for business purposes or private residences.\n\nFor further particulars apply by letter or personally.\n\nC. MAIR,\n\nP.O. Drawer E,\n\nPrince Albert, N.W.T.\n\nJUST RECEIVED.\n\nIron Stands, Horses Shoes, Horse Nails, Bolts and Chains, Sleigh and Cutter Runners Shafts and Tangles for sale.\n\nAnd a variety of other articles generally used in a practical Blacksmith Shop.\n\nMISS MACK & CO.,\n\nCampbell's Block,\n\nRiver Street,\n\nPrince Albert,\n\nN.W.T.\n\nCHESTER THOMPSON,\n\nPrince Albert.\n\nAT LAST\n\nThe Raymond Sewing Machine has come.\n\nLadies, now is Your Chance.\n\nI will guarantee the Raymond sew any machine in any shop.\n\nThe latest and most improved sewing machines.\n\nLIVE AND LET LIVE, is my Motto.\n\nI will sell the Raymond with the cash and save you money, and save you driving for miles.\n\nIf I cannot sell a machine for such as sells the Domestic, I will give you for the privilege of seeing it.\n\nI have just received a structure given me by Mr. Brown's brick building, Minnie, Prince Albert.\n\nS. W. VANLUVEN.\n\nWinnipeg and Western Transportation Co.\n\nThis Company will run a WEEKLY LINE carrying the Season's goods between Winnipeg and Grand Trunk Railroad consisting of the following:\n\nMARQUIS, Capt. A. B. Russell,\n\nBROCHETTE, Jerry Webber,\n\nNORTHWEST, James Sheets.\n\nMaking close connection with the PRINCESS,\n\nat Grand Trunk Railroad.\n\nThe steamer Marquis, Capt. J. W. Lee, will run as a regular packet between Winnipeg and Edmonton, making monthly trips.\n\nSpecial attention will be paid to the conveyance of goods and the delivery of freight. Rates reasonable.\n\nR. SMITHSON, Prop.\n\nWinnipeg and Western Transportation Co.\n\nPRINCE ALBERT\n\nPlanning Mills and Saw and Door Factory\n\nCO. WESTH AND MACLAY LTD.\n\nSaw, Doors, Frames, Blind, Mouldings and all Builders' Furnishings made to order on the shortest notice.\n\nGOODFELLOW ERS. & PROFS.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY,\n\nProprietor.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nResidence: Near Protestant Church.\n\nGRAND UNION\n\nLivery & Sale Stables.\n\n4 North Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nHorses for double team promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nA special will soon arrive at all regular stations for passengers to any part of Canada.\n\nS. J. DONALDSON, Prop.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883061301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9132, "total-output-tokens": 3832, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 444, 2], [444, 966, 3], [966, 5562, 4], [5562, 15939, 5], [15939, 15939, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]