[{"id": "8cd4e924235a9277ae0086d7d7f32220dae7eafc", "text": "PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FRIDAY, DECEMBER 14, 1883.\n\n$2.50 A YEAR.\n\nNOTICE\n\nSTRAYED\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nDecember 7, 1883.\n\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nCOMMUNICATIONS.\n\nA MESSAGE.\n\nTo the Editor of the Times,\n\nSir,—Will you permit me, as one who has travelled in good faith and done a great deal of business in Prince Albert, to address a few words to Mr. J. M. Bain, Esq., of this place. I believe that he is now the only resident of the North West who has not been to see Mr. H. B. Hard, who was recently in Winnipeg. We trust that Mr. Hard will soon recover and return to his home.\n\nThe regular communication of this Lodge was held last evening when the following members present: Hon. Mr. J. M. Bain, Mr. H. B. Hard, Mr. W. J. Agar, Mr. W. M. M. Brown, Mr. J. M. Ryan, Mr. J. S. Ryan, Mr. W. T. Macdonald, Mr. F. W. Taylor.\n\nThe regular meeting of this Lodge was held last evening when the following members present: Hon. Mr. J. M. Bain, Mr. H. B. Hard, Mr. W. J. Agar, Mr. W. M. M. Brown, Mr. J. M. Ryan, Mr. J. S. Ryan, Mr. W. T. Macdonald, Mr. F. W. Taylor.\n\nTHE TELEGRAPH.\n\nThe following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\n\n\"The following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\n\n\"The following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\"\n\nTHE TELEGRAPH.\n\nThe following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\n\n\"The following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\n\n\"The following telegram was received at the office of the Prince Albert Times:\n\n\"Mr. J. M. Ryan, Esq., Prince Albert, N.W.T.\"\nTELEGRAPHIC CORRESPONDENCE\n\nWe publish in this issue three letters from Mr. McPhail, of Winnipeg, in which he expresses his satisfaction at the manner in which the government has acted in regard to the question of the suspension of the government. He says that the government has done everything possible to prevent any further trouble, and that he hopes the government will continue to do so.\n\nThe following is an extract from one of Mr. McPhail's letters:\n\n\"I have been very pleased with the manner in which the government has acted in regard to the question of the suspension of the government. I hope they will continue to do so.\"\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'Leary\nProprietor\n\n1879.\n\nImportant Circular\n\nFROM\n\nBuffalo Hall!\n\nOwing to a change in our business, which will take effect on Jan. 1st, 1884, all accounts due and not provided for by that date, will be placed in the hands of our solicitor for collection.\n\nBETTS & Gwynne.\n\nManitoba Weekly Free Press.\n\nThe Monarch of the Weeklies.\n\nThe Largest Paper in Canada!\n\nThree Months Free.\n\nThree Handsome Cash Prizes\n\n$500-$200-$100.\n\nThe Manitoba Free Press is now being issued in a new edition, containing a great deal of additional matter, and is now being distributed throughout the province.\n\nThe following is an extract from one of the letters:\n\n\"I am very pleased with the manner in which the government has acted in regard to the question of the suspension of the government. I hope they will continue to do so.\"\nTERRITORIAL NEWS.\n\nFORT MCLEOD.\n\nFrom the Gable House.\n\nMr. J. McRee has received a band of snow from Fort McLeod this past Saturday.\n\nA strong wind has been blowing over the hills, the influence of which the snow disappeared as by magic.\n\nMr. and Mrs. Corr and their daughters arrived at the Gable House last week. They intend taking up their residence on Beaver Creek, where they have previously located. They are welcome to the house.\n\nOrders were recently received by Major Crozier to discontinue the mail between Macleod and Thomas Bay; it was sent out again on Wednesday, and returned on Saturday, and will continue for the present, until events in the district make the route less safe.\n\nMr. E. T. Gold recently visited the Gable House, and went to the Coal Banks between hours. The grass did not grow under his feet.\n\nQU'APPELLE.\n\nFrom the Times.\n\nSchool opened this week with an average attendance of fifteen.\n\nAnother batch of recruits will soon be landed at Qu'Appelle.\n\nThere was nothing to mar the harmony of the banquet on Tuesday afternoon. Every man was there.\n\nMr. Craig has been elected Justice of the Peace. We congratulate both him and his fellow citizens on the appointment.\n\nMr. McGowan has joined the Band and Safe States belonging to Messrs. Johnson and Gibson. A Decree Proposing the sale of land under the Act, Mr. Evans will remove his well known establishment to Indian Head next week, to commence operation on the 1st of January.\n\nPROSPECTUS OF THE Prince Albert Directory AND BUSINESS GUIDE.\n\nIt is proposed to issue a Business Directory for the town of Prince Albert and Districts of Louis and Qu'Appelle from which will be obtained a complete list of every business establishment, its location, telephone number, rates and a description of the services offered.\n\nThe prefix will contain a history of Prince Albert, its present condition and future prospects, together with a record of this year's crops, so far as they can be ascertained for the District of Louis, extent of acreage cultivated, number of acres under cultivation, last year's crops, population of District, and other useful information, written by a well-known authority.\n\nAbout 500 or more copies will be published according to the encouragement received, which will be distributed throughout the Province and the Middle Country.\n\nIt is hoped that the new directory will prove of use not only to those individuals who advertise and subscribe, but that the whole community may benefit by the publication of such a book, and that a healthy emigration encouraged to this country.\n\nPrice of advertisement, whole page, with notice opposite page, $10; two copies given free. Single copies, 25c.\n\nWanted to Borrow a Hat.\n\nA good story is told by a West End paper of a young man who had been badly treated. Recently a young man in the city and the ministerial curiosity was excited by the appearance of a stranger who seemed to be in great need of assistance. The minister had compassion upon him and gave him a substantial gift. However, his liberality of heart would permit of the children going out of their way to help others. The minister thought they had some good men among them, but unfortunately for him he could not find any who would lend a hand. Finally he hit upon a plan. He went to the preacher and tried to persuade him to give a dinner to the poor. The minister agreed, but it wouldn't work, the preacher replying, \"I've walked a long time for my legs to get stronger.\" The minister then said, \"I want to send myself.\" To a friend he said, \"I'm going to send myself.\"\n\nNEW FALL AND WINTER MILLINERY.\n\nLADIES DOLMANS AND CLOAKS,\n\nFur Caps and Muffs,\nWool Goods.\n\nLadies and Children General Furnishings.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller.\n\nA LARGE STOCK OF\n\nWatches,\nClocks and Jewellery\n\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended to\n\nWatches, Clocks, Jewellery, Stationery.\n\nJoseph Rogers & Sons, Tailors.\n\nR. B. WAY,\n\nPRINCE ALBERT, N.W.T.\n\nRead This\n\nONLY\n\n$3.50\n\nThe Greatest Offer ever made to the Canadian Public\n\nFOR $3.50\n\nwe will send to any address in Canada or the U.S.A.\n\nWeekly Globe\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT\nCOAL OIL.\n\n500 GALLONS,\nAMERICAN AND CANADIAN.\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nN. B.—We sell by Imperial Measure. You get one-fifth more by buying Imperial Measure. Test it by the weight.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert—N.W.T\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\nFOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gueschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIDGES, Land Commissioner.\n\nPrince Albe's Bakery.\n\n2LB LOAF, 12¢.\n9 LOAVES, 15¢.\n\nFurniture\n\nJust arrived. In addition to our former large stock we have received several new articles.\n\nFancy Parlor and Bedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\n\nChairs of nearly all descriptions.\nCradles & Cribs for the Babies.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\n\nWM. R. BELL.\nNOTICE.\n\nJUST ARRIVED\n100 MARES\nCONSISTING OF\nWORK, SADDLE AND BROOD MARES.\n\nFreighting, express and passenger line from Gabriel's Crossing to Trois Rivieres.\n\nP. H. GARNOT,\nAgent for the Crossing, South Wallis.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883121401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 2588, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1978, 1], [1978, 3554, 2], [3554, 7813, 3], [7813, 7813, 4], [7813, 7813, 5], [7813, 9439, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]