[{"id": "63eb27c3768a9787289a6eb2b19679e990bfdf2f", "text": "MR. LAIRD AND SOME OF HIS FRIENDS\n\nAside from the gentlemen who are supporting Mr. Laird because they believe he will be a good minister, there are some of their previous opponents who are now supporting him on his retention. The record shows that Mr. Laird has been a good minister, and he deserves our support.\n\nPRACHING VS. PRACTICE\n\nElectors of Saskatchewan, please make sure that your votes are cast in the proper manner. We urge all electors to vote for the Conservative candidates. The Liberals have not been able to provide for the needs of the people, and we urge all electors to vote for the Conservative candidates.\n\nMUSICAL INSTRUMENTS\n\nT. N. Campbell has just received a large stock of Accordeons, Harmonicas, Violins, &c., &c.\n\nLATEST NOVELTIES IN TOYS\n\nAT COST FOR CASH.\n\nTHE WEST END STORE\n\nJUST ARRIVED\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNurs Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Curtains, Crimson Reges, Window-Holland in Shine and Yellow, Door Mats, Crumb Catcher, Silk Corded Cloakings, Empress Shawls, Embroidered Garnei, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Breeze Veiling, Ladies' Silk Ties, Tinsel, etc., etc.,\n\nALL AT LOW PRICES.\n\nMany large stock of Ready-made Clothing and Fresh Groceries, including Candy, Coffee, Biscuits, Figs, Dates and Tinned Goods of all kinds. Inspection is solicited.\n\nCITY CONFECTIONERY\n\nJUST RECEIVED A LARGE LOT OF Choice Confectionery, Nuts and Candied Nuts, Tobacco and Pipe Tobacco, also a fine lot of Manilla and Domestic Cigars.\n\nR. T. GOODFELLOW.\n\nPARLOR STOVES\n\nAT COST.\n\nT. J. AGNEW.\n\nPRINCE ALBERT BREWERY.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 10 Stone St., New York.\n\nMcINTOSH & GERRON.\n\nAMBER--(Hop)--ALE.\n\nDelivered to all Parts of the Town.\n\nSTRAVED.\n\nPure and Sparkling\n\nSTRAVED!\n\nConfirm my promise about two months ago.\n\nSTRAVED!\n\nRed and White Setter.\n\nSTRAVED!\n\nTwo years old, with cut ears, very healthy and property and paying charges.\n\nSTRAVED!\n\nStray cattle.\n\nSTRAVED!\n\nOne black cow, long horned, very healthy, white from head down, with cut ears, very healthy and property and paying charges.\n\nSTRAVED!\n\nJohn M. Anderson, Lethbridge Settlement.\nADDRESS\n\nTo the Electors of Saskatchewan\n\nGentlemen:\n\nAt the request of a number of friends in the District of Saskatchewan, I beg to offer myself as a candidate for your suffrages at the coming election of a member for the Federal Parliament.\n\nShould I be returned as your representative I shall use every endeavor to secure the local interests of the District, and shall urge the Government in the necessity of pushing on Railway communication to Prince Albert, Battleford and Saskatoon;\n\nThe building of a bridge across the South Saskatchewan River;\n\nThe granting of assistance to the railway to Hudson's Bay;\n\nThe more liberal issue of scrip to all children of Halfbreed heads of Families born in the Territories between 1879 and 1885.\n\nThe consideration of the permit system by patronizing the liquor question to the popular vote;\n\nThe speedy payment on a liberal scale of all just claims against the Government; and\n\nThe granting of seed grain free on account of the peculiar circumstances attending the settlers of this district were joined;\n\nThe amendment of the Land Acts in such manner as to secure compensation to homesteaders;\n\nThe granting of positions under Government to local men;\n\nThe purchasing of supplies for public institutions within the district in which they are consumed;\n\nThe formation of a Legislative Assembly for the Territories in which Saskatchewan shall have full and proper representation.\n\nAs a local man whose interests are closely connected with those of Saskatchewan, I appeal to every elector in the district for support during the coming contest.\n\nI am, gentlemen,\n\nYour obedient servant,\n\nD. H. Macdowall\n\nAux Plébiscites du District de Saskatchewan.\n\nMessieurs:\n\nA la demande d'un nombre d'amis du District de Saskatchewan, j'ai bien l'honneur de me faire élire candidat; je vous prie de voter pour moi à l'élection prochaine d'un membre pour le Parlement fédéral.\n\nSi je devais être élu représentant, je ferai tout mon possible pour assurer les intérêts locaux du District et je serais heureux de voir le gouvernement agir sur la nécessité de mettre en œuvre les communications ferroviaires avec Prince Albert, Battleford et Saskatoon;\n\nLa construction d'un pont sur la Branche Sud de la Saskatchewan;\n\nLa facilitation du chemin de fer de la voie ferrée de Hudson's Bay;\n\nLa distribution plus libérale de scrip aux enfants des familles Métis nées dans les Territoires depuis 1879 jusqu'en 1885;\n\nLa considération particulière du système de permis en soumettant la question de l'alcool à la voix du peuple;\n\nLa prompte et libre exécution de toutes justes réclamations pour les propriétaires;\n\nLa distribution gratuite des semences distribuées aux cultivateurs de ce district, vu les circonstances particulières dans lesquelles ils se trouvent;\n\nDemander l'Acte des Terres afin de permettre la concentration des établissements;\n\nDe nommer des personnes du lieu pour remplir les positions du Gouvernement;\n\nDécharger les marchandises destinées aux travaux publics, dans le district même où elles sont consommées;\n\nDe former une Chambre Legislatrice dans les Territoires à laquelle Saskatchewan sera fortement représentée;\n\nConduire en bonne humeur le local dont les rapports entre les électeurs\nElection Notes\n\nOn this way, from Troy Mr. Laird held a meeting at Batoche. About forty Halforenites were present, as also Messrs. Stewart (of the N.W. Canada Liberals) Macdonald, Price, Albert, who informed Mr. Laird that the convention would not meet him there; as he had been previously invited by Mr. Laird. There were also present at this meeting Messrs. Craig, Gunn, T. Baker, Brooks, and others, of the Liberal Conservative Association. He gave them a speech in the best style, layouts for a few minutes, and spoke at some length through an interpreter. He charged Sir John Macdonald with playing too close to Indians, and sirになっているな、さんはなりしているのがたくさんいたのです。\n\nBaking Powder\n\nAbsolutely Pure.\n\nThis product never requires washing or scrubbing, is furnished with instructions on how to use it properly and successfully. It is recommended for use on all types of floors.\n\nBETTS & Gwynne Stoves!\n\nA Further Reduction of 20 per cent will be given on all Box and Parlor Stoves Remaining on hand.\n\nCamp Stoves and Piping at Bottom Figures.\n\nCamp Stoves and Piping at Bottom Figures.\n\nNotice\n\nCommandery Books\n\nHygiene Notice\n\nHorse Notice\n\nMiss Mack & Co\n\nJ.J. Johnson & Co\n\nFurniture\n\nBedroom and Parlor Suites, Sideboards, Cupboards, Bedsteads, Mattresses, Cots, Cradles, Washstands, Sofas, Easy Chairs, etc., all selling at 10% below former prices.\n\nButchers\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and Game.\n\nWholesale & Retail\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nW.B. Goodfellow", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887021801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 1834, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2332, 2], [2332, 5566, 3], [5566, 7085, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]