[{"id": "11e3cfe79320f08f37dc73ab3ac5b707be28e256", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 23, 1886.\n\nBANKING HOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nTransact General Banking Business.\nInterest allowed on deposits.\nBranches available at all points in the Dominion.\nCustomers understood and promptly attended to.\nSARAH'S—Merchant Bank of Canada.\nWILLIAM Y. MACLURE.\nBarrister, Notary, Etc.\nOffice—McLean's Building, between J. G. Davis and Heinz & Gruenwald.\n\nSTEPHEN BRUNSWICK,\nSubstitutes of the Supreme Court of Justice in England.\nNOTARY PUBLIC.\n(Late McClellan & Elliot.)\nPRINCE ALBERT.\n\nFORMER & NEWLANDS.\nSurveyors & Builders Public.\nOffice—Over T. N. Campbell, Stationer,\nPrince Albert, Park, N.W.T.\nF. F. FORSTER.\nA. W. WILSON.\nB. A. HUTCHISON.\nB. A.\nAttorneys, Solicitors, and Notary Public.\nOffice—Next door to Jackson's Drug Store,\nRIVER STREET—PRINCE ALBERT.\n\nW. R. GUNN, M.A.\nBarrister, Solicitor, Public Officer, Conveyancer.\nLands bought and sold. Money invested.\nLegal Agents for J. W. F. Foster & Co., Ltd.\nPRINCE ALBERT.\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\nGEORGE A. BENTLEY,\nBarber and Hair Dresser.\nCHARGES—MODERATE.\nShop—First Door east in Sinclair's Block.\n\nJ. D. HANNAFIN,\nAuctioneer and Commission Agent.\nOFFICE—FIRST STREET.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nDecorative Painting and Paperhanging on short notice.\n\nCITY BILLIARDSALOON.\nCorner Church and Nesbit Streets.\nChoice Beer and Cigars always on hand.\n\nA.W.R. MARKLEY,\nGen Agent and Auctioneer.\nAGENCY—Confederation Life Association, Toronto.\nIngersoll Manufacturing Co., of New York.\nSons of Marriage and Billiard Table Kingdom.\n\nHUGH M'DOUGALL,\nEast End Bakery.\n\nALEX. LANG,\nGENERAL BLACKSMITH.\nHandyman shop in the east end, directly opposite the H. D. Campbell block.\nMachinist and General Blacksmith.\nAll kinds of Farm Machinery Required and put in order.\n\nA. L. LANG.\nIn connection with the Brewery.\nThe Best Cigars always on hand.\n\nCHAS. WOODMAN,\nPROPRIETOR.\n\nMISS McGUIRE,\nCAMPBELL'S BLOCK.\n\nEAST END BAKERY.\nBREAD unsurpassed by any west of Winnipeg.\n\nHugh M'Dougall.\n\nALEX. LANG.\nGENERAL BLACKSMITH.\n\nHandyman shop in the east end, directly opposite the H. D. Campbell block.\nMachinist and General Blacksmith.\nAll kinds of Farm Machinery Required and put in order.\n\nA. L. LANG.\nIn connection with the Brewery.\nThe Best Cigars always on hand.\n\nCHAS. WOODMAN,\nPROPRIETOR.\n\nMISS McGUIRE,\nCAMPBELL'S BLOCK.\n\nTELEGRAPHIC.\nTHE VERY LATEST NEWS BY WIRE.\n\n(10¢ Special Telegraph.)\nCLARK'S CHAMBERS, Oct. 24.—A young man named Albert Strange, son of Mr. Robert Strange of Winnipeg, and employed in the office of A. McDonald, of Edmonton, has been missing for several days, and is supposed to have been lost on his way home from Edmonton. His family has been sent to Edmonton on business.\n\nThe Governor General arrived in Winnipeg Wednesday evening, and was met by the Governor at the railway station.\n\nBrainerd, the Vermont journalist, has been arrested for sedition, having been away from his expenses at Minneapolis.\n\nFour persons were burned to death by fire in Chicago on Tuesday.\n\nA revolution is imminent in Denmark, caused by a dispute between the king and the people.\n\nBingham, a London lawyer, has been engaged to defend Reid.\n\nThe Governor General presents Payne, Parcival candidate for Waterford, for seditionist utterances.\n\nThe Hamilton and Temora have a race on October 29th.\n\nMr. White arrived at Regina on Tuesday morning. He was requested to meet Mr. Palmer, who had been made Prince Albert council last week, in order to discuss the question of the council.\n\nThe officers of the 54th Regiment have decided to go on with their plans against the Indians.\n\nThe crops are being brought from Quebec and Kansas to relieve C School and the Indians.\n\nLOCHABER, Oct. 24.—The case of Louis Reid was under consideration by the Privy Council today. Mr. Jeune, the prisoner's English counsel, stated the prisoner's case, and asked for a stay of Reid's conviction. The judges thought it was not necessary to hear the prisoner's side of the case, and he will be committed tomorrow. The decision will probably be against Reid.\n\nWe have just received the following information regarding our recent tournament:\n\nTenders for Cordwood.\nTenders will be required by the undersigned:\nNOVEMBER 1st, 1886.\nFor 250 Cords of Wood, to be delivered at N.W.M.P. Barracks, Prince Albert.\n\nThe wood to be of good quality, fine cut, well seasoned, and not exceeding six inches in size, or fall or growing winter's cuttings.\n\nTenders for which quantity, or for quantities of 25 cords and upwards will be accepted.\n\nTenders to state price per cord delivered.\n\nGovernment timber dues to be paid by the contractors.\n\nLowest or any tender not necessarily accepted.\n\nA. BOWEN MERRIY.\nSuperintendent, N.W.M.P., Prince Albert.\n\nTenders for Cordwood.\nTenders will be required by the undersigned:\nNOVEMBER 1st, 1886.\nFor 250 Cords of Wood, to be delivered at N.W.M.P. Barracks, Prince Albert.\n\nThe wood to be of good quality, fine cut, well seasoned, and not exceeding six inches in size, or fall or growing winter's cuttings.\n\nTenders for which quantity, or for quantities of 25 cords and upwards will be accepted.\n\nTenders to state price per cord delivered.\n\nGovernment timber dues to be paid by the contractors.\n\nLowest or any tender not necessarily accepted.\n\nA. BOWEN MERRIY.\nSuperintendent, N.W.M.P., Prince Albert.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\n\nShannon & McLeod.\n\nMiss McGuire wishes to inform the public of Prince Albert and the surrounding country that she has opened up a dressmaking establishment in Campbell's block, where she is prepared to undertake all kinds of work connected with the business, and guarantees satisfaction.\n\nMiss McGuire, Campbell's block.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\nThe Baptist Chapel\nSt. Catharine's\nSt. Paul's\nSt. John's\nSt. James'\n\nFRIED, OCT 23, 1865\n\nGLAXIS\n\nWith reference to the article in our last issue, we should be sorry to see such a subject drop, because really the claims of our volunteers are substantial. Some of these local forces entered into their respective duties under the Militia Act 1862, some others, as in the case of the volunteers in the town, were enlisted by the authorities here for the defence of Prince Albert and the North West Territories. The volunteers had their duty to do, and looking at it from a service point of view, did it thoroughly and well. Besides which they were actually engaged in the actual fighting, the development of which battle was only a few miles distant from this town. Why volunteers who were doing the same duty, though enlisted under other Acts, should not have privileges of such and others, we fail to see any justice. We advocate their claims as much as it is our power, and we sincerely trust that the matter will not be overlooked here, and that other authorities may accept our just support that we think it deserves. We have so far urged the claims of the volunteers, particularly those who visited Prince Albert, Carlton, and other Headquarters of the Royal Navy during the recent troubles. They took an active part in the late fighting, and this matter by their presence was to delay the advance of the enemy to the tune of many weeks. Actually it will be seen that they are entitled to great credit, as most of them who are now in the North West, men and women, a great many of whom are entitled to the same or better service than any volunteer who has been engaged there.\n\nOUR RECENT GUEST.\n\nThe visit of the Hon. Mr. White must have been a pleasing and instructive visit as far as us, the residents of Prince Albert and the surrounding district. In the first place he actually saw and had opportunity of personally experiencing and understanding the difficulties and perils that the different settlers and parties in Prince Albert and its neighborhood wished to bring under his notice. Mr. Vigne, on his part, did all a Government officer could do, and although his time was limited, he felt perfectly content (quite right) that he did all he can towards promoting the interests of the town of Prince Albert, in the right direction. While Mr. White was visiting the town he brought with him a large number of officers who visited this town for the purpose of conferring upon this town, and we cannot express our opinion that the manner of itself brought more good to South West Canada. But there is no doubt, as far as we can judge, that the officers should get certain privileges and not only, not one for one which does not apply to those under whose care these regulations ought to have been carried out. Had these officers visited this town at an earlier date, we feel sure that much more would have been done for the advancement of the town in general and persons in particular.\n\nBATTERIES.\n\nOn Monday, the 18th inst., about a clock past 9 B Batteries pulled up stakes and commenced their march towards the plains for Qu'Appelle. A detachment of the regiment was ordered out to join them from here. Before starting the P.A.C Band played the town homeward. The Guard left behind me. The manner in which the town was decorated was excellent, the bands playing as the troops marched through the town towards the east side, they are the North West officers and men, a great many of whom are entitled to the same or better service than any volunteer who has been engaged there.\n\nNotice of Dissolution.\n\nNotice is hereby given that the Partnership existing between us the undersigned as \"STEWART BROTHERS,\" in Prince Albert, in the North West Territories, is dissolved.\n\nGENERAL MERCHANTS\n\nNotice is hereby given that the Partnership existing between us the undersigned as \"STEWART BROTHERS,\" in Prince Albert, in the North West Territories, is dissolved.\n\nGENERAL MERCHANTS\n\nNotice is hereby given that the Partnership existing between us the undersigned as \"STEWART BROTHERS,\" in Prince Albert, in the North West Territories, is dissolved.\n\nGENERAL MERCHANTS\n\nNotice is hereby given that the Partnership existing between us the undersigned as \"STEWART BROTHERS,\" in Prince Albert, in the North West Territories, is dissolved.\nPRINCE ALBERT\n\nPlaning Mill and Saw and Door Factory\n\nNO. 1087 PRINCE ALBERT, SASK.\n\nA. GOODFELLOW.\nPrince Albert, N.W.T.\n\nNOTICE\n\nClaims of Half-Bloods and Original Indians of Manitoba.\n\nWHITELAW & CO., Solicitors, have the honour to inform the public that they have been instructed by the Government of Manitoba to examine claims of Half-Blood families of Indians resident in the Province, under the provisions of the Manitoba Act to extend the privileges of citizenship to Indians, and to report thereon. The examination will be conducted in accordance with the instructions given by the Government, and the results will be made known to the public as soon as possible.\n\nThe examination will commence at Prince Albert on October 23rd, and will continue until further notice.\n\nThe public are requested to bring their claims to the attention of the Solicitors, who will be pleased to examine them at any time during the period of the examination.\n\nPRINCE ALBERT TIMES\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\nHARDWARE!\nNails, Tar Paper,\nGlass (all sizes), Putty,\nWhite Lead, Paint Oil,\nMachine Oil, Turpentine,\nPlastering Hair, steam refined,\nPowder, Shot, Caps,\nShells, Etc., Etc.\n\nWe keep our prices low to our customers.\n\nJ. L. JOHNSON & CO.\n1879.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Food's Furnishings, Hats, etc.,\nHave been selected with the greatest care, while our stock of\nlinen goods is unsurpassed in quality and variety.\n\nGeneral Groceries.\nPipes, Tobacco, Cigars, Cigarettes.\nBenn & Gwynne.\n\nO. E. HUGHES & CO.,\nGeneral Merchants and Indian Traders.\n\nLincoln College.\n\nJ. M. Campbell.\n\nT. N. Campbell,\nBookseller and Stationer.\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\nPICTURES\nMounted and Framed.\n\nOrders for Books sent to Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885102301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6410, "total-output-tokens": 3149, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5956, 1], [5956, 10414, 2], [10414, 11642, 3], [11642, 12519, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]