[{"id": "832df01f67198f956bcf78e1ec25ab00f8ac87e4", "text": "**NOTICE**\n\n**AUCTION SALE OF VALUABLE PROPERTY.**\n\n**CANADA. NORTH WEST TERRITORIES**\n\nIn the matter of LYDIA VERONICA MCKENZIE, WILLIAM SAMUEL MCKENZIE, ANDREW THOMAS MCKENZIE, JAMES JOHN MCKENZIE, ANNA GEORGINA CATHERINE MCKENZIE, SAMUEL LAURENCE CLARKE MCKENZIE, JAMES OCH MCKENZIE, AND WILLIAM ROSS infants under the age of twenty-one years.\n\nTHOMAS MORAN, Esq., their friend.\n\nProceedings to be held in the Town Hall, Prince Albert, on the second day of August, A.D. 1883, at half past eleven o'clock A.M.\n\nThe sale will commence immediately after the auctioning of the property and will continue until all the property has been sold.\n\n**FOUND**\n\nA NATIVE STALLION.\n\nVery Dark Brown, both feet free shallot on two legs.\n\n**LOCAL AND GENERAL NEWS.**\n\nPrincess Albert, N.W.T.\n\nThe Rain returned back from Grand Rapids recently.\n\nNews of new logs are arriving every evening for Moore & Macdonald's mill.\n\nGeorge McKay left for Duck Lake yesterday. He intends returning about the end of the month.\n\nThe mail driver informs us that he passed John Wynter's wharf yesterday morning.\n\nThe Royal College of Surgeons, King's and Queen's College of Physicians, Ireland.\n\nEnquiries can be made at the TIMES office for the present.\n\n**ESTRAY ANIMALS.**\n\nPosted on the 2nd of June near Big Quill Lake:\n\nOne Iron Grey Pony, about 15 hands, 7 or 8 years old, by broken.\n\nOne Grey Mare, about 14 hands, 7 or 8 years old, by broken.\n\nOne Sorel Colt, about 15 hands, 7 or 8 months old, by broken.\n\nThe owner can make arrangements to have his animal returned.\n\n**G. S. McCONNELL,**\nLorraine Patrick D.L.S\n\n**Tender Notice**\n\nTender Notice, Surrogate and all other offices, is hereby given on shortest possible notice.\n\n**FOUND**\n\nPRINCE ALBERT, N.W.T.\n\n**LOCAL AND GENERAL NEWS.**\n\nThe Bishop of Saskatchewan\n\nThe following paragraph was taken from the Winnipeg Sun, and is well worth quoting:\n\nThe Lord John Minto is another splendid man. He is the same heroic leader who led his Irishmen through extreme hardship with infinite gentleness, the most winning disposition, he has undergone peril and been marked up as a martyr by the Irish people.\n\nThe Bishop of Saskatchewan\n\nThe following paragraph was taken from the Winnipeg Sun, and is well worth quoting:\n\nThe Lord John Minto is another splendid man. He is the same heroic leader who led his Irishmen through extreme hardship with infinite gentleness, the most winning disposition, he has undergone peril and been marked up as a martyr by the Irish people.\n\n**COMIC HISTORY**\n\nTo the Editor of The Times,\n\nSir,\n\nIn your last week's issue you published an article on \"Incorporation,\" and if you will permit me to say so, I am not only a member of the incorporated bodies, but also of all who are interested in our future and well-being.\n\nWhile there may have been some misunderstanding regarding the advantages of local government and therefore hesitate, I cannot imagine any person who really understood the matter, would offer to view any obstacles in the way of its accomplishment.\n\nI have always understood that the people are not acquainted with the working of municipal forms of government, I will, therefore, take this opportunity to discuss it in a more natural manner.\n\nWe desire incorporation because it will place the destinies of this town in the hands of those who have the best interests at heart, who will make it what it should be.\n\nIt is not thought that large corporations are necessary, we desire that the people should be represented in the councils, and that landowners who should control it.\n\nWithout the buildings that have been erected on this ground, Prince Albert would not exist; without the vast areas of good farming land in the North West Territories. Another object of incorporation is to give the citizens a chance to be heard and to encourage others to follow their example, and make this a success.\n\nTo do this will be able to satisfy everyone that the town of Prince Albert is permanently bound; that the future prosperity of the town is undoubtedly based; that safety to life and property will be guaranteed; that there shall be a regular market for the produce and that purpose to make this the grain market and distributing point for the surrounding counties, the town being already built and to encourage others to follow their example, and make this a success.\n\nThe above with a small annual expenditure for improving, the roads within the town limits and the town hall, would be necessary to give a character of permanency to this town, which it does not possess now.\n\nIn conclusion, I am convinced that the incorporation of the town of Prince Albert is essential to its prosperity and welfare.\n\nSo far I have shown that the advantages are on the side of incorporation, but it is not my intention to argue the question, nor to state that the advantages are overwhelming.\n\nWe require capital, but capital is not lacking among the incorporated bodies, nor do we want to change with them or be left behind.\n\nWe are ready and anxious to co-operate with the Provincial Government in establishing laws, that incorporate the various units and progress, and working out the details in accordance with the principles and consequently in future assured.\n\n**COMIC HISTORY**\n\nTo the Editor of The Times,\n\nSir,\n\nIn your last week's issue you published an article on \"Incorporation,\" and if you will permit me to say so, I am not only a member of the incorporated bodies, but also of all who are interested in our future and well-being.\n\nWhile there may have been some misunderstanding regarding the advantages of local government and therefore hesitate, I cannot imagine any person who really understood the matter, would offer to view any obstacles in the way of its accomplishment.\n\nI have always understood that the people are not acquainted with the working of municipal forms of government, I will, therefore, take this opportunity to discuss it in a more natural manner.\n\nWe desire incorporation because it will place the destinies of this town in the hands of those who have the best interests at heart, who will make it what it should be.\n\nIt is not thought that large corporations are necessary, we desire that the people should be represented in the councils, and that landowners who should control it.\n\nWithout the buildings that have been erected on this ground, Prince Albert would not exist; without the vast areas of good farming land in the North West Territories. Another object of incorporation is to give the citizens a chance to be heard and to encourage others to follow their example, and make this a success.\n\nTo do this will be able to satisfy everyone that the town of Prince Albert is permanently bound; that the future prosperity of the town is undoubtedly based; that safety to life and property will be guaranteed; that there shall be a regular market for the produce and that purpose to make this the grain market and distributing point for the surrounding counties, the town being already built and to encourage others to follow their example, and make this a success.\n\nThe above with a small annual expenditure for improving, the roads within the town limits and the town hall, would be necessary to give a character of permanency to this town, which it does not possess now.\n\nIn conclusion, I am convinced that the incorporation of the town of Prince Albert is essential to its prosperity and welfare.\n\nSo far I have shown that the advantages are on the side of incorporation, but it is not my intention to argue the question, nor to state that the advantages are overwhelming.\n\nWe require capital, but capital is not lacking among the incorporated bodies, nor do we want to change with them or be left behind.\n\nWe are ready and anxious to co-operate with the Provincial Government in establishing laws, that incorporate the various units and progress, and working out the details in accordance with the principles and consequently in future assured.\nLouis Reil of insurrectionary fame has returned to Manitoba and will probably remain in Canada. His term of banishment expired two years ago. In an interview with a Scot settler he stated that the insurrection in 1870 was perfectly justifiable. This statement was explained as including all the acts of the insurgents, but the statement of Scott still defended, but let us not forget where the body was buried. He admits having received what he calls \"dirty\" money to the extent of one thousand dollars from Archbishop Tache.\n\nTHE MOST UNKINDEST CUT OF ALL.\n\nIn the case of the entire press of the North West was a unit of the notorious Louis Riel Government, but by the North West Council it is to be called together shortly the attacks ceased. But the Toronto Mail, which seems to think its mission on earth is to play the jester familiar to old England, thought that perhaps he should be allowed to escape, endeavors to defend him and so conceives once more the press of Manitoba and the North West. Mr. Dewdney certainly knew little of this. He was appointed to his present position by the Government, who knew or should have known that he was not possessed of any of the qualities necessary to make him a suitable man for the responsibilities which he has been called upon to perform. Even this would have been quite passed over if he had been fit to stand a considerable part of the time and some of the period which he held sway. But when the press learned that in addition to his being an absentee, he was using his official position to benefit his private end, and that the Council would not be called together again until at least another year on the policy grounds that there was nothing for them to do if called together, without taking into consideration the fact that this would mean property has been subject for the Council itself to consider. Mr. Dewdney has not done so much for the North West as the North West has done for him. No effort made by any party can place the matter in a better light than that in which it has already been placed. Nearly all the papers of the Territories are Conservative in tone, but they are not likely to be the biding of any leader of leaders and cannot consciously feel that Mr. Dewdney has been true to the trust reposed in him. Regarding the article in the Mail, however, he may well exclaim \"Save me from my friends,\" for it is certainly the \"most unkindest cut of all.\"\n\nEDITORIAL NOTES.\n\nIt is rumored that Sir A. T. Galt will shortly succeed Mr. Dewdney as Lieutenant Governor of the North West.\n\nThe recent Jean Baptiste celebration, and the strong French national speeches made by the orators on that occasion, bring out into the fact that the French population of Canada is characterized by a startling amount of solidarity which shocks no less for the total absence of religious division. The chain of generations completely cut in two by the French element, which obstinately refuses to intermingle with the English speaking race, and is driving it out. The problem presented in this fact is worthy of the study of statesmen.\n\nIt is proposed in 1884 to mark Sir John's forty years in public life by a public testimonial of some kind. It is said that Sir John has never been away from a party, Sir John does. He is the head, middle and tail of it and but for his acute control it would many times otherwise have been done disorganizedly.\n\nThere is a vacant seat in the Senate for the Kingston district. The name of Dr. Sullivan, of that city, is mentioned as a possible candidate in connection with it. The doctor is a man of intelligence and ability, and has strong claims upon the party. An appointment to the Senate like the Assizes of justice goes by favor, and a Conservative would be sure to get it. Dr. Sullivan would be a great deal more useful in the House of Commons, but the Senate would be none the worse of an injection of brains and ability.\n\nEvery assistance is being rendered to the unfortunate people whose homes were carried away by the floods in London. It is not often that Canada has to record an accident from such a cause, nor yet one of the kind which turns out to be so disastrous. Floods caused by the melting of the snow after a long winter, are not uncommon, but a flood from a persistent fall of rain is something unusual. More lives are lost and more damage is done through floods than through all other causes put together.\n\nThe trade dollar is soundly abused in the State, because instead of being a dollar, it is only eighty-five cents. It has fallen into great disrepute, notwithstanding that while it contains 420 grains of silver, the legitimate standard of only one grain less. It is being used as a strong argument for the flat money principle that the Government, by making the standard coin a legal tender, is doing more to destroy the trade dollar than the extra fifteen or twenty cents, while the trade dollar, which passes on its intrinsic value, is at a discount. Efforts are being made by the Government to redeem the trade dollar, but they are not likely to succeed. The most that the Government is apt to do is to call the trade dollar in at its current value for most purposes, and then to allow it to depreciate further due to the Asiatic trade, and was not officially signed for circulating in the State, but the American eagle, like the less pretentious barnyard fowl, has come to roost.\n\nMr. James Miller, the distinguished newspaper writer and poet at Quebec, the body of young Elmoire, who was drowned near Stone Mills, Belleville, has been recovered.\n\nWinnipeg and Western\n\nNEW GOODS ARRIVED THIS WEEK CONSISTING OF GROCERIES, Fancy and Staple.\n\nA LARGE AMOUNT OF CONFECTIONERY ETC., ETC.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing\n\n20 lbs Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes Baskets etc., etc\n\nSTEWART & WOOTTON\nTEA TABLE CHITCHAT.\n\nA baby in her mother's arms,\nA little girl with various charms;\nA tender mother young and fair,\nA lover with his heart sincere,\nA woman contented with much care,\nA mother with a darling child,\nA widow with tender looks and mild,\nAn old lady in a wrinkled brow,\nA dying bed and a dying vow.\n\nAwake! diggers in the frosted ground,\nSighing, weep, with a murmuring sound—\nThis is life.\n\nWhat may be said to be a favorite piece of sculpture with every man? The fellow that cut out—\n\"Yes,\" said the Chicago man, \"he's a dude, but he counts in the connection.\"\nHas he any friends?\nHere is another item for the impatient young man. A Petersburg, Va., young lady was poisoned while eating some oysters.\nIt is no longer polite to speak of a man as having been hanged. Say he went to the other world as an \"assaulted conjugal.\"\nA new resident in New York is Mr. Lewis. The young man will probably have hard work to keep the Jiff from the door.\nThe question asked us if there is anything that will bring youth to a woman's bed. Indeed. An income of $20,000 will bring a number of them.\n\"I guess that must be the flaw of the family,\" remarked the young man who had been watching with her, as he surveyed the walls of the white spot marked exclamation.\nA young man married against the wishes of his parents, and in fact his friend has to bear the new wife's expenses, said, \"Tell them first that I am dead, and gently work up to the climax.\"\nA lady who is anxious to make a pretty smile—\"Her is a catch a husband.\" But her theory is all wrong. Ask any married woman how to catch a husband, and she'll tell you.\nChas. looking at the bonnet, etc.—\n\"Don't you think they are very handsome when they are worn by the ladies opposite the store?\"—\"Yes, very, especially the one with the black moss taffeta.\"\nThe independent demands at Atherton's, formed a \"railway club,\" which as soon as formed was suffered to attend. Then a meeting was held to consider the question of a branch line, and the members were holding joint sessions.\n\nA BADNASTORY.\n\n\"We had captured a fish about while after the head was split open it was started to pick out the entrails. It's just like going into a big bath tub, and a man should be able to do it. I thought the fish was ending about in the monster's head, when I was suddenly startled by some one saying, 'That's a good fish,' and turned, and I afterwards learned, by one of the crew accidentally dropping a box, that the fish was not killed by me, but by the fisherman who had killed it with my smooth knife on my teeth. I returned to the boat after the fish was landed and made a desperate effort to get the fish out with the knife. I managed to get a hold by a enough to thrust my knife through the mouth and out the gills, and the fish jumped into the sea. It was a pretty tight squeeze, I must tell you, and I thought I was going to be killed by the water all around me. The captain of the vessel thought I had been killed instantly, and ordered me to be thrown overboard. As I was so frightened that he told me there was only one thing that prevented him from killing me on the spot.\"\n\nWhat was that called the Captain?\nHe was half-dead, said the mate.\n\nNOTICE.\n\nThe Winnipeg and Western Transportation Co. have purchased two Western and Eastern passenger cars and baggage cars, and will be running these cars on the line between Winnipeg and Edmonton. Any freight left in the Western office will be sent to the nearest station for storage at the rate of 15¢ per cwt.\n\nMr. R. B. REATTY will have charge of the warehouse.\n\nJ. H. DAVIS, Superintendent.\n\nFOR CASH.\n\nA. L. ASHDOWN.\n\nTENDERS\n\nWALTERS\n\nAND\n\nBAKER,\n\nGeneral Merchants.\n\nSTOBART,\n\nEDEN\n\n& CO.,\n\nGeneral Merchants\n\nAND\n\nIndian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nSTORE TO LET.\n\nApply to\n\nJ. M. Campbell\n\nNOTICE.\n\nTo Merchants and Others.\n\nAccounts collected or Business Books written up, bills drawn, etc.\n\nWill call on any merchant personally or by letter at the Post Office or Town Office.\n\nA. R. BURNS.\n\nAt Cost\n\nSELLING OFF\n\nFOR CASH.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\n\nBill Heads,\n\nEnvelopes,\n\nCirculars,\n\nDodgers,\n\nBusiness Cards,\n\nLegal Printing,\n\nPamphlets,\n\nEtc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT.\nITEMS OF INTEREST.\n\nThe London Telegram (Herald) made its appearance for the first time.\n\nHughes purchased Crocker's mill at Hamilton.\n\nAt New York, a fire in Leonard Smith's shoe factory on Commerce street caused a loss of $30,000.\n\nOutside Chicago was holding out at the rate of six cents per barrel.\n\nEight belles in the automobile furnace. Hughes' expanded simultaneously with failure.\n\nHughes opened W. Mills' grocery store at Hamilton and stole cigars, tobacco, and other goods.\n\nAn aged criminal was robbed of $25,000 in the district of Detroit on the night of the 14th inst.\n\nGuns were found in the vaults at Rochester, with his skill frustrated.\n\nFly play is suspected.\n\nAt Niagara Falls, lightning struck a stage coach killing six passengers.\n\nYouth was instantly killed.\n\nG. Fitch & Co., cigar manufacturers, Messrs. Murray & Co., have demanded their main operations for higher wages.\n\nThe thousand imported British cattle are in quarantine in Europe, being the largest number at one time for years past.\n\nThe situation of affairs in London West continues to be difficult, and the police have been called into action to maintain order.\n\nA son of Mr. Fenner, assistant post master of Montreal, was drowned while bathing in the river at Assumption College.\n\nJ. J. Nobbs, of Atlantic Highlands, N.S., has disappeared.\n\nHe wrote a letter to the New York Tribune indicating suicide.\n\nThe traffic between Liverpool and London on the Great Western Division, stopped by the recent accidents, has been resumed.\n\nJonathan Stirling, a tailor, from Dorchester, near Montreal, England, died on the Patriotic's last passage out and was buried at sea.\n\nMrs. Johnson, a flabby American woman, who recently created a sensation at Montreaux, again escaped from custody and was at large.\n\nAnother detachable outrage is reported from London.\n\nA man named Frederick Verona, who was accused of outrageing a child of five years old.\n\nAt Riviere du Loup three youths were drowned while fishing out one of them, but the cause of death could not be ascertained.\n\nThe San Domingo Company has paid the coupons on its bonds at $18.67 per cent for shipments made during the period from February to June.\n\nThe $300,000 worth of property valued by the Board of Assessors at New York has been returned to their owner, he is intended to take it to Mexico.\n\nAlbert Whitcomb, recently arrested for life in New York, with the London dynamite plot, proven to have been a former resident of Lawrence, Mass.\n\nEdward O'Connell, of Lynn, Mass., who inspected the docks at Montreal and was rescued a few days ago, will be tried for attempted murder.\n\nThe detective force under the division of the Treasury has issued instructions looking to suppressing the manufacture of bangles in imitation of gold and silver coins.\n\nThe Board of Trustees of the Kingston Women's Reform Society has approved a resolution of the faculty, and the work of organization is being rapidly pushed along.\n\nMasons, Van Rijn & Co., of Montreal, a German firm, when the Pioneer Boot and Shoe Company purchased their business, asked for the appointment of an assignee.\n\nIn the absence of proof of death, the insurance companies refuse to pay any claim on the estate of Mrs. Anna Hannah, who disappeared from Montreal Monday.\n\nHow the prisoner's personal Mr. Justice to be appointed chief clerk of the court of common pleas. This is the first judge who has been appointed since Judge H. L. Miller resigned.\n\nAt Cedar Rapids, La., recently, Anna Warner, white, aged 15, daughter of James Warner, of Cedar Rapids, Chariot, Acorn, and Cross, near the North River Hotel. The girl has been imprisoned.\n\nThe new season.\n\nMAMMOTH Flower and Vegetable GARDENS\n\nJOHN BROWN\n\nPRINCE ALBERT\n\nA Choice Variety of Vegetables\n\nJOHN BROWN.\n\nNew Ferry.\n\nLe Prince's Crossing, S.B.\n\nA new ferry has been established and is now running regularly across the river.\n\nSHANNON & McLEOD.\n\nREMOVED.\n\nJ. L. JOHNSON & CO.\n\nHave removed to their new building.\n\nN.B. We claim to have the best assortment of Steel and Heavy Hardware in Prince Albert.\n\nPrices Guaranteed Satisfactory.\n\nBUFFALO HALL.\n\nDRESS GOODS\n\nInfants' Elegant ROBES & CLOAKS.\n\nLACE REMNANTS.\n\nCLOTHING.\n\nREADY MADE OVERALS.\n\nBEETTS & Gwynne.\n\nMESSRS. Peterson, Hanafin & Keenan,\n\nWill sell by Private Sale until the First of September next the following property:\n\nParcel No. 1: 100 acres or 50 lots according to the survey of Geo. McKay property.\n\n2. Part of lot 1 block 1, Mason property.\n\n3. Lots 1-4, Main Street, north side, 1829.\n\n4. Lots 8 and 9, Graham street, Tom Taylor's property.\n\n5. Lots 16, 17, 18, and 19, south side of Second street.\n\n6. Lots 20, 21, 22, and 23, north side of Fourth street.\n\n7. Lots 24, 25, 26, 27, and 32, south side of Fourth street.\n\n8. Lots 30, 31, and 32, north side of McLaren street.\n\n9. Lots 1, 2, and 3, south side Victoria street.\n\n10. Lots 1, 2, and 3, north side of Third street.\n\nWith a large addition of other valuable property in the Town and county.\n\nFor further particulars apply to\n\nJ. D. Hanafin or H. Keenan.\n\nCITY AUCTION MART.\n\nMARKLEY & ORR,\n\nReal Estate and General Agents. Sole Agents in this district for the\n\nT. E. JACKSON. The Celebrated New York Singer Sewing Machines.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883080101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 5540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 7951, 1], [7951, 13884, 2], [13884, 18508, 3], [18508, 18508, 4], [18508, 18508, 5], [18508, 23721, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]