[{"id": "95de652f7e3a684c21ab9869af8104009a234265", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, BASK., FRIDAY, JULY 20, 1885.\n\nBANKING HOUSE OF Macarthur & Knowles, Prince Albert, N.W.T.\n\nPRINCE ALBERT, Bank, N.W.T.\n\nFRUIT\n\nFRUIT\n\nFRUIT\n\nNOTICE.\n\nTIME EXTENDED.\n\nThe Saskatchewan Photograph Gallery.\n\nPhotograph will remain open until the 30th of August, inclusive.\n\nPlease hang your orders early, and secure the best results.\n\nH. A. HEAD.\n\nFRUIT\n\nFRUIT\n\nFRUIT\n\nCARD OF THANKS\n\nMr. Hughes begs to tender his sincere thanks to the voters of the District of Prince Albert who gave him such generous and almost unlooked for support at the late election.\n\nNOTICE.\n\nA meeting of the members and allies of the Conservative Party will be held in the Council Chamber, Prince Albert, July 30th, 1885.\n\nBy order,\n\nJ. R. HOWARD,\n\nPost Office Jewellery Store\n\nB. B. WAY\n\nTHANKS\n\nTo those friends in the different polling divisions who gave me such a warm support, and elected me as one of their representatives in the new Legislative Assembly.\n\nFor which I shall ever be grateful.\n\nYour faithfully,\n\nWM. PLAXTON.\n\nPRINCE ALBERT\n\nTOWN COUNCIL.\n\nThe Town Council held an adjourned meeting Friday evening last. Hon. Wm. Maclean, Mayor, was present. The councillors present were: McNeil, Stewart, Agnew, Johnson, Knowles and Davis.\n\nThe minutes of the last meeting were read and adopted.\n\nACCOUNTS.\n\nThe following accounts were ordered to be paid: J. D. Handley, $16; Thos. Horne, 75 cents.\n\nThe principal business before the meeting was the estimate for the year 1884-85 and also the question of what the town is laying before the council the amount of money expended so far and that required to be expended during the coming months. The consideration of these estimates created quite a bit of discussion.\n\nREPORTS.\n\nThe chief item of the Finance Committee's report that has been submitted is the estimates for the present year—\n\nBoard of Works, $6000; Fire Water and Light, $500; Health Inspector, $400; Board of Education, $11,100; Roads, $500; Council Chamber, $500; Road Dump Ground, $500; Amount due P.A.C. Bank, $500; M.R. Co., $500; Post Office, $500; Overdrawn account, $500; Wood and Light, $500; Printing and advertising, $50; Salaries, $250; Sundries, $500; Police Constable, $250; C. School, account, $75.\n\nCom. Agnew moved and seconded by Com. Davis, that the Estimates of the Finance Committee be adopted.\n\nComs. Knowles and Davis brought forward an amendment that the following estimates be added by the chairman of the Board of Works be struck out—Road No. 1, $100; Road No. 2, $50; Road No. 3, $200; Road No. 4, $150; Road No. 5, $100; Road No. 6, $200; Road No. 7, $25.\n\nCom. Davis moved and seconded by Com. Knowles, that an amendment to the above, that the sum of $250, that appears in the report as estimate of the Board of Works be struck out—Road No. 3, as reported by the ratepayers of that ward be petition to the council.\n\nThe amendment to the amendment to the previous motion was lost.\n\nMoved by Com. Davis and seconded by Com. Knowles that the estimate for Fire Water and Light be cut by $100.\n\nLost.\n\nMoved by Com. Knowles, seconded by Com. McNeil, that King Street north of First Street be put in repair; also that the estimate of McKays post, in the vicinity of Third Avenue, be increased by $100, and an appropriation of $100, for this purpose be added to the estimate.\n\nLost.\n\nThe motion for the adoption of the report as it stands was carried.\n\nCOMMISSIONER'S OFFICE.\n\nThe Hon. Mr. and Mrs. Clark were among the passengers who arrived down by the North-Western.\n\nA large store of staple Drugs and Chemicals of the best quality has just been received by Mr. T. E. Jackson.\n\nMr. R. H. MacKintosh, Indian Agent at Dark Lake, was here yesterday. He had returned from his longest ever trip.\n\nCom. Davis and family have returned to their country residence, where they will reside during the hot summer months.\n\nA general meeting of the Lorne Agricultural Society was called for Monday night. Business of importance.\n\nThe steamer Northwest arrived down from Edmonton yesterday. Battledore on Saturday evening and on Sunday morning left for Grand Rapids.\n\nAs may be seen by advertisement, the Saskatchewan Finance Committee meet next month the 20th of August, when it will be closed for the season.\n\nParties requiring work done, should have their names on the list, or they cannot be completed by that time.\n\nThe many friends of Mr. W. R. Gunn are glad to hear that he has been appointed Inspector for this district. Mr. Gunn is a young man of good ability and will make a good officer. We congratulate him upon his appointment.\n\nCom. Stewart, who is engaged extensively in the mining business, lost his horse while driving from the range last fall from Moose, J. R. Hunter of the University of Western Ont. Heavy is the cost of loss of death. He also lost a very valuable cow.\n\nA meeting will be held on Wednesday afternoon at the Hotel Regina for the discussion of the proposal of organizing a branch of the Royal Templars of Tempsk. Mr. D. C. McLellan, the Secretary, will explain the full working of the order. The meeting will also be addressed by all the prominent citizens of the town. All who are in favor of the scheme are invited to be present.\n\nThe steamer white and grey will be running next for ten cents per yard. They beat all others. Waiters and Bakers.\n\nAn old man named Mr. F. G. Smith, from New Brunswick, says I am going on 75 years of age and had very little hope of ever seeing my wife again after my death. Having heard about Mr. Smith I sent to pay for a package. It has done me good. I send you two packages. I am going for a further second part of which I intend giving to an afflicted friend. I advise all sufferers from curvature to use Nano's Balsam.\n\nSubscription for newspapers on Com.'s Board. Subscriptions received for all Canadian, American and Foreign Periodicals at lowest rates.\nThe Prince Albert Times\n\nAnd Saskatchewan Review.\n\nPublished by J. D. Mavety at Prince Albert N.W.T.\n\nTerms—$2.50 per annum in advance.\n\nIn no case will any part be inserted in these columns.\n\nTransient advertisements (not for less than two months) $3.00 per line per month.\n\nNewspapers—Can be inserted at $1.00 per line.\n\nA Letter to the Editor addressed to the Proprietor.\n\nJ. D. Mavety, Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nat Allan's Church—St. John's Church—3 p.m., Rev. Mr. Keay; St. Katherine's—10:30 a.m.;—Rev. Casso Preacher.\n\nST. PETER'S—3 p.m.;—Rev. Casso Preacher.\n\nST. PAUL'S—6:45 p.m.;—Rev. Mr. Kay.\n\nST. JOHN'S—3 p.m.;—Rev. Mr. Kay.\n\nTuesday Morning Service—St. Paul's Church—8:00 a.m.;—Rev. Mr. Wilcox.\n\nWednesday Afternoon Service—St. Paul's Church—3:00 p.m.;—Rev. Mr. Keay.\n\nThursday Night Service—St. Paul's Church—7:30 p.m.;—Rev. Mr. Keay.\n\nFriday Evening Chapel—St. Paul's Church—7:30 p.m.;—Rev. Mr. Keay.\n\nFRIDAY, JULY 20, 1898.\n\nTHE LIEUT-GOVERNOR.\n\nThat Mr. Dewdney's successor as Lieutenant-Governor will prove acceptable to the people of the Territories we have no doubt; Mr. Royal is a man of great ability and energy, and has for eighteen years been closely and intimately connected with the history of Manitoba and the Territories. As a member of the Manitoba Legislature, and latterly as Attorney-General of that province and subsequently as a member of the Dominion Parliament, he has always worked strenuously to further the interests of his adopted Province. In Mr. Royal's case there has always been a strong bond between him and others who had him appointed with pleasure. An abiding prejudice appears to exist in the minds of some people against Mr. Royal because of his use of French nationally. It should be borne in mind that the Lieutenant-Governor does not possess absolute power, and even if so inclined can do nothing more than he will be governed solely by the advice of the Executive Council; the members of which will be all English, as there is not one Frenchman elected to the Legislative Assembly. We predict that Mr. Royal will be very popular as Lieutenant-Governor, because he will attend to his high office impartially and to the advantage of the Territories and the benefit of the people over whom he has been called to rule. We do not believe in the principle of condemn- ing a man before he has been heard, and therefore urge our readers to ask of our friend Mr. Royal a fair trial, confident that at the end of his term there will be a unanimous verdict given in his favor.\n\nThe office of Lieutenant-Governor of the Territories is not by any means a sinecure. There are many things to do and no more permits, and there is probably no office in Canada requiring the same amount of statesmanship than the administration of our affairs, but Mr. Royal will we believe through his ability, and the goodwill of the country-side equal to the occasion.\n\nNORTHWEST ASSEMBLY.\n\nThe elections being over and all returns made, it is now definitely known who constitutes the first Legislative Assembly of the North-West Territories. All the representatives of Saskatchewan are good men, and we believe that the interests of the District will be closely watched by them. It is true none of them have had any experience in Legisative work, but they are all men of sound sense and capable of learning, and as they all have the interests of their constituents at heart, the lack of experience will not be a great detriment. Eleven of the Western members have here- tofore held seats in the Northwest Council. Politically the character of the present Assembly is strongly Conservative. There are eighteen Conservatives elected out of forty Liberal seats. It is true the elections were not conducted on party lines, but if the question of party should unfortu- nately creep into the Assembly, the result will certainly be a large Conservative majority. We trust that at the end of three years our members will have secured many benefits for the District, and that Saskatchewan will have so advanced in population and importance as to entitle it to a full Provincial responsible Government.\n\nWe are pleased to be able to announce that the banquet given to D. H. Macdonald, M.P. for Saskatchewan, under the auspices of the Liberal Conservative Association of Prince Albert, was a most gratifying success in every particular. The number present was very large, and included not only not only Conservatives, but Liberals as well, some of whom expressed their satisfaction at Mr. Macdonald's conduct as their representative. We shall publish an extended account of the banquet in our next.\n\nFRIDAY, JULY 20, 1898.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, Express Office, New York. General Rates—Main Line, 10¢ per line.\n\nFRIDAY, JULY 20, 1898.\n\nHorse Shoe Store\n\nJust arrived—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\n\nFifty Chests Choice Congo Tea\n\nWhich we will sell until further notice at 25¢ per lb.\n\nFresh importations in Fancy Dry Goods, Millinery, Ribbons, Hosiery, etc., etc.\n\nFull Lines of Windowcurtains\n\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\n\nJust arrived—Large Stock of PATENT MEDICINES, STATIONERY, ETC. ETC.\n\nBOOTS AND SHOES ARRIVING WEEKLY\n\n10,000 CHOICE CIGARS!\n\nAt Manufacturer's Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS IN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed, Suitings, Trowsering and Overcoating Worsted, in English and American lines, CANADIAN TWEEDS in all varieties from the best manufacturers in the Dominion SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. Campbell\n\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black INK, ALL SIZES—WRITING AND COPYING Office Stationery, etc., etc.\nORDINANCES.\n\nThe following Ordinance are published for the information and guidance of our settlers.\n\nFEES.\n\nAn Ordinance to Amend and Consolidate, as Amended, the several Ordinances Respecting Prairie and Forest Fires (Passed, November 19th, 1887.)\n\nIt is enacted by the Lieut.-Governor of the Northwest Territories, in Council, as follows:\n\n1. Any person who kindles or places or is a party to kindling or placing fire in the forest, or any part thereof, the Territories, except for the purpose of domestic purposes, or clearing land in the month of December, January, February or March, except in the case of a fire caused by lightning, shall be liable on conviction thereof to pay a fine not exceeding $200, with costs of prosecution, and shall be imprisoned for a term not exceeding six months. Provided always that a person may be convicted under this Ordinance present during the whole time of the burning six persons with proper appliances for putting out fire, or without such assistance, having a ploughing team not less than ten feet wide.\n\n2. Any person who kindles or is a party to kindling or placing fire in the forest, except for the purpose allowed in the next preceding section, and allows such fire to escape, shall, on conviction, be liable to a fine not exceeding $200, with costs of prosecution; and in default of payment, be imprisoned for a term not exceeding three months.\n\n3. Nothing in this Ordinance shall be or prevent the owner of private property from removing fire, or from any of the fences against the first and second sections of this Ordinance.\n\n4. Prosecutions under this Ordinance shall be in a summary manner.\n\n5. The Lieut.-Governor may appoint fire guardians having the power to enforce the provisions of this Ordinance, who, together with all peace officers, have the power to call out any male person within five miles of prairie fires, to proceed at once, and help to extinguish said fires, and to arrest any person doing so, and shall be liable to a fine of $10.\n\n6. It shall be the duty of all peace officers, and of every person who has any of the enactments of this Ordinance forthwith to arrest the offender, and without warrant bring him before a Justice of the Peace to be dealt with according to law.\n\n7. Ordinance No. 21 of 1885 and No. 18 of 1886 are hereby repealed.\n\nMARKING OF STOCK.\n\nAn Ordinance to Amend and Consolidate as Amended the Marking of Stock Ordinance, 1886.\n\n(Passed Nov. 19th, 1887.)\n\nBe it enacted by the Lieut.-Governor of the Northwest Territories, in Council, as follows:\n\n1. In this Ordinance the word \"brand\" shall mean brand or mark or vent brand, and the word \"record\" shall include any horse, cattle, swine, sheep, goats, dogs, as well as any cattle or animal of the same description.\n\n2. The Lieut.-Governor may, whenever he thinks it desirable that the provisions of this Ordinance should apply to any part of the Northwest Territories, set apart by proclamation such portions thereof as he may designate, and designate the same as a stock district, and designate by a number, commencing with \"1\" and so on, as many different districts as are set apart.\n\n3. The Lieut.-Governor may designate persons to be the recorders of brands for the district so formed, whose offices shall be kept at a place to be designated by the Lieut.-Governor.\n\n4. The Lieut.-Governor shall name two suitable persons, who, together with the recorder, shall form a Brand Committee for the district.\n\n5. The Brand Committee shall meet at the office of the Recorder of Brands at least twice in each year to consider applications for recorded brands according to priority to application to the recorder, and shall designate the number of brands to be used by any applicant, and define the place and position it shall occupy on the hide or other part of the animal, or convenience of marking, so far as may be, without interfering with previously recorded brands.\n\n6. The recorder shall keep a record of all brands with a facsimile of the same, the name and residence of the person owning the animal, and the date of the brand for which the book shall be paid for by the Lieut.-Governor out of the General Revenue of the Northwest Terri- tories, and shall be the property of the\n\nNorthwest Government, and shall be free to the inspection of all persons interested, and shall furnish to any person, on application, a certified copy of any brand deemed necessary in the case.\n\n7. Any person using a like brand in any part of the province recorded by another, or attempting to alter or obliterate a recorded brand of any other person, shall be liable on conviction in a summary manner to a fine not exceeding $100, and in default of payment of such fine to imprison- ment not exceeding forty days for each offence.\n\n8. It shall be the duty of every person purchasing or selling to the public by retail any stock which is branded, without such stock being marked or stamped, to cause the brand to be placed in such position as to obliterate or efface the same, and if any such animal or vent brand shall have been branded as above, it shall be prima facie evidence of the same.\n\n9. Every person recording a brand shall also at the same record and register his name.\n\n10. If any person hereafter sell brand or cause to be branded any stock without the owner's consent, he shall be liable to a fine not exceeding three times the value of the animal so branded, and any such person shall be liable to a fine not exceeding $100, and in default of payment, to imprisonment for thirty days.\n\n11. The owner of any recorded brand may, by writing, transfer the same to another person, and record the transfer, and the transferee shall have thereafter all the rights of the person who first recorded the brand.\n\n12. The presence of a recorded brand on any animal shall be prima facie evi- dence of the ownership of such animal by the owner of such brand.\n\n13. The following fees shall be payable to the recorder for recording each brand: 25¢ for each certified copy of every recorded brand; 50¢ for every search for brand.\n\n14. The Recorder shall, on the last day of the month of January and July in each year, make a return to the Lieut.-Governor, written on forms before Judge of the Supreme Court, showing the enrolments of his office during the six months ending June 30th.\n\n15. All brands or marks recorded by Charles E. Wood, acting as Recorder for Markham District No. 1, shall be ratified and confirmed as officially recorded under Ordinance No. 14 of 1884.\n\n16. Ordinance No. 14 of 1884 is hereby repealed.\n\n17. This Ordinance may be cited as \"The Brand Ordinance, 1887.\"\n\n---\n\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nSUCH REDUCTIONS FOR\n\nFirst Class Goods\n\nNever before heard in Prince Albert. We are showing\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous season, both for richness design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\n\n---\n\nNOTICE\n\nAll parties indebted to Alex. H. Clark, of Edmonton, Alta., are respectfully notified to pay the same within thirty days after publication of this notice. Also, Mr. Albert, Merchant, of Prince Albert, Alta., is requested to settle all claims against him, as per notice given Alex. H. Clark, who is requested to send all claims against him within thirty days from the date of this notice.\n\nJOHN STEWART.\n\nUnclaimed. Editor of Alex. H. Clark Prince Albert, Alta., A.D. 1888.\n\nDISOLUTION OF PARTNERSHIP.\n\nWOODMAN BROS\n\nAre dissolving partnership. All parties having any claim against us are respectfully requested to present the same to us by the 1st day of August, and all parties indebted to us are respectfully requested to present the same before that date, after which all claims will be considered as barred for collection.\n\nMr. Harry Woodman will continue in the business, and Mr. Woodman will move the Livery outfit to Prince Albert, where he will join his Brewery.\n\nCHAR. WOODMAN.\nHARRY WOODMAN.\n\nVICTORIA\n\nLivery and Boarding Stables,\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double their original size, we would respectfully request the patrons of travelling public to visit our convenient location.\n\nWall and river water almost at door.\n\nWe are now prepared to give you, in addition to our well known list of prime roosters, and the public can now get them getting as good turnouts as they ever had before. Working at reasonable prices.\n\nRoosters sold at reasonable prices.\n\nN.R.—Our rigs are new, and not liable to breakage.\n\nNEILSON & McBEATH\n\nJ. DOOLITTLE,\n\nQUAPPETTE STATION.\n\nAgent for the sale of A. HARRIS & Sons Co's Farm Implements and Machinery\n\nBrentford Light Steel Binders,\n\nPoveshell Mowers,\n\nPoveshell Rakes,\n\nSulky & Gang Plows\n\nBreaking and Cross Plows,\n\nThreshing Machines,\n\nBain Wagons,\n\nBinding Twine, etc.\n\nA large stock of repair parts constantly solicited.\n\nWarehouse Opposite Queen's Hotel\n\nTHE BEST BRAND\n\nNESTLE'S CONDENSED SWISS MILK.\n\nPRIVATE SEAL, SWITZERLAND.\n\n\"A half pound sample mailed to any address on receipt of postage stamps.\"\n\nIn ordering always specify NESTLE'S.\n\nHOS. LEEMING & Co., Montreal.\n\n---\n\nANY MAN\n\nWho is weak, feeble, debilitated, suffering from any of the various ills of body, mind and spirit, is invited to seek the aid of Dr. F. D. CLARKER, M.D., Chicago, Ill.\nPUBLIC SCHOOL CLOSING.\n\nOn Friday last our public school closed for the holidays, and in the evening the children gave a recitation, which was a short credit to pupils of every grade, and we must say that the entertainment was very satisfactory. The prizes given to Prince Albert. The prizes given at the close of the winter term, March 1st, were presented by Mr. Macdonald. They were given for regular attendance and proficiency in the principal subjects taught.\n\nThe prizes for regular attendance were given by Mr. Macdonald. The prizes had been awarded a certain number of days during the winter term. The prizes for proficiency were given by Mr. Macdonald, Mr. Kay, Principal of Emmanuel College; Mr. McLeod, Principal of High School; the Rev. Dr. Jamieson and the Rev. Mr. Howard. The evening's programme included the children singing God Save the Queen.\n\nThe following is a list of prizes:\n\nFor regular attendance—Bell Stewart, Emma Taylor, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nFor proficiency—Miss Taylor, Emma Taylor, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nARITHMETIC.\n\nFourth class—Miss Martha Thompson, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nSecond part—Miss Martha Thompson, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nSPELLING.\n\nFirst class—Miss Martha Thompson, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nSecond part—Miss Martha Thompson, Florence Pritchard, Miss McKee, Jessie Johnson, Willie McLeod, Donald McLeod, Mary McTaggart, James McTaggart, Thomas Thompson, Owen Macdonald, Willie McLeod, James McTaggart, John Macdonald, Robert McTaggart, Willie McLeod, Fred McLoud, Alex McLoud, George McLoud, John McLoud, Robert McLoud, Robert McLeod, Stewart Campbell, Rob. McLoud, Johnny Ray, Jimmy McLeod, Douglas Murray, William Johnson, Mary Stewart, Winnie Campbell, Rob. McTaggart, Johnny McLeod, Willard Goodchild, Arthur Way, Willie Carter, Joseph Thompson, James Thompson.\n\nDelightful weather for the crops.\n\nA new White Sulphur Machine for sale. This is the best machine made and will be sold cheap. Walker & Baker.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888072001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 6486, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5897, 1], [5897, 12009, 2], [12009, 21611, 3], [21611, 26149, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]