[{"id": "ec3f965f40cda0924e0ebd77a97577f307857dd5", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FRIDAY, JANUARY 25, 1884.\n\nMETHODIST CHURCH.\n\nServices—Evening, 7 p.m., at the Mission.\nRev. Caleb Parker pastor.\n\nBANKING HOUSE\n\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nTradesmen & General Banking Business.\nInterest on Deposits.\nDrafts & Cheques available at all points in the Dominion.\nChecks & Undertakings promptly attended to.\nBankers—Merchant Bank of Canada\n\nJohn B. DUNLOP, M.D.,\nLic. of the Royal College of Surgeons,\nLic. and M.C. of the King's and Queen's College of Physicians, Ireland.\n\nTHE MISSION.\n\nMcLean & Elliott,\nBarristers, Solicitors, Etc.\n\nPRINCE ALBERT—N.W.T.\nW. A. McLean.\nS. C. Elliot.\n\nW. H. GUNN, M.A.\nAssessor, Surveyor Public, Contrepreneur.\n\nOffice—Second floor, Post Office building, opposite the Presbyterian Church.\nPost Office—Main Street, Mission.\n\nPRINCE ALBERT—N.W.T.\nWilliam V. MacLise.\nBarrister, Solicitor.\n\nThe Grand Central Restaurant.\n(Old Woodbine Saloon.)\n\nTHAMES RESTAURANT has opened and is now ready for business.\n\nMEALS AT ALL HOURS.\n\nTHOMAS ORAM—PROP\n\nPUBLIC NOTICE.\n\nNotice is hereby given that the South Saskatchewan Valley Railway Company will apply to the Parliament of Canada at its next session for an Act to extend the time for the commencement and completion of the erection of the line of said railway, and to otherwise amend their Act of Incorporation.\n\nKILVERT & DUGGAN,\nSolicitors for Applicants.\n\nHamilton, October 9, 1883.\n\nNOTICE TO THE PUBLIC.\n\nMeals at all Hours\n\nFIRST CLASS\n\nHAY & BARLEY\n\nW H BARTLETT\n\nTO FARMERS AND OTHERS.\n\nThose desiring to dispose of IMPROVED FARMS in this District are requested to send full particulars, with lowest cash price to be paid, to the undersigned, who will make every effort to sell the same, or if they are unable thereto, will offer them for sale at public auction.\n\nMcLean & Elliott,\nBarristers,\nPrince Albert, N.W.T.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\nProprietor\n\nREMOVED.\n\nDR. BAIN\n\nThis removed his office to the new building in rear of the Presbyterian Church.\n\nOFFICE HOURS\nFrom 9 A.M. to 12 P.M.\nFrom 1 P.M. to 6 P.M.\n\nPUBLIC NOTICE.\n\nAll persons who have signed notes in favor of the Confederation Life Association, falling due Jan. 31st, are respectfully requested to provide for the same on or before that date. A. W. E. Markley, agent.\n\nWe are pleased to report that a special general meeting of this club will be held at the home on Saturday evening next, the 26th inst., at 8 o'clock, as usual, and we trust will be submitted a full and practical indication as to particular request.\n\nD. J. WAGGONER,\nCrown Timber Agent.\n\nPublic Notice.\n\nNotice is hereby given that until January 15th the underground may be found at the Dominion Lands Office, Prince Albert, for the purpose of receiving evidence, etc., concerning claims to land in that district.\n\nOn application for appointment will be made for those who, for reasons of residence in any particular claim or claims preferred.\n\nBlank forms, on which evidence in a majority of cases is to be formulated, will be furnished.\n\nBy authority.\n\n(Signed) W. PEARCE, Inspector.\nDated at Prince Albert, January 22, 1884.\n\nNotice is hereby given to the Parliament of Canada of the intention of the Minister of the Interior or the Local Agent of Dominion Lands for the District of Prince Albert to take possession of the Interior may direct.\n\nNotice is hereby given that quarter section not having timber on it, may, on payment of $100, be purchased by the Dominion Lands, purchase a wood lot containing twenty acres in extent, at $5 per acre.\n\nAny person other than a homesteader who has been granted a timber lot must make application therefor to the Secretary of State, and shall pay without authority must pay the dues of $100, as above stated.\n\nNotice is hereby given that the said timber will be confiscated under the provisions of the Act.\n\nD. J. WAGGONER,\nCrown Timber Agent.\n\nEntertainment.\n\nThe annual match for the California medal was played for by parties last Friday on the Prince Albert rink by members of the club. The prize was secured by L. J. Johnson.\n\nTHE LATE WILLIAM MCKAY.\n\nWe have been requested to publish the following testimonial of the esteem in which late William McKay, Factor H. E. Con, was held by the members of Mounted Police stationed at Fort Pitt (this former residence) which was for- warding by Mr. J. Dickens, Inspector Com.\n\nHerbert A. Elmoine,\n\nJ. Dickens,\n\nCharles Phillips,\n\nJames Murray,\n\nJohn Teaster,\n\nJ. D. Harkins,\n\nJ. E. Lair,\n\nJ. A. Norton,\n\nT. Benson,\n\nJ. T. Murray,\n\nJ. Yealland,\n\nC. Burns.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAWEETY.\nJ. D. MAWEETY.\n\nPRINCE ALBERT, N.W.T.\n\nTERMS—85¢ per copy in advance\nsingle copies, 10 cents each.\n\nIn no case will price be increased in this paper, except by 2½ cents per line.\n\nAll letters to be addressed to the Proprietor.\n\nTHE HUDSON BAY ROUTE.\n\nThis important subject continues to occupy the attention of the press of Manitoba and Ontario as well, and there is no question of such paramount interest to Prince Albert and the whole of the North West Territories as the question that any urgency is necessary for giving up a large portion of our editorial space in this issue to republish extracts from our exchanges and also from very recent papers recently delivered by E. P. Lennox, M.P.P., Warden of Kidston. The necessity for a shorter and cheaper outlet for the grain of Manitoba and the wheat of the market, and the Old World is every day becoming more apparent and it is only a question of time (and that not a very long one) before a railroad will be constructed to the waters of Hudson's Bay, either at Nelson or Churchill, having the latter is admitted to be most suitable. A deputation from the Farmers' Convention which was recently held in Winnipeg waited upon the Minister of Railways and urged upon him the importance of granting a subsidy to this road. The reply was that as the proposed route lay outside the present boundaries of Manitoba it could not be extended and so to it, but by later papers we notice that the premier has gone to Ottawa, with the object (amongst other things) of obtaining legislation to extend the boundaries of the Province of Manitoba so as to cover the proposed route, in which mission he will probably be successful. When we consider that oats have been selling in Britain during the eight months past at twenty cents a bushel, and wheat from forty to fifty cents, (we are not quite as bad as that here) it will be readily seen that the occupation of the far north is not a very promising one, no matter how abundant our crops may be. The Government of Manitoba and the City of Winnipeg also could well afford to heavily bonus land grants and a more liberal, my dear, habituating settlement will open the way to the Hudson Bay, by the shortest and most practicable route, which there is no doubt is by the western side of Lake Winnipeg, to Churchill. Hatton has just appeared with an article from a recent editorial in the Winnipeg weekly Free Press.\n\nOf all the proposed remedies for the difficulties under which the country is laboring, the construction of the railway to Hudson's Bay is kept most constantly and insistently before our population and newspapers, particularly in Manitoba, especially. It is both natural and proper that this should be so, for it is at once the greatest want of the country, and, despite whatever physical obstacles may lie in its way, likely to be the most speedily accomplished. The natural obstacles have been pretty fully discussed, with the result that the great majority of the Manitoba farmers are away from any doubts that may have been in their minds as to the feasibility of the work to be undertaken. The route to be taken overland on the Bay is evidently well within the range of practical capability, and this once accomplished, the way is open. We will suggest to his communication leave the vessel owners to look after the rest. When half a million tons of grain are being sent for so long into the interior waters of Hudson's Bay for comparatively small and speculative profits, it may surely be expected that staunch steamers will be provided for a certain trade. Increased traffic will be demanded for the future; all at events the people of this province regard it as so far settled that they give but little attention to the form of ways and means of providing the military accommodation.\n\nWith regard to the Hudson's Bay Railway, the Government contended then, alike with settlers forth their inability to make the necessary financial sacrifices. That is, they intimated that there were legal obstructions in the way of the railway being constructed, and that the boundary of the Province being fixed would prevent them from doing so. If their difficulties in matters of this nature in respect will be taken, it follows that there must be some limit to the extent of the Province as it now stands. The Premier said he would include all the territory through which the road will run, for we are assured that the Government will be anxious for the construction of the road being begun. The Premier, we believe, intends to push the matter strongly. The rumour also goes—and with every appearance of truth—that steps are being taken to secure the necessary changes to the boundaries of the Province. This he cannot do without the acquiescence of the Federal Government in his negotiations with the Federal Government. The extension of the Province is essential to the prosperity of the country that is absolutely essential to the existence of Manitoba as a Province. Of this there can be no doubt, even if the Government were to retain the northernmost part of the Province, the boundary of the Province, this he cannot do without the acquiescence of the Federal Government in his negotiations with the Federal Government. If the assumption any other position, he will fail to bring about the desired result. The question is one of vital importance.\n\nWe quote a few extracts from Mr. Lennox's very interesting lecture on this subject, relating to the saving in distance by this route to Europe, and in a future issue will give some further details.\n\nThe distance from Winnipeg to Montreal via Chicago is 1,703 miles, via the C. P. R., 1,434 miles. The distance from Winnipeg to Liverpool via the west side of Lake Winnipeg is under 650 miles. The distance from Winnipeg to Liverpool via Chicago is 2,490 miles, via the C. P. R. and Montreal, 1,642 miles; from Winnipeg to Liverpool via Churchill is 2,576 miles; via Churchill, then 1,117 miles to Liverpool via Churchill from Montreal, and even when the C. P. R. is built, the distance from Winnipeg to Liverpool is 818 miles. Thus, then, is all rail except the 66 miles which is now by sea, for the route via Churchill is the shortest. We know that there should be who, knowing this, still voluntarily persist in blind following of the opinions of the leaders of the Province in which they live as to argue against every effort being used to secure the railway. But, indeed, we must not look at the Hudson's Bay Railway as only a means to get from Winnipeg to the sea-side. Other countries have already afforded us the advantage of distance from Port Moody to Liverpool via Montreal, 5,900 miles, while via the Hudson's Bay Route it is only 4,779 miles. This again gives us a figure of 1,117 miles, which is almost the distance from Winnipeg to Chicago, and travelling over the Hudson's Bay route is going to end from Great Britain. Then the question arises as to the relations of China and Japan, for which there has been such keen competition, and the future of the world is involved. We must keep up with the interests of the American transcontinental lines and our own. Mr. Lennox and Churchill has advantages which no other can offer. The distance from Winnipeg to Churchill is 1,238 miles via Churchill, 9,002 miles, showing that Japan will be able to send the produce of its industry to Liverpool via the Hudson's Bay route, and that the trade of the world will be opened up.\n\nThe situation in the East.\n\nA short time ago we directed attention to the state of affairs in Egypt, and the accounts that have reached us are anything but reassuring. When England took upon herself, to serve her own ultimate ends, and for the final settlement of the hoped for Egyptian Question, and the possibility of the actual Government of that country, she could not have been said to have cleared herself than from all actual share in any probably event. Such a thing might perhaps be brought about by her own act of action. This the English Government must have seen themselves, for as the conclusion of the late Egyptian war, a small but persistent army of occupation was left in the country, which has not yet been withdrawn. The inconsistency and vacillating policy of the various Khedives, or so called \"rulers of Egypt,\" most of whom have been unable in every instance by ourselves have been well known to break down utterly under the least pressure on every occasion when they have been supposed to have been deprived of power, and not be perfectly aware that they had been called upon to act of their utter incapability of so doing; subject as they are to the various in influences surrounding them, such for example as the Turkish party's. Circumstances, the purpose of the various interested Foreign Nations; and the growing and unrelentingly hypocritical ministers that always are to be found abroad, who are always concerned for their own individual interests. The new phase of the \"Egyptian Question,\" therefore, at present simply stands thus, and is nothing more as forcible land, as possible, by the present Khedive and his ministers by their inaction, as if the words were actually spoken: \"England has enormous interests in the East, that can be best protected by Egypt as a buffer state between the ports of the English capital invested in her Indian traffic. She has more than once exerted herself to the utmost to protect us by protecting us. Let her therefore do it again, for it is through us that her interests are best protected.\"\n\nThe question of the Egyptian Ministry, perhaps to be specially followed by the abdication of the present Khedive, and the attempt to make a constitutional monarchy in the midst of the present crisis, brought about by the victory of El Mahdi, is one of the key notes of the present actions of the political party in Egypt. That the Khedive is unable to control his subjects (rabble) forced to the front, almost at the point of the bayonet, having no inclination to do so, and who are already disorganized by a superstitions dread of the approach, will suffer defeat at the hands of the Mahdist forces.\n\n\"Peace Project,\" can almost be taken as a foregone conclusion, and they will then turn their attention to the question \"What are we to do?\" Our interests in the East are threatened. Only two things are possible, either to withdraw our forces and consequently all moral support from Egypt, and leave her to her fate, ally to the Mahdist (which would be impossible to do without assistance) an action naturally abhorrent to calling themselves Englishmen, or, the other course, of taking up the cudgels again in his favor, and perhaps seeing a second edition of Tel el Kebir, with we hope the same successful result.\n\nTherefore, perhaps, we may be in the mood of another \"Agreement.\" In China's neighbor, the French seem to be in almost similar predicament, for what between the national pride of their ministers in France, and the indecision of the leaders abroad, it seems to be a house divided, they seem to be undecided in what way to act, just when prompt measures and active steps are needed. The result of this indecision that may have few, if any, good results, and cannot but be very detrimental to all concerned. Remembering that Egypt has had the commercial importance of China developed during late years. It is stated that for one year, that both nations consent to the mediation of the \"Great Powers,\" as it will material advantage to both countries, instead of the most exacting, should France and China come to blows, and might perhaps involve others in the strife as well as themselves.\n\nO. E. HUGHES & CO.,\nGeneral Merchants AND Indian Traders,\n\nThe Boom is off!\n\nWe are determined to sell out at actual cost. Hard Lines.\n\nBetter luck next time.\n\nI whose purpose is to sell will praise but not exceed the truth, even to sell.\n\nWhat cannot be avoided\n\nWhen a child's weakness is innocent.\n\nHow often in affairs of men we see self-humiliation and self-waste lost!\n\nIf losses must be made, decide at once.\n\nAnd with proceeds of the sales buy cheaper.\n\nGold that's put to use more gold begets.\n\nYou know how we are situated. Please call and say you wish to buy for cash.\n\nThis will be sure to establish a very agreeable feeling between us. You will thereby be master of the situation, and we will be sure to serve you in a satisfactory manner.\n\nBRANCH STORE\n\nNear the building occupied by the late firm of Ashdown & Agnew, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\n\nSTRAVED\n\nOn my premises, about two months ago, a pure Black Ox!\n\nEDWIN SUTHERLAND,\nHaleco Settlement, South Branch.\n\nSTRAVED\n\nOn my premises, last May, a pure White and Red Cow!\n\nFour years old, heavy with calf.\n\nThe above can be purchased by paying expenses, on applying to\n\nO. OLSEN,\nAt Haleco Settlement.\nBALKY.\n\nQuite a sensation was created on Allard street the other morning. An old man came staggering along with a queer vehicle of an ancient type and had evidently been used a great many years. All at once his nose began to move. He didn't want to move. He wouldn't go. The dilapidated specimen of a horse he was piecemeal tried to move with a club. The old man refused him summarily. But that mule refused to go. He would not move. The old man gave up. The crowd gathered about, and strange to say, almost everyone knew how to make that mule go.\n\n\"Untie his belly-band,\" said a man with a pug nose.\n\nThe belly-band was made loose.\n\n\"Poke a rope around his neck and tie him to a stake,\" said a man who was smoking a cob pipe.\n\nA rope was put around the animal's neck and tied to a stout post. The mule moved almost at once. The crowd followed. He was untied, but refused to move.\n\n\"Try a string to his ears and pull,\" said a man with long curled hair.\n\nIt was done. The mule remained stationary.\n\n\"Put some dry sand in his mouth,\" said a little man.\n\nAnother failure.\n\nThe old man began to show signs of discouragement.\n\n\"The upper part of his front legs,\" said a swaggering fellow.\n\nThe leg was tied up. The mule didn't move, and apparently didn't miss the leg.\n\n\"He's got his feet,\" said a man.\n\nThe mule, shifting his left eye, and throwing the other ear back, looked as if he would be blown before he'd move.\n\n\"Take a harness off and lead him around the block and see if he'll move.\"\n\nHe'll forget himself and go,\" said an old political schemer.\n\nIt was true. The information wasn't worth a cent.\n\nNow the old man began to grow nervous. Every once in a while some Alexander came along and stood on the lines, twist his tail, pick him up and carry him, why don't you sell him? What are you doing here sitting at the gate?\n\nThen a great stroke made the old man more desperate.\n\n\"I can make him go,\" said a man whose breath smelled like fish. He put a piece of wood between his knees, between his front legs, fastened it under the throat and pulled again—no effect. He tried again, but in vain. Mr. Mule didn't move.\n\n\"Rub his nose with chalk,\" said a street pedlar, who passed by.\n\nThe old man did so. The mule threw back his ears, licked the chalk off, and went to sleep again.\n\n\"To a cow's teat,\" said a man, \"in his upper lip,\" said a man with green eyes.\n\nIt was done, but no purpose.\n\n\"Place an ice pottle on his forehead,\" said a doctor.\n\nLost.\n\n\"Pour his two front feet in a basin of hot water,\" said a crank.\n\nAt last the old man got desperate. He was beating himself. Trouble, worry and hatred were on him.\n\nAt last a man came up wearing a smile, a Roman nose and a blue shirt. \"I can make the mule go,\" he said.\n\n\"You can't neither,\" said the old man.\n\n\"Here dollar I run,\" said the young man.\n\nThe money was put up. The young man took a stick and placed it under the mule's tail. Then he took a long stick and punched the mule in the flank, and then in its ribs and right thigh. The mule was thrown off his guard, his tail went down with a crash, the torpedo exploded with a bang, and away he went, bounding flat down the street at a rate that would make Jay Eye See blush with humiliation. The old man was paid, the young man was paid, the rapidly disappearing outfit, and, turning to the young man said:\n\n\"Say, my friend, have you got another one of these things?\"\n\n\"Yes, I guess so,\" said the young fellow.\n\n\"Well, here's another dollar. Please put the under my tail and I'll try and catch my dodggested mule.\"\nPECK'S BAD BOY AND HIS PA.\n\nMr. Friggin's His Pa With supernatural Nature Takes About Making Money by Fishing.\n\n\"Well, you see, my dear sir,\" said I, \"I will take him in my charge, and the boy as he smiled on the grocerman, and began filling his pockets with the famous trepides.\"\n\n\"Just you hold on,\" said the grocerman, as he stepped the boy from taking any more. \"Here's a herring.\" When anybody wins a herring, they say, \"When he should allow the victor the privilege of selecting the weapons, as they do in boxing, I would have given him a herring, and if they did, I would be liable for damages, but you mustn't give me any more herring, and I will take the chance, and said the grocerman, unloading the boy's pockets, and handing him the herring.\n\n\"Dear me, what a most excellent old fish you've got there,\" said the grocerman, as he took off his mittens and began peeling the herring.\n\n\"Yes, sir,\" said I, \"I haven't heard anything from him for a long time,\" said the grocerman, as he handed the boy the cracker, and sat down on a half bench.\n\n\"Well, you see, last night we got to talking about haunted houses, and pa said there was nothing as a haunted house, and that if there was, it was heard in a house, instead of inventing it, people got scared and went around saying there was a haunted, and before long everybody believed it, the reputation of the house was ruined, everybody very nervous. Pa said that haunted houses had been visited with spiritualism, and people of some nerve bought any stock in either. He said if ever he could get the boy to go with him know and he would go through it and investigate it in the dark. I thought to myself, \"If I could get the boy to go, and I'd help him.\" That evening my chums came over to visit my cat, and said they thought there was two cats walking by the stove, and pa told me better put them outside out, and so I did. I got up very carefully and raised up the cover to the piano, and laid the cats down in the back side of the piano, and covered them up, and petted them, and they went to sleep, and I shut down the cover, and we all went to bed. Pa said he would go at the back of the house. About 2 o'clock in the morning, about the time we usually get up, I heard a noise, and I got up, and there was a faint scratching of tom-toms on the stairs, and a yell, that sounded as though there was something very wickedly music, such as you get at boarding houses where bad girls practice, and I thought it was my cat, but I didn't, and pretty soon there was two \"meows\" and a \"spit,\" and the strings actually seemed to be snapping. I got up, and the way a cat does when she puts her paws up on your lap and lets her tail hang down, and I looked out the window, and went to pa's room, and ma was sitting up in the bed with her nightcap on, and she said, \"Oh, dear, what is it?\" and she was trying to get up to raise and listen, but it wasn't pa who might pitiful, and she said, \"Oh, dear, what is it?\" and she said, \"Oh, dear, what is it?\" and she said, \"Oh, dear, what is it?\" and she said, \"Oh, dear, what is it?\" and she said, \"Oh, dear, what is it?\" and she said, \"Oh, dear, what is it?\"\n\nBONANZA\n\nStill on the War Path\n\nAnd Slaughtering the Prices.\n\nDry Goods and Nostalgia.\n\nConsumption Positively Cured.\n\nNEW PATENT BRIDGES\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT - F. W. T.\nCOMMUNICATIONS.\n\nTo the Editor of The Times,\n\nTELEGRAFIC MATTERS.\n\nSir,—The question of the proper location of the telegraph office in Ottawa seems to have been entirely lost sight of by the Government; if they ever had any intention of asking information (outside of the organized ring who seem to be anxious to impress upon Government officials which they give us to understand by telegram published in our issue of Dec. 14th) was their intention. But when we remember that the Government have not been able to allow Judge Roulston to settle the question on its merits, I think the committee may be satisfied that they, representing the public, need not expect much justice from the Department in Ottawa.\n\nThe positions of the several telegraph stations now being operated by the Government are sufficiently absurd to have attracted the attention of every individual who has been brought through them. The fact that wire string on poles in a town generally indicates a telegraph office in the neighborhood, excepting it seems two of Her Majesty's officials, one of whom has been heard to hang his feet loosely in dictation, while the other has been occupying his time in trying to delude at least a portion of the public. These individuals, particularly Capt. Antrobus, seem to ignore the fact that unless there is found individuals a large and important trade is being carried on in our midst, and it was for the benefit of these as well as the three or four alluded to that the telegraph pole has been the Government's gift. On Nov. 24th, Capt. Antrobus in my presence informed a member of the police committee that his duties in Prince Albert were confined to his own home here and had nothing whatever to do with that man Gisborne (whom he gently styled a snob) as he had never spoken to him. Which statement where you consider the manner in which it was made should be taken with a grain of salt. Courtesy demands that we should accept this statement from Capt. Antrobus as correct and not be alarmed to do. But will he not explain why he so suddenly altered his position on the telegraph question? What caused him to so suddenly fall into line with the person whom Nov. 24th was? Will he please put an end to a situation on Oct. 24th, to deliberately make the assertion (privately) that rather than give the mission people the satisfaction of having the office where they desire it placed, ordered Mr. Anderson to place it in its present position, and that he was afraid McPhail and his brother witnesses had turned their jackets and fallen into the arms of the opposite party. Talk about the mission will excuse us for thinking that Capt. Antrobus at that time had appreciated Gisborne as district superintendent of the Government telegraph and signal service. And we consider the foregoing statement in connection with the assertion made by Capt. Antrobus that now the people had seen him anyone could contract to replace him without further ado, is most modestly said. If one would offer opposition to us (Capt. Antrobus and mounted police). We will be safe in saying that Capt. Antrobus was not aware of what he was doing. Mr. Anderson, director of the M. W. P. he didn't care to say. In any case we find ourselves a free people threatened with military rule; to be governed by the muzzle of a rifle that was sent into this country to protect, not to molest us. Government like this is a failure in Russia, it may fail here and Capt. Antrobus may have been laboring under a delusion when he made the assertion. I have no desire to draw any outside people into our troubles much less Capt. Antrobus for whom until recently the public thought the highest opinion. But his late presence and actions are sufficient proof that the Government had no desire to protect the people through their committee or else he was not aware of the recent revolution in which case I believe the public are not bound to respect his actions, neither do I wonder at his conduct (being in charge of his actions) and believe that those who faithfully fulfilled their contracts it was the duty of the Government to have placed the office at once in the centre of the town as requested by the mission people. It is in the out- ward authorized by Gordon, but to place it wherever the people desired, and not to have placed it at the dicta- tion of a single individual and until Capt. Antrobus can explain his con- duct, I am sure that there are no grounds for the Government to have placed through their officials placed this office for the convenience of those who it seems can produce the best change or serve up the best dinner. Hoping that this will again soon appear on the question of location of telegraph office.\n\nFACTS.\n\nTHE M. & N.W.R.\n\nEverything connected with the prosecution of this work must be of interest to Prince Albert. The following extract from the Winnington Free Press contains good news for Prince Albert and we sincerely trust that it is true. If it is directed towards floating six millions of dollars of their bonds, which it is their intention to do, in the English market, there is nothing to prevent their success. The line will extend as far as the South Branch, here the end of the current year. The bridging of this river forms the chief engineering difficulty on the whole route, but it is nothing compared with obstructions which have been overcome or unexampled among others. It is estimated that an iron permanent bridge will cost about a half a million, but a temporary wooden bridge will pay for itself in the same way as the one done over the Red and other rivers on the C.P.R.;—\n\nMr. F. H. Heyden, accompanied by his wife and family, left a few days ago for New York. Mrs. Heyden will remain there until next month. Mr. Stickney will visit them there also, and the two gentlemen will visit Mr. W. L. Royds of Mr. Archibald Aylmer & Campbell, in London, where they will endeavor to float the Hudson's Bay Company and Northern Railway, and make financial arrangements for the completion of the road to Prince Albert via Winnipeg. Mr. C. E. Hamilton, who visited the M. & N.W. Railway, has returned from his mission west in connection with the railway enterprise. His time was spent mostly in the counties of Sioux Lake and Rossmere, and he found the electors of those municipalities willing to back Silver Creek and Rossmere, in Russell and Rossmere, Burnt Lake, Hamilton's Point, Stanley, Old Bird Hill, and Edge Hill, in Sioux Lake. All the farmers largely attended, and he found considerable interest shown in farmers in railway matters, particularly Rossmere. In Sioux Lake there was a diversity of opinion regarding the railway being located in the northern part of the county. The County of Burnt Lake assessed £7000.00 on Saturday, Dec. 15th, and it was carried by a overwhelming majority. The £7000.00 assessment was voted upon the same day, but defeated by a narrow majority. In all districts Mr. Hamilton found all farmers to a unit in favor of the Hudson's Bay railway scheme, and are quite prepared to submit to almost any taxation for its construction, provided the Provincial Government will see fit to move over the rail. Any mention of the scheme at the meet- ing was received with perfect enthusiasm and applause. Mr. H. H. Martin, on his recent trip, who had several times sailed through the Hudson Strait, and stated that the navigation of the strait is perfectly practicable. He contends that they are navigable for at least five months in the year, owing to the absence of ice, the lack of railway facilities, and many have yet in their possession wheel of the old Hudson Bay Company's steamer. Mr. Martin was pleased to state that the steamer was probably loaded with freight, but much grain was not injured at all. The farmers are anxious to hold a meeting for a higher rate. Mr. Hamilton reports the M. & N.W. Rail- way doing a good passenger and freight business, and that certain stations recently opened between Portage la Prairie and Minnedosa. The surveyors have completed their surveys and operations in locating the road beyond Min- nedosa. The line takes a Northwesterly course from present location on Sioux Lake Road, to the Bird Tail creek stream is crossed six and a half miles north of the town of Birdtail. It runs in a northerly direction, crossing a number of creeks, and extends westwardly so far as the Assiniboine, which is crossed at the mouth of the creek. The greatest engineering difficulty to surmount between the two latter places is Thunder River. The line will be completed and construction will be resumed early in spring and at least 100 miles of road completed by this time next year.\n\nJ. L. JOHNSON & CO.\n\nDEALERS IN\n\nGeneral, Shelf and Heavy Hardware,\nGlass, Paints, Oils, Etc.\n\nMain St., Prince Albert.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Ottawa.\n\nC. J. BRIGGES, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884012501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 7967, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4677, 1], [4677, 17624, 2], [17624, 21152, 3], [21152, 24500, 4], [24500, 24500, 5], [24500, 34096, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]