[{"id": "d68a3f894e23bc062c39253d6c35a5fd6fe5e090", "text": "PRINCE ALBERT TIMES\n\nJ. D. MAVETT\n\nSUNDAY CHURCH SERVICES\n\nIS PAPER\n\nFRIDAY, MARCH 16, 1888.\n\nTHE PRINCIPAL TIMES urges representation of Saskatchewan in the Senate on the ground that \"Our member in the Commons cannot accomplish more except as he does not receive the vital support from the other fifteen members which we would and expect to give him. What has Mr. Macdonald done? Did he sell wheat, threats and promises for Mr. Macdonald's seat in the Commons? Do the people of Saskatchewan want to be represented by a man who does not receive the vital support from the other fifteen members which we would and expect to give him?\"\n\nThe Bulletin will have it that Mr. Macdonald has sold wheat, threats and promises for Mr. Macdonald's seat in the Commons. Just 10 days ago the people of Saskatchewan asked at the polls that they could elect Mr. Macdonald was a more competent man to represent them than Mr. Macdonald, and we believe the people of Saskatchewan are now more than ever convinced.\n\nThe Bulletin in its extract takes occasion to say insult the electorate of this district, but that is the characteristic of the editor of that paper. The people of Saskatchewan can afford to look the insult and treat it with contempt. Will the Bulletin be honest enough to admit that we gave an enormous vote of this district to represent us in the Senate? Will the Bulletin say that our number is not sufficient to elect a Senator, as it could have done when the other districts are perfectly satisfied with the action of their representative. Mr. Macdonald has given reason to express lack of confidence in him. We know that he is faithfully endeavoring to redeem the pledges he made a year ago, and we are pleased to know that he has succeeded in getting very important concessions. We are also aware that there are some people here who appear suddenly to have made the discovery that Mr. Macdonald ought to be re-elected. In certain times it seems strange to say that these same individuals are the very men who were most strenuous in their efforts a year ago to elect him. The whole trouble with these distinguished patriots is that to this day they have axes to grind, and Mr. Macdonald is too independent to be made a tool of by them. We gave him a chance to our hearts, and trusted the election, and we fail to see that he has so far evinced the slightest inclination to neglect the interests of the district, and so long as he does not do so, we will continue to regard him and we will continue to give him what support we can, and we feel that when the opportunity occurs again for Saskatchewan to choose her representatives in the Commons she will make as good use of it as on the 15th March, 1887, and better than that it was and is morally impossible to do.\n\nThe Bulletin, commenting on our article on \"Representation,\" in the issue of Jan. 20th, asks us to point out the difference between a responsible government and a papal government charged with duties. We pity the ignorance of our contemporary. The editor of that paper should study the English language and history of governments. He should understand that a government cannot exist unless it has a ministry elected by the people to carry on the business of the country, and that ministry is responsible to Parliament.\n\nOn the other hand, it is quite possible to have a popular assembly without any ministry or executive, and where there is no elected executive there is not a full ministry of responsible government. We are exceedingly glad that the editor of the Bulletin takes so much notice of our articles, and we hope that he will continue to do so, because every period of this paper will be glad to increase his store of knowledge, which we regret to notice is so limited. If there is anything else the Bulletin would like to know, we will at all times be most happy to furnish information sought after by it.\n\nCURLIANA.\n\nA short time ago a very pleasant and interesting game was played on the pitch between teams composed of members and ex-members of the Town Council, and Com. Agnew and the ex-members of Com. Beattie, who proved themselves worthy opponents for the honourable ladies. The following are the names and scores:\n\nCom. Agnew, Mary Beattie, Com. Johnson, Hannah Johnson.\n\nIn the play off for the President's prize a single opponent was named, and the game was played by Mr. Beattie, who came out ahead and was returned as the owner of the trophy till next season.\n\nIn the second game Com. Beattie's team met Com. Johnson defending his last game against Com. Agnew's team of eight to seven for two goals.\n\nThe grand finale for the California Cup was played by Com. Johnson and Com. Beattie, who met for the third time throughout the game was rather weak.\n\nPublic Notice is hereby given that the undersigned has been appointed Receiver of the late estate of Mr. John Langley, deceased, and will take charge of the estate on the date and at the place herein mentioned.\n\nT. J. A. and Co., of April, 1888, are arranging previous to the sale.\n\nBRACE PLUGS, IRON NUTS, BOSS CHAINS, BUILDING BAR T. J. A.\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of\n\nFall and Winter Goods\n\nEver yet shown in Prince Albert.\n\nDress Goods\n\nOf the Latest Styles, with Trimmings and Batches to match.\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMEN'S\n\nFancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF\n\nMitts and Moccasins\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nIn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber consisting of Matched, Dressed and Undressed\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\n\"Over 15 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nDominion Parliament.\n\nMarch 12.—The Speaker took the chair at 10 o'clock today.\n\nOttawa, March 12.—In response to instructions Messrs. Greenway and Macdonald have appeared before the House and have asked leave to bring in a bill in regard to Manitoba. They were generally applauded by the members of the House when they came to make their statement. The House was adjourned, and no discussion took place in regard to the situation. Mr. Macdonald has been appointed to go to the Dominion Government. The matter will be taken up in the House as soon as possible. Mr. Macdonald has sent for three gentlemen—Peters, Mitchell, and if he is here he will be interested in what they say. Mr. Macdonald said that he had not been informed by the other side of what the Government had done. If they came to vote, he would advise them to vote for him. Mr. Macdonald said that he had not been able to talk over the Manitoba situation, but if he were here he would have done so. It was a question of whether he could have talked with whom he should hold conversations.\n\nMr. Laurier, to express dissent from the course held by Mr. Macdonald, said it was not the business of the House to interfere or not let the Government have its way.\n\nAccording to the report of the committee appointed to settle the damages resulting from the fire at the Hotel Windsor, there was $35,000 worth of damage. Of this sum $25,000 was paid by the owner of the hotel, Mr. Smith, who claimed that the amount owed was $85,000.\n\nOttawa, March 12.—The Department of the Interior say they have received no news of an alarming nature, regarding the recent meeting of the Metis at Batoche.\n\nThe Liberal members are preparing for vigorous opposition to the proposal of bringing Newfoundland into the Confederation.\n\nOttawa, March 14.—In the House today Sir Robert Cartwright's motion for suspension of the Standing Committee was lost by a vote of 67 to 65. The opposition tried to prove that the trade of Canada is declining.\n\nThe Hon. Thos. White replied in an able manner and proved that the affairs of the country are in a flourishing condition.\n\nSir Chas. Tupper and the Hon. Mr. Pope are ill and will likely be absent from their seats for some days.\n\nRAILWAY MATTERS\n\nMajor Bell had an interview with the Hon. Mr. Greenway on Saturday afternoon. He spoke to the railway company in which he has an interest about the proposal to build a new line from Port Arthur to Winnipeg, and from there to the South-Western Division, thereby connecting with the M. N. W. R., by a branch line to Lake Superior, west from Port Arthur, for a considerable distance, then striking north-westwardly across the North-Western Narrows of the Lake of the Woods to a point where a bridge will be built across the river, and thence to the Red River between Pembina and Lake of the Woods. A branch will be run to connect with the Rumack, Red Lake & Halifax railway, and another branch will be built next summer, connecting eastern Dakota with the wooded sections of northern Minnesota, and running westwardly at Hallock on the Rainy River. From Winnipeg a southern branch will be constructed to the South-Western Division. Major Bell urged the abandonment of the R. R. V.提案 from Morley to the boundary line and argued against the proposal for the adoption of the scheme as proposed, which would attract traffic from the north-western division of the province, and would affect the trade of the Canadian Northern through American territory. He also stated that the company would be obliged to borrow the bonds of the company to the extent of $4,000,000, at the rate of 4 per cent. In the event of failure, the company would be unable to meet its obligations. Mr. Bell also stated that he had no proof of the allegations made by the Hon. Mr. Vickers, and that he would have liked his colleagues to have heard the arguments to be advanced in favor of such a suggestion, as the government were determined to build the line.\n\nGENERAL NEWS\n\nMarch 12.—The case of Ayerst & Co. against the Dominion of Canada for the recovery of certain sums of money was heard in the Court of Queen's Bench yesterday. Mr. Justice Scott presided. The Court maintained the judgment of the original action, but ordered each party pay their own costs.\n\nMarch 12.—Voting on the repeal of the South-Western Railway Act was held today after considerable canvassing over many weeks. The Scott act party flooded the constituency with literature and the result was that the repeal was carried by a majority of 200 as far as heard from. The complete result will be out the majority will be large enough to carry the repeal.\n\nOttawa, March 3.—The following are the latest estimates prepared for the year ending March 31:\n\n| Item                  | Estimate |\n|-----------------------|----------|\n| Total Revenue         | $1,000,000 |\n| Total Expenditure     | $1,000,000 |\n\nPRINCE ALBERT BREWERY\n\nDelivered to all Parts of the Town.\n\nAMBER--Hop--ALE.\n\nM'INTOSH & GEPFORD\n\nGO TO CANN'S BOOKSTORE\n\nSTATIONERY, SCHOOL BOOKS, ETC. ETC.\n\nTELEGRAPHIC.\n\nMarch 14.—One hundred and fifty Belgian farmers will leave Liverpool for Quebec tomorrow. Everything is ready for the emigration. Mr. Mitchell has returned from the ring. He does not claim the championship, but admits that he is the best fighter in the country. Sullivan says the idea of leaving the prize ring, and says he is willing to fight anyone who will stand up to any challenge. He attributes his failure to knock Mitchell out to the dislocation of the right shoulder.\n\nWinnipeg, March 14.—Two vessels of goods were attacked by the Atlantic Express Company. The cars were loaded with flour and other provisions for the voyage of the Abyssinia, recently arrived from China.\n\nTwo vessels of goods were loaded with flour and other provisions for the voyage of the Abyssinia, recently arrived from China.\n\nWinnipeg, March 14.—The Chief Justice has approved a report that Mr. Whyte refuses to lend the city the use of the West Wing of the R. V. building. Mr. Whyte has refused to lend the city the use of the West Wing of the R. V. building. Mr. Whyte has refused to lend the city the use of the West Wing of the R. V. building.\n\nWinnipeg, March 14.—The Chief Justice has approved a report that Mr. Whyte refuses to lend the city the use of the West Wing of the R. V. building. Mr. Whyte has refused to lend the city the use of the West Wing of the R. V. building.\n\nJ. R. McPhail's\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nImported Tweed Suitings, Trowsering and Overcoating Worsted.\n\nCanadian Tweeds\n\nSummer Suitings\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nDonaldson & Pombridge. Robertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888031601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5352, "total-output-tokens": 3225, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5087, 2], [5087, 6310, 3], [6310, 13180, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]