[{"id": "67fe70619e5a95c4e4687cb0aff92e2974569035", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—His Lordship the Bishop.\n7 a.m.—Mr. Macdonald.\n\nThe Mission Chapel.\n8 a.m.—Rev. A. A. L. Wright.\n9 a.m.—Sunday School.\n7 p.m.—His Lordship the Bishop.\n\nSt. Catharines.\n3:30 p.m.—Rev. Canon Field, B.D.\n\nSt. Peter's.\n5 p.m.—Rev. Canon Field, B.D.\n\nSt. Andrew's.\n9:30 a.m.—Rev. R. Matheson.\n\nSt. John's.\n1 p.m.—Rev. J. H. Johnson.\n\nSt. James'.\n4 p.m.—Rev. Archdeacon McKay, B.D.\n\nSt. Anne's, R. Catholic.\n1:30 p.m., and 3 p.m.—Rev. Pere Andre.\n\nSt. Paul's (Presbyterian).\n11 a.m., and 7 p.m.—Rev. Mr. McWilliam.\n\nFRIDAY, MARCH 19, 1886.\n\nThe census returns of the North-West Territories, dated on the enumeration made last fall, are now officially published. The total population shown is 48,962, of which 23,344 are whites, 4,843 half-breeds, and 20,775 Indians. What has occurred south of the 49th parallel will undoubtedly be repeated in the North-West. In 1850, the State of Minnesota had a population of but 6,077. In 1860, with practically no steam railway accommodation, this had increased to 177,204; in 1870, to 439,760; and in 1880, to 759,716. In 1870, the State of Dakota had but 1,184 inhabitants, but in 1880 it had bounded to 135,177. And no one in his senses can doubt that there is a similar, if not even a better, field for more store for the magnificent territories lying to the west of Manitoba.\n\nThe British authorities have decided on series of trials of the Spencer Lee repeating rifle, which, if successful, will be supplied to the troops in place of the Martini-Henry, whose defects in the recent South African campaigns have brought out. It is to be noted that a decided change in favor of magazine guns has lately been exhibited by European armies, and that a similar movement is now taking place among the officers of the various powers. France has armed her armies with the Krupp-chuck repeating, and is to test the Lee-Metford. The Russian army is to be equipped with the Maxim-berd magazine gun, while Sweden and Switzerland have already adopted the same system. The results of these experiments, the results of which have not yet been made known.\n\nA few of the new and popular games of Progression, Kotha, just received at Mr. Campbell's.\nDear Sir,\n\nI am writing to you in response to your request for information regarding the events that transpired during the recent conflict between the Indians and the settlers in our region. I have been informed that there was a significant misunderstanding between the two parties, which led to the outbreak of violence.\n\nThe settlers had been encroaching on the traditional lands of the Indians, leading to tensions that eventually boiled over into open warfare. The Indians were defending their homes and way of life, while the settlers were determined to expand their territory.\n\nIt is important to note that both sides acted out of desperation. The Indians were fighting to protect their way of life, while the settlers were driven by the desire for land and resources. It is unfortunate that such conflicts arise, but they serve as a reminder of the complexities involved in the settlement of new territories.\n\nIn conclusion, I hope that this letter provides you with a clearer understanding of the events that took place. I urge both parties to work towards reconciliation and find common ground moving forward.\n\nYours sincerely,\n\n[Your Name]\nThe census returns of the North-West Territories, dated on the enumeration made last year, are eminently satisfactory. The total population is 48,592, of whom 37,144 are whites, 10,458 half-breeds, and 20,170 Indians. What has occurred south of the 49th parallel will undoubtedly be repeated in the Northwest. In 1856 the State of Missouri had a population of only 6,577; in 1860, with practically no rail railway accommodation, this had increased to 17,202; in 1870 to 439,768; and in 1880 to 765,713.\n\nIn 1870 the State of Montana had but 1,818 inhabitants, but in 1880 it had bounded to 123,177. And no one in his senses can doubt that there is a similar, if not even a better, future in store for the magnificent territory lying to the west of Manitoba.\n\nThe British authorities have decided on a series of trials of the Spencers' repeating rifle, which, if successful, will be supplied to the troops in place of the Martini-Henry, whose use the experience of recent campaigns has brought into disrepute.\n\nIt is to be noted that a decided change in favor of magazine guns has lately been exhibited in European armies, and that a demand for them is being created among the officers who are contemplating equipping their regiments with carbines.\n\nFrance has armed her marines with the Krupp-Mauser repeater, and is to test the Polish rifle in the hands of her infantry. The American and Hungarian armies are to be supplied with the Mauser-Michler magazine gun, while Sweden and Switzerland have already adopted another weapon on the same principle. The United States is continuing experiments the results of which have not yet become known.\n\nA few of the new and popular game of Progressive Euchre just received at T. N. Campbell's.\n\nHon. Mr. Thompson introduced at Ottawa the act to regulate the transfer of land in the North West Territories. This bill, the honorable gentleman explained, was substantially the same as that introduced last session by Sir Alexander Campbell. Various features of the measure were dwelt upon. Provision has been made for appropriation of four million acres for land—one in the Assiniboia district, one in Alberta, and two in the Saskatchewan region. It shall be optional with owners of existing titles whether to hold their land upon the registry or not, and all registers future instructions in regard to all titles emanating from the Crown hereafter, the provisions of the bill shall be compulsory. Another clause provided for the abolition of the distinction between real and personal property. It is proposed that the land shall be in the position of chattels real, thereby by at once swinging away the difficulties attending to real property which have created a good deal of trouble in the acquisition and transfer of property in the older provinces. It is proposed that on the transmission of land by ordinary deed, such deed by himself or attorney, otherwise, the transfer and identification shall be verified by the register and the transfer be completed in much the same way as is done now. In the first place the object of the bill is to give security of title equal to that which is now provided in the other provinces; secondly, cheapness and care of transfers as to provide for a system of land taxes, which will obviate for all time the inconvenience and difficulties in relation to the holding and transfer of land.\n\nMANITOBA.\n\nSELKIRK.\n\nFrom the Record.\n\nA hall was given on Tuesday evening at the Asylum of Our Lord Church, for the benefit of the poor. The affair passed off in a very pleasant manner, and was well appreciated by those who attended.\n\nMr. D. Kilpatrick proposes building a new river boat to run between here and Winnipeg. He says he will build the steamer to run now upon the Hudson River, and we have no doubt but that it will be the best steamer that has been built on the river.\n\nIt is announced in the Canada Gazette that there will be a meeting of the Winnipeg, Portage la Prairie, and Ste. Anne Steamship Company on the 5th of March next, for the purpose of authorizing the Directors to enter into contracts as may be provided for by Act of Parliament.\n\nThis looks like business, and we hope some of our citizens will take an active part in the work on the road in the future.\n\nPORTAGE LA PRAIRIE.\n\nFrom the Tribune-Review.\n\nThe trustees have called a special school board meeting to consider the question of buying out the stock, furniture and assets generally of the board.\n\nThe Winnipeg Agricultural Society proposes holding fall cattle sales at regular stated intervals. The first fair will be held on April 1st.\n\nThere are nearly two thousand names on the first general list of voters prepared under the new Dominion Act. There are also about fifteen hundred names on the municipal list.\n\nA meeting of farmers interested in securing a change of seed will be held at the residence of Mr. J. P. Smith, who comes from the east. Mr. Smith is bringing with him samples of wheat from Ontario.\n\nThe delay in the signing of the Service Act is due to the fact that the Government has not yet received the Governor-General's assent to the treaty. Mr. Smith has signed the treaty, but has not yet received the Governor-General's assent.\n\nCharles Rossell, Attorney-General, and Hon. Dorsey Hay, who represented the Manitoba delegation, were knighted today.\n\nThe Grand Jury of Assiniboia, in Ulster County, adjourned resolutions denouncing Home Rule.\n\nCARD OF THANKS.\n\nRogers Bros. wish to inform their residents of the fact that they will again open up their Milk business on the 1st day of April. They desire to thank their patrons for their kind patronage in the past, they trust by strict attention to their business they may secure their liberal patronage for the coming year.\n\nROGERS BROS.\n\nROBERT THOMSON,\nSign & Ornamentas Painter,\nCalaminium and Paperhang-\ning on short notice.\nDecorative Painting a Specialty\n\nWAR DECLARED!\n\nW. C. RAMSAY\n\nWould respectfully intimate to his friends and the public generally that he has purchased Thompson & Ramsay's hardware business, and has removed same to River Street, near J. L. Johnson's hardware store, where he has advertised that he will charge the lowest prices charged for horseshoeing and general blacksmithing. A trial is respectfully solicited.\n\nJ. M. CAMPBELL'S.\n\nCall and examine before purchasing elsewhere.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\" Over 1/2 feet extra.\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nNORTH WEST NOTES\n\nQUAPPPELLE\n\nFrom the Prophet.\n\nThe hotel registers are crowded out. The Prophet office will be removed to larger and more central premises next Monday.\n\nA large number of freighters from the north have been coming in and going out to the west.\n\nHis Honor, Lieutenant-Governor Dowdeney and Mr. W. Mcleish, Chief Clerk of the Indian Department, visited Quappelle here on Monday for the Fort on business connected with the Indian Department. They returned to Regina the same evening.\n\nBATTLEFORD.\n\nFrom the Herald.\n\nSome of our freighters are already getting ready for the road, being under contract to make a trip from Swift Current this spring.\n\nThe sale of surplus oats belonging to the Militia Department will take place at the usual barracks at ten o'clock tomorrow morning.\n\nThe name by which the Church of England was in Battleford shall hereafter be known as the Anglican Church.\n\nThe militia came in on Monday night last week, having travelled most of the night of Sunday. It left again on Tuesday night, the intention being to make up for lost time.\n\nThe receipts of the entertainments given at the recent opening of a Battery were $180.50; the expenses were $71.56, leaving the balance amounting to $109.04 for the benefit of the memorial fund.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nSnow going rapidly.\n\nCoal business slack.\n\nDiphtheria is alarming.\n\nOnly one fatal case.\n\nThe milkers report very much less frozen milk than usual.\n\nThe Calgary municipal cases have been appealed to the Supreme Court of Canada.\n\nTravellers from Calgary report beautiful weather, bare ground and fat cattle in that region.\n\nTwo men had their first ride outside the romp on Wednesday afternoon. About 25 men were out.\n\nThe school building work is completed. The total funds up to date are $380,000. Per-acre property $140,000, real property $240,000.\n\nThe discharge of members of Steele's scouts returning here arrived by last mail. Service was from July 1st to July 26th. It is reported to-day that some sheets did not show similarly. Three sheets are selling in Calgary at present for $10 to $100. They are good for wash or hard paste.\n\nLETHBRIDGE.\n\nFrom the News.\n\nThe crossings of the river at Rapp are again good, the hail coat having been washed away by the recent rain.\n\nThe new hotel opposite the Royal stable is to be opened to-morrow by J. Brown & Co., who give it the name of the Traveller's Hotel.\n\nMr. A. J. Scott arrived here from Mo-Lord with his family on Wednesday last. Mr. Scott has been appointed agent here for the Dominion line of steamships, running between Liverpool and Portland, and will be engaged in connection. It is said that Mr. Scott will bestow his patronage on Mr. Barber and he will become his partner.\n\nPORT MACLEOD.\n\nFrom the Courier.\n\nThe snow has turned above the feet on Wednesday last.\n\nNo great damage done.\n\nWe have it on the very best authority that Macleod will shortly be in full enjoyment of excellent rail facilities.\n\nIt is stated that Mr. Macleod has letters to the effect that Mr. Hayter Reid went there as a man of investigation.\n\nAt noon on Tuesday last the thermometer was over fifty in the shade. About the middle of the afternoon lacy black clouds rolled up from the north, and brought a shower of snow and sleet. Altogether only about an inch of snow fell, but the weather has remained uniformly cold during the week.\n\nGOD'S ACRE.\n\nPathetic Pre-Christmas of Children Dead.\n\nAll night through the snow had steadily fallen, a bewildering whirl in the air; soberly falling, almost down, then caught by the swirling winds, and sent spinning back, like a thousand tiny white flares floating near till it seemed the night would never cease; all the night long they had been watching a house of a beautiful sky house as they softly clung to the forest tree long branches hanging down, and the children playing at their feet. Falling, falling till the long country road was hidden from sight; the trees were covered with snow, the ground were covered over with heaven's white flowers. Not a very large grave, but there were two, and they were filled with the ashes of two children, too young to understand, too young to know how many could rest so quietly, for only the angels could remember them, and the grave would be empty, or give to each humble occupant its earth name. Truly in that huddling of graves together it seemed that God's own children would know which was which when soon they should awaken.\n\nAnd there in the silent, still grand hall That was all! The one thing the world would give ungrudgingly. Nay, it did give even more. For the children of God even filled their lives to overflowing. But its roses and gladiolas and warm brightness, its peace and quiet, gave them death, and life its last gift—a coffin of pine, an unmarked grave.\n\nAnd the wind was still, the falling snow levelled, over them, and the night through, and winds sang a dirge through the trees. Consumed, forgotten, how could they rise? But the dead shall rise again, without tattered bands and tagging steps, the hungry and the thirsty shall be satisfied.\n\nThere had been a grave with fresh smelling earth upon it, just a week ago; but now there was nothing there but an accident, not design; and of them who stood near it, section, ever so far apart, they knew not where. Their eyes alone noted that the stately tree marked hand from foot. A child's heart beat only in the silence of frozen clubs, who lay there fell in the coffin lid.\n\nAnd the cold night had gone, stillness beginning to stir at the east. Tiny columns of smoke were rising over the roads, away down the main street, where the firemen were at work, the landscape was a sign of life. Yes, here is—\n\n\"Mamma, mamma!\" as it meets perhaps the cherry fire and falls on the mound of its site.\n\n\"Mamma, O mamma, I am cold.\"\n\nShe knows where lies the head. She cannot set it full low where underlay is the softest, nor can she fold the tiny hands are folded. She buries the snow away, lays the small stiff colder feet close together, and lays her cheek close to the hard earth, some one knows that grave. Some one says, \"Poor bones, they are longing, to ears that cannot hear.\" Down fingers into the snow, and the child's feet, and the gray sky, blurring, the white world with color. Now comes, the sunshine follows, the snow falls, the wind falls silent a little, and the child's feet, in a baby form—so grief touched, its heart beats stifled, lying on that new made grave, and the snow falls, and the child's feet are covered, and the snow falls, and the child's feet are naught of it. She rests once more on her mother's breast beyond the cold and snow clouds—Dead Free Press.\n\nBUFFALO HALL!\n\nSTILL LEADING.\n\nJUST TO HAND—ONE OF THE FINEST STOCKS OF\n\nDomestic and Imported Cigars\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlor de Benitos,\n\nCreme de la Creme,\n\nBelle Cuba,\n\nHenry Clays and Wagner's\n\nALL CHOICE GOODS AND SEASONED.\n\nBETTS & Gwynne.\n\nExamine Our Stock of Xmas Confectionery and Biscuits.\n\nBUY YOUR\n\nHardware,\n\nStoves,\n\nTinware,\n\nCoal Oil,\n\nGroceries,\n\nAT\n\nJ. L. JOHNSON & CO.'S.\n\nWM. STOBART & CO.,\n\nGeneral Merchants and Indian Traders,\n\nHAVE JUST RECEIVED A LARGE ASSORTMENT OF\n\nPrints, Hats,\n\nCrockery and Groceries,\n\nWhich they will sell at the lowest cash prices.\n\nBest American Coal Oil 80c. per gallon.\n\nSeasoned Cordwood 80c. per cord.\n\nGolden Syrup 84c. per kg.\n\nPrince Albert — Sask\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAT N Campbell's New Store,\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly attended\n\nT. E. JACKSON,\n\nNew Stand, in the building lately erected\n\nEpiced as Post Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886031901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 6690, "total-output-tokens": 4441, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2300, 2], [2300, 3450, 3], [3450, 10345, 4], [10345, 18003, 5]], "primary_language": ["en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]