[{"id": "0f40c0f4f9e23a0a102b1ff289602d1f31a843b2", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 15, 1884.\n\n$2 50 A YEAR.\n\nBANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nPayment of Fines or Penalties\nUnder Criminal Laws of Canada in North West Territories and District of Keewatin.\n\nGovernment House, Ottawa.\n29TH DAY OF JUNE, 1884.\nHis Excellency the Governor General in Council.\n\nOn the recommendation of the Minister of Justice, His Excellency the Governor General in Council has ordered that the Order in Council dated 6th July, 1877, requiring all Justices of the Peace and other persons holding offices in the North West Territories or Keewatin, who have collected or may collect any fines or penalties under the Criminal Law of Canada, to make provision in the contrary event, to pay the amounts to either the Lieutenant Governor of the North West Territories or Keewatin, or to one of the stipendiary Magistrates of the North West Territories, and similarly that all Justices of the Peace and other persons holding offices in the North West Territories or Keewatin shall pay the same every quarter to the Lieutenant Governor of Keewatin and the Lieutenant Governor of Keewatin, and that where possible, the parties collecting any moneys assessed shall make immediate remittances to the Receiver General of Canada in whose charter book to be named by the Lieutenant Governor of Keewatin, the purpose being to secure the deposit thereof to the Lieutenant Governor in the place of the money, and where practicable a copy is attached hereto of the Order-in-Council Office Order for the amount in favor of the said Lieutenant Governor. Any moneys so received by the said Lieutenants will constitute a credit to the credit of the Receiver General of Canada.\n\nDOMINION LANDS\nThe Districts West of the 100 Meridian\n\nThe following is a description of the several land districts west of the meridian of 100° west longitude:\n\nCORNER MERIDIAN.\nAgent's office, Carlyle P.O., Assiniboia, containing 33,563 square miles, more or less, being composed of part of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nBATTLEFORD DISTRICT.\nAgent's office, Battleford, Sask., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nEDMONTON DISTRICT.\nAgent's office, Edmonton, Alta., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nCALGARY DISTRICT.\nAgent's office, Calgary, Alta., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nGRAND EXCURSION TRIP\nThe Steamer MARQUIS\nWill Leave PRINCE ALBERT, at 10 A.M., on AUGUST 19TH, 1884, for EDMONTON, Having on board a large party from Winnipeg and the East.\n\nTake for Round Trip $20.00 (Meals Extra); or $35.00 Meals and Staterooms included.\n\nJOHN B. DAVIS, SUPT.,\nLumber, Shingles, Smith & Co.,\nBakers and Confectioners,\nAll kinds of food made to Order,\nThe Best Bread Made at Winnipeg.\nMade from Winnipeg Flour.\n\nTERMS STRICTLY CASH.\n\nDAVIS AND CO.\nWholesale Lumber Dealers\nHead Office—20 Main Street. Yard—Poveshell Street, on C.P.R. siding.\n\nPATENTS\n\nHIGH SCHOOL\nST. ANNE'S CONVENT,\nRE-OPEN, 1ST SEPTEMBER.\n\nPayment of Fines or Penalties Under Criminal Laws of Canada in North West Territories and District of Keewatin.\n\nGovernment House, Ottawa.\n29TH DAY OF JUNE, 1884.\nHis Excellency the Governor General in Council.\n\nOn the recommendation of the Minister of Justice, His Excellency the Governor General in Council has ordered that the Order in Council dated 6th July, 1877, requiring all Justices of the Peace and other persons holding offices in the North West Territories or Keewatin, who have collected or may collect any fines or penalties under the Criminal Law of Canada, to make provision in the contrary event, to pay the amounts to either the Lieutenant Governor of the North West Territories or Keewatin, or to one of the stipendiary Magistrates of the North West Territories, and similarly that all Justices of the Peace and other persons holding offices in the North West Territories or Keewatin shall pay the same every quarter to the Lieutenant Governor of Keewatin and the Lieutenant Governor of Keewatin, and that where possible, the parties collecting any moneys assessed shall make immediate remittances to the Receiver General of Canada in whose charter book to be named by the Lieutenant Governor of Keewatin, the purpose being to secure the deposit thereof to the Lieutenant Governor in the place of the money, and where practicable a copy is attached hereto of the Order-in-Council Office Order for the amount in favor of the said Lieutenant Governor. Any moneys so received by the said Lieutenants will constitute a credit to the credit of the Receiver General of Canada.\n\nDOMINION LANDS\nThe Districts West of the 100 Meridian\n\nThe following is a description of the several land districts west of the meridian of 100° west longitude:\n\nCORNER MERIDIAN.\nAgent's office, Carlyle P.O., Assiniboia, containing 33,563 square miles, more or less, being composed of part of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nBATTLEFORD DISTRICT.\nAgent's office, Battleford, Sask., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nEDMONTON DISTRICT.\nAgent's office, Edmonton, Alta., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nCALGARY DISTRICT.\nAgent's office, Calgary, Alta., containing 33,563 square miles, more or less, being composed of parts of the Provincial Territorial Districts of Assiniboia and Saskatchewan, and more particularly described as follows: Commencing at the intersection of the northern boundary of the said Provincial Territorial District of Assiniboia bounded on the north by the road allowance between townships 9 and 10, on the east by the second meridian, on the south by the International Boundary, and on the west by the third meridian.\n\nGRAND EXCURSION TRIP\nThe Steamer MARQUIS\nWill Leave PRINCE ALBERT, at 10 A.M., on AUGUST 19TH, 1884, for EDMONTON, Having on board a large party from Winnipeg and the East.\n\nTake for Round Trip $20.00 (Meals Extra); or $35.00 Meals and Staterooms included.\n\nJOHN B. DAVIS, SUPT.,\nLumber, Shingles, Smith & Co.,\nBakers and Confectioners,\nAll kinds of food made to Order,\nThe Best Bread Made at Winnipeg.\nMade from Winnipeg Flour.\n\nTERMS STRICTLY CASH.\n\nDAVIS AND CO.\nWholesale Lumber Dealers\nHead Office—20 Main Street. Yard—Poveshell Street, on C.P.R. siding.\n\nPATENTS\nFRIDAY, AUGUST 15, 1884.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVETTY\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT TIMES\nTERMS—Read paper and in advance\nfor one month, 25¢ per month.\nIn case not paid, paper inserted in this\npaper. Remittances due per issue.\nAll letters to be addressed to the Proprietor.\n\nFRIDAY, AUGUST 15, 1884.\n\nREPRESENTATION.\n\nThere are at present several matters intimately affecting the people of Great Britain, any one of which under ordinary circumstances would wholly engross public attention. Under the rule of the peace it is an old proverb that foreign policy is at an end; consequently national enthusiasm has ceased to a great extent to arouse national enthusiasm, but until quite recently the Egyptian policy of Mr. Gladstone's government was so open and so obvious that the question which would constitute the ground of appeal to the people, by the dissolution of the present parliament. This question happens to be one which touches the commercial interests of the English people, who were spoken of so contemptuously by Napoleon as a nation of shopkeepers, until he was taught to his cost what was meant by being employed by the working people on the field of battle, prepared the way for something of the old English sentiment to burst forth, on the apparent intention to show the world how much they had suffered. The French outrage of the dynamiters, perpetrated in the most crowded centres of the country, cannot fail to have been paid for in kind, whilst added to these minor subjects of interest, come what at one time would have been entirely absorbing topics, the present epidemic of cholera, the Irish troubles, and the approach of the far more terrible scourge of cholera. It must be stated something of most vital moment to the nation which can allow the subject to be left to pass away into temporary obscurity, nothing very like oblivion, but all wonder ceases when we learn that it is what is regarded by the English people as an attempt to interfere with their constitutional privilege that has made interest in every other question disappear. The action of the House of Lords in opposing themselves deliberately to the wishes of the people represented by their representatives in the House of Commons, is by no means unconstitutional in form, and furthermore the Lords may plead so far towards the purpose of the people that they may claim the only constitutional means of allowing the people to declare by new elections whether the Franchise Bill does actually represent the wishes of the present existing or not. Under these circumstances it may seem strange that a people so little given to losing their heads should be so much excited, but the truth is that just as you may always find some one upon whom a generally tolerant individual becomes rabid and violent, so it is with nations. The Franchise, or representation of every free and honest man, is the basis of every country, is what the people must and will have at any cost, nor would the House of Lords dare to oppose the Franchise Bill if sent up to them after such determined representations by the electors. If the English people become so intensely excited over the mere extension of the franchise, surely no wonder need exist at the people of our territories, so strongly objecting to having our thousands of free and independent inhabitants represented in the Dominion Parliament. Surely the Government cannot intend to persist in the undignified and immoral course of refusing us our simple right of representation, and particularly, until we are strong enough to force them into doing so. We would advise our people to make the matter of representation the most prominent feature in their agitation to obtain redress of grievances, not only because it is of itself the most important one, but because as we have said before, representation in the Dominion Parliament is the only method by which with any certainty of a substantial hearing, we can hope to proclaim our reasonable demands, and appeal to that spirit of justice, which can not be dead in the Dominion.\n\nTELEGRAPH LOCATION.\n\nAn order has been received this week from the Master of P.W. regarding the permanent telegraph station to be built on the part of the town which the inhabitants think will be most convenient, as he believes that petitioners represent public opinion. There is nothing to say against the uniformity of all the other sites spoken of, or of the great accommodation to the majority of the public to have it erected in the centre of the town where the most immediate advantage may be obtained. The Minister has clearly declared he has located it according to the wishes of the public. Can it be supposed he is unwilling to listen to the wishes of the people? In other words, or that his colleagues will consign all petitions sent from here to the waste basket? Can it be said he has not taken immediate steps to give the matter his personal attention, this the only time he has been asked. Doubts were raised at a public meeting held lately, whether a certain telegram had been for some reason delayed, but full assurance may be placed in the statement, that no properly drawn out petition or prayer has ever been forwarded before this one. Can it be supposed the Minister is not aware when it consists of a cutting from a newspaper, purporting to be a faithful copy of a certain gentleman's harangue, pasted on a sheet of telegraph paper. The same sort of blatant supposition is now being created into a second-class parliamentary society, for we can assure them a first-class one would not entertain such a scurrilous paper as they considered fit to print. Matters are now in hand. When petitions are sent to the legislative assembly to command attention and respect, they must be drawn out in proper form. The question of public opinion has shown its willingness to comply with the reasonable wishes of the public, and as we have all along insisted, we are sure his colleagues will be as ready to enter into the spirit of the wishes of the inhabitants as they are accustomed to a correct manner. The committee are to be congratulated on the successful issue of their labors, and are due the thanks of the citizens for the valuable way they have done their duty.\n\nLieut. Governor Macdonald stated at the meeting of Council held July 29th, that he had had a telegram from Sir John Macdonald to the effect that the Minister of Agriculture on his return from Europe will take into serious consideration the questions relating to the half-breeds in the North West Territories.\n\nDr. J. E. Kennedy, Toronto, has been taken to the hospital with Canadian cholera.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nA. T. N. Campbell's New Store\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\nKEPT CONSTANTLY ON HAND\nRepairing Promptly Attended to\nR. H. BRATNOBER,\nEAST END.\n\nNEW GOODS!\nMEDICAL HALL.\nJust arrived an assortment of\nDRUGS, SPICES, FANCY GOODS.\nCOMPRISES IN PART\nAtkinson's Dolgate's, Lubin's\nand Lundborg's Perfumery.\nPearl's and Olgate's Fancy Soaps\nHair Brushes, (including\nScott's Electric and Infants')\nCollodoid Horn and\nRubber Combs,\nGunnell's Tooth Brush,\nTooth Picks,\nBreast Pumps, Feeding Bottles,\nBoo's Fruit Salts, etc., etc.\nT. R. JACKSON\nAT THE OLD STAND.\n\nR. B. WAY,\nPost Office, Prince Albert, N.W.T.\n\n\"The Western Physician.\"\nA common sense medical work for\ninfants. Fully answers all questions\nwhich modesty prevents asking a male\nphysician. Practical and systematic\ntreatment of all diseases of the sex.\nPrice 75 cents. Postage paid.\n\"A little study is a great aid to delicate\nlanguage which every woman, young\nand old, should read. It is recommended\nby physicians and used by many\nwomen as a guide for the sex. Handsomely bound\nand illustrated. Sent postpaid for $1.00.\nAddress Horatio G. Way, Rochester,\nN.Y.\n\nPUBLIC NOTICE.\n\nAll persons are hereby required\nto give notice to the Crown Agent\nof Dominion Lands for the province\nof Manitoba, that they are in\npossession of land, and all timber\ncut without authorization, and\nare to be dealt with as the Minister\nof Agriculture directs.\n\nEach settler on a homestead quarter\nsection must make application to the\nCrown Agent of Dominion Lands for\nthe province of Manitoba, for a\ntimber permit, exceeding twenty acres in extent, at least.\n\nAny person other than a homesteader\non a quarter section must make application thereto for\na permit to cut timber, who will deal\nwith such application.\n\nPersons who have already cut timber\nwithout authority, are requested to\nthemselves to the Crown Agent. Applications\nfor permits to cut timber, exceeding\nthree thousand acres will be made\nunder separate instructions.\n\nD. J. WATSONER,\nCrown Timber Agent.\n\nFURNITURE\n\nFancy Parlor\nBedroom Sets.\nSideboards,\nBureaus,\nBedsteads,\nCouches,\nSofos,\nChairs of nearly all descriptions.\nCradles & Cribs for the Babies.\nFeeding Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\nPUMP ON WATER\nWells sunk and Pumps made and repaired.\n\nOrders left at J. L. Johnson & Co.,\nwill be promptly attended to.\n\nNATHANIEL ACORN,\nPrince Albert.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884081501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 4371, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 9231, 1], [9231, 18462, 2], [18462, 18462, 3], [18462, 18462, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]