[{"id": "0d2b4d98ed9adb8d627ec7a80f6454e7183761a3", "text": "THE REBELLION.\n\n(Continued from our last.)\n\nThe witnesses were Garrot, the secretary, and the Rev. Mr. Arrowsmith, mentioned in the last number. Mr. Garrot proceeded to put such evidence into the mouths of his plaint witnesses as he thought would be most likely to affect their part about testifying to his satisfaction vanished before the appearance of Mr. McCauley from Dumont. The fidelity of the assertion about the intention of the English half-breed chief was not doubted by any one, but Mr. McCauley himself was in a position to prove by the evidence of a deposition from them, said to have been taken up at the same time when it was said to have been taken up at the Ridge, afterwards arrested and kept in custody at Prince Albert. Mr. McKay had been there doing something or other, and, looking in with an object to see the evidence, telling the Council he had heard that Mr. McCauley had been himself. Happily for him old Champlain had spoken enough to declare himself in favour of bringing a complaint against Riel, saying that the feeling of the most intelligent men was that it would be convenient to remember a committee meeting upstairs, and, until the thing was done, he would generally appear at the head of the stairs opposite to the interpreter. Mr. McKay's argument with the Council on the ground that the most intelligent members of the commit- tee had done his best to bring the matter to their sober senses, but excepting that Mr. McCauley spoke loud and long, who seemingly remarked that it was a pity he had not taken enough of his present strain—when it might have done more good—by telling him that he had been doing something or other before he left St. Louis, and to give a certain answer which, although they promised to fall fully behind, was afterwards distinctly refused, beyond his own acquittal from the self-constituted tribunal. Riel, who had this time succeeded in getting his way, had made, tried to offer the remembrance of his services, but assured Mr. McCauley that he had never regarded him simply from his stand point of opposition to their just claims, but proceeded to argue the case on the best and strongest for him. In fact only a change of sides on this question was necessary to make Mr. McCauley an enemy, and then he stood to make the change. He hoped he would then over, and not allow the feeling of warm sympathy was mutual. Mr. McCauley got his inability to truthfully say that it wasn't so, and gladly turned off the question, and not only expressed the neutrality of the English half-breeds, what reads as a fact might have required Mr. McCauley to hang his head. During Mr. McCauley's reception for Major Crozier, that Riel now found himself obliged to make an appointment as to be able to make an appointment but would send two delegates to repre- sent him in the matter of an unconditional surrender of Fort Car- lton, or a war of extermination. When the message came that Mr. McCauley, in command of the party that Riel himself demanded the intervention, he considered that the head of the delegation to meet such deputies would be a compromise of dignity, but yet unwilling to see his friend in such a distant prospect of avoiding the terrible evils certain to follow the commencement of hostilities, he requested Captain Moore and Mr. Thomas McKay to keep the appoint- ment, and send on. The message was sent to the end of the Indian River, the same spot where a few nights after the affair which was now upon by then happened the famous scene was reported by those, and where the present scene was acting out its part, and finally where the memorable fight took place. The hour had been fixed for 12 o'clock, when Mr. McCauley and Mr. McKay left Carlton to reach the spot at the appointed hour. There is nothing of\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the selection of our Ladies' Department.\n\nAn Exclusive Department of\n\nCarmela, French Creams and other Mixed Oats, etc.\n\nNuts and Raisins together with Fresh Biscuits in Sacks.\n\nFruits, Taffy Fingers, Lemon Creams and Iced Sultanas.\n\nMake a choice of articles to our well-known line of\n\nGENERAL GROCERIES.\n\nFor a description under our renowned Buffalo Hall,\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. Hughes & Co.,\nGeneral Merchants and Indian Traders,\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats,\nReady Made Clothing,\nBoots and Shoes, etc.\n\nMorton's Celebrated Jams,\nJellies, Pickles, Confectionery\nTeas and Sugar,\nWhich defy competition.\n\nOilville's Flour,\nWhich we sell cheap for cash.\n\nO. E. Hughes & Co.\nT. N. Campbell,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS,\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nJUST RECEIVED\nAT THE\nHORSE SHOE STORE\nA LARGE STOCK OF\nHats,\nSummer Suits,\nPrints and Dress Goods\n\nTHOS. POWERS,\nIN PREPARED TO TAKE\nCONTRACTS\nFOR\nBrick, Plastering and Stone Work.\n\nJames Sinclair\nMerchant Tailor,\nAND DEALER IN\nCENTS' FURNISHINGS.\n\nALSO A SUPPLY OF\nFRESH GROCERIES\nT. O. Davis\nCOMMUNICATIONS.\n\nA CONTRADICTION.\n\nTo the Editor of The Times.\n\nDENIAL.\n\nTo the Editor of The Times.\n\nSir,—In your issue of the 21st inst., there appeared a two-column article by Mr. James J. Campbell, charging me with falsehood, etc., regarding certain matters in a conversation which I had with Mr. Campbell, the Free Press reporter, a short time ago. In a rambling introduction Mr. Campbell attempted to make me appear to be intolerant, but as to Mr. Campbell's intolerance I leave the public care about hearing so little said about me. I do not believe that Mr. Campbell is intolerant. In this he is not correct, as the word cowardice was not used by me. Mr. Campbell has been very kind to me, and I have nothing but good feelings toward him. I am not at the instance of the Government and without the expectation or receipt of any compensation, willing to give evidence against Mr. Campbell's conduct in this matter. Passing on through a lot of trash and nonsense, he refers to me as a \"coward,\" which is a term which I have never used in connection with Mr. Campbell, nor do I believe that Mr. Campbell ever used it. Mr. Campbell, I am told, has been very kind to me, and I have nothing but good feelings toward him.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nJ. M. CAMPBELL\n\nhas just received a complete and well assorted stock of\n\nREADYMADe CLOTHING\n\nDry Goods\n\nCrockery,\n\nGroceries!\n\nAlso a large Quantity of\n\nWINNIPEG FLOUR.\n\nCHEAP FOR CASH.\n\nJ. M. CAMPBELL.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nDEVELOPMENT.\n\nIt is very unfortunate that the same circumstances which render it absolutely necessary for the Government to assist, and that with no regard hand, this district, unless it is to be abandoned, must be assisted should have involved them in an expenditure which must make it very difficult to afford that assistance.\n\nTo give up—even for a time—the result of the patient labours and outlay which have been thrown into this district at present stage, would not only be most unjust to all who have been induced to come here, but would furthermore be throwing away absolutely the enormous sum already spent by the Dominion. Difficult as it may be, the only true policy is by mortgaging the further necessary cost to put the country upon such a basis as will before long turn the whole country into a highroad for movement. The position is just one where to stop is ruinous, while to go on offers certainty of eventual gain. The one thing absolutely necessary is to make this district a source of profit not only to its inhabitants, but also to the Dominion at large, is Railway communication.\n\nThe effect of the opening up of the various portions of this continent by railways has been found sufficiently often to afford some slight idea as to what will result when the Hudson Bay route shall have been opened, although when all the varied advantages of the try which will be made available by it, and the many circumstances pointing out the Territories as destined to receive the ever increasing surplus population of Europe, are considered, there is no doubt whether the magnitude of the result is at all realised. That before long this must come is beyond question, and there is all the greater certainty that money spent meanwhile in opening up the interior of this vast region—at any rate the fertile districts—must eventually return a handsome profit. The comparative ease with which the great Indian question can be handled, when this has been done, is an obvious advantage to any government. With regard to giving railway advantages to this one of the most fertile districts of the Territories—as fertile as to have been comparatively well settled, and yet so situated as much more easily reached and likely to have been in many ways more attractive from their greater proximity to centres of civilization, we say a few words in regard to the difficulties and strange circumstances more favorable than the present for doing what after all can not be long delayed. There is no doubt about the settlers being treated as disdained—being left in large measure actually destitute unless public works supply them with the means of earning the necessaries of life, until the harvest of next year can be utilized. Such a state of things in this district will be either entirely abandoned or peopled with destitute settlers, who without exception will cherish undying hostility to the Dominion and watch therein for every opportunity to do anything like general employment must be railway work, and in addition to its construction affording temporary relief, it will afford an ultimate and lasting prosperity, as will make large subjects of the most disaffected. A railway may be made to connect with the C. P. R., but we believe that when viewed from any side the advantages of connecting with the Hudson Bay route are very fertile held through which the Manitoba & North Western is surely, if slowly, making its way, are far above those likely to accrue from connection with the branch which adhered in connection with the eventual opening of the Hudson Bay route. Under these circumstances we would strongly urge upon the Government a consideration of the proposal made by Mr. Macdonald to the M. & N. W. R. Co. to commence work from here to meet them at the Touchwood Hills. Should they be disinclined to fall in with our plan, the Great Western should in the public interest undertake the work at this end, and hand it over in lieu of so much bonus granted in another form. Even were this done at some immediate loss, besides making the proposed railway a success, it could not deny the settlers here, the increased value of the public land reserved and the more speedy sales would more than counterbalance temporary loss. The idea is, as a last resort, worthy of serious consideration.\n\nDISCOURAGEMENT.\n\nWe notice an inclination upon the part of a portion of the eastern press to go ahead rather too fast on the subject of Prince Albert's discouragement, and occasionally hear that the encouragement offered to Riel by the various parties in this district, who protest French half blood, has created a superfluous upon the part of the Government to come to our assistance now. This view of the case we object to in the strongest way, on the grounds that it is false. The solitary occasion upon which there was the slightest appearance of any general inclination to countenance Riel, on the part of our people, was that shortening about which so much has been written was held in our town shortly after his arrival in the district. With regard to that two things must not be lost sight of—the hurried way in which the invitation was taken round and in many instances signed out of pure thoughtlessness, and the fact that people here had heard so much about the man, that no wonder need be expressed that many perfectly loyal citizens should have given the matter of price attention. At the time, while pointing out the impropriety of the invitation, we urged upon the citizens to show Riel no mark of hostility in a consideration of his having come to us in search of it, or possibly he might have had practical proof that he was viewed with by no means general favour. It is significant that he never attempted to return the performance of a certain act which he had failed to convince us that the English speaking half breed is any large numbers attended his meetings or otherwise showed him any mark of sympathy, and it is prospective that he never would have depended upon general sympathy from them as to turn in public to such as did attend the slightest in tendency of going beyond constituting a significant number of the attendance made, most of whom the public never knew. As to the assertion that Riel depended upon general support from the settlers, we while not saying positively untrue, the statement is not more than an exaggeration upon any assistance given him by a few who had not the slightest authority for holding our hopes to run, the utter futility of which he realized the moment he came upon the scene, is readily seen and understood. With regard to the low, beyond the meters—a word would appear to have had some sort of organization of their own, and to have been conducted in common with the Rielists, although they have attacked them with all severity for their obstinacy and seeming callousness as to the upshot, it has got to be shown that even in this case, that prejudices, if existed, would be far more fatal, if the evidence exists to prove this to have been the case, to proceed against the criminals, than to threaten in indefinite manner to make arrests and talk of organizing a force, instead of proceeding at once instead of very expeditious sentiment. So far from this having been the case, the vast majority of settlers, in consideration of the danger of massacre, most respectfully accorded to every right of a Patriotic Union for the purpose of getting redress of grievances, which undoubtedly existed. Or course if individuals from here are allowed to make statements which have effects that are injurious to the whole, as is determined to state out the following depositions.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\n\nAT T. S Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nPromptly Attended To.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, JULY 3, 1885.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's\n11 a.m. Rev. Canon Macdonald\n7 p.m. Rev. Mr. Macdonald\n\nThe Mission Chapel\n11 a.m. His Lordship the Bishop of Sask.\n7 p.m. Rev. Mr. Macdonald\n\nSt. Catharine's\n10:30 a.m. Rev. E. Matheson\n\nSt. Paul's\n10:30 a.m. Rev. Mr. Macdonald\n\nSt. Andrew's\n10:30 a.m. Rev. J. F. Prichard\n\nSt. John's\n10:30 a.m. Rev. J. F. Prichard\n\nSt. James'\n10:30 a.m. Rev. J. F. Prichard\n\nSt. Anne's, R. Catholic\n10:30 a.m. Rev. Mr. Macdonald\n\nSt. Paul's (Presbyterian)\n11 a.m. and 7 p.m. Rev. Mr. McWilliam\n\nCalgary, Presbyterian\n\n1 p.m. The Rev. R. G. Sinclair\n\nFRIDAY, JULY 3, 1885.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 17 feet extra\"\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWART BROS.,\nTRADERS,\nGENERAL MERCHANTS\n\nRecognized as the best FAMILY KNITTING MACHINE IN USE.\n\nOur new model knitting machine is now on exhibition in our store. We have also a large selection of goods for sale.\n\nCREELMAN BROS.,\nGEORGETOWN, ONT.\n\nThe Dominion Organ and Piano Co.\n\nHas the largest and most complete factory in Canada.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885070301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3908, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5263, 2], [5263, 7025, 3], [7025, 16435, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]