[{"id": "e9f1fa9d8d8653d08f48674ad176a6acd25e3f9e", "text": "OUR DISTRICT\n\nIt has been our experience in writing about our district, the intensity of which we have done our best to forward by every legitimate means, to obtain from giving any exaggerated reports and over-colored pictures of the state of affairs.\n\nWe constantly notice the changes of particular sections of the country making statements which bear on the face of them what not to express ourselves too strongly is the truest way of stating the case, the truth. Now this sort of exaggeration with the attendant suppression of the truth concerning all drawbacks, of which every place must have some seems to be a highly undesirable feature of the press, because it is dishonest, and because it almost invariably detracts from its own object. We take it no emigrant in these days is foolish enough to expect to find in the extensive and earthly paradise which should be such a man who does not want him to come here in the hope of finding that which is impossible of attainment, more abundant comfort than his inevitable disappointment may throw down the District wherever he can obtain a hearing. What every sensible man will do is to inform himself of what we have to offer and again go to places and get to know drawbacks to which he least obnoxious to himself personally.\n\nWe are glad to observe that in spite of the discouraging forecasts of the past, the number of emigrants is this year a large increase in the number of emigrants from Europe to the North West, as well as a marked improvement in the quality, and the number as they seem to be, we can without fear recommend this District, as being far ahead of many, and second to none in the Territory. The opinion firmly obtained amongst those who have been allowed the Territory, that the nature of the land here is such that a rush will be made to take it up, just as soon as a railway approaches, and we would urge the interested settlers to look out in time.\n\nWe do feel concerned to say much in favor of our lands for farming purposes, simply because we have never heard of any one being rich enough to speculate in land, and although it is great importance for farmers in such soil and good climate, is the question of market and railway communication generally. That before very long Prince Albert will be an important railway centre between the Pacific and Atlantic coasts, we have already pointed out, and we are glad to see that the latest information from trustworthy sources, tends to assure us of having good roads here, at a much earlier date than we could have reasonably hoped for.\n\nThat the Government has decided upon the immediate erection of costly public buildings, is a very hopeful sign of their interest, with regard to this place in the future, and their views of its future consequence. Now taking these unexamined facts into consideration, we can only say that if any settler with a little capital and not afraid to rough it and work hard for a year or two, cannot find what he wants in our neighborhood he had better decide to stay at home and make the best of his worldly position, deferring his hopes of coming upon what he would like to get until removed to another sphere of usefulness beyond our terrestrial limits.\n\nCOMMUNICATIONS.\n\nWe do not hold ourselves responsible for the vicissitudes of correspondence.\n\nCORRECTION.\n\nTo the Editor of The Times.\n\nSir,\n\nIn your last issue a correspondent signing himself \"Farmer\" in giving advice according to a saying of English and French half breeds, such as calling the English half breed a \"set of fools.\" This is the expression he used. The people who wrote me that meeting knew this to be false. I am quite willing to be judged by them, and am not much concerned about it, only as it has appeared in your columns, I wish to contradict it through the same medium.\n\n\"Objection\" was not said by the English half breed, because he had never heard of it. He said that one and only one was wandering on subjects which had been discussed at other meetings, and found the subject of the present meeting a challenge, felt my duty to call them to the object for which we were met, and this was the result.\n\nI have not heard of any complaint the delegates made. A man attacking another public speaker on an unproved basis, has always appeared to me like coward taking a shot at a man from behind a hedge, whom he was afraid to face in the open.\n\nMy Editor, of saying my actions are all open and above board. I am not afraid to meet anyone there, and stand up for my rights. This feeling is general. That the hard working settler who has been here and given his share, is treated with scorn and pity, is true.\n\nAnd the man who will not take all the means to improve these ill, is not fit for this place, and deserves the privileges of a free born British subject.\n\nSuch is the feeling of the settlers.\n\nAndrew Spencer,\nRed Deer Hill, June 2, 1884.\n\nSOUTH BRANCH.\n\nFrom an official correspondent.\n\nThe farmers here have been hard put to it.\n\nMr. G. Taylor, esq., has been chosen by the settlers as their leading experimental building of a new, which is to be erected on the property recently of Mr. S. V. Redfern. The settlers are anxious to build it. This is a move in the right direction, and every one who can afford a little should join in the movement to watch it when Mr. Taylor gets started with the subscription list. This house is situated between Prince Albert and Troy and Carrot River and opens up the best part of the farming lands.\n\nA meeting will be held next Tuesday at 7 o'clock.\n\nMr. Taylor, Mr. Taylor, and myself will be present.\n\nThe first lot for East A.B.C. Come in today or tomorrow and pay $5.00, or pay $10.00 next at that point, during the absence of Mr. Taylor for a couple of months.\n\nMr. McNeil, C.E., will take charge at the post office.\n\nDuring the last few days the price has been going up, but it is still lower than its lowest stage this season.\n\nSouth Branch, June 3rd, 1884.\n\n\"The Woman's Physician.\"\n\nA common sense medical work for reference. Fully answers all questions which modesty prevents asking a male physician. It is written in simple language, written for women, and contains a complete course of life study. A plain book in delicate language which every woman, young and old, should read. It is a valuable and very contented help physicians to a great aid for the sick. Handsomely bound in cloth. Price $1.00.\n\nAddress the Bookseller, P.O. Box 100.\n\nJ. O. DAVIS & CO., Merchants, Prince Albert.\n\nFurniture\n\nJust arrived. In addition to our former stock we have received some Fancy Parlor and Bedroom Sets. Give us a call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all Descriptions, Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double (15) sell Customers.\n\nG. & C. E. CARTER, KNOX & BARKER, CARPENTERS ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWells sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN, Prince Albert.\nVOICE FROM THE ROCKIES.\n\nSaskatchewan, May 21.\n\nSir: This is the first time I have visited this City for fifteen years, as the time tables have not been changed, and according to the latest report from the Government, this place of which we have heard so much, is now a thriving little town, with many fine buildings, and a population of over 500 people. The future of this place depends upon the success of the mining operations, and an early opening will be desirable for a short time in order to secure the best results.\n\nThey have already about 30 feet, and expect soon to strike the main vein. The discovery was made by Mr. Smith, who has been working here all winter, and has been very successful. The number of men employed is about 100, and they are doing well.\n\nThe future of this place is bright, and I am confident that it will become a great center of commerce.\n\nI am, Sir,\n\nYour obedient servant,\n\n[Signature]\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railroads.\n\nSEEDS!\n\nR. E. KEITH & CO., Seedsmen.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 16 feet extra.\"\n\nLath, 75 cts. per bundle.\n\nShingles, $3.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT, SASK.\n\nNOTICE.\n\nI hereby inform the public that all persons indebted to me are requested to settle the same immediately; if not paid, will be added.\n\nN.B. If after this date I will keep no book accounts.\n\nWM. GORDON.\n\nPATENTS.\n\nNOTICE.\n\nI would respectfully inform the public of Prince Albert and vicinity that I have heard.\n\nMichael Miller's Blacksmith Shop where I will be happy to see all who may come.\n\nGood Work at Fair Prices.\n\nISAIAH MCCALL.\n\nGeneral Blacksmith.\nPUBLIC MEETINGS\n\nA meeting which had been called by poster, was held on Wednesday evening at the town hall, in the music-room at Hotel Russell. Mr. Horrigan, the President of the Town Council, was present.\n\nAt this meeting a committee consisting of Messrs. Marshall, MacDonald and Macdonald proposed the incorporation of the town, and gave their reasons for doing so. The reasons stated were that the town needed a proper organization, and that the incorporation would be beneficial to all parties interested. After some discussion a vote was taken, and the incorporation was approved by a majority of the members present.\n\nThe meeting was adjourned until next week.\n\nLorne Agricultural Society\n\nA public meeting was held at the Town Hall on Wednesday evening, at which Messrs. Murray, Macdonald and Macdonald presented a petition expressing their desire for the incorporation of the town. After much discussion and debate, the Incorporation was approved by a majority of the members present.\n\nTHE ADJOURNED MEETING\n\nThe adjourned meeting was held on Monday night at the same place. Mr. Horrigan, the President of the Town Council, was present.\n\nMr. Macdonald moved the adoption of a resolution which stated that the incorporation should take effect immediately. Mr. Murray seconded this motion.\n\nAfter much discussion and debate, the Incorporation was approved by a majority of the members present.\n\nTENDER FOR BUSINESS\n\nA tender for business is advertised in the newspapers in this town. The tender will be accepted by the Town Council at its next meeting.\n\nNew Spring Goods\n\nNew spring goods are now being delivered to Messrs. Murray, Macdonald and Macdonald. These goods include stoves, ploughs, etc., and are available at competitive prices.\n\nJ. M. Campbell's\n\nJ. M. Campbell's is now ready to deliver stoves, ploughs, etc., to the citizens of this town. The delivery will be at competitive prices.\n\nBuffalo Hall\n\nParties concerned will please take notice that over due accounts on our books have been closed, and will now be placed in the hands of our solicitors for collection.\n\nFrom this date we propose devoting our attention to promptly paying and cash customers, and will be prepared to offer them reliable goods at prices in keeping with the times.\n\nBETTS & Gwynne ARTISANAL SHOE MAKERS\n\nT. N. Campbell, Bookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc, Etc\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884060601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 2752, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7079, 2], [7079, 9187, 3], [9187, 11717, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]