[{"id": "34d3aef73cb4aed3026ffadc8ee348259b02edc2", "text": "FRIDAY, AUGUST 8, 1884.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, AUGUST 8, 1884.\n\nINCORPORATION.\n\nThe delay in the part of the Lieutenant-Governor in allowing the incorporation of Prince Albert, has been a cause of considerable disappointment to the inhabitants of that place. The result of the proceedings directed at the proprietors since the opposition was raised will not cause the delay. There can be no excuse for the delay, no matter how much might be said in its favor. In this matter, as in all others, our people, who waited upon His Honor, had the assurance from his own lips that it was by the advice of his legal advisers or of himself that he had delayed so long. We hope this may prove a caution to some of our community to abstain from rushing into conclusions formed on insufficient data, and to give more thought to matters of importance. Everything considered, perhaps this necessary delay may have been ordered for the best; as we will now have an excuse for not rushing into matters which might originally have been made things done in too great a hurry. We have every hope that the present session of the North-West Assembly will see the incorporation of Prince Albert, and that we shall see a situation that will be the talk of the people themselves should we fail speedily to secure municipal organization. There can be no doubt that municipal organization is needed by a very large majority of our community, although unhappily there has been a good deal of difference of opinion with regard to the details, whether as to whether each constituency should be represented by a vote of the whole municipality, or each by separate wards. That the latter plan is from every point of view the fair way seems obvious to anyone who has given the question any attention during the period having elapsed between the last election and the present one. It is evident that the question is being discussed, and that three wards, against one in the extreme west, and one at the extreme east, are ample sufficient for the interests of those between them. The question has been brought up by time and reflection been made apparent to most of those who were once against themselves to the councils of a far-travelled friend, who has visited us abroad, and who has heard of progress and enlightenment, which in his days gone by guided their free-booting Highland ancestors, the law of might being the law of right, or to quote the poet Wordsworth:\n\nFor why? Because the good old rule beareth them: the simple plan:\nThat they should take who have the power,\nAnd keep them who can keep.\n\nAnd they should keep who can.\n\nIf things proceed as favorably as we expect, it is high time for our prospective wardens to begin shaping their respective electoral districts with regard to the policy they intend to impose upon candidates for municipal office unless they propose to postpone their action until such time as they elect others unconditionally and then condemn their course. It may be premature to forecast a policy, but speaking generally we would advise\n\nSHANNON & McLEOD\n\nNOTICE.\n\nHaving a large payment to meet on THE 1ST OF AUG. NEXT, we respectfully notify all parties indebted to us to call and settle their accounts without further notice.\n\nSHANNON & McLEOD.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery.\n\nKEPT CONSTANTLY ON HAND.\n\nCONSUMPTION\n\nPositively Cured.\n\nAll sufferers from this disease that are willing to make the proper application of these remedies will be cured.\n\nASH & ROBBINS,\n\nFits, Bullers, or Falling Sickness.\n\nThe Department of Indian Affairs being desirous of having Great Mills established in the following places in the North-West Territories, the following resolutions will be carried:\n\nAt a point adjacent to the Indian Reserve, Snake Plains, about 25 miles north of Carlton — $1,000.\n\nAt a point adjacent to Onion Lake Reserve, Fort Pitt — $1,000.\n\nFor full particulars apply to Mr. J. O. Davis & Co., Edmonton, Ballarat, Pit or Calgary, any of whom acceptance of the terms must be sent off before SATURDAY, 1st JULY NEXT.\n\nE. DEWNEY,\n\nIndian Commissioner.\n\nTHE GABLE HOUSE.\n\nPool, Caron & Picton Hole Tables\n\nin the Territory.\n\nJOHN WIMBERSON, PROP.\n\nTHE WEEK.\n\nC. BLAKEETT ROBINSON, Publisher.\n\nTHE WEST END HOUSE.\n\nMeals at all Hours.\n\nGood Beer and Liquors always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nEAST END BAKERY.\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Leaves for $1.\n\nHugh McDougall,\n\nEast End Bakery.\n\nPUBLIC NOTICE.\n\nAll persons are hereby required to take notice that the entering, leaving, or remaining on the premises of the Minister of the Interior, the land of which is held under the Dominion Lands Act, is prohibited by law, and that any person without authority is liable to be prosecuted for an offense under the provisions of the act.\n\nFURNITURE.\n\nJust arrived, in addition to our usual stock, a large assortment of Fancy Parlor Bedroom Sets, Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions, Cradles & Cribs for the Baby, Rocking-Chairs for the Ladies, Mattresses Single & Double to suit Customers.\n\nC. & G. E. CARTER,\n\nKNOX & BARKER,\n\nCARPENTERS ETC.\n\nOFFICE AND WORKSHOP.\n\nNew Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER.\n\nWe'll Soon and Pumps Made and Repaired.\n\nNATHANIEL ACOCK.\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction wade.\n\nMOORE & MACDOWALL.\n\nPHOTOGRAPHS | Canada Pacific R'y. Co.\n\nChas. E. Page. CHANGE OF TIME.\n\nNEW STUDIO.\n\nEAST END.\n\nNOTICE.\n\nNEW\n\nSPRING & SUMMER\n\nMILLINERY,\n\nAND\n\nFANCY GOODS.\n\nMISS MACK & CO., JAMES B. CLAY.\n\nCENTS' FURNISHINGS.\nNORTH WEST COUNCIL.\n\nTuesday, July 17.\n\nCouncil met at 2 p.m. His Honor presiding.\n\nThe minutes having been read and adopted, Col. McLeod moved the following resolutions:\n\nThat in the opinion of the Council, a marked evidence of recognition of the good faith and true allegiance to the Crown of Canada by Mr. Crowfoot and the other chiefs of the Blackfoot nation who appeared in the Council on Tuesday last, and His Honor being led to present them some of His Crowfoot and his associates as a mark of the esteem in which his nation is held, it has been resolved by the Committee to consider the above resolution.\n\nMr. Oliver objected to the passage of the resolution on the grounds that the money was raised from which the revenue at the disposal of the Council is derived, and the members should not consent to the payment of money for such a purpose.\n\nResolution concurred in.\n\nORDINANCES INTRODUCED.\n\nMr. McLeod introduced an ordinance for the planting of forest trees.\n\nMr. Macdonald \"An Ordinance to establish Municipal Lines.\"\n\nMr. Macdonald, Chairman of the Finance Committee, then presented the following report:\n\nYour committee report they have examined statement of receipts and expenditures and find same correct.\n\nThey submit that the sum of thirty-five pounds be charged against the fund granted by the Parliament of Canada for expenses of the North West Territories, and recommend in future that all similar expenditures should be charged against the fund granted by the Parliament of Canada for expenses of the North West Territories.\n\nMr. Oliver moved a resolution that the Minister of the Interior and the Hon. Mr. Macdonald be requested to present the Federal authorities with the amount of the indemnity paid to the Indians due to the Mounted Police.\n\nThat the sum of $1,000 voted in session of 1883 for Public Works be used for the erection of buildings to be erected against the local expenditure fund.\n\nMr. Oliver moved a resolution that the Council might with propriety raise the question as to what the nature of their executive capacity would appear to be, and that the Council do in future exercise its powers in the manner in which the executive authority of the North West Territories is exercised.\n\nMr. Oliver moved a resolution that the funds granted for the Government of the North West Territories be expended within the province of the North West Territories.\n\nThey would also call the attention of the Council to the fact that until the completion of the railway line, the North West Territories will be unable to provide the services of the North West Territories which under the control of the Council do depend upon the services of the North West Territories.\n\nMr. Oliver moved a resolution that the Council do in future expend its funds for the erection of buildings to be erected against the local expenditure fund.\n\nThe House resolved into committee to consider amendments to Ordinance re-creating the town of Fort Macleod.\n\nAmendment introduced providing in effect, that owner shall have lien only for balance due and dispensing with necessity of registration, as originally was proposed.\n\nCol. McLeod moved that the deposits to the new town of Macleod agreeable to the terms of the proposal be made.\n\nThe members of the deposits were then introduced and requested to address the Council on the proposed terms.\n\nMr. James, on behalf of his associates, said he saw no objection to the proposed act, and was of opinion that had the matter been brought before him, he would have been prepared to make the deposits.\n\nMr. Oliver moved a resolution that the existing act would never have been passed.\n\nMr. Oliver thanked the Council for the satisfactory manner of the proposed act and for the attention they had given to it during the debate.\n\nMr. Oliver moved a resolution that the Council be adjourned sine die.\n\nThe motion was carried.\n\nThe House adjourned at 5 p.m.\n\nBUFFALO HALL!\n\nHosiery, Gloves and Dress Linings,\nReady-made Clothing and Table Oil Cloths\nEvaporated Peaches, Evaporated Apples,\nPrime Tomatoes, Choice Oat Meal,\nAnd Canadian Cheese.\n\nTOBACCO.\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Benanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nNOTICE!\n\nJ. L. JOHNSON & CO.\nBeg to announce to their customers that after June 30th their terms will be net cash to all who do not make satisfactory settlement of their accounts to that date.\n\nN.B. -- A good supply of American Coal Oil now on hand.\n\nJ. L. JOHNSON & CO.\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool and Miscellaneous Books.\nStationery, Fancy Goods,\nMusical Instruments.\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in. Advertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVEETY,\nPROPS\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884080801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 2714, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5434, 2], [5434, 6184, 3], [6184, 11339, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]