[{"id": "dc4fa7e62f7bbebcaa8a56c82b6e0361496977e7", "text": "CHRISTMAS\n\nNow save us from every evil power,\nAnd keep us from these fears,\nFor Christ, the Lord, our Saviour,\nWas born on Christmas Day.\n\nOld English Ballad.\n\nBefore the next issue of our paper, another anniversary of the grandest Festival of the Christian year will have come and gone. Christmas, with all its joyous associations of bygone years, seems to be more in summer climate, as upon us once; more and more the reason why so much of what is now done in these northern latitudes, should not enjoy ourselves as much as our more favored brethren in other lands, who have the holy and the musical to grace their Xmas festivals.\n\nThe great religious feature of Christmas is the universality of its observance. Not only wherever the English language is spoken, but wherever the Christian religion is known, the bitter day of winter is observed. In every quarter of the globe, the doctrine of peace on earth goodwill toward men, at this joyous season of the year is acknowledged and celebrated. From the farthest regions of the north, to the languishing lands of India, the same glad tidings of great joy, as were told by the angels to the shepherds on the plains of Judea, eighty-three hundred and eighty-two years ago, are proclaimed and welcomed by Indians and aborigines.\n\nWhat attracts our attention? But observe their rapt attention.\n\nThe glorious feature of Christmas is celebrated, and so may it, until time shall be no longer.\n\nBut it is not only its religious aspect that Christmas should be welcomed, as the most joyous season of all the year. As a season of social reunion, and reunion, when every man must meet his fellow, and forgetting the cares of present anxieties and belongings, extend to him the hand of fellowship and brotherly love, who would be willing to forego the softening influences of Christmas?\n\nLet us then, one and all, endeavor to make our homes, our friends, and neighbors, bright merry Xmas, not forgetting, on this, the threshold of the natal day of Him, who hath said, \"the poor ye have always with you,\" even in the favored town of Prince Albert, then, by whose scarce Xmas fare, we can replenish out of the plenty with which we have been favored.\n\nAbove all let us make it a happy day for the little ones. Let them be happy, and let them have the full fill of mirthful jollity, and all manner of good things. Care and sorrow will come soon enough in this weary world. Let them then, for one day in the year at all events, forget their troubles, and hearts content. Do not allow all things destroy their abiding belief in the reality of all the associations of Xmas, hallowed as they are by the traditions of centuries. Do not abuse, those absurdities of old ideas that old Santa Claus, in corporeal presence does actually descend the chimney, to fill the expectant stockings, bestowing his blessing upon the sleeping innocents the while.\n\nAnd we the elders with whom the stem and stern of life, have somewhat blunted our keen enjoyment of Xmas festivities, cannot we live over again our childhoods days, in witnessing the joys of our children, and by taking part in their fun and trimmate efforts, cheer up the young agers. There are some among us, who have lately taken up their abode here, who will spend their Xmas, thousands of miles away, from the loved ones at home, and whose feelings will necessarily be somewhat tingled with sadness. They will look forward to the future, from the anticipation of happy days, and of the happy Christmases they have spent in their boyhood's home. In the happy time, after, also I'm sure they will wish they could have been amongst us on our dear island, to see our Xmas.\n\nLet us then, one and all, enjoy ourselves in our own way, in our joyous Xmas, and give our thoughts to our dear friends, our patrons, subscribers and readers, and the good people of Prince Albert generally, we wish them all a Merry Christmas.\n\nThere is no doubt that an express line of stages, for the conveyance of passengers and carriage of light goods, between this place and Edmonton, would be a great convenience to the enormous rise in the quantity of mail wagons are sometimes obliged to refuse to take passengers, which was the case on the last trip. We think this would be a great benefit to the travelling public and to business men in Prince Albert, if a line of stages were run say once a week, in summer, and fortnightly in winter. Who will start it?\n\nAmongst the many wants of Prince Albert there is one more pressing than any other, a town hall or building of some kind suitable for public meetings, holding of courts, etc. The Dominion Government should build a suitable Court House, and provide a suitable place for the use of the public in this respect. A joint stock company should be organized to purchase a suitable building and no doubt it would prove a popular concern.\n\nLEARNER'S CATHOLIC MISSION.\n\nIn our last number we mentioned how the mission was now being carried on, and the importance of the mission work of the order of Oblates, an order prominent in the North West. We are informed that the mission has been very successful from the proper sources. The work so far has been mainly amongst the Indians, who have been visited extensively, and the Indians are the interior, and extends from the men of Mass., and the Indians of the interior, and the members of the order are still there, devoted to their work, and many of them have been converted, and others have been educated, and sent back to their tribes of the North West to convert others. They have been probably, and they have been very successful in their work. They have been in the country of the Indians, and the Indians have been very successful in their work. They have been very successful in their work.\n\nMISS MACK & CO.\n\nHardware!\n\nChains,\n\nRope,\n\nGlass,\n\nPotatoes.\n\nPotatoes.\n\n$15 REWARD\n\nLOST\n\nTwo Ponies\n\non the Ride, back of the Farmer's Home.\n\nLost on the Ride, back of the Farmer's Home.\n\nMichael Dumas\n\nLowest Prices\n\nJ. R. McPhail\n\nSHELF HARDWARE\n\nIron, Sheet Iron and Copper Ware manufactured.\n\nThe latest and best designs in Brass, Bronze, Bells, etc.\n\nWe offer a stock of Hardware, Glassware, and Iron Hardware Ware, coming in all sizes, designs, for Cup, Milk and Meat Service.\n\nSTEWART & WOOTTON\n\nIMPORTANT NOTICE.\n\nFURS\n\nFURS\n\nWe have decided for the next two weeks only to reduce our entire stock of Furs 15 per cent. from present prices. The best assortment in the settlement to choose from. Now is the time for bargains, and a rare opportunity for gaining a handsome Xmas Present.\n\nLadies' South Sea Seal St's,\n\nLadies' Persian Lamb Sets,\n\nLadies' Astrachan Sacques\n\nLadies Buffalo Beaver Trimmed Jackets\n\nMUFFS.\n\nMisses' and Children's Muffs Ladies' Persian Lamb Muffs.\n\nLadies' South Sea Seal Muffs Ladies' Grey Lamb Muffs.\n\nLadies' Alaska Sable Muffs Ladies' Astrachan Muffs.\n\nLadies' French Seal Muffs, etc., etc.\n\nCAPS.\n\nLadies' and Gent's Fur Caps,\n\nGrey Lamb Caps,\n\nAstrachan Caps,\n\nFrench Seal Caps,\n\nBeaver Wedges,\n\netc., etc.\n\nCHILDREN'S WHITE CONY HOODS.\n\nBUFFALO COATS.\n\nBUFFALO - Beaver Trimmed Coats.\n\nBUFFALO - Grey and Black Lined.\n\nMoccasins\n\nThe Largest and Finest Stock of Moccasins ever offered in Prince Albert, at prices which cannot be beat. Call and see for yourselves.\n\nGLOVES, &c.\n\nFull Line of Ladies' and Gent's Gauntlets, Mitts, Gloves, Etc., at Very Low Prices.\n\nCLOTHING.\n\nOur Stock of Fall and Winter Suits,\n\nOvercoats, Ulsters & Overalls\n\nIs now complete, and comprises the largest variety ever offered in Prince Albert, at Winning Prices.\n\nGent's Furnishings\n\nUnderclothing, Canadian all-wool Suits, Scotch all-wool Suits.\n\nShetland all-wool Suits, Cashmere all-wool Suits\n\nSocks and Overalls\n\nFull line of Scotch Lamb's Wool Socks and Overalls.\n\nOUR STOCK OF Shirts, Collars and Cuffs\n\nIS VERY COMPLETE.\n\nWoollen Overhirts, Cardigan Jackets,\n\nSilk Handkerchiefs, Silk Ties, etc.\n\nBraces, Braces, Braces.\n\nTweeds. Tweeds. Tweeds.\n\nFor the Most Complete Stock of General Goods, best quality, and lowest prices, go to STEWART & WOOTTON\nNO SMELL BUT IN GERMANY.\n\nA Saxony correspondent of the Chicago News, telling of the absence of the famous New Year's Eve in Germany, says: \"It doesn't exist here, but the first night of the year is celebrated there in a very special manner; this discovery was pleasant news, and I am not sure but that I shall be able to make use of it.\"\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nPROPRIETOR\n\nREAL ESTATE.\n\nThe undersigned having purchased a NUMBER OF LOTS ON THE HURD AND BAKER ESTATE, wishes to inform the public that they are now on the market.\n\nHARRY E. HURD,\n\nImportant to Farmers.\n\nThe undersigned have purchased the Engine and Threshing Machine lately owned by Thom. McKay, Esq., and are having them thoroughly repaired, and will be ready in a few days to attend to all who may require their services.\n\nFarmers may depend on having their grain threshed to their satisfaction.\n\nApply to\n\nD. L. SHANNON,\n\nor W. JOHNSON.\n\nN.B.-Mowers, Shannons & Johnsons will have another first-class engine and thresher to run next season in connection with the one lately purchased.\n\nTAYLOR AND BARBER\n\nCall on Scotty, the Tailor, for Your Clothes.\n\nFit Guaranteed.\n\nCutting a Specialty.\n\nHair Cutting and Shaving.\n\nJAMES SCOTT\n\nGABLE HOUSE,\n\nPRINCE ALBERT,\n\nN.W.T.\n\nJ. L. JOHNSON & CO.,\n\nHave just received a large and general assorted stock of Hardware.\n\nALSO\n\n500 GALLONS OF COAL OIL\n\nNo. 1 Campbell's Block, Prince Albert.\n\nMEDICAL HALL.\n\nT. E. JACKSON,\n\nChemist & Druggist\n\nDEALER IN DRUGS & CHEMICALS\n\nDrugs Sold Patent and Proprietary Medicines. Druggists' Sundries, etc.\n\nAgent for North British Linen Co. (Canada) for sale. All prescriptions and family remedies carefully prepared.\n\nT. E. JACKSON\n\nIn Porter's Building, West End.\n\nPRINCE ALBERT\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\n**Two Preachers**\n\nThe preacher stood in the pulpit,\nAnd spoke with bare discourse Of soul and revelation,\nNature's voice for hire.\n\nHe talked of the laws of order,\nOf the world's great need,\nAnd knowledge as the only key To find the haven there.\n\nAs winter came at the doorstep,\nReigned snow so strange and cold;\nAnd thoughts of salvation I knew none,\nWas there no end in sight?\n\nFor they saddled house of science,\nPreached on bended knee,\nA false fraud, whose pretensions Were not altogether free.\n\nAnd though the skies were indigo,\nAbout the pale and tragic,\nThere came into my eyes a vision,\nSuch as I had not known.\n\n'Twas a vision clear and bright,\nThe same face of a child, As I had seen when I was waking.\nHe lay asleep and smiled.\n\nNothing he said for my cheer,\nWith words so full of grace,\nBut in his face was impressive,\nAnd all his words were peace.\n\nI thought of a certain Teacher,\nThe wise, the spotless One,\nWhose words of comfort hover Within the heart of a child.\n\n'The good to be strong and learn'd,\nGod's word to be read and done,\nBut the best of everything that is:\nThe preacher hath control.'\n\n---\n\n**Patricia Kemball**\n\n*A Novel*\n\nBy E. Lynn Linton, author of \"Intertwined Lives,\" \"The True History of Joseph Andrews,\" etc.\n\nCHAPTER V. CANTERBURY.\n\nMRS. JAMES.\n\nShe meant it kindly, but her words came in with a horrible jar on the young girl's ear.\n\n\"They forget me there,\" she said, and then, forgetting all else except the sound of her voice brakes in between like the voice of a wolf, and the future, and the possibility too, which was almost too delicious.\n\n\"Yes, of course,\" she said, and Patricia could not help but have a feeling from you, Gordon. I shall have only letters to make me happy. Happy shall I be when I am with you,\" she cried. And she believed what she said.\n\nThe ancient adventurers shook hands with each other, and there, forever after, they were linked by a chain of honor, and the future, and the possibility too, which was almost too delicious.\n\n\"Yes, of course,\" she said, and Patricia could not help but have a feeling from you, Gordon. I shall have only letters to make me happy. Happy shall I be when I am with you,\" she cried. And she believed what she said.\n\n---\n\n**Marley & Criskill**\n\nGENERAL DEALERS.\n\nMARLEY BLOCK, Prince Albert, N.W.T.\n\nCash Paid for Grain.\n\n---\n\n**The Echo House**\n\nQU'APPELLE.\n\nThe favorite resort of old timers to the beautiful town of the Qu'Appelle. Good accommodations. The only frame Terms moderate.\n\n---\n\n**Prince Albert Bakery**\n\nPRINCE ALBERT.\n\nUsing in addition to the customary and the best flour, we are now able to offer our customers the following:\n\nBread, Cakes, Pies.\n\n---\n\n**W.R. Bell Warehousing**\n\nAT\n\nFORT QU'APPELLE.\n\n---\n\n**Merchants and Dealers**\n\nWill save the expense and change for slower shipments. We will take care of your goods and see that they are received promptly.\n\n---\n\n**Grundy Bros. & Co.**\n\nPORT OF QU'APPELLE.\n\n---\n\n**Real Estate**\n\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY LOCATED IN PRINCE ALBERT\n\nAnd all other real estate in the vicinity.\n\n---\n\n**C. Mair**\n\nPrince Albert, N.W.T.\nCHRISTMAS.\n\nBy Lord Byron.\n\n'Tis Christmas Day!\nTo one another\nI send my hearty\nAlas! my brother,\nHis wishy blow bitter\nOn Christmas Eve\nNo longer glitters\nA Christmas cheer!\nIf this be so,\nThen may the harvest\nFrom long ago\nStill bear its sweetest\nSign of old days past.\nLet death's pale fingers\nTheir bright heads\nLift from the blood\nTheir reddest stains.\nLet love's pure fire\nJudy's ashes ember,\nFor love's sake remember.\nSo may it be.\n\nTOWN NEWS.\n\nThe sterility of land has become alarmingly prevalent in this settlement lately. During the last week a large stack containing ten or twelve tons, was totally carried away by the wind. Mr. Taylor, of that vicinity, and we have heard of others who have suffered in a similar way. This is a case which should be looked into by the police and the guilty parties as possible brought to justice.\n\nThe recent appointment of the Rev. Dr. O'Brien, a priest of a small country parish in Prince Edward Island, to the recently created archiepiscopal position of Roman Catholic Archdiocese of Halifax, N.S., has given great surprise to secular and religious circles in this province. On a visit which he paid to this province, it was evident that an admirable case of an obscure country parish, is presented over here by his eloquence and learning, which is in the highest estimation in his archiepiscopal position in his archiepiscopal see. Dr. O'Brien is a native of Prince Edward Island, but has been educated abroad, but has already attracted attention by his abilities as an author and preacher. He will still be remembered as the author of such books as \"The Priest,\" and \"The Bishop,\" and about 200,000 pages.\n\nWe would call the attention of the Superintendent of the Meteorological Service in Toronto, to the importance of establishing a station here. We consider that the climate of this country is very suitable for the service at John's College, Winnipeg, and certainly we are entitled to have a full report of the weather, that they would furnish, the necessary meteorological observations, but the annual grant was not sufficient to meet the expenses of the observatory. The idea that they could do would be to keep a small room for taking the observations, and under the best conditions that during these times, they would be taken voluminously. If this can be done, it will be a great advantage to the people of this part of the country. Meteorological observations should be taken in the North West Territories.\n\nTO THE PUBLIC.\n\nWe have made arrangements to have papers at J. Agnew's hardware store, the Post Office, T. M. Campbell's news store and Hinkley & Co.'s dry goods store. Those living outside of the town of Prince Albert may have their newspapers delivered. Also at this store.\n\nJ. SINCLAIR,\n\nMERCHANT TAILOR.\n\nI have just returned from New England and am now showing the latest Toronto overcoats, etc., at Prince Albert.\n\nA full line of Messrs. C. & J. Scott's Caledonian Restaurant\n\nOPPOSITE THE R. B. MILL.\n\nMEALS AT ALL HOURS.\n\nLIVERY AND FEED STABLES\n\nIN CONNEXION.\n\nG. A. MILLER.\n\nPROV. C. P. R. WEST.\n\nR. B. WAY,\n\nPost Office, Prince Albert.\n\nNOTICE.\n\nNotice is hereby given that the application will be made at the next session of the Legislative Assembly for the purpose of incorporating a company for the purpose of carrying on the business of farming lands in the North West Territories. The company will be known as the \"Prince Albert and District Agricultural Company,\" and will be located at Prince Albert and will be engaged in the business of farming and raising cattle and will make every effort to promote the welfare of the people of the district.\n\nSPINK & MAVETY,\n\nPROPRIETORS.\nTOWN NEWS.\n\nMr. Geo. Findlay, the butcher, is confined to the house.\n\nMr. F. E. Smith, the harnesser, has removed to his new offices. (See building over Walters & Baker's formerly J. O. Davis & Co.'s old stand.)\n\nOn Christmas night an entertainment will take place in the Presbyterian Church in connection with the Xmas tree. All are invited.\n\nA shooting match will take place on New Year's Day at the Woodbine Park Collection in aid of the Red Deer Hill Church. Everyone invited.\n\nIf you want a good evening call at the Woodbine Saloon.\n\n\"Come where the Woodbine twirls,\nAnd hear Whangadoo mourn for his poor master.\"\n— Tom Taylor.\n\nWe would like parties having Prince Albert lots for sale to leave their names with us at our office. Messrs. A. Wootton, Solicitors and Conveyancers, Prince Albert.\n\nA shooting match will take place at Woodbine Park, New Year's Day, at 12 noon, for a substantial prize. Range 200 yards, open small bores. Pipes can be seen at Mr. Robertson's.\n\nOn January 1st, Sunday school entertainments will take place in the Methodist Church, at 7 p.m., when a collection will be taken up for the benefit of the Sunday School and the Orphanage. Do not forget it.\n\nThe fall of snow has been very heavy, and the crops are now being gathered in the vicinity of Prince Albert. Between three and four feet has already fallen on the average, and every other day or two more falls are expected. The crops have been cut, and the fields are already covered with several inches of hard dry snow.\n\nThe salesmen have been taking advantage of the fine weather and good ice, but few days ago, a mob led by Mr. Johnston, who lives opposite Mr. Johnston's store, and every day the knights of the ice, came out to try and drive the snow from the streets. It was a very amusing sight.\n\nNotwithstanding the delays and inconvenience caused by the snow, the navigation of the river this autumn, there is a larger stock, and greater variety of goods in Prince Albert than was ever known before. Some of the stocks are very valuable, ranging from $500 to $1,000.\n\nMr. Nicholas Bond, owner of the Toronto Globe, is making arrangements to establish a newspaper in the new town. He hopes to be able to order material, and in a short time there will be another addition to the literature of Prince Albert. We understand that a house of $5,000 has been erected by the inhabitants to start the enterprise.\n\nBy referring to our advertising columns it will be seen that a rifle shooting match will also be held on New Year's Day, open to all comers. The prizes of which there are twenty-five, are given by the merchants of Prince Albert, and are well worth shooting for. Particulars can be had by applying to D. R. Pender, Jas. Knowles, of Macintosh & Knowles, or Mr. Bond.\n\nA. Hobbs has just put his new first class hotel in running order, which is doing a very brisk business. He has fifty regular boarders, and does a large business with travelers. The hotel will be known by a Union Jack displayed at the top of the building. His friends in town will be glad to hear of his success in the rising town of Prince Albert. He also has a saloon attached, stable in connection with the hotel.\n\nIn reply to a circular from the Post Office Department, we have received the following statistics, as regards the Town of Prince Albert: Population of town, 3,600; number of houses, 400; denominations 8; schools 3; and Emmanuel College, now mills 2 steam; flour mill 1; lumber yard 1; stores 23; hotels 6, including boarding house, value of real and personal estate, about $2,500,000. We shall soon publish a list of the new buildings erected in Prince Albert this year with their cost.\n\nThe district Judge had some difficulty getting horses after having been as appear from the latest news from the Saskatchewan Herald of November 11th. \"Col. Richardson returned on Friday last from a visit to the officials of the eastern divisions of the Saskatchewan District. On his way from Prince Albert horse was stolen, and although he tried to get the horse back, he could not go off to walk, until the last day he met relief teams that had been sent out to meet Col. Herchmer, also on his way home from Prince Albert.\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT, N.W.T.\n\nTHE NEW A.B.C.\n\nALWAYS BUY FOR CASH,\n\nAND GET FULL VALUE FOR YOUR MONEY.\n\nFresh Groceries.\n\nTeas.\n\nSugar.\n\nGibb's Hungarian Patent Process Flour.\n\nPrince Albert XXXX Flour.\n\nEvaporated Peaches.\n\nEvaporated Apples.\n\nDried Apples.\n\nNew Raisins.\n\nNew Currents.\n\nCalifornia Fruits.\n\nGray's Celebrated Scotch Jams.\n\nMarmalades.\n\nSpray in Jars and tins.\n\nCanned Meats.\n\nCanned Fish.\n\nCanned Soaps.\n\nSugar Cured Hams.\n\nSugar Cured Bacon.\n\nCross & Blackwell Pickles.\n\nWorcestershire Sauce.\n\nYorkshire Relish.\n\nSpices, etc., etc.\n\nBiscuits, Biscuits, Candies, Candies.\n\nNEW STORE.\n\nNEW GOODS.\n\nNEW PRICES.\n\nWALTERS & BAKER\n\nHave just Opened a Complete Assortment of\n\nDry Goods, Clothing,\n\nBoots and Shoes,\n\nGroceries & Provisions,\n\nIn the store formerly occupied by J. O. DAVIS & CO.\n\nThe public are invited to call and inspect the stock before purchasing elsewhere.\n\nH. WALTERS, F. C. BAKER.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\n\nJust arrived, a Large Assortment of Campbell Tucker Prize Exhibition Cards.\n\nCall early and make your selections.\n\nMusical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nHORSE SHOE STORE.\n\nSanta Claus Sack is now open.\n\nToys, Toys, Dolls, Dolls.\n\nHoliday Gifts of all kinds, Work Boxes,\n\nDressing Cases, Writing Desks, Etc., Etc.\n\nThe Finest Selection in Town.\n\nFURS.\n\nLady's Sets Persian Lamb.\n\nGent's Persian Lamb and South Sea Sea,\n\nCaps, Muffs, Gloves and Moccasins at reduced prices.\n\nArctic Overshoes.\n\nFelt Boots.\n\nFelt Socks.\n\nChildren's and Ladies' Boots, etc.\n\nClothing\n\nClothing\n\nFull lines in Gent's Furnishings, General Dry Goods, Teas, Tobaccos,\n\nPipes, Patent Medicines, Toilet Soaps and Perfumery,\n\nor anything you want good and cheap.\n\nCall At The Horse Shoe.\n\nTHOMAS O. DAVIS,\n\n1879. $16850.\n\n1882. Twelve hundred sheep were lately sold in England for the above price, the highest ever paid at a large sale.\n\nTO HAND—THIS WEEK:\n\nGrey Blankets, extra large.\n\nRed, White and Grey Flannels.\n\nKnitting Yarns, in all colors.\n\nAnd a fresh supply of our celebrated double stitched\n\nOVERALLS\n\nFOR CHRISTMAS:\n\nChicken and Turkey,\n\nAnd an Endless Variety of\n\nCanned Meats and Fruits\n\nBrooms for the Roarin' Game\n\nBoots and Shoes\n\nReduced 10 per cent.\n\nHats, Caps, Gloves, Mitts and Moccasins.\n\nBETTS & Gwynne.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882122001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 5898, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8037, 2], [8037, 10277, 3], [10277, 13392, 4], [13392, 17057, 5], [17057, 23768, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]