[{"id": "47e50beb8dddc86c79ab78df87718accecd53811", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N. W. T.\nTERMS—6¢ per number; 12¢ per month.\nSpecial rates to subscribers in Canada.\nSubscriptions—$1.00 per year.\nThis paper is issued every Friday.\nSubscription rate—$1.00 per year.\nNo advertisements will be accepted under three months.\nNo advertisements will be accepted without instructions.\nNo advertisements will be accepted from persons who have been convicted of any crime.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Alban's Church—Rev. Mr. and Mrs. Macdonald, in charge. Address: Rev. Mr. Macdonald.\nSt. Paul's Church—Rev. Mr. Cane, in charge.\nSt. Andrew's Church—Rev. Mr. Cane, in charge.\nSt. John's Church—Rev. Mr. McKay, in charge.\nSt. James' Church—Rev. Mr. McKay, in charge.\nSt. Matthew's Church—Rev. Mr. McKay, in charge.\nSt. Mark's Church—Rev. Mr. McKay, in charge.\nSt. Peter's Church—Rev. Mr. McKay, in charge.\nSt. Paul's Church—Rev. Mr. McKay, in charge.\nSt. Andrew's Church—Rev. Mr. McKay, in charge.\nSt. John's Church—Rev. Mr. McKay, in charge.\nSt. James' Church—Rev. Mr. McKay, in charge.\nSt. Matthew's Church—Rev. Mr. McKay, in charge.\nSt. Mark's Church—Rev. Mr. McKay, in charge.\nSt. Peter's Church—Rev. Mr. McKay, in charge.\n\nTHIS PAPER IS NOW BEING SENT TO ALL THE PRINCIPAL TOWNS IN SASKATCHEWAN.\nREMEMBER, IF SUBSCRIBED, THAT ADVERTISEMENTS ARE ACCEPTED FOR ONLY THREE MONTHS.\n\nFRIDAY, MARCH 1, 1889.\n\nOur attention has been called to an attack made on Mr. Dewdney in the House of Commons by Messrs. Laurier and Cartwright. It is not an apologist for Mr. Dewdney, but in his defence we say that we consider the attack of the Opposition leaders was entirely uncalled for and altogether unjustifiable. But we suppose that some allowance must be made for Laurier and company, who are in a very bad way, and hoped their visit to Sir John Macdonald and the other old members of the Government had always been sat on, and now when they noticed a young Minister on the Treasury Bench, they thought he was a fitting object to come to vent their spleen and that they could easily make short work of him. A great deal of stress was laid by Mr. Laurier on the fact that when Mr. Dewdney visited this district in 1884, he made a speech which was not liked by the people. We do not deny that he was coldly treated by a portion of the community. But it was not on account of his intention to the wants of the half-breeds or Indians. It will be remembered that just at that time the citizens of this place had petitioned Mr. Dewdney for the incorporation of the Town of Prince Albert, and he for sufficient reasons at that time saw fit not to grant the petition. The citizens consequently were very hostile over it, and had not got over their fit of indignation when his Honor visited the place, and for that reason alone his Honor did not receive that spontaneous and hearty reception which he otherwise would. The citizens have long since admitted that Mr. Dewdney deserved and should have received better treatment, and are all willing to acknowledge the wisdom of his actions. Mr. Dewdney is today the most popular man in the Territories, and we venture to say that should he be elected, as we trust he shortly will, visit this same district, he will be given a reception by a class of voters, civic, political and otherwise, such as no other public man in Canada could receive. He every day gives fresh evidence of his knowledge of the country and its requirements, and has during the short time he has occupied his present position done great deal more for the welfare of these Territories. We have only to instance the recent treaty with the northern Indians and issue of scrip to half-breeds to show that he fully alive to the requirements of the native population.\n\nThe most recent information from Ontario is that the Regina and Long Lake Railway is progressing. There is at present reason to believe that it will cross the South Branch before the end of the year. It will, however, be perfectly in order to receive contradictory news in the near future.\n\nNot all the United States newspapers are anti-British. For instance the Washington Post remarks on the conduct of the American press, which has got along something that somebody remember that in the last few months we have rejected the fisheries treaty, the extradition treaty, ordered the British Minister to go home, and brought home the Canadian Minister. American Ministers in England are there yet. Yet England is not paying dirt and howling. If she did one of those things to us there would be a shriek for gore.\"\n\nSASKATCHEWAN INSTITUTE.\nThe second regular meeting of the Saskatchewan Institute was held on Friday evening last in the rooms of the Royal Canadian Legion. Although the night was extremely cold quite a number of prominent citizens were present.\n\nAfter the business had been discussed the following new members were initiated and accepted: T. McKay, J. Knowles, Mrs. Knowles, R. S. Cook, A. H. Cook, J. G. Smith, Mrs. Smith, M.L.A., and Wm. Plaxton, M.L.A.\n\nThe Rev. Dr. Jardine then read a very interesting paper on the study of science, after which the interesting discussion took place on topics referred to in the paper by which the president, Rev. Mr. Gurn, Dr. Cook, Mr. Farter and others took part.\n\nThe next meeting will be held on Friday evening next and a paper will be read by the Rev. Mr. Howden.\n\nOUR LITTLE SON\nOur little son was afflicted with a painful skin complaint which seemed to fail, fail, fail, and worse and worse. We tried everything, but nothing seemed to help. Our little son will be fourteen years old on the 25th inst. In May, 1888, he suffered from a severe attack of the complaint, and we were obliged to keep him away from school for about four weeks. The child recovered, but the complaint returned, and the doctor said it was getting worse. We tried various remedies, but nothing seemed to help. Finally, we consulted a physician who prescribed a remedy which seemed to help. We continued to use it, and our little son gradually improved. We are now convinced that this remedy is the best for our little son.\n\nThat Old, Delicious Killer of Pain, Whether Internal or External.\nEvery Drop of Pain Killer should come from the purest source, and be prepared in every way to give satisfaction. Pain Killer is a powerful analgesic, and is recommended for immediate relief in cases of Neuralgia, Rheumatism, Sciatica, Neuralgia, etc. Sold everywhere. Price 25 cents per bottle.\n\nCampbell's Cathartic Compound (Elixir).\nA powerful cathartic and stimulant, containing a large amount of active ingredients. Sold everywhere. Price 25 cents per bottle.\n\nBABY'S FIRST TOOTH PAINT.\nA powerful antiseptic and stimulant, containing a large amount of active ingredients. Sold everywhere. Price 25 cents per bottle.\n\nSTRAYED.\nCome on to my premises, at the Creek, or about October last.\n\nOne White Three Year Old Heifer.\nOne Two Year Old Bean Steer.\nOwner will please prove property, pay expenses and take care of animal.\n\nTHOS. O. DAVIS.\n\nR. C. WIGMORE & CO.\nMen's and Boys' Underclothing.\nMen's Cardigan Jackets.\nMen's Pea Jackets.\n1,000 Remnants of Carpets, cheap.\nA Full Line of Dress Goods.\nChoice Selection of Ladies' Hosiery.\nMen's Overshoes at cost for cash.\nMitts and Moccasins.\nA Paying Investment. Examine Our Stock.\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\nSchool Books and Stationery.\nPublic and High School Text Books.\nSchool Requisites of every description.\nStephens' Blue Black Ink.\nALL SIZES—WRITING AND COPYING.\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors.\nGENTS FURNISHINGS.\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nGENERAL NEWS.\n\nMontreal has been again visited by a snowstorm, which has not been so severe as last year's, but has caused considerable inconvenience. The city was covered with snow on Monday night, and the streets were slippery and difficult to travel on. The weather has been very cold, and many people have been forced to remain indoors due to the harsh conditions.\n\nVICTORIA\n\nLivery and Boarding Stables,\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double their present size, we would respectfully request the public to patronize us at our new location.\n\nWell and water river almost at the door.\n\nWe have a large stable for horses, and a well-known list of prizes for sale.\n\nOur rates are reasonable prices.\n\nOur signs are new, and not liable to breakage.\n\nNEILSON & M'BEATH\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAT N Campbell's Star.\n\nA LARGE OCE OF Watches, Clocks and Jewellery.\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nW. STOBART & CO\n\nIndian Traders,\n\nGeneral Merchants,\n\nPrince Albert and Duck Lake,\n\nSASK.\n\nPaine's Celery Compound\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Newspapers by addressing Geo. P. Royall & Co.,\n\nNewspaper Advertising Bureau,\n\n10 Surge St., New York.\n\nSend 10¢ for 100-sec. Permanent Rates.\n\nG. H. CAMPBELL\n\nGENERAL\n\nRailroad Steamship\n\nTICKET AGENT,\n\n471 MAIN STREET,\n\nWINNIPEG, MAN.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER-TIMS,\n\nFot Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nA Dead Drop!\n\nON\n\nPRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nSUCH REDUCTIONS FOR\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo two like to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\n(LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER-TIMS,\n\nFot Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nTHE POLICE BALL.\n\nOn Wednesday evening last one of the largest social gatherings ever assembled in this town took place at the Police Ball-room, the occasion being the ball given by the non-commissioned officers and constables of the Prince Albert police force, under the direction of Prince Albert, town and settlement. The committee of management had issued over 150 tickets, and they were so well attended that nearly every one was accepted, which brought together about 300 people. The large hall was beautifully decorated for the occasion. The ceiling was hung with festoons of flowers, and with wreaths of haystacks, cornucopias, and other military accoutrements, together with drapery, ships and armorial bearings, all arranged in a most tasteful manner. Over the main entrance, leading to the ballroom, was the device of the police force, consisting of ships' wheeling, on the arm of which was seen the emblem of the millennium and the words \"Welcome,\" denoting the feeling which exists between the people of our town and its forces. Dinner was served at 8 o'clock and was kept up without ceasing until 4 a.m., on Thursday. The dinner was of the best class and was supplied by Mr. Lewis' orchestra, conducted by Mr. Cook and Mr. McKinnon. The arrangements were perfect in every respect, and the evening passed off in a most agreeable manner, and a better supper was never before served before the people here; it is said that many thought they had never eaten before when the supper was given to them. All the troops were indefatigable in their endeavours to make their guests enjoy themselves, and they did so admirably, sporting no pains or trouble in doing so. The ladies were very attentive and very obliging, and the men were equally polite and they all spoke highly of the arrangements made for their comfort and the pleasantness of the evening. The guests did not begin to leave until after 2:30 and it was 4:30 a.m. before the last left the hall. The band was conducted by Mr. Murray, Staff Sergeant, Royal Canadian Mounted Police, and the band was very good. The officers and constables present were very attentive and very obliging, and they all spoke highly of the arrangements made for their comfort and the pleasantness of the evening.\n\nSTANGLER.\n\nThe committee appointed by the citizens last December has collected statistics as to the trade products, etc., of Prince Albert and its environs, and has ascertained the following facts: In 1886 there were over 2,000 tons of merchandise imported into the town, valued at $10,000. In 1887 and 1888, in 1886, in 1887 and 1888, there were large quantities of oats and flour imported into the town, but the failure of the crops in those years, and the grain imported is not included in the above. The quantities of grain raised in this district are very large, and the amount of grain imported into Canada is as follows: Wheat, 20,000 bushels; oats, 85,973 bushels; rye, 1,000 bushels; total, 97,973 bushels, or a total of 101,286 bushels of all kinds of grain. In 1886 there were imported 200,000 bushels of wheat, which raised the price of the wheat, and the figures above for last year are as nearly correct as it is possible to get them, as they were compiled from the returns of several different farmers working in the District. Besides the above a considerable quantity of grain was imported into the town by grain dealers. Supplies bought in the N.W.M.P. are not included in the above figures, as they are bought by the police and used for their own purposes. We have a list of all the farmers and grain dealers who have been selling grain to us, and we shall be glad to hear from any of them who may be interested in selling their grain to us.\n\nFOR SALE OR EXCHANGE\n\nThe Well-known Store of W. R. FISH.\n\nP.R. FISH\n\nFOR THE Best Assorted Stock of CONFECTIONERY\n\nGO TO H. M'DOUGAL'S BAKERY.\n\nH. MAGDUCALL & RUSSELL & DAVIS\n\nWHOLESALE AND RETAIL\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham and\n\nGAME IN SEASON:\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER—Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nCERROND BROS. BOOK STORE.\n\nHORSE SHOE STORE.\n\nGrand Clearing Sale Winter Goods!\n\nNo Reserve. All must go. No matter what price, we must have room for SPRING STOCK CALL AND GET BARGAINS THOS. O. DAVIS.\n\nFREE PRESS.\n\nThe publishers of the Manitoba Free Press, having a special object in view, make an unprecedented offer, as follows:\n\nAny person who will cut out this advertisement, and fill in this blank with Name and Post Office.\n\nAnd enclose it along with ONE DOLLAR, in registered letter, addressed FREE PRESS, Winnipeg, Manitoba, before first of April, will receive the Weekly Free Press regular price $0.50 per volume from time of receiving order till January 1st, 1890.\n\nWINNIPEG, Feb. 29, 1890.\n\nS. N. Smith, Editor.\n\nMANITOBA FREE PRESS CO.\n\nFOR SALE\n\nTHE ISLAND HOUSE PRIME JUNIPER.\n\nGet Your SCHOOL SUPPLIES AT CANN'S\n\nEAVESTROUGHING To Order NOW IS THE TIME", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889030101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 3852, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7854, 2], [7854, 10015, 3], [10015, 15001, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]