[{"id": "4e5c9142f1ee85ccb9a32a838f6a85d97fad774a", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\nTAXIERS.\n\nPRINCE ALBERT, N.W.T.\n\nA FEW PLAIN WORDS.\n\nIf Honore in his day came to bitterly complain of men soiled with the immoralities of the times, how much more are we to be pitied in our present state under the awful affliction of men suffering from the yet more innumerable itch of speaking we had almost permitted ourselves to use the expression half a dozen years past. Emotions of pride and disgust and amusement in turn dispel each other; as when sometimes happens, something with all the organs and more or less the soul of a man, at public meetings and solemnizing sound for some, behoves forth mighty nothing's legation of the very emptiness of his starved inside or outside. We stand there in public with a full knowledge of our own time and with an air determined as a slightly insignificant personal appearance admits of, pipe out \"we must have so and so\" and then the most extraordinary declaration that is from one point of view incredible amusing, and we would be hardly squandering such an object to deprive the public of so rare a treat as such a sight affords, especially when the exhibition comes without the self-respect of the exhibitor. Our desire is to speak a few plain words to men who, while very different from such as we have sufficiently in discussion, are not without their pretensions. By leaving up an irregular tenement in the Territories, discharging the value of property generally, we do it from us to be a word against the Government, and a word against constitutional notions, in obtaining a dress of grievances, which undoubtedly exist, and to assert our rights, but in order to do this we must talk, and talk in a loud manner. Such a protestation is to the mind of the majority of the world a monstrous thing to the State. Although it is contrary to the feelings of the vast majority of the people, it makes certain individuals think that the Government of Canada and British Columbia (not prepared for such a cause) in an appeal to the Crown for interposition from the Dominion, or even later on make this application on our behalf, would be a great loss to talk of a rebellion now is simply both. Supposing such an insurrection to be made, the Government has only to close the land offices, to stop the sale of our produce, to move the police, the soldiers, and other supplies to the limits, to discontinue our mail service, and remove the general machines of civil and governmental power, to bring us to know by the next morning. Meanwhile every idle threat of a disturbance reaching quarters where its real value is far from understood keeps our settlers and drives away capital, and we suspect that the Government is not in imagination. We grant this statement on the belief that were our reasonable requirements properly put before the Governmental authorities in their interest to do so, the question of the moment would go to Mr. Mahon, Mahon must go to the mountain so if it is too far for Sir John, or any Cabinet minister, to come to us,\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nA T. C. Company's Watch\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\nKEPT CONSTANTLY ON HAND\n\nEDITORIAL NOTES.\n\nAn ingenious Frenchman proposes that Paris should have an artificial sun. He says there should be no night in Paris at all, and that the nights could be turned into days, and the Parisians enabled to drive about and to promenade under a sun of their own manufacture. There would be no difference between the best and worst parts of the city. The idea is that a tubular tower a fifth of a mile in height should be erected surrounded by a series of gigantic carbon points kept burning by a powerful current that would play upon the faces and bodies of two thousand citizens. Over this blinding ball of light he would put a movable reflector, large enough to throw the light over the whole city. It is said that when they looked at their watches to tell whether it was four o'clock in the morning or ten o'clock in the afternoon, but this difficulty could be eliminated by adopting the twenty-four hour clock time system.\n\nCONSUMPTION\nPositively Curbed.\n\nJames Sinclair\nMerchant Tailor,\nand Dealer in\nGENTS' FURNISHINGS.\n\nLUMBER, SHINGLES,\nDOORS, SASH,\nMOULDINGS,\nBUILDING MATERIAL,\n\nAsh & Robbins,\nFancy Parlor\nBedroom Sets.\nSideboards,\nBureaus,\nBedsteads,\nCouches,\nSofas,\nChairs of nearly all descriptions.\nCradles & Cribs for the Baby.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nC. & G. E. Carter,\nKnox & Barker,\nCarpenters, etc.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\nPUMP ON WATER\nWells, Sinks and Pumps Made and Repaired.\n\nNATHANIEL ACORN\nNORTH WEST COUNCIL.\n\nFRIDAY, JULY 25, 1884.\n\nTELEGRAHIC.\nTHE DISPUTED TERRITORY.\nThe Privy Council Decide in Favor of Ontario.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 42\n\n\"Over 16 feet extra.\"\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nPHOTOGRAPHS | Canada Pacific R'y Co.\n\nNEW SPRING AND SUMMER MILLINERY, AND FANCY GOODS.\n\nMISS MACK & CO,\nCAMPBELL'S BLOCK\nROBERT THOMSON,\nSign & Ornamental Painter,\nPainting and Paperhanging on short notice.\nDecorative Painting a Specialty.\n\nPRINCE ALBERT\nPainting Mills and\nSash and Door Factory\n\nGOODFELLOW BROS. - PROP.\nPrince Albert, W.T.Y.\n\nWESTERN DIVISION.\nTRAIN SERVICE.\n\nCHANGES OF TIME.\n\nOn and after Feb. 1st, 1884, trains will move as follows:\n\nGoing West\n10:00 am Winnipeg\n12:00 pm Prince Albert\n1:00 pm Prince Albert\n2:00 pm Prince Albert\n3:00 pm Prince Albert\n4:00 pm Prince Albert\n5:00 pm Prince Albert\n6:00 pm Prince Albert\n7:00 pm Prince Albert\n8:00 pm Prince Albert\n9:00 pm Prince Albert\n10:00 pm Prince Albert\n\nGoing East\n10:00 am Winnipeg\n12:00 pm Prince Albert\n1:00 pm Prince Albert\n2:00 pm Prince Albert\n3:00 pm Prince Albert\n4:00 pm Prince Albert\n5:00 pm Prince Albert\n6:00 pm Prince Albert\n7:00 pm Prince Albert\n8:00 pm Prince Albert\n9:00 pm Prince Albert\n10:00 pm Prince Albert\n\nEAST END.\n\nNOTICE.\n\nI hereby inform all my customers that I am now closed, and all orders placed with me are requested to be sent immediately, if not paid by the end of the month.\n\nWM. GORDON\nMARKLEY & CO.\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT\nPainting Mills and\nSash and Door Factory\n\nGOODFELLOW BROS. - PROP.\nPrince Albert, W.T.Y.\nNOTICE.\n\nBuffalo Hall\n\nHosiery, Gloves and Dress Linings,\nReady-made Clothing and Table Oil Cloths\nEvaporated Peaches, Evaporated Apples,\nPrime Tomatoes, Choice Oat Meal,\nAnd Canadian Cheese.\n\nTOBACCOS.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Frog\nand Big Bonanza Smoking Tobacco.\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nNOTICE!\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that after June 30th their terms will be net cash to all who do not make satisfactory settlement of their accounts to that date.\n\nN.B. -- A good supply of American Coal Oil now on hand.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nThe Prince Albert Times\nAND\nSaskatchewan Review.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in Advertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply.\n\nSPINK & MAVEETY, PROPS\nRIVER ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884072501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2178, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4721, 2], [4721, 6745, 3], [6745, 8046, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]