[{"id": "34187a5cb0e42cdb4e53bd2dacc31af963d5811a", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFROZEN CROPS.\n\nIf we go back some six years in the history of Prince Albert, we may be surprised to find that the farmers of the district were very much troubled the farmers very little, if at all. That this should no longer be the case is not to be attributed to any sudden change in our climate, but to the fact that a number of farmers have continued to grow more than they could put down and take off in proper time. The present depressed state of things throughout the Territories generally, and the result of our own impudence on the part of everyone to undertake things on too large a scale, in order to grow rich at once. If as a result of this, the merchants of the Territories are suffering from over-stocked stores, it is equally certain that our farmers are paying the price of attempting to farm on too large a scale beyond their resources and at the time when the season's operations are on the point of commencing we may fully remind them how such policy is folly. But then practice makes perfect, contrary to what we would naturally credit farmers with the apparently obvious knowledge of the fact that at least as much grain cannot be grown on ten acres as can be grown on twenty acres. Now, if we take the average of wheat grown in the provinces from Manitoba and the North West, the highest averages of wheat in any of the provinces are from Manitoba and the North West. Well, for what growing, but then accidents will happen and when grain fails the farmer should have something to fall back on. Furthermore, let us remember that the habits and conditions of the soil of the East Indies render him a most formidable competitor with the white man in the production of wheat and that competition is increasing steadily in alarming proportions.\n\nMany forms of ornament and decoration are necessarily within the reach of the comparatively wealthy alone, and this attainment in itself is a period of cultivated taste to try and acquire fifty acres - the means to the end. For a poor man to ape the rich in this manner is not only ridiculous, but harmful to himself. Happily, however, for the great majority of the human race, nature, just as she abundantly supplies air and water, enables us to life of labor and sustenance. And while nature so abundantly affords us a supply of food, we must not forget that the seeds of these foods are contained in the seeds of wheat which we sow. In the hands of the farmer who has sown seeds of wheat, the seeds of future crops are already sown.\n\nJ. O. DAVIS & CO.\n\nTHE HORSE SHOE STORE\n\nDon't talk unless you have something to say.\n\nWe are determined to sell out at occasional Hard Lines. Better luck next time.\n\nTHE WEEK.\n\nCharles G. D. Scott.\n\nPublished every Saturday by Charles G. D. Scott.\n\nTHE FURNITURE BRANCH STORE.\n\nNear the building occupied by the late firm of Ashburn & Agnew, in the west end.\n\nMr. Wm. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO., Wholesale and Retail.\n\nPrince Albert.\n\nG. & C. E. CARTER.\n\nThe Grand Central RESTAURANT.\n\n(Old Warline Saloon.)\n\nThe new Restaurant has been opened and is now ready for business.\n\nMEALS AT ALL HOURS.\n\nTHOMAS OSMAN — Prop.\n\nCONSUMPTION.\n\nPositively Curled.\n\nAll sufferers from this disease are invited to communicate with Mr. C. O. D. Ashburn, 200 Fulton St., Toronto, or by express C. O. D. Ashburn.\n\nASH & ROBBINS.\n\n200 Fulton St., Toronto.\nITEMS OF INTEREST.\n\nTHE VERY LATEST NEWS.\n\nCANADIAN.\n\nFort Macleod, March 28.—Matthews & Atherton, publishers of the Edmonton Recorder, yesterday morning Mr. Atherton will continue the business.\n\nAt an adjourned meeting of the municipal council on Saturday night arrangements were made to banquet Mr. Watson, M.P., on his return from the capital. Mr. Watson will be elected to the leading men of the province.\n\nThe Margarette License Commissioners met last evening. They granted 167 permits, three of which were refused.\n\nGENERAL.\n\nLethbridge, March 28.—The Manitoba government has been negotiating with England and America with the view of adding to the extraordinary financial resources which shall cover the expenses of the proposed railway.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nTERITORIAL NEWS.\n\nCALGARY\n\nFrom the Herald, March 28.\n\nThe bands of horse on the Cochrane range at the Big Hill are in excellent condition, and have suffered exceedingly little.\n\nMr. Fitzpatrick, of the firm of Longfellow & Co., has been approached by the government regarding the purchase of land for the North West Territories.\n\nRev. Father Lacombe, during his visit to the district, has received many offers of assistance from the people.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nBATTLEFORD\n\nFrom the News, March 28.\n\nMr. McLeod, ex-pastor, has been called upon to preach at the Battleford church.\n\nEDMONTON\n\nFrom the Bulletin, March 28.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nAMERICAN.\n\nCHICAGO, March 28.—A meeting will be held next Friday by the different insurance companies interested in adopting a new passenger tariff and plans for the future.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nNEW YORK, N.Y., March 28.—A new wood pulp factory was opened today.\n\nFORT MACLEOD.\n\nFrom the Gazette, March 28.\n\nThe government has been unable to secure a loan from England or America, but has been able to secure a loan from Canada.\n\nPUMPS!! NEW GOODS!\n\nMEDICAL HALL.\n\nAll parties indebted to me by bank account are hereby notified to call and settle before April 1st, 1884. All accounts not settled for the above date will be put in my lawyer's hands for collection.\n\nCUSTOM WORK.\n\nREPAIRING.\n\nSHANNON & MCLEOD.\n\nTHE GABLE HOUSE.\n\nPHOTOGRAPHS.\n\nNEW STUDIO.\n\nEAST END.\n\nPrince Albert Bakery.\n\n2 LB LOAF, 12¢C.\n9 LOAVES, 15¢.\n\nCakes and Pudding always on hand and made to order.\n\nWM. R. BELL.\nCOMMUNICATIONS.\n\nPUBLIC SCHOOL PROGRESS\n\nTo the Editor of The Times:\n\nSir,—I feel it my duty to give you a short account of the parish school in this place. In the first place, through the earnest efforts of Mr. Andrew Spencer, the trustees secured the services of Mr. Germain, a teacher of great ability, who has been engaged at Ontario and Manitou, and installed him into his work in a private house some two months ago. The settlers in the parish, too, deserve credit for the manner in which they have assisted in securing the trustees, in buying and hauling logs to Edwin Sutherland's for the purpose of raising a school house next Saturday. Mr. Sutherland gave the land for a site.\n\nI wish, however, to report the wonderful improvement made by the scholars, which has confirmed anything I have ever seen, and prove that it is much better to pay well for a competent teacher, than give little to a good one.\n\nI visited the school and examined the children when Mr. Germain began to teach, about the middle of February, and again today, the 7th of April, and the progress has astonished me. They do not need so much help as I did in doing so short a time. The progress has not been confined to one direction, but on as many subjects as can necessarily be taught in such a course of standing.\n\nI may say, that not only have they a right school in the place, the children were very far back, most of them not able to read words of three letters or write a word on a slate.\n\nTo-day, I heard the senior class read in the second book, attend to the punctuation, spell the words, and give the parts of speech through the lesson. They read with great spirit. I also heard them in dictation which they did with hardly any error. In arithmetic, too, the progress was great. When last here, few in the whole school could figure, but now they work with ease and rapidity in addition and multiplication, while their answers in mental arithmetic are surprising.\n\nThe teacher deserves the highest commendation from the parents and those concerned in the interests of the school, for the satisfactory results of his teaching; and I hope they will give him all encouragement in such a noble work as the training of the young. Thinking you very much for your space.\n\nJ. F. PRITCHARD,\nSouth Branch, April 7.\n\nTIMBER DUES.\n\nTo the Editor of The Times:\n\nSir,—I wrote you, in the medium of The Times to a few weeks ago a matter brought to light in a late issue of your paper, which has since become a topic of general discussion in the settlement. I refer to statements made by Mr. Cameron, the Crown Timber Agent, and I understand from his letter that the Land Agent here has refused Mr. Cameron the privilege of residing here, as he has been a bona fide resident for a number of years, on the flimsy pretext that the Crown Agent has not approved his application for dues on timber cut seven years ago. I am not aware that the government has ever refused any request in this District that long since, even if they did there was not a resident Timber Agent thereabouts. Mr. Cameron has been a resident of this place since the Dominion Land's adoption of his duties in such cases, and the sooner he should be allowed to reside here, the less trouble the Land Agent does not authorize the Land Agent or any other official to withhold an entire year's dues. I have already called attention to the Land Agent's order to the Crown Timber Agent to show any instructions from the Department to that effect, and I am sure that the Timber Agent had any right to go to Mr. Pritchard for instructions whatever. But the Timber Agent evidently acquired the knowledge that Mr. Cameron had cut out timber seven years ago on what was then a Crown timber tract, and up to this date Mr. Cameron refuses to hand over the sum demanded, he (Waggoner) goes on record as saying that Mr. Pritchard and forms collusion with them, in order to coerce Mr. Cameron into paying money which he does not consider he owes the government, on which it would be gross injustice to make him pay. The government officials and the government officials here are fast becoming obnoxious to the people, and the whole thing has been going on for a long time, and I am glad to hear that their conduct in about bringing to the notice of the government, and surely before this, \"an incorrect\" would result in their being recalled, which would be hailed with delight by the majority of the people.\n\nI think there is a thorough failure of the government by the Dominion, and that they ought to make more reforms in the manner of working some of their offices in this place. \"Truly, the government is not doing justice to many of said officials at present, and unless the government does something about it, the people will rise in their might and just indignation, and may administer a wholesome dose to those who place trust in the offenders.\"\n\nJUSTICE.\n\nTo the Editor of The Times:\n\nSir,—We were glad to observe that in your last issue but one, when you wrote about the irregular proceedings of the local Timber Agent's cottages conduct towards himself—you pointed out that Mr. Cameron had always alleged outrage which the public justly felt entitled to have either contradicted or explained. As we know that Mr. Cameron has never addressed the matter, we can only infer that he considers it unnecessary to make any statement to that end, probably from his silence treating the public with gross discourtesy. We would kindly inform you whether Mr. W. will communicate with you on the subject or whether the order to refuse Mr. Cameron's request has been received?\" This being a matter affecting the rights of the inhabitants here, we desire to be informed as to what Mr. W. will do regarding the matter? We suppose Mr. W. will be in a position, should his conduct not lead to the satisfaction of the public in this circle, to supplement the not at all uncommon critical recitations upon the part of the government, which must lead inevitably to the downfall of Justice.\n\nJUSTICE.\n\nHow to Make Tarts.\n\nTake a box tart and fill directions for making tarts, using flour and sugar. The recipes for making caramel, chocolate drops, French mixed and all other directions for making tarts are included. The book is one used by the leading confectioners. Any one can have this book sent to them post paid for 5 cents (no stamps taken). Address JAMES SIMCLAIR, Prince Albert, Sask., Canada.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done next to H. B. C. Retail Mill.\n\nHandsome New Presbyterian Church.\n\nJAMES SIMCLAIR,\nMerchant Tailor.\n\nHas just received his new stock of Fall and Winter Goods, and is prepared to supply his numerous customers with Suits to please the fancy of all.\n\nAlso a large stock of UNDERCLOTHING.\n\nA Large Assortment of FUR CAPS AND MITTS.\n\nGive me a call.\n\nJAMES SIMCLAIR,\nWatches, Clocks, Jewelry, Stationery.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert—N.W.T.\n\nHUDSON'S BAY CO.'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nTown Lots\n\nFor Sale\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Brandon, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms and payments.\n\nFull information in regard to these lands will be given at the office of the Company in Winnipeg and Montreal.\n\nO. J. PHYLLIPS, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884041101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3196, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3491, 2], [3491, 6317, 3], [6317, 13801, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]