[{"id": "603cba56f9f1ecec286989fc93691d18860d2df2", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 12, 1884.\n\nMORNING & EVENING\n\nCivil Engineers and Provincial Land Surveyors.\n\nRev. Colin Parker, pastor.\n\nDOMINION OF CANADA.\n\nGOVERNMENT HOUSE, OTTAWA,\nMonday, the 8th day of September, 1884.\n\nPRESENT:\n\nHis Excellency the Governor General, in Council,\n\nWHEREAS, the Honourable Mr. Justice Macdonald, of the Supreme Court of Canada, has been appointed by Her Majesty the Queen to be Judge of the Court of Queen's Bench for the District of Prince Albert, and has been sworn into office at Ottawa on the 7th instant; and whereas, the said Judge Macdonald has been requested by the Minister of Justice to take charge of the administration of justice in the said District;\n\nNOW, THEREFORE, be it resolved by this Council, that the said Judge Macdonald be and he is hereby requested to take charge of the administration of justice in the said District, and that he be and he is hereby directed to perform all such duties as may be required of him in connection therewith.\n\nTHUS POWERS.\n\nIS PREPARED TO TAKE CONTRACTS\n\nTrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nTENDERS will be received by the undersigned, up to Noon of the 25th of October, for the erection of the following buildings, or any part thereof:\n\n1. Indian Agent's House.\n2. Indian Office.\n3. Store House.\n4. Carpenter's Shop.\n5. Stable.\n6. Other outbuildings.\n\nSecurity will be required for the fulfillment of contract.\n\nThe lowest or any tender not necessarily accepted.\n\nJ. M. R. HAN, Indian Agent.\nBattlesford Oct. 1, 1884.\n\nSheep Lost.\n\nSEVEN SHEEP.\n\nAny person seeing these sheep, or giving information as to their whereabouts, will be rewarded.\n\nTENDERS FOR FLOUR.\n\nSEALED TENDERS will be received, addressed to the undersigned, before noon on the 25th of October, for the supply of flour, in good order and condition, of the following quantities (if offered), to be delivered to the Agent General's Office, Prince Albert, on or before the date hereafter mentioned, at the prices and conditions stated:\n\nAt Battleford, March 1st, 1885, 500 sacks.\nAt Fort Pitt, March 1st, 1885, 1,100 sacks.\nAt Caribou, March 1st, 1885, 500 sacks.\nAt Garrison, December 1st, 1884, 2,000 sacks.\n\nThe tenders must be signed by the owner or his agent, and must state the quantity, price per sack, and the name of the owner or his agent.\n\nTenders stating the price per sack to be made upon samples which may be shown to the Agent General's Office, Prince Albert, and at the Indian Offices at Battleford and Fort Pitt, and at the Garrison Office, Caribou.\n\nThe Agent General reserves the right to reject any tenders.\n\nJ. ANDREWS, Manager.\nIndian Office, Caribou, N.W.T., Oct. 1, 1884.\n\nTHE EXHIBITION.\n\nOn Thursday morning, a full house assembled at the Law Courts to witness the opening of the Exhibition. The exhibition was opened by His Excellency the Governor General, who delivered an address to the assembled crowd. The exhibition was officially opened by His Excellency the Governor General, who delivered an address to the assembled crowd.\n\nTELEGRAFIC.\n\nBy Special Telegraph to The Times.\n\nOTTAWA, Oct. 12th.—Governor Cleveland was assassinated on the morning of the 12th inst. by a man named Samuel Beal, who was arrested by the Capitol Police.\n\nOfficial returns announce a large return of votes for the late election.\n\nThe Hon. Mr. Justice Macdonald, of the Supreme Court of Canada, has been appointed Judge of the Court of Queen's Bench for the District of Prince Albert.\n\nMr. Justice Macdonald has been sworn into office at Ottawa on the 7th instant.\n\nMr. Justice Macdonald has been requested by the Minister of Justice to take charge of the administration of justice in the said District.\n\nNOW, THEREFORE, be it resolved by this Council, that the said Judge Macdonald be and he is hereby requested to take charge of the administration of justice in the said District, and that he be and he is hereby directed to perform all such duties as may be required of him in connection therewith.\n\nCHIT-CHAT LOCALS.\n\nGathered by our reporter.\n\nBritish Guyana has sent a visit to its store.\n\nSub-Agent Agent Marcus was in town yesterday.\n\nMr. Campbell received a large quantity of oil at this week.\n\nThe sky was illuminated by pyrotechnics last evening.\n\nMr. Miller's hall was deserted and no one was playing the fiddle.\n\nG. & E. Carter have just received a lot of hucksters, Tables, Chairs, etc.\n\nMr. McMillan, Hat Portage, a brother-in-law of Middleton, of this place, is here on a visit.\n\nThe Curling Club are having the rink fixed up, and getting ready for the season.\n\nPOLICE NEWS.\n\nJohn Monkman, a prisoner at the Barrack awaiting trial, was released before Hon. L. Clarke, J.P., on Thursday afternoon, having stolen a cow the property of Mr. Smith, of the parish, and was committed for trial.\n\nEliza Daugherty, at present awaiting her trial for horse stealing, took things into her own hands, and, when asked why John Monkman prefers fresh air and work, answered: How else that morning in Carleton, with Cone, Valdast and Col. Col. Irvine, Commissioner of the Police, is expected here next week.\n\nThe new building is now completed and ready for occupation.\n\nThe parties on the top floor have removed, and it now makes a splendid dormitory.\n\nA guard house has been erected, capable of holding six prisoners, and is of substantial build.\n\nCapt. Smith with about twenty men, will be stationed at the new guard house for the quarter. The Capt. will return two days from today, leaving the men in charge of Mr. Smith.\n\nMr. Smith, Capt. Smith, Mr. Ross, and Mr. Smith, have been engaged in the construction and installation of the new building, and it will be completed in a few days.\n\nThe new building will be a credit to the town as well as to the government in charge of the work.\nNOTICE.\n\nWe beg the attention of the public to the fact that our financial year comes to an end upon the last day of this month (31st Oct.) and that in consequence of the same, we have nothing to offer them but what will be found in our usual manner. We therefore request that no one shall settle their accounts with us before the 31st Oct., and that all who have claims against us. Prompt attention to these matters will save us a great deal of trouble and inconvenience.\n\nOUR SITUATION.\n\nIt is to be feared that the farmers of our district are by no means prepared to meet the difficulties which those resources which must result from the almost universal failure of the grain crops this year—for that such failure has happened there can no longer be any doubt. The season will be remembered as one of very natural but not the least unfortunate state of things, by those who from self-interested motives, desire to divert the stream of immigration from our shores, is so well evident; that it becomes impossible to point out to any one, that while circumstances may not unfairly be charged to our settlers, there is not the faintest evidence in this to detract from all that has been claimed for the natural advantages of the climate and soil of our region. We cannot without hesitation that had our farmers exercised a reasonable economy and foresight in the management of their affairs, they would, taking into consideration, have been in a position to lay by a good store of grain at this season, if not with perfect economy, at any rate with out alarm. To make an exhaustive catalogue of all the available errors which have landed us in this situation, again would be useless; we would only say, that we have been in a position to lay by a good store of grain at this season, if not with perfect economy, at any rate with out alarm.\n\nThe following have been appointed Justices of the Peace:—James Anderson, Thomas, Charles, Robert, Ross, John D. Urquhart, John F. Dewar, Samuel Ross, and John P. Clarke, Clark's Crossing.\n\nNEW MILLINERY,\n\nFANCY GOODS,\n\nWOOL GOODS,\n\nLADIES' CLOAKS,\n\nFUR MUFFS,\n\nAND\n\nCAPS,\n\nMISS MACK AND CO,\n\nCAMPBELL'S BLOCK,\n\nPRINCE ALBERT\n\nMining Mills and\n\nSash and Door Factory\n\nNATHANIEL ACORN\n\nPrince Albert,\n\nEAST END BAKERY,\n\nBREAD unsanctioned by any west of Winnipeg.\n\nNINE Loaves for $1\n\nHugh McDougall\n\nEast End Bakery.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\nITEMS OF INTEREST\nTERRITORIAL NEWS.\nTHE VERY LATEST NEWS.\n\nCALGARY\nFrom the North-West.\nWe are pleased to learn that some check is to be placed upon the pernicious Governor Dufferin's infamous habit of borrowing money from anyone to anyone unknown to himself, unless recommended by the commanding officer of the regiment.\n\nMr. Hugh, High River, arrived from the Coal Banks with 1,200 sheep on Tuesday last week.\n\nFrank Smith, who came here in anticipation of the Selkirk, has sold half interest in two of his lands for $5,000.\n\nMr. D. McPhail, Morley, had some sixty acres of land with crops, and was granted a few acres more. An inspection of the land the other day failed to discover any sign of life among the Hungry Indians found on both sides of the river.\n\nHATFIELD\nFrom the World, Oct. 17.\nInspector Antonius has been made Superintendent and stationed at Regina.\n\nMr. Wadsworth, Inspector of Indian Agencies, arrived here yesterday evening, the 16th, on his annual tour of inspection.\n\nThe sum of $130 was subscribed the other day to defray the expense of boiling water for the Indians, who are supplied with part of the town with water.\n\nAt a public meeting on the 9th the project of surveying a half mile wide strip of land along the line of the railway was discussed. The amount of $130 was taken by those present, and a committee appointed to secure the necessary authority. It is expected any one will undertake the erection this fall. If the result of these enquiries is satisfactory, the Provincial Government will be asked to carry out the scheme.\n\nMrs. J. M. Rae returned on the 10th from a visit to her relatives.\n\nMrs. Gardner, wife of G. W. Gardner, of the Indian office, and children, arrived from Mackenzie (River on the 10th) and will settle here.\n\nMrs. Gardner returned from Ontario on the 7th, accompanied by her brother and sister, Mr. and Miss Jackson.\n\nREGINA\nFrom the Leader, Oct. 18.\nHis Honour Lord Governor Dewdney left on Saturday morning to visit the Indian Agencies—i.e., Indian Commissioner—in the South and other north country districts.\n\nThe Rev. Father Larche is at present doing missionary work along the line of the go go district under the charge of Mr. John Barn Dalgliesh, Long Lake, has been appointed a magistrate and a J.P.\n\nThe first annual exhibition of the Assiniboia Agricultural Society, was held here on the 2nd and 3rd inst., and was a most enjoyable affair.\n\nThe Hon. Donald A. Smith has purchased the prize Highland bull at the Highland Society's show in Scotland, and has sent him to Regina. He will be used for breeding for his estate at Silver Heights.\n\nArrangements are being made for proper packing and shipping of grain for our farmers. The province is now ripe for harvest, and the grain of the farms and lands of Chicago will be marketed in our North West, and another staple will be forever dropped from our rapidly decreasing list.\n\nPORT MACQUARIE\nFrom the Courier, Oct. 18.\nThe sale of the police hall began yesterday morning. A big price was realised.\n\nSunday night there were thirteen tons of grain at the Cochran Ranch, and Monday night there were an equal amount of grain. We understand that a portion of the crop on Finster Creek was not saved, but that the remainder of the crop was saved, and will be marketed at a good price.\n\nMonday, Jan. 20, and Tuesday, Jan. 21, will be the last days where grain fails to ripen this year; it was put too late.\n\nMasons: Jar. Goddard and Poveshull joined on June 1st last Saturday and left for the Cochran Ranch on Sunday morning.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressseed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in Advertising in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETY, - PROPS,\nRIVER ST., PRINCE ALBERT, SASK.\n\nPUMPS !! PHOTOGRAPHS !\n\nChas. E. Page.\n\nNEW STUDIO\n\nWILLIAM CROSS,\nOver the law's blacksmith shop.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\n\nCHESTER THOMPSON,\nGeneral Blacksmith,\n\nDecorative Painting & Specialty\n\nRepairing Farm Machinery a Specialty.\nDr. Schultz\nTo Arrive in the City This Evening.\n\nSomething about him. A letter from John Bruce, who figured here during the Rebellion of 1885, has just been received in our office. No detail was said about what was done with the body.\n\nWestern, October 8 - A telegram was received here yesterday by Mr. Wm. McGregor from Dr. Schultz who was in Minneapolis on his way to Winnipeg. The telegram announced that the symbol might be expected at early hour today. Mr. McGregor was born in Western Ontario, and at an early age began attending Victoria College for his medical training. He graduated there, receiving licentiate of M.D., in 1863. He visited the Red River settlement in 1872, shortly after the outbreak then affecting public opinion with the country and its resources, and convinced others that following the profession began in a manner than it had hitherto. He became impressed with the country where he resided, and continued there for many years, finally moving to Winnipeg. His opinions prevailed during the relations of that time, and he supported the movement which led him to live in Canada. He was here for two and a half years, when Wm. Hacking joined him, and they again returned to Europe. He continued, the ensuing ten years, and proved himself very able man, and was elected president of the Club. Upon the death of his wife, he returned to England, and died there in 1890.\n\nG. D. Northgraves,\nWatchmaker and Jeweller,\n\nTENDERS WANTED FOR\nSTOCK AND\nBOOK-DEPARTMENT,\nESTATE OF J. O. DAVIS & CO.\n\nThe Stock amount to about $6,000\nThe Book Depts amounts to about $2,300\n\nTenders in writing will be received by the undersigned up till the first inst. for the above.\nParties making other than a CASH offer will please state security.\n\nPhilip Thomas,\nAgent for Robert Dunn, Trustee.\n\nJames Sinclair,\nMerchant Tailor,\nand Dealer in Gents’ Furnishings.\n\nTHE WEEK, Alger’s Review of Politics and Criticism, edited by Charles S. Dana. Published weekly Thursday, at 13 cents per number. The WEEK is a miscellaneous periodical, containing matters relating to literature, religion, politics, science and social economy, with introductions on current topics, and developments of intellectual, social and political matters in the field, by regular contributors. For sale by all booksellers.\n\nR. J. O'Leary\nProprietor.\n\nTender Articles Required by the West End House.\n\nBankrupt Stocks for IMMEDIATE PAYMENT.\n\nBankrup Stock for CASH\n\nDavis & Co.,\nWholesale Lumber Dealers,\nBankrupt Stock, etc.,\n\nBaking Powder.\nAbsolutely Pure.\n\nBankrup Stock for IMMEDIATE PAYMENT.\n\nBankrup Stock for CASH\n\nDavis & Co.,\nWholesale Lumber Dealers,\nBankrupt Stock, etc.,", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884102401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3919, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5863, 1], [5863, 8479, 2], [8479, 13167, 3], [13167, 15822, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]