[{"id": "3462120bb902ec48187637f29d86472ecc7419bb", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 14, 1885.\n\nBANKINGHOUSE\nof Macarthur & Knowles.\nPrince Albert, N.W.T.\n\nPRINCE ALBERT PHARMACY\nP.L. LAFOND\nDruggist and Chemist.\n\nMACARTHUR & KNOWLES & Co.\nPharmaceuticals promptly and carefully prepared.\nPrescriptions promptly and carefully filled.\nFancy Drugs and Medicines.\nTravellers' General Banking House.\nDeposits accepted by deposit.\nNotes Discounted.\nCredits (personal) available at all points in the Province.\nCollections undertaken and prompt at all times.\nBANKERS—Mercantile Bank of Canada.\n\nWILLIAM V. MACARLIE,\nAdvocate, Attorney, Etc.\n\nNotice is hereby given that the above premises will be sold at public auction on them at William Miller's House, in the Town of Prince Albert, on the 26th day of November, A.D. 1885, at 2 o'clock p.m., or as soon thereafter as the same shall be called for at Prince Albert, this Fifth day of September, 1885.\n\nOWEN E. HUGHES,\nSheriff, Judicial District of Saskatchewan.\n\nNOTICE TO CREDITORS.\n\nNotice is hereby given that James TRENTON, deceased, late of Prince Albert, N.W.T., died intestate, and that creditors having any claims or demands against him are hereby required to present the same to the undersigned, at his residence, Prince Albert, N.W.T., within thirty days from the date hereof, or they will be deemed to have waived their claims.\n\nH. W. NEWLANDS,\nAdvocate, Notary Public.\n\nFor a Full Line of Groceries,\nConfectionery and Fancy Goods\n\nC. R. STOVEL\nDENTIST.\n\nOffice over the Hudson's Bay Co.'s Store.\nPrince Albert, Sask., N.W.T.\n\nJ. LESTOCK REID\nDominion Land Surveyor.\n\nPRINCE ALBERT\nSASK.\n\nA. C. PATTERSON\nFormerly Agent.\n\nAll goods returned to and shipped immediately.\nWill send orders promptly and ship by express.\nSend orders promptly and ship by express.\nOrders filled promptly and shipped by express.\nOrders filled promptly and shipped by express.\n\nROBERT THOMSON,\nSign and Ornamental Painter.\n\nCatsoming and Paperhang-\ning on Short Notice.\n\nDecorative Painting a Specialty.\n\nROYAL MAIL STAGE CO.\nWeekly between Regina Station and Prince Albert, leaving Prince Albert every Tuesday morning at 9 o'clock, and returning the same evening.\n\nLEESON & SCOTT.\n\nMISS AULD\nReceives the ladies of Prince Albert and vicinity that she has opened out in her new establishment at No. 3, J.A. Frazee's large and elegant residence.\n\nMillinery and Fancy Goods.\n\nHaving received the services of a First-class Dress & Mantle Maker.\n\nIn the East she will be able to execute an order promptly and in the latest style.\n\nIMPROVED FARMS.\n\nTOWN LOTS\nwhich will be sold cheap on easy terms.\n\nTHOS. ORAM\nProprietor.\n\nLeading Hotel in Saskatchewan.\nBoard by the day or week.\n\nThe Bar is supplied with the finest Brands of Cognac, Brandy and Old Scotch, famous Still Distilled Whiskey.\n\nEvery attention paid to the travelling public.\n\nWM. SHANNON & CO.\n\nLOCAL NEWS.\n\nThe wholesale and retailing Montserrat and Jamaica Lime Juice Factory for sale at Prince Albert. The owner is willing to sell his stock of goods and fixtures.\n\nNotice is hereby given that the above premises will be sold at public auction on them at William Miller's House, in the Town of Prince Albert, on the 26th day of November, A.D. 1885, at 2 o'clock p.m., or as soon thereafter as the same shall be called for at Prince Albert, this Fifth day of September, 1885.\n\nOWEN E. HUGHES,\nSheriff, Judicial District of Saskatchewan.\n\nTAX SALE\n\nNotice is hereby given that the above premises will be sold at public auction on them at William Miller's House, in the Town of Prince Albert, on the 26th day of November, A.D. 1885, at 2 o'clock p.m., or as soon thereafter as the same shall be called for at Prince Albert, this Fifth day of September, 1885.\n\nOWEN E. HUGHES,\nSheriff, Judicial District of Saskatchewan.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nWigmore's Clearing Sale is still going on.\n\nLearn your subscriptions for the Dominion Illustrated at your Bookseller.\n\nSugar and Confectionery of all kinds received this week. Walters & Baker.\n\nKinnear's Fruit Salt, Warner's Safe Cure, Knight's Apple Cure and Papasan at T. E. Jackson's.\n\nThe Legislative Assembly will meet about the 26th November next.\n\nWigmore's Great Clearing Sale is still going on.\n\nLearn your subscriptions for the Dominion Illustrated at your Bookseller.\n\nBette & Gayne have decided to give public the benefit of one of their Naughty Sales, and are giving immense discounts for cash.\n\nA huge water tank is being built on First street, close to the main fence and near Church street. The tank is for fire purposes only, and will be of great use to people living away from the river.\n\nMr. H. A. Head has closed his photo studio for a few months. He will not be back until after striking the railway, but will be back early in the spring.\n\nSept. 8th, N. and M. Sproul, Hartley and the Diamond Telegraph service, left Troy last week for a tour of inspection along the line, and will be back early in the spring.\n\nD.C. McIlwain & Co. have moved into their new offices. Their doors were open last Friday when they will be pleased to see all their old customers or anyone else desiring anything in the line of hardware.\n\nWe heartily congratulate Sergt. Major Macpherson on his receiving a commis-\nsion as Inspector of Police. Sergt. Major Macpherson, through his own exertions, has been elected to a commission offi-\ncer of police.\n\nA second edition of the Saskatchewan Directory will be ready about the begin-\nning of the new year, and all parties who desire a copy should apply at once.\n\nAddress H. T. McIlwain, Brandon.\n\nThe nominations in East Assiniboia for the representative to the Legislative Par-\nliament took place on Wednesday last.\n\nThe Hon. E. Darragh, chairman of the meeting, nominated Mr. H. W. McLeod, the only candidate nominated and he was therefore declared elected by acclamation.\n\nThe marriage of Mr. H. W. McLeod and Miss Christy Olsen took place at the residence of the bride's mother, in the town of Prince Albert, on Friday last, amidst the assembled of a few friends.\n\nWe wish the young couple long life, happiness and prosperity.\n\nJudge McIntire, wife and family ar-\nrived back in town on Tuesday.\n\nThe Judge and family have been away at a friend's in the east.\n\nMiss Cunningham, of King Street, also, arrived Monday.\n\nMrs. McIntire, also, came back from the Jubilee.\n\nThe ladies of Island Lake settlement will give a harvest dinner dinner Mr. and Mrs. McIntire, on Friday next, the 21st inst., at noon, at the Methodist church.\n\nThe Lake is about to be opened up for a short time.\n\nAfter the dinner dinner of all kinds will be indulged in and there are several large parties of the visitors.\n\nThe C. C. Band will be in attendance.\n\nA good time is guaranteed.\n\nT.T.F. We have now a great deal carry-\ning on in the market. Walters & Baker.\n\nSubscribe for your newspapers at the lowest rates. We have a large stock of all Canadian, American and Foreign Publications at lowest rates.\nThe great American eagle is stirring for game over the fisheries question. The Senate and people of the great American Republic are threatening all sorts of vengeance on unhappy Canada. They have even now dispatched their extra navy men to Canada, following up the fact that Yankee fishermen and poachers are not punished as they deserve in their lackless acts. Our Dominion might tremble for the result were the Yankees to land in force, but as it consists only of one rotten limb which they are pleased to call a flag-staff, the danger is not so great as to cause much alarm. We would call the attention of Senator Frye to the fact that the Fisheries Question is a little like the Panama Canal; there is a little market which might be available in case of an emergency. The person referred to was last heard from at St. Thomas, Ont., and judging from the tone of his remarks we believe he would be most happy to assist Uncle Sam with the above-mentioned market, especially as he has not had the opportunity of using it against Canada for some time. The United States is now passing retaliatory laws. They expect by denying Canada certain commercial facilities to force her into surrendering her valuable fisheries. But the consequences of such a course will suffer as much from pursuing such a course as we will. We are no longer dependent on American roads to do our carrying trade. We have our own shipping lines, steamships, and lines of railway, and can very secretly smile at the pettish actions of Brother Jonathan. The London Times says, editorially, that \"Retaliation will prove enough to make a grip on some necks within Canada, and put a hand against it, and that the British Government will stand by the rights of Canada.\"\n\nThe Hon. Walter Laing, of Saskatchewan market fame, and leader of the Reform party in the Dominion Parliament, has been heard from again. This time in connection with the Fisheries Treaty. Speaking at St. Thomas lately he boldly took the part of the United States as against Canada, and declared that the time had come when there should be closer relations between the two countries, in short that Canada should surrender her rights and her existing prosperity to Uncle Sam. This is the position taken by the Liberal leader, but fortunately he does not voice the sentiments of the Canadian nation. The Reform party, under Mr. Laing, are reputedly by the phrase \"Canadian,\" such topics as the Globe being especially strong in its denunciation of his unpatriotic utterances. It declares that the Conservative Government has been so successful in its administration that the Liberals would have had to do what they have done in power and that the people should support the Government in this crisis, and that the fisheries question will yet have to be settled by an International Commission. The Globe, although it regards the annexationists, also condemns Laing's language, and upholds the Government in a hearty manner.\n\nGabriel Dumont has announced his intention of returning to Saskatchewan this month.\n\nThe Manitoba wheat crop for this year is estimated at 20,000,000 bushels. This will be 8,000,000 bushels in excess of 1887. In Dakota, on the other hand, the crops are a failure, the damage resulting not only from them from frost, but from wind, heat and disease.\n\nSir Chas. Tupper, Canadian High Commissioner in England, has been created a G.C.M.G. His Excellency, the Hon. J. H. Thompson, Canadian Minister of Justice, has received the honor of knighthood, he being created a C.C.M.G. These honors have been conferred by Her Majesty the Queen in recognition of services rendered to Sir Charles and Mr. Thompson as members of the late Fisheries Commission. We congratulate the worth knights on being made the recipients of such high distinctions.\n\nThe Bathfield Herald has its personal Indian scare in a recent number. The only reason given for the panic is the statement that some Indians have been seen about where perhaps they ought not to be, namely, idle white man; and then Bathfield wants more Police. We do not believe there is any necessity for more Police or elsewhere from the Indian, but to allay the fears of the fearful and give a greater feeling of security, we would like to see either more Police in the district or militia organizations.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery.\n\nPublic and High School Text Books.\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK.\n\nALL SIZE—WRITING AND COPPER OFFICE STATIONERY, ETC., ETC.,\nTOWN COUNCIL\n\nThe Town Council held a special meeting on Monday evening last. His Worship Mayor Jane presiding. The councillors present were McPhail, Savory, Agnew, Kowles, Davis, and Johnstone.\n\nA communication was received from Miss Baker, secretary of the Ladies Aid Society in connection with the Presbyte Church. Miss Baker had visited the Town Hall on Oct. 4th. Granted.\n\nLouis Schmidt asked for revision of terms in connection with the Solicitor Isaac (Officer probably). Nothing printed committed and license issued. The application was laid over for further consideration. Carried.\n\nLicenses were granted to the following: cattle dealer, A. Murray & Sons; beef stables: C. Byrne, dray; D. Pollock, horse; F. Murray, sheep; S. Rollins, swine; David Macklin, hairdresser; James McDonald, dry.\n\nThe following a warrant was issued W. H. Fish, St. Jan, Mattaws, St.\n\nREPORTS\n\nThe Finance and Assessment Committee recommended the following at its meeting: Mr. J. McPhail, pres.; Mr. A. Savory, sec.; Messrs. E. Pollock & Edm. Murray, members. Of the Town Books to be sold, Mr. J. Sirag, owner of the books, was not present. Mr. D. Williamson if sold was referred back to the Board of Works for their decision. The Fire, Water and Light Committee submitted the following report: That no new fire hydrant is required near the fire station to satisfy the requirements of the fire department, and that they have located, on the northeast side of First Avenue, near Mr. John McCaggan's residence, Adopted.\n\nA petition was received from Mr. William Dillon & Co., 2nd Ave. Ext. Etobicoke. A warrant was issued granting the privilege of using electricity at the rate of $1 per year for the building occupied by Mr. John McCaggan's residence. Adopted.\n\nMcPhail moved that Constable Agnew be requested to have an examination done at this time of the rugged condition and dirt and other obstructions from the commissioners' feet from the sidewalks and streets, and all property where he could find any other obstruction or trouble, and to advise how to amend the license by law. Carried.\n\nAgnew reminded Mr. Savory nothing had been done about the sidewalks and held that Mr. Savory was not fulfilling his duties. Agnew then moved that Mr. Savory be instructed by the Board of Works, that the Board of Works shall take steps to see that the sidewalks were not obstructed by anyone else. Carried.\n\nRemaining business discussed and Carried.\n\nSYMPOSIUM ON THE HISTORY OF THE NEW YORK STATE UNIVERSITY\n\nSpeakers included Professors Washburn, Dunbar, and others, who discussed various aspects of the history of the University. The event was well attended and drew praise and attention from those present.\n\nAMERICAN SCHOLARSHIP PRIZE\n\nThe American Scholarship Prize, valued at $500, was awarded to Eliza Jones for her outstanding academic performance. The award ceremony took place at the University's main hall with speeches given by distinguished scholars.\n\nENSIONALIST PHILOSOPHY AND THE ENVIRONMENT ACADEMY\n\nA symposium focused on the advancements of environmental studies through the lens of Enolationist philosophy. Panelists explored themes such as sustainability, ethics, and impact assessments, fostering a deeper understanding of the interplay between nature and human actions.\n\nPUBLIC SPEECHES AND DEBATES\n\nPublic speeches and debates attracted a large audience, engaging the community in thoughtful discussions on pressing issues concerning technology, climate change, and social justice.\n\nLIBERAL AND PLAYFUL EXPERIENCE \n\nLiberal and Playful Experience offers a comprehensive guide covering various aspects of life, offering insights into personal growth and societal trends.\n\nTHE ENGLISH LANGUAGE IN CANADA\n\nThe series \"The English Language in Canada\" explores linguistic diversity across provinces and regions, emphasizing the role of English in education, culture, and economy.\n\nNEWSPAPERS OF THE UNIVERSITY OF TORONTO\n\nThis issue delves into the rich legacy of newspapers published by students and faculty at the University of Toronto, tracing their development and importance in academic discourse.\n\nPAIN'S CELERY COMPOUND \n\nFOR THE NERVOUS, THE DEBILITATED, THE AGED,\n\nPRICE AT \n\nJ.M. CAMPBELL'S.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nSurpassing Any Previous Seasons, Both For Richness Design and Quality\n\nEvery Department Is Immense\n\nCall and Examine Our Stock\n\nNo Trouble To Buy Goods.\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL LIMITED\n\nHave a Large Stock of\n\nLUMBER.\n\nFor Sale.\n\nALEX. LOUDOUN\nSec.-Treas.\n\nAGENTS:\n\nP.G. GRAY, Edmonton, Alta.\n\nJ.F.RASER TIMS,\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\n\nNAVAL BATH FRIEDRICH RIVER\n\nTHIS IS WHAT\n\nJohnson's Fluid Beef\n\nCLAIMS TO BE.\n\nPain's Celery Compound\n\nFor The Nervous, The Debilitated, The Aged.\n\nPrice At\n\nJ.M. Campbell's.\n\nFirst Class Goods\n\nMAGNIFICENT STOCK NEW GOODS\n\nExceeding Any Previous Seasons, Both For Richness Design and Quality\n\nEvery Department Is Immense\n\nCall and Examine Our Stock\n\nNo Trouble To Buy Goods\n\nJ.M. Campbell\n\nLUMBER.\n\nMOORE & MACDOWALL LIMITED\nTERRITORIAL NEWS\n\nCALGARY.\n\nFrom the Herald, August 29.\n\nThe fire has given the house after their escape towards Dundas. They have been assisted to escape by some men.\n\nRegina, Aug. 28. Yesterday afternoon, before W. H. Horrigan, Esq., a commissioner of the Dominion Police, August 25, Mr. Donald MacLeod, who was committed to stand his trial at the Superior Court in Calgary in November next, Mr. Donald MacLeod, Crown Attorney, appeared before the court, the prisoner for digging up bones from Mr. MacLeod's domain. Mr. H. Lay, M. P. M. A., appeared for the prisoner. The prisoner gave bail himself in $600 and Messrs. Banman and Martin in $300 each. The prisoner will be sent back into custody and will appear in proper person to answer for his further crimes.\n\nBATTLEFORD.\n\nFrom the Herald, Aug. 25.\n\nJoe, an Indian, a few days ago killed six buffalo out of a herd of seven that he had in stock near Red Deer Forks.\n\nThe proposed Mounted Police campment at Saskatoon, which was to have been formed next week, has been postponed.\n\nMr. Dunmall will carry on the most market on his own account. Mr. Barker having withdrawn from that business.\n\nHarvesting is now general, and the result is everywhere satisfactory, the crops being generally good and healthy. The extremely hot weather of the past month brought on the grain with marvelous rapidity, and there are apparently so many new and promising crops that answers as to the grand result which will close the effort.\n\nMr. Otten has sown about two-thirds of the way up the big hill and wants water at the depth of seven feet. The soil is about three feet below the level of the river. At the foot of the hill he got three feet of water in a four-foot hole.\n\nEDMONTON.\n\nFrom the Bulletin, Aug. 25.\n\nThe present hot weather keeps the river at a high stage. There are all well.\n\nMr. Grant has a splendid crop of barley ready to cut. Also an excellent crop of potatoes.\n\nMrs. Ingles, of Fort Saskatchewan, reported a swarm of bees a couple of weeks ago by express.\n\nMr. Paterson, A. Mitchell, who started for British Yorke last spring, are now in Seattle, Washington Territory.\n\nDouble the usual amount of landing between is required to make up for this season's losses. The rate is so heavy; the twins sell at 22 cents per pound.\n\nAlthough the tomato plants show a vigorous growth, the yield is not bounteous liberally the general experience is that no fruit has formed. The reason has yet to be discovered.\n\nLETHBRIDGE.\n\nFrom the News, August 29.\n\nTenders for the laying of sidewalks and crossings have been advertised by the Council Grant Committee. We hope they will be completed in time for the principal places in town.\n\nOn Saturday afternoon last Horse Man was up before J. Champoux, J. F., charged with absconding with the property of Mrs. White-France, the owner of the horse. On the charge being taken, he was committed for trial.\n\nOn Tuesday last the Hon. Mr. Bowden and party were being driven across the prairie when they were treated to a runaway by way of surprise. The bit of one of the leaders broke and the horse became uncontrollable. They were brought to a standstill before any damage was done.\n\nA large rock slide occurred from Peak Mountain, but the road was kept on Tuesday night about half past nine. Peak Mountain is about a quarter-mile up the Spray River. Mr. E. H. Miller, Hotel, a mile away from the village. Two loaded rocks as large as an ordinary house rolled down a distance of 3,000 feet, ploughing up trees and killing cattle in their course. The noise of the falling rocks aroused the whole town and members of their last hour had come, others thought that a train had run away and there was considerable consternation throughout.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing Now in stock will be sold FOR TWO WEEKS ONLY AT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne.\n\nR. C. W. & CO.\n\nAll parties indebted to R. C. Wigmore & Co. are requested to make an immediate settlement.\n\nInterest charged on all overdue accounts.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERROW\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE.\n\nADVERTISERS can learn the exact cost of any proposed line of Advertising in American Papers by addressing G. E. Rowell & Co., Newspapers Advertising Bureau, 10 King Street, Toronto.\n\nBuffalo Hall!\n\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nFOR THE NOTICE!\n\nBest Assorted Stock of CONFECTIONERY\n\nGO TO\n\nH. M'Dougall's\n\nBAKERY.\n\nCentral Store\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall\n\nGo To\n\nAGNEW'S\n\nFOR\n\nStoves Stoves Heating Drums Stovepipe Coal Oil\n\nT.J. Agnew\n\nGrand Union Livery Stable.\n\nOpposition is the Life of a Horse.\n\nA first-class driver, feed and stable facilities.\n\nWe would like to invite the public when in Prince Albert to give us a call. Our stable is located on the main street, just opposite the Hotel.\n\nWe have a lot of fine horses and rigs—also reasonable terms.\n\nFind good, reliable and accommodating men night and day at our stables. We have a lot of fine horses and rigs—also reasonable terms.\n\nYou can always depend on getting the best service at our stables.\n\nWe do not advertise in newspapers to keep our prices low. We do not deal in a falsehood, but we keep the best Livery Stable stable—and at the lowest prices in town.\n\nDonaldson & Pembroke.\n\nSept. 18th, 1888.\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888091401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 5400, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6986, 1], [6986, 11912, 2], [11912, 16982, 3], [16982, 22628, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]