[{"id": "7ca69f58cfeb936b76b62f8f5dd065685aa3d91b", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MAY 6, 1867.\n$2 50 A YEAR.\n\nBANKING HOUSE OF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nROBT BUCKLEY, TENDERS\nAuctioneer,\nAccountant,\nand\nGeneral Agent\nPRINCE ALBERT.\n\nTHE OLD RELIABLE.\nA LARGE SUPPLY OF THE GOOD OLD\nWEIGHT ROCKS,\nAND SWISS WATCHES.\nPrice Reduced.\nPost Office Jewellery Store\nOpen daily from 9 to 6.\nR. B. WAY\n\nQUEEN'S HOTEL\nLeading Hotel in Saskatchewan.\nPrince Albert, N.W.T.\n\nTHOS. ORAM, PROPRIETOR.\nBoots and Shoes,\nSlippers, all Sizes and Kinds for\nLadies' Gents' and Children's Wear.\nMoccasins, Overshoes and Rubbers\nfor Ladies, Gents and Children.\nMuffs, Gloves, Stockings and Socks\nAll Sizes and Kinds.\n\nROYAL MAIL STAGE\nWeekly\nBetween Prince Albert and Prince Albert.\nLeaves Prince Albert at 10 o'clock.\nReturns at 4 o'clock.\nPassengers accommodated at reasonable rates.\n\nLESON & SCOTT\n\nJ. D. HANNAFIN,\nCommission Agent and Collector\nOffice — First Street\n\nFURNITURE!\nCheaper than ever.\nFor the next thirty days I will sell all\nmy goods at 30 per cent less than\nusual prices.\n\nGILBERTE CARTER\n\nWILLIAM KNOX,\nCarpenter, Etc.\nOffice and Workshop.\n\nBLACKSMITHING\nIsaiah McColl has opened up\na new blacksmithing shop on the\ncorner of Main and River Streets.\nWhere he is prepared to do any\nkind of blacksmithing in first-class style and at\nmoderate rates.\n\nISAIAH MCCOLL,\nGeneral Blacksmiths,\nChurch Street\n\nTenders will be received by the undersigned for the following\nspecification of goods:\n1. Four-wheeled Hook and Ladder Truck.\n2. Ladders, including:\n   1 Scaling Ladder 14 feet long,\n   1 Scaling Ladder 16 feet long,\n   1 Scaling Ladder 18 feet long.\n3. Two 10-gallon Iron Buckets.\n4. Hooks, with ring rope.\n5. Ladders, 12 ft.\n6. Five Poles.\nSpecifications may be sent to J. Agnew's store on and after May 1st, this year.\n\nHEIGH U. RAINE,\nChairman Board of Works.\n\nNOTICE\nAll parties interested in the undersigned\nare hereby notified that the said premises\nwill be sold at public auction on the 1st day\nof June, 1867, at 12 o'clock noon, and\nwill be let on an annual basis, subject to\nthe approval of the Board of Works.\n\nISAIAH MCCOLL.\n\nSTRAVED\nFrom my premises at the Ridge, about\nthree miles from here.\nThree Mares\nOne a light seed, with white face, grey tail\nand legs, and dark mane; the other two\ndark mares, one heavy, the other lighter,\nboth good riders.\nWill bring in same or giving\ninformation that will send to owner recovery\nwill be suitable for saddle or riding.\nTHOMAS SCOTT,\nThe Ridge.\n\nREMOVAL!\nR. T. Goodfellow wishes to inform\nthe residents of the town that he\nhas removed his business premises\nto the new store on the corner of\nRiver and McKay Streets.\n\nNEW STORE\nCorner River and McKay Streets.\n\nSHANNON & McLEOD\nNOTICE.\nClearing Sale\nFor the next two months of my\nWoolen Goods, Scarfs, Hoods,\nMitts, etc.\nGreat Bargains in Hats,\nprices lower than ever.\nTerms strictly cash.\n\nMRS. J. A. FRASER'S,\nCampbell's Block\nInterest charged on all accounts over one\nmonth old.\n\nCITY CONFECTIONERY\nJUST RECEIVED A FINE LOT OF\nChoice Candies, Biscuits, Nuts\nTeas, Sugars and Oysters,\nALSO A FIVE LOT OF\nMANILLA AND DOMESTIC\nCIGARS.\n\nR. T. GOODFELLOW,\nFOR SALE,\nAnd kept on hand,\nFlour, Wheat, Oats and Barley,\nBran and Shorts.\nHighest Cash Price Paid for Grain.\nSCRIP BOUGHT AND SOLD.\nWM. TAIT,\nAt The Black, River Street\n\nGRAND UNION LIVERY STABLE,\nGrand Union Livery Stable,\nGrand Union Livery Stable,\nGrand Union Livery Stable,\n\nCHIT-CHAT LOCALS.\nGathered by our Reporters\n\nBeautiful weather.\nFour-clap kid gloves only $1.00.\nDavis & Davis have two yoke of\nworking oxen for sale.\nThe H. R. Co. intend opening a branch\nstore in Taft's Block in a few days.\nTenders are advertised for another\nbuilding lot near the fire brigade.\nActive building operations have been\ncommenced on the new schoolhouse for\nthe Catholic Church.\nThe detachment of Police which was\nstationed at Touchwood arrived in Prince\nAlbert on Monday last.\nLouis, Lewis, Louis and Louis\nand Solitude have been elected trustees\nfor Prince Albert Catholic School District\nNo. 6.\nThe rain of last week was just what\nwas needed, and is doing a great deal of\ngood. Farmers are now hopeful of reg-\nular crops.\nChief Factor Bellanger arrived by\nthe last mail from Winnipeg, and is the\nson of the Hon. Lawrence Clarke. He\nwill start down the river to Cumberland\nnext week.\nWm. Davis has returned to Prince\nAlbert.\nJudge Webster, Mr. Clarke, Joe Levy,\nand others of the crew of the Northwest\nand Marquis arrived on Tuesday night\nfrom Edmonton.\nThe Marquis and Commodore Steals\nthe Northwest during the season.\nThe mail arrived on Monday last,\nopened at the post office by bringing\nChief Factor Bellanger, of Cumberland,\nMr. Johnston of the Appalachee, and a son\nof the Hon. Lawrence Clarke, the execu-\ntive architect in charge of the new\nPolice barracks.\nMr. and Mrs. Montgomery are ex-\npected to arrive here from the east on\nthe 16th.\nWe are pleased to learn that they\nwill pay a visit to Miss Lady\nBalfour at the West End reception\nheld in the Senate Chamber on the 16th.\nAt a meeting of the Municipal Com-\nmittee held on Tuesday last, it was de-\ncided to build a hospital, the work to\nbe commenced as soon as possible.\nThe Town Council will be assessed\n$1,000.\nA committee was appointed to con-\nsider the question of the different\nsegments who were on active service\nduring the late rebellion, asking for com-\npensation for their services.\nA meeting of the Prince Albert Lacrosse\nClub took place last Friday evening.\nMr. Johnston was elected President.\nThe accounts were presented by Mr. Speight,\na balance to the credit of the club of $3.50.\nD. Northgrace was elected Vice-\nPresident, Mr. Johnston, Secretary.\nA. B. Speight, H.\nStafford, and A. Agnew were appointed\nmembers of the committee.\nThe entrance for was placed at $1.\nA meeting of the club will take place this\nevening.\nUnder a sign of $10,000 will hang a nobly\nborne sword of $10.\nA meeting of the Directors of the\nLodge Agricola No. 12 will take\nplace on the 1st Tuesday in May (26th),\nat the Queen Hotel, at 2 p.m.\nThe attention of the Directors is directed\nto the fact that in the last two years,\nago, it follows, \"That each director\nbe requested to convey their respective\nviews regarding the question of the\nvalue of the present charter, upon\nthe mind of each farmer the great benefit\nto be derived from supporting such a\ncharter.\"\nIt is further stated that the attention of\nthe officers who are connected with the\ncharter of the lodge was directed to the fact\nthat the officers of the society were put\nto a great amount of trouble in getting\nstanding orders approved by the quarterly\nmeeting, and that certain matters which\nwere discussed and which were approved\nby the Society and which had been laid\nbefore the members for consideration.\nThe Secretary or any of the Directors will\nbe pleased to receive subscriptions for\nmembership.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVETY\nPRINCE ALBERT, N.W.T.\nTUESDAY, MAY 6, 1887.\n\nIn no case will you be concerned in any adventure which involves risk or expense.\nAdvertisements without instructions will not be inserted until further notice.\nAll letters to be addressed to the Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Albert's Church—Morning Service—9 a.m., Rev. Canon Flett.\nSt. John's Church—Morning Service—10 a.m., Rev. Canon Flett.\nSt. Andrew's Church—Morning Service—10 a.m., Rev. Canon Flett.\n\nGENERAL NEWS.\n\nMr. Macdonald has arrived back from Scotland, and has commenced his Parliamentary duties. While we were sorry that he should have been absent from the House so long, it may be stated that no major matters have come up of special interest to the Northwest. He is, therefore, in a position to do as much for Saskatchewan as if he had not been absent, and we are sure he will make himself heard as \"speaking voice,\" and use every other means in his power to further the interests of his constituents.\n\nTHE FISHERY DIFFICULTY\n\nSpeaking of the fishery difficulty the Montcalm Star says—\n\n\"The cable telegram leads to the conclusion that some progress is being made towards a settlement of the fishery difficulty with the United States. The treaty that Lord Salisbury is now engaged in settling the details on the conditions of the Treaty of Washington minus the pecuniary indemnity should be taken with many grains of allowance. The privilege of fishing in Canadian waters was intended to Canada by that treaty is worth little or nothing to Canadians, so that the only advantage that the Dominion would get under the reported terms would be the return for giving the Americans facilities for obtaining supplies and transhipment of fish. It is evident that the sale of Canadian caught fish into the United States market. This looks to us like a very one sided arrangement, nearly all the advantage being on the side of the United States. Under such an arrangement the speedy exhaustion of the inshore fisheries of Canada would be a matter of certainty. Independently of the extra drain on those fisheries which exporters there would put upon them, the American methods of fishing are very wasteful and it would be found exceedingly difficult to compel United States fishermen to conform to Canadian laws and regulations.\"\n\n\"It is well to see that the eyes of reflecting Americans are being opened to the injury which non-intercourse with Canada would inflict upon the commerce of the country. Secretary Blaine expects that to carry out the threat of Congress would not be quite so pleasant a way of punishing Canadians for the crime of protecting their own property as the present method. Members of Congress seem to think, in fact, that it would bear a very close resemblance to that very unpardonable operation of cutting off your nose to spite your face. He said that the threat of the government will bear repetition. \"It is doubtful,\" he said, \"if the interests of San Francisco in maintaining her present coal supply from British Columbia, and adding the important trade with the United States, has been connected with Canada and the vast trade that flows across our northern boundary do not exceed the interests of Massachusetts in the matter of the application of reciprocity as an alternative to commercial non-intercourse.\"\n\nReferring to Lord Salisbury's proposition the Globe assumes a somewhat whimsical tone, and main points are that the proposal to surrender to the Washington Government of an immensely valuable property belonging to Canada, and the surrender of every main content of the fisheries upheld by the Canadian Government cannot consent to it without stifling themselves and incurring universal condemnation. But the strange feature in that journal is the fact that they now hold that the only way to overcome the difficulty is by \"unrestricted reciprocity\" while at the same time it objects to our fisheries being thrown open to Americans on similar terms. When Canada received five million dollars from the U.S. for the right to fish in Canadian waters by the treaty of 1818, it was not enough. During the last American war, blighted by the government for not having made a treaty treaty with the U.S., now it advocates unrestricted reciprocity while it opposes the \"surrender to the Washington Government of a valuable property and the surrender of every main content of the fisheries upheld by the Canadian people.\" It is hard to tell what the Globe wants.\n\nEDITORIAL NOTES.\n\nThe estimated cost of this year's destruction of salmon is $15,000, in addition to the almost total failure of the season's run expected.\n\nSir John Lister Kaye is full of big philanthropic schemes for the advancement of the fishery industry. He is engaged in his farming operations in the Northwest but he says he will have a New Year's resolution to make good the loss he has found feasible from actual experiment at Belgrave, on the Canadian Pacific Railway, where he has a farm of 3,000 acres. He found it cost about $300 to start a homestead. A man working on his own account could earn $200 a year. If he is honest, will have $300 more. My idea is that the Government send to us 200 trustworthy farmers, paying them $200 each and give them $200 per year for 40 days per year for keep. I find them hardworking men, and while they are working for themselves they have knowledge of the surrounding lands. At the end of the year, if they conduct themselves properly, they shall be given the company's employment, and they can take up land in the neighborhood of their work. They are hardworking people. In other words Sir John Lister Kaye, in his goodness of heart, is preparing to give away $200,000 to the farmers who fail at an expense of over $50,000 a year to the people of Canada. Sir John Lister Kaye is a good friend to the people of Canada.\n\nD. H. Macdonald, M.P., has arrived in Ottawa from Scotland.\n\nThe Dominion railways in the Provinces of Manitoba and the Territories have been granted three million acres during the past year, and when forty miles of railway are completed the same may be certified to by the Government engineer 250,000 acres will be added to the Dominion.\n\nThe Scrip Commission will visit points hereafter named in June. We understand this summer, six hundred and two of the certificates issued by Canada were rejected by the Indians, and that they must withdraw from their hands; 267 to legal representatives of deceased Metis, and 335 to Metis who are living in the Northwest eligible to rank as half breeds within the meaning of the act.\n\nGENERAL NEWS.\n\nBuilding Hardware, Carpenters' Tools, Ammunition, Garden Tools, Union Churns, Dash Churns, Milk Pails, Butter Moulds, Cow Bells, Horse Bells, Buggy Shafts, Spokes, Hubs and Fellows.\n\nThe Cheapest House in Town is T. J. AGNEW'S.\n\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black Ink, ALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nA.C. PATTERSON, Forwarding Agent.\n\nADVERTISERS Can learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Agents, Toronto.\n\nCHAS. WOODMAN PROPRIETOR\n\nG. D. NORTHGRAVES Watchmaker and Jeweller, AT N. Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nVICKS\n\nFRIDAY, MAY 6, 1887.\nTERRITORIAL NEWS\n\nEDMONTON\n\nFrom the Edmonton April 16th.\n\nImprovements being made in the vicinity of the Methodist Church.\n\nA Roman Catholic Mission is being erected on Stoney Plain.\n\nPoveshell's gang are now that more frequently will be seen thirty-five miles away before in this district.\n\nC. H. Conner, hunter, reported to have met a man who spoke English very well in this district.\n\nF. Prentiss' gang of Indians left this place last week, having been invited by Mr. Conner to go into partnership with G. A. Watson.\n\nNOTICE\n\nThe Prince Albert Times\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY,\nPublisher and Proprietor.\n\nBATTLEFORD.\n\nFrom the Herald of April 16th.\n\nBuilding operations have begun; several stores already raised.\n\nThe price paid by the Indian Department for provisions bought here from Edmonton is a dollar and a half a bushel.\n\nA lodge of the Independent Order of Good Templars was organized in the Presbyterian Church last Friday evening with twenty members. It will be known as Pioneer Lodge, No. 30.\n\nTwenty-one vessels were lost on the coast of British Columbia during the past year, with a total loss to shippers of $60,000.\n\nH. M. S. Compagnie arrived at Edmonton, B. C., on the 25th. The Triumph Flagship and Cormorant are already there.\n\nMrs. Isaiah Daugherty and Christina McKeay, a neighbour's daughter, of Calais, came over on the 25th. The following passage is worth recording:\n\nA man named Evans, from London, was seen with a $1 on Wallington Street, Edmonton, last week.\n\nA pincushion under pretence of sampling him, relieved him of his pocketbook and money.\n\nMajor General Strange is in Ottawa on business with the Government in connection with the Northwest territory.\n\nThe Legislative Assembly was prorogued on the 28th.\n\nA special from Ottawa to Victoria, B. C., states that the Chinese restriction bill allows certificates entirely, and that the Chinese must pay a $5 tax each time he enters Canada. This is virtually prohibitory to Chinese legislation.\n\nR. T. G. fell off the steamer Bella near Cape Lago, Vancouver Island, on the 28th, and was drowned.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS, BROWN'S BRICK STORE.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRARD SEASON 1887\n\nPOSCORRON\n\nA Black French Canadian, will stand four days.\n\nTuesday, Wednesday, Thursdays and Fridays.\n\nTHOS. SCOTT'S STABLES,\n\nAt the Bridge.\n\nSeason opens April 27th and ends July 25th.\n\nMares Pastured FREE of charge.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL\n\nThe Council met in the Council Chamber on Monday evening last.\n\nPresent—Mayor Macdonald, and Councillors Agnew, Bain, Braden and Stewart.\n\nThe minutes of the last meeting were read and adopted.\n\nCOMMUNICATIONS\n\nwere received from Mr. Clark, with reference to a deputation from the Lorne Agricultural Society; from W. R. Grant, with reference to the closing of the trail northward, and taking some steps to have the trail re-opened; and from Chester Thompson, having now to place about two miles on the street. An account was received from the Northwest Government for $155 for the Ordinance.\n\nBY-LAWS.\n\nCom. Stewart introduced a by-law to establish a police force. Com. Bain moved that a by-law to regulate the licensing of livery stables, hotels, saloons, restaurants, and places of public resort also be by law to license water carriers, dry goods dealers, etc.\n\nDEPUTATION.\n\nAt this stage of the proceedings the Council was addressed by Messrs. Preston, Craig and Clark, the deputation from the Lorne Ag. Society, asking a grant in aid of the Society to enable them to erect a grandstand and permanent buildings, so that in future buildings erection next year will be available without delay.\n\nOn motion of Com. Braden, the matter was referred to the Finance Committee to report at next meeting.\n\nREPORTS.\n\nCom. Bain reported to the Board of Works, reported recommending that the petition of Chester Thompson be granted.\n\nOn motion of Com. Braden and Agnew the report was amended by inserting: \"For this season, in the event of no complaints being made against the use of Clark street.\"\n\nOn motion of Com. Stewart and Bain the recommendation of W. R. Grant was referred to the Town Solicitor to report to the Chairman of Public Works and that he may take action upon the advice of the former.\n\nThe accounts of the Northwest Government for $12,500, due to the P. A. G. Band were ordered to be paid.\n\nBRAIDWOOD.\n\nMoved by Com. Agnew, seconded by Com. Braden, that the Board of Works be instructed to correspond our members at Ottawa to stand firmly by the Manitoba members on the question of disallowance.\n\nOn motion of Coms. Stewart and Braden, the Clerk was instructed to correspond with Mr. H. Macdonald, Esq., the Minister of Public Works to purchase a steam engine to protect the Government buildings in this town.\n\nCARLTON.\n\nThe matter of a drainage channel was next considered when the following resolution by Coms. Bain and Agnew was passed: \"That Coms. Stewart and Braden be a Committee to see what a main drainage channel of about two acres can be located for, and to report next meeting.\"\n\nCom. Stewart then moved, seconded by Com. Agnew, that the Clerk instruct the Street Inspector that no more matter be put on Main street until that the drainage and other nuisance be put on King street, south of Fourth street, beginning on the south side of the slope to be dealt with.\n\nNOTICE.\n\nCom. Agnew gave notice that he would introduce a by-law to amend By-Law No. 18.\n\nMoved by Com. Bain, seconded by Com. Stewart, that the captain of the fire department be asked to submit a list of appliances necessary for the Fire Department, and give specifications of the same, and that a committee be appointed to consider the same. Coms. Agnew, Stewart and Braden to meet with the officers of the said Fire Department to consider the same, and report their objection to the by-law, and just as soon as this committee meet to authorize the Chairman of the Board of Works to act according to the same.\n\nThe by-law for dividing the town into wards, and by-law to amend By-law No. 9 were read at this time.\n\nThe Council then adjourned itself into a Committee of the Whole to consider the By-law to amend By-law No. 9, Coms. Stewart and Bain.\n\nThe by-law was read and considered, and on motion the Committee rose and the chairman reported.\n\nThe by-law was read a third time, and on motion of Coms. Cranmer and Bain was ordered to be signed, sealed and numbered.\n\nThe Council then adjourned to meet Monday next at 7:30 p.m.\n\nMEN AT OTTAWA.\n\n(From the Winnipeg Jap.)\n\nOTTAWA, April 20.\n\nThe House had been down to work yet, but the real business of the House will double themselves in a few days. The Government, confident in its strength, not to mention its ability, effects to get its support into the hands, while the Opposition, on the other hand, has only a couple of noses, and having grown up in the old defensive style, is marshalling its forces as for a fierce fight as the halls of Parliament over ever.\n\nThe Liberal contingent, when the address the other day was apparently only the customary handshaking which the party periodically indulges in, is preliminary to pounding the eternal stumps off their antagonists; and although that ceremony was a pleasant recreation, the most important political contest commences then the hair will fly.\n\nThe Black Rods are likely to be in a fine form, and the diamond will result of the recent elections being still keenly felt by him. He visits the House in his usual jaunty manner, and with his head bowed on his arms, which rest on his desk. Sir Richard looks grim and serious, while Mr. Laurier smart and effeminate as usual, Trow and Landecker wear their ordinary every day dress, but the others don't show any particular anxiety or express they would, just before the elections.\n\nMills and Edgar, Cook, Wilson, Casey and Jones are all there, and their faces are a noticeable darkened look about them. Yet, they see, they build up hopes larger than life, and expect to receive from the Boilers, and their hopes, notwithstanding their efforts to keep up appearances, are as thin as a leaf like the orange crop of Manicota to form a Minnesota blizzard. The Boiler, as a team, have nothing to do but to wait for their old chiefman. While anxious at the Government's attitude, the Rioters, however, are rather encouraged by the very trip which they through their Province where the Metis leader seems to be unfazed, they seem to believe that the old chiefman will be their professionally new found friends. They fully appreiate the motives of the Grits and feel that they will be able to rely on them, and that they haven't any confidence in them. And so—to the utter disgust of the Blaketites, who are convinced that the Liberal power disappears from view—the Boilers return to the fold, leaving only the gallant Amy to \"guard the fort\" in protestation of 400,000 votes, the left. Clinton, it is also understood, is still undecided with an inclination to join the Government, which fully counted upon him. There is consequently not an encouraging outlook for the Liberals, and so, hanging under defeat, the members prefer to rent their splendid disappointments on the shoulders of the Boilers, who are for their being kept out in the cold shades. Their debating power, weakened by the spirit of the lyric of the Canadian bard, has been silenced by Jones, the tear-down flag-man from Halifax, who certainly has a good deal to say.\n\nAcross the ditch, the chiefman occupies his old seat and looks just as jovial and cheerful as happy chirpy birds in the springtime. His hearty laugh, Sir Charles Tucker, who as yet has not taken any part in the battle, is heard by the Boilers, who are still bright with a kind of curious anticipation of the keen pleasure he will enjoy when the ungodly deluge he will take in carrying the war into Africa. Sir Charles Tucker has always been the belief that he'll be better prepared to carry the war with the enemy than ever before.\n\nOf the western contingent Dartin is still in the same position, and though his voice in the House, the others content themselves with getting their work in the Ministers and the Opposition by constant interjection. This keeps them pretty busy, and as Mr. Scarth toddles along with his pockets bulging out with daily correspondence, he whispers to me confidentially that there isn't such a terrible lot of fun in being a member after all.\n\nThe Boilers have been hard at work this week. It takes me a couple of hours each day just acknowledging them, and I guess I won't have much leisure this year. But, ding-dong, if I don't believe I'll have to have two if the latter half of spring is like this. Thus they work hard, and their customers come, and as busy as a nailer keeping up his correspondence, while A. V. and Mr. Royce have been hard at get through with their work with astonishing rapidity. We don't see much of Hon. Wat, who seems to be shielding himself in the Liberal contingent which comes from the far west, between Lake Superior and the Pacific Ocean. What have helped yet, and there are hopes that such an unanimity will be shown in their votes that his duties as Liberal whip will be very light.\n\nG. H. H.\n\nDress Goods, all shades\nIrish Diaper Linen,\nIndia Linen, Muslins,\nNuns' Veiling,\nSilk Gloves, Cottons,\nGinghams, Prints,\nWincies, Ladies Jerseys\nBoys' Jersey Suits,\nReady-made Clothing,\n\nFROM FOUR YEARS UP—at\nR. C. WIGMORE & CO'S.\n1879.\n\nBuffalo Hall!\nNEW SPRING GOODS\nWILL ARRIVE NEXT WEEK.\nALL GOODS NOW IN STOCK REDUCED.\nClearing Sale will continue until New Goods\nARE OPENED\nBETTS & GWYNNE.\nESTABLISHED 1879.\nBuilding Hardware,\nHouse Furnishing hardware\nCarpenters's Tools,\nPaints and Oils,\nBarbed Fencing Wire,\nStoves and Tinware.\nALSO A FRESH STOCK OF\nGroceries, Teas,\nTobaccos, Etc.\nCALL AND GET PRICES.\nJ. R. McPhail.\nTHE WEST END STORE\nJUST ARRIVED,\nNEW GOODS\nAT\nCHAS. MAIR'S WEST END STORE,\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestries, Carpets, Crimson Reppa, Window Curtains in Blue and Yellow.\nDoor Mat, Cretonnes, Silk Corded Cloakings, Empire Club in Black and Garnet.\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beere Veiling, Ladies' Silk Ties, Pinsel, etc., etc.\nALL AT LOW PRICES.\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds inspection is solicited.\n\nAT FISH'S.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887050601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6828, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6878, 1], [6878, 14313, 2], [14313, 17710, 3], [17710, 27687, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]