[{"id": "acd6e54871d7f6d1e50f5a3a42fb8bfcd49a39b1", "text": "Notice to Creditors.\n\nThe goods of William Denison, deceased.\n\nNotice is hereby given that all creditors and others having claims against William Denison, late of Prince Albert Settlement, in the Provincial District of Saskatchewan, deceased, who died on about the tenth day of November, A.D. 1884, at Prince Albert Settlement, are respectfully invited to make known their claims by giving notice thereof to Joseph McCafferty, Esq., Prince Albert P.O., Saskatchewan N.W.T., solicitor of the undersigned and administrator of the estate, and to apply to him in writing at any time during the tenth day of January, A.D. 1885, or the continuance thereof, for an account of the estate, together with details of the proceedings therein and of the matters purchased and bequested thereof, and that the said administrator will not be liable for said assets or any portion thereof unless claim entirely received and acknowledged by such claimants before said date against whom claims notice shall have been recorded.\n\nG. DENNISON,\nAdministrator above named.\nDated at Prince Albert, Dec. 9th, 1884.\n\nNotice to Creditors.\n\nNotice is hereby given that the Reverend Sisters — Faithful Companions of Jesus — of the North West Territorties will meet at the Cathedral of Christ the King, next Session thereof, for an act of incorporation.\n\nROYAL A. GUDMUNDE,\nRegistrar-General,\nSaskatchewan.\n\nPublic Notice.\n\nAll parties are hereby notified that the Commissioner of Crown Lands has appointed Lieutenant-Colonel F. M. Hill, Deputy Surveyor Provincial to the North District, Surveyor Provincial of the North District, and Inspector of the second District, Provincial Land Survey Office, for the purpose of conducting a census of land owned privately or held in trust within the province of Saskatchewan.\n\nNotice.\n\nNotice is hereby given that an examination will take place on December 13, 1884, at Regina, Ontario, Canada, under Section 31 of the Saskatchewan Act.\n\nNotice to Creditors.\n\nNotice is hereby given that all creditors and others having claims against the estate of John Flatt, late of Prince Albert Settlement, are respectfully invited to make known their claims by giving notice thereof to Joseph McCafferty, Esq., Prince Albert P.O., Saskatchewan N.W.T., solicitor of the undersigned and administrator of the estate, and to apply to him in writing at any time during the tenth day of January next, for an account of the estate, together with details of the proceedings therein and of the matters purchased and bequested thereof, and that the said administrator will not be liable for said assets or any portion thereof unless claim entirely received and acknowledged by such claimants before said date against whom claims notice shall have been recorded.\n\nJ. McCafferty.\nAdministrator above named.\nDated at Prince Albert, Dec. 9th, 1884.\n\nNotice.\n\nNotice is hereby given that the Reverend Sisters — Faithful Companions of Jesus — of the North West Territorties will meet at the Cathedral of Christ the King, next Session thereof, for an act of incorporation.\n\nROYAL A. GUDMUNDE,\nRegistrar-General,\nSaskatchewan.\n\nPublic Notice.\n\nAll parties are hereby notified that the Commissioner of Crown Lands has appointed Lieutenant-Colonel F. M. Hill, Deputy Surveyor Provincial to the North District, and Inspector of the second District, Provincial Land Survey Office, for the purpose of conducting a census of land owned privately or held in trust within the province of Saskatchewan.\n\nNotice.\n\nNotice is hereby given that an examination will take place on December 13, 1884, at Regina, Ontario, Canada, under Section 31 of the Saskatchewan Act.\n\nNotice.\n\nNotice is hereby given that all creditors and others having claims against the estate of John Flatt, late of Prince Albert Settlement, are respectfully invited to make known their claims by giving notice thereof to Joseph McCafferty, Esq., Prince Albert P.O., Saskatchewan N.W.T., solicitor of the undersigned and administrator of the estate, and to apply in writing at any time during the tenth day of January next, for an account of the estate, together with details of the proceedings therein and of the matters purchased and bequested thereof, and that the said administrator will not be liable for said assets or any portion thereof unless claim entirely received and acknowledged by such claimants before said date against whom claims notice shall have been recorded.\n\nJ. McCafferty.\nAdministrator above named.\nDated at Prince Albert, Dec. 9th, 1884.\n\nNotice to Creditors.\n\nNotice is hereby given that all creditors and others having claims against the estate of John Flatt, late of Prince Albert Settlement, are respectfully invited to make known their claims by giving notice thereof to Joseph McCafferty, Esq., Prince Albert P.O., Saskatchewan N.W.T., solicitor of the undersigned and administrator of the estate, and to apply in writing at any time during the tenth day of January next, for an account of the estate, together with details of the proceedings therein and of the matters purchased and bequested thereof, and that the said administrator will not be liable for said assets or any portion thereof unless claim entirely received and acknowledged by such claimants before said date against whom claims notice shall have been recorded.\n\nJ. McCafferty.\nAdministrator above named.\nDated at Prince Albert, Dec. 9th, 1884.\nCORRESPONDENCE\n\nWe have been informed by Mr. Smith, of Toronto, that he has received a letter from Mr. Johnson, of Buffalo Hall, informing him that Mr. Johnson has been appointed to the position of Superintendent of the new school at Buffalo Hall.\n\nA CURLING DINNER.\n\nThe table is all alive with hot animal food. A stream of pure distilled perfume runs down the center of the table, causing the guests to feel refreshed and invigorated. The food takes all its name and most of its nature from beef and greens. The one exception, however, is the beef, which is cooked in a special manner. The beef consists entirely of lean fat rather than of lean meat. It may be eaten as it is or may be mixed with other ingredients to make a delicious sauce.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nCOAL OIL.\n\nAmerican Coal Oil.\n\nFOR ECONOMY AND LIGHT\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nCOAL OIL.\n\nAT BUFFALO HALL\n\nT. O. DAVIS\n\nJUST ARRIVED\n\nBy latest carts from Troy, a complete assortment of Dry-Goods, Groceries, Crockery, Gents' and Ladies Furnishings, Moccasins, Overshoes, Gloves, Mitts, Fur Caps, and Fur Coats.\n\nAlso a very handsome selection of Xmas and New Year Cards.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and the United States promptly attended to.\n\nPrince Albert - N.W.T\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE Victor Well Boring & Rock Drilling Machinery.\n\nWe make it and are prepared to demonstrate the fact. The WELL MERIT SURFACE, which has shown our efforts during the past fifteen years, and with EXCELLENT RESULTS, is now being used in ALL of every county in the State. The Machinery is operated by either Man, Horse or Steam and works very rapidly. They range in size from:\n\n3 Inch to 42 Feet in Diameter\n\nand will bore and drill ANY REQUIRED DEPTH. They will bore economically and efficiently, and are used extensively throughout the State. They are fitted with a special type of bit, which is designed to cut rock quickly. They are also fitted with a simple but effective system of drilling fluid, which keeps the bit cool and prevents the formation of mud. They are powered by either steam or electric motor.\n\nProspecting for Coal, Gold, Silver, Coal Oil and all kinds of Minerals.\n\nAnd for making Artesian Wells and Coal Shafts, they are unsurpassed. We have furnished Engineers, Rollers, Wood and Steel Pipes, Battery Horse Power, Brush Motor, Electric Motor, etc., to every part of the State.\n\nGood Advice Agents wanted in every County in the World.\n\nAddress: VICTOR WELL AUGER & MACHINE CO., 511 First Street, ST. LOUIS, MISSOURI, U.S.A.\nCHRISTMAS.\n\nFather Time has let us onward\nThrough endless years, and now\nThrough the eternal gates we hasten swiftly\nDark and gloomy sees our way!\nWhat has swept our dreams destroyed?\nWhat has brought our hopes to fall\ngather thieves, with eager faces\nWith hearts full of cheerless cheer?\n\nWe have seen that picture often,\nIn the days of long ago,\nGone are the visions, the pictures\nOnly childish hearts can know!\nRemorse now, we see, returns,\nStill in our souls we feel remains,\nOft, ever fresh, its beauty still\nStill, though the world may change!\n\nWhat is this which so endures thus,\nChristmas, all over the land?\nWhat is this which has survived since\nHeart's heart, and hand to hand?\n\nWhy has Age not dimmed thy beauty?\nPray, tell me, O Christmas tree!\n'Twas a Master-hand that drew me\nElegantly twisted years ago.\n\nDISTRICT SCHOOLS.\n\nWe recently devoted some of our space to the matter of education, and in conclusion of the importance of the subject we felt that we could make a better case for the establishment of district schools by the fresh aspect given to the matter of district schools by the recent announcement of the government of the unfortunate fact that the funds at his disposal for aiding them by paying under certain conditions a portion of the cost, salaried teachers had become exhausted. No excuse can be made against the late Hon. Mr. for having been unable to carry out the Territorial school—a condition which probably he regrets as much as anyone else. We have no doubt whatever that such a proposal should have been held out by the framers of the present legislation, and that the amount have possessed a sufficient argument in favor of the scheme of the public finances present and prospective, to show that the matter had not been considered sufficiently to prove to be a sure and a definite success. We qualify our expression of regret by saying that the matter of establishing district schools is of such immense importance that even should some difficulties exist in the present instance, in consequence of this disappointment, yet the attention and energies of the people of the province will be directed so that the effort will be strained even in the face of this unexpected difficulty to prevent the establishment of district schools from falling through. That all will be able to proceed under this altered situation cannot be doubted, but hope—for while in none of the districts are there any objections to the scheme which would be seriously unjustified—there is every reason to believe that it is the question which immediately presents itself for consideration is how best to meet the difficulties which present the ordinance, and satisfy its vast increasing obligations are to be obtained. We believe that the proposal of the local governments are so limited that it seems wise to turn them over to a more powerful authority in the course of time the general agreement of the rising generation caused by the encouragement of whom might provide the means of obtaining the additional class to enable the government to spare some of the funds derived from the district school by the law, which would be used for the purpose of providing a thing as education for their children, of indirectly assisting by the abominations of drunkenness, by the dissipation and dissolution of the difficulty, and that it is the task of the Dominion treasury to dispose some of these funds which are now being fed into the Territorial directly and indirectly. If any arguments are necessary to do the obvious duty in helping the struggling pioneers to what next to food and clothing is most essential, we may just now address a few words which may touch them more nearly as showing that by an doing they will contribute toward the welfare of their own sons. We presume they will easily recognize that if we are to remain in the Dominion it will be to the advantage of it as a whole that the growing generation of what before long will prove to be its most valuable assets shall be educated and useful instead of ignorant and vicious citizens. We take it that the government will be willing to do its part in order by affording easy ingress to a population to develop the country's vast resources, and that it may encourage them that the settlers already here with out the prospect of education for the children they already have, cannot as heretofore, be expected to direct their best energies to further increasing that population by human industry, nor will the lands be opened up to new comers in under such discouraging circumstances. We must remind them that their own children will be subjected to similar conditions with the view of ultimately enriching themselves, by keeping the country cool, and by encouraging the residence of doubly difficult for settlers with assistance to undertake the burden of the schools. We believe that this course must enhance the value of the lands or served. Then there is no self evident advantage with respect to this matter, as to render it idle to argue it seriously.\n\nBIBLE COMPETITION.\n\nThe question of the popular paper was entitled \"Our Jeshurun a Reporter,\" anxious to dispose of the limited number of copies on hand has offered a prize of twenty-five dollars to the first correct answer to the following Bible question before the 15th Jan., 1885. THE CHALDEANS in pursuance of the 420 in gold, the person who gives the first five correct answers, one dollar each, and the last person making the last correct answer one dollar each in all eleven rewards.\n\nEach person answering must enclose a stamped envelope with their answer and will receive by return mail a copy of \"Our Jeshurun a Reporter,\" a handsome work of 160 pages of original Provincial work. United States press will apply most favorable. Name this paper.\n\nQuestion.—What is the number of Chaldeans? In the enumeration by the number of years Shaka was bound, divided the number of gates in the city of Jerusalem, and the number of pieces of silver taken by Asher from Jericho, subtract the number of false prophets, subtract the number of those who died by the number of Moses, and subtract Eli's death.\n\nThe names, answers and names of successful competitors will be published in the New Brunswick Review. A copy of the paper will be sent by return mail to Asher H. Pitts, Macdonald, N. B. P. O. Box 299.\n\nMISS MACK & CO.,\nCAMERON'S BLOCK.\n\nFits, Epilepsy, or Falling Sickness.\n\nThis Powder never varies. A marvel of purity strength and wholesome effect. It contains the celebrated invaluable Fill Powder. To be used in cases of Fits, Epilepsy, or Falling Sickness. For sale by the box or half box. We also make a Free Trial Box, containing a sufficient quantity to try it. We have made this disease especially, and have found it to be a great help. It is permanently effective. We guarantee satisfaction or money back. We refund all money paid for the powder, if you do not find it equal to your expectations. Price $1.00 and 25c for 25c. Send by mail to any part of the country. Address, Miss Mack, P.O. Box 30.\n\nASH & ROBBINS,\nPalmer St., Brooklyn, N.Y.\n\nCONSUMPTION Positively cured.\n\nJust arrived a new stock of Rockers, Table Chairs, Etc.\nCHEAPER THAN EVER.\nG. & G.E. CARTER.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAt T. N. Campbell's New Store.\n\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\n\nKEPT CONSTANTLY ON HAND\nRepairing Promptly Attended to\nCHESTER THOMPSON,\nGeneral Blacksmith,\n\nEnd East next to the Hudson Bay Store.\n\nNEW MILLINERY\n\nFANCY GOODS,\nWOOL GOODS,\nLADIES' CLOAKS,\nFUR MUFFS,\nAND\nCAPS.\n\nMISS MACK & CO.,\nCAMERON'S BLOCK.\n\nROYAL BAKING POWDER\nAbsolutely Pure.\n\nFURNITURE\nJust arrived a new stock of Rockers, Table Chairs, Etc.\nCHEAPER THAN EVER.\nG. & G.E. CARTER.\n\nGREAT REDUCTION IN\nBoots & Shoes!\n\nNow is the Time to Secure Bargains!\n\nAs I need money I have determined to reduce the prices of the balance of my stock 25 PER CENT FOR CASH.\n\nI have a splendid sample in Gentlemen's Fine Kid Shoes and Skating Boots. Also Ladies Skating and Kid Boots and Slippers.\n\nCall and see for yourself and get the best bargains ever offered in Prince Albert.\n\nJ. C. Mackenzie.\nDRY LUMBER.\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 11 feet extra.\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\nAdvertise in The Times and you are certain to succeed in your business.\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nof all descriptions done neatly, quickly and cheaply.\nJ. D. MAYETTY, PUBLISHER AND PROPRIETOR\n4TH ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884122601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4003, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5383, 1], [5383, 5383, 2], [5383, 8149, 3], [8149, 17270, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]