[{"id": "b89e12914879bb4316906e680f3b570bcec80b22", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nSPINK & MAVETY\n\nT. A. SPINK, J. D. MAVETY.\n\nPRINCE ALBERT, N.W.T.\n\nTHE EASTERN QUESTION.\n\nIt is very advisable in order to counteract the morbid tendency of our minds caused by the recent contemplation of our immediate concerns, that we should occasionally cast our eyes abroad over matters of more widespread interests. Although the policy of the Imperial Government in the Eastern Hemisphere cannot fail, when we remember how much depends thereon, to watch it with interest. It is a matter of no surprise what an atmosphere of ignorance, or at least inaccuracy, prevails concerning our relative position to Russia, among men who only judge by hearsay and are not fairly well educated and informed. We have all a general impression that our position in the East has been meretricious, when we hear that Persia is not now so by this time as it was in days of yore, owing Merv. Those who take any interest in the gradual advance of Russia through central Asia, descend to the conclusion that the vast Indian domain must feel indebted to Col. Barnaby for his ride to Khiva. It is this stealthily, but sure advance that has rendered the control of the Amur and the Suez Canal of such vital importance to English interests, and out of that have arisen troubles in the Soudan. The concentration of public attention upon our own northern provinces has caused the annexation of Merv to pass comparatively unnoticed, and yet it is very curious that it should happen at this juncture. That England has been active and persistent about each step of this advance, we all know, as also the assurance given some three years ago by Mr. Giers that Russia neither desired nor had any reason for the occupation of Merv. The ease with which Russia repudiates her most solemnly ratified agreements has come to be regarded as a matter of course, and probably the fact that the Turkish treaty might have invited this annexation, thrills her with a glow of conscious virtue in accordance with her officially expressed desire of every possible chance of entering India is through Afghanistan, and Herat is the key of India, for whosoever possesses it commands the direct roads to the passes by which commerce can enter by an invading army from the west. The precipitous character of the lofty range of Paropamissus renders the approach to Herat from the northern boundary of Afghanistan by an army and its necessary equipment almost an impossibility, unless at a point where nature has provided a passaging for the outlet of a river. That river, which has been provided for the Murghab River, upon which stands all that now represents the once great city of Merv, is what constitutes the chief reason for the present rush of such advantage to any power desirous of commanding Herat. That Russia is working patiently and always keeping her designs on British India steadily in view, has disclosed an easier route for the transportation of near future war orders from them to Herat and so to India, an entrance on the north of Afghanistan by the possession of Merv, seem of less importance than formerly, but yet it is not easy to see why Herat should make the command of either by one and the same power of less consequence to us. Doubtless owing to the difficulty of carrying the vast provisions necessary to an army as would be required to invest Afghanistan and seize Herat, through the desert from Khiva to Merv, the alternative and much easier route should be chosen. Such a movement would take more space than we can spare, but we may briefly mention that it starts from Michailovsk, a post recently established by the Russians on the Amu Daria. The 320 miles of railway necessary to connect that port with Astrakhan on the Persian frontier are being rapidly constructed. A glance at a map will show that Herat, now on Herat road, which Herat stands under the new name of the Tejend to Sarakhs, which the map places only some 250 miles from Astrakhan, will be within the Russian territory and will not long prove an obstacle to the occupation by a power like Russia, as soon once there the command over Herat is ours, and so to India. It is clear, therefore that it behoves us to soon command the road to India, as the friendship of the Amur. The Afghans, as we know to our cost, are not to be trusted, and we must be on our guard, as we know every lazy man owes his life to the regular police. Address: The Hon. Mr. WAGGONER, Rochester, N.Y.\n\nCASE OF GRAIL.\n\nThe question of the annexation of the Eastern Provinces towards Manitoba and the North West Territories has been so decided that there has been a natural if unwritten alliance between the Government, and any party who may be disposed to oppose it, is dangerous. It is therefore with mingled feelings of surprise and regret that we have witnessed the attempt of Manitoba to steal march on the west, or, as they phrase it, to extend their jurisdiction, heretofore at least exercised by prairie governments, to the extent of permitting the present Government to extend her boundaries so as to include that part of Hudson's Bay, which speaking, speaking of which, we have heard so much, is our own. A gentleman of leisure, etc., contribution to the \"Daily News,\" Toronto, entitled \"The Adventures of a widow.\" Another gentleman of leisure will write, among other subjects, papers, a short description of a tourist by him during his recent visit to Europe. We shall contribute in prose and verse from many distinguished writers. Art, music and the drama will be represented by contributions from distinguished writers. For terms and particulars apply to C. BLAIRTON & Co., 127 Yonge St., Toronto.\n\nFURNITURE\n\nJust arrived. In addition to our former large stock we have received some Fancy Parlor Bedroom Sets. Give us a call and see our Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all Descriptions, Cradles & Cribs for the Babies Rocking Chairs for the Ladies Mattresses Single & Double to suit Customers.\n\nC. & G. E. CARTER,\nThe Grand Central RESTAURANT.\n\nJ. DAVIS & CO., SASK.\n\nPRINCE ALBERT, SASK.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done to order, next to H. B. C. Grob Mill.\n\nAsh & Robbins, 360 Fulton St., Brooklyn, N.Y.\n\nCONSUMPTION\n\nPositive Curatively.\n\nASH & ROBBINS,\n\n360 Fulton St., Brooklyn, N.Y.\nPECK'S BAD BOY.\n\nI was down to the drug store this morning, and Mr. Peck was buying a box of crackers. I thought he looked rather pale and thin. What's the matter with Mr. Peck? He looks as though he had eaten too much cold-water plant. I asked the grocer if Mr. Peck was ill. He said yes, and explained that Mr. Peck had been working late at night, and had not eaten breakfast. I thought it was strange that Mr. Peck should be so pale and thin. I thought he looked as though he had been working too hard.\n\nMANITOBA.\n\nRAT PORTAGE.\n\nFrom the Brandon Times.\n\nThere will be a big ball at the residence of Mr. J. Thompson on Tuesday evening next.\n\nMr. W. H. McLeod, Post Office. In Brandon, was in town this week establishing a money order office, which will be opened next week.\n\nJohn McDonald has received another contract of one hundred miles on the C. P. R., west of the summit of the Rockies.\n\nPORTAGE LA PRAIRIE\n\nFrom the Review, April 6.\n\nThe town clerk, named him marriage commissioner.\n\nThe farmers in this district expect to commence seed planting next week.\n\nLast Friday 100 acres of meal were sown at the optimal mile in eleven hours.\n\nThree trains loaded of immigrant goods were effected from Portage la Prairie en route to the west.\n\nNOTICE.\n\nA quiet man is just now in the implement business, and the local agents are anxious to have him as their farmer with plow, harrows, mowers, and other machinery required for spring work.\n\nTERITORIAL NEWS.\n\nCALGARY\n\nFrom the Herald, April 5.\n\nA silver lead has been struck near the town of Morley.\n\nA cricket club will shortly be formed here.\n\nFresh beef is somewhat scarce just as yet.\n\nMr. Melvin, Silver City, walked from the Rocky Mountains to Calgary, a distance of 102 miles in 20 hours.\n\nGovernment Surveyor has reported to the Board of Trade, that during the year 1883 permits to bring liquor into the North-West Territories were issued on which 6,786 gallons were brought in.\n\nA rifle contest between the police and citizens will shortly take place here.\n\nThe territorial government has ordered the building of a Silver City to every bona fide miner, on the payment of $10.\n\nREGINA\n\nFrom the Leader, April 5.\n\nAn Agricultural Society has been formed here.\n\nPloughing and seeding are being very generally prosecuted in this district.\n\nA large party was present at the house of Mr. Smith, the acting manager of the Bank of Montreal, at this place, on Monday evening last. Mr. Smith was away for England shortly.\n\nMOOSEJAW\n\nFrom the Leader, April 5.\n\nThe farmers are busy sowing.\n\nCopeland & Co. have sold out their entire stock.\n\nLand Commissioner McTavish went west the other day by special train with an outfit and a number of men for the new experimental farms a little west of here.\n\nIt is calculated that not less than 40,000 bales of wheat will be sown in this district during May.\n\nFORT MACDONALD\n\nFrom the Leader, March 29.\n\nThe jurisdiction of the Mounted Police is to be extended into South Dakota at the request of the C. P. R.\n\nPloughing started about two weeks ago.\n\nBusiness is reviving.\n\nCommissioner O'Leary and Weale have been supplied from the Police Force. They shipped across the line last Tuesday morning.\n\nThe ice in the river melted out on Sunday.\n\nWhat about incorporation?\n\nPUMPS! NEW GOODS!\n\nMEDICAL HALL.\n\nJust arrived, an assortment of DRUGS, TOBACCO, FANCY GOODS.\n\nCONTAINS IN FAIR ATKINSON'S COLGATE'S, LUBIN'S AND LUNDBORG'S PERFUMERY, PEARL'S AND COLGATE'S FANCY SOAP, HAIR BRUSHES, SCOTT'S ELECTRIC AND INFANT'S CELLULOID, BORN AND RUBBER COMBS, GOMELL'S TOOTH BRUSHES, TOOTH PICKS, BREAST PUMPS, BREAST BOTTLES, KNO'S FRUIT SALTS, ETC., ETC.\n\nT. E. JACKSON.\n\nAT THE OLD STAND.\n\nBOOTS AND SHOES CHEAP.\n\nWe claim to have the best assorted stock.\n\nBoots and Shoes\n\nIn Prince Albert and are selling at prices which defy competition.\n\nCUSTOM WORK\n\nWarranted and done at shortest notice.\n\nREPAIRING\n\nPromptly attended to.\n\nSHANNON & MCLEOD\n\nTHE GABLE HOUSE.\n\nThe New Office of Pool, Carver & Picton Hole Tables.\n\nThe Best BEDS and CHAIRS of the Finest Brands also sold on board, wholesale and retail.\n\nJOHN WERNERSEIGER, PROP.\n\nUNITED STATES LIFE INSURANCE CO., LTD.\n\nESTABLISHED\n\nDeposit with Dominion Government $100,000.\n\nAssets\n\n$1,000,000.\n\nOffice\n\nElmo, Bird Block, 433 Main St.\n\nG. H. MAGUIRE, Principal Manager.\n\nThis Company cannot possibly be insured against any loss or damage from fire, explosion, or any cause whatever. Every form of liability is hereby waived.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance COMPANY\n\nESTABLISHED\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds nearly $6,000,000.\n\nAnnual Income over $1,000,000.\n\nA general agent of the Company will visit this town a few weeks hence, and will make us an offer of great advantages to those who belong to this good and reliable Company.\n\nA. SPROAT,\n\nPrince Albert District, N.W.T.\nHANGED AT LAST.\n\nThe prisoners pay the penalty of their crime. The criminals confess their guilt.\n\nRiviere, N.W.T., April 3.—John and Grace Stoddard were hanged here this morning at 9 o'clock for the murder of an old man named McCarthy, committed on the 14th day of last month. The prisoners were accompanied to the scaffold by their spiritual advisers, Bishop H. W. Haggard, Col. Haggard, and others, including a guard of eight mounted policemen. The prisoners made a full confession of their guilt, and acknowledged the justice of their sentence. After the usual formalities had been observed, the prisoner was hanged, and the executioner, who was masked, by a patrician's leave, cut down and the condemned body fell some feet. Death was almost instantaneous.\n\nBEFORE THE FINAL SENTENCE.\n\nThe prisoner appeared to think that the authorities would not execute them, but on getting the coffin this decision was dispelled. They also made a request to telegraph back to their father asking for the bodies after the sentence of the law had been carried out. They urged upon the executioners great clemency. While they stood upon the drop, they repeatedly knelt down and held before them the prisoners. Their punishment even by the reformed and hard-pressed population is considered just, and will produce a most salutary effect.\n\nTHE WRITERS' CONFESS.\n\nThe substance of the written confession signed by the prisoners is as follows:\n\nOn the 14th of June the prisoners went to the house of Mr. McCaffrey on the morning next, about nine o'clock, finding the house locked inside into which they entered. They then left; but returned at six o'clock and found the door of the main entry house. They advanced to his living room, where they heard a noise behind the house, but desisted and went outside; and John struck him three times more and finished him. He then took the body and placed it in the house, and dragged the corpse to the bluff where it was subsequently discovered.\n\nMISSING.\n\nMissing—so many are missing, The old as well as the young. The weak alike with the strong. Missing—our loved ones wander, We never know how or where, And perhaps sightlessly As smoke fades into the air. Missing—a man; it may be A citizen famed and well known, Who to the world is but a name As stones in the pool a stone. Missing—our care and riches, So sadly are we at a loss. We know not the loved ones left us, But know not whether they went. Missing—at day time or night time, And under the stars or the sun; They cannot tell us what they know, As water flows from the rock below.\n\n\"The Montana Frontier.\"\n\nA common cause medical work for ladies only. Fully answers all questions which may arise. A special visit from a male physician, gives causes and symptoms of all diseases of the sex, with practical advice on how to avoid them. For ladies who have made these diseases a life study. A plain skill in delicate language, a common sense, young at heart, should read. It is recommended by many eminent physicians as a sure guide. Price 50 cents. Illustrated and illustrated. Published by the B. F. Adams Co., the Homestead Press, No. 23, 33 & 333 Osborn Block, Rochester, N.Y.\n\nITEMS OF INTEREST.\n\nTHE VERY LATEST NEWS.\n\nCANADIAN.\n\nOttawa, April 6.—Mr. Geo. Stephen, President of the Canadian Pacific Railway, and Hon. J. J. C. Abbott, sail from New York for England on Monday.\n\nIt is rumored that Sir Leonard Tilley will ask for the passage of the sub-mission bill. If the bill becomes law, soldiers injured in Manitoba's recent riot might make her obsequies again.\n\nThe prosecution of Parliament will probably be about 17½.\n\nA great spirit of dissatisfaction is expressed at two days being allowed by the Hudson's Bay Railway bill for the construction of the line.\n\nHenry Johnson, editor of the Icelandic paper in Winnipeg, is here asking aid of the government for the publication of a paper in Iceland, and a Danish edition of the same in Norway and Sweden. The government is considering the matter.\n\nMr. Ross had an interview with Sir Leonard Tilley with reference to granting him a subsidy.\n\nMr. Whiting, and pointing out the great advantages of developing that industry in the West. Sir Leonard Tilley promised to give the subject his careful consideration.\n\nMontreal, April 6.—Joseph Allan, Geo. Co.'s warehouse was gutted by fire this afternoon; loss, $3,000.\n\nToronto, April 6.—The demotion of Sir Samuel Leonard Tilley also at Altona, was taken at the hospital yesterday. He is not expected to recover.\n\nJames Allen, a prisoner, was arrested this morning by Inspector Henry Douglas on York street. Douglas was found drunk and stupified by a beating. He was taken to the police station and charged with assault. Allen was charged with assault.\n\nLondon, April 6.—Major Lyster has replied to the protest of the recognition of Sir James Macdonald's right to have a voice in the election of a senator. The dearth of senators in the Senate chamber, owing to the failure of the government to fill the vacancies of Treaty, but directly evade the request of the petitioners, must refer to the fact that the latter, leaving the country in a perturbed state, the administration says he expected the Dean to go to the territory west and the Manitoba Indians, they say, are much loitering on the case in their introductions.\n\nAMERICAN.\n\nSt. Paul, April 6.—The Chicago Milling Company has shipped wheat into St. Paul from a special consignment of twenty-one cars of grain grown in Montana, and three cars of potatoes. The party from Chicago is composed of Messrs. Thomas and Thomas, who are engaged in the business.\n\nMINNEAPOLIS, April 6.—Mayor Amos has issued a proclamation that the most radical kind, low-down, coarse, vicious gambling house in the city, called \"Monte Carlo,\" is now ordering the police to arrest the owner. The police will make the latter appear at 11 p.m. on every other night.\n\nSt. Louis, April 6.—The Missouri State Fair Association has purchased a three-story brick building, quickly put up early this evening and was entirely destroyed. About a dozen employees were employed in the erection of the structure, several of whom went down with the debris, but fortunately none were seriously injured except Mrs. G. E.\n\nGENERAL.\n\nLondon, April 6.—Mr. Parrish gave a banquet last night to the Messrs. Redmond, members of Parliament.\n\nThe Crown Prince Frederick William, a member of the Royal Family, is here.\n\nIt is reported that an agrarian uprising has occurred at Odesa, Russia, and many conflicts in which several gentlemen were killed.\n\nEmmanuel Gabel, the celebrated German poet, is dead, aged 68 years.\n\nJim Butler, the pallid, died suddenly in his London residence, aged 40.\n\nCol. F. Middleton will succeed Major Leard as General-in-Chief of the militia.\n\nParis, April 6.—Advice from Tonkin reports the expedition to Hongkong started. The troops have been massed together on the left bank of the Black river, and Grenier's column on the right.\n\nIt is reported that Liong-leon is now at Hongkong, where there are assembled 3,000 Black Flags and 12,000 Chinese troops. Serious fighting is expected.\n\nBerlin, April 6.—During his latter years Gustave Richter, the famous composer, died at the age of 63. His works are valued at $3,000. He was educated at the railway station by the King of Belgium and by the German Colony and Legation.\n\nBETTS & GWYNNE.\n\nA FULL STOCK OF Powder, Shot, Caps and Shells.\n\nField Hoes, Spades, Garden Rakes, Shovels, Forks, Rope, Etc., at J. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books.\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Terrible Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Brandon, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC.J. BRIDGES Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884041801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5858, "total-output-tokens": 4725, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6470, 2], [6470, 11313, 3], [11313, 19630, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]