[{"id": "139c4ec49ff54d6c0656c5baf5974e527486431d", "text": "CHIT-CHAT LOCALS.\n\nGathered by our Reporter.\n\nInsect Powder at Clark's Drug Store.\nSheriff Haggard returned from Banche on Monday.\nNo rifle practice on Wednesday owing to rain.\nBargains at Wigmore this month.\nPrices away.\nCherry imported Havana Cigars at Clark's Drug Store.\nMr. J.A. Bradtman has purchased the lot east of Stewart & McLeod's, on which he proposes to build a house.\nMr. J.J. Campbell returned from Carrot River district on Saturday last. He reports the crops looking well.\nMr. F. Fulton has returned from Fort Qu'Appelle, where he was on Kinneir's farm, near that of H. Clark, on which he intends to build a hotel.\nMr. H. Doull, travelling in the district, reports a good crop of wheat in the districts of Hamilton and Wainpeg, is in town.\nThe steamer Northward arrived on Saturday from the forks of the river and on Sunday left for Battleford and Edmonton.\nThe time limiters across the river have been removed from Chicago and commenced operation a short distance down the river at Belleville.\nThe school house cannot be completed so soon as there is no place to open school until the new building is finished.\nSgt. Perry, of the N.W.M. Police, and Mrs. Perry, who went east some years ago, returned last Monday.\nEgyptian Rhomatic Oil, an invaluable remedy for every kind of pain, at Clark's Drug Store.\nMr. A.W. R. Markley, Inspector for the Confederation Life Insurance Company, has been here for several days, but after an extended trip through the Territories.\nMr. Chas. Main returned on Sunday from Winnipeg, where he had been to see his eldest daughter who was on her way to England, where she had been spending a year.\nThe vote will be taken again on Tuesday next for the purpose of electing a member of the Territorial Council.\nIt is the duty of every one to vote \"yes.\"\nThe voters list for 1887 has been compiled and may be seen in the office of the Editor.\nOne day last week a smoke was seen rising from one of our dwellings, we thought it was a fire, but on examination it was found that the driver carried a smudge with him.\nThe Hon. L. Clarke returned from Carlton on Monday, where he had been to meet Mr. Wright, Chief Commissioner of Indian Affairs, and also visiting the various posts to the north and west to Winnipeg.\nMr. J. Williams, party that they have everything ready now to proceed with the work of removing the trees which are now blocking the river.\nDuring the river being very high they can only work on the sides of the road, but when the water goes down they can perform their task.\nIt destroys flora, bogs upon plants, mosquitoes, flies and other pests, and a host of other pests.\nNo housekeeper should be without it.\nNo housekeeper should be without it.\nThe town fathers are the people to look after the matters.\nMr. A.B. Dodge, a cove store, at Clark's Drug Store.\nLast Thursday evening the P.A.C. met at Clark's Drug Store.\nThe confidence of our neighbor was well shown by his Parliamentary duties at Ottawa.\nMr. Macdonald visited the town and delivered a speech, and a good time was spent in music and speech making.\nOn Saturday evening the ladies met at Clark's Drug Store and were also presented with a contribution towards defraying expenses.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N.W.T.\nPhone—Ask permission in advance.\nNo ad will be inserted in this paper. Business local 15 cts. per line.\nNo advertisements will be inserted without instructions.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETTY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Alban's and St. Mary's Churches.\nSt. Alban's—9 a.m.—Rev. Canon Pickett.\nSt. Mary's—10:30 a.m.—Rev. Canon Pickett.\nSt. Paul's—3 p.m.—Rev. Canon Pickett.\nSt. James—6 p.m.—Rev. Canon Pickett.\nSt. Andrew's—8:30 p.m.—Rev. Canon Pickett.\nSt. John's—7 p.m.—Rev. Canon Pickett.\nSt. Matthew's—8 p.m.—Rev. Canon Pickett.\nSt. Luke's—7 p.m.—Rev. Canon Pickett.\n\nTHIRD PAPER MAY BE FOUND AT:\nChurches, Post Office, Drug Stores, Hardware, &c., &c., &c.\nThis Paper is Supplemented by the following:\nNEW YORK.\n\nFRIDAY, AUGUST 5, 1887.\n\n\"GIVE me the liberty to know, to utter, and to argue freely, all matters of concern to the public; to read books where I please, to speak my sentiments in public, and to choose my own teachers, and not the teachers of the State.\"\n\nIn his day there was indeed little real freedom of any kind, and the liberty which he then held dear was but an aspiration, to all appearances of the most remote attainment. It has been reserved for our day and for our generation to obtain an amount of liberty of mind and action, notably in this respect, to which our own ancestors were strangers and which even the present generation in most foreign countries has never to this day enjoyed. We can easily imagine what intelligent foreigners, European continentalists for instance, must think when they become first acquainted with the perfect freedom and independence of thought and action which our newspapers discuss so merrily and vital questions, cut and slash public measures and scarcely prominent men without mercy.\n\nOur Dominion press also takes full advantage of the peculiar liberty it enjoys. Loyalists may do so and may such liberty never degenerate into license. We must say, however, we like not the airy carelessness with which some of our contemporaries indulge in comparisons on the comparative merits of the British connection and we are greatly mistaken if the thoughtful reading public enjoy the numberless declamations of dreary outrage which a portion of the Canadian press continues pouring over the land on the unalloyed benefits of commercial union and those journals on the enlightened evils of centralisation, the dark ill-success of the Confederation and the sins and shortcomings of our rulers in gross and in detail, in which poor pessimists virtually tell us our country is going to the dogs.\n\nTwo or three times it might have been supposed from reading the same newspapers that all possible and impossible grievances whatever were located in the North-West Territories, that we were exposed to hardships and moreover that though we wanted everything we could do nothing for ourselves, that we were, generally speaking, a poor ungrateful set. But patience, as the proverb says, is the longest of the noble heritage nor the distinguishing feature of the North-West. We seem to be now tolerably happy and contented in our position and prospects. It appears that many of the older provinces feel themselves down trodden and ill-used and misgoverned. Is it they whom blind guides and interested men have led astray? Or is it hard to be happy by first showing them their misery and their folly. But they will survive the process and see through it all in time.\n\nWe observe there is an Inter-Provincial Congress in course of organization. It will probably act as a safety valve to blow off pent-up and superfluous energy and we may hope it will discover a perfect panacea for all ills. Possibly croakers may however be told beforehand that there is no patriotism in belittling their country—that many sound judges of the same country are convinced on quite identical terms that considering the bad times prevailing all over the world, Canada has had good reason to congratulate itself on her prosperity. But who wants now is some thing alone. We may do worse than possess our souls in patience for a time and re-pose some confidence in the rulers who have so recently replaced ours.\n\nThe population of the North-West Territories bids fair to become by and by as considerable in its character as the United States.\n\nNot to speak of the English and French speaking Canadians, who may almost be reckoned indigenous, we are constantly receiving recruits from the old countries to make up the United Kingdom as well as most of the other European nationalities. The Scandinavian element is becoming fully represented as well by natives born Studies, Norwegians, Danes, Swedes, Finns, etc., who relatives the Icelanders. The latter in particular have been arriving in large numbers and the cry is still that they come. It appears that the Icelandic exodus were about to take place from their interesting but barren island. It is reported that late the population of Iceland has been suffering severely from bad harvests and that many of the more westerly would gladly leave for the Canadian North West were means to enable them to do so forthcoming, which will eventually be provided.\n\nAfter these volcanic rocks and in homely soil such communities must seem an earthly paradise, and there is room and to spare for them all, if they choose to come. These Icelanders will without doubt make excellent settlers. They travelled in the island representing the people as industrious, peaceful and religious. Considering their isolation and by no means affluent circumstances, they are also comparatively well educated and having been nurtured to hardships from birth they will be able to make light of such little asperities as all must at first expect who embrace the healthful and invigorating life of Canadian pioneers.\n\nQU'APPELLE\n\nFrom the Progress, July 21.\n\nThe Progress presents from upas a new addition to Qu'Appelle street. There was a shower of rain passed over here yesterday, it was badly needed. Much needed.\n\nAn immense number of agricultural implements have been sold here this year, and many of them going to Prince Albert. The farmers have been anticipating a good harvest.\n\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader July 19.\n\nInspector Morris, W.M.P., leaves today for his post at Battleford.\n\nCommissioner Hetherington went to Calgary Friday last.\n\nSeveral tea trains passed Regina during the week.\n\nCol. Goddard, agent of the British Government, left on Tuesday last for the west.\n\nMr. P. M. Barker has returned to the capital after having visited the registry offices throughout the Territories.\n\nTuesday last was a very fine day at Pi-a-pot's Reserve. The occasion was celebrated by a dog feast and medicine dance.\n\nA bunch of hay over six feet in length was brought in from Lake Lake last week. It is expected to last so long that the reserve frequently lose their cattle among it.\n\nSupt. Cotterill, W.M.P., has been away from Regina for a few days on his return from the east. He has been to Medicine Hat Tuesday with Insp. Bruce. He is now back to take charge of the post at Battleford.\n\nMedals on account of the late North West Rebellion, will be delivered by the Mounted Police next month.\n\nA man was arrested last night on the information last by the Mounted Police caught on Pi-a-pot's reserve with whisky in his possession, doubtless to sell to the Indians.\n\nLETHBRIDGE.\n\nFrom the News July 20.\n\nA heavy freight of goods arrived here last week. It is the N.W.M.P. Police, Fort MacLeod.\n\nHaying is being commenced in this district. It is expected the crop will be a good one this year.\n\nA shower of rain last week would be of great benefit to the country, as things are beginning to get pretty dry.\n\nWe had a pretty sharp frost here last night, although it had been very much damp, still several of the tender vegetables were nipped.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER--(Hop)--ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROND\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, Prince Albert, Alta.\n\nJUST RECEIVED AT\n\nAGNEW'S Coal Oil, Window Sash, Panel Doors, Harvest Tools, ALL AT BOTTOM FIGURES.\n\nT. J. AGNEW'S.\n\nSchool Books and Stationery, Public and High School Text Books, School Requisites of every description, Stephens' Blue Black Ink, ALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED, NEW GOODS AT CHAS. MAIR'S W ST END STORE, Nut's Veiling in Cream and Light Shades, Persian Polar Rugs, Tapestry Carpets, Crimson Ropps, Window Holand in Slate and Yellow, Door Matts, Crumpled Cloths, Silk Corded Cloakings, Empire Cloths, Blanket Garnet, Fine Cretonnes, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beeze Velling, Ladies' Silk Ties, Timel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Readymade Clothing and Fresh Groceries, including Fancy Collections, Biscuits, Figs, Dates and Tinned Goods of all kinds. Inspection is advised.\n\nGO TO CANN'S BOOK STORE FOR Wall Paper AND Borders\n\nHURRAH! FOR THE QUEEN'S JUBILEE!! THE VICTORIA Sale and Reed Stables Have just got in their New Rigs and Fresh Horses And the public can now depend on a FIRSTCLASS TURNOUT At REASONABLE PRICES.\n\nA reliable man in attendance day and night.\n\nTelephone—No. 999.\n\nStable—No. 8 River & Nesbit Sts.\n\nNEILSON & McBEATH\nWIMBLEDON\n\nLondon, July 14.—There was again today a very large attendance at Wim-\nbledon, and intense interest was taken in\nthe shooting for the Queen's prize. On\nthe first day the second and third ranges of\nthe first stage were fired by nearly all the,\nfiring being at 500 and 600 yards, and\nscores of 200 points being secured by\nmany competitors. Private Gillies, of the\n90th battalion, of Winnipeg, leads the Cana-\ndian contingent, having scored 300 points\nagainst all competitors, his score being\n61. It is impossible to give his exact\nplace, owing to the non-completion of\nscores by a number of competitors.\n\nIn the Heath competition for prizes amounting to £115, two shots at 500\nyards, six shots at 600 yards, and three\nshots, C. N. Mitchell, of the 90th,\nWinnipeg, leads with a score of 300\npoints. In the Albrecht competition, seven\nshots at each, 500 or 600 yards,\nprices £5 each, prizes were secured, after\nscores were keenly contested by Private\nGillies, of the 90th, Prince Edward Island,\nand Lieut. Cartwright, of the 47th, who\nhave taken money prizes in every case.\n\nIn the Alfred competition, £200, seven\nshots, Lieut. Cartwright captured prizes.\n\nJuly 15.—At Wimbledon today to-day\nthe firing at the third or 600 yards' range of\nthe first stage of the Queen's prize was\ncompleted. The highest possible number\nof points at the three ranges of this stage\nis 180. The highest English score is 160.\nThe Canadian scores are as follows: 160,\n200, and 600 yards, seven shots at each.\nQuarter-Master Sergeant Ogg, Corporal\nLangstroth, Lieut. Mitchell, Pte. Gillies,\n90th Winnipeg, 90th, Lieut. W. Mitchell,\n22nd Bruno, 80, Sergeant A. Thompson,\nVellore, Rifle company, 80, Corporal\nLangstroth, East Durham, 80, Corporal\nLangstroth, 3rd Cavalry, New Bena-\nvis, 80, Corp. W. Taylor, Fort Hamilton,\nSt. Paul, 80, Corporal J. Smith, South\nRoad, 81; Pte. H. Morris, 12th Hamilton,\nSt. Paul, 80, Lieut. W. H., P. W. O. R.,\nKingston, 80, Corporal J. Smith, 80;\nSergt. W. C. King, 45th, West Dur-\nham, 78; Pte. Logan, 13th, Hamilton,\n77; Sergt. Logan, 13th, Hamilton,\n76; Sergt. Logan, 13th, Hamilton,\n76; Lieut. E. A. Smith, St. John, N.B.,\nrifle company, 73; Lieut. D. H. Cooper,\n80, Lieut. J. M. Cooper, 80, Corporal\nP. F. L. L., 65; Sergt. C. N. Mitchell,\n90th, Winnipeg, 61.\n\nJuly 16.—Today shooting for the\nQueen's prize advances the interest natu-\nrally increases, and as the number of\ncompetitors grows larger, the more varied\nresults are more appreciated by the\nspectators. Corp. Taylor, Pte. Morris\nand Pte. Kanaley have taken many\nmore shots than any other competitor.\n\nIn the Daily Telegraph prize,\n£300, seven shots at 500 yards, highest\npossible score 35; Pte. Graham and Pte.\nKembery took 161; Pte. Graham won £2\neach.\n\nIn the Prince of Wales' prize, £200,\nseven shots at 200, and fifteen shots at\n600 yards, the first stage was completed\nby the highest possible score 230.\nPte. Kembery took 161; Pte. Graham\nand Pte. Morris, 20.\n\nJuly 17.—Being a general\nhalf holiday here, the attendance at\nWimbledon was considerably augmented\nand the interest shown by the various\nsections was greatly increased. In the\nPrince of Wales' prize, the highest pos-\nsible score was Private Gillies of the 90th\nbattalion, Winnipeg, and Lieut. Cart-\nwright, each scoring 97 points. Private\nGillies especially won, thus securing the\nprize. Corporal Langstroth, Lieut. Mitchell,\nof Hamilton, having been too\nlate, he takes £100 and badge.\n\nThe second stage of the Queen's com-\npetition was completed yesterday, ten\nshots 500 yards, and fifteen shots at 600\nyards, highest possible score 125,\nwith the same of the first stage, making\nthe highest possible score 230. The\nfollowing are the leading men: Quarter-\nMaster Sergeant Ogg, 180, Corporal\nLangstroth, 180, Sergt. Thompson, 187,\nPte. Graham, 180, Sergt. C. N. Mitchell,\n179, Ogg, Langstroth, Thompson, Mitchell\nare amongst the hundred men who will\nbe invited to the second and final stage at\n500 and 600 yards.\n\nIn the Daily Telegraph prize, £300,\nseven shots at 500 yards, Sergt. C. N.\nMitchell took 161.\n\nIn Tyne, £185, in connection with the\nnext stage Queen's prize, Pte. Gillies re-\nceived £100, Corporal Langstroth, Sergt.\nLangstroth and Pte. Kanaley have each won a smaller sum.\n\nJuly 20.—At Wimbledon shooting con-\ntinued, Corporal Langstroth, English\nmarksmen, won the prize, scoring 710\npoints, Canada won second place, making 668\npoints, and third prize £100.\n\nMuch interest is exhibited today at\nthe final firing for Queen's prize.\n\nThe following are the winners: Warrant\nOfficer Middleton, with 274 points out of a\npossible 280, Corporal Langstroth, of\nHamilton, 260, Sergt. Mitchell, New\nBrunswick, 210, Lieut. Mitchell, 200\nwith 200 points. He receives £15.\nQuarter-Master Sergt. Ogg, of Gosport\nRifle Battery, who has already booked\nlike a winner, scores 252, and received\n£12. Sergt. Thomson, Victoria Rifles,\nscores 220, and also Corporal Langstroth,\nSergt. Ogg and Sergt. Thomson have taken money prizes in every case.\n\nThe Duke of Cambridge visited the\nCanadian camp today, where he was re-\nceived by Lord Montgomery, Col. Officer\nof the Canadian camp, Lieut. Col. Macdonald,\nJohn rifle company. His Royal High-\nness shook hands with Col. Officer and\nLieut. Col. Macdonald, and specially referred to\nthe capitulation of Pic. Gillies. Addressing\nthe volunteers, he said he had great\npleasure in visiting the camp, and that\nhe trusted they would take back\nwith them the best remembrances of what\nthey had witnessed there. He\nspoke with satisfaction of the jubilee\ncelebrations and loyalty of the\nCanadians. Later in the\nday the Canadian Camp was visited by\nthe Prince of Wales, who shook hands\nwith Lieut. Col. Macdonald, and also\nvisited Pic. Gillies, on whose behalf\nhe pinned the badge he had won in the\nQueen's prize. Afterward Lieut. Col.\nPic. Gillies and Lieut. Mitchell after-\nwards walked with the Prince.\n\nThe Corporal Langstroth contest\ncontinues today. Following are the\nsuccessful Canadians with their\nhighest possible scores: Sergt. Ogg,\n180; Lieut. Cartwright, 180; Sergt.\nSmith, 175; Lieut. Horn, 80; Sergt.\nMitchell, 90; Corporal Langstroth, 82;\nPte. Graham, 80; Pte. Ridley, 80;\nKanaley, 80.\n\nANXIETY FOR THE MORNING.—Are you distur-\nbed at night and broken of your rest by a\npainful toothache? We have the secret of\neating Teeth! I send at once and once\nget a bottle of \"Mrs. Windsor's Soothing\nTonic,\" which is absolutely invaluable. It will relieve the poor little\ntoothache in a few minutes. This tonic cures Dysentery and diarrhoea, regulates\nthe bowels, reduces inflammation, soothes the gums, reduces inflammation,\nand cures toothache. It is a great help to\nchildren suffering from pleurisy at the\npresent time. It is used by many of our\nbest-known physicians and surgeons\nthroughout the world. Price 2s. 6d. per\nbottle. For sale by all Southern Syrup\nand medicine dealers.\n\nTHE CANA-\n\nDIAL NEWS.\n\nTO AGENTS.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for\nsale a Half Million Feet of Dry Lumber, consist-\ning of Matched, Dressed and Undressed\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nPRINCE ALBERT\n\nAT Mornington Reserve. A travelling Hotel, Messrs. Moore & Macdowall, Proprietors. A first-class establishment. Rates reasonable. An Office. Phone, No. 10.\n\nPUBLIC NOTICE.\n\nNo applications for Liquor Permit will be received by the undersigned by\nH. H. Hayter, Acting Secretary, until the\nCancelled Coupons of the previous\nPermit have been returned.\n\nBy order,\n\nE. B. Gordon,\nActing Secretary\nLieutenant-Governor's Office,\nRegina, S.W.T., July 25, 1887.\nEXHIBITION.\n\nPrice List of the Central River Agricultural Society's Second Annual Show held at Stanhope, Thursday, Sept. 18th, 1867.\n\nClass I — Carriages—Sec. 1, carriage teams, 1st, £1; 2nd, 50c.; Sec. 2, single driver, 1st, £1; 2nd, 50c.\n\nClass II — Agricultural and general purpose horses—Fair in harness, 1st, £1; 2nd, 50c.\n\nClass III — Heavy draught—Pair in harness, 1st, £1; 2nd, 50c.\n\nClass IV — Native horses, pair in harness, 1st, £1; 2nd, 50c.\n\nAll teams in above classes to be attached to vehicles.\n\nClass V — Horses and mares—Sec. 1, heavy draught, 1st, £1; 2nd, 50c.; Sec. 2, general purpose, 1st, £1; 2nd, 50c.; Sec. 3, native, 1st, £1; 2nd, 50c.\n\nClass VI — All horses under nine cwt., as native; between 9 cwt. and 12 cwt., as general purposes; and over 12 cwt., as heavy draught.\n\nClass VII — Cattle—Sec. 1, heavy draught, 1st, £1; 2nd, 50c.; Sec. 2, general purpose, 1st, £1; 2nd, 50c.; Sec. 3, native, 1st, £1; 2nd, 50c.\n\nClass VIII — Thoroughbred, with good gait—Sec. 1, yearling heifer, 1st, £1; 2nd, 50c.; Sec. 2, year old heifer up to 1st, £1; 2nd, 50c.; Sec. 3, heifer, 1 year old, 1st, £1; 2nd, 50c.; Sec. 4, heifer, 2 years old, 1st, £1; 2nd, 50c.; Sec. 5, cow, three years old and up, 1st, £1; 2nd, 50c.; Sec. 6, calf, 1867, 1st, £1; 2nd, 50c.; Sec. 7, stallion colt, two years old, 1st, £1; 2nd, 50c.; Sec. 8, three years old, 1st, £1; 2nd, 50c.\n\nClass IX — Heifers—To consist of a one-year-old heifer, a two-year-old heifer, a three-year-old heifer, and a bull, one year old or up, 1st, £1; 2nd, 50c.\n\nClass X — Fat cattle and working oxen—Sec. 1, oxen three years old, 1st, £1; 2nd, 50c.; Sec. 2, heifer, 2 years old, 1st, £1; 2nd, 50c.; Sec. 3, oxen, 3 years old, 1st, £1; 2nd, 50c.; Sec. 4, heifer, 3 years old, 1st, £1; 2nd, 50c.; Sec. 5, cows, 1867, 1st, £1; 2nd, 50c.; Sec. 6, calves, 1867, 1st, £1; 2nd, 50c.; Sec. 7, milch cows, 1867, 1st, £1; 2nd, 50c.; Sec. 8, pail cows, 1867, 1st, £1; 2nd, 50c.\n\nClass XI — Sheep—To consist of a one-year-old sheep, a two-year-old sheep, a three-year-old sheep, and a ram, one year old or up, 1st, £1; 2nd, 50c.\n\nClass XII — Lambs—To consist of a one-year-old lamb, a two-year-old lamb, a three-year-old lamb, and a ram, one year old or up, 1st, £1; 2nd, 50c.\n\nClass XIII — Bacon and ham—10 lbs. home cured bacon, 1st, £1; 2nd, 50c.; Home cured ham, 1st, £1; 2nd, 50c.\n\nPOULTRY.\n\nClass XIV — Sec. 1, pair Brahmas, 1st, £1; 2nd, 50c.; Sec. 2, pair Leghorns, 1st, £1; 2nd, 50c.; Sec. 3, pair Spanish, 1st, £1; 2nd, 50c.; Sec. 4, pair Plymouth rocks, 1st, £1; 2nd, 50c.\n\nClass XV — All exhibits growth of 1867—Sec. 1, hatched wheat, 1st, £1; 2nd, 50c.; Sec. 2, hatched barley, 1st, £1; 2nd, 50c.; Sec. 3, hatched oats, 1st, £1; 2nd, 50c.; Sec. 4, hatched peas, 1st, £1; 2nd, 50c.\n\nFIELD ROOTS.\n\nClass XVI — Sec. 1, hatched early turnips, 1st, £1; 2nd, 50c.; Sec. 2, hatched Beets, 1st, £1; 2nd, 50c.; Sec. 3, any variety, 1st, £1; 2nd, 50c.; Sec. 4, any variety turnips, 1st, £1; 2nd, 50c.; Sec. 5, mangolds, 1st, £1; 2nd, 50c.\n\nGARDEN VEGETABLES.\n\nClass XVII — Sec. 1, three carrots, any variety, 1st, £1; 2nd, 50c.; Sec. 2, three onions, any variety, 1st, £1; 2nd, 50c.; Sec. 3, three leeks, any variety, 1st, £1; 2nd, 50c.; Sec. 4, three radishes, 1st, £1; 2nd, 50c.; Sec. 5, three turnips, 1st, £1; 2nd, 50c.; Sec. 6, three cucumbers, 1st, £1; 2nd, 50c.; Sec. 7, three tomatoes, 1st, £1; 2nd, 50c.; Sec. 8, three potatoes, 1st, £1; 2nd, 50c.; Sec. 9, three watermelons, 1st, £1; 2nd, 50c.; Sec. 10, three pumpkins, 1st, £1; 2nd, 50c.; Sec. 11, six stalks rhubarb, 1st, £1; 2nd, 50c.; Sec. 12, two cauliflower heads, 1st, £1; 2nd, 50c.; Sec. 13, two cabbages, 1st, £1; 2nd, 50c.; Sec. 14, six cucumbers, 1st, £1; 2nd, 50c.; Sec. 15, six onions, 1st, £1; 2nd, 50c.; Sec. 16, collection by one exhibitor and separate from other articles on exhibition, but not exceeding five pounds, 1st, £1; 2nd, 50c.; Sec. 17, largest number of entries in garden vegetables and roots, 1st, £1; 2nd, 50c.; Sec. 18, largest number of entries in grapes, 1st, £1; 2nd, 50c.\n\nClass XVIII — Sec. 1, batter in rolls, prints or pastes, 1st, £1; 2nd, 50c.; Sec. 2, butter, packed, not less than 2 pounds, 1st, £1; 2nd, 50c.; Sec. 3, cheese, house made, not less than 2 pounds, 1st, £1; 2nd, 50c.; Sec. 4, cheese, factory, not less than 2 pounds, 1st, £1; 2nd, 50c.; Sec. 5, flour, meal, 1st, £1; 2nd, 50c.; Sec. 6, eggs, 1st, £1; 2nd, 50c.; Sec. 7, knitting in cotton, 1st, £1; 2nd, 50c.; Sec. 8, children's dress, 1st, £1; 2nd, 50c.; Sec. 9, linen, 1st, £1; 2nd, 50c.; Sec. 10, dress shirt, 1st, £1; 2nd, 50c.; Sec. 11, dress coat, 1st, £1; 2nd, 50c.; Sec. 12, silk umbrellas, 1st, £1; 2nd, 50c.; Sec. 13, embroidery, 1st, £1; 2nd, 50c.; Sec. 14, wall hangings, 1st, £1; 2nd, 50c.; Sec. 15, housework, 1st, £1; 2nd, 50c.; Sec. 16, housework, 1st, £1; 2nd, 50c.; Sec. 17, bottle pickles, 1st, £1; 2nd, 50c.; Sec. 18, straw hats, 1st, £1; 2nd, 50c.; Sec. 19, straw caps, 1st, £1; 2nd, 50c.; Sec. 20, pair macintosh, 1st, £1; 2nd, 50c.; Sec. 21, pair beaching, 1st, £1; 2nd, 50c.; Sec. 22, pair boots, 1st, £1; 2nd, 50c.; Sec. 23, best pair mittens, 1st, £1; 2nd, 50c.; Sec. 24, best pair gloves, 1st, £1; 2nd, 50c.; Sec. 25, best collection tea, 1st, £1; 2nd, 50c.\n\nSpecial by the Secretary-Treasurer, one choice to the exhibitor who secures most first prizes.\n\nABRAHAM CONNER,\nSecretary-Treasurer.\n\nTOWN COUNCIL.\n\nA regular meeting of the Council was held on Monday evening last. All the members present except Mayor Robertson. Mr. Bain was appointed chairman. The minutes of last meeting read and adopted.\n\nAPPLICATIONS FOR LICENSES.\n\nApplications for licenses have been received from Robertson & Pembroke for livery and feed stable; from Chas. Woodman for saloon; from Chas. Woodman & Co. for saloon; from Mr. Smith for saloon; from Theroux and Wm. Dilworth for dray; from Wm. Dilworth for dray; from Robert Buckley for saloon. All were granted.\n\nACCOUNTS.\n\nAccounts were received from John McCallum, for the Town Council chamber, and from Wm. Dilworth for removing nineteen $18, filling holes in streets, $30; digging ditches $18; two nights service $6; election day $3. Referred to Finance Committee.\n\nThe treasurer presented his report for the month of July, showing a balance on hand of $100.\n\nFINANCE AND ASSESSMENT.\n\nThe Chairman of the Finance and Assessment Committee recommended the following rates of assessment, viz.: R.J. Cass $10.25, Chas. Woodman $2.05.\n\nThe following by ballot received three readings and were ordered to be signed, sealed and returned. For the impounding of dogs, an assessment of twenty-five cents for municipal purposes; for authorizing an assessment for school purposes, forty cents per hundred feet of River street on river lot 68 and close part of Producer Avenue. The Council adjourned to meet on Monday, 15th inst., at 7 p.m.\n\nFRIDAY, AUGUST 5, 1867.\n\nCLEARING SALE!\n\nNuns' Veiling, Merino, Ginghams, Wincies, Boys' Jersey Suits,\n\nThe above will be sold at a 20% margin on cost.\n\nPillow Cotton and Twilled Sheeting.\n\nR. C. Wigmore & Co's.\n\nESTABLISHED 1879.\n\nBUY YOUR\n\nCook Stoves, Housefurnishings, Hardware and Tinware\n\nFROM—\n\nJ. R. McPhail's.\n\nMachine Oils, American Coal Oil\n\nLow Prices. Good Value. Prompt Attention\n\nAT\n\nJ. R. McPhail's.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nAND\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings, Trowsering and Overcoating\n\nWORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\n1879.\n\nBuffalo Hall!\n\nNEW GOODS\n\nARE BEING OPENED EACH WEEK.\n\nAlways on hand Fresh Lines in\n\nDry Goods, Clothing and Groceries\n\nPrices will be found right and nothing but reliable goods shown\n\nBUFFALO HALL\n\nFor\n\nDress Goods, Corsets, Hosiery, etc., Ready-made Clothing\n\nBETTS & Gwynne.\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887080501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 8758, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3197, 1], [3197, 12727, 2], [12727, 20598, 3], [20598, 28534, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]