[{"id": "7b3a4c0523c98edca535bdfdcea41897d95ba43f", "text": "**PRINCE ALBERT TIMES**\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N. W. T.\nTERMS—5¢ per number in advance.\nSingle copies, 10 cents each.\nIn no case will pages be inserted in this paper. Replies must be inserted in the paper. Mailbox located at 15th Avenue.\nNo advertisements accepted for less than $1. Advertising without instructions will be inserted until further notice.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETTY, Proprietor.\n\n**SUNDAY CHURCH SERVICES**\n\n| Location               | Time       |\n|------------------------|------------|\n| St. Alban's and St. Mary's Churches | 9 a.m.    |\n| St. Paul's             | 10:30 a.m. |\n| St. Andrew's           | 11:30 a.m. |\n| St. Matthew's          | 12:30 p.m. |\n| St. James               | 2 p.m.     |\n\n**MEN'S CLUB**\n| Location               | Time       |\n|------------------------|------------|\n| Prince Albert Club     | 7:30 p.m.  |\n\n**PARISH OFFICERS**\n| Name                  | Position   |\n|-----------------------|------------|\n| Rev. Canon F. Smith    | Rector     |\n| Rev. Canon J. Murray   | Curate     |\n\n**PARISH NEWS**\n\n- The parish church service at St. Alban's Church will be held on Easter Sunday morning at 9:00 a.m.\n- The parish will hold its annual meeting on Easter Monday at 7:00 p.m.\n- The parish will hold its annual dinner on Easter Tuesday at 6:00 p.m.\n\n**PARTY GOVERNMENT**\n\nThe principles of the Party system, the origin and history of which are so well known, are based upon the idea that the party system is the best form of government. However, the question arises whether the party system is the best form of government or not?\n\n**EDITORIAL NOTES**\n\nThe question of Peace Alliance district are about to petition the Lieutenant-Governor for representation in the Legislative Assembly.\n\n**PUBLIC MEETING**\n\nThe adjourned meeting called for the purpose of forming a fire brigade, took place in the Council Chamber last evening.\n\n**MEETING OF THE PARISH**\n\nThe parish meeting was held last evening.\n\n**MUSICAL INSTRUMENTS**\n\nAccordeons, Harmonicas\nViolins, &c., &c.\n\n**AT COST FOR CASH**\n\nCaledonia Brewery\n\n**EAST END**\n\nA. O. Patterson\n\n**ADVERTISERS**\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspaper Advertising Bureau, 100 E. 14th Street, New York City.\n\n---\n\n**THE PRINCE ALBERT TIMES**\n\n**FRIDAY, APRIL 8, 1887**\n\n**PARTY GOVERNMENT**\n\nA prominent member of the Toronto Weekly Press has written an article entitled \"Party Government,\" which contains some interesting observations. It is said that the party system is not only the best form of government, but also the most efficient.\n\n**EDITORIAL NOTES**\n\nThe question of Peace Alliance district are about to petition the Lieutenant-Governor for representation in the Legislative Assembly.\n\n**PUBLIC MEETING**\n\nThe adjourned meeting called for the purpose of forming a fire brigade, took place in the Council Chamber last evening.\n\n**MEETING OF THE PARISH**\n\nThe parish meeting was held last evening.\n\n**MUSICAL INSTRUMENTS**\n\nAccordeons, Harmonicas\nViolins, &c., &c.\n\n**AT COST FOR CASH**\n\nCaledonia Brewery\n\n**EAST END**\n\nA. O. Patterson\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nFrom the Bulletin, March 12th.\n\nG. A. Blake, of Belmont, shot a large white swan or American goose near his place last week. This bird is a native of the far north and is seldom seen here.\n\nThe assessment of the Edmonton school district for the year ending June 30th, amounts to $896,568, $223,873 being personal property.\n\nThe annual meeting of the Edmonton Bible Association was held at Mr. McTaggart's shop on Tuesday evening. The secretary read a communication from Col. Macpherson, stating that the deputation had received no answer to their petition concerning the sale of the association. It had been decided that an order for the necessary amount be sent to the association, and the money stored here on receipt, by the department of the price fixed. Also that the officers of the association be elected as would be allowed. Messrs. Stott and J. A. Macdonald were appointed auditors, and the meeting adjourned until next month, when they will meet as at the same place.\n\nDr. McKay, H. B. chief trader of the Slave Lake district, arrived from Slave Lake on Friday. He experienced a heavy snowstorm at the Athabasca Landing, but was enabled to proceed and met success at Slave Lake and horses are wintering out well. The moose and caribou country is reported to be in good shape, and there is plenty of game.\n\nA school meeting was held in Saskatoon district, on Monday last, at the call of the inspector of Catholic schools, Rev. Père Leduc. Considerable interest was manifested in the proceedings of the management of the district. He called upon the trustees to produce bonds for the school, which they refused to do. After somewhat animated discussion the meeting was closed and the inspectors returned to Edmonton. The Board of Education at Regina, he received an answer by telegraph that as soon as his complaints in writing were received a new election of trustees would be ordered.\n\nThe concert at Port Saskatchewan in aid of the school fund, which was attended, there being considerable delegations from Edmonton and Clover Bar in attendance. A short review of the programme was given in the schoolhouse, and refreshments were afterwards served in the Palace Hotel near by. The proceeds from one and above all places amounted to some $600.\n\nBATTLEFIELD.\n\nFrom the Herald of March 19th.\n\nA brigade of carts—pulled for the railway on the 19th.\n\nMessrs. H. F. Montgomery and Wm. Ferrier have been invited to pay a visit to their friends.\n\nAt a meeting of the Protestant School Trustees, held last evening Mrs. A. Macdonald, of this place, presented a cheque to fill the vacancy caused by Miss Buchanan declining to come here.\n\nThe contract for supplying limestone to the railway company for the purpose of making lime for the railway line between Battle-field and Clark's Crossing has been awarded to Mr. Topper, of Vancouver, and for the work between Clark's Crossing and Humboldt to Baptist Boyer.\n\nA train of freight, and on its movement continued by Mr. Fraser, came from Swift Current on Tuesday. Several hordes belonging to local merchants are about to leave. Freighters generally are getting ready to take the road as soon as there is a thaw.\n\nFORT MACLEOD.\n\nFrom the Gazette of March 22nd.\n\nA gun club has been formed at Macleod. Guns ball shooting will be the leading amusement of the club.\n\nA large get together was held on Wednesday night, seventeen carts on the road. About seven miles of the road was covered.\n\nRev. R. Hilton held service at Pincher Creek on Sunday. Mr. Bourne took his place at Macleod. Rev. Mr. Van Tienhoven held service at the Roman Catholic church, and Rev. J. McLennan at the Methodist church.\n\nArrangements have been made to build a Methodist church at Pincher Creek this summer. A building committee has been formed and the site selected, and it is expected that the building will be completed by September.\n\nA small flock of geese passed north over Macleod on Monday afternoon. So far we have heard nothing of the geese this season. These geese had not ordinarily been seen, for they were running their normal right into a snow storm.\n\nMacleod Creek is at length to have a postoffice.\n\nMEDICINE HAT.\n\nFrom the Times of March 20th.\n\nThe thermometer was only 65 degrees above zero last Sunday.\n\nFor the necessaries amongst us who have been away from home, two cricket clubs and several fast houses, we ought to put in a pretty lively summer amongst the Indians of this quarter.\n\nCapt. Norrie, for the past eighteen months in charge of the Mounted Police here, is about to be transferred to British Columbia.\n\nIt was on the 14th inst., that the ice broke up in the Saskatchewan river. What could the people have thought? That the first bit of ice was clear of the river this early season? However, they may consider themselves lucky if the six feet that remained on the river is all that should proceed in carrying out our plans once more.\n\nLast Tuesday Geo. Macdonald, while driving his team of oxen across the Deer ranch, came very near calling for a check for the other shore. At this season, however, the river is generally frozen over for a very large part of the year.\n\nThe Seven Persons River is inevitably high, though the river is not so high as usual. But George had no fear of what might happen to him.\n\nOn the 19th inst., Mr. Steele, an eastern territorial steel of sheep, by his method forth into the raging river, was swept away by the current.\n\n\"Prepared,\" says Hugh Dempsey, would say, may the capillary apparatus of the human system stand the pressure. The question of the sheep's capability could only be told in Mr. Macdonald's graphic style, and he yet fails to tell the story. The death of Steele was tragic in the extreme, and it is with a sense of pleasure that we hear that the sheep has been found on the North American continent that George and his steel, though separated by the water, have again met on this side of the Seven Persons.\n\nGENERAL NEWS.\n\nEx-Ald. Hartop, of Guelph, Ont., has abandoned the United States. His habitation is in Canada.\n\nEdward Turner, a young man who lived near Trenton, shot himself fatally with a shotgun yesterday. Dissipation seems to have been the cause.\n\nDavid Alexander Herbert, of Wm. Blair, was run over and killed by a Grand Trunk train near Steveston, on the 26th ult.\n\nThe question of the establishment of a Legislative Council of New Brunswick has been thrown out by a vote of 12 to 6.\n\nAt noon on the 26th May, Stanley Steele, of Manchester, N. S., started for Montreal's Bank, and thinking Mr. Carriere would be there, went in and asked to see him privately. When they got into the office Steele drew a revolver and pointed it at Carriere, who made a flesh wound only, and a struggle ensued during which Carriere was shot dead. A moment later Steele fell to the ground. A minute after the first shot was fired, and four men overpowered Steele. His poverty impelled him to attempt to rob the bank. Carriere's wounds were not serious.\n\nThe Governor-General of Canada has approved the charter of the Canadian Rock Lake, South Valley and Brandon Railway Company, passed by the Manitoba legislature.\n\nA bill in council has been passed, subjecting all patents issued by the Government for land and minerals to a clause rendering fishing rights.\n\nHeck's boat house, Toronto, was burned on the 26th ult. Loss, $3,000. A large number of valuable private pictures were stored in the building.\n\nA heavy gale on the 26th ult. blew down trees on the Island, Toronto, and damaged many buildings.\n\nThe directors of the various cemeteries, Toronto, have decided to close them against Sunday interments except in cases of extreme necessity.\n\nThe Court of Appeal, Montreal, has confirmed the judgment of the lower court, which declared legal the city by-law taxing a $250 annual ferry boat owned by the Longueuil Navigation Company. The appeal also concerned the judgment against the Canadian Shipping Company damages against the Toronto Mail for a libel contained in an article published 29th June, 1882.\n\nIn the arrival of the 350 Italian passengers of the steamer Beaver Scotia in the harbour late this morning and the 27th ult., the same that followed beggared description. They rushed into the Roman Catholic chapel seeking shelter for food like ravenous wolves. The force of the mass of people was so great that the officers who were present had to use their orders to keep the crowd back. The strong men crowded to the front with uplifted arms and their stern countenance seemed to say to the Italians, \"Bread, bread!\" It was impossible to regulate the distribution of food. The poor fellows were obliged to take milk and beer added to their portions.\n\nThen A. Harding, the tileworks stage driver, came among the ill-fated, most of whom sat on the deck, and offered them refreshment. He was joined by Ferguson, a coach driver, on May 29th.\n\nPat Gunnan and Mat Turney, baymen, came on board and offered assistance, saying they had been on the scene of the disaster at the Kansas, which arrived on the 23rd ult., fourteen days from Liverpool. The harvesters were most anxious and well with weight. All the food the two young men were able to obtain was the particles of flour that had been thrown on the cleaner, and all the water they could get was that furnished by the \"sweat\" of the steamer. They are both in a very critical condition.\n\nJackson Marion, the murderer of John Cameron, was hanged at Beattie, Neb., on the 26th May, 1882. He was born in Oregon in April, 1872, nearly fifteen years ago, while driving to Grasshopper Falls, Kansas, to work on the St. Joe & Denver railroad grade.\n\nSTRAYED.\n\nStrayed north from Humboldt, in November last a team of black ponies, one mare and two colts, aged three, four and five years old, brown, these animals lost across the prairie near the town of Humboldt. Also a Canadian mare, chestnut, with white star on forehead, aged three years old. Any person bringing the same to the owner will be handsomely rewarded.\n\nHUMBOLDT, May 26th, 1882.\n\nR. H. H. HUMBERTON, Stage Driver.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as any firm in Town.\n\nBuilders paying Cash or giving good security, LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL.\n\nThe Council met in the Council Chamber on Monday evening last.\n\nPresent—Couns. Stewart, Bain, and Couns. Bains, Stewart, and Redmond.\n\nThe minutes of the last meeting were read and adopted.\n\nMinutes of the last meeting were read from Harold E. Fish for use of the room in Council building, from J. W. Ford for use of the A. C. Band, and from J. C. McMillan for reference to the cemetery.\n\nSOMETHING.\n\nCoun. Stewart made notice that he would introduce a by law to build and repair sidewalks, and also a by law to secure No. 1.\n\nOn motion of Coun. Stewart and Bains, four months rent were ordered to be paid.\n\nMoved by Coun. Redmond, seconded by Coun. Bain, that the communication of W. E. Fish be referred to the Finance Committee.\n\nCOUNCIL.\n\nCoun. Stewart gave notice that he would move, at the next meeting of the Council, that application be made to the Board of Works to have land laid out at the north side of the river for a public park for the town of Prince Albert.\n\nMoved by Coun. Redmond, seconded by Coun. Bain, that the communication of W. E. Fish be referred to the Finance Committee.\n\nCOUNCIL.\n\nCoun. Stewart gave notice that he would move, at the next meeting of the Council, that application be made to the Board of Works to have land laid out at the north side of the river for a public park for the town of Prince Albert.\n\nMoved by Coun. Redmond, seconded by Coun. Bain, that the Court of Record be held on Monday, June 6th.\n\nCOUNCIL.\n\nMoved by Coun. Bain, seconded by Coun. Redmond, that the collector be instructed to pay the amount of taxes assessed on the lands of Mr. Carter.\n\nThe by law for establishing the town was read a third time.\n\nThe Council adjourned to meet on Monday, 11th inst., at 7:30 p.m.\n\nTHE MISSION SCHOOL.\n\nPROPOSITIONS.\n\nThe following are the propositions for the term ending March 31st, and are subject to the approval of the Council:\n\nStandards I to II.—George Johnson, Percy Pritchard, Agnes Oates, Charity Macintosh, John Pollock, Carl Pollock, Robert Pollock, William Pollock, Emma Keenly, Nellie M. Kay, Mary Gaudet.\n\nStandards II to III.—Lewis Macintosh, Albert Stewart, John MacIntyre, Mary MacIntyre, Virginia MacIntyre, John Gordon, Douglas MacIntyre, Winnie Campbell, William Goodfellow, Willie Carter, James MacIntyre, Duff MacIntyre.\n\nStandards III to IV.—Wm. McRea, Joseph McDonald, William MacIntyre, Henry Oates, John Roberts, Thomas Roberts, Helen Roberts, Bobbie Roberts.\n\nStandards V to VI.—Arthur Whyte, John McLeod, Ethel Graham, Martha Thomson, Eddie Jackson, Lucie Donald, Alice MacIntyre, James MacIntyre.\n\nNo promotions were made from Standards I to II, as the pupils have been absent school 20 days and over, for which a fine of $1.50 for each pupil is given by the Board of Education.\n\nIn future, any child who does not attend regularly and by this means are not able to keep up with the work, will be put back to the standard from which they were promoted.\n\nHis Blessing.\n\n\"It doesn't everybody I'd trust my little gal,\" said the farmer, \"but I'm glad to have this young stranger who had been charmed with Miss Sallie Skinner, and wished to carry her from the living card and into the grave.\"\n\nThis \"little gal,\" who was five feet and eleven inches tall, has her feet fast (as she thought) to the ground, and her blushing face on the dear, dear old farmer's shoulder, and kept happy tears as he spoke.\n\n\"You must take good care of my birdling, Jack. Remember that she's been raised kind of tender-like. Two and a half years, and she's never been out an acre of corn a day till all that she is used to doing.\n\n\"Take her light work, such as making rail fences, and digging post holes, and burning brush, and so forth, but don't let her do too much work. She mustn't ask too much of her. It's hard work for old dad to give his little Skinner girl a birdling. He hasn't got two cents worth of birdling left in his taters now. Eat go, little, and be happy.\"\n\nTed Fish.\n\nSUPREME COURT\n\nTARIFF OF FEES.\n\nCrown Prosecutions may, in addition to actual costs, be allowed, if incurred and paid, the following fees in civil actions cases (in addition to a summons)—\n\nIf defendant is a minor, $5.\n\nIf defendant is a corporation, $10.\n\nIn special cases the presiding judge may increase the latter fee to any sum not exceeding $20.\n\nIn other cases—\n\nIf undefended, $10.\n\nIf defendant, $25.\n\nIn criminal cases, the presiding judge may increase the fee to any sum not exceeding $50.\n\nIn any case of special difficulty and urgency, the Minister of Justice may allow such a fee as he deems an adequate compensation for the services rendered.\n\nSummons may be allowed for the following—\n\nIn civil actions—\n\nFor summoning a party—each process, $1.\n\nFor executing processes executed and returned to the court (examiners of instruments) per day about $1.\n\nActual necessary disbursements in connection with serving and executing civil processes.\n\nFor superintending execution in capital cases, each execution, $10.\n\nActual and necessary disbursements and expenses connected with the levy of any execution, $1.\n\nFor executing any warrant, $2.\n\nFor levying money or other property by distress warrants. The same percentage of the amount realized shall be allowed as actual costs.\n\nFor salvage—\n\nFor salvage, the usual amount necessarily disbursed.\n\nIn other cases—\n\nFor every note necessarily traveled,\n\n$1.\n\nIf in any case the latter fee does not cover actual and necessary expenditure, a judge may allow such a sum as will cover the expenditure.\n\nCircles of the supreme Court:\n\nIn full for all services rendered for the Crown—\n\nFor each day's attendance, in person or by deputy, at a Court while actually engaged in the discharge of duty, $5.\n\nCounsel may be allowed the following fees—\n\nTo appear by summons, jury, $10.\n\nTo appear by judge, $10.\n\nSummoning a witness, each $10.\n\nExamination, deposition, or examination of witness, each $10.\n\nTaking every recognizance, $5.\n\nTaking every recognizance to appear, each each way, $5.\n\nTaking examination and making return, $5.\n\nEvery warrant for arrest if necessary.\n\nFor post mortem examination if actually necessary and actually made, $10.\n\nJustice of the Peace—\n\nFor every warrant, a judge in criminal cases to be paid for each day actually engaged, $5.\n\nWitnesses and Jurors—\n\nWitnesses and jurors may, in criminal cases and appeals, be allowed the following fees—\n\nFor every day necessarily absent from their usual place of abode, making an affidavit, and returning to the Court, $5.\n\nFor every mile necessarily traveled by other means than railway, $1.\n\nWitnesses may be allowed, in case paid, additional mileage when testifying and residing in addition to mileage as other witnesses, per day, $1.\n\nInterpreters necessary, in capital cases only, to be paid, in addition to the same mileage as witnesses, and for each day actually engaged as interpreters, $5.\n\nWitnesses may be allowed at the instance of a Judge, may in criminal cases be paid the following fees—\n\nFor first copy of evidence, per folio, $1.\n\nFor additional copies when required, $1.\n\nIf any preliminary investigation before magistrate or justice of the peace is held at the instance of the Crown, the same fees and charges may be allowed as for a hearing.\n\nNo tax or charge payable by the Crown shall be paid until certified as correct by a Judge, and by the Crown prosecutor if a Crown prosecutor is employed.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nCARD\n\nTo the Electors of the District of Saskatchewan.\n\nGENTLEMEN—\n\nAllow me to thank you very respectfully for the high honor you have done me in electing me as the first representative of our District in the Dominion House of Parliament. The responsibility of the position is great, and it will be my endeavor so to act as to justify the great confidence you have reposed in me.\n\nI am, Gentlemen,\n\nYours very respectfully,\n\nD. H. MACGOWAN.\n\nGO TO CANN'S BOOK STORE\n\nFOR Stationery, School Books, ETC.\n\nAT FISH'S.\n\nBARGAINS\n\nFor Our Money We will sell at a Big Reductions Sale room for Spring Stock.\n\nJUST ARRIVED,\n\nTeas, Sugars, Soaps, Butter, Etc.\n\nW. R. FISH,\n\nRIVER STREET\n\nBUFFALO HALL!\n\nGRAND STOCK-TAKING SALE\n\nNOW GOING ON\n\nDry Goods, Clothing And Groceries\n\nALL REDUCED IN PRICE.\n\nDETTYS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware,\nHouse Furnishing hardware\nCarpenters's Tools,\nPaints and Oils,\nBarbed Fencing Wire,\nStoves and Tinware.\n\nALSO A FRESH STOCK OF\nGroceries, Teas,\nTobaccos, Etc.\n\nCALL AND GET PRICES.\n\nJ. R. McPhail.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT CHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Rose, Yellow and Maroon, Green and Yellow, Door Mat, Curtain Cloths, Silk Corded Cushions, Empress Ochre in Black and Garnet.\n\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Fillings Beecore Veiling, Ladies' Silk Ties, Timel, etc., etc.,\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Tinned Goods of all kinds inspection is solicited.\n\nRUSSELL & DAVIS, PRINCE ALBERT\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBREWERY.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham and\n\nGAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nDelivered to all Parts of the Town.\n\nRUSSELL & DAVIS,\n\nBROWNS BRICK STORE\n\nAMBER--Hop--ALE,\n\nDelivered to all Parts of the Town.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887040801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5718, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3199, 2], [3199, 13784, 3], [13784, 23198, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]