[{"id": "81a74409489a5a90cfe398babc083e25f423297c", "text": "The Prince Albert Times and Saskatchewan Review\n\nPublished by J. D. Maveety\n\nPrince Albert, N.W.T.\n\nNotice\n\nCall and inspect our improved Heating Drums\n\nStoves and Stovepipes put up and cleaned on short notice\n\nPanel Doors and Sash,\n\nT. J. Agnew's\n\nT. N. Campbell\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Repua, Window Holland in Slate and Yellow, Door Matts, Crumb Cloths, Silk Corded Cloakings, Emblems (for inlaying) and Garnet, First Cornerstones, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Beecoe Veiling, Ladies' Silk Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nThere is also a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Pigs, Dates and Tinned Goods of all kinds inspection is solicited.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling\n\nAMBER—(Hop)—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERRON\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Rowell & Co.,\n\nNewspaper Advertising Bureau,\n\n10 Supreme St., New York.\n\nSend 100 for 100 pages Pamphlet.\nFrom the Leader, Sept. 27.\n\nWagons loaded of citizens have been bought in Madeko at least from three to seven times their present value.\n\nNearly fifty delegates have signified their willingness to attend the Agreed at Corunna meeting, and there are expected to respond favorably.\n\nSheriff Root, of Fargo County, who was present, said the money was the most wanted in the county by far.\n\nFour hundred ballots were cast; the year's tax was 3 per cent, and the proposed new scheme was already delivered at the barracks.\n\nFrom the Journal, Sept. 29.\n\nThe election returns presented by the Assiniboia Agricultural Society are attractive, and attention is asked east and west on this line, as the results will be brought to town next week.\n\nFive hundred dollars worth of wheat this year's crop on a spring plow will be delivered already delivered at the barracks.\n\nFrom the Leader, Sept. 27.\n\nThe fall round-up is going on in the cattle district. It was reported last Thursday that there were thirty-eight cows killed at Packer's camp on the banks of Chateau river.\n\nA party of policemen was out doing Sunday night looking for whisky. They discovered a grog-shop in the same locality.\n\nAnother Roman Catholic Bishop is likely to be appointed to assist His Lordship Bishop Grondin. It is not known as yet who the new Bishop will be.\n\nRecked in at last to save a run mill.\n\nIn town superintending the erection of it. The house was being sold yesterday.\n\nOn Saturday last the members of the Roman Catholic Church of Indiana were particularly interested in the work of the press. Basil Shield, a member of the Board, examined some newspapers critically, and stated that although they thought of the whole thing, he said that he thought that the whites were the best of the Indians living in the territory.\n\nOne or two days ago the Indians made an attempt to go out to work and run a newspaper for them on the Goulter farm.\n\nThe question on the border in full force. The regulations are in brief as follows: Horses, mules, sheep and hogs may be purchased locally; those found without local supplies must be destroyed immediately if they have been shipped into the state.\n\nThey must keep their animals and fowl quarantined at all times.\n\nEskimos were taxed for the first time.\n\nA lot of people on the boat from Harriswood said they would never vote for Mr. Britton again.\n\nEDMONTON.\n\nFrom the Bulletin, Sept. 17.\n\nMr. Macdonald has been remembered for a brief biography in the Bulletin, which appeared in the morning edition of the Bulletin.\n\nThe District of Alberta has been constituted by the Grand Lodge of Catholics.\n\nGeo. Longt of the Starlight, shows an excellent sample of red fire wheat, which he has five acres entirely under cultivation.\n\nWork is being pushed on the Alberta lumber company's mill at Red Deer, giving employment to the settlers in the surrounding district.\n\nD. Ross of the Elmendorf Hamlet has met with success from the beginning of the season for his market garden, which measure five acres under cultivation and are well filled.\n\nThe agricultural exchange and trading school at Medicine Hat, has now once again been opened, and quite a number of persons have attended.\n\nJ. D. Hutchison lately cut a field of oats, and so tall that the harvest絺eeder could not reach it, near the top of the grain and requires that the thresher be sent to aid him, as he could not get it off even with the most powerful draft, as he had but two horses and the manure was very high.\n\nAfrica. From the News, Sept. 28.\n\nWork has been commenced on the new Presbyterian manse. The foundation was laid about two weeks ago, and the contractor is only waiting for the builder to be able to proceed with the work.\n\nThe fall round-up is going on in the North-West Territories. Work on the railway cannot be started until the spring, owing to the intense cold.\n\nWEST YOKOTA.\n\nMr. B. M. Collins, storekeeper.\n\nMoore & Macdowell requested to engage the services of a young farmer for the purpose of learning the business in his store.\n\nMr. Geo. Callaghan came down from Macleod on Saturday evening and will be here soon to take the vacancy left by Mr. Adamson, who leaves for California shortly.\n\nCol. and Mrs. Macleod arrived from Macleod where they have been spending their vacations so far, Monday evening's train. They went up to Macleod on Wednesday.\n\nMACLEOD.\n\nAt the request of a number of influential citizens of the district, I have decided, on the advice of my friend Mr. James McEachran, to commence at once the publication throughout the district of a list containing the names and addresses of all those who have been employed in the recent war by the United States government.\n\nAt the request of a number of influential citizens of the district, I have decided, on the advice of my friend Mr. James McEachran, to commence at once the publication throughout the district of a list containing the names and addresses of all those who have been employed in the recent war by the United States government.\n\n$25 per annum\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY.\n\nPublisher and Proprietor.\nBUFFALO HALL!\nTO HAND THIS WEEK:\nSongs and Wit Shirts.\nBLACK and ASHALL SHIPBOYS,\nBUCKSKIN COATs and JACKETS,\nPURFEE'b LACE CURTAINS,\nCERAMIC.WITH TERMS!\nTAPETRY TABLE COVERS.\nKNOCKER FOR INSIDE.\nNEW AND READY FOR ADJOINING.\nBETTS & Gwynne.\nESTABLISHED: 1879.\nUPRIGHT AND BOX HEATING STOVES\nFROM THE PLAINSTEST TO THE MOST ELABORATE DESIGN.\nHEATING DRUMS IN GREAT VARIETY.\nAMERICAN COAL OIL.\nJ.R. McPhail.\nCLEARING SALE!\nNUNS' VEILING, MEROO, GINGHAM'S WANCHEES, BOYS' JERSIE SUITS.\nTHE ABOVE WILL BE SOLD AT A CLOSE MARKUP ON COST.\nPillow Cotton and Twilled Sheeting.\nR.C. Wigmore & Co's.\nRobertson & Robertson.\nMerchant Tailors.\nGENTS FURNISHINGS.\nA LARGE STOCK OF Imported Tweed Suitings.\nWVBSTERS, TROWSELING AND OVERCOATING.\nCANADIAN TWEDRS.\nSUMMER SUITINGS IN ENGLISH AND AMERICAN LINES.\nSATISFACTION AND ITS QUALITY GUARANTEED.\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887101401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 1948, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1431, 2], [1431, 6712, 3], [6712, 7569, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]