[{"id": "8d1b9847173307cd90e69ffe6dbbf2dfa44f8dd7", "text": "THE PRINCE ALBERT TIMES\nAND\nBASKETRACK REVIEW.\nPUBLISHED BY\nJ. D. MAVETY\nPRINCE ALBERT N.W.T.\nPRINCE ALBERT—The paper is in advance.\nFRIDAY, MARCH 4, 1887.\nTHE LIBERAL PARTY AND THE NORTHWEST.\nIt is said of Sandfield Macdonald, that on receiving an invitation to visit the Northwest he answered by replying to Mr. Blake, \"I have nothing to do with Strathcona; what has Strathcona to do with me?\" So now, that the Liberal party has been invited to visit the Northwest, are we justified in asking, \"What has the Liberal party done for the Northwest?\" Why should we invite Mr. Blake in? Why should we invite Sir John Macdonald? What claims has Mr. Blake upon us? Why should Mr. Blake keep faith with the British Colonists? Mr. Blake, whose \"sole policy\" would not have been completed during this century, who made the Northwest a \"sterile waste,\" and endeavored to shirk that nobody could vote for the country by inviting Macdonald and Macdonald, and Blake, for proof of which refer those who may question it to the pages of the Hansard of October 15th and 16th, especially page 1634. For two days thereafter, Mr. Blake endeavored to prove that the Northwest was only fit for Indians to live in. It is true, Mr. Blake has been endeavoring to change a charge, but only since he made a trip to the Rockies over a railway built by the Liberals, and through Liberal party, and through a country they had characterized as a \"sterile waste.\" Mr. Blake has changed his mind with regard to this country, but it is possible that he has not yet seen its merits of settlement. But it should be remembered that the pioneers and late settlers of this country owe Mr. Blake nothing. He has never been here himself, and he has not been west of Ontario, and he has not the confidence of any of that Province. On the other hand, Sir John Macdonald, Sir Charles Tupper, Sir Hector Langevin, Sir Adolph Gordon, Hon. Thomas White, Hon. John Scott, Hon. John Costigan, Hon. Mr. Foster, and other members of the present Government have been here, and visited the British Colonists, and are not only conversant with the wants of the Northwest, but are determined to see that these wants are heard by the North- west despite the opposition of Mr. Blake. No man is more desirous of the good of the Northwest than the Territorial Lord, Sir John Macdonald. No man has brought his natural schemes to greater fruition than he. If Sir Macdonald is not to be said of Saskatchewan, let it not be said of you that you chose another to follow your vote in support of Mr. Blake, that statesman whose life has been devoted to the service of his country, whose name is linked with the greatest national work of any age, and will shine a lasting name our history for all time to come.\n\nVote for Sir John, the friend of the Northwest.\n\nA WORD TO THE MEN.\nWe wish to assure you that the time is approaching when we will all have to decide whether we shall be represented in the House of Commons, to give our reasons why we think our votes should go to the Man who should vote for Mr. Macdonald in preference to Mr. Laird. As they well know, Mr. Laird has been a resident of this district nor does he propose to reside here. He simply proposes, if elected, to visit the district occasionally. He has not one cent invested in the country. He has not been in the country for five years. He is a Canadian, but he lives in a part of Canada nearly as far east of Ottawa as we are west of that point. He was Minister of the Interior for three years, but neglected the interests of the Northwest. We believe that the Hon. David Milne, did likewise. As Lieutenant Governor of the Northwest, Mr. Laird has visited this city, but he has not paid. Any gentleman of average ability could fill his position with credit. Mr. Laird, however, thinks that he can. More than this, he comes here on the invitation of the party opposite. Sir John Macdonald, the Premier of Canada. He comes here on the invitation of the party who, as Archibald Taylor says, in connection, mention of death and banishment of the Metis chiefs, and for the failure of the Government to pay them, has been offered before and which we have refused. The men who could do these things are the ones who should be here, and to which Mr. Laird belongs. He comes here on the invitation of the party opposite. Sir John Macdonald, the Premier of Canada. He comes here on the invitation of the party who, as Archibald Taylor says, in connection, mention of death and banishment of the Metis chiefs, and for the failure of the Government to pay them, has been offered before and which we have refused. The men who could do these things are the ones who should be here, and to which Mr. Laird belongs.\n\nM. N. W. in connection with this point are many. By coming here the Company will not only secure the business of the district, but will be able to open up the trails of Battleford and Edmonton during the summer season by placing their goods there. They will also be able to procure Edmonton coal at a much cheaper rate than the present rate. The coal is of good quality, if not better, quality. In fact the advantages to be gained by the Company are making themselves felt in every quarter, and so great that we think the railway cannot be built too rapidly.\n\nVote for Mr. Macdonald and a real friend of the Northwest.\n\nT. J. AGNEW'S.\nT. N. CAMPBELL.\nJUST RECEIVED A LARGE STOCK OF\nMUSICAL INSTRUMENTS\nAccordeons, Harmonicas\nViolins, &c., &c.\nGames of all kinds. Progressive Games with Tally Cards, Gold and Colored Tokens complete. Chess, Checkers, Dominoes, and a large variety of Roman Games.\nLATEST NOVELTIES IN TOYS,\nWHICH FOR THE NEXT WEEK I WILL SELL.\nAT COST FOR CASH.\nTHE WEST END STORE\nJUST ARRIVED,\nNEW GOODS\nAT\nCHAS. MAIR'S WEST END STORE,\nNun's Veiling in Cream and Light Shades, Persian Polar Rugs, Tapestry Carpets, Crimson Reps, Window Hoods in Slate and Yellow, Door Mats, French and English Curtain Hangings, Empress Cloth in Black and Garnet, Fine Cretonnes, Ladies' Felt and Embroidery Patterns, Ladies' Fancy Fillings, Breezy Veiling, Ladies' Silk Ties, Tinsel, etc., etc.,\nALL AT LOW PRICES.\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates, and Timmed Goods of all kinds.\nSTOVES!\nA Further Reduction of 20 per cent. will be given on all\nBOX AND PARLOR STOVES\nRemaining on hand.\nCamp Stoves and Piping\nAT BOTTOM FIGURES.\nI have a first-class workman, and will execute all orders for Smith's work with promptness, and guarantee satisfaction.\nHARDWARE!\nA FULL STOCK.\nJ. R. MCPHAIL.\nADDRESS\n\nTo the Electors of Saskatchewan.\n\nGentlemen:\n\nAt the request of a number of residents in the District of Saskatchewan, I beg to offer myself as a candidate for your suffrages at the coming election as a member of the Federal Parliament.\n\nShould I be returned as your representative I shall use every endeavor to secure the local interests of the District, and shall urge on the Government the necessity of pushing the Railway connection from Prince Albert, Bathurst, and Saskatoon.\n\nThe building of a bridge across the Saskatchewan River.\n\nThe granting of assistance to the railway to Hudson Bay.\n\nThe more liberal issue of scrip to all children of Halfbreed heads of families born in the Territories between 1870 and 1885.\n\nThe recommendation of the permit system to the liquor question.\n\nThe speedy payment on a liberal scale of all just claims against the Government.\n\nThe granting of seed grain free of charge to the poor.\n\nThe purchasing of supplies for public purposes in the district in which they are consumed.\n\nThe formation of a Legislative Assembly for the Territories in which Saskatchewan shall have full and proper representation.\n\nA man whose main interests are closely identified with the future of Saskatchewan, I appeal to every elector in the district for support during the contest.\n\nI am, gentlemen,\n\nYour obedient servant,\n\nD. H. Macdonald.\n\nAux Electeurs du District de Saskatchewan.\n\nMessieurs :\n\nÀ la demande d'un nombre d'habitants du District de Saskatchewan, j'ai bien l'honneur de m'offrir à vous comme candidat pour votre suffrage dans l'élection prochaine d'un membre pour le Parlement Fédéral.\n\nDans ce cas où je serais élu, je recommande vivement les mesures suivantes :\n\nLa construction d'un pont sur le fleuve Saskatchewan.\n\nLa distribution de subventions pour le chemin de fer vers le golfe de Hudson.\n\nLa plus large distribution de billets de scolarité aux enfants des familles de tête de famille nées entre 1870 et 1885 dans les Territoires.\n\nLa recommandation du système de permis pour la question de l'alcool.\n\nLe paiement rapide et généreux des dettes de l'État.\n\nLa distribution gratuite des graines de semence aux habitants du territoire.\n\nLa formation d'une Assemblée législative pour les Territoires dans lesquels Saskatchewan sera pleinement représentée.\n\nUn homme dont les intérêts sont étroitement liés à l'avenir de Saskatchewan, je me tourne vers chaque électeur du district pour son soutien pendant la campagne.\n\nJe suis, messieurs,\n\nVotre obéissant serviteur,\n\nD. H. Macdonald.\nELECTION NOTES.\n\nA meeting of Mr. Macdonald’s Central Committee will take place tomorrow night at Sir John Macdonald’s residence. The standard joke of the campaign is to get two groups together and ask them to define their Liberal principles. It rarely leads to a split in the party.\n\nVote for a member of Saskatchewan, and F. E. Land Seabrook.\n\nThe Detroit Evening News says: “The article in the Standard of Toronto, to which Sir John Macdonald ought to be attached, has become inflammatory, and will endanger his popularity. He has been accused of seeking to force down the pay of workingmen, and his concessions have been interpreted as leading to a decline in public services. Mr. and Mrs. Peter Burrows, therefore, urge Macdonald not to yield further concessions to the Labour policy.”\n\nMME POLE MOFFAT ADDRESSES THE CROWD.\n\nMrs. Pole Moffat addressed the crowd at the railway station yesterday afternoon, and praised Mr. Lafontaine’s speech. She said: “We are all united against Mr. Lafontaine’s attacks on domestic duties.” Mrs. Moffat also spoke in favour of the Liberal party, and ended her address by saying: “Mr. Lafontaine’s remarks were offensive to women, and we shall unite to oppose him.”\n\nGO TO CANN’S BOOK STORE FOR Stationery, School Books, etc.\n\nELECTION NOTICE.\n\nElectoral District Affairs of Saskatchewan.\n\nInformations pour les Élections.\n\nMay be had without delay through the members of the electoral division affecting the district that a poll has been granted for the election of persons to represent the constituency of Southland.\n\nTuesday, the 15th day of March, at noon.\n\nThere will be a special session for the purposes of the party at the Union Hotel, Fort William, which will be held at 3 o’clock.\n\nHon. William Wells Pretorious, M.M., Minister of Public Works.\n\nPolling Division No. 6 - Comprising township 44, range 7; townships 45 and 46 west of 2nd meridian; townships 47 and 48 east of said meridian; polling stations, Ontonagon, Bobcaygeon, Barrie, Compass. Polling Division No. 7 - Comprising townships 49, 50, 51 north of Township of Willow River; townships 47, 48, 49, 50, 51 south of said meridian; Canadian Pacific, Parry Sound; Gerrard.\n\nPolling Division No. 8 - Comprising township 52A, range 4; townships 53 and 54; townships 52B, range 2; townships 51, 52, 53 north of Township 52A; townships 51, 52, 53 south of said meridian; Randlebaug, Shoeburyness, Warderokesmer.\n\nPolling Division No. 9 - Comprising townships 57A, B, C, range 6; townships 56, 57, range 5; townships 55, 56, 57, 58, west of 2nd meridian; towns, New Cobourg, Cobourg, Bancroft, Winona, Waterdown, Port Hope, Prince Edward County.\n\nPolling Division No. 10 - Comprising townships 61A, B, C; townships 60, 61, range 4; townships 63, 64; townships 41, 45, 46, east of 2nd meridian; settlements, Cobo, Norwood, Cobourg, Embro, Prince Edward County, Berwick.\n\nPolling Division No. 11 - Comprising townships 65A, B, C; townships 64, 65, range 3; townships 62, 63, 64, west of 2nd meridian; settlements, Brockville, Smiths Falls, Frontenac, Picton, Campbellford.\n\nPolling Division No. 12 - Comprising townships 68, 47, 48; townships 67, north of said meridian; Kemptville, Whitney-Microsales, Doncaster, Laird.\n\nCANADA-ROYAL BAKING POWDER.\n\nAbsolutely Pure.\n\nJOIN ANGLO-CANADIAN YOUTH CLUB.\n\nMeetings are held every Thursday night at the Toronto Club, 201 Yonge Street.\n\nChief Judge Richard has accepted the resignation of Mr. Justice Brownlee. Mr. Justice Clifford Williams has been appointed to fill the vacancy.\n\nThere is a rush to enrolment in the regiment now forming. Those who have not yet entered can do so by attending the enlistments at any of the recruiting centres.\n\nPay-day is Thursday, March 7. All absentees should present themselves.\n\nRussell & Davis, Wholesale & Retail Butchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and Game in Season.\n\nBranch Stalls - Qu’Appelle Station, Morley Station, Fort Qu’Appelle, and Prince Albert.\n\nMail Contract.\n\nSEALED TENDERS addressed to the Secretary, Royal Canadian Vault, Inc., should reach him by March 12th. Contractor for drilling adist the length of Montreal River (Fort Fraser) on March 12th, 1887, shall receive a contract worth twenty-eight hundred dollars.\n\nMail Manager, Westend, to report Tuesday evening next.\n\nSEALED TENDERS, addressed to Mr. Smith, Town Clerk, Hay River, Alta., by March 9th, 1887, shall be accepted for the Tuckler-tone mail goods to be sent March 21st; also tenders are requested for making contracts for flour, sugar, salt, tea, coffee, pink soap, and miscellaneous items.\n\nALEXANDER SPURLING.\n\nProvince Agent.\n\nBusiness Mart at Prince Albert on April Fool's Day.\n\nW. W. McLORIN, Post Office Inspector's Office, Winnipeg, July 17th, 1887.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, Chicago, Ill., and Pay $100 for 100-pg Pamphlet.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887030401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3660, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6575, 2], [6575, 9114, 3], [9114, 14064, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]