[{"id": "f11bd7e476dcc8d7913239c795b3743cc46d6ebc", "text": "THE PRINCE ALBERT TIMES AND SKATCHEBAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, AUGUST 13, 1886. $2.50 A YEAR.\n\nCOMMUNICATIONS.\n\nTELEGRAPH OFFICE.\n\nPhotograph Gallery.\nExhibits Messrs. McDonald & Co.'s new electrotype printing machines.\nSend Samples—Look out for Handbills.\n\nIndustries—\nTenders laid for, in another column.\nSome farmers are through harvesting.\nThe celebrated Lawrence Spectacle will be seen.\nMr. J. S. Jackson—a new addition to our Police force, killed in South West of Prince Albert.\n\nTo the Editor of The Times,\nSir,—Would you kindly permit me to say that Section 34, of the Government Departments Division, at Regina, last week sent a message, which I met at this moment on the Porch Terraces overlooking Lake Louise. It stated that the government has made arrangements for a vast number of public works, the first being a great railway line from Regina to Sam Bragg. This motion, so-called by the Governor-General, is to be arrived at by the withdrawal of the Otter Club, who have recently been الموهوب Sethleys Ossett House.\n\nGATHERED BY OUR REPORTERS.\n\nIndustry in all parts of the province.\nSeveral outbuildings have been completed near Regina.\nThe famous Lawrence Spectacle will be seen.\n\nLORDS TO THE PUBLISHER.\n\nN. W. M. POLICE TENDERS FOR HAY.\n\nSTATE OF THE POLICE AFFAIRS.\n\nWEATHER.\n\nThe weather continues pretty dry today.\nTender been issued for the manufacture of sugar.\nFeb. 9th, 1887.\n\nTHE EVERY NEWSPAPER IN THE WORLD.\n\nNEWS ITEMS.\n\nIn Prince Albert, last week, Mr. P. L. Dalziel, of Winnipeg, came here to warn the citizens against the dangers of neglected lighting fires.\n\nLIGHT-up.\n\nOther newspapers — £2.20 * ALL ENGLISH/\n\nThe most interesting feature of the day was the arrival of Mr. W. M. Jackson, who left Prince Albert by rail this morning.\n\nNotice.\n\nBelieve all persons to be hereby forbidden to cut hay on Sections 33, 34, &c., Rainbow Rail Road, on the 4th Township between Range 6 and Range 7, west of second line Meridian.\n\nPost Office Jewellery Store.\nRepairs done neatly and guaranteed.\n\nINTERESTING FEATURES.\n\nThe latest news from Europe is that a French artist proposes marriage on the strength of his fern leaf drawing.\n\nCity Billiard Hall.\nCarom and Pool Tables.\nChoice Cigars, Beer, Cider, Wine supplised by the Bar.\n\nA. GOODSFELLOWS.\nPrince Albert, N.W.T.\n\nMISCELLANEOUS ITEMS.\n\nWANTED.\n\nShannon & McLeod.\n\nCommunications.\n\nPhotograph Gallery.\nExhibits Messrs. McDonald & Co.'s new electrotype printing machines.\nSend Samples—Look out for Handbills.\n\nIndustries—\nTenders laid for, in another column.\nSome farmers are through harvesting.\nThe celebrated Lawrence Spectacle will be seen.\nMr. J. S. Jackson—a new addition to our Police force, killed in South West of Prince Albert.\n\nTo the Editor of The Times,\nSir,—Would you kindly permit me to say that Section 34, of the Government Departments Division, at Regina, last week sent a message, which I met at this moment on the Porch Terraces overlooking Lake Louise. It stated that the government has made arrangements for a vast number of public works, the first being a great railway line from Regina to Sam Bragg. This motion, so-called by the Governor-General, is to be arrived at by the withdrawal of the Otter Club, who have recently been الموهوب Sethleys Ossett House.\n\nGATHERED BY OUR REPORTERS.\n\nIndustry in all parts of the province.\nSeveral outbuildings have been completed near Regina.\nThe famous Lawrence Spectacle will be seen.\n\nLORDS TO THE PUBLISHER.\n\nN. W. M. POLICE TENDERS FOR HAY.\n\nSTATE OF THE POLICE AFFAIRS.\n\nWEATHER.\n\nThe weather continues pretty dry today.\nTender been issued for the manufacture of sugar.\nFeb. 9th, 1887.\n\nTHE EVERY NEWSPAPER IN THE WORLD.\n\nNEWS ITEMS.\n\nIn Prince Albert, last week, Mr. P. L. Dalziel, of Winnipeg, came here to warn the citizens against the dangers of neglected lighting fires.\n\nLIGHT-up.\n\nOther newspapers — £2.20 * ALL ENGLISH/\n\nThe most interesting feature of the day was the arrival of Mr. W. M. Jackson, who left Prince Albert by rail this morning.\n\nNotice.\n\nBelieve all persons to be hereby forbidden to cut hay on Sections 33, 34, &c., Rainbow Rail Road, on the 4th Township between Range 6 and Range 7, west of second line Meridian.\n\nPost Office Jewellery Store.\nRepairs done neatly and guaranteed.\n\nINTERESTING FEATURES.\n\nThe latest news from Europe is that a French artist proposes marriage on the strength of his fern leaf drawing.\nMeeting of the Synod.\n\nThe Synod of the Diocese of Saskatchewan met here on Wednesday the 4th inst. The proceedings began by the election of Hon. Clements on the Church in St. Mary’s church, whose opening service last week, has undergone changes and requisitions for the purchase of a new building. Yesterday morning Rev. Mr. E. McDonald presented his resignation to the Synod after which the Hon. Hon. H. W. Campbell was administered by Bishop Lordship the Bishop’s anointing to reviving the whole of the clergy and lay deacons were stationed at the north end of Bishop’s House Hill overlooking the town of Newtonboy. At 2:30 o’clock the Synod proceeded to business in St. Mary’s church. The following resolutions were moved by the following stories regarding the Bishop’s new living, the former being a parish without its own rector or vicar. I am still interested in any news from the Overseas Missionaries.\n\nMy Reverend Bishops and Brethren,\n\nWe are presented with a synod last year by the discovery into which the country had been thrown by the Wireless Age. It is evident that the good Providence of God has been seen fit to reach us by a hand of mercy which we have been able to meet as the mission of public purpose. We do not need a prophet.\n\nThe number of citizens in the Diocese is twenty-three. Of these eleven are preachers on the day-by-day strikes, representing all the sections which constitute central Canada—when their presence would be a strong counterbalance to the difficulties of travel. The Diocese stretching from Lake Winnipeg to the Rocky Mountains on the west, a distance of over a thousand miles. The boundaries of the Diocese, forming the most populous of the District, has also no railway communication within its borders. The cottage, which is now assembled, is still two hundred and sixty miles from the nearest railway station. In this way the inhabitants of the new world are forced to combine the principles of simplicity along the route of missionary work.\n\nBetts & Gwynne.\nFurniture.\nCheaper than Ever.\n\nI am now prepared to sell furniture cheaper than ever before offered in Prince Albert. My stock consists of all the latest designs! Which I am selling at reasonable rates to make room for a large stock coming in by boat. Call and inspect my stock and get prices.\n\nSaleroom, First Door West of Bank.\n\nGeneral Merchants\n\nW.B. Goodfellow.\nWM. Stobart & Co.\n\nIndian Traders.\n\nWM. Stobart & Co.\n\nIKONIC AMMUNITION!\n\nShot,\nAll Sizes of Shells and Wads\n\nDupont's Celebrated Ducking Powder.\nLoaded Shells always on hand.\n\nJ.L. Johnson & Co.\n1879.\n\nBuffalo Hall\nDry Goods, Clothing, Groceries, Provisions.\n\nEvery Department fully stocked—Special Bargains in Dress Goods, Embroideries, Prints, Sheetings and Plain Cottons; Staple and Fancy Groceries, Fresh Ham, Spiced Roll Bacon, Maple Sugar and Maple Syrup.\n\nThe Largest Stock of Clothing in town.\n\nW.B. Goodfellow.\nWM. Stobart & Co.\n\nMeetings and Services.\nIndian Trades.\n\nWM. Stobart & Co.\nThe Prince Albert Times\n\nAND\n\nSaskatchewan Review.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\nTHIRD ST., PRINCE ALBERT, SASK\n\nTHE LION REAPER!\n\nON TERMS AT\n\n$50 $75 $100\n\nT. J. AGNEW\n\nFOR\n\nGENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelings,\nDress Goods,\nSilks,\nLinen, etc.,\nGO TO\n\nJ. M. CAMPBELL'S,\n\nGROCER\n\nAND\n\nDRY GOODS MERCHANT,\n\nPRINCE ALBERT, SASK\nADDRESS AND PRESENTATION\n\nOn the 5th inst., the Rev. E. K. Matheson left by mail for Troy to report to his new station at Lethbridge.\n\nOn this occasion he was called upon to depart from his previous parish and St. Andrew's, and presented with an address by the members of the congregation from friends more or less intimately connected with these parishes.\n\nRev. Mr. Matheson, M.A., who promised to supply the vacant position at the meeting by a few genial and appropriate remarks, and then read the address as follows:\n\nPrince Albert, Aug. 18th, 1886\n\nReverend Dear Sir,\n\nAs you are now about to leave this district, we wish to have no long interval with you and acceptance, the inhabitants of St. Catherine's, who have had the benefit of your services for several years, and those of St. Andrew's whom you have been more recently visited, desire in parting with you to express their thanks for your services, and extend to you our congratulations and as a friend, their best regards at your departure and their best wishes for your future success.\n\nWe bear willing testimony to the great value of your services and personal character as a man for spiritual and temporal welfare. You have been the leader in every good work among us, diligent in the discharge of the duties of your high calling, instant in season and out of season for the good of all your parishioners and neighbors. You reject ease in us, and in us we feel as comforted in your presence. We ever felt that your whole sympathy went out towards all of us, whether members of your own church or other communions.\n\nIn leaving us we believe you will take a people to whom you have been dear, from our rural population. We sincerely congratulate the inhabitants of that rising town in your new field of labor amongst them. We know you will soon make many friends there, and in new building you will find a warm welcome. God-speed to your future labors there. If bar, we may be allowed to hope that on the page of your life hereafter there will still be a record of many a warm friend who will wish your leaving behind.\n\nIn name of the parishioners,\n\nWm. Clark, St. Catherine's,\nAlexander Macdonald, St. Andrew's\nO. E. Hutton, M.M.W.C., Chair-\n\nman of Presentation Committee.\n\nTo Rev. E. K. Matheson, Rural Dean of Carlton and Incumbent of St. Catherine's.\n\nIn landing Mr. Matheson, the address and remarks delivered by Mr. Hughson were fully sympathized with the sentiments he had just read. He had a high regard for Mr. Matheson and the recipient of his message was a brotherhood in which he had always considered Mr. Matheson, from his youth as a young man as one of the most promising of the congregations and seemed suited to lead amongst a people such as ours.\n\nMr. Matheson expressed his regret as he was leaving the district, and concluded with him well for the future.\n\nMr. Matheson said that the past year had been a time of spiritual gain to himself, and he trusted that God had been pleased with his efforts. He was now his lot to go forth to a land where he knew not. His Lordship the Bishop, who had been kind enough to give him the new town of Lethbridge, had selected him for the post, and although he professed to be personally acquainted with Lethbridge, still he wanted to send his prayers cheerfully and hopefully at the call of duty. But it would be a sin for him to endeavor to do anything but to serve the district and the people amongst whom he had lived and labored. He had recently taken a trip to the west and visited two congregations, both of which wished him to remain as their minister, but he declined. The minister expressed his gratitude for the opportunity afforded him by the congregation, and then read the address as follows:\n\nPRINCE ALBERT, Aug. 18th, 1886\n\nReverend Dear Sir,\n\nAs you are now about to leave this district, we wish to have no long interval with you and acceptance, the inhabitants of St. Catherine's, who have had the benefit of your services for several years, and those of St. Andrew's whom you have been more recently visited, desire in parting with you to express their thanks for your services, and extend to you our congratulations and as a friend, their best regards at your departure and their best wishes for your future success.\n\nWe bear willing testimony to the great value of your services and personal character as a man for spiritual and temporal welfare. You have been the leader in every good work among us, diligent in the discharge of the duties of your high calling, instant in season and out of season for the good of all your parishioners and neighbors. You reject ease in us, and in us we feel as comforted in your presence. We ever felt that your whole sympathy went out towards all of us, whether members of your own church or other communions.\n\nIn leaving us we believe you will take a people to whom you have been dear, from our rural population. We sincerely congratulate the inhabitants of that rising town in your new field of labor amongst them. We know you will soon make many friends there, and in new building you will find a warm welcome. God-speed to your future labors there. If bar, we may be allowed to hope that on the page of your life hereafter there will still be a record of many a warm friend who will wish your leaving behind.\n\nIn name of the parishioners,\n\nWm. Clark, St. Catherine's,\nAlexander Macdonald, St. Andrew's\nO. E. Hutton, M.M.W.C., Chair-\n\nman of Presentation Committee.\n\nTo Rev. E. K. Matheson, Rural Dean of Carlton and Incumbent of St. Catherine's.\n\nIn landing Mr. Matheson, the address and remarks delivered by Mr. Hughson were fully sympathized with the sentiments he had just read. He had a high regard for Mr. Matheson and the recipient of his message was a brotherhood in which he had always considered Mr. Matheson, from his youth as a young man as one of the most promising of the congregations and seemed suited to lead amongst a people such as ours.\n\nMr. Matheson expressed his regret as he was leaving the district, and concluded with him well for the future.\n\nMr. Matheson said that the past year had been a time of spiritual gain to himself, and he trusted that God had been pleased with his efforts. He was now his lot to go forth to a land where he knew not. His Lordship the Bishop, who had been kind enough to give him the new town of Lethbridge, had selected him for the post, and although he professed to be personally acquainted with Lethbridge, still he wanted to send his prayers cheerfully and hopefully at the call of duty. But it would be a sin for him to endeavor to do anything but to serve the district and the people amongst whom he had lived and labored. He had recently taken a trip to the west and visited two congregations, both of which wished him to remain as their minister, but he declined. The minister expressed his gratitude for the opportunity afforded him by the congregation, and then read the address as follows:\n\nFRIDAY, AUGUST 13, 1886\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES FOR White Cotton, Factory Cotton, Flannels, Sheetings, Towellings, Dress Goods, Silks, Linen, etc.\n\nGO TO J. M. CAMPBELL'S, GROCER AND DRY GOOD MERCHANT, PRINCE ALBERT, SASK\n\nDRESSED FLOORING, $48 UNDRESSED DO., 42 DRESSED SIDING, 48 UNDRESSED DO., 42 SHEETING, 30 COMMON LUMBER, 35 DIMENSION DO., 40 \"OVER 10 FEET EXTRA\"\n\nLATH, 75 CTS. PER BUNDLE. SHINGLES, $6.50 PER M.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowdall & Co., Newspaper Advertising Bureau, 96 Broadway, New York. Send 10¢ for 100-page Pamphlet.\nTELEGRAPIIC.\n\n(Edmonton, Aug. 6.) The Manitobans & Northwestern Road Co. are building from Minnedosa to Portage City, and also from Minnedosa to the Red River, ground as the proposed North-West Central.\n\nThe Manitobans won the Montreal challenge cup for artillery practice at Shoeburyness yesterday.\n\nA meeting of Liberal members was held yesterday afternoon at the Canadian Club, and Mr. Macdonald and Mr. Thompson were present. It was decided to seek a seat in the House of Commons for the Liberal party, which appears to be losing its influence in the West, and to discontinue the Empire. It was also decided to continue the discussion with the Liberal Federation, and to oppose Matheson's motion for the election in his constituency. Mr. Macdonald stated that Matheson is not a Roman Catholic, and a disciple of Macdonald.\n\nMr. Macdonald, Assistant General Superintendent of Railways, has been appointed to the position of Assistant General Superintendent of Railways, and will succeed Mr. Egan in this position.\n\nThe second ship with a cargo of wheat has arrived at Port Moody.\n\nThe Calendar committee is to be appointed for today.\n\nThe Department of Mines has been transferred to Mr. Macdonald from Mr. Macdonald from the Hudson's Bay Company. Mr. Macdonald has been appointed to the position of Assistant General Superintendent of Railways, and will succeed Mr. Egan in this position.\n\nThe Archdeacon Spence died yesterday. Bishop Macdonald intimated that he had been ill for some time, and had been obliged to leave England for a year or two. He goes to England on the 13th, to work upon the question of the Church.\n\nHon. Thomas White addressed the Anglican Missionary Society last night, and leaves for England today.\n\nThe Winnipeg Temperance election is to take place on Monday, M. H. Smith on the field for North Winnipeg.\n\nTibbles, the noted Democratic Statesman, died last Wednesday. A special train is being arranged to convey his remains to England.\n\nThe Quebec Provincial election is expected to take place next week.\n\nLord Lansdowne has left for England.\n\nWinnipeg, Aug. 9. (July 28th.) The British Columbian, steamer against the Canadian Pacific, was purchased by Mr. Macdonald, and will be used for the purpose of carrying goods to Vancouver. An appeal will be made to the public.\n\nA cabinet of arms and armour is being visited by the Provincial Assembly tonight.\n\nMonsignor O'Brien, papal delegate, will visit Winnipeg next week, and will be the guest of Archbishop Turley.\n\nThe funeral of Samuel J. Travers took place yesterday.\n\nTwo newspapers, William Post and David Hackett, who worked in the same office with Abraham, who made the first attempt to introduce a large body of men into the post office at Niagara, in a short period of time. Fifteen thousand signatures were procured.\n\nThe British Cabinet is said to contemplate introducing a large body of men into the post office at Niagara, in a short period of time. Fifteen thousand signatures were procured.\n\nThe Pope is seriously ill; his death is not anticipated.\n\nThere have been charges of rioting in Red River. It is said that there were about two hundred wounded.\n\nIt is now stated that the Quebec election will take place in August.\n\nHon. Alexander Macdonald has been appointed to the position of Assistant General Superintendent of Railways.\n\nRev. Dr. Kane and Col. A. Smith have been elected delegates to represent the Irish loyal and patriotic union in the coming Canadian and United States election between the people against Hon. Baldwin.\n\nWARSAW, Aug. 11. Atkinson of Eastern Canada will start a paper at Regina.\n\nTwo Imperial officers are in the city today, and will attend the special parade for the birthday celebration. They are expected to be present at the Imperial Hotel.\n\nGeneral Manager Van Horne and Sir George Stephen passed through the city today, and will attend the special parade for the birthday celebration.\n\nDupont's Celebrated Ducking Powder. Loaded Shells always on hand.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nDry Goods, Clothing, Groceries, Provisions\n\nEvery Department fully stocked. Special Bargains in Dress Goods, Embroideries, Prints, Sheetings and Plain Cottons. Staple and Fancy Groceries. Fresh Ham, Spiced Roll Bacon, Maple Sugar and Maple Syrup. The Largest Stock of Clothing in town.\n\nBETTS & Gwynne.\n\nFURNITURE!\n\nCheaper than Ever.\n\nI am now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all the Latest Designs! which I am selling at reasonable rates to make room for a large stock coming up by boat. Call and inspect my stock and get prices.\n\nW. B. GOODFELLOW.\n\nWM. STOBART & CO.\n\nTO THE LADIES. General Merchants\n\nNEW GOODS AT MISS MACK & CO.\n\nAND\n\nIndian Traders.\n\nWM. STOBART & CO.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886081301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 5, "total-input-tokens": 7702, "total-output-tokens": 4949, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4403, 1], [4403, 7378, 2], [7378, 8024, 3], [8024, 15618, 4], [15618, 20378, 5]], "primary_language": ["en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0], "is_table": [false, false, false, false, false], "is_diagram": [false, false, false, false, false]}}]