[{"id": "4ba22d81e8947fd069b96cdd3e47aeb9e3f72f07", "text": "THE PRINCE ALBERT TIMES.\n\nWEDNESDAY, JANUARY 17, 1883.\n\nTHE RAILWAY.\n\nWe are glad to be able to state for the information of our readers, that at last the protracted negotiations between the land owners of Prince Albert and the South Saskatchewan Valley Railway Company have been brought to a successful issue; and that the bargain between them, whereby the resident owners of real estate in the town, assign one half their interest in the same to Mr. Richard Fuller, on behalf of the Company, and Owen Hughes, on behalf of the land owners—the proceeds of sales of said lands to be handed over to the Company upon the completion of the line to the South Branch—was finally ratified on Thursday last. We regret if our remarks in last week's issue, should have caused any feeling of annoyance to those who have regarded the conclusion of this important contract. Such was not the intention, but it seemed strange to ourselves, that after the return of the delegation accompanied by the Managing Directors of the Company, much delay should have occurred, in confirming the agreement, which had been signed and sealed by the President of the Railway Company, and in replying to the letter of correspondence. In the absence of specific information on the subject, we could give no other answer than we did. Now that matters have been definitely settled, however, and the contract finally ratified, we are free to admit from the letters and reports which have since been given to us, that the delay was unavoidable under the circumstances. It is the intention of the Railway Company, we believe, to give out the contract for the construction of the line to responsible parties at once, and by the month of June next, some four hundred men will be employed. This will give employment to the intending emigrants, and will involve the expenditure of a large amount of money amongst us, which will of course be a benefit to our business men, and indeed all classes of the community. We understand that the lands will at once be allotted and distributed, and placed in the market, and that the Railway station and yards, which will cover about fifty acres, or half of which will be contributed by the land owners, will also be located and laid off without delay. It has been determined, we understand, that the station is to be within limits, and the foothills lie on the properties known as the Prichard estate on the west, and the Hughes' estate on the east. The company have five years to complete the railway, and will have eight months, or until Aug. 1st, 1884, to the South Branch, but by the terms of their charter, the Company will forfeit the land grant of 5,650 acres, more between the South Branch and Qu'Appelle, if they do not complete the whole road within two years.\n\nWe consider the future of Prince Albert as now assured, and it may confidently be expected that this rapidly flourishing town, will in a few years, take rank as the greatest and railway centre of the North West. Other railways will doubt before long enter the place, and the lines of departure will be made in every direction. On the one hand, Peace River on the other, strike naturally from Prince Albert. There is no reason why it should not in time, and that not far distant, not only rival, but outrun even Winnipeg, itself, inasmuch as we are in the very heart of the \"fertile belt,\" with every convenience of land, wood and water, and are yet nearer tide water than that city. We are sure that the people of the land nearest Prince Albert, for the generous manner in which they have met the Railway Company. The burden of adjustment, has fallen upon them, and upon them alone, as a result of which, they are paid by others, and the community, unlike others, is not taxed to bonus the Company for making Prince Albert the terminus. It is to be hoped now, that all has been arranged satisfactorily, and that all interests will combine to make our fair Town what it ought, and we believe will be, the \"Queen City\" and capital of the great Province of the Saskatchewan.\n\nOUR BONUS.\n\nWe publish in this issue a list of the names of the merchants and other principal residents of Prince Albert who have generously and liberally contributed to the bonus for the establishment of a railway station in our place. We thank our citizens for their liberal encouragement, and shall do our best to merit their continued support. The following are the names:\n\nC. Mair... $100\nJ. Pilkington... 30\nW. V. Smith... 25\nThomas McBay... 25\nW. R. Gurney... 25\nStobart, Eden & Co... 100\nH. J. Prichard... 25\nR. J. Prichard... 25\nJohn F. Kennedy... 25\nA. Spunt... 20\nJ. O. Taylor & Co... 10\nJ. H. Johnson... 10\nHon. Alexander Clarke... 100\nT. N. Campbell... 25\nT. E. Jackson... 25\nBette & Grayne... 25\nJ. W. Brown... 10\nH. Keanan... 10\nLord Bishop of Saskatchewan... 25\nL. J. Macdonald... 25\nA. L. Ashdown... 20\nA. E. Porter, M.D... 20\nE. H. Elliott... 20\nMcLeod & Watson... 20\nJohn McKenzie... 20\nG. T. Brown... 20\nW. R. Bell... 20\nThomas J. Davis... 20\nJames Donaldson... 20\nJohn McDonald... 20\nJ. L. Johnson... 20\nGoodall & Co... 20\nFrank Herron... 25\nPhilip Turner... 25\nDr. Ross... 20\nHard & Baker... 10\nJ. Rae... 10\nThe Hon. Fleet... 20\nW. J. Carter... 20\nC. E. Schram... 20\nRev. Canon McKay... 20\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT, N.W.T.\n\nAND GET FULL VALUE FOR CASH, YOUR MONEY.\n\nFresh Groceries.\n\nPrince Albert XXXX Flour.\n\nEvaporated Peaches.\n\nEvaporated Apples.\n\nDried Apples.\n\nNew Raisins.\n\nNew Currents.\n\nCalifornia Fruits.\n\nGray's Celebrated Scotch Jams.\n\nMarmalades.\n\nSyrup in kegs and tins.\n\nCanned Meats.\n\nCanned Fish.\n\nCanned Soups.\n\nSugar Cured Hams.\n\nSugar Cured Bacon.\n\nCross & Blackwell Pickles.\n\nWorcestershire Sauce.\n\nYorkshire Relish.\n\nSpices, etc., etc.\n\nBiscuits, Candies\n\nDry Goods, Clothing, Boots, Shoes\n\nFURS:\n\nSets Blk. Wolf, Robes, lined and trimmed\n\nSets Grey Wolf, Robes, lined and trimmed\n\nBuffalo Robes, Buffalo Coats, Grey Wolf do.\n\nSTEWART & WOOTTON,\n\nPRINCE ALBERT, N.W.T.\n\nHORSE SHOE STORE.\n\nOh my I am so awfully nervous today, and the reason you see, John he forgets to buy me some Tom Davis' 30 cents Tea. One pound of these Teas will go farther than two, and so easy to steep. I really don't know how he manages to sell them so awfully cheap.\n\nTry one pound of my 50 cents Black Tea, and you will never buy any other.\n\nALSO\n\nClothing, Dry Goods, Furs, Boots, Shoes, Moccasins, etc., etc.\n\nAt prices that beat the waters of the Saskatchewan in the fall.\n\nTHOMAS O. DAVIS.\n\nG. B. B.\n\nAT THE ROCK BOTTOM STORE\n\nSOME OF OUR LEADING LINES ARE:\n\nGrey and Fancy Flannels.\n\nWhite and Grey Blankets.\n\nFancy Comforters and Quilts.\n\nShawls, Nubias, Scarfs.\n\nIn Boots, shoes, Moccasins, Mittens, Clothing, Groceries, Provisions, Canood Goods, Tobacco, Tinware, etc., we won't be undersold.\n\nA call is solicited. Store formerly occupied by J. O. DAVIS & CO.\n\nWALTERS & BAKER\n\nHUDSON'S BAY CO'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rai Portage, Portage la Prairie and Boscobel, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to the lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIDGES, Land Commissioner.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Toys, Etc., Etc.\n\nJust arrived, a Large Assortment of Games, Tricks, Prize Exhibition Cards. Call early and make your selections.\n\nA LIBRARY OF\n\nMusical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nALARGESTOCK ARRIVED A FEW DAYS AGO AT THE MEDICAL HALL.\n\nCONSISTING OF Drugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc., AND ARE NOW OPENED OUT.\n\nALSO ON HAND A GOOD SUPPLY OF Patent Medicines, INCLUDING Fellows' Syrup, St. Jacob's Oil, Electric Oil, Pain Destroyer, Black Oil, Burdock Blood Bitters, Vegetable Discovery, Cod Liver Oil Emulsion Medical Discovery, August Flower, Etc., Etc.\n\nJobbers supplied on reasonable terms. Special discounts on large orders. Physicians prescriptions and family recipes carefully prepared.\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nIn our New Premises, next door east of Farmers' Home and north of Old Presbyterian Church.\n\nBuffalo Hall CLEARING SALE STILL IN PROGRESS\n\nAnd will continue until the bulk of our stock is disposed of.\n\nExamine Prices.\n\nBETTS & GWINNE.\n\nNOTICE\n\n$20 REWARD\n\nFor information leading to the conviction of the person or persons who stole from the premises of Mr. Betts & Gwinne, located at the corner of Main Street and River Street, in the City of Winnipeg, the following articles:\n\n1. A quantity of goods valued at $500.\n2. A quantity of goods valued at $300.\n\nThe reward will be paid by Mr. Betts & Gwinne to any person who furnishes information leading to the conviction of the thief or thieves.\n\nW. B. GUNN.\n\nWoodbine Restaurant\n\nRIVER STREET\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nTOM DAVIS,\n\nPROPRIETOR.\n\nR. J. O'LEARY,\n\nPROPRIETOR.\nBRITISH COLUMBIA.\n\nIn a late number of the Halifax Morning Chronicle we notice an interesting article by Mr. J. Murray, of Victoria, British Columbia, which we make a few extracts from, as it will be of interest to our readers. The writer says in this article, the pen of an old journalist who was one of the first and most prominent writers on the Canadian scene, and who has been connected with the North West Press from its inception, and we are glad to see that in his firm constitutional frame, his right hand has lost none of its power.\n\nVictoria, the capital of this immense province, is certainly what may be called a \"pretty place.\" It lies on the western side of the Strait of Juan de Fuca, about 150 miles south of San Francisco—so the most usual way of approach—it seems particularly attractive, whether public or private, which are worthy of especial note—but neither does it cost much, at least, as I could see, any more than a similar place in the United States, extending over a surface which is gently undulating, and surrounded by hills, dry as gravelly, yet closely treed, and there is a general air of tidiness about the place. The greatest part of the town, so-called, is built on a level, and extends in a long line, extending on every side from a common centre. The houses in these \"suburbs\" are mostly of wood, painted in bright colours, and almost invariably these are rendered more attractive by prolific flower gardens and richly-clumped shrubs of fruit and ornamental trees.\n\nThe so-called harbour of Victoria, with its wonderful arms and branches, adds much to the picturesqueness of the little town; but when regarded as a harbour it is small and insignificant. It is only used to vessels of a light draft of water, and is not easy of access even for them. I say nothing of the harbour of Esquimalt, which is almost four miles from Victoria, by a level and very pleasant road. Being situated on the great promontory of Nova Scotia's head along the Atlantic, I was disappointed in finding the harbour of Victoria so insignificant. It is a very safe anchorage and offers exceedingly easy of access from the night before noon, and doubtless the harbour is likely to be required in it for some more distant future to come; but as its real importance is not likely to be very great, Nova Scotia, merely \"a bit of a cove.\"\n\nBy-the-bye, I must not forget the dry dock, which is said to be the largest in the world, commanded by the margin of the Esquimalt Harbour. I forget how many years since I judging by the present appearance and state of progress, I almost suppose that the child, is not yet born who will live to see the work completed.\n\nMr. Royer, the Principal, of the Princess Louise Institute, is an agreeable, quiet, merry-go-easy city of Victoria very much to be praised. It is not very large, nor very old, nor very new, and with the exception of three days which she had spent in New Westminster and Burnside's Falls, I have remained there ever since. I hear no account even yet of her soon taking her departure.\n\nThe trip up from Victoria to New Westminster is very interesting. The first miles, in winter, flattering, a very pleasant one. We stand on the labours of islands. This part of the Gulf of Georgia reminds one of the lake of the Thousand Islands, but the latter is not so beautiful, and natural features largely magnified. New Westminster is situated on the northern bank of the Fraser river, where the river bends around the eastern cliffs and swamps formed by that river, and extending from the point opposite to twelve miles down the river. The hills on which the city is laid out, and in small part yet, built, is almost the grandest of those which are visible from the highest height within the \"Circle\" of the interior with the island. These hills are here very high, rising several hundred feet from the river along the river side. The whole population of the place is estimated at five thousand souls, and is only about twenty-two years since New Westminster emerged from the forest.\n\nThe natural position of the city, very fine for the upper terraces, looking west across the delta, inside, it commands a vast view of the Gulf of Georgia and its islands, and in the distance the lofty top of Vancouver, and Point Roberts, with a stretch of Boundary Bay interposing. Looking northward there is an\n\nSTOBART, EDEN & CO.,\nGeneral Merchants and Indian Traders.\nSeven Cases of Fancy Goods\nJust received from England containing\nLadies', Girls' and Children's Underwear,\nBall Dresses,\nLadies' Mantles and Balotels,\nLadies' and Maids' Winter Jackets,\nLadies' and Maids Costumes,\nThe Only First-class Newspaper in the Saskatchewan District\nN.W.T. to advertise in.\n\nGREAT SUCCESS!\nCirculation Increasing Daily\n\nNOW IS THE TIME TO ADVERTISE\n\nAdvertise.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which unfortunately was left at Sunderland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETT,\nProprietors.\nPATRICIA KEMBALL.\n\nA NOVEL\n\nBy R. Lyon Linton, author of \"Lovers of Sovereignty,\" \"The True History of Joshua Bartlestone,\" etc.\n\nCHAPTER VI.—CONTINUED.\n\n\"I am afraid we have not such a thing as a shop in the house,\" said Patricia in distress; \"we have only a bit of cornflour.\"\n\nMr. Hanley's face darkened.\n\n\"What can you mean?\" he asked.\n\n\"No, no, I thought it was a mistake,\" she answered immediately. \"It is in the bread, and I am afraid not enough. We have not got enough flour.\"\n\n\"But you knew that I was coming,\" he said.\n\nHe was greatly disconcerted. A man of Mr. Hanley's stamp, think much of baked goods, both for home and hotel purposes; and cold bread of native work was far worse than nothing; for there was a sin greater than half a score of breads would have been.\n\n\"I charged you for getting something,\" said Mr. Hanley; \"but Patricia, her face brightening at the thought; but Mr. Hanley started back, and Patricia tried to rush out of the room (unsuccessfully).\n\n\"Don't give yourself quite so much trouble, my dear; he will be with us in another minute,\" said Mrs. Hanley; and you can enjoy your meal in peace. You would rather be alone at such a time as this?\"\n\n\"I am very glad,\" said Patricia, \"for I am unable to help me to make more work. Not a word! I shall go to that house we visited last night, and see if there is anything which will satisfy me; and then I will return to you and take of you once more.\"\n\nMr. Hanley looked at his wife and covered himself out of the room. No other word would give an adequate idea of the state of his mind. He walked about the little parlor, which indeed he seemed to hate, and thought over what had happened through those few hours in his life—how he had been driven back into the world, and yet felt that he could not be happy again. Such a feeling came over him that he felt as if a weight had been taken off his heart, as when we fight off that shadowy hand which is threatening to take our sleep.\n\nThis man was her master, her husband, the uncle who had been so kind to her, the guide she had trusted in place of the dear dead whom she had reverenced so simply and loved so well. It was an instant and sudden change, and Patricia went up the stairs, where she heard the garden gate shut as Mr. Hanley emerged after her. She went to bed, and Patricia knew she would have gone to him, living, for counsel and if need be reproach. And when Mr. Hanley came back, Patricia knew that he was true, but more cheerful than she was before. And he smiled his better to his wife, and she rejoiced. She knew it was that she was enjoying the fruits of material advantage as you know, and that she had already been very successful.\n\nThat satisfied most of the situation; nothing could annoy Mr. Hanley's energy and kindness. He took every thing on himself, and Patricia knew that he had been born to the work. His business faculty came in as almost another nature, and radiated Patricia's own. She thought less about the \"foolish calling of lawyers\" that valuable though he was, he was still engaged in the same work as she. He had not a word to say on any matter; and if she mentioned an opinion, he told her that was his business, not hers, that was—she could get by herself, and she also who was to bring her kind of trouble into the world. But he was there for that purpose. For the rest, they were they, great and small, here, but to talk about them was useless, and he would do only to quiet and dispel suspicion.\n\nWhat could be learned from this? That he had been brought up properly; but still the whole question might have been settled by the discovery of the old ill-fated gathering of the dead men. His high-mindedness would have been his; his high-mindedness would have swept all aside out of the path altogether, and Patricia would have had her end and satisfaction. But there was no room for activity and love into a void where there were only cold words.\n\n\"Private\" Jean at Teloschitz.\n\nFor what it calls the honours of Teloschitz, Land and Water proposes a silver collar, to be paid for by public subscription.\n\nThe following list of recommendations for the election of members of the House of Commons was presented to the Hon. Sir Robert William's department October 25th, we make one name—Sir Archibald Allan, whose high personal merit, together with his high military reputation, led him to the Highland Brigade at Teloschitz, and who is Private James—An old Irish settler belonging to that splendid regiment, the First Battalion Gordon Highlanders.\n\nP. O. Stationery.\n\nHis Worship, the Mayor, Geo. F. Fraser, Esq., the Chairman of the Committee of Supply, Ald. McCay, Esq., the Chairman of the City Market Board, left for Legislative City Council's delegation to Quebec to attend the convention from all parts of the province. The delegates will urge the Government and urge upon them the importance of establishing a bureau of vital statistics, bearing connection with the Department of Agriculture. The Medical Society have also sent a delegation to attend the annual meeting of the Free Parker, Farrell, Workmen and McDoon & Co., \"Glasgow,\" S. C., Canada.\n\nThe subjects of Vital Statistics are matters of vital importance, which could affect the welfare of the nation, and urge upon the Government that the subject be brought up by the delegation. Some of the difficulties connected with the different cities of the Dominion, which compelled the medical students in the city of Montreal, to remain a mystery, it is to be hoped that when they are accomplished, as no doubt they will, that North West will not be forgotten.\n\nMAHARRY & CLINESKILL.\n\nGENERAL DEALERS.\n\nM. H. BLOCK, Prince Albert, N.W.T.\n\nCash Paid for Grain.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY,\n\nPROPRIETOR.\n\nJ. L. JOHNSON & CO.,\n\nHave just received a large and general assorted stock of Hardware;\n\nALSO\n\n500 GALLONS OF COAL OIL.\n\nNo. 1 Campbell's Block, Prince Albert.\n\nTRAVELLER'S GUIDE\n\nTo Messrs Acorn & Cross.\n\nThe pump which you have put in is well giving entire satisfaction, being easily worked and proof against the severe frosts of the North West.\n\nYours Truly,\n\nROBERT ROSS.\n\nPrince Albert, Dec. 26th, 1882.\n\nT. JAGNEW\n\nHas just received:\n\n5,000 feet Glass—14x28, 15x20\n\nAxes and Handles.\n\nWhite Lead,\n\nCook Stoves,\n\nPowder and Caps,\n\nCutter Runners and Shafts,\n\nLamp Chimneys,\n\nBuilding Paper,\n\nPacking Paper,\n\nUnion Curtains.\n\nTwenty-odd loads to arrive next month.\n\nWholesale & Retail.\n\nTAILOR AND BARBER\n\nCall on Scotty, the Tailor, for Your Clothes.\n\nFit Guaranteed.\n\nCutting a Specialty.\n\nHair Cutting and Shaving.\n\nJAMES SCOTT,\n\nGALE HOUSE,\n\nPRINCE ALBERT,\n\nN.W.T.\n\nTRY\n\nHUGH M'DOUGALL'S BREAD!\n\nFresh Orange Bread!\n\nInc. Per lb. 2 1/2c.\n\nBread and Pastry Made to Order.\n\nHUGH M'DOUGALL,\n\nEast End Bakery.\n\nPRINCE ALBERT BAKERY.\n\nI beg to announce to my customers and the Public generally, thanking them for their patronage that will be extended to me, that I am now engaged in the manufacture of Bread, Cakes, Pies, and other things, and commence business at once.\n\nAll orders promptly attended to, and the highest prices paid for Flour Wheat, Rye, Egg Shells, etc.\n\nW. R. BELL,\n\nWAREHOUSING\n\nAT\n\nFORT QU'APPELLE.\n\nHardware;\n\nALSO\n\n500 GALLONS OF COAL OIL.\n\nNo. 1 Campbell's Block, Prince Albert.\n\nGRUNDY BROS. & CO.\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nPRINCE ALBERT\n\nC. MAIR,\n\nF. O. BRAYER,\n\nPrince Albert, N.W.T.\nTOWN NEWS.\n\nCapt. Hughes of Dutch Lake arrived here on Saturday night on a short visit.\n\nMr. Macdonald, Agent, has gone to Fort Pitt for intermediate stations on business of his Department.\n\nAll changes for contract advancement must be made by telegraph in the future when travelling over the railroad.\n\nCol. Sproul and Mr. Hyndman are at present busily engaged getting out a plan of the railroad, showing both sides of the river.\n\nThe following gentlemen visited this week: Mr. J. A. Macdonald, W. H. Green, barrister, W. H. Goddard, and Mr. Moore.\n\nThe ball which was held in Mr. John Macdonald's hall on Friday evening was a very enjoyable affair, and the attendance was very large, witnessing the success of the evening. The supper was excellent and tastefully laid out, and reflects great credit on Mr. Hall, who provided the good things.\n\nNow that railway matters have been settled, work will be well to hand, and early morning and evening trains will be the telegraph line, so that tenders should at once be advertised for the supply of the necessary materials. It is anticipated that they can be most cheaply got out and distributed over the line, while the roads are good.\n\nMr. Fitzgerald, Commissioner of Railways, after visiting in Manitoba, returned last week and reported a couple of interesting facts which he thought would start a weekly newspaper in the district.\n\nMr. Allan, North West Telegraph, has visited the province several times, and over the past few weeks much difficulty, and in the meantime much information, and on the 26th of December the first train of the Prince Albert Towns was issued.\n\nIt is a well-known fact that the town will probably be completed before the North West was completed, and Prince Albert in particular.\n\nMr. Cochran, of Toronto, has visited Prince Albert and reports his impression—Mr. Cochran, of Hamilton, N.S., Capt. French, of Fort Qu'Appelle, arrived in Prince Albert on Friday night and visited the town, and reports great depth of snow between Humboldt and Prince Albert. The snow is piled up to the height of three to four feet.\n\nThis will probably delay the mail until Thursday next. Capt. French in former years visited Prince Albert and placed them in the mail, and the snow was not strong from July to October.\n\nApplauded by the people, but not down this winter, but the gap between the end of the line and Humboldt will probably be filled by digging through the spring.\n\nMr. Allan, North West Telegraph, has visited the town several times, and Mr. Macdonald, Agent, visited the town recently.\n\nMr. Allan visited Prince Albert in Winnipeg, particularly, and has heard much about Prince Albert.\n\nFrench says that non-essential inter-\n\nviews with Lord Granville (Diplomat) who is now in London, and the late Lord Beaconsfield (Prime Minister) stated that the death of Sir John A. Allan would be a great loss to the country.\n\nHe said that the company intended to push the line through to Prince Albert in the spring.\n\nWe had a visit the other day from Mr. John Tomkins, who visited Prince Albert and visited the town several times.\n\nThere are three reserves under his charge, \"Beardy's reserve,\" on which about 400 acres are cultivated; \"North Star,\" near the town, which last season produced 1,200 bushels of wheat, 700 bushels of barley, 500 bushels of potatoes, and 300 acres of pasture.\n\nNext is the \"Thames reserve,\" eight miles from Dutch Lake, this contains about 800 acres, which last season produced 1,000 acres, which produced 200 bushels of wheat, 500 bushels of barley, 2,000 bushels of potatoes, and 200 acres of pasture.\n\nOn the \"Okanagan reserve\" there are eighty or ninety Indians, cultivating about 200 acres, which last year produced 400 bushels of wheat, 500 bushels of potatoes, and 200 acres of pasture.\n\nMr. Tomkins says these Indians cultivate their own houses and barns, and own and three yokes of oxen each, and are happy and contented. They are a hardy race, which will enable them to break up more land in a year than reserves will be entirely self-supporting.\n\nTOGETHER.\n\nWe have arranged arrangements to have papers at J. J. Agar's hardware store, the Post Office, T. N. Campbell's news store and Mackay & Co.'s dry goods store. These bring near any of the above mentioned places will find their papers there. Also at this office.\n\nW. J. CARTER,\n\nESTABLISHED - 1860.\n\nBuilder and Contractor.\n\nPlans and Estimates furnished when required.\n\nResidence: Near Presbyterian Church.\n\nJ. M. CAMPBELL,\n\nImportant to Farmers.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT\n\nR.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883011701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9132, "total-output-tokens": 6729, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7856, 2], [7856, 9362, 3], [9362, 14397, 4], [14397, 21871, 5], [21871, 26760, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]