[{"id": "5c1ccc6a6ce7dd7b9a0d5cfd063203dd278cdea1", "text": "Church Social.\n\nA very interesting and amusing social was held at the Presbyterian Church last evening. One of the guests spoke of Mr. Lovell's resignation of his charge of the Church, which he has held for the past several years. He then spoke of the late services at the Church, in which dialogues were pleasantly and amitably discussed by all present. The church organ and pulpit have been restored to modern form, and the new addition of cloth covering will surely add comfort to any member of the congregation.\n\nBanking House.\n\nWe have seen those days when Prince Albert was daily signaled from ship to steeple; now, unfortunately, its harvest is small and its life is impoverished.\n\nJohn B. Dunlop, M.D.\n\nOver looked at various offices, Prince Albert. We have not yet heard from our dear, departed friend Dr. Dunlop. May his soul rest in peace.\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nBANKING HOUSE\n\nMacarthur & Knowles,\n\nPrince Albert, N.W.T.\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\n\nPRINCE ALBERT TIMES\n\nVol. I. No. 48\nWed., Sept. 26, 1883\nTHE PRINCE ALBERT TIMES\n\nWEDNESDAY, SEPTEMBER 26, 1883\n\nMR. TANQUER DISQUALIFIED\n\nMr. Tanquer has been disqualified for non-attending the representations of the unscrupulous and young politician, that he had endeavored to have the election conducted in a legitimate manner, while he himself was treating the electors at his meet- ing and in his speeches as if he were in their power to make them vote for the \"right man.\"\n\nThe effect of the disqualification of Mr. Tanquer will be that for the next eighteen months he will be prevented from holding any municipal or legislative office or any other position of trust or authority.\n\n\"NOT TO BE USED LIGHTLY\"\n\nWe have been told that terrorism and retaliation are tools that are not to be lightly used, and any person who takes into consideration the results that might follow from an organized attempt to secure our just rights will see the futility of such a course, but no such result can ever come about unless there are two parties to the controversy and the Government will, in the event of such a party being able to force its way here, be able to do so by force.\n\nBut they fail to see, as did the joint deputies who, after having had an unsuccessful dispute with another deputy, explained that he had prayed for a certain number of votes, that \"you must hold for I cannot.\" The settlers, however, have no intention of desisting from their demands and, although they have every faith in the fair and honest dealing of the people of the East, they feel that were they to act quickly and decisively the Government would be compelled to cast off the speculators and other firms in partnership with them, and pay the public funds. That the settlers themselves are not an unreasonable class is abundantly proven by the fact that no previous Minister of Justice has been able to get any satisfaction from the Dominion Lands Department.\n\nHomesteaders read the Act and knew that the literal translation gave its meaning very fully. They knew too that the lands were on the settlement lands their rights would be respected. They knew also, that they incurred a great risk if they permitted themselves to obtain their titles, and that therefore nothing but the fulfillment of all the settlement duties would enable them to hold their claims, but they also knew that there was some incentive to work, no government employee could interfere with the pioneer's affairs or recommend the government to gable up their hardly earned improvements. Most assuredly cessation and retention are terms which belong to the past, and the settler should be guided always to endure and yield rather than be coerced seek retribution from abroad or join together in protecting their homes, the responsibilities will rest upon the shoulders of those who have been called to the greater wrong of seeking to take the possessed lands and improvements that belong to another, and upon those who desiring peace still persist in the belief that the settlers who are truly loyal will never allow themselves to submit to arbitrary measures.\n\nTHE HUDSON'S BAY ROUTE\n\nOf all the projected lines of railway designed to open up the great North West there is none of such importance as that which will connect Prince Albert, but to the whole of the Territories, as that which will connect with the Hudson Bay, and then open up the short route across to Europe. A reference to the map shows how the shortest route from Liverpool by way of Hudson's Bay is by far the shortest to the North West Territories of Canada. The distance between Liverpool and Hudson's Bay via Hudson's Bay is 2,940 miles. From Montreal to Liverpool, via Cape Race, is 2,990, and from New York via Cape Breton, 3,540 miles, showing 640 miles in favor of the Hudson's Bay route.\n\nMONTREAL AND NEW YORK\n\nAs regards the practicability of navigating the straits and bay during certain seasons of the year, it has been demonstrated by actual observation that the harbour straits are never frozen over, and that the ice in the straights of Churchill and Nelson only extends to a distance of about five miles from the shore, though where a channel could easily be kept open by means of boats or small steam tugs. Taking the average of authors, there can be no doubt that for at least nine months in each year the navigation is open for steamers, quite long enough time to transport all the grain of the North West to the markets of Europe.\n\nA party of engineers were sent out last autumn to examine the route to New York and harbour, spent last winter there, and have recently returned. They report most favourably of the practicability of navigating the straights and straits of Churchill and Nelson, the harbours were not frozen by ice extending towards the close of January, and were open again by the middle of June, and that channels could easily be kept open by means of boats or small steam tugs.\n\nThe Hudson's Bay Company originally granted by the Dominion Parliament to two companies to open and operate lines of railway to the Hudson Bay, but they have since abandoned the project and united under one charter.\n\nThe design of the Hudson's Bay Rail Way Company was to build a road from Norway House to Churchill, a distance of 350 miles, and thence from Winnipeg to York Factory (Nelson). The probable route now will be from Norway House to Churchill, with a branch to Prince Albert.\n\nThe company has received a large grant from the Dominion Government—6,000 acres per mile—and as soon as the straights are surveyed and their navigability determined, a large vessel will be constructed and the road will be completed with vessels. When this line of rail road is built, it will undoubtedly be before another decade has passed, Prince Albert will be on the map of the world.\n\nThe Hudson's Bay Company is to the Western States, what Montreal is to the provinces of old Canada and New York to the Middle States. The Hudson's Bay—the great highway and inlet for the commerce of the fields of that vast country to the continent of Europe, and the nearest commercial link between the old world and the new.\n\nIt is the mission of God which unites us who may be dependent on account of the present dullness in the market, but the future is the same, and worse, all over the Dominion. Hold on a little longer and the future will be glorious and a glorious future before us, if we persistently and are true to our principles and are true to our promises.\n\nPRINCE ALBERT\n\nIndian Traders,\n\nAcorn & Cross,\n\nPRINCE ALBERT, N.W.T.\n\nFarewell Sermon\n\nPreached by Rev. James Stevenson on Sunday evening last in St. Paul's Presbyterian Church.\n\nThe following is a synopsis of the sermon delivered last Sunday evening in St. Paul's Presbyterian church, on the eve of the departure for the West.\n\nThe text was taken from Ezekiel xlvii., 17: \"The vision of the holy water.\"\n\nThe sermon discussed the subject of the importance of prayer and was listened to with profound interest. The building was completely filled.\n\nUnited States Life Insurance Co.,\n\nthe City of New York.\n\nEstablished 1850.\n\nDeposits with Dominion Government.\n\nOffice, Bird Block, 439 Main St.\n\nG. R. MAGUIRE, Provincial Manager.\n\nThis Company has been doing business in this country for liberality and integrity, and is highly recommended.\n\nPolicies are insurable for any cause except suicide within two years. Every form of insurance policy issued.\n\nJOHN F. BETTS, Agent.\n\nNotice\n\nI beg leave to inform my friends and the public in general, that I have for sale a fine horse, named \"Black Jack,\" 18 hands high, and THOROUGHBRED, for sale.\n\nPlease send me your kind offer for your next purchase, and I shall be pleased to give you the best price possible.\n\nTHOMAS O. DAVIS.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horses, Nails, Bolts and Chains, Wagon and Cart Barrels, Shirts and Tongues for sale.\n\nAnd a variety of other articles in a first-class General Store.\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT.\n\nFOR SALE.\n\nLumber Wagon, Mower and Hay Rake, Democrat Wagon, Horse and Single Harness.\n\nALL IN GOOD ORDER.\n\nFor sale. The above is the property of C. E. LOWRY.\n\nJ. J. CAMPBELL.\n\nTO LET.\n\nBrick Store\n\nIn Centre of the Mission.\n\nOne of the Best Business Stands in town.\n\nApply to\n\nGEORGE T. BROWN,\n\nBuilder.\n\nNotice\n\nDuring my temporary absence from Prince Albert.\n\nH. J. MONTGOMERY\n\nWill be away again. Parties requiring Brick, Cordwood, Etc.,\n\nCan arrange with him for the same.\n\nE. WALDO.\n\nPrince Albert, Sept. 4, 1883.\n\nO. E. HUGHES & CO.,\n\nGeneral Merchants\n\nAND\n\nIndian Traders,\n\nSaskatchewan.\n\nWholesale and Retail.\n\nPUMPSI\n\nFrost Proof Pump Manufacturer.\n\nWell sunk and Pumps sold.\n\nGeneral Merchants.\n\nPRINCE ALBERT, N.W.T.\nCOMMUNICATIONS.\n\nTo the Editor of The Times,\n\nBREWERY LICENSE.\n\nSir, At a recent meeting of the municipal representatives of the Territorial government, it was agreed that a petition to the Lieutenant Governor be prepared and circulated among the electors of the North West Territories so that a license for a brewery might be granted. The petition is as follows:—We, the undersigned residents of the North West Territories, do hereby urge upon the present legislative body to take action in the present public interest by the passage of an ordinance to regulate the manufacture, sale and distribution of beer within the limits of the North West Territories. We believe that the manufacture, sale and distribution of beer should be regulated by law, and that the sale of beer should be restricted to licensed premises only. We further urge that the sale of beer should be prohibited during the hours of darkness.\n\nEx-Governor Archibald\n\nMEDICAL HALL\n\nT. E. JACKSON.\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY.\n\nJUST RECEIVED\n\nBY\n\nFirst Boat from Winnipeg:\n\nPlaster Paris.\n\nBuilding Paper.\n\nPlasterers' Trowels.\n\nMasons' Trowels.\n\nGun.\n\nCanister Powder.\n\nMixing Machines.\n\nAND A FULL LINE OF\n\nHardware.\n\nPrices the lowest in town.\n\nTen per cent. off for Cash\n\nat\n\nT. J. AGNEW'S\n\nWholesale and Retail.\n\nReal Estate\n\nFOR SALE—A NUMBER OF\n\nCHOICE BUILDING LOTS\n\nPRINCE ALBERT\n\nC. MAIR,\n\nP. O. DRAWER R.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\n(At T. N. Campbell's New Store.)\n\nA LARGE STOCK OF\n\nBAKER, Watches,\n\nGeneral Merchants,\n\nClocks and\n\nJewellery\n\nKEPT CONSTANTLY ON HAND\n\nTRY\n\nHUGH M'DOUGALL'S\n\nBREAD!\n\nR. B. WAY,\n\nTHE GABLE HOUSE.\n\nTHE BEST\n\nBEER AND CIGARS\nA WIFE'S TACT.\n\nFinding that was all she could do,\nAfter having been married some years,\nTo make her husband's life bearable,\nShe thought she had little to occupy his mind, to suggest to his wife that they could be happy together, even with the same old routine; but soon after some hesitation she had made up her mind, and after some hesitation she had made up her mind, that the reconciliation should be made in all sincerity and with an honest view to the betterment of their lives.\n\nThat would be no one to speak of the faults with which marriage had opened their eyes. The husband had been very attentive to his wife when he began to think. He was somewhat reluctant, but his wife insisted that he should not be so, and so the man said, and said, and said, until at last it was his place to take the lead. Thus urged, he began the ordeal. He said:\n\n\"My dear, I have been thinking of the faults I observed in you after we began keeping house; that you neglected the time, wages, and other matters; that you gave great liberty to my fortune, and kept a bright as a dollar.\"\n\n\"I am sure you have mentioned it,\" she said, \"and the little, bringing a little; therefore, you shall see me up on cap or pan. Pray proceed.\"\n\n\"I am convinced,\" continued the husband, \"that you are very disorganized when you come out, without washing them, and then think them clean. Now, what about those things? You have always used to wash out your dish rags where you have dropped them, and then hang them there; there they lay, ready for the next time she would need them.\n\n\"Blushing as before, the young wife promised to amend the fault.\n\nThe husband continued with a most formal list of other faults, many of which she had never heard of before, when he declared he could think of nothing more worthy of mention.\n\n\"You have been very careless and lazy and fail to keep all the family you have discovered in our new home, we have been starving.\"\n\nThe wife sat in silence. Her face flushed to the temples, and a great lump came into her throat, which seemed to be choking her.\n\n\"Propose, my dear, tell me all the faults you have discovered in me; spare none.\"\n\nArising suddenly from her seat, the little wife burst into tears, and throwing both arms around her husband's neck cried:\n\n\"My dear husband, you have not a fault in the world. If you have any, they have been hidden by my love for you. Tell me, so long as we have been married, I have never once observed it. In my eyes you are perfect, and I must say you seem to me to be the best man, and just what should be done.\"\n\n\"But, my dear,\" cried the husband, his face flushing and his voice growing husky with emotion, \"just think how you have been a faithful member of such a family. Now do tell me some of my faults. I know I have many—ten times as many as you ever had or ever will have. I love you.\"\n\n\"I believe it,\" she replied.\n\nIndeed, husband, it is as I tell you; you lack not a single fault that can be named. What you lack is only a few eyes, and now that I know what a good thing watch is, I shall at once begin to watch you, and try to be myself worthy of you.\"\n\n\"Nominee, my dear, you know that sometimes I play away here and there, and you may think I have been where I ought to be at home. I spend money for drinks and cigars when I ought to be doing something else.\"\n\n\"Don't you forget it—that's me.\"\n\nTRIP TO THE ROCKIES.\n\nA delegation of the Historical Society of Manitoba have been making a trip to the Rockies for the purpose of exploring the region of the Furrers' Trail in the North West. The results of their investigation will be fully reported to the members of the society in a pamphlet form. Meanwhile several of the members have given an account of their experiences to the Winnipeg papers. One of these contains an interesting letter.\n\nAt Medicine Hat we saw our first snow, and the snow was very heavy, and it prevented us from seeing anything except the snow-covered plains. We went to Calgary and southward on the Macdonald Trail, and then turned westward toward the Rocky Mountains. We visited several places in Canada and the United States, including Yellowstone Park, and other places of interest. We also visited several towns in Montana and Idaho.\n\nJ. L. JOHNSON & CO.\nHAVE A FULL STOCK\n\nPowder,\nShot,\nGuns,\nHarvest Tools,\nBuilding Hardware,\nPlastering Hair.\n\nHORSE SHOE STORE,\nCAMPBELL'S BLOCK.\n\nSelling Off!\nSelling Off!\n\nNow is Your Time to Get Good Bargains\n\nCall and See, as We Must Close Out\n\nThe Stock this Month for Cash.\n\nFarmers' Produce only taken in exchange for Goods.\n\nTHOMAS O. DAVIS.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nHUDSON'S BAY CO.'Y\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own 750,000 acres in the Great Fertile Belt, and now offer for sale 100,000 acres, already surveyed by the Government of Canada.\n\nIALSO\nTOWN LOTS\nFOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and elsewhere.\n\nC. J. BRIDGES, Land Commissioner.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\n[Reports of various local events and occurrences.]\n\nPRINCE ALBERT.\n\nThe North-West Council.\n\nThe North-West Council has met in Prince Albert.\n\nBUSINESS GUIDE.\n\nProspectus of the Prince Albert Directory.\n\nCustom Work.\n\nRepairing.\n\nSHANNON & McLEOD\n\nFurniture.\n\nC. & C. E. CARTER\n\nSideboards, Bureaus, Bedsteads, Couches.\n\nTeets, Bedroom Sets, Chairs of nearly all Descriptions.\n\nCRADLES & CRIBS for the Babies.\n\nRocking Chairs for the Ladies.\n\nMattresses Single & Double to suit Customers.\n\nFOR SALE ON TOLET.\n\nThat large and commodious store!\n\nJOHN FLETT.\n\nLeon CHEVALIER.\n\nBLACKSMITH'S SHOP.\n\nNEW BLACKSMITH'S SHOP.\n\nWhitelock & Mavor.\n\nFARMERS ATTENTION!\n\nJ. M. Campbell\n\nS. W. VANLUYEN.\nBUFFALO HALL\n\nTHE LEADING\nDry Goods, Clothing and Grocery House\nOF PRINCE ALBERT.\n\nFor Thirty Days Only!\nDRY GOODS\nAND CLOTHING\nAt Cost for Cash.\n\nBETTS & Gwynne,\nCITY AUCTION MART.\n\nMARKLEY & ORR,\nReal Estate and General Agents—Sale Agents in this district for the\n\nThe Celebrated New York Singer Sewing Machines!\n\nKNOX & BARKER,\nCarpenters and Builders,\n\nJob Work Promptly Attended to.\n\nPlans and Estimates Furnished when Desired.\n\nResidence—BELL'S RESTAURANT.\n\nJAMES SINCLAIR\nMerchant Tailor,\n\nHas just received his new stock of\nSpring's Summer Goods,\nAnd is prepared to supply his numerous customers with\nSuits to please the fancy of all.\n\nJust received a large stock of\nUNDERCLOTHING\n\nA fresh supply of stylish\nSoft and hard Felt Hats\n\nGive me a call.\n\nJ. Sinclair.\n\nBAKING POWDER\n\nROYAL\n\nABSOLUTELY PURE.\n\nThis product never fails. A marvel of pure, concentrated flavor. More economical than the ordinary kinds and far superior in taste. No other brand can equal its flavor or quality.\n\nHugh J. Montgomery,\nReal Estate Agent,\nAUCTIONEER, ETC.\n\nW. J. Carter,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nMISS MACK & CO.,\nCampbell's Block,\nRiver Street,\nPrince Albert, N.W.T.\n\nNEW\nSpring and Summer Goods\nJUST RECEIVED BY EXPRESS\n\nMillinery,\nLadies' and Childrens' Furnishings\nEvery effort made to give satisfaction.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883092601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9362, "total-output-tokens": 5175, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2071, 1], [2071, 10738, 2], [10738, 12498, 3], [12498, 17888, 4], [17888, 18625, 5], [18625, 20005, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]