[{"id": "3b50fee337d317181526c7c2a2e36c428112f005", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nVOL. 5.—NO. 7\nPRINCE ALBERT, SASK., FRIDAY, DECEMBER 17, 1866.\n50¢ TO A YEAR.\n\nBANKINGHOUSE OF Macarthur & Knowles Prince Albert, N.W.T.\n\nTransact General Banking Business. Collects on Deposits. New Notes. Sterling Silver Dollars. Available at all points in the Dominion and promptly advanced. Bank of Canada.\n\nWILLIAM V. MACARTHUR.\nH. W. NEWLANDS.\nSTEPHEN BRICE-TERRY.\nPAUL ALBERT.\nH. R. GUNN, M.A.\nJOHN C. PATERSON.\nTHOS. ORAM.\nPRINCE ALBERT.\nA. GOODFELLOW.\nPRINCE ALBERT.\nDENTIST.\nPRINCE ALBERT.\nROYAL MAIL STAGE.\nJ. D. HANNAFIN.\nHANNON & McLEOD.\nJ. D. SCOTT.\nJ. D. SCOTT.\nGILBERT E. CARTER.\nR. C. WIGMORE & CO.\nBLACKSMITHING.\nMCGILL BROS., GENERAL BLACKSMITHS.\nQUEEN'S HOTEL.\nTHOS. ORAM.\n\nCITY CONFECTIONERY.\nSPECIALITY: Boots and Shoes.\nR. T. GOODFELLOW.\nCALEDONIA BREWERY.\nCHAS. WOODMAN.\nADVERTISERS.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nNOTICE.\nMASS MEETING.\nThe friends of the present Liberal party will be held in TAIT'S BLOCK, PRINCE ALBERT, ON TUESDAY, December 21st, at 2 o'clock PM., for the purpose of forming an Assembly and organizing for the coming election.\nAll friends of the Government are requested to attend.\nGod Save the Queen.\nA. C. PATERSON.\n\nTELEGRAGRAPHIC.\nBY SPECIAL TELEGRAPHY.\nWINNIPEG, Dec. 17.\nMr. Thomas White has declined the nomination for Member of Parliament.\nWINNIPEG, Dec. 19.\nThere will be several serious consequences in connection with the Manitoba elections in Cypress and Nelson districts exclusively.\nEnclosed by telegraph to Mr. Thomas White.\n\nCHIT-CHAT LOCAI.\nGathered by our Reporters.\nChristmas is coming.\nNew Year's day.\nWhere's Tom?\nWho was there?\nXmas Cake at High Wycombe's.\nNinot from art school.\nCapt. Ripley's current River was in town last Saturday.\nAn immense stock of Xmas goods will be obtained early next week.\nCapt. Riley of the North Branch, is expected here on Tuesday and Wednesday next.\nT. P. Waterhouse, Inspector of Indian Affairs, left for Regina last Wednesday morning.\nThe regular examination of the pupils at St. Anne's convent took place this week.\nA thick of the Saskatchewan Curling Club played a game on the rink in Monday.\nThe N.R.C. ball will take place next Wednesday evening, Dec. 23rd, at the Queen's Hotel.\nThe great fair for the Northwest and Red River district will take place shortly after Christmas at the Mission bandstand.\n\nSUITE OF MISCELLANEOUS ADVERTISEMENTS.\n\nFURNITURE.\nBLACKSMITHING.\nBELL ORGANS.\n\nDESCRIPTIVE NOTICE.\n\nADDITIONAL NEWS ITEMS:\n\nTHE OLD RELIABLE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\n\nTHE OLD RELIABLE.\nLargest Selection of good old quality clocks.\nWEIGHT CLOCKS.\nAvailable at all points.\nCLOCK SHOPPE.\nPOST OFFICE JEWELRY STORE.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT, N. W. T.\nFRIDAY, DECEMBER 17, 1886.\n\nJ. D. MAVEETY, PROPRIETOR.\n\nTHIS PAPER may be found at\nROWELL & CO.'s Newspaper Advertising Office, Prince Albert, N.W.T., or at any place where newspapers are sold.\n\nFRIDAY, DEC. 17, 1886.\n\nTHE LIBERAL IDEA OF INDEPENDENCE.\n\nSome of the members of the Liberal Association here are a little nettled because, in our last issue, we undertook the very important task of exposing the present-day Canadian Liberalism. It is true, The Times should have no political leaning, but we thought it best to do so, as the call themselves claim the right to form a party association, nominate a party candidate, and exercise jurisdiction that the electors of their constituency as a whole, and the friends of the Government, shall unite in one voice, and state how promptly they will act when warranted their assertions. The Times must say nothing. They claim for themselves the right to criticize others, a free people, while they deny the poor, struggling newspaper man—the man who must think for himself—who is called to enlighten his fellow citizens, to the creation of political thought—the free expression of opinion—freedom of thought is to prevail in this country whatever will become of us? But it will not. We are not free, nor are we likely to remain free, or polite, with the liberality our friends of the Liberal Association only exert over the right which they possess as free men to form an association and nominate a candidate. But when they did so they showed their party spirit, and the spirit which is also known in a public way their allegiance to Mr. Blake—and they should be the last to protest against the right of others to have taken a stand quite opposite, and we claim the privilege of differing with them. Mr. Blake's policy, as we understand it, is supported by Liberals; but it is also opposed by Conservatives and others who belong to no party. We cannot consent to duty to oppose the candidacy who will support, not oppose, the government, and in doing so feel satisfied that we will serve the best interests of the province or the people of Saskatchewan. Of course, in doing so we have the satisfaction of knowing that we are acting according to our convictions. We took a liking for the G.O.M. in our youth, and the longer he lives the more we like him.\n\nFor Mr. Laird, personally, we have the greatest respect, and if he enters the contest we do doubt very much whether he will enter the race, but we are opposed with the utmost conviction. But we are opposed to him on local and political grounds, and we shall use every legitimate means to defeat him.\n\nMANHOOD SURFACE.\n\nIn starting on our career as a Paper it would be a very wise act on the part of the Dominion Government to give the privilege of voting to all those who have been born and raised in the Northwest for six months, and who have been citizens of the United Kingdom for five years. This would have the advantage of at once placing the franchise on the same basis as that of Ontario and Quebec, and obviating all subsequent alterations. It would start political parties in the race for power on a common platform, and put an end to the strife and dissension which has characterized the political contests of the Northwest. The settlers of the Northwest are not like a people who have been educated in the schools of responsible government. The great majority of them have been brought up without the advantages of education, and are consequently with their duties as a free people. Were it otherwise, manhood suffrage would have been of effect in placing the ballot in the hands of the ignorant, and enable them to override the intelligence of the country. Nothing is more certain than that the result of Canadian elections always depends upon the intelligence of the voters. A democracy cannot exist where there is no intelligence, and where there is no intelligence there can be no democracy. The result of Canadian elections always depends upon the intelligence of the voters. A democracy cannot exist where there is no intelligence, and where there is no intelligence there can be no democracy.\n\nEDITORIAL NOTES.\n\nAs the Municipal elections are approaching candidates should be forthwith nominated.\n\nThe meeting of the Manitoba Legislative Council, which was to have taken place yesterday, has been postponed owing to the uncertainty which exists about some of the details of the election, ballot boxes having mysteriously disappeared in some cases, and records being placed in others.\n\nWe last week received important news of \"Lord\" David Laird's election. \"This is to be treated in nine volumes, and will be a valuable work. Vol. 8 will be devoted to the Northwest.\"\n\nThe Liberal party are doing more now than ever before. If the intentions of the leading party may be trusted, the Liberals of the Northwest will never be visited with such an afflicting experience. Our party should be able to meet the situation with the air of confidence.\n\nWe learn from the Winnipeg Free Press that Lord David Laird has received a large number of letters from his constituents, that \"Liberalism is answered by a good majority,\" and that \"the Tory organization is declining.\" We quote these statements in the hope of giving a fair average for the Free Press; the result of the election will prove to be far beyond the truth.\n\nWe have received a communication from Mr. J. M. Cameron, of Edmonton, Alberta, in reply to M.C. Cameron, M.P., who reviews that gentleman's speech, taken up in the House of Commons, and says that he is only garbling facts, and that he does not convey an impression exactly the opposite of that which they were intended to convey. Mr. Cameron says that he fears he will not retire from public life, now that his political usefulness is gone.\n\nThe question of the election is decided, and we believe that we have found talent enough from which to select a representative, and that the Conservative party is a great mistake, which will make its mark in Till's store, Prince Albert, on Tuesday afternoon. We trust that the Liberal party will take advantage of the friends of the Government present, and that unanimity of purpose employed, as we have seen in the past, will be successful, made here and elsewhere that the friends of the Government in Saskatchewan are united, and that we shall have no reason to doubt that the friends of the Government in Saskatchewan have no need to go anywhere else than the sea for a candidate, but that they will elect a good man and elect him.\n\nCOMMUNICATIONS.\n\nA PACIFIC WAY OF PUTTING IT.\n\nTo the Editor of The Times:\n\nI am glad to see that the Conservatives of the district are about to organize in view of the Dominion elections. As the Liberal party have sent to Prince Albert several delegates, I am afraid that the Conservatives will find one somewhere around Vancouver Island. It is impossible even to come into play among local electorates, why not the Pacific.\n\nINDEPENDENCE.\n\nA LITTLE INQUIRER.\n\nFor the Editor of The Times.\n\nI am interested in the future of the Territorial Government, and I believe that the Liberals of Prince Albert have nominated Mr. David Laird, of P.E.I. If that statement is altogether correct, Mr. Laird will be elected in his native Province. Or is he one of the Wreckers? If so, stamp him out, and let him know that we know him best, and looking to find himself on the people of Saskatchewan. For my part, I am convinced that the man who has to have his native Province in quest of a place to rest his political ambitions in the lower regions as superior to Carrot River. If we cannot represent ourselves in the Lower Regions, then let us go to the North, where there is less latitude for Saskatchewanists! He is one who is destined to be a leader of the Northwest, but he must find his place, and let us hope that he will find it.\n\nWe want no political adventurers, but honest, hardworking, independent Nominees—a local man and a friend of the Government and we will vote for him.\n\nCARROT RIVER.\n\nD. H. Macdonald is expected home in a few days.\n\nALARMISTS OF Watches, Clocks and Jewellery.\n\nKEPT CONSTANTLY ON HAND.\n\nJUST ARRIVED.\n\nGENTS' FURNISHINGS.\n\nN.B.—The Tailoring Department will be superintended by Mr. Robinson.\n\nTHE WEST END STORE\n\nLadies' Six-Button Kid Gloves in White, Cream and Delicate Shades.\n\nAnd Full Lengths do in Silk thread, Just Received at\n\nCHAS. MAIR'S WEST END STORE,\n\nFashionable Laces in Cream, White and Black.\n\nA select assortment of Christmas Cards, very artistic, and at prices which everybody can afford to pay.\n\n'79. '86.\n\nBUY YOUR HARDWARE FROM\n\nT.J. AGNEW.\n\nHe Sells the Lowest in Town.\n\nWM. STOBART & CO.\n\nGeneral Merchants\n\nIndian Traders.\n\nWM. STOBART & CO.\n\nC.D. NORTHGRAVES, J. SINCLAIR & CO.\n\nWatchmaker and Jeweller.\n\nMerchant Tailors.\n\nAUT N. GRAVES'S New Shop\n\nNEW GOODS!\n\nREPAIRING PROMPTLY ATTENDED TO.\nCOME THIS WAY!\n\nNo Deviation in the Path that Leads to the\n\nBUSIEST STORE IN THE COUNTRY\n\nOur Patronage is Daily increasing, and why? Is there a reason for it, or does it merely happen that today our trade is much larger than yesterday, and tomorrow it will be larger than today? We know this is a community of sensible people, who not only have a reason, but a good one, for any acts they commit. When you see increasing numbers.\n\nHocking to a Particular Store!\n\nYou can put it down as a fact that there is something there worth having. One or two may be deceived, but a crowd is never misled, and this growing trade of ours is positive proof that we have won the confidence of the public. We are the friend of every economical buyer of\n\nStaple and Fancy Dry Goods,\nDress Goods, Silks,\nMantles and Carpets,\nGent's Furnishings and\nReady Made Clothing.\n\nALSO FULL LINES OF\nGENERAL GROCERIES\nWhich will always be found unsurpassed in quality and price.\n\nFlour, Feed & Provisions\n\nALWAYS IN STORE\n\nOur Stock in this Department is simply immense, and is one of the best assorted in the North West. Just opened out, another large lot of\n\nChina Tea Sets and\nPainted Granite Ware\n\nDirect from the old country. All new Styles and Patterns, and Prices Low.\n\nGLASSWARE\n\nIn Endless Variety. An examination of Our Stock respectfully solicited.\n\nFarmer's Produce taken in exchange\nHighest Prices Paid for Furs.\n\nWe value your patronage, and we want it. When you come into our store, our anxiety is to look to your interests, to please you, to save money for you, and to have you feel that it is to your profit to trade at\n\nJ. M. CAMPBELL'S\nGreat General Store, Prince Albert\n\nT. N. CAMPBELL.\n\nHOLIDAY\nFANCY GOODS!\n\nTHE LATEST NOVELTIES IN\nPlush, Brass, Bronze and Hand-Painted Goods\n\nNEVER BEFORE INTRODUCED INTO THE COUNTRY,\nCOMPRISING:\n\nDOOR BOTTLES,\nFANCY MIRRORS,\nPOLISHED IRON NOVELTIES,\nPARLOR WASTE BASKETS,\nWALL POCKETS,\nWHISK HOLDERS,\nGENT'S DRESSING CASES,\nWATCH RECEIVERS,\nPIPE RACKS,\nPHOTO ALBUMS,\nPHOTO FRAMES,\nAUTOGRAPH BOOKS,\nCARD CASES,\nHAND PAINTED BOOKLETS,\n\nHOLIDAY GIFT BOOKS,\nSTANDARD POSTS IN CLOTH,\nMORRICO,\nSTANDARD NOVELTIES - Dickens, Victor Hugo, Wilkie Collins, Lever, Dickens, E. P. Boe's Works,\nBOYS OWN ANNUAL,\nGIRLS OWN ANNUAL,\nBUTLING'S BOYS ANNUAL,\nCHATTERBOX,\nCHILDREN'S FRIEND,\nLITTLE WIDE AWAKE,\nCHURCH SERVICES AND BIBLES.\n\nLATEST NOVELTIES IN\nXmas Cards and\nSouvenirs.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 10 feet extra\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security to LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nThe Bellman, Nov. 29th says—\nSgt. Major Bradley, late of G Division, N.W.M., has been made Inspector.\nThis is a case of graded promotion well deserved.\n\nLynx have become scarce here within the past few weeks. They appear to be moving southeast, following the railroads, which have also disappeared.\n\nInspector Miller, late of G Division, N.W.M., who returned to his home in Hamilton on leave became ill in Hamilton so he could not proceed. His parents went out from Hamilton to assist him at home.\n\nBATTLEFORD.\n\nThe Herald of Nov. 29th says—\nA company of the Mounted Police have arrived here.\n\nPrime Ministers have removed their sawmill machinery to the banks of the Saskatchewan, to save the hauling of logs from the river.\n\nRev. H. Littlejohns preached his farewell sermon in the Methodist place of worship last Sunday evening. He will shortly return to Toronto.\n\nBees have been unusually numerous along the river this fall. Several have recently been killed by the Indians, many more have been seen. One was taking a walk last week on the banks of the river when he came across a swarm.\n\nThe starting river was opened on Saturday night. A cutting ring will also soon be opened.\n\nCALGARY.\n\nThe Tribune, Dec. 3rd says—\nOn Monday, the 2nd, Mr. Ballis, publisher of the Calgary Herald, addressed the Imperial Macdonald, at the Palace Hotel, charged by Hugh S. Cayley, M.N.W.C., and publisher of the Herald, with certain libelous statements made against him and addressed the Council during the late session while drunk. The case was enlarged and adjourned.\n\nA system of waterworks is being agitated for Calgary.\n\nFather Lacombe is establishing a new Indian mission near Fort Macleod.\n\nGov. Strange and family will reside in Calgary during the winter.\n\nHis Honor Lt. Governor Dewdney was in the city yesterday.\n\nSince the 1st of Nov., to the close of the month the Police Court fines collected in Calgary have amounted to $110, irrespective of costs.\n\nLETHBRIDGE.\n\nFrom the News Dec. 1st—\n\nThe new hospital is being rapidly pushed forward, and it is expected that it will be completed but plastering is about a month behind.\n\nA new school house is to be erected at a cost of $15,000.\n\nMr. J. W. Castillo, of Calgary, Assistant Secretary of Weights and Measures, was in town for a few days last week. He came down to inspect the new railway station and to see the sights of the N.W. C. & N Co. He says it will weigh now.\n\nTHE SECRETARY WAS THERE.\n\nIt was on the Maine Central Road between Augusta and Bangor. A well-dressed young man met the smoker and asked: \"Is there any gentlemen from Bangor in this car?\"\n\n\"Chesnut!\" yelled a young man who was engaged in a game of poker dollars ante.\n\n\"I am engaged in a civil question,\" said the well-dressed gentleman.\n\n\"Can you answer a civil question?\" said the poker player.\n\n\"If I'd said I was from Bangor, they'd have thought me a stranger and asked for the loan of your overcoat,\" and the everybody would have laughed. That racket, sir,\" said the smoker, \"must come down here—try it on some other fellow.\"\n\n\"Sir, you do me an injustice. I simply wished to know the secretary of the Bangor Chamber of Commerce's situation is in town at the present time.\"\n\n\"I'll take it all back—except my apologies,\" said the smoker. \"I'm Secretary of the V. M. C. A., very much at your service. Sit down till I scoop into this jack pot, and I'll see what I can do for you.\"—Drake's Magazine.\n\nWOMAN'S LOT.\n\nTo be honest as a woman's soul,\nWith a conscientious zeal,\nTo be industrious and good,\nThere is no end to it.\n\nTo comfort knew and dear discouragement,\nAnd to be true in all she did,\nHer life was one of constant prayer,\nAnd her death was one of peace.\n\nTo be kind to all she met,\nTo be charitable and just,\nTo be patient under trial,\nAnd to be everlastingly true.\n\nTo be faithful to her trust,\nTo be generous and forgiving,\nTo be loving and forgiving,\nAnd to be everlastingly true.\n\nTO OUR SUBSCRIBERS.\n\nRecognising the fact that while all our subscribers have enough to eat and drink the money market is a little tight—not quite so tight as it used to be—but reasonably, we beg to inform them that all that we are open to receive any thing in payment of our subscription is a good old turkey or a handsome and proper emu.\n\nA hay claim would also be cheerfully accepted provided it is not too late for the owner to get it to market from regular and convenient intervals, and that the hay is very good, and, perhaps, without straw, as an outside candidate without supporter; a little known.\n\nThe claim before the same is locked up by the balmy chink of a new press, and new material, and courage our pages to meet the most eagerly awaiting demands of our advertising agents, and at the same time be able to give publication space to the matters that are likely to be of interest to those who have not already subscribed will do so immediately, and thereby render us the better able to make the improvements contemplated.\n\nThe Times is now in its fifth year, and was the third newspaper published in the Territories, but it costs less than most people imagine, and it is a type of literature that has to be replaced every few years. We have, in the face of difficulties, which have been many, and under circumstances, endeavored to do our duty in the past, and will continue to do so in the future, for the benefit of the people. Send in your turkeys, etc.\n\nI AM Somewhat of a Liar MYSELF.\n\nSelling off at 50 per cent. below cost leaving in the spring for the folks of the river.\n\n$120,000 stock on hand.\n\nWe are not humbugging.\n\nWe mean business.\n\nWe are not advertising.\n\nWe can't wait on half our customers.\n\nAnybody buying $100 worth saves $25.\n\nWe are also in the wholesale business.\n\nWe pay cash for our goods.\n\nWe sell all kinds of goods.\n\nBooks are empty.\n\nRing the Chestnut Gong.\n\nW. R. FISH,\nGENERAL MERCHANT.\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nNEW GOODS\n\nAT\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nBUFFALO HALL!\n\nTHE GREAT HOUSE.\n\nBuffalo Hall! The Great House.\n\nShould you require any kind of Tobacco, Tea, Sugar, Coffee, etc., send your orders to Betts & Gwynne.\n\nSTOVES!\n\nAre still selling at very low prices. To find out how they are, one should inspect my stock. I sell a Good 25 inch Box Stove for $10.50, Handsome heavy Parlor Heater, $18, Good square Cook Stove, $27.\n\nI have a first-class workroom, and will execute all orders for Tansmith's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\n\nA FULL STOCK.\n\nJ. R. McPHAIL.\n\nBusiness Notice.\n\nAll parties having any claims against us are requested to hand them in at once, and all parties indebted to us are requested to make satisfactory settlement of their accounts up to 30th of the present month, as we close our year's business at that date.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS,\nSideboards, Cupboards, Bureaus.\nWashstands, Sofas, Easy Chairs\nBedsteads, Mattresses, Co's, Cradles.\nAnd all kinds of Chairs, Etc., which I am selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Elsewhere.\nFurniture Repaired on Short Notice.\n\nW. B. GOODFELLOW.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886121701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6226, "total-output-tokens": 5765, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3929, 1], [3929, 12885, 2], [12885, 15840, 3], [15840, 23101, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]