[{"id": "cfd278ea972adaf4d90a5cc3248da88e52892d11", "text": "PULL THE LINE.\n\nAn old quarter heard a train in the other day and sat on an air of deep concern watching the scene. He noticed that when the conductor pulled the rope the train stopped, and he did not direct the passengers to get off. The old fellow attached to pull a cord, but determined not to exhaust himself by doing so. He often crashed into locomotives—his head was always hanging out of the window of the waiting farm house and there seemed to be trying to keep up with the train. Sprouting from his neck began the balloon-like growths which caused him to stand still. The old fellow got off, and found himself in a field where he had been carried along by the motion of the train. When he recovered the conductor came up and tried to pull the bell cord as though he would break it, and turn- ing to the old fellow said:\n\n\"What have you been doing?\"\n\n\"Sprouted my hair,\" snatched thoughtfully back his head once more! How I didn't break myself!\n\n\"I wish you had broken yourself and not used me as a support!\"\n\n\"You've continued me as much as you pleased,\" said the conductor. \"I'll try if I could take a pull at the bell cord.\"\n\n\"Why did you hang that bell?\"\n\n\"What made you hang that bell line? I told you to hang it on my hat.\"\n\n\"You hate's not worth fifteen cents.\"\n\n\"Not to hang it, because you hate's not yours,\" said the conductor. \"But you hate's all I've got, and I'm glad if I could take a pull at the bell cord.\"\n\nPull that rope again and I'll leave you in the woods.\"\n\n\"I won't hang it now, but I'll hang it on my hat, so when you take it off, look out.\"\n\n\"If I did hang it, you'd have your hat on.\"\n\n\"The window was put here to look out of, not to hang a bell line.\"\n\nAfter while the train stopped on a bridge and the old fellow came out. A dog of wild appearance came up and barked.\n\n\"There!\" he exclaimed. \"Hanged if she ain't gone.\"\n\n\"What's the matter?\" asked the conductor who had witnessed the calamity.\n\n\"Yonder she goes!\" said the old fellow pointing to the dog.\n\nThe conductor laughed. \"How did she happen to go?\"\n\n\"See back there,\" said the conductor, \"she was there first after she had run.\"\n\nThe conductor looked at the old fellow and said:\n\n\"What do you think of that fellow?\"\n\n\"Try hanging your rope again.\"\n\n\"There is nothing very handsy\" and he handed the old fellow a half pint bottle. \"Take a little of this, it will do you good.\"\n\n\"Yes, but you mustn't hang it on your hat.\"\n\nThe conductor looked at him a moment and said:\n\n\"What do you think of that fellow?\"\n\n\"Try hanging your rope again.\"\n\n\"There is nothing very handsy\" and he handed the old fellow a half pint bottle. \"Take a little of this, it will do you good.\"\n\n\"Yes, but you mustn't hang it on your hat.\"\n\nThe conductor looked at him a moment and said:\n\n\"What do you think of that fellow?\"\n\nPROSPECTUS OF THE Prince Albert's Directory AND BUSINESS GUIDE.\n\nIt is proposed to issue a Business Directory for the town of Prince Albert and District of Lorne in a pamphlet form which will contain the advertisements of each business establishment, to be inserted at a nominal rate and a descriptive notice of each.\n\nThe purpose will contain a history of Prince Albert and District, together with future prospects, together with a statement of this year's crops as far as they can be ascertained, the number of District Lots, the extent of average forestland, number of bovine per acre, increase over last year's crop, population of District, a list of local information written by a well known journalist.\n\nAbout 500 or more copies will be published and distributed free of charge to residents, which will be distributed throughout the Dominion and the Mother Country.\n\nIt is hoped that by this means, benefits will result, not only to each individual advertiser and subscriber, but to the whole community, by increased trade and an appreciation both of the land and climate and a healthy emigration encouraged to this country.\n\nPrice of advertisement, single page with notice on opposite page, $10; two pages given free. Single copies, 50 cents.\n\nTHE GLOBE PRINTING CO., Limited.\n\nTHE GREAT DOLLAR PAPER.\n\nSPINK & MAVETY,\n\nPRINCIPIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., Etc., PRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPRINCIPIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT\nPENNSYLVANIA PACIFIC COMPANY,\n\nHEINTZMAN\n\nAND\n\nCOMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, -- ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\n1ST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT, N.W.T.\nWHAT A WOMAN CAN DO.\n\nShe can say \"No\" and stick to it for all time.\n\nShe can say \"Yes\" in such a low, soft voice, that it means \"No.\"\n\nShe can sharpen lead pencil if you give her plenty of paper and plenty of pencils.\n\nShe can dance all night in a room full of noise and have no small talk, and enjoy every minute of the time.\n\nShe can pass a display window of dry goods without stopping—if she is running to catch a train.\n\nShe can wash half the night with a colicky baby in her arms without once expressing a demand to remove the infant.\n\nShe can read a newspaper from the breakfast table five years after the marriage ceremony has taken place.\n\nShe can suffer abuse and neglect for years which would break a kinder or more considerate wife into fits of despair.\n\nShe can go to the theatre every evening and still have enough money left over Saturday, and still possess sufficient strength to attend a Sunday night sacred service.\n\nShe can go to church and afterward tell you what every woman in the congregation had on, and in some cases instruct you to get a faint idea of what the text was.\n\nShe can look her husband square in the eye when he tells her how much cook and hard work have been put upon her \"off late,\" without betraying in the least that she knows him to be a colossal liar.\n\nShe can save up $17,000 worth of dry goods and then sell them at a loss, with an order to have it delivered four miles away, in a style that will terrify the proprietor of the establishment with admiration.\n\nShe can do just what she wants. A woman can do anything or everything and still be a good wife. She can do what a man can do in an hour, and cook better than he does. She can make the longest loads of clothes last longer than they ought to, and they will never know it. Yes, a woman can do anything, with but one exception—she cannot lie.\n\nThere is another thing a woman cannot do—go past a mirror without stopping to have a look at her hair and things.\n\nBACH ADAMS' TRUE STORY.\n\nWhen Emma Adams came home after that memorable and disastrous voyage, which ended in her death, she went to her house, as she did before, and looked in the window. There stood Philip Adams, Emma's husband, and their child, all seated around the hearth watching the walls.\n\nThe whole bitter truth came upon him with terrible force. Anna, supposing Emma to be dead, had married Philip, so as to have a house and herds and child to take care of. She had come back for Emma, and he was mad about it. Not only was his own child had to be sent to live with his aunt, but Emma, though that was a bitter pill, as the child needed a little Philip anyhow.\n\nNeither of them knew as to what Philip was doing. Anna, supposing Emma to be dead, had married Philip, so as to have a house and herds and child to take care of. She had come back for Emma, and he was mad about it. Not only was his own child had to be sent to live with his aunt, but Emma, though that was a bitter pill, as the child needed a little Philip anyhow.\n\nThe new Governor General.\n\nCapt. Deville, Chief Inspector of our work, who is now ill, will succeed Mr. Land and James as Governor General. Ottawa Free Press.\n\nMrs. MacPherson of Morley, has been paying her aunt, Mrs. Hardisty, a visit. The rate of payng ladies in Calgary are somewhat like that of angels. They are paid for labor, and that labor is always handled with joy by all the bachelors, especially those of the legal profession, in the place. —Ottawa Free Press.\n\n(The young lady referred to has many friends in Prince Albert, medical as well as legal.)\n\nO. E. HUGHES & CO.,\n\nGeneral Merchants AND Indian Traders,\n\nFUR and WINTER GOODS.\n\nLadies Cardigan Jackets, Persian Lamb Hats, etc.\n\nPRINCE ALBERT, N.W.T.\n\nGREAT OFFER.\n\nTHE Winnipeg Weekly Sun\n\nFROM NOW TO January 1st, 1885, FOR $1.50, PAYABLE IN ADVANCE.\n\nWeekly Sun and Weekly Globs or Mail, $2.25 per annum.\n\nBOOTS AND SHOES CHEAP.\n\nWe claim to have the best assorted stock in Boots AND Shoes in Prince Albert, and are selling at prices which defy competition.\n\nCUSTOM WORK\n\nWarranted and insured against notice.\n\nREPAIRING\n\nPromptly attended to.\n\nSHANNON & McLEOD\n\nNOTICE.\n\nThe 20th of December, 1883.\n\nFirst Class Hay & Barley\n\nWH BARTLETT\n\nOFFICE HOURS:\n\nFrom 9 a.m. to 12 p.m.\n\nFrom 1 p.m. to 6 p.m.\n\nPUBLIC NOTICE IS HEREBY GIVEN that all persons who may be interested in the property of the Dominion Lands Office and all parties are warned that any person who shall attempt to convey possession to land unauthorized in writing by a person in the office of the Dominion Lands Office, will be prosecuted.\n\nE. DEVILLE\n\nChief Inspector of Government Surveyors.\n\nFitzgerald Cochran\n\nGovernment Surveyor, Assistant Commissioner of Surveyors.\n\nGovernment House,\n\nPrince Albert, N.W.T.\n\nJACKSON JACKSON\n\nPrince Albert, Batoche's T. O. DAVIS.\n\nBONANZA! PHOTOGRAPHS!\n\nStill on the War Path\n\nWITH A LARGE LINE OF GOODS.\n\nAnd Slaughtering the Prices.\n\nChas. E. Page.\n\nNEW STUDIO.\n\nEAST END.\n\nDry Goods and Novelties!\n\nIncluding a large line of\n\nBritish Goods, Ladies' and Gentlemen's Clothing, Books and Stationery, Handkerchiefs, Laces, Ribbons, Umbrellas, Apples, Apricots, Bananas, Prunes, Gingerbread, Candy, etc., also a large stock of Ready Made Clothing, Fur Caps and Overcoats, Gloves, Scarves, Shawls, Bonnets, Hats, Shawls, Muffins, etc.\n\nAll orders promptly filled, and each article of our stock will satisfy the closest buyer.\n\nJ. M. CAMPBELL.\n\nTRESTON HOUSE\n\nBest Billiard Hall west of Winnipeg.\n\nFIRST CLASS POOL & CAROM TABLES\n\nWM. BURKE, Prop.\n\nJAMES SINCLAIR,\n\nMerchant Tailor.\n\nHas just received his new stock of Fall and Winter Goods.\n\nAnd is prepared to supply his numerous customers with\n\nSuites to please the fancy of all.\n\nAlso a large stock of\n\nUNE CLOTHING\n\nA Large Assortment of\n\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\n\nEAST END BAKERY\n\nEight Loaves for $1.\n\nHUGH M'DOUGALL\n\nEast End Bakery.\n\nWALTERS\n\nAND\n\nBAKER,\n\nGeneral Merchants.\n\nCHEAP CHEAP CHEAP\n\nFor Cash Only.\n\nI keep my books and parties paying cash will get the benefit.\n\nKILVERT & DUGGAN.\n\nPhotographers.\n\nFull Lines Dry Goods.\n\nFull Lines Groceries.\n\nFull Lines Fancy Goods.\n\nToys and Xmas Gifts.\n\nXmas Cards, etc., etc.\n\nCHEAP CHEAP CHEAP\n\nFor Cash Only.\n\nI keep my books and parties paying cash will get the benefit.\n\nT. O. DAVIS.\nCOMMUNICATIONS.\n\nTHE TELEGRAPH.\n\nTo the Editor of The Times.\n\nSir,-After an absence from Prince Albert that has been considerable, I find that there have been considerable developments over telegraph matters, so attention has been drawn to the latter in the last issue of the paper. It appears that a letter was written to Prince Albert, some of whose contents are included in which I am unable to quote.\n\nFrom this letter again: \"Mr. Clarke will appear that the offer of a site for an office at Guelph was made by Mr. Clarke, but accepted by Mr. Hartley until he arrived at Prince Albert on November 2nd. When I was in Barrie about two weeks ago I had a conversation with Mr. Hartley Gibberson, District Telegraph Superintendent, who informed me that he had heard nothing of this matter, and that he had no knowledge of it. He said that he had heard nothing of this subject, having been a member of the committee appointed to procure the place required by the Government, and when he said that he had heard nothing of this matter, Mr. Clarke had offered two lots then, and the question had been discussed. Mr. Clarke was not the largest contributor, he (Gibberson) considered that he had the best right to be heard, and that he should not suffer from anybody else. I pointed out to him that the place selected was very inconvenient for the people of Prince Albert and I offered myself to give him a convenient site on the Main Street, about thirty yards of the Main Street, but he refused to accept it, saying that he could not. I also referred him to Mr. Martin, Mr. Baker, who was willing to give him a site, but none offered by me did not suit. This will show that the statement that Mr. Clarke was the only person who offered to give him a convenient site on the Main Street, is quite incorrect.\n\nMr. Gibberson went to Prince Albert on Saturday, and that it was all arranged before he came here. Mr. Gibberson is very much interested in the matter and regards very much that I should be present during the exciting scenes which have taken place, and that I should have a voice in what is being done for the benefit of the people and in favor of placing the office where the majority of the people feel that it should be.\n\nA. E. PORTER, M.P.\n\nTo the Editor of The Times.\n\nSir,-Notwithstanding the indications that will permit me to handle any great amount of words through your columns with parties who are setting the telegraph right or wrong, I am obliged to declare it necessary to send their communications direct to newspapers and allowing them to do so, I shall not be able to publish their names in the article. But their checks make them deserving of a passing mention. I believe that the letters were devoid of facts and full of ignorance may have been the excuse of Mr. Gibberson for the People being sent out through the Prince Albert Leader on telegraph matters, if so, I have only to say that they are not agreeable with the Eastern people who have transferred their ideals of Guelph property without protest will incurring the act of treason by referring to the lack of judgment in parting with valuable land in the centre of the busy town. Such property would be worth more than they might secure more land in a location which we now hear can only boast of a few houses, and which is not on the list of locations containing any of the wild statements made one of by those disappeared working men who have deserted their homes to the barren lands, ignoring that these a man's comfort will be no doubt dealt with by the same day consideration, and to refer to numerous communications, which from their tone will lead the public to believe was generated by the telegraph office, declaring their letters have been accused and convicted of playing the marionette part of informer. They have certainly displayed no fear of being exposed by the report of the incorporation of the telegraph line as was mentioned to the public last night, the fact of river lots 79 and 78 possessing an assessement property of $400,000 on the land, which is now being mentioned, while today, the heavy telegraph center, can boast of about one third the assessment. The telegraph office is making complaints which strengthens the fact that the end of the telegraph line is here. Mr. Gibberson, who is now such a prominent at the H.B.C., can easily order and the very low income element by whom they are surrounded will claim a change. After all, the telegraph office is influencing the development.\n\nWeather Report.\n\nWe publish today a corrected list of readings of the thermometer, from Nov. 25th, kindly furnished by Mr. James Gibson, Manager of the Canada College. We shall continue to furnish a weekly report.\n\nMonday, Nov. 28 1 -21\nTuesday, Nov. 29 2 -22\nWednesday, Nov. 30 3 -23\nThursday, Dec. 1 4 -24\nFriday, Dec. 2 5 -25\nSaturday, Dec. 3 6 -26\nSunday, Dec. 4 7 -27\nMonday, Dec. 5 8 -28\nTuesday, Dec. 6 9 -29\nWednesday, Dec. 7 10 -30\n\nIt will be seen that there was a difference of 74 degrees in the temperature on the 28th Nov. and 29th Dec.\n\nChester Thompson's store, through the kindness of Mr. R. H. Clark, Monday.\n\nThe Hon. Lawrence Clarke, who has been confined to the house the past few days.\n\nWe are sorry to hear of the serious illness of the Hon. Lawrence Clarke, who has been confined to the house the past few days.\n\nThe opening service in the Church of England School Chapel, in the Leadlay District was held on Sunday Nov. 23rd. The Chapel was filled to capacity, and the service was conducted by Rev. Mr. Leadlay, who spoke about the prayers. It cost about $800 in addition to handsome subscriptions and lumber from the Hon. Lawrence Clarke and Mr. Leadlay. The district is under the charge of the Rev. Mr. Leadlay. Service is held in the Chapel every morning.\n\nA telegram has come to Colonel Richardson and Mr. Gibberson, informing them of the death of Mr. Gibberson, the sentence for the murder of John McCarter, the former Treasurer of the Guelph and North-Western Railway. The prisoner shall be hanged. It seems strange that some kind of confusion in which he tries to implicate a third person, a white man, who, he says, saw John the receipt. - Regina Leader.\n\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nHUDSON'S BAY CO'Y\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\nThe Hudson's Bay Company own 3,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\nALSO\nTOWN LOTS FOR SALE\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRIDGES, Land Commissioner.\nPrince Albert Bakery.\n2LB LOAF, 12¢.\n9 LOAVES, 1$.\nCakes and Pastries always on hand and made to order.\n\nWM. R. BELL.\nNOTICE.\nJUST ARRIVED\n100 HORSES\nCONSISTING OF\nWORK, SADDLE AND BROOD MARES.\nFreighting, express and passenger traffic from Guelph's Crossing to Troy and back.\nPH. GARNOT.\nAgent, Ilesha's Crossing, South Branch.\n\nFURNITURE\nJust arrived, in addition to our regular stock we have received a large lot of Fancy Parlor and Bedroom Sets, Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions, Cradles & Cribs for the Babies, Rocking Chairs for the Ladies, Mattresses Single & Double to suit Customers.\n\nG. & G. E. CARTER.\n\nCOAL OIL.\n500 GALLONS,\nAMERICAN AND CANADIAN.\nAT\nJ. L. JOHNSON & CO'S.\n\nN. B. - We sell by Imperial Measure. You get one-half more by buying Imperial Measure. Test it by the weight.\n\nTHE SHORT LINE TO\nALL ONTARIO POINTS\nAll ticket agents sell tickets via this new and popular line.\nJAMES ROSS.\nGen. Mgr.\nJ. W. LEONARD.\nGen. Pass. Agent.\n\nTHE ROYAL ROUTE.\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railways.\nExpress trains over the Royal Route have all the luxuries of Modern Express Travel, Palace Dining Rooms, luxurious sleeping cars, sleeping cars, and elegant Day and Night Coaches. Express trains run daily from Chicago to Sleeping Car, with no change of cars for the distance between Chicago, Milwaukee, St. Paul and Chicago; also change of cars between St. Paul and Duluth, with baggage cars running in both directions.\nIf you wish the best travelling Accommodations and Rates, go Royal Route.\n\nROYAL ROUTE.\nJ. HIGHLAND, Gen. Traffic Manager.\nT. W. TRANDALE, Gen. Passenger Agent.\nSt. P., M. & M. Railway.\n\nTime Table.\nROYAL ROUTE.\nExpress leaves St. Vincent at 11 o'clock, arriving at St. Paul at 8.45 following day, connecting with all trains with both ends running in all directions.\n\nExpress leaves St. Paul at 11 o'clock, arriving at St. Vincent at 8.45 following day, connecting with all trains with both ends running in all directions.\n\nTrains run between St. Paul and Minneapolis every hour, stopping only at all stations.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883120701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 5158, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 4679, 3], [4679, 5096, 4], [5096, 11390, 5], [11390, 20502, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]