[{"id": "f0f9666e70417c354b305d973eac1e46519ad0d6", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MARCH 23, 1888.\n$2.50 A YEAR.\n\nBANKINGHOUSE OF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nA. C. PATTERSON,\nForwarding Agent.\n\nSEEDS\n\nC. R. STOVEL\n(With Dr. Harvey, of Winnipeg.)\n\nDENTAL TELEGRAPHIC.\n\nCHIT-CHAT LOCAL\n\nGathered by our Reporter\n\nSee C. E. Stovell's advertisement.\n\nOranges and apples at J. G. Maclean's.\n\nMr. Finkleate for 40 cents at T. Davis'.\n\nThe new Dr. Jolliffe is expected shortly.\n\nThe arrival has been rather patchy on account of unsuitable weather.\n\nT. E. Jackson has received this week a good supply of drugs and chemicals from Mr. Finkleate.\n\nLadies, call at T. O. Davis' and see me about Fencing. Velvet trimming a specialty.\n\nJ. C. McNeven has recovered sufficiently to be removed to his home at Ridge on Wednesday last.\n\nH. H. Hoag has his photographic gallery open every evening and can be kept busy any time taking pictures.\n\nJudge Metcalfe, Sheriff Hughson and Mr. McKay arrived back from Battleford early yesterday morning.\n\nWe were visited by Jack Frost Tuesday evening. He sat on the thermometer and promised it down to 4 below zero.\n\nSam. and Mrs. McLeod and Mr. M. Lellan, late of Hutchison & Co., have returned from Winnipeg, arriving in town with Mr. Campbell.\n\nThere will be an examination of school children on Thursday, the 29th inst. The examination is extended so as to take an interest in the Public schools.\n\nJ. M. Campbell arrived back in town yesterday evening from the east, having been here for several weeks. He brought Miss Nichol with him.\n\nA fine assortment of coloured spectacles, goggles to protect the eyes from the glare of the sun, by Mr. K. Jackson.\n\nMessrs. R. C. McKeown, Indian Agent at Duck Lake, Jon. Finlayson, Agent at Methowana reserve and Geo. Chaffey, Farm Instructor, were in town this week.\n\nBetts & Gaynor have taken their turn at the Medical Hall. They have over due accounts, that must square up. All those interested will find it to their advantage to do so promptly unless they prefer paying the interest.\n\nA meeting of the fire brigade was held at the Fire Hall on Wednesday evening. The following members were elected: Captain, W. R. Fish; 1st Lieut. B. Spratt; 2nd Lieut., S. Donaldson; Captains of divisions, R. Gaynor and J. McLeod.\n\nAn examination of the High School will be held in the school rooms on Monday, March 15, at which time the parents and other friends of the institution are cordially invited to attend. In the evening, at 7 o'clock, there will be a recital consisting of songs, recitations, reading of essays and presentation of prizes. It is hoped that all parents of the present or higher education will show their earnest efforts made amongst them by their presence.\n\nHandicapped Blind Batters, Warner's Safe Car, Vegetable Discovery and Pain Killer just received at the Medical Hall.\n\nThere will be a public exhibition of the children of the school during the week of March 15. On Tuesday the children will be examined in reading and writing, Thursday afternoon in grammar, composition and geography; on Thursday in arithmetic. At 7 p.m. on Friday evening there will be a hand and finger drawing on the blackboard to be followed by the distribution of prizes by Mr. James of Transcona and Mr. Clark, who has donated money for the purpose, there will be a distribution of prizes to be given out to the pupils. Parents and others interested are cordially invited by the teacher to be present during any day of the exhibition.\n\nSubscribe for your newspapers at Cass's Booksellers. Subscriptions received for all Canadian, American and Foreign Publications at lowest rates.\n\nPRINCE ALBERT, SASK., FRIDAY, MARCH 23, 1888.\n$2.50 A YEAR.\n\nBANKINGHOUSE OF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nA. C. PATTERSON,\nForwarding Agent.\n\nSEEDS\n\nC. R. STOVEL\n(With Dr. Harvey, of Winnipeg.)\n\nDENTAL TELEGRAPHIC.\n\nCHIT-CHAT LOCAL\n\nGathered by our Reporter\n\nSee C. E. Stovell's advertisement.\n\nOranges and apples at J. G. Maclean's.\n\nMr. Finkleate for 40 cents at T. Davis'.\n\nThe new Dr. Jolliffe is expected shortly.\n\nThe arrival has been rather patchy on account of unsuitable weather.\n\nT. E. Jackson has received this week a good supply of drugs and chemicals from Mr. Finkleate.\n\nLadies, call at T. O. Davis' and see me about Fencing. Velvet trimming a specialty.\n\nJ. C. McNeven has recovered sufficiently to be removed to his home at Ridge on Wednesday last.\n\nH. H. Hoag has his photographic gallery open every evening and can be kept busy any time taking pictures.\n\nJudge Metcalfe, Sheriff Hughson and Mr. McKay arrived back from Battleford early yesterday morning.\n\nWe were visited by Jack Frost Tuesday evening. He sat on the thermometer and promised it down to 4 below zero.\n\nSam. and Mrs. McLeod and Mr. M. Lellan, late of Hutchison & Co., have returned from Winnipeg, arriving in town with Mr. Campbell.\n\nThere will be an examination of school children on Thursday, the 29th inst. The examination is extended so as to take an interest in the Public schools.\n\nJ. M. Campbell arrived back in town yesterday evening from the east, having been here for several weeks. He brought Miss Nichol with him.\n\nA fine assortment of coloured spectacles, goggles to protect the eyes from the glare of the sun, by Mr. K. Jackson.\n\nMessrs. R. C. McKeown, Indian Agent at Duck Lake, Jon. Finlayson, Agent at Methowana reserve and Geo. Chaffey, Farm Instructor, were in town this week.\n\nBetts & Gaynor have taken their turn at the Medical Hall. They have over due accounts, that must square up. All those interested will find it to their advantage to do so promptly unless they prefer paying the interest.\n\nA meeting of the fire brigade was held at the Fire Hall on Wednesday evening. The following members were elected: Captain, W. R. Fish; 1st Lieut. B. Spratt; 2nd Lieut., S. Donaldson; Captains of divisions, R. Gaynor and J. McLeod.\n\nAn examination of the High School will be held in the school rooms on Monday, March 15, at which time the parents and other friends of the institution are cordially invited to attend. In the evening, at 7 o'clock, there will be a recital consisting of songs, recitations, reading of essays and presentation of prizes. It is hoped that all parents of the present or higher education will show their earnest efforts made amongst them by their presence.\n\nHandicapped Blind Batters, Warner's Safe Car, Vegetable Discovery and Pain Killer just received at the Medical Hall.\n\nThere will be a public exhibition of the children of the school during the week of March 15. On Tuesday the children will be examined in reading and writing, Thursday afternoon in grammar, composition and geography; on Thursday in arithmetic. At 7 p.m. on Friday evening there will be a hand and finger drawing on the blackboard to be followed by the distribution of prizes by Mr. James of Transcona and Mr. Clark, who has donated money for the purpose, there will be a distribution of prizes to be given out to the pupils. Parents and others interested are cordially invited by the teacher to be present during any day of the exhibition.\n\nSubscribe for your newspapers at Cass's Booksellers. Subscriptions received for all Canadian, American and Foreign Publications at lowest rates.\nFRIDAY, MARCH 23, 1888.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVETTY\nAT\nPRINCE ALBERT, N.W.T.\nEvery day except Saturday, at 9 o'clock, and every evening at 6 o'clock.\nNo case will be inserted in this paper. Business letters will be promptly answered, and personal letters will be answered in full.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVETTY, Proprietor\n\nSUNDAY CHURCH SERVICES\nSt. Albert's and St. Mary's Church—Sunday morning service—10 A.M.\nSt. James'—3 P.M.—Rev. J. T. Taylor.\nSt. John's—6 P.M.—Rev. J. T. Taylor.\nSt. Peter's—7 P.M.—Rev. J. T. Taylor.\nSt. Matthew's—10 P.M.—Rev. Canon Macdonald.\nSt. Paul's—3 P.M.—Rev. Canon Macdonald.\nSt. Andrew's—10:30 A.M.—Rev. Canon Macdonald.\nSt. John's—3 P.M.—Rev. J. T. Taylor.\nSt. James'—6 P.M.—Rev. J. T. Taylor.\nSt. Peter's—7 P.M.—Rev. J. T. Taylor.\nSt. Matthew's—10 P.M.—Rev. Canon Macdonald.\nSt. Paul's—3 P.M.—Rev. Canon Macdonald.\nSt. Andrew's—10:30 A.M.—Rev. Canon Macdonald.\n\nWAR AND RUMORS OF WAR\nUnder the above caption the Battlefield Herald of the 2nd inst. made an article which seems to create an impression that there is great danger of an Indian uprising in the spring. It says that trouble is foreshadowed in many ways, but fails to give a single instance for its belief. We believe there is no rumor of something of the same kind in 1885, and that rumor was followed by an Indian war. We have made careful inquiries into the feelings of the Indians throughout the district, but at Battlefield, and we cannot find that there is the slightest cause for uneasiness. From the general tone of the Herald we would infer that this article has been written in order to create a feeling of uneasiness among the people, and that there will be a large mounted police expenditure there the people of the place will be in a very bad plight. In other words, the Herald wants a large force of soldiers there, not so much to increase the taxes as to spend money in the place. We hope they will get the additional Police required and that the settlement will prosper accordingly, instead of being made worse.\n\nThis paper will settle the vexed question of disallowance, but whether it will settle all the future questions is not known. It must be borne in mind that even though the monopoly clause may have been repealed, yet the Federal authorities have exactly the same right to direct matters of the Local Legislature of Manitoba as they had before, and will, doubtless—should the necessity arise—find as good an excuse for doing so as they did in the past, unless under the present laws now being made a definite guarantee is given that the power shall not be exercised.\n\nThe people of Manitoba are justly gratified no doubt at the victory they believe they have achieved, and are sincerely thankful for the protection that has been given to their territory, and we heartily join in their rejoicing; but they should not stop short of a direct assurance that the monopoly clause will not be exercised in the future as it has been in the past, lest they wake up some morning to find that the abolition of the hated monopoly clause was only a rise on the part of the Government to put the people in the wrong, and that they will continue to deal with the local railway acts in the same spirit as they have dealt with them in the absence of any other.\n\nTHOS. O. DAVIS\n\nHORSE SHOE STORE\nThe Only First Class Store in the District.\nWe Are Right ON THE BOOM\nThis is no Bonus Sale—We are not Dissolving Partnership. Our Health is Good and our Friends not Weary. We Don't Try to Give You Discounts.\nBut we can give you Goods Cheaper than any other House in town.\nWe have just received a Mammoth Stock—All Fresh, Clean Goods!\nLATEST STYLES, PATTERNS AND DESIGNS\nWhich we will sell at cost, just to make things interesting for our friends.\nRemember—We offer you no old shop wares or winter stock, but new Spring goods at the following prices, and SMILE.\nGingham 10c. Grey Cottons 6, Prints 8, White Cottons 8, Flannels 20, Plush $1.\nClothing—Men's Suits $5, Felt Hats 25c,\nGROCERIES\nBlack Tea 25c. Tomatoes 20c. Corn 20c. California Fruit 45c. Dried Apples 12c. Evaporated Apples 17c. Rice 8c. Matches 15c. Lollipops 6c. Coofish 10c.\nAll Other Goods in Proportion,\nBoots and Shoes at Cost.\n\nTHOS. O. DAVIS\n\nNOTICE!\nT. J. AGNEW takes stock and Closes his Books on 30th of April. Parties indebted to him would greatly oblige by arranging their accounts previous to that date.\nUntil said date all goods will be greatly REDUCED FOR CASH.\nFULL LINES ON HAND OF\nBREAK PLOWS, CROSS PLOWS, IRON HARROWS, GARDEN TOOLS, COAL OIL, BOSS CHURNS, MILK PAILS, CREAMERS, BUILDING HARDWARE\nAT\nT. J. AGNEW'S.\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING.\nOffice Stationery, etc., etc.,\nGENERAL NEWS.\n\nLondon, March 12.—Preparations for the reception of the Standard have been completed at the railway station. The Standard will be received by Lord Stanley after a short stay in London.\n\nAmong the presentations to the Prince of Wales at the levee at St. James's Palace was the sword presented by the Governor-General of Canada about the middle of June and be succeeded by Lord Stanley after a short stay in London.\n\nLord Stanley has been appointed President of the Imperial Federation League, of which he is a prominent supporter.\n\nAmong the presentations to the Prince of Wales at the levee at St. James's Palace was the sword presented by the Governor-General of Canada about the middle of June and be succeeded by Lord Stanley after a short stay in London.\n\nLord Stanley has been appointed President of the Imperial Federation League, of which he is a prominent supporter.\n\nA BULL TRAIN.\n\nSome queer names and queer transports are used in the world, and among them is the method for carrying coal from the mines at Lethbridge, Alta., to Macleod, thirty-five miles distant, in the same territory of Canada.\n\nA team is made up of say three enormous wagons, each carrying from two thousand five hundred pounds to three thousand pounds and holding as high as twelve thousand pounds of coal. To each are attached four yokes of oxen to twenty large oxen. The train consists of fifteen or eighteen wagons in all and covered by heavy canvas. Each team has one driver who uses a long and heavy whip which he uses with great skill and appropriate language. The whole team is called a \"bull train\" and the cook and night herder make up the \"outfit,\" as the common western term goes. It takes nine days to travel the thirty-five miles a day and has carried sixty-five tons of hay into Macleod at one time, though the total load is from fifty-five to fifty-eight tons.\n\nThe night herder drives the oxen to pasture, watches them and returns them for the day's work, as the animals get nothing but grass.\n\nOne of these trains is an eight-wheeled, and the most eastern vehicle standing out in the prairie. Some of the teams are trying to knot their harnesses so that there are simpler things than the \"bull train.\" One team of two of that whip, a sorcerer, named John \"Jeff Davis,\" the boss, and one of his helpers, named \"Old Man,\" ride upon itself, and yet they laugh. It seems so simple, but reader, if you want to see a real bull train by making a five-cent run, hold dinner by the side of one pole of each in your best clothing.\n\nEDMONTON.\n\nFrom the Edmonton News, March 12.\n\nIt is reported that Chief Factor Hare shortly came to an agreement between himself and the Government regarding the sale of the R. S. Co. for the North West Mounted Police.\n\nOn the trip back the last outgoing stage failed to make the Lion Pass and returned on Monday night. After dark a party of Indians had been seen near the pass and the next morning a number of Indians were seen near the stage, who were said to be on the lookout. When the stage came to was plainly sight of and only a short distance from the stopping place.\n\nNOTICE.\n\nSealed Tenders accompanied by the usual deposit, signed and sealed, will be received at the undersigned Agent's Office, in Edmonton, until Monday, the sixteenth day of April, 1886.\n\nJ. M. Campbell\n\nFirst Class Goods\n\nMagnificent New Spring Goods\n\nFar surpassing any previous seasons, both for richness of design and quality. The variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. Campbell\n\nDry Lumber\n\nMoore & Macdowall\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 19 feet extra\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50¢ per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTELEGRAFIC.\n\nIn the House today the debate on Commercial union was resumed and will be continued tomorrow.\n\nA delegation from Calgary this morning went to the Governor General's residence to make representations regarding the question of the Royal Canadian Mounted Police. They will also meet the Prime Minister and other prominent figures in the Government.\n\nThe Prince Albert men will ask for immediate compensation for Saskatchewan war and Alberta and also protest against granting legislative functions to Asiatic races.\n\nMontreal, March 19.—Gabriel Dumont wrote to the French press here yesterday that he had been arrested by the New York Herald. He said that he had asked the Canadian Government to grant special pardon to himself. What he wants is a chance to complete amnesty for men and all who took part in the North-West rebellion.\n\nOttawa, March 21.—This has been a dull day in the building of the new House. It has been raining all day.\n\nThe debate on unrestricted reciprocity was continued this afternoon by Messrs. Gignillat, Macdonald, Brown and Wood, of Westmorland. Currin was returned to debate this morning.\n\nCommissioner Horwood of the W.P. M.F., is going over a list of necessary supplies, and tenders will be called for immediately. The money is being given so that all parties may have an opportunity to tender. He has also been going over the list of a number of members of the police force. It is proposed that after twenty-five years service they be entitled to a pension of $50 per year. If disabled by sickness or accident prior to that time of service they receive a pension of $25.\n\nOttawa, March 21.—Greenwood is coming back, and leaves Toronto tomorrow morning. Sobole and Macdonald are not wanted.\n\nA decision has been reached which comprises the abolition of the C.P.R. monopoly clause throughout Manitoba and the Red River district. The terms of presentation are not yet known. No difficulties are anticipated as to the final arrangement, as all parties to the agreement are satisfied with the same written over the result.\n\nIn the House today Campbell spoke on the subject of the bill introduced by Walsh, who made a ridiculous figure of himself. Coburn and Toronto made a successful speech. Mr. Armstrong fell ill and an amendment to the bill replied for the Griz. Baird spoke first to-morrow.\n\nToronto, March 21.—The Legislature has been in session for five days. Bill received its second reading by a vote of 30.\n\nIn the Halifax Legislature today the Government Bill to abolish the legislative council passed its second reading by a vote of 31 to 26.\n\nLondon, March 21.—The second reading of Parry's Arraignment Bill was rejected by a vote of 328 to 243.\n\nThe R.C.W.C.'s sales were very much smaller than those reported. Prices have fallen in several cases 25, 30 and even 60 per cent. The share of the company is now $75,000.\n\nThe Danger Kongress Augusta is in a precarious state of health. Her death may now take place any hour. The Danger Kongress Augusta is not long to live. He cannot speak at all.\n\nStephen's best Hate $2.00, worth $3.00; T.O. Davis'.\n\nDiamond Eyes, Better color and Galery equal just arrived this week for T. E. Jackson.\n\nOn Wednesday evening last the Rev. Mr. Campbell lost a very valuable friend, the well-known singer Miss A. J. from the entertainment at Campbell's when crossing the corner at Robertson's, the horse slipping on the ice and fell, fracturing the skull, from the effects of which she died shortly after.\n\nThe Friday evening congregation of the Methodist Church heard a very talented man in the Protestant Church, which was kindly offered for the evening. Mr. Howard, the pianist was in Calgary for the purpose of playing for the concert, but he was well rewarded. The programme was long and varied consisting of songs, instrumental music, solos and readings. About eighty ladies and gentlemen attended in most considerable numbers and the programme approved.\n\nTERRITORIAL NEWS\n\nLETHBRIDGE.\n\nFrom the News, March 8.\n\nMr. A. Hansen has been for some time busy laboring under a streak of bad luck. A month ago he suffered a loss of a team horse and a few days later his partner, Mr. Hansen, was claimed by a very stable keeper of Calgary, who represented that he had purchased the horse and now he is again in the stable. He arrived here from Medicine Hat Saturday night and was obliged to remain there until the next day when he came out and turned his horses loose. On getting up this morning two of them were missing, and although he has searched the country within a radius of twenty miles, he could not find them. It is feared that the Indians have stolen them off. A couple more are now coming down the river tonight that night and have not since been heard of.\n\nBATTLEFORD.\n\nFrom the Herald, March 2.\n\nOwing to the detention of the train on Tuesday week by snow the last mail was a very small one.\n\nSept. 1st left for Regina or thereabouts, arriving last. He goes down to attend a trial that has arisen out of the celebrated Lytle hay contract.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling AMBER—Hop—ALE\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERRONDON\n\nGO TO CANN'S\n\nSTATIONERY,\n\nSCHOOL BOOKS,\n\nETC.\n\nREGINA.\n\nFrom the Leader, March 7.\n\nChief Inspector is in hospital on the following account. He is rather weak with grippeps. On visiting Mr. Macdonald Crowfoot got ill, and thinking wisely and well he stepped aside into the hospital. He has now got into their reserve hospital. A first class place it is too, which reminds us that they do some things better in Yankeland.\n\nREGINA.\n\nFrom the Leader.\n\nIn breaking an egg, which had been bought in one of the stores, Mrs. J. W. Millington found another smaller egg, about the size of a pigeon's egg. Both were perfectly formed, with hard shell and yolk.\n\nMessrs. J. Mowat & Co. W. Smith and M. M. Nichol, the Special Board of Trade, visited the town to obtain a list of lands suitable for homesteading and land for cancellation. They started into the country yesterday. It is expected that one half of the land within a radius of twenty miles around Regina will be open for settlement.\n\nQUAPPPELLE.\n\nFrom the Leader, March 8.\n\nMr. J. Ormiston met with a very severe accident last week while shopping, when he fell from his saddle that it was impossible for him to get up and he could not get away.\n\nThe new school building at Quappelle, near the Grand Union Stable, has been completed, having secured the payment to the treasurer of the municipality of the amount due thereon as shown by his roll. We understand that it is to be opened at the end of this month, but the roll was not completed.\n\nMEDICINE HAT.\n\nFrom the News, March 8.\n\nWm. H. Brown, owner of the Gold Cup at Banff, came up Saturday. He says the company is bringing in and selling excellent stock horses. They have purchased four from Past Acton of the Fairchild estate.\n\nMr. P. Richards, a resident from Medicine Hat, has been engaged in work there. He has been engaged in building a tent at Edmonton this summer, but finds it difficult to secure work in that city.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis powder contains no starch or flour, and is therefore free from the objectionable qualities of these substances. It is used in competition with the best flour powders. Only pure and strong ingredients are used.\n\nPRINCE ALBERT BREWERY\n\nAMBER—Hop—ALE\n\nDelivered to all Parts of the Town.\n\nBUFFALO HALL\n\nEMPTY SHELVES\n\nAt the end of a good season will fill where the bargains are gone.\n\nNOTICE.\n\nWE HAVE A LARGE STOCK OF CHOICE SPRING CLOTHING!\n\nNow on the road, and will be ready for your inspection in a few days. We have decided to dispose of our entire stock of Ready Made Clothing, Dry Goods, Groceries, Glassware and Crockery.\n\nBETTS & Gwynne.\n\nR. C. W. & Co.\n\nClearing Sale!\n\nWe beg to notify the people of Prince Albert and vicinity that we have decided to dispose of our entire Stock of Ready Made Clothing, Dry Goods, Groceries, Glassware and Crockery.\n\nAt prices which cannot fail to satisfy intending purchasers.\n\nAll parties indebted to us will please settle at once as our books are closed.\n\nR. C. Wigmore & Co.'s\n\nFOR NEW GOODS\n\nAnd Close Prices go to\n\nJ. R. McPhail's.\n\nThe balance of our Heating Stoves and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS IN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888032301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 6174, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 7255, 1], [7255, 12141, 2], [12141, 16277, 3], [16277, 25019, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]