[{"id": "4cce4c6b08a673dcf186bff57bcd16f289ef213b", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\nTUESDAY, APRIL 26, 1898.\nIn this paper we are pleased to announce\nthat Mr. C. E. Hargrove has joined our staff.\nTransmit communications via telegraph or mail to the office.\nNo advertisements accepted for less than $1.\nAll correspondence will be treated with fairness.\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Michael's Church—Services at 7 p.m., followed by afternoon tea and chat.\nSt. John's Church—Services at 10 a.m., followed by dinner.\nSt. Andrew's Church—Services at 11 a.m., followed by dinner.\nSt. James' Church—Services at 1 p.m., followed by dinner.\nSt. Mark's Church—Services at 3 p.m., followed by dinner.\n\nThis Paper may be found on display in the following:\nThe Prince Albert Times Office, Prince Albert.\nNewspaper Advertising Bureau, 405 W. 4th Ave., New York City.\n\nFRIDAY, APRIL 26, 1898.\n\nRAILWAY PROSPECTS.\nThe news which has come to hand this week from Ottawa is of a decidedly encouraging nature. While it is not as hopeful as we should desire, yet it is a fact that the Government are anxious to give some assistance towards securing a railway to Prince Albert. A journal of our telegraphic news will show what has been done, or rather what is reported as being done by the Government to secure the desired end. We must express the hope that the offer now being made will induce the promoters of the Prince Albert and Long Lake road to push on the construction of that road without delay, not only to Saskatoon, but into this town. There is one objectionable feature about the offer set out in our dispatches, viz., that no limit is fixed within which the road may be built to Saskatoon. If the time were limited to six months it would be much more satisfactory. As it is, the company may accept this arrangement and do nothing for a year or longer. It could be more satisfactory if the resolution referred to would authorize the Government to make the same offer to any other road which might be inclined to accept it. We have no doubt that there is sufficient inducement here, so far as the nature of the deal referred to, and will reserve further comment until we receive more light.\n\nThis action on the part of the Government should convince the traducers of Mr. McKeown that there is nothing to gainsay in his advocacy and determination to secure railway facilities for the district which he so ably represents. The offer, we consider is a very liberal one, and should be a strong inducement to any company having the capital and energy to build a road through this country. A railway coming here will not be penetrating a land of desolation and sterility, but will be opening up the most fertile and productive district in the whole of Canada. A road into Prince Albert will put settlers from the start, and as the country becomes thickly settled as it speedily will, the profits to the railway company will be enormous.\n\nIn the speech made by the Hon. Senator Turner on a motion made in the Senate by Hon. Senator Grant, Mr. McKeown has had considerable success in his efforts. We observe the following:—The great trouble we have in the North-West, in my opinion, is that our settlers and settlements are scattered almost immeasurably, and I think if you inspect that part of the country you will find that it would do the country a great deal of harm. It is better that we should help those parties who are now settling there, and we should bear in mind that some of them seem to be there under very difficult circumstances. I mean those who settled on the North Saskatchewan River. It was originally intended to build the Canadian Pacific Railway two or three hundred miles north of the present location, and though the railway itself the present location is the better one, but it was a disappointment to them who settled on the Saskatchewan in the full expectation that the railway having reached there, there would be building by the northern line. Now, I think it is our duty to assist in providing those people with railway communication. I have always had a very strong opinion on that subject, and the very last thing that I said was that I had with the late Hon. Thos White, he agreed most thoroughly with me on the subject.\" Speaking farther, he said, \"it is well settled and a very fine country, too. My policy has always been to go along with the times, and not care whether it is the extension of the Manitoba and Northwestern or Long Lake—to Prince Albert.\" It is very gratifying to find that one of the first senators in the Upper House, acknowledges our right to have railway communication, and regards the duty of the Government, it supply the want.\n\nW. STOBART & CO\nIndian Traders\nGeneral Merchants\nPRINCE ALBERT\n\nWM. STOBART & CO.,\nIndian Traders,\nGeneral Merchants\nand Millers\nDUCK LAKE - SASK.\n\nNOTICE\n\nHORSE SHOE STORE.\nJUST ARRIVED—LARGE ASSORTMENT\nDRESS - GOODS!\nComprising Num's Veiling, Serges,\nCashmere, New Prints, Muslins,\nScarfweavers Ladies Trimmed Hats, Children's Hats\nFULL RANGE LATEST STYLES MEN'S\nAmerican Felt Hats.\nLatest in Men's, Youths' and Boys' Clothing\nCall Early and get Your Choice—Prices Lower than ever\nTHOS. O. DAVIS.\nR. C. WIGMORE & CO.\n\nMen's and Boys' Underclothing\nMen's Cardigan Jackets\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books.\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING!\nOffice Stationery, etc., e.c.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF\nImported Tweed Suitings,\nTrowseing and Overcoating\nWORSTEDS,\nENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson\nGENERAL NEWS.\n\nThe great Ottawa divorce case is over and Mr. Middleton is free to marry again, his bill for divorce having been approved by the court. The bill was prepared a year ago, but it did not come up for hearing until last present time. The remandees in the case of Mrs. Hamilton, who used to be in California with Hamilton, a bank clerk, Hamilton is a nephew of General Sir Frederick Hamilton.\n\nHarry Phillips of Montreal, and manager for John L. Sullivan, has been arrested on a charge of helping newly married Mrs. Phillips escape from the clutches of Van Gondolos, an agent for P. W. Bills Co., jewellers, of Toronto. Van Gondolos had been seen with Mrs. Phillips in connection with the affair. The city council of Toronto has voted to increase the number of members of the Board of Works Committee in order that more action may be taken immediately in reference to the question of the Board of Works Department as shown by the evidence in the Faquh v. Robertson libel suit.\n\nMrs. Mary Battenberg, president of the committee of amateurs, who will conduct the trial of Mr. Battenberg and Mr. Cordes, from the Transvaal, have been given as a task submitting an examination of 12,300 documents bearing on the case. The matter is to be included in 1,000 newspapers articles and great numbers of Gen. Battenberg's visiting cards, etc., are being sent abroad. Besides the charge of murder, Mr. Battenberg is also charged with malpractice in the war effort as regards the handling of funds, and with the attempt to influence the vote on the eve of President Carnot's election.\n\nMrs. Hannah Batterberg, said to be the largest woman in America, died today at her home at Franklin Avenue, Philadelphia. She was 68 years old. At 17 years of age she weighed 300 pounds and now weighs 500 pounds. She died of heart failure and pulmonary congestion. Mrs. Batterberg, when married, weighed 600 pounds, and of late years her weight has claimed nine pounds. Norma Philippus, of the best known women's clubs of Philadelphia, recently died, while on the road, of an infection in her family. It was twins, and, to recount the father's story, he was very fond of his wife and children. When he arrived he was introduced to the little strangers and instantly congratulated. His greetings to his wife were, \"Mary, what do you mean?\" but after a little explanation was made, and the father was told that his wife was expecting that there are twins in the house, a better than three of a kind.\n\nKate, Battenberg, became Mrs. Batterberg, was down to the station and managed by a freight train. Decorum was short- sighted and partially deaf, in support he had been obliged to stand by as the approaching train was struck by a car.\n\nNews of the vessels which arrived at New York has brought a great share of the fate of the passengers on the stranded steamer Denmark. The Amsterdam, from Rotterdam, passed the spot where the City of Chester was stranded yesterday, sighted the Denmark, but nothing was then visible. It has been definitely ascertained that there were 722 persons on board the ill-fated steamer.\n\nDr. McAdams of Winnipeg, who has been engaged in the search for the Indians in the Battleford Agency, has returned to Battleford a short time ago, together with his wife and children.\n\nLast spring a herd of cattle strayed away from a band belonging to Gallagher & McGregor, of Battleford, and although diligent efforts were made, the animals could be found. A few days ago Sam Rallidoue found them on the plains, and was astonished to find that they had rustled for two months. Later they are fat and in good condition.\n\nThe Battleford Herald says: \"This beautiful country is destined to attract people from the east. Here are our farms in the beginning of April ploughing and sowing—seed corn growing that which was gathered last season, the prairie bright with flowers, and the grass fresh and green. What a harvest a railway would bring! This country, inviting immigrants to this most favored part of the Northwest, has any country hitherto barren enough to have completed a millennium.\"\n\nA Dead Drop!\n\nPRICES\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nCall and Examine Our Stock\n\nJ.M. Campbell\n\nLumber\n\nMoore & Macdowall (Limited)\n\nHave a Large Stock of Lumber!\n\nAlex. Loudoun, Sec.-Treas\n\nAgents:\n\nP.S.G. Gray, Edmonton, Alta.\n\nJ. Fraser Tims, Pot Saskatchewan Alta.\n\nMahaffey & Clinkskill, Battleford, Sask\nST. GEORGE'S DINNER.\n\nThis festival dinner of Prince Albert's on Tuesday evening last, included the anniversary of their patron saint by a dinner at the Queen's Hotel, which was presided over by Mr. O'Grady, the chairman. Among the guests present were the mayor, including a number of invited guests. Mr. T. E. Parker occupied the chair while the other members of the committee—Parker and Mr. Redpath—were seated at the right of the chairman who was reserved for His Excellency Clarke and C. MacL., but outside of the dinner-room proper.\n\nTo the left of the chair were J. R. Betts, M.L.A., and John Stewart, president of St. Andrew's Society. The chairman's notice had been done to the full of the ear, the chairman in a short speech expressed his pleasure at seeing so many friends express their hopes that it would result in the formation of a St. George's Society. He proposed \"The Queen,\" which was responded to by \"The Duke of Connaught.\"\n\nThe next toast was that of \"The Day we Celebrate.\" This was followed by a song, \"The British Lion,\" from Constable Perry. The toast of \"The Royal Family\" or \"St. Andrew's Society,\" coupled with the name of its president, Mr. John Stewart, who spoke briefly and most effectively, paid him and expressed the hope that another year would see St. George's Society flourishing in its zeal. He said that such a society was useful and did a great amount of good in different ways. He referred to the organization of the society in England some years ago, and was glad to say that it was in a flourishing condition and had removed several cases of distress. J. L. Johnson, Esq., responded in a similar style.\n\nThe last toast from the chair was that of \"The Army and Navy,\" coupled with the name of Staff-Sergeant Parker, who made a suitable reply and was followed by Constable End, who sang \"Balaklava\" in a spirited manner.\n\nStaff-Sergeant Parker from the last vice-chair next proposed \"The Gov.-General, the Lieutenant-Governor, the Legislative Assembly,\" which was received with enthusiasm and was responded to on behalf of the Assembly by Mr. Betts, M.L.A., who spoke briefly and keenly, which took well with the audience. Mr. Geo. D. Northgraves being called upon sang \"Rule Britannia\" in his usual good style.\n\n\"The Town Council of Prince Albert\" was represented by Mr. Corn Woodman in an able manner. The speeches of the \"Councillors\" were upheld by Messrs. T. J. Agnew and J. L. Johnson and Mr. Buck ley for the gathering of the crowd.\n\nMr. Buckley, Honorary 2nd Vice-Chair, proposed the \"Learned Professions,\" emulated with the grace of the Rev. A.H. Wright and Mr. R. Ginn, M.A., each of whom spoke briefly and effectively. Mr. D. Hamblin sang \"Men of Harlech\" and Const. Buck sang \"Here on Garibaldi.\"\n\nThe last toast was that of \"By Land\" by Mr. Hamblin in a neat and appropriate speech and Mr. Ginn replied to the toast of \"The Press.\" This brought the proceedings to a close, but several other interesting toasts were proposed and duly honoured, and a number of speeches by H. E. Ross, Const. Sergt. Parker and others were interspersed. Const. Watson favored the assemblage with a recitation which fairly brought down the house.\n\nAltogether the dinner was a great success and passed off without a hitch of any kind. We hope that our English friends will not be disappointed when they visit us after the St. George's dinner will be one of the attractive features of the year in Prince Albert. Our only feature of the dinner was the total absence of dry, lengthy speeches; the time being devoted instead to singing and conversation.\n\nLOCAL NEWS.\n\nW.C. Ramsay returned last week with his wife and child and is living on his farm near the old Roman Road. Mr. Lindsay brought in with him large quantities of fresh stock, including horses and cattle, and intends farming on a large scale.\n\nThe Easter Sunday service at Allan's parish was held in the church on Monday afternoon last, at which a goodly number of the congregation were present. The affairs of the church were discussed and were found to be in a very satisfactory condition, after which the following gentlemen were elected to the office: T. J. Agnew and Thomas McKay; Vestrymen: Major Perry, Mrs. McKay, Agnew and Staff Sergeant Parker. Mr. Archdeacon Gurney came from Moose Jaw for the minister's warden and Mr. McKay by the congregation.\n\nTHE WEEKLY SUN!\n\nINCREASED TO 12 PAGES IN SIZE\n\nAND REDUCED TO\n\n$1.00—PER YEAR—$1.00\n\nTHE WEEKLY SUN WILL BE SENT FROM DATE TO THE 31ST DECEMBER NEXT—WITHOUT THE PREMIUM FOR—\n\n50c.—FIFTY CENTS—50c.\n\nADDRESS: The Sun Printing & Publishing Co., Ltd., Winnipeg, Manitoba.\n\nNEW HOME SEWING MACHINE\n\nHAS NO EQUAL.\n\nTHE ONLY SEWING MACHINE THAT GIVES—\n\nPERFECT SATISFACTION\n\nNEWTON'S SEWING MACHINE COMPANY\n\nNEW BAKERY\n\nBread and Fancy Cakes\n\nXmas and Wedding Cakes\n\nA specialty, and made on short notice.\n\nYour patronage is requested.\n\nBroad Street, opposite all parts of the town.\n\nH. M'COLL T.J. AGNEW\n\nSelling Out\n\nFIFTEEN PER CENT.\n\nFOR CASH\n\nThis is No Humbug.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889042601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 3787, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5980, 2], [5980, 10395, 3], [10395, 15405, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]