[{"id": "b0fe98472b35eae1874f6fae143e9c312c7f7783", "text": "THE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY.\n\nJ. D. MAVEETY.\n\nPRINCE ALBERT, N. W. T.\n\nTERM.—$1.25 per annum in advance, excluding extra postage 10 cents each.\n\nIn no case will any part be inserted in this paper, unless signed by the author.\n\nAll letters to be addressed to the Proprietor.\n\nTHE HUDSON'S BAY HOUSE.\n\nWe have recently in these columns advanced the necessity of the immediate construction of a line of railway to Hudson's Bay, at Nelson or Churchill River (this latter being the shortest route), in order to Prince Albert, as the only and shortest way of affording a cheap outlet for the surplus products of the prairies to the West, to the markets of Europe. Any information on this subject may be sent to Mr. George A. Haynes, C. E., of Hartley Bay, who, Young, civil engineers, has furnished us with the following statement regarding the proposed Hudson's Bay Railway and its advantages:\n\nMr. Haynes says: It will be found very interesting in view of a renewal agitation for a railway to Hudson's Bay. Mr. Haynes explains the advantages of the route via Hudson's Bay, and the reasons why it should be adopted.\n\nFrom Winnipeg to the Saskatchewan River at the northwestern corner of Lake Winnipeg, the level is about 700 feet above sea-level; no hills of any importance having to be surmounted. From the mouth of Red River to the Saskatchewan River, except along the banks of the lake as far north as Big Grindstone Point, is still mountainous. Some years ago the Canadian government surveyed this section of country as an Inland Route, but it has not been followed up by any extension of the railway from Winnipeg to the boundary of the prairie, owing to the lack of means of farming to agriculture. The soil is, however, good and well adapted for farming purposes, and a large portion of it is open for settlement. The distance from Winnipeg to Great Rapids on the Saskatchewan River is about 400 miles. The number of rivers to be crossed is comparatively small, being about five, with the exception of the two Saskatchewan, none of them large. For the corresponding distance from Winnipeg to Lake Superior, there are at least twenty-five streams which would have to be crossed, and a country traversed not fit for any other purpose than mining.\n\nThe strike still continues amongst the employees of the P. R. R., although the wages are now considerably higher. There seems to be little doubt that in this instance the employers are to blame, and that their demands are unreasonable. The wages, some of the engineers as high as $500 a month. The company proposes to pay the wages during the winter months, when the receipts of the road are comparatively small, and the amount of wages to be paid, would be placed under the control of the Superintendent of the Hudson's Bay Company, England, whose head quarters are somewhere in the United States. Superintendent Ryan has been appointed to take charge of a new agency, with his management, and to interview the employees. Mr. Ryan is a man of considerable tact, and the result always is that the employees have to give in, and submit to the demands made upon them by their superiors and families, and are obliged to the public for great inconvenience and loss. We hope that the P. R. R. company will yield the folly of their conduct, and return to their work.\n\nO'Donnell, the brother of Carey, was hanged in London Dec. 1st, notwithstanding the strenuous exertions of the prisoner's friends. The prisoner was tried for murder, and was convicted. He had been charged with the murder of his brother, who had been killed by Carey, and never had been sorry for it. The prisoner's Conduct was generally approved by his friends, and he was thought to be innocent. The prisoner was tried in New York, and was given as his opinion, \"I am innocent.\"\n\nCOMMITTEE, P. A. C. B.\n\n1879.\n\nImportant Circular\n\nFROM Buffalo Hall!\n\nOwing to a change in our business, which will take effect on Jan. 1st, 1884, all accounts due and not provided for by that date, will be placed in the hands of our solicitor for collection.\n\nBETTS & Gwynne.\n\nNEW FALL AND WINTER MILLINERY,\n\nLADIES' HOLLANDS AND CLOAKS,\n\nFur Caps and Muffs,\n\nWool Goods.\n\nALSO Ladies and Children General Furnishings.\n\nMISS MACK & CO.,\n\nCAMPBELL'S BLOCK.\n\nREMOVED.\n\nDR. BAIN\n\nHas removed his office to the new building in rear of the Presbyterian Church.\n\nOFFICE HOURS:\n\nFrom 9 a.m. to 12 p.m.\n\nFrom 1 p.m. to 6 p.m.\n\nPrince Albert Bakery.\n\n2 LB LOAF, 12¢.\n\n9 LOAVES, 1s.\n\nCakes and Pastries always on hand and ready to order.\n\nWM. R. BELL.\n\nSTRAYED.\n\nOn the farm of the subscriber, at the Bridge about two months ago, a White Three Year Old Steer.\n\nThe owner can have it by paying a reasonable sum for the keep and the cost of this advertisement.\n\nJOHN C. McNEVIN.\n\nPrince Albert, Dec. 1883.\n\nASTRYED!\n\nStrayed on my premises, about a month and a half ago, from across the river, a bay horse, good size; white stripe down face and one white foot. Same can be obtained by paying expenses, on applying to CHAS. G. BIRD, South Branch.\n\nDecember 7, 1883.\nLAUGHABLE GAME OF FORTUNE.\n\nThe odd numbers are for gentlemen; even for ladies.\n\nExplanation.—Let one of the company ask the questions, the rest of the party each answer for himself. The interrogator will hang the answer opposite the number so named. The odd numbers are for gentlemen, the even for ladies.\n\nBY WHICH ARE YOU NAMED?\n\n1.—A talkative lady.\n2.—A hard worker.\n3.—A rich old man with $50,000.\n4.—A lawyer.\n5.—A great beauty.\n6.—One who was married before.\n7.—The prettiest girl in the city.\n8.—A great dancer.\n9.—A lady of good deportment.\n10.—A squinting doctor.\n11.—A widow with 15 children.\n12.—A hard worker.\n13.—A colored lady.\n14.—One who will be happy with.\n15.—A dressmaker.\n16.—One with a large family.\n17.—A lady of fortune.\n18.—One by profession a tailor.\n19.—A great musical musician.\n20.—One distractedly fond of you.\n21.—One extremely jealous.\n22.—A very handsome young man.\n23.—A young widow.\n24.—One who has had five wives.\n\nFOR WHAT ARE YOU KNOWN?\n\n1.—Because you are handsome.\n2.—For your beautiful eyes.\n3.—For your refined taste.\n4.—For your good looks.\n5.—Because you are talkative.\n6.—For your even temper.\n7.—Because you are obliging.\n8.—For your humor.\n9.—For your good qualities.\n10.—For your excellent manners.\n11.—Because you are a flatterer.\n12.—For your opinions.\n13.—Because you are delightful.\n14.—For your fine figure.\n15.—For your wit.\n16.—For your fine shape.\n17.—Because you are a housewife.\n18.—For your melody.\n19.—For your generosity.\n20.—Because you have means.\n21.—Because you are witty.\n22.—Because you are pretty.\n23.—Because you are pleasing.\n24.—For your accomplishments.\n\nWHEN OR WHERE WILL YOU FIRST MEET YOUR HUSBAND OR WIFE?\n\n1.—On the bank of a river.\n2.—At the opera.\n3.—In a grove.\n4.—In an expensive store.\n5.—On a bridge.\n6.—At a wedding.\n7.—In the midnight.\n8.—In the flower garden.\n9.—At church.\n10.—In the dark.\n11.—In a theatre.\n12.—In a steam packet.\n13.—At a hall.\n14.—In your friend's company.\n15.—At a large hotel.\n16.—On the sea shore.\n17.—In a foreign country.\n18.—At a tea party.\n19.—In a party of pleasure.\n20.—Home gathering.\n21.—On the street.\n22.—On the street.\n23.—In a rural retreat.\n24.—In a foreign country.\n\nWHAT QUALITY DO YOU WISH FOR IN YOUR HUSBAND OR WIFE?\n\n1.—A good temper.\n2.—A good eye.\n3.—Inclination to please.\n4.—Accomplishments.\n5.—Lively.\n6.—Neatness.\n7.—Generosity.\n8.—An old lover.\n9.—Agreeable disposition.\n10.—Sense and wit.\n11.—A refined mind.\n12.—Dignity.\n13.—Amiability.\n14.—Partiality to music.\n15.—Generosity.\n16.—Avarice.\n17.—Wealth.\n18.—Perseverance.\n19.—Pleasantness.\n20.—Good humour.\n21.—Sincerity.\n22.—Refined taste.\n23.—Philanthropy.\n24.—Kindness.\n\nJUST RECEIVED AT THE MEDICAL HALL.\n\nVictoria Hyprophosphites.\nVictoria Buchan and Urs Urol.\nVictoria Carbolic Acid Soap.\nBurdock Blood Bitters.\nBurdock Pills.\nHayward's Cough Salve.\nHayward's Yellow Oil.\n\nDirect from the Manufacturer.\n\nTERMS—CASH.\n\nJackets supplied at reasonable terms.\nPrescriptions, prescriptions and family recipes carefully prepared.\n\nT. E. JACKSON,\nChemist.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFirst Installment of a Large Line of Goods.\n\nMowers and Rakes\n\nFrom the celebrated Watson Manufacturing Co., of App., Ont., and\n\nBoford Breakers\n\nHave arrived at the Improved Department of Jackson & Jackson, and in every respect superior to any other.\n\nThe Lion Reaper,\n\nHoney Penning Mills,\n\nWatson Harrows and\n\nBoford Cross Ploughs\n\nAll these goods are guaranteed to give satisfaction.\n\nParties wishing to secure first-class implements are respectfully invited to call and have them examined.\n\nJACKSON & JACKSON\n\nFARMERS' ATTENTION!\n\nA. Harris Sons Co., late dealers in the underground hay harvesters and farming implements, have just received the following:\n\nBoxford Reapers,\n\nBoxford Mowers and Rakes,\n\nSnowball & Spight Wagons,\n\nStubble and Grass Plows.\n\nA Large Stock of Repairs.\n\n20 Boxford Cord Binders,\n\nWhich are now being used at the Forks of the Red River, Manitoba, by Mr. Prichard, of Prince Albert, in good time for market.\n\nThese binders are made of the best materials, and are guaranteed to give satisfaction.\n\nS. W. VAN LUVEN,\n\nFixes, Epilepsy, or Falling Sickness.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT.\n\nESTABLISHED - 1860\n\nHEINTZMAN\n\nAND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, - ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nFIRST PRIZE WHEREVER EXHIBITED.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT.\n\nH. W. T.\n**PECK'S BAD BOY.**\n\n“Say, you are getting too altered in place,” said the grocery man to the bad boy, as he passed him into the store by the back door; he had wiped off the chalk on the neck and looked so his eyes stuck out.\n\n“The boys have been saying, ‘It's none of my business now, they start some and you save some.’”\n\n“I see you hanging up that lead grey tom cat by the heels, in front of my store, with the rabbit! I will for sale!” A kid came in the boy didn’t hear, who pointed me to the rabbits, asked what good eaters they were selling at. He claimed, his name has got me here. You get that lead cat out of this ward and I will.”\n\nThe boy got his breathful and walked over to where the cat lay处置 upstairs.\"\n\nHe said this was the policeman, and he his chin saw him do it, and he just came in to tell you. Of course we can call cats all wanted, so he looked aside just in time to see a man whom neither knew grab up his coppers and change ends with his cats, and put some money in his coat. The latter started out, but Ma tried not to drink anything, and he said she wouldn't, but Ma got him into the fall出了 place she held it in there, fell more but that Ma left without seeing it.\n\nShe got his legs out of bed, and Ma said that little girl opposite, and she wasn't no good, and weeds got מ underscore his mouth hung out of his mouth his throat he lookedit about his nose, and next he looked at her as she waited for her to take his cup and drink it.\n\nSo these views are not from tricks, such as putting their legs on the floor while they try to get that lead cat down.\n\n---\n\n**NOTICE.**\n\nTo Lumbermen and Others\n\nWho are dealing in common refuse Timber for Sheathing and Flooring use, Saw Logs, House Logs, Floors, Fence Posts, &c., &c., &c.\n\nPersons are reminded that the Timber Act of Prince Edward and King Edward Provinces, and the law therefore, does not allow any contracts in regard to the purchase, sale, or delivery of Timber in connection with any contract made between the Government and any Provincial or Municipal Body.\n\nCraftsmen and Other Traders Methods used in making and selling their wares shall be regulated by the laws.\n\n---\n\n**PHOTOGRAPHS!**\n\nChas. E. Page.\n\n**NEW STUDIO.**\n\nCanada Pacific R'y Co.\n\n**EAST END.**\n\nChange of Time.\n\nOn Tue., Feb. 4th, 1882, trains will run as follows:\n\n- Going West: Outfitting cars will be run at 7:30 a.m., and returning at 9:30 p.m.\n\n- Going East: Outfitting cars will be run at 7:30 a.m., and returning at 9:30 p.m.\n\n---\n\n**CREDIT VALLEY RY.**\n\nWhen going east.\n\n- Sixteen annealing cars will be run at 6:30 a.m., and stopping at various points along the line.\n\n- Ten annealing cars will be run at 9:30 a.m., and stopping at various points along the line.\n\n---\n\n**THE SHORT LINE TO ALL ONTARIO POINTS.**\n\n---\n\n**The Royal Route.**\n\n---\n\n**PRINCE ALBERT.**\n\n---\n\n**Real Estate.**\n\n---\n\n**Royal Route Line.**\n\n---\n\n**FOSTER'S CORNERS.**\n\n---\n\n**Photographs!**\n\nChas. E. Page.\n\n**New Studio at East End.**\n\n---\n\n**Furniture.**\n\n---\n\n**General Charles E. Carter.**\n\n---\n\n**Horseshoeing**\n\n---\n\n**Banking.**\n\n---\n\n**Artistry.**\n\n---\n\n**Photographs!**\n\n---\n\n**The Royal Route.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\n\n**Banking.**\n\n---\nTHE NORTH WEST.\n\nA Settler's Trip Through the \"Great Low Land\" (the Plain) Near St. Boniface, in Manitoba.\n\nMontreal star:\n\nMr. David Smith, who has just returned from a six weeks' journey in Manitoba and the North West, where he went with Colonists under the auspices of the Great Low Land, to inspect the lands of the Land and Colonization Company of Canada, states that he had a most delightful trip. The Great Low Land Company is on the North Saskatchewan river about 500 miles north-west of Winnipeg. They were the first settlers to go from Winnipeg as far as Qu'Appelle station, about 80 miles east of Regina, and then proceeded to Prince Albert, 275 miles, with the exception of one stage and took seven days in making the trip. They passed through the Qu'Appelle Valley, which is a beautiful country with rolling plains, and then the Touchwood Hills, a fairly wooded range, which they thought would be a good country for settlement. From thence they crossed the salt plains, a wide expanse of level land, which will eventually be rendered fit for settlement. The Valley of the Saskatchewan was their next object, which is reported to be a very fine farming country, and is already coming in. After crossing the South Saskatchewan into the Dust Lake district, they came to Prince Albert, many sections have been taken up. A drive of twenty miles through balsam spruce forest brought them to settlers at Prince Albert settlement, which is a distance of twenty-five miles, until the town is completed. The settlement is being estimated that from five to six thousand people are here located,—many of whom have been there several years, and now possess good substantial houses, barns, built with lumber at Prince Albert. They appeared to be in comfortable condition. The town of Prince Albert, which is situated on the south side of the North Saskatchewan River, is a flourishing place, with a population of about twelve hundred. It has two grain mills, two saw mills, flouring mill, lumber yard, planing mills, brickyard, several general stores, three churches, a college and school, and a hospital. It is a large town, situated, as it is, in the centre of a very large tract of fine farming country, which will soon be in railway communication, as the Macdonald and Northwestern Railway, which starts from Portage la Prairie on the C. P. R., and runs thirty-eight miles, will have been built, is expected to reach there in about two years and the Government has just purchased the right-of-way, which will prove a great convenience.\n\nAt Prince Albert, teams and an outfit for camping were obtained, and some funds sent by Mr. Smith to assist him in that place, the tract of land which Messrs. Smith and Butler went to was reached by oxen teams, as there is no Canadian Pacific Railway. They found the place well wooded, with plenty of water, and fully up to the requirements of a settlement, the soil being well suited for farming and grazing purposes. After spending some days on the land, Col. Butler wrote to Edmonston, who was going to Calgary, and he took the C. P. R. back to Winnipeg.\n\nCOMPLAINTS OF SETTLERS AGAINST THE GOVERNMENT.\n\nMr. Smith being asked by a Star reporter if he had found anything of the dissatisfaction amongst which so much has been written, and which has been said in some places people were complaining that the Government had not yet given them the parcels of land promised them, in matters which required, time, as it was necessary that responsible agents receive quarters since investigations were made. Mr. Smith stated that a settler had taken land previous to a land office being established in the locality, and was therefore unable to get his title. He also says that three years after making his entry the settler shall receive his title. These particular cases that have been completed their three years' residence on the land and are entitled to their patents. There are other cases, however, where the feeling amongst the Government should open the mile belt, that is, the land reserved on each side of the railway, for the use of the colonists. At present, however, they are permitted to locate on Government sections within the mile belt.\n\nWith respect to the dissatisfaction which exists on account of the high duties on agricultural implements imported from England, Mr. Smith, of the North West, Mr. Smith is of the opinion that can be easily disposed of by the Government negotiating reasonable terms to investigate the claims of settlers, and give them their lands immediately. This would then enable the settler to move on, occupy his land, and obtain more land for that purpose, which he is now unable to do without having a valid title, known fact, but that might be in the possession or involved in litigation.\n\nTHE COAL RESERVES.\n\nGreat excitement prevails in regard to the opening up of the extensive coal districts, which will reduce the price of fuel and solve a serious problem in localities where wood is scarce. Mr. Smith states that his trip was very pleasant, both the roads and the weather having been exceedingly fine.\n\nTHE MAIL.\n\nThe Mail which was due on New Year's Eve was again behind time this week, although the Train Time, and arrived early Wednesday evening. The delay was caused by heavy snow on the plains.\n\nR. D. NORTHGROVES,\nWatchmaker and Jeweller.\n\nA. T. N. CRUMPTON'S NEW STORE.\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nKEEP CONSTANTLY ON HAND\n\nRepairing Promptly Attended to\n\nWatches,\n\nClocks,\n\nJewellery,\n\nStationery,\n\nJoseph Rogers & Sons, Manufacturers,\n\nChlorinated Water, Antiseptic,\n\nElectroplated Ware, Antiseptic,\n\nSpecial attention to post Office,\n\nStationery, etc., etc.\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance\n\nCOMPANY\n\nESTABLISHED\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $6,000,000\n\nAnnual Income, over $1,000,000\n\nA general agent of the Company will visit every part of the country, and will assure us in offering the greatest advantages to be derived from insurance in this old and honourable company.\n\nA. SPROAT,\n\nPrince Albert, N.W.T.\n\nP. A. STACKHOUSE\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nRead This\n\nONLY\n\n$3.50\n\nThe Greatest Offer ever made to the Canadian Public.\n\nIn order to increase our already large list of yearly subscribers, The Weekly Globe offers the following liberal and generous offer to every reader of this advertisement who wishes to take advantage of it:\n\nFOR $3.50 we will send to any address in Canada or the U.S.\n\nTHE WEEKLY GLOBE\n\nfrom now to end December, 1884, and in addition,\n\nA COMIC HISTORY OF THE GREAT WESTERN WATER COMPANY, containing the adventures of Mr. Smith, the owner of the above mentioned company.\n\nThis offer is only available to those who subscribe before January 20th, 1885.\n\nRemittances should be sent at once, so as to enable us to begin publication without further delay.\n\nAddress:\n\nTHE GLOBE PRINTING CO., Limited,\n\nTORONTO.\n\nThe Great Dollar Paper.\n\nSPINK & MAVETY,\n\nPROPRIETORS\n\nRIVER STREET,\n\nPRINCE ALBERT.\nSANTA CLAUS IS COMING.\n\nHeadquarters, The Horse Shoe Store.\n\nGOOD LUCK FOR THE COMING YEAR.\n\nToys, Boys' Tool Chests, Games, Picture Books, Nursery Rhymes, Dolls, Scrolls, Paper Mache, Card Receipts, Brackets, Plush, Velvet, Metal and Rustic Frames all sizes, at prices that will surprise you; Muffles, Berlin Wool, Parlor Decorations, Christmas Tree Decorations, Albums, all sizes and quality, from 50¢ to $10; Autograph Albums, Pocket Books, Lady's Sachets, Sets Jewellery, Necklets, Looking Glasses, Dressing Cases, Xmas and New Year Cards, all and everything for the Holidays.\n\nI positively make clear out our entire stock of Fancy Goods.\n\nAlso Choice Groceries, Dry Goods of all descriptions, Gent's Furnishings, Caps, Mitts, Gloves, Mufflers, Ready-made Clothing, Moccasins, Over Shoes, Felt Boots.\n\nMoney may mean cash. Many also mean Big Bargains at the Horse Shoe Store. Come one, come all.\n\nWith compliments of the season.\n\nTHOMAS O. DAVIS.\n\nCOAL OIL.\n\n500 GALLONS,\n\nAMERICAN AND CANADIAN.\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer.\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 300,000 acres, already surveyed by the Government of Canada.\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gieschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Moncton.\n\nC. J. PRYCE, Land Commissioner.\n\nCOL BUTLER.\n\nNotes on His Visit to the Great Land.\n\nAn Interesting Account of the Distinctive Author's Impressions and Opinions Regarding the Country.\n\nThe following is an extract from a letter written by Mr. Butler, who recently visited Prince Albert, in which he describes the climate, the soil, and the possibilities of the region:\n\n\"The opinion I then formed,\" said Col. Butler, \"was to the effect that the land was not suitable for settlement. Since then, however, I have been convinced. These remarks refer particularly to the northern part of the region which has not yet been opened up. I believe that the soil is not suitable for cultivation, and that the climate is too severe for human habitation.\"\n\n\"I consider that the absence of rail communication with the rest of Canada is a serious drawback to the settlement of the region. While I was there before, I came across a number of settlers who had brought their families and stores home extending in scattered places over a distance of several miles. Edmonton is making progress, but I do not consider it as well situated as the settlements further north of the railroad. The Prince Albert settlement, generally speaking, has proved successful, and I believe that the people there are doing well.\"\n\n\"I consider that the absence of rail communication with the rest of Canada is a serious drawback to the settlement of the region. While I was there before, I came across a number of settlers who had brought their families and stores home extending in scattered places over a distance of several miles. Edmonton is making progress, but I do not consider it as well situated as the settlements further north of the railroad. The Prince Albert settlement, generally speaking, has proved successful, and I believe that the people there are doing well.\"\n\n\"I consider that the absence of rail communication with the rest of Canada is a serious drawback to the settlement of the region. While I was there before, I came across a number of settlers who had brought their families and stores home extending in scattered places over a distance of several miles. Edmonton is making progress, but I do not consider it as well situated as the settlements further north of the railroad. The Prince Albert settlement, generally speaking, has proved successful, and I believe that the people there are doing well.\"\n\n\"I consider that the absence of rail communication with the rest of Canada is a serious drawback to the settlement of the region. While I was there before, I came across a number of settlers who had brought their families and stores home extending in scattered places over a distance of several miles. Edmonton is making progress, but I do not consider it as well situated as the settlements further north of the railroad. The Prince Albert settlement, generally speaking, has proved successful, and I believe that the people there are doing well.\"\n\n\"I consider that the absence of rail communication with the rest of Canada is a serious drawback to the settlement of the region. While I was there before, I came across a number of settlers who had brought their families and stores home extending in scattered places over a distance of several miles. Edmonton is making progress, but I do not consider it as well situated as the settlements further north of the railroad. The Prince Albert settlement, generally speaking, has proved successful, and I believe that the people there are doing well.\"", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884010401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9086, "total-output-tokens": 6336, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5080, 2], [5080, 9796, 3], [9796, 13095, 4], [13095, 20117, 5], [20117, 25418, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]