[{"id": "0031462334eed9c66c204ef6d33b017d3de54edd", "text": "Payment of Fines or Penalties Under Criminal Laws of Canada in North West Territories and District of Keewatin.\n\nGovernment House, Ottawa, 23rd Day of June, 1884\n\n\"Beam.\"\n\nIn keeping with the past practices, the Prince Albert Times has been publishing a list of fines and penalties under Criminal Laws of Canada for the North West Territories and District of Keewatin.\n\nGovernment House, Ottawa, 23rd Day of June, 1884\n\nOn the recommendation of the Minister of Justice, His Excellency the Governor General has been pleased to direct that, in pursuance of the provisions contained in an earlier Circular, and to facilitate the prompt collection of fines and penalties due under Criminal Laws of Canada, in respect of which no provision has been made by law for the collection thereof, the sums to be collected may be paid over to any one (excepting members of the police force) who will be responsible for their collection, and the said person may keep all such fines and penalties as he may collect.\n\nSigned: Sir George B. Cartwright, Attorney General.\n\nIN CORRESPONDENCE\n\nINFORMATION\n\nThe Lord Lieutenant of the North West Mounted Police, be it known, does hereby give notice that Master Justice of the Peace and other persons in the North West Territories who have collected fines, or who are responsible for fines, under the Criminal Laws of Canada, in respect of which no provision to the contrary exists, to pay the amounts so collected to the Lieutenant Governor of the North West Territories and District of Keewatin, or to one of the stipendiary magistrates of the North West Territories or District of Keewatin; but that Master Justice William L. Clarke, J. P., and others, will not be permitted to collect otherwise, and that the purpose thereof is to invalidate any fine which has been collected under the Criminal Laws of Canada, in respect of which no provision to the contrary exists, to pay the amounts so collected to the Lieutenant Governor of the North West Territories and District of Keewatin.\n\nThe Lieutenant-Governor of Manitoba in his capacity as Lieutenant-Governor of Assiniboia and signed the following resolution:\n\nIn view of the important matters concerning which the parties collecting may already be engaged and shall dispatch the same to the credit of the Winnipeg Club, as any amount received from such parties shall be sent to Mr. C. Geyer, H. R. C., by the Saskatchewan County Court Division of the Lieutenant of the North West Mounted Police, on the 1st day of April, as the Lieutenant Governor for the purpose of forwarding the deposits to the proper authorities in the place where the money is to be spared, and where such a centre is practicable, they shall forward a Post Office which will be established for the collection of fines, and where such a centre is practicable, they shall forward a Post Office which will be established for the collection of fines, and where such a centre is practicable, they shall forward a Post Office which will be established for the collection of fines.\n\n* * *\n\nPRINCETON'S VISIT\n\nA correspondent writing to the Prince Albert Times states that Mr. Princeton has returned from a trip to London, England, and that he is now residing at the Prince Albert Hotel. He says that he had a most enjoyable time in London and that he visited many of the famous sights, including Westminster Abbey, the Tower of London, and the Houses of Parliament. He also visited the Science Museum and the Natural History Museum. He had a chance to meet many prominent people, including the Duke of York, Lord Palmerston, and Lord Salisbury.\n\nMr. Princeton also visited many of the famous shops and boutiques in London, including Selfridges, Harrods, and Liberty's. He says that he bought some very nice things, including a beautiful velvet coat and a pair of silk slippers.\n\nHe says that he had a very good time in London and that he will always remember his visit there.\n\nMr. Princeton also visited many of the famous sights in Paris, including the Louvre Museum and the Eiffel Tower. He says that he was amazed by the size and grandeur of these buildings.\n\nHe says that he visited many of the famous shops and boutiques in Paris, including Galeries Lafayette and Le Bon Marché. He says that he bought some very nice things, including a beautiful fur coat and a pair of silk slippers.\n\nHe says that he had a very good time in Paris and that he will always remember his visit there.\n\n* * *\n\nCHIT-CHAT LOCALS\n\nThe Chatting Shop Reporters.\n\nAt the last meeting, Mr. Sharp opened the session.\n\nOn Saturday last, Mr. Sharp reported.\n\nThe extension of the B. R. C. Mill is now completed, and the building is being used.\n\nMr. Capelton has shown much interest in the progress of the new mill.\n\nA fresh stock of goods at Alex H. Clark & Co.'s store is now in high demand.\n\nTwo swift boats with 50 feet keel are being built at the west end for Messrs. Haynes & Co.\n\nThe Christmas tree at St. Matthew's Church will be decorated Monday next.\n\nThe new market here is expected daily, although the weather is still cool and the snow on the river is quite deep.\n\nTHE NEW MARKET\n\nThe new market is now in operation in the lovely town of Prince Albert. The market is located on the river bank and is operated by Mr. Smith & Co.\n\nThe market is a huge success and the citizens are very pleased with its operation.\n\nThe new market is open daily from 9 a.m. to 6 p.m.\n\nThe market is operated by Mr. Smith & Co.\n\n* * *\n\nPRINCETON'S VISIT\n\nA correspondent writing to the Prince Albert Times states that Mr. Princeton has returned from a trip to London, England, and that he is now residing at the Prince Albert Hotel. He says that he had a most enjoyable time in London and that he visited many of the famous sights, including Westminster Abbey, the Tower of London, and the Houses of Parliament. He also visited the Science Museum and the Natural History Museum. He had a chance to meet many prominent people, including the Duke of York, Lord Palmerston, and Lord Salisbury.\n\nMr. Princeton also visited many of the famous shops and boutiques in London, including Selfridges, Harrods, and Liberty's. He says that he bought some very nice things, including a beautiful velvet coat and a pair of silk slippers.\n\nHe says that he had a very good time in London and that he will always remember his visit there.\n\n* * *\n\nHANLON DEFEATED\n\nLetter, Aug. 10th: A dispatch from Sydney, New South Wales, reports that the mining rush between Hanlon and Forsyth, both representatives of Western Australia, was conducted by the Rev. Arthur Lane, the incumbent of the parish, from Wednesday night when the great rush began. It is reported that if the rush continues, the mines will be deserted and that the mine owners will be forced to close. The report also indicates that the rush is likely to be short-lived.\n\n* * *\n\nCHIT-CHAT LOCALS\n\nThe Chatting Shop Reporters.\n\nAt the last meeting, Mr. Sharp opened the session.\n\nOn Saturday last, Mr. Sharp reported.\n\nThe extension of the B. R. C. Mill is now completed, and the building is being used.\n\nMr. Capelton has shown much interest in the progress of the new mill.\n\nA fresh stock of goods at Alex H. Clark & Co.'s store is now in high demand.\n\nTwo swift boats with 50 feet keel are being built at the west end for Messrs. Haynes & Co.\n\nThe Christmas tree at St. Matthew's Church will be decorated Monday next.\n\nThe new market here is expected daily, although the weather is still cool and the snow on the river is quite deep.\n\nTHE NEW MARKET\n\nThe new market is now in operation in the lovely town of Prince Albert. The market is located on the river bank and is operated by Mr. Smith & Co.\n\nThe market is a huge success and the citizens are very pleased with its operation.\n\nThe new market is open daily from 9 a.m. to 6 p.m.\n\nThe market is operated by Mr. Smith & Co.\n\n* * *\n\nGUARANTEED HIGH SCHOOL\n\nST. ANNE'S COVENTRY\n\nRE-OPENED, 1st SEPT.\n\nThe course of studies comprises every subject necessary for matriculation examinations, including French and Latin. The students are divided into classes according to ability, and constant instruction is given to secure advancement. Children under ten years of age are admitted. Reductions will be made in fees for Wants, Sons, Daughters. Write Master Superior or to Mrs. A. M. Walker, Chaplain at the Convent.\nTHE PRINCE ALBERT TIMES\n\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, AUGUST 29, 1884.\n\nTHE LIQUOR QUESTION\n\nDuring the ten years since the introduction of the North-West Com-\n\nmission of $3,125.73 has been received for liquor permits, and the question readily presents itself, should the permit system not be abolished? The granting of so many permits seems to have pleased friends, and the others grumble at having so restricted a permit both in quantity and time, and assure their neighbors more generously dealt with. But there is no doubt that the liquor is legally and illegally brought into the country, the time has no doubt arrived when liquor should be allowed to be sold. The poisonous substances sold at present are far more dangerous than the liquor illegally purchased, and whiskey is most pernicious to great numbers of draughty consumers.\n\nThe Calgary Herald in an article on this topic, condemns the system of granting permits for so short a period of time, and asserts that the Council had pondered too much to the wants of the temperance in communities. Mr. Turner adds that the Council is to blame for the sentiments of the temperance people and is alarmed at the proposal to close breweries; illicit distilling, being in the writers opinion better than legalized distilling. We hold that no man who wishes for a permit for the purpose to which it is to be used, but the medicinal permit nine cases out ten, is a falsification. We cannot understand how the temperance people have got so misled, indeed they seem to have got their desires all along, but the sentiment of illicit distillation being better than legalized breweries, we consider an examination of the temperance advocate of the old school lets off. The drunkenness in this country is not caused by the liquor procured by permits, but is the effect of the strict law forcing the poor to drink poisonous gin, lemon and last, but least chloroform. Who that has resided in these Territories some time and travelled in them, has not met the drunks, old and young, drunk, loud or silent, of no value whatever, and found them using drugs when very poisonous whiskey is not procurable? In this country to be made an asylum for inebriates, and the consumption of other industrial killers of the soul to be forbidden for ever with prohibition laws, and begrudged their glass of beer, through the croakings of Mr. Drink water, and a few bacchanalian shouts in the air, is absurd beyond belief. We visited some years ago the city of Gothenburg in Sweden, to inquire into the working of the total prohibition liquor law which had been in force there for some time, and found that the system had made matters worse, through the introduction of poisonous intoxicants and drugs, the latter being used to a fearful extent, particularly chloral. Visit France, where on a Sunday all can have their coffee pure and straight, and find in Bible loving Scotland in any of the crowded cities on a Sunday, where saloons are closed and whiskey unprocurable, and witness the lapsed masses having a good time, the thieves going about their work, and the police cells filled to overflowing at night. Better a thousand times to have the licensed houses opened, than have the people drugged and maimed. That the consumption of beverages would be illicit distilling and drunkenness, to a great extent cannot be doubted, for many who drank only beer before coming to this country, now drink whiskey and could hardly prefer it to cement. No temperance liquor law will ever stop drinking, a higher principle must guide a people. \"Righteousness exalteth a nation,\" education exalteth a nation, and these great factors must be looked to in diminishing intemperance in any Kingdom in the world.\n\nSCHOOL DISCIPLINE.\n\nThere can be but few, and those chiefly miserable bachelors, who will not be able to stand the strain of discipline given by a well known English judge, to the effect that in the eyes of the law, the detention of a pupil after school hours as punishment for failure in his lessons ordered to be studied at home, amounts to an assault on the part of the teacher. We believe that although painful it may be to school teachers, will be approved without qualification by child- ren, parents, and masters, whilst the legal magistrates will thank us by calling their attention to it, by improving their acquaintance with their legal duties, which they have been too apted to so cheerfully undertake, how- ever disagreeable they may be. We have no doubt, however, that the law will delegate authority to the teacher, even to the length of making children prepare for examinations, and send the child who objected to it to a parent, so that we allow the youngsters to ascertain the value of their studies before planning to crow. Of course it is impossible to lay down the exact limit of time during which a child may be sent to study profitably and safely, when so much depends upon the capacity of the child, the subject of study, the illustration during lesson and study, and the nature of the subjects studied. About one thing however there can exist no difference whatever, that is, the absolute necessity of discipline. The habit, generally the result of thoughtless speaking in put (or very mildly) a discharging bomb thrown upon people in the shape of children, is as injurious in its effects as its victims, and we have known instances of people so utterly lost to all sense of right and wrong as to send messages to teachers through their own children. To return to the matter of discipline, it must be remembered on the face of it nothing to those who know anything of the exhausting nature of brain work to suppose that ill properly attended to, the brain will not in a few years will receive more harm than good from having to apply themselves for more than a few minutes at a time. Likewise, of course as the brain gets older and stronger from use, the hours of study must be increased, and probably some home preparation of tasks fairly expected, but even then the influence of the young mind by the more advanced ability is prevented, must be carefully considered in connec- tion with the study of languages and composition. Each subject, each science and the practical teaching of each branch of knowledge, science may safely be added to the book work. The whole subject is so difficult to reduce to rules that it must be left entirely to the discretion of teachers, and we may feel very thankful that Prince Albert already possesses educational advantages, and that there is a vast prospect of the already existing facilities being in\n\nDr. A. STARKHOUSE\n\nDENTIST\n\nPRINCE ALBERT, N.W.T.\n\nTHE GABLE HOUSE,\n\nPool, Caron & Pigeon Hole Tables\n\nin the parlour.\n\nThe Best Variety of the Finest Brands always in stock, wholesale.\n\nJOHN WYERBECKHORN, PROP.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nA T. M. Campbell's New Store\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended to\n\nO. E. HUGHES\n\n& CO.,\n\nHAVE JUST RECEIVED A\n\nLARGE CONSIGNMENT\n\nOF\n\nGroceries,\n\nGents\n\nYouths\n\nClothing.\n\nBABY CLOTHING\n\nLUMBER, SHINGLES,\n\nDOORS, SASH,\n\nMOULDINGS,\n\nAND ALL SORTS OF,\n\nBUILDING MATERIAL,\n\nfor sale at lowest prices. We are now selling two\n\nBankrupt Stocks for CASH.\n\nDAVIS & CO.\n\nWholesale Lumber Dealers.\n\nHead Office 60 Main Street. Yard\n\nPoveshell Street, as C. P. R. siding.\n\nTHE WEST END HOUSE,\n\n(FIFTY FEET WEST OF POST OFFICE.)\n\nRooms at all Hours.\n\nGood Beer and cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nPROPRIETOR\n\nEAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\n\nAll kinds of Cake and Pastry Made to Order.\n\nHUGH MCDougall.\n\nEast End Bakery.\n\nPUBLIC NOTICE:\n\nAll persons are hereby required to take notice that the cutting of timber on the public lands is prohibited from the Minister of the Interior or the Land Agent. Any person who cuts timber on the public lands is prohibited by law, and all timber so cut shall be deemed to be waste timber, and be dealt with as the Minister of the Interior may direct.\n\nEach settler on a homestead quarter section, or part thereof, may make application to the Local Agent of the Dominion Lands, purchase a wood lot at such price as may be fixed by law, at 50 cents per acre.\n\nAny person other than a homestead settler desiring permission to cut timber on the public lands must apply to the Minister of the Interior, who will designate the amount of timber permitted. Persons who have already cut timber without authority must pay the demurrage charges, and must also pay for his offices or work before the 1st May, 1884, the amount of the demurrage charged under the Dominion Lands Act.\n\nD. B. McFARLANE,\n\nCrown Timber Agent.\n\nFURNITURE\n\nJust arrived. In addition to our former large stock, we have received our\n\nFancy Parlor\n\nBedroom Sets.\n\nGive us a call and see our\n\nSideboards,\n\nBureaus,\n\nBedsteads,\n\nCouchees,\n\nSofos,\n\nChairs of nearly all Descriptions,\n\nCradles & Cribs for the Babies\n\nRocking Chairs for the Ladies\n\nMattresses Single & Double to suit Customers.\n\nG. & G. E. CARTER,\n\nKNOX & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWells Bunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert.\n\nAll parties indebted to us are requested to call and settle by note or otherwise, falling which we are receiving no favor, and therefore none need be expected from.\nNORTH WEST COUNCIL.\n\nFRIDAY, AUGUST 29, 1884.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nThe minutes having been read,\n\nMr. White presented a petition from settlers in Regina District praying the Council to request the government to make more favorable conditions.\n\nReferred to Executive Committee.\n\nCommittee on Miscellaneous subjects reported that an Ordinance authorizing the erection of certain election districts \"in ultra area.\"\n\nMr. Ross proposed a report of resolution regarding the rights of settlers on Regina, Moose Jaw and Bell Farm reserves, to which Mr. White moved in amendment.\n\nResolved:\n\n1. That in the opinion of this Council a memorial should be sent through the Executive Council to the Dominion Government calling upon the Minister of the Interior to take advantage of an opportunity of recognizing the full claims of all bona fide settlers in the Regina and Moose Jaw Reserves.\n\n2. That in the opinion of this Council it be referred to the Executive Council to make such recommendations to the Dominion Lands Act of last session of Parliament be so extended as to allow residents of the township or adjoining townships opportunity to purchase land homesteaded in cases where the homestead has natives in the same or adjoining township.\n\nResolutions referred, on motion of Mr. Macdonald, to the Executive Committee.\n\nCouncil then resolved itself into committee to consider \"Civil Justice Ordinance.\"\n\nCouncil resumed. Committee reported progress.\n\nNATURAY, August 2.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nThe minutes having been read,\n\nCouncil went into Committee on \"Ordinance Ordinance.\"\n\nCouncil resumed. Ordinance reported amended and read a second time.\n\nCouncil again went into committee on \"Ordinance respecting the marking of stock.\"\n\nCouncil adjourned until 7 p.m.\n\nNATURAY, August 3.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nCouncil went into committee to consider \"Ordinance respecting infectious diseases among animals.\"\n\nCouncil resumed. Committee reported progress.\n\nCouncil again went into committee to consider \"Ordinance respecting infectious diseases among animals.\"\n\nCouncil adjourned until 7 p.m.\n\nNATURAY, August 4.\n\nThe Council met at 10 a.m., His Honor presiding.\n\nThe minutes having been read,\n\nCouncil went into committee to consider \"Ordinance respecting Billiard tables, etc.\"\n\nCouncil adjourned until 4 p.m.\n\nNATURAY, August 5.\n\nThe Council met at 2 p.m., His Honor presiding.\n\nThe minutes having been read,\n\nCouncil went into committee to consider \"Ordinance authorizing the erection of certain election districts 'in ultra area.'\"\n\nCouncil adjourned until 4 p.m.\n\nJAMES SINCLAIR\n\nMerchant Tailor.\n\nGENTS' FURNISHINGS.\n\nFIRST CASE BY EXPRESS.\n\nNEW SPRING & SUMMER MILLINERY.\n\nAND FANCY GOODS.\n\nMISS MACK & CO.\n\nCHESSTER THOMPSON.\n\nGeneral Blacksmith.\n\nRepairing Farm Machinery a Specialty.\n\nPRINCE ALBERT\n\nPainting Mills and Sash and Door Factory.\n\nGOODFELLOW BROS. - PROP.\n\nHORSE SHOE STORE.\n\nNEW GOODS.\n\nFresh Cheese.\n\nFresh Ham.\n\nFresh Prunes.\n\nFresh Raisins.\n\nFresh Currents.\n\nLemons, etc., etc.\n\nNEW SUITS.\n\n$8 SUITS.\n\nWM. GORDON.\n\nT. O. DAVIS.\n\nEAST END.\n\nNOTICE.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nCanada Pacific Ry Co. St. P. M. & M. Railway.\n\nTime Table.\n\nExpress leaves St. Vincent at 11½ a.m.; arrives at St. Paul at 6½ p.m. following day; returns the same day with train running in both directions.\n\nExpress leaves St. Paul at 6½ a.m., arriving at St. Vincent at 11½ a.m.; returns the same day making connections with the Canadian Pacific Express.\n\nOnly two trains a week run west on Mondays and Thursdays; Trains leaving Monday through to Calgary; Train leaving Thursday through to Edmonton.\n\nTrain runs to Moose Jaw only.\n\nExpress leaves St. Paul for Breckenside at 11½ a.m.; arrives at Breckenside at 12½ p.m.; returns the same day.\n\nDaily trains will run between Winnipeg and East End.\n\nCredit Valley Ry.\n\nWhen going EAST CANADA SOUTHERN and CREDIT VALLEY RAILWAYS.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & North Western Railways.\n\nPassengers over the Royal Route have all the advantages of Modern Railway Travel—First Class Sleeping Cars, First Class Dining Rooms, Lunches, and elegant Day and Night Sleeping Cars, with no change of Car for any Passenger between Minneapolis or Chicago and East End. Express leaves St. Paul and Council Bluffs, with connecting trains to East End.\n\nIf you travel by the best travelling Accommodation, you must travel by the Royal Route.\n\nROYAL ROUTE.\n\nJ. H. McGUIRE, General Traffic Manager.\n\nW. W. TEAGARDEN, General Agent.\n\nSt. Paul, Minn.\nTHE ENGLISH CHURCH.\n\nMany think in Britain the purchase of church livings, as it is called out there, should be abolished; at least it is opposed to the sale of the cure of souls. Non-conformists may look upon it in the same light, but it is not so in the Church of England. The subject has again been before the British Parliament, and two bills regulating the sale of church livings have been introduced, and both have been referred to the same committee. Singularly enough, no proposition is made to put an end to the sale of church livings by agreement. The feeling appears to be general that the heirs of the person who built the church or endowed it have the right to nominate to the Bishop the vicar or curate. No one is eligible to the post unless he is a member of the Established Church, which doctrine and ordinance are not approved by the officials of the Church. The equity and propriety of dispensing with the sale of livings to a vacant ecclesiastical benefice, apart from the estate of the original patron, is almost universally admitted. There are many reasons why church livings are sold. The estate may belong to minor heiresses, who would prefer to use the income to pay off debts, and there is no one of the requisite age and judgment to make the expenditure and present the claims. The proprietors of the land itself in debt, unwilling to part with his hereditary fall or ancient estate, he may take an interest in obtaining money for the support of the poor or freethinker; he may think the selection of the parish priest would be a better safeguard than the patron. There are also many reasons for the purchase of advowsons. Many persons of means desire to secure a living in an established church and the young men who are preparing to enter on that life are willing to pay handsomely for the privilege of nominating candidates. Wealthy relatives often desire to give a position of their own choosing, a short time in perpetuity. The choice ought to be handy for the youngest son of the spouse who has a large family.\n\nThere are also many beneficiaries in the Church of England, viz., belonging to the Crown, 1,144; to the bishops, 2,234; to deaneries, chapels, &c., 931; to the corporations, 750; to private persons, 7,000. There is a fund known as \"Queen Anne's Bounty,\" set aside for the purchase of advowsons and turning them over to the crown. Normally the Queen does not interfere in the matter, but names the candidates to the livings that are purchased by the trustees of this fund. The Church of England, Catholic or Protestant, is still officially united with the State. His bishops sit as members of parliament, and the State has a hand in the appointment of bishops. Having few external features, the English bishops have not claimed the right to select their own ministers. Notwithstanding the great importance of political and religious matters, there has been little change in the opinions of clergymen in regard to the question of buying and selling livings. The mechanics, farmers, and small traders are thought to be not competent to perform the duties of religious teachers. These are obliged to submit to the appointing power to the crown, and the pulpit might be filled by persons who are not fitted for the office. The bishop again, if he had all the appointments, might desire men who would be acceptable to the State and the crown, and he would likely practice nepotism. The patron of the church, who resides in the town, has the right to make efficient choice and to make a wise selection.\n\nThe abolition of the bills before Parliament proposes to abolish the right of the patron of a church to make presentations to the bishop in case of a vacancy, or even to purchase the sale of advowsons. The objections are directed to the present method of appointing ministers to take charge of parishes, and the patron's right to choose members of the Established Church, certain not from communions to good standing. The latter are said to be unable to present such things, and using them as a shield it seems easy for others to complain.\n\nThe Catholics and the Dissenters are interested in relation to their choice of a pastor. The bishop appoints whom he pleases, and there is scarcely any question regarding the matter of pastors. But in churches where the democratic principle prevails in regard to the selection of pastors, there is no end to dissensions and quarrels. The practice has been for a dozen or so of ministers to preach trial sermons, and then the congregations of these churches as opportunity to select a minister. When the day for election arrives, there is a meeting of the \"Cure\" and the elector is elected. Election is rejected to, as it is in a house meeting. Our party wins, and our losses do not affect the elector, because he is a Christian. They often secure and form a new church or unite with the rival one, and thus the division continues in order to cause trouble. Possibly churches are better satisfied with their pastors when they elect them by popular vote, than when they select them by popular vote. The sale of church livings does not appear to be as bad as it is supposed, as it is not always made by some one who does not understand its workings.\n\nThe Heirship.\n\nA special appeal for American donations will be sent for one year free to every body who will send us the names and addresses of 10 married ladies and 50 cents (two shillings) taken. This offer is made only to secure names to whom we shall send samples of our goods, and who will be glad to see our new line. We will send our catalogue free. This offer will extend for one year. Address us at once. The Hon. Mr. Rochester, Rochester, N.Y.\n\nNotice to Creditors.\n\nNotice is hereby given that all accounts due and owing to the Saskatchewan Club, Prince Albert, will be paid to the undersigned before Saturday the 23rd Instant.\n\nOtherwise same will be placed in suit for collection.\n\nAll outstanding accounts due and owing to the Club must be sent in with immediate notice from date, said accounts to be duly verified by the party who ordered the same.\n\nA. SPROAT,\nFor Saskatchewan Club.\n\nP.S. No account will be entertained by me unless sent in manner, and at the time indicated.\n\nPrince Albert, 14th August, 1884.\n\nSHANNON & McLEOD\n\nEmmanuel College\n\nThe Christmas Term will commence on Monday, September 1st, 1884\n\nFor particulars apply to the R.W. H. PLETT, Principal.\n\nSaskatchewan District Court\n\nNotice is hereby given that starting of the Court will be held at Prince Albert, on Monday, November 3rd, 1884, at 10 o'clock a.m. All parties interested are requested to make themselves present.\n\nJ. ROBERTSON,\nJudge of the Court.\n\nPrince Albert, Aug. 16th, 1884.\n\nNOTICE.\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCOS.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS AT J. L. JOHNSON & CO.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Snaths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884082901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6931, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8318, 1], [8318, 17895, 2], [17895, 22689, 3], [22689, 30238, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]