[{"id": "8cc211048623b8679673d81835abbab2a1aeac9f", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, MARCH 28, 1883.\n\nE. FLOOD & CO.,\nBANKERS and BROKERS,\nReal Estate, Insurance and\nFinancial Agents.\nPrince Albert Auction Rooms\nand\nReal Estate Exchange.\nPETERSON,\nHANAFIN & KEENAN,\nArchitects, Valuers, Real Estate, Con-\nstruction and Insurance Agents.\nPRINCE ALBERT.\n\nJACKSON & JACKSON,\nManufacturers' Agents, etc.\nAGENTS FOR THE\nWatson Manufacturing Company,\nThe Celebrated Retail Banking\nWhitcomb's Patent Combination Scale.\nPRINCE ALBERT.\n\nBANKING HOUSE\nof Macpherson & Knowles,\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest allowed on Deposits.\nSafe Deposit Room.\nDrafts drawn on Winnipeg, Brandon and Edmonton.\nBankers' acceptance accepted and paid at sight.\nJACKSON & JACKSON\nA good pony and harness pair of oxen.\n\nWAREHOUSING\nAT\nFORT QU'APPELLE.\n\nThe undersigned having ample accommodation, are prepared to store goods at reasonable rates, and freight and send them at Fort Qu'Appelle main post office at reasonable costs.\n\nMERCHANTS AND DEALERS\n\nGRUNDY BROS. & CO.\nFORT QU'APPELLE.\n\nGRAND UNION\nLivery & Sale Stables,\nNobel Street, Prince Albert.\n\nHorses and Cattle always on hand.\nOrders for double teams promptly attended to.\nChange moderately.\nThe only first-class Livery in the Town.\n\nS. J. DONALDSON, Prop.\n\nCONFEDERATION LIFE ASSOCIATION.\n\nA HOME COMPANY\nGuaranteed Capital, $500,000\nGovernment Deposits, $60,000\nA.M.R. MARKET, Agent.\nPrince Albert, N.W.T.\n\nCaledonian Restaurant\nMEALS AT ALL HOURS.\n\nHop Beer\nGuaranteed, $500,000 per gallon, retail.\nGuaranteed, $500,000 per gallon, wholesale.\nGuaranteed, $500,000 per gallon, retail.\nGuaranteed, $500,000 per gallon, wholesale.\n\nGEORGE A. MILLER,\nProprietor.\n\nTHE GABLE HOUSE.\nTHE BEST BEER AND CIGARS\nOF THE FINEST BRANDS ALWAYS ON HAND.\n\nWHOLESALE AND RETAIL.\nJOHN WYNNEWEIGH, PROP.\n\nPRINCE ALBERT, N.W.T., Feb. 27, 1883.\n\nD. H. MACDOWALL, ESQ.,\nPRINCE ALBERT.\n\nSOUTH BRANCH, March 28, 1883.\n\nWe, the undersigned residents of the District of Lorne, having full confidence in your integrity and ability to represent us in the North West Council, hereby pledge ourselves to vote for you in support of your candidacy. We believe that your experience and qualifications will enable you to be an effective representative of our interests. We urge you to accept our support and vote for you at the coming election.\n\nWe are,\n\nYours respectfully,\n\nEdward Taylor,\nJohn H. Gordon,\nGeorge Tail,\nWilliam Thomas,\nPhilip Turner,\nPatrick Anderson,\nFrancis Fournier,\nGeorge Whitford,\nGeorge F. Whitford,\nJohn Atwood,\nAdam Butler,\nRobert Harper,\nJames B. Mack,\nJohn Donald,\nPeter Campbell,\nAlexander Mitchell,\nJeremiah Stevens,\nJ. E. W. Brown,\nBernard Newmarch.\n\nNOTICE.\n\nTo Merchants and Others.\n\nAccounts collected or Business Books written up, balanced, etc.,\nWill also well apply their personally or by letter at the Post Office or Teeside Office.\n\nA. R. BURNS,\nJ. L. JOHNSON & CO.\n\nHave on hand a full stock\nContractors' Supplies,\nChopping Axes,\nHudson Bay Axes,\nCross Cut Saws,\nAxle Handles, etc.\nSpecial prices to contractors.\n\nCAMPBELL'S BLOCK.\nTHE GABLE HOUSE.\nTHE BEST BEER AND CIGARS\nOF THE FINEST BRANDS ALWAYS ON HAND.\n\nTO THE PUBLIC.\n\nWe have made arrangements to leave Mr. J. Agnew's residence store and Markley & Co.'s dry goods store, and have moved into the above mentioned places will find their papers there. Also at this place.\nNotice to Creditors.\n\nIn the Goods of Alexander Rodenick Kennedy, deceased.\n\nWe have just opened out\n\nTEN CASES OF STAPLE & FANCY DRY GOODS\n\nWhich we are now offering at special prices.\n\nFlannels\n\nPlain Grey,\nTwisted Grey,\nNavy Blue Twilled,\nScarlet Saxony,\nNavy Blue Saxony,\nCardinal Saxony,\nHarry Redked,\nGrey Canton\n\nDress Goods\n\nBlack and Colored Cashmere,\nColored Lustres,\nAll Wool French Beiges,\nPolka Dots,\nBlack Gros Grain Silk,\nBlack Satins,\nColored Satins in all shades,\nBlack and Colored Velveteens.\n\nPrints\n\nA full and complete assortment in this line, including Ashton's Celebrated Prints.\n\nYarns\n\nScotch 4-ply Fingering,\nCanada and Homespun,\nin all colors.\n\nHandkerchiefs\n\nA Choice Assortment of Ladies' and Gent's Silk and Linen Handkerchiefs,\nTurkey Red Handkerchiefs.\n\nQuilts\n\nWhite and Colored Quilts in all sizes.\n\nBlankets\n\nWe offer special value in Hudson Bay White Blankets—2½, 3½, 4½, 5½ and 6 points.\nGrey Camp Blankets.\n\nSmallwares\n\nLinen and Cotton Spools,\nSilk Twist, Silk Spools,\nBraids, Buttons, Needles,\nFins, etc., etc., etc.\n\nWholesale Clothing\n\nJames O'Brien & Co.,\nPrincess Street, Winnipeg.\n\nFRANCIS ALBERT REAL ESTATE AND AUCTION ROOMS\n\nMESSRS. PETESEN, HANAFIN & KEENAN\n\nREAL ESTATE AGENTS,\n\nOffer for sale the following town lots situated in the business part of the rising town of Prince Albert.\n\nMISSION PROPERTY\n\nLots 15 and 16, Block K.\n\nHUGHES ESTATE\n\nLots 18 and 19, Range V.\n\nHUBB & BAKER ESTATE.\n\nLots 17 and 18, Range V.\n\nDOUG. PETESEN, J. D. HANAFIN, H. KEENAN.\n\nOYSTERS, OYSTERS, OYSTERS.\n\nWe have just received a few CASES of FRESH OYSTERS, which will be sold at COST.\n\nAT THE ROCK BOTTOM STORE.\n\nALSO A FEW CASES\n\nDRY GOODS, GROCERIES, BOOTS AND SHOES,\nRUBBERS, CROCKERY and NICKLE-PLATED CUTLERY.\n\nOur Motto: Small Profits and Quick Returns.\n\nH. WALTERS, F. C. BAKER.\n\nHATS THAT R HATS.\n\nIf you want a first-class HAT of the latest style go to the Horse Shoe Store.\n\n25 PER CENT OFF FOR CASH.\n\nWODDBINE BILLIARD PARLOR\n\nThe Palace Saloon of the North West.\n\nTwo Doors west of the Horse Shoe Store, River Street.\n\nTwo First-Class Brunswick and Balk Tables. Crowded nightly.\n\nBest Beer. Sparkling Cider. Finest Imported Cigars.\n\nTom Davis - Prop.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goschen, N. W. T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull particulars in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. L. BRYDGES, Land Commissioner.\nSudden Death.\n\nWald was brought to death on Sunday morning by Mr. Joseph McPhail, who lives in Prince Albert. He was a neighbour of the man of Oliver, whose body was found near the latter's residence Saturday afternoon, by some neighbour named Mr. Porter. The body was carried into the deceased's house by Mr. Porter, and placed in the same place where it was found in the initial period. On Monday morning, Mr. Porter, accompanied by Mr. Oliver, went out with the other officers of the Lodge, to make a search for the missing member, to ensure him the particulars of the proceedings. It appears that the deceased had been suffering from an affection of the heart, and for that reason he had been sent to Mr. Porter. There seems to be no doubt that while engaged about his work, he fell down and died, which, as stated, proved fatal. The effects of the fall were immediately perceived in the members of the party present, who immediately called for assistance, but the deceased died entirely alone and without any apparent struggle. Mr. Porter will administer all affairs until his brother, Mr. John C. Oliver, number three, returns from the United States. The funeral of the late Mr. Oliver, who died at the age of thirty-three years, took place this afternoon at the Presbyterian Cemetery, with Masonic honours.\n\nItems of Interest.\n\nThe German police have got possession of some of Hartmann's communications from Nitidus, which are now being subjected to the German censorship.\n\nMr. Macdonald has received correspondence touching leases or coal lands in the North West, and statements of payments made and amounts owing.\n\nIt is probable that during the session of the Legislature, the question of the extension of the Portage Westward will be discussed. Mr. Macdonald has written to the Secretary of State for Canada, expressing his opinion that the extension should be made.\n\nThe Echo House, Qu'Appelle.\n\nThe Echo House is situated on the banks of the Qu'Appelle River, about five miles from Prince Albert. It is a comfortable and well-kept establishment, and is highly recommended by those who have visited it.\n\nGovernment House.\n\nGovernment House is situated on the banks of the Qu'Appelle River, about five miles from Prince Albert. It is a comfortable and well-kept establishment, and is highly recommended by those who have visited it.\n\nWholesale Importers\n\nDry Goods, Fancy Goods, Jewellery, Druggists' Sundries, etc., etc.\n\nIndian Traders\n\nRidge Store\n\nJ.M. Campbell\n\nNotice\n\nTo Merchants:\n\nFreighters will be required to show Shipping Bills and an Order before your freight will be delivered to them.\n\nRespectfully,\n\nAgent, C.P.R.\n\nTry Hugh McDougall's Bread!\n\nHugh McDougall\n\nEast End Bakery\n\nTo the Ladies\n\nMillinery and Ladies Furnishings\n\nMiss Mack & Co.\n\nCampbell's Clock, River Street, Prince Albert, N.W.T.\n\nW.J.C. Ritter\n\nBuilder and Contractor\n\nAll Orders Promptly Attended to.\n\nPlans and Estimates furnished when required.\n\nStobart, Eden & Co.\n\nGeneral Merchants\n\nIndian Traders\n\nRidge Store\n\nJohn E. Sinclair\n\nPublic Notice is hereby given that the property of the Dominion Land Surveyor, located in the Town of Prince Albert, N.W.T., is now open for sale.\n\nJ.M. Campbell\n\nNotice\n\nTo Merchants:\n\nFreighters will be required to show Shipping Bills and an Order before your freight will be delivered to them.\n\nRespectfully,\n\nAgent, C.P.R.\n\nG.D. Northgraves\n\nWatchmaker and Jeweller\n\nJ.Sinclair\n\nMerchant Tailor\n\nPrince Albert, N.W.T.\n\nJ.R. McPhail\n\nHardware, Box and Parlor Stoves, Paints & Oils, Rope, Glass, Broad and Chopping Axes, Cross Cut Saws, Powder, Shot & Caps, Granite Iron Ware.\n\nJames Scott\n\nGable House\n\nFurniture\n\nC.G. Carter\n\nFurniture\n\nSideboards, Bureaus, Bedsteads, Couches, Teets, Bedroom Sets, Chairs of nearly all Descriptions, Cradles & Cribs for the Babies, Rocking Chairs for the Ladies, Walkers Single & Double to suit Customers.\n\nPumps!\n\nAcorn & Cross\n\nStorage and Re-shipping Warehouse\n\nTroy, C.P.R. West\n\nNext House to Scott's Farm.\nTHE PRINCE ALBERT TIMES\nWEDNESDAY, MARCH 28, 1883\n\nCOMMUNICATIONS.\n\nThe following will be seen in correspondence from Mr. Macdonald, who has been appointed to the position of Commissioner of Crown Lands. Mr. Macdonald has been appointed to the position of Commissioner of Crown Lands, and he will take up his duties at once. He will be responsible for the administration of the Crown Lands Act, and he will be assisted by a number of deputies.\n\nTHE COMING ELECTION.\n\nTo the Editor of the Times:\n\nSir,\n\nI have received a number of communications from various parts of the country, and I am glad to see that there is a great deal of interest in the coming election. The question of the future of the Dominion is a very important one, and it is essential that we should all do our best to ensure a fair and just result. I would urge all my readers to vote, and to vote wisely.\n\nYours sincerely,\n\nA. B. HALL.\n\nTO THE ELECTORS OF THE Electoral District OF LORNE\n\nGentlemen—\n\nHaving been requested by a number of friends to offer myself as a candidate for the coming Election, I have respectfully declined, as I feel myself unequal to the task, and if returned, I pledge myself not to use any power to further the interests of Prince Albert and vicinity.\n\nI remain, gentlemen,\n\nyour obedient servant,\n\nA. B. PORTER, M.H.\n\nNotice of Dissolution.\n\nNotice is hereby given that the undersigned, Mr. Porter, M.H., has been elected to the office of Commissioner of Crown Lands, under the name of HURD & BAKER, have therefore dissolved by mutual consent, their business at Prince Albert, N.W.T., this day of March, 1883.\n\nW. H. HURD.\n\nALARGESTOCK ARRIVED A FEW DAYS AGO AT THE MEDICAL HALL, CONSISTING OF Drugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc., AND ARE NOW OPENED OUT. ALSO ON HAND A GOOD SUPPLY OF Patent Medicines, INCLUDING Fellow's Syrup, St. Jacob's Oil, Electric Oil, Pain Destroyer, Black Oil, Burdock Blood Bitters, Vegetable Discovery, Cod Liver Oil Emulsion, Medical Discovery, August Flower, Etc., Etc.\n\nJobbers supplied on reasonable terms. Special discounts on large orders. Physicians prescriptions and family recipes carefully prepared.\n\nTERMS--CASH.\n\nT. E. JACKSON,\n\nIn our New Premises, next door east of Farmer Home, and north of Old Presbyterian Church.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883032801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3377, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3406, 1], [3406, 6170, 2], [6170, 10152, 3], [10152, 12476, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]