[{"id": "3db19caad737aa8a44a1c20ec6fbee031011d26b", "text": "RAILWAY MATTERS\n\nIt appears that the Regina and Long Lake railway will be the first to enter the Saskatchewan District, and it rumors be true it will be laid about half distance from its present terminus this year and completed in Prince Albert a short time after. The proposed line would run from Regina to Saskatoon crossing the South Branch at that point and branching off into this place and Brandon. While the general wish of the people here was to have the main road directed via Winnipeg yet there are reasons why the Regina road might be as advantageous to us. Hitherto we have looked entirely to the countries across the Atlantic as our only market for our produce and if we could get connected with the only market then it would add a great deal to the cost of transportation and consequently diminish the local price of grain going round by Regina on account of the length of the haulage. But it has been generally believed that Canada is rapidly developing an extensive and important trade with Japan and other countries on that side of the Pacific, and in the near future these countries are likely to afford an enormous demand for grain and other produce, and we will be importing largely, direct from these markets. It may prove more profitable for us to deal with the new market than the old Pacific (that was the old markets on the west coast of the Atlantic). In the former case we would be much nearer to our foreign market going by Regina than if we had to go round by Winnipeg. In any event the route via Regina will be a great advantage to this district and we will be very glad to see it pushed ahead and we trust that the Government will make some effort to secure the country for public use in connection. It is also highly desirable that the matter be investigated by the M. & N.W. Rail, re- storing their mining, has passed the House of Commons, this legislation from our delegates for the contrary contemplated being, and such be the\nA Dead Drop!\n\nPrices\n\nJ. M. Campbell's\n\nFirst Class Goods\n\nMagnificent New Spring Goods\n\nFar surpassing any previous seasons, both for richness in design and quality. The Variety of New Goods in Every Department is Immense.\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. Campbell\n\nDry Lumber\n\nMoore & Macdowall\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra\"\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888042001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 752, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1962, 2], [1962, 2818, 3], [2818, 2818, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]