[{"id": "7b544c7b14518d35c769a076f958bea30b70a11f", "text": "MORONTI CHURCH.\n\nServices conducted at the Mission by Rev. Robert Parker on Sundays, 12 P.M., Rev. Charles Parker at prayer.\n\nCOMTITI CURCH CHAPEL AT THE PRINCE ALBERT EXTRA GRANDEUR—\n\nBANKING HOUSE OF MACARTHUR & KNOWLES,\nPRINCE ALBERT, N.W.T.\nThomas Hall General Banking Business.\n\nBanking House of Macarthur & Knowles, established in Prince Albert, N.W.T., offers a wide range of banking services. Located in the heart of downtown, our bank provides convenient access to your finances.\n\nROYAL CANADIAN COMMISSARY BENNETT'S PHARMACY.\n\nCOMMUNICATIONS.\n\nOh—In your last issue I was pleased to learn that the government planned to send a telegraphist alongside Mr. Knowles in his position as Cambrian Mine Manager on Cap Corey. However, I am concerned that the telegraphist's role will remain purely administrative and not extend into the fieldwork required for mine exploration. Despite the initial enthusiasm shown by Mr. Knowles' appointment, the lack of tangible progress in mining activities thus far has raised doubts among shareholders regarding the feasibility of such a project.\n\n dello-glacial deposits were found at various points along the river valley. These finds provide evidence supporting theories about prehistoric animal life cycles.\n\nW. B. GUNN, M.A.,\nConterattor, Solicitor, Courtney,\nPrince Albert, N.W.T.\n\nLEWIS—a letter addressed to \"Mr. Lewis,\" possibly written from the Lewis Place Hotel in Prince Albert, Southern Saskatchewan, refers to a local喝了of political protests that had recently escalated. The writer expresses hope that these actions will lead to meaningful reforms.\n\nPRINCE ALBERT HOUSER,\n\nALBERT HOPKINS & CO.—A, Lot, Prince Albert, N.W.T.\n\nBARBERSHOPS & MECHANIC: CHARLES BOANDELL\n\nPRINCE ALBERT Tubeley\n\nWILLIAM V. MACLEOD,\n\nConnerattor, Solicitor, Etc.\n\nSONDERPHINI ADAMS N.W.T.\n\nROBERT THOMSON,\nSign & Ornamental Painter.\n\nLOVELY HIGHGLAND ROUGHS.nil.\n\nGIAINMAINT & PARKER remışing short notice.\n\nP. EDWARDS, MANUFACTURER'S DEPOT.\n\nDEVELOPMENT AND Paperhanging a Specialty.\nHudson Bay Route.\n\nThe Country and Climate Along the Hudson Bay Route. Extracts from a Lecture by Arthur Nelson.\n\nStarting from Winnipeg and going northward along the route explored by Nelson to the Grand Rapids, the region traversed through is such that the expense of building a railway would be very high. It is a very level country with plains, swamps, lakes, and streams. There is no rock in this country on the surface, but there are many hills and mountains, and forests abound. These scenes are so vast and beautiful that they will be remembered by all who visit them.\n\nThe \"Dog House\" is a valuable stopping place on the railway. Beyond this point the country becomes more mountainous, and there is a range of mountains to the west. There is also a river of any size to cross, and this can be easily done by boat or by horse. The route goes through the forest, and there are many trees to cut down. The trees are very tall and strong, and the wood is very hard and heavy. The climate is very cold, and the snow falls heavily. The people who live here are very hardworking and industrious.\n\nBuffalo Hall!\n\nGreat Clearing Sale of FURS, MITTS AND MOCASSINS\n\nOwing to the above choice stock of goods reaching here so late, we have decided to offer\n\nLadies' Astrachan Sacsques, Ladies' and Men's S.S. Seal, Persian Lamb, Otter, Beaver, Astrachan and Cloth Caps, Kid Mitts, Buck Mitts, and an immense stock of Ladies', Men's and Youth's Mocassins, at cost for cash.\n\nBETTYS & Gwynne.\n\nHARDWARE!\n\nJ. L. JOHNSON & CO.\n\nDEALERS IN\n\nGeneral, Shelf and Heavy Hardware, Glass, Paints, Oils, Etc.\n\nMain St., Prince Albert.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,500,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above lots will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nJACKSON & JACKSON", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884030701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 1230, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2015, 1], [2015, 2015, 2], [2015, 2015, 3], [2015, 4434, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]