[{"id": "4184971a739716e04ec3589d3cf6cc7d6dc3dd73", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nVOL.7.—NO.19. PRINCE ALBERT, SASK., FRIDAY, APRIL 12, 1889. $2.50 A YEAR.\n\nBANKINGHOUSE OF Macarthur & Knowles, Prince Albert, N.W.T.\n\nTransact a General Banking Business. Interest allowed on Deposits. Notices of Cheques immediately acknowledged and promptly returned. Branches opened at all points in the Dominion. Cash advances undertaken and promptly advanced. Bankers—Merchant's Bank of Canada\n\nWILLIAM V. MACLURE Advocate, Notary, Etc.\n\nPRINCE ALBERT, SASK., N.W.T.\n\nBREWSTER & MOKER Advocates, Solicitors, Notaries Public, Etc.\n\nPRINCE ALBERT, SASK.\n\nSTEPHEN BREWSTER JAMES MCGRATH\n\nW. NEWLANDS Advocate, Notary Public.\n\nPRINCE ALBERT, SASK., N.W.T.\n\nW. R. GUNN, M.A. Advocate, Notary Public, Conveyancer\n\nPRINCE ALBERT, SASK.\n\nC. R. STOVEL Dentist.\n\nOfficerever the Hudson's Bay Co.'s Branch Store, Taun's Rock.\n\nJ. LSTOCK REID Dominion Land Surveyor.\n\nPRINCE ALBERT, SASK.\n\nROYAL MAIL STAGE CO.\n\nWeekly between the Apaloo Station and Prince Albert. Leaving Prince Albert at 6 p.m. every Tuesday morning. Passengers express letters and packages.\n\nLESON & SCOTT.\n\nA. C. PATTERSON, Forwarding Agent.\n\nAll goods attended to and shipped immediately. Express Office attached. Will receive special attention and be forwarded by express or stage to any part of the Dominion. Orders solicited.\n\nROBERT THOMSON, Sign and Ornamental Painter.\n\nCalumming and Paperhangin on Short Notice.\n\nDecorative Painting a Specialty.\n\nROBT BUCKLEY, Auctioneer, Accountant, Estate and General Agent.\n\nHas on hand a number of Town Lots which will be sold cheap on easy terms.\n\nImproved Farms.\n\nRIVER STREET.\n\nPRINCE ALBERT.\n\nQUEEN'S HOTEL T. ORAM Proprietor.\n\nLeading Hotel in Saskatchewan.\n\nBetween Johnson's Campbell's Store.\n\nBoarded by the day or week.\n\nThe rooms supplied with the finest brands of Oats, Barley, Rye and Blackwood Brew, famous Soft Drink.\n\nEvery attention paid to the travelling public.\n\nTHOS. ORAM.\n\nNEILSON & McBEATH.\n\nIMPOUNDED!\n\nImpounded on March 3rd, one Two Year Old Grey Steer.\n\nIf not claimed within seven days from the above date, the animal will be sold at public auction on Wednesday, April 17th, 1889.\n\nAt the Office of Mr. W. H. ROBINSON, Postmaster.\n\nSTOP!\n\nWM. SHANNON'S.\n\nAnd here goes by buying his boots and shoes there. He is selling off the balance of his stock.\n\nWINTER GOODS at COST, for cash, consisting of:\n\nMits, caps, overcoats, overalls of all sizes.\n\nHood and neckerchiefs.\n\nGloves of all sizes.\n\nHis store is well stocked.\n\nPRINCE ALBERT, SASK., N.W.T.\n\nPRINCE ALBERT PHARMACY\n\nLadon's Compound syrup of Red Spruce is now being used extensively throughout the Dominion. It is a valuable remedy for many complaints. It is a powerful expectorant and cough suppressant.\n\nPRINCE ALBERT, SASK.\n\nP.L. LAFOND\n\nPharmacist and Chemist.\n\nAnother Nice Lot of Watches, Rings, Sleeves Buttons, etc.\n\nJust Received at the POST OFFICE JEWELLERY STORE.\n\nCall and examine, and at the same have your watch set to correct standard time.\n\nR. B. WAY Marriage Licenses Issued.\n\nBUY YOUR BOOTS AND SHOES\n\nFrom S. McLeod.\n\nLadies', Minors' and Children's Fine Shoes and Slippers in Great Variety. Also MEN'S TOP BOOTS.\n\nJUST RECEIVED:\n\nTwelve Cases of Rubbers.\n\nPRINCE ALBERT, SASK.\n\nSUPREME COURT\n\nPublic Notice is hereby given that His Honour Mr. Justice C. F. Murray has been appointed Judge of the Supreme Court of Saskatchewan. The Judge shall hold his first session at Prince Albert on Wednesday, April 17th, 1889.\n\nPRINCE ALBERT, Tuesday, May 13th, 1889.\n\nBy order,\n\nH. R. GORDON, Secretary.\n\nLieutenant-Governor's Office, Regina, March 14th, 1889.\n\nNOTICE\n\nThe Militia and Voters in the Northern Territories and throughout Manitoba.\n\nCALLED TOGENDERS, recommended by the Governor General in Council, to enrol and rendezvous \"For Exercise and Inspection\" at the following places:\n\nManitoba: At Winnipeg, on April 17th; at Brandon, on April 24th; at Portage la Prairie, on April 31st; at Dauphin, on May 7th; at Fort Garry, on May 14th; at Portage la Prairie, on May 21st; at Dauphin, on May 28th.\n\nOntario: At Toronto, on April 17th; at Ottawa, on April 24th; at Kingston, on April 31st; at Belleville, on May 7th; at Cornwall, on May 14th; at Kingston, on May 21st; at Belleville, on May 28th.\n\nThe enrolment will take place at the following times:\n\nManitoba: At Winnipeg, on April 17th, at 10 a.m.; at Brandon, on April 24th, at 10 a.m.; at Portage la Prairie, on April 31st, at 10 a.m.; at Dauphin, on May 7th, at 10 a.m.; at Fort Garry, on May 14th, at 10 a.m.; at Portage la Prairie, on May 21st, at 10 a.m.; at Dauphin, on May 28th, at 10 a.m.\n\nOntario: At Toronto, on April 17th, at 10 a.m.; at Ottawa, on April 24th, at 10 a.m.; at Kingston, on April 31st, at 10 a.m.; at Belleville, on May 7th, at 10 a.m.; at Cornwall, on May 14th, at 10 a.m.; at Kingston, on May 21st, at 10 a.m.; at Belleville, on May 28th, at 10 a.m.\n\nTELEGRAFIC.\n\n(By Special Telegraph.)\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporter.\n\nHate? Hate? Hate? In all the latest shades and styles at C. B. Baker's.\n\nG. S. Davison left for the east this week.\n\nCapt. Henry, M.L.A., for Kinistino, was in town on Wednesday.\n\nExaminations and translation for the new building were commenced this week.\n\nNext Friday being Good Friday service will be held in the church at 11 o'clock A.M.\n\nThe police have begun their spring drill and the boys have a little more leisure.\n\nInsp. Heppe of the N.W.M.P., left for Saskatoon and other posts, on a tour of inspection this week.\n\nSeveral operations are in full blast all over the country, and in sight the grain is beginning to sprout.\n\nInsp. Cathbert, of the N.W.M.P., left for Regina on Tuesday last, and leave of absence was granted him for six months.\n\nA meeting of the St. George's dinner committee will be held on Monday evening, at the residence of Mr. J. H. Mitchell, M.L.A., for Estevan, who was in town Saturday, and is much better in health since his return from the east.\n\nEvery body who has been suffering from the effects of the cold weather, is urged to make an effort to the healthful exercise or manipulating the spade and rake.\n\nR. B. Way contemplate building a house on the homestead on the hill this summer and is buying stone for the foundation tomorrow.\n\nCapt. Douglas, of Dark Lake, left here last Tuesday for Lake Athabasca where he will take command of one of the H.C. Boats.\n\nThe time has been extended for receiving tenders for the supply of flour and bacon for the Indian Department, till Tuesday next.\n\nThe annual meeting of the Fire Company will be held in the Town Hall on Wednesday evening, the 13th inst. A good attendance of all parties is expected.\n\nAntiques valued at nearly $10,000, including McAlpine's statues yesterday, by public auction, a fine young stallion for $150.\n\nCob Spurt has been doing very improving in health, but now that the fine spring weather has come, and he can get out every day, we hope his recovery will be very rapid.\n\nLarge stock of luggage and team Whigs, also good range Ropes, etc., also a tidy lot of second-hand Leather Buggy Whip just received at R.C. McLean & Co's.\n\nThe rifle practice throughout the province are preparing for the big shooting match on the 15th of May. Our local association expect to carry off the cup without practice, but they may get left.\n\nIndian Farm Instructor William, at John Smith's farm, has been visiting and reporting the Indians as well as seeding operations, some of their wheat having already started to grow. They will put in a big crop this year.\n\nThe ice in the river went out very quickly this spring. On Friday last a large floe of twenty feet across was seen just west of the town; on Sunday the change was completed and the ice on the Missouri River had gone out, and was all gone before plenty of people thought it would be started. The weather did not care and at present it is a most ideal boat run than at any time for years previous.\n\nWe are selling groceries cheaper than anyone else in town, says Mr. C. Baker.\n\nADVICE TO MOTORISTS.\n\nAny person found beating a horse and kicking a dog will be prosecuted. We have seen too much of these things. We will not tolerate them in this community. It is a disgraceful thing to see a horse abused in this manner, and we will not tolerate it. We will prosecute anyone who does it.\n\nThe Prince Albert Times is pleased to announce that it will be publishing a series of articles on the history of Prince Albert and the surrounding area. These articles will cover various aspects of the region's past, including its early settlement, the development of transportation routes, and the growth of industry. Look for these articles in future issues of the Times.\nPRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. ALBAN'S CHURCH - Service, 11 a.m., and 7 p.m.; Sunday School, 6-8 p.m.; Communion in Church at 12 noon.\n\nST. CATHARINE'S - 10 a.m., Rev. Canon Fox.\n\nST. PAUL'S - 10 a.m., Rev. Dr. McFarlane.\n\nST. ANDREW'S - 10:30 a.m., Rev. Dr. McFarlane.\n\nHETERODONIC MISSIONARY - Rev. A. H. Smith.\n\nST. PAUL'S (Presbyterian) - 11 a.m., and 7 p.m.; Service, 11 a.m.; Sunday School, 6-8 p.m.; Communion in Church at 12 noon.\n\nST. MATTHEW'S (Methodist) - Deer Hill Road and Inverness Street, Service, 11 a.m.; Sunday School, 12 noon; Communion at 12 noon.\n\nTHURSDAY EVENINGS AT 8:30 - Missions and East End Church.\n\nNEW YORK\n\nOUR SITUATION\n\nThe town of Prince Albert and surrounding district are now entering upon the most important epoch in their history, one that must be followed either by the beautiful sunshine of prosperity, or will be over-taken by a dark and lamentable depression of most severe. While all would rejoice to know that the former would be our lot, yet we see the hand of warning pointing towards the latter. The pioneers who came here in the early history of this district believed that they would be on or near the site of railway that was then proposed by the Government to be built, stretching from ocean to ocean, and which was believed would bind together in a happy family circle our great Dominion. These noble and worthy settlers, who have proved themselves true and loyal, have braved difficulties and hardships for years, far from the scenes of their birth and the dear near and dear friends, and hope that at no distant day they would reap the reward of their labors. These early years in the settlement of this district were bright and full of hope. The climate was highly invigorating, and the magnificent crops raised each year after proved not only the great fertility of the soil, but also its lasting endurance. This great and fertile belt has been spoken of in nearly every case as the \"Garden of the North.\" The future of this great country could then only be anticipated. Such glorious tidings soon spread abroad, and so year after year saw the settlement advancing, immigrants steadily coming in and pushing up for them the good and comfortable homes, believing that in the near future they would have railway connection with the outer world, thus binding and identifying themselves more closely with the rest of the Dominion. But in the midst of hope comes the news, \"all negotiations for a railway to Prince Albert broken off.\" Many fail to believe that such is the case. They cannot and will not believe that sympathy for those who have been true and loyal to that dear old flag.\n\nThat for a thousand years Has braved the battle and the brass, has already departed, and that a once happy and prosperous settlement is doomed to become depleted and extinct. The few who may now be calling for succor, will be echoed and re-echoed by many of our people for help. Already the cry for food has filled the air, and until business revives and something be done to give employment to many who now have nothing to do, destitution—yes, starvation—must necessarily follow. Those who have saved money must be prepared to meet labor. There are others who have no seed therewith to sow, and those who are in a position to farm on a large and profitable scale must do so, lest their labor will prove in vain, not finding any market to dispose of their produce. There must be a market for all surplus, and that boon can only be conferred on this place by means of railway communication. Being 250 miles or over from any railway station, it would be impossible to export any of the surplus products of the district except at great loss. Many of our people, by their ambition, energy and indomitable perseverance, have made for themselves comfortable homes, and in these homes they have their all, and now must sacrifice their homes and their lands and turn their backs upon what was once one of the most prosperous settlements in the nation. Must perish. The finger of God's ear is raised, and is about to bring good tidings of joy, or will it be—we care not for you, depart from our land? Our situation is a deplorable one, and demands the immediate and urgent consideration of the Government. We trust that some steps will be taken by the Government that will assure us a railroad at no distant date. This community do not desire to be fed year after year on Government (apparently) charity. We believe that the time will come when it will be said that b.o.m will never come until it erect facilities for importing the surplus products of the country to advantage.\n\nDARWIN'S IDEAL.\n\nDarwin's theory of the \"survival of the fittest\" is simply that the weakly die, while the robust and hardy thrive and multiply. Herein lies the lesson and how necessary to now only that which is suited by nature to growth and development. O.M. Ferri & Co., the greatest firm in the world, say that Darwin, in his \"Origin and Variation,\" says, \"supply only the best and purest, raising their own seed by selection, and giving the best possible treatment.\" Their seed Annual for 1906 is now ready, and should be in the hands of all who cultivate. It is sent free of charge, and the name of the firm's address as W. J. Ferri & Co., and they will forward you a copy.\n\nNOTICE\n\nSchool children, marked \"students for the year 1906,\" are respectfully informed that the school will open on Thursday, the 18th instant, and will continue until the 20th of June, inclusive. The following quantities of school supplies are required by and in accordance with the regulations of the Department of Education of which, together with forms for fees, etc., will be sent to each student named on the attached \"agency list.\"\n\nPens, 10¢ per 100.\n\nPencils, 10¢ per 100.\n\nRubber, 10¢ per 100.\n\nInk, 10¢ per 100.\n\nCampbell's Cathartic Compound (Liquid).\n\nCure Chronic Constipation, Catarrh, All Complaints arising from a disordered state of the Liver, Stomach and Bowels, Indigestion, Bilious Affections, Headache, Neuralgia, Asthma, Coughs, Loss of Appetite, Gout, Nervous Debility, Nausea, or Weakness, &c., &c.\n\nPrice 10¢ each per bottle.\n\nDAVIS & LAWRENCE Co., Limited,\n\nMontreal.\n\nHAYTER REED.\n\nIndian Office, Regina, March 18th.\n\nHORSE SHOE STORE.\n\nJUST ARRIVED—LARGE ASSORTMENT DRESS GOODS!\n\nComprising Men's Velling, Sergees, Cashmere, New Prizes, Muslins, Seersuckers Ladies' Trimmed Hats, Children's Hats.\n\nFULL RANGE LATEST STYLES MEN'S AMERICAN FELT HATS.\n\nLatest in Men's, Youths' and Boys' Clothing.\n\nCall Early and get Your Choice—Prices Lower than ever.\n\nTHOS. O. DAVIS.\n\nR. IC. WIGMORE & CO.\n\nMen's and Boys' Underclothing.\n\nMen's Cardigan Jackets.\n\nMen's Pea Jackets.\n\n1,000 Remnants of Carpets, cheap.\n\nA Full Line of Dress Goods.\n\nChoice Selection of Ladies' Hosiery.\n\nMen's Overshoes at cost for cash.\n\nMitts and Moccasins.\n\nA Paying Investment. Examine Our Stock.\n\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery.\n\nPublic and High School Text Books.\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK.\n\nALL NEED—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nROBERTSON & ROBERTSON.\n\nMerchant Tailors.\n\nGENTS FURNISHINGS.\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS.\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS.\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nGENERAL NEWS.\n\nOTTAWA, March 29.—The excitement over the Jesuit matter has not yet died out. There is some talk of the Ottawa men holding a mass meeting in the city hall to protest against the government's action. The meeting will be held at 8 o'clock this evening.\n\nThe Montreal Witness to-night has the following: \"An effort is being made to undermine the government by raising a hue and cry against the Militia, how they have been treated at Ottawa, so as to end the whole dispute.\"\n\nThe government has appointed an ad hoc committee to meet the Governor General.\n\nTo-morrow morning Sir Hector Langevin will present a petition to the Governor General, signed by 15,000 citizens, asking him to intervene in the matter.\n\nSir Charles Tupper, who visited the North-west, will examine the condition of the Indians' lands, and report to the government.\n\nThe Ontario Government have sent Detective Murray to Georgetown to arrest several young men who are suspected of being involved in the affair.\n\nHenry Gattish, alias Henry Wickham, was arrested at Chicago for forgery and piracy, and was brought to Windsor to-day.\n\nMontreal, March 29.—Five police men, commanded by sub-constable Lapointe, arrested Mr. Morrison, who had been captured on the Morrison, who has been eight months behind the authorities for forgery and piracy.\n\nFather Farrelly states that Father Paradis is still in Rome, and they say he is working hard to gain his appeal from the decision of Rev. Father Angier, Superior of the Fathers, who has ordered him back to Quebec for non-compliance with the Order for non-compliance and unwillingness to work.\n\nMontreal, March 29.—Two employees of the Intercolonial railway, were arrested at day by Constables for attempting to steal the property of the company. The constables stated that the employees had been working on the property, and were arrested for their actions.\n\nThe Court of Appeal to-day decided that it was no offence to call a person an informer, and upon the judgment of the court, the prisoner was discharged.\n\nLast night three men entered Lebel's house, gagged and bound the proprietor, and stole $300 in cash, two notes and some other property.\n\nIt is understood that John A. Macdonald, the Prime Minister, has been placed in jail for six months for his part in the affair.\n\nJohn A. Fitch, a Missouri tailor, stabbed himself with a pair of scissors.\n\nIt is proposed to confer the freedom of Edinburgh on Mr. Farrelly.\n\nThe New York Legislature has refused to grant a holiday for Saturday.\n\nThe Irish leaders in the Canadian Parliament have met in a secret session and mapped out a plan of campaign, to be put into execution when the opportunity arises.\n\nThe Queen, Victoria, expressed regret that owing to the bad condition of the roads she was unable to visit the scene of the battle between the British soldiers who fell in Waterloo's successful siege of the fortress of 1815.\n\nThe American ship Ranger left San Francisco on Wednesday for Sydney, carrying 7,000 tons of wheat. This is the first large shipment which will be made to the colony this year to supply the demands caused by the partial failure of the Australian crops.\n\nA Dead Drop!\n\nPRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nFar surpassing any previous seasons, both for richness of design and quality. The variety of new goods in every department is immense.\n\nCall and Examine Our Stock\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan, Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nENTERTAINMENT\n\nAt Nickel Academy.\n\nThe entertainment at the old Academy on Tuesday evening April 10th was one of the best ever given to Prince Albert audiences, and reflects the greatest credit on all connected therewith. The programme opened the evening with a song entitled \"Strawberry,\" which he rendered in a splendid manner by Miss Johnson. This was followed, and it is needless to say that footlight favorites, like these two performers, are brought forth rounds of applause. Mr. Thomas then appeared, singing that fine old Scotch song \"The Rowan Tree,\" which was encoreed as nearly as possible. Mr. Thomas came to the front and responded to the call of the audience with \"Bonnie Dundee.\" Mr. Percy Condon's \"Aunt\" was next in order, who was finely rendered. Mr. Thomas followed singing the \"Light house.\" Later Mr. Thomas appeared pleased that all employees of the N.W.M. Police and Indian Department will be served free meals and there is no deduction from $300 is taken up in fines, and carry out all conditions of building the ferry as laid down by council.\n\nThe following by has received a third reading and were ordered to be expressed to the members of the council, and the deal within the municipality of the town to levy and collect a poll tax, to prevent fires and accidents for the benefit of the town. By law, the fire department is obliged to prevent fires and accidents for the benefit of the town. By law, the fire department is obliged to prevent fires and accidents for the benefit of the town.\n\nSASKATCHEWAN INSTITUTE.\n\nThe regular fortnightly meeting of the institute was held last Friday night. A large number of members attended, and the proceedings were very interesting. A dinner was served after the meeting, and the institute closed its session.\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held on Monday evening last. His Worship Mayor Knowles presided. Present—Cons. Donaldson, Davis, Condon, fellow, Macdonald, and Knowles.\n\nCOMMISSIONS.\n\nA commission was received from Nicholas J. McKeown, for damage to his property, the amount of which he would not undertake, as then everyone who ran off the road on a dark night must get a rigging. Mr. Knowles said that Pringle's was perfect. To follow the play all through and comment on the acting individually would take too long, but he thought Mr. Pringle was very good. Mr. Davis said that the performance was very good, and Mr. Pringle, who played nearly all the scenes, was most splendidly.\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held on Monday evening last. His Worship Mayor Knowles presided. Present—Cons. Donaldson, Davis, Condon, fellow, Macdonald, and Knowles.\n\nCOMMISSIONS.\n\nA commission was received from Nicholas J. McKeown, for damage to his property, the amount of which he would not undertake, as then everyone who ran off the road on a dark night must get a rigging. Mr. Knowles said that Pringle's was perfect. To follow the play all through and comment on the acting individually would take too long, but he thought Mr. Pringle was very good. Mr. Davis said that the performance was very good, and Mr. Pringle, who played nearly all the scenes, was most splendidly.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis powder never varies. A marked improvement over any other. It contains more than the ordinary kinds and cannot be beat for flavor or quality. We have lots of stock, weight, sizes, or packages. Royal Baking Powder Co., 164 Wall St., N.Y.\n\nFOR THE Best Assorted Stock of CONFECTIONERY GO TO H. M'DOUGALL'S BAKERY.\n\nH. M'DOUGALL\n\nBREWERY\n\nPure and Sparkling AMBER—Hop—ALE\n\nDelivered to all Parts of the Town.\n\nCERROND BROS.\n\nA LARGE STOCK OF Watches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO\n\nGet Your SCHOOL SUPPLIES AT CANN'S BOOK STORE. This is No Humbug.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889041201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 6061, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8691, 1], [8691, 16222, 2], [16222, 19888, 3], [19888, 23716, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]