[{"id": "cb86522275bc5c26a9687db2dbbae6916f65ede7", "text": "SUNDAY CHURCH SERVICES\n\nSt. Alban’s and St. Mary’s Church\nServices—St. Elmo’s Church and\nParish Church Services—Rev. Mr.\nPastor, Rev. Canon Philliott.\n\nOld Church—8:30 A.M.—Rev. Canon Phillipott.\nChurch Services—10:30 A.M.—Rev. Canon Phillipott.\n\nRed River Valley:\nWoodland Church—Woodland Hill, Red River Valley, May 22nd.\n\nThis Paper can be had at:\nBusiness House, 13th Street.\n\nWe take pride in announcing that our new facilities enable us to offer the best prices in the country.\n\nTHE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW.\n\nTerms—5¢ per copy or 45¢ per month.\n\nNo adverstisement inserted for less than 1¢.\n\nAll letters to be addressed to:\nJ.D. MAVEETY, Proprietor\n\nEditorial Notes:\n\nWe are now well entered upon the summer.\n\nOur columnists have been working hard and devoting their energy to the cause of justice and peace.\n\nOur legislators are now called to order.\n\nWe urge our readers to vote for the candidates who will bring about the greatest good for our community.\nRECENT PUBLICATIONS:\n\nThe Historical and Scientific Society of Manitoba has sent us the annual report and transactions for 1876-7. From the report we are pleased to see the society is doing excellent work in promoting science and literature.\n\nIn the historical section we have a very readable paper on “The French Element in the Canadian North-West” by Mr. J.B. McArthur.\n\nIn addition to the above papers, we also have an excellent essay on “The Antiquities of the South Country” by Mr. M. B. Bowerman.\n\nWe are pleased to see the society is doing excellent work in promoting science and literature.\n\nTHE WEST END STORE\n\nJust arrived, new goods at:\n\nchas. maire’s west end store,\n\nNun’s Veilings in Cream and Light Shades, Persian Pattern Rugs, Tapestry Carpets, Crimson Ropes, Window Holand in Slate and Yellow, Door Mats, Crumb Cloths, Coated Cloakings, Empress Cloaks, Dark and Garnet, Fine Curcums.\n\nLadies’ Felt and Embroidered Petticoats, Ladies’ Fancy Frillings, Beeze Veiling, Ladies’ Silk Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES\n\nGO TO\nCANN’S BOOKSTORE FOR\nWall Paper and Borders\n\nA.G. PATTERSON,\n\nFORNEY GALLERY.\n\nRAMBLING —\n\nwe spent several days last week rambling through the country and we were more than delighted with our experience.\n\nTHE DIAMOND EARS OF THE SEASONS:\n\nthe season’s change from spring into winter is a wonderful sight, as everything turns from green into white.\n\nIt is noticeable how all living things seem to prepare themselves for hibernation, ceasing activity and preparing for dormancy.\n\nWe advise everyone to keep up their spirits during these trying times, as we believe they are coming to an end.\n\nFor Sale:\n\nSwiss-made machines for sale. For more details please call 123-4567.\n\nNEW ARRIVALS:\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens’ Blue Black Ink.\n\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nSunlight Store:\n\nJust arrived, new goods at:\n\nsunlight store,\n\nNew Rigs and Fresh Horses available for immediate purchase.\n\nAll orders will be handled promptly.\n\nGo to:\n\nHURRAH! FOR THE QUEEN’S JUBILEE!!\n\nTHE VICTORIA\n\nSale and Reed Sale Stables\n\nHave just got in their New Rigs and Fresh Horses.\n\nAnd the public can depend on getting a firstclass turn out at reasonable prices.\n\nA reliable man in attendance day and night.\n\nTelephone—No. 999.\n\nStable—No. 9 River & Nestle St.\n\nNEILSON & McBEATH\nEXAMINATION AND PICNIC.\n\nOn Friday, July 22nd, an examination of the Andrews School was held and as usual the occasion was taken advantage of to organize a picnic for the entertainment of children, friends and visitors. The weather was fine and there was a large assemblage of students and friends from other districts. The examination was conducted in the morning and continued till nearly 2 o'clock in the afternoon without interruption, and with unflagging interest. It was a great satisfaction to see the work done in St. Andrews School, which fully maintains the high reputation acquired by it under the capable direction of Mr. Craig, backed by a Board of Trustees quite alive to the importance of doing something for education and welfare of the parish. It promised three or four seven names on the roll, with about sixty in average attendance. This is a larger number than the national school building present school building was planned, and there is consequently something like crowding in the rooms when the class is present. We were, however, glad to learn from the trustees that having regard to the size of the building of the scholars and teachers they contemplate making a desirable addition to the accommodation. The result of this meeting being self-evident it is unnecessary to be further gone into.\n\nThe proceedings in the school were begun with the youngest or alphabet class and continued up through the other grades to the senior division, which was examined in spelling, history, geography, arithmetic and other branches. It has been truly enough said \"there is no room to improve,\" but there can be no doubtless some roads made direct and some more interesting and enticing than others. Mr. Craig has given us some degree of power to himself and it seems to us the methods he adopts are essentially calculated to attract our attention. We view with pleasure the education of the whole class, while they are by no means representative of the praiseworthy aspirations of all the pupils.\n\nThe class as a whole made a gratifying appearance in each department. There was much attention paid to the work assigned, indicating careful grounding in the various subjects, as was very clearly shown in the answers given to the question of each other, which the pupils conducted on the lessons of the day. There was a most excellent display of pencil skill, and the specimens of work submitted by those who adjudicated on the girls specimens had a little more to decide than the amount. The boys' show also bore the same stamp. The boys' show also bore the same stamp. The boys' show also bore the same stamp.\n\nAfter the examination was concluded Mr. Andrew Spencer, Chairman of Trustees who presided, made a short speech in which he pointed out with great sense the advantages of a thorough education. He impressed upon the children how thankful they ought to be that such educational advantages were within their reach as they had in the parish of St. Andrews. Advantages which, he regretted to say, had not been enjoyed by many of their parents were of school age. He spoke in high terms of those settlers in St. Andrews who had seen fit to have an ordinance passed, had exerted them selves, even when their circumstances were adverse, to provide good education for their children, and he was sure that now when their prospects were improving they would go back from the good work. He had nothing but praise for the teachers as a class were poorly remunerated for their labors, he congratulated the St. Andrews School Board for having in Mr. Gerrold a teacher thoroughly qualified for his work and who took the most personal interest in every child placed under his charge. Capt. Craig was then called upon and made a few remarks to the satisfaction of the visitors. He congratulated all concerned on the marked success of the examination. The work of the school was not falling off and last year there was. There was the same aptitude and intelligence on the part of the pupils, and the same evidences of care and attention to the work assigned. The visitors had been greatly interested and gratified by the day's proceedings. Mr. Craig then addressed the board and the scholars in enthusiastic terms on the generous work of the school. He was much pleased to be able to assure them that for next year Mr. John Stewart of Prince Edward County had offered a silver medal as a prize for the best scholar in the school, and he felt sure it would be an incentive to continue exertion.\n\nMr. Massey also addressed a few sen timental words to the parents and friends and Mr. Gerrold ending wound up with a few words thanking parents and friends for their kindly countenance, this portion of the proceedings was concluded by Mr. Adson, singing a verse of the Queen's Anthem. Then would fall to us to tell of the fun attending the picnic, the dancing, and enjoyment that followed the more serious business of the day. Suffice to say that the day's proceedings was thoroughly enjoyed, and this meeting of 1887 has left most pleasant memories behind.\n\nThe following is a list of the pupils' standings in St. Andrews School on the 22nd July:\n\nFirst Class - Thomas Spencer, 1st; Albert Mark, 2nd.\nSecond Class - First book, Girls: Caroline Adams, 1st; Sarah J. McNab, 2nd. Boys: Alex. Pitcairn, 1st; Edward Mack, 2nd.\nSecond Class - Caroline Cromarty, 1st; Alex. McLeod, 2nd; Charlotte Halcro, 3rd.\nSenior third book - Frederick McLeod, 1st; John Robertson, 2nd; Alfred Bird, 3rd.\nJunior fourth - Mary Cromarty, 1st; Donald McLeod, 2nd; Jeannine Maclean, 3rd.\nHistory - Lindsey Spencer, 1st; Alfred Bird, 2nd; Taylor, 3rd.\nWriting - First book - Louise Spencer, 1st; Jeannine Bird, 2nd; Alfred Spencer, 3rd.\nPenmanship - Louise Taylor, 1st; Jeannine Bird, 2nd; Taylor, 3rd.\n\nCRICKET.\n\nThe third cricket match between the N.W.M. Police and Prince Albert cricket club was played on Saturday the 22nd inst.\n\nMore than common interest was manifested throughout the proceedings. First, that before his departure for the east, Mr. J. F. Beattie notified the members of the police force that he would be the one who made the highest score in either club. Such was the case, each club had a chance to make a good showing, and, therefore, this would be the last of the season.\n\nHeavy rain fell during the afternoon and it was thought that the game was over, but the sun made its appearance and by noon clock the grounds were in splendid condition.\n\nIndividually speaking, the game almost entirely in the hands of the bowlers. Bird was the star performer for the N.W.M. Police, and this athletic prowess for Mr. G. R. Bird, because in addition to his powerful bowling throughout the match, he also scored a century. The day gracefully retired with the final score of 25 which, considering the state of ground at the close of play, was a good effort. The police team had a good score, captured the medal and contributed in a great measure towards winning the match.\n\nThe police team prevailed at the close of the game, but the ball was tipped over midwicket's head for two. The police team was in front by five runs, P.A. team by one run.\n\nAfter the match the Policiers went in for refreshments. Mr. J. Clark and Col. Sproule were guests of the P.C.C. and contributed largely to the comfort of the members of the club. The dinner was served in excellent style the smiling hostess bustling about in a manner which made a happy welcome to the many cricketing friends who came to the goods provided for them. The evening closed with the usual town songs and a dance, when most enjoyable evening closed with the National Anthem. Following is the score:\n\n| Team | Runs | Wickets |\n|------|------|---------|\n| Police | 25 | 4 |\n| P.A. | 20 | 5 |\n\nTotal: 45\n\nESTABLISHED: 1879.\n\nBUY YOUR Cook Stoves, Housefurnishings, Hardware and Tinware FROM J. R. McPHAIL'S.\n\nMachine Oils, American Coal Oil Low Prices. Good Value. Prompt Attention AT J. R. McPhail.\n\nMerchant Tailors AND GENTS FURNISHINGS A LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS In all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\n1879.\n\nBuffalo Hall!\n\nNEW GOODS ARE BEING OPENED EACH WEEK.\n\nAlways on hand Fresh Lines in Dry Goods, Clothing and Groceries.\n\nPrices will be found right and nothing but reliable goods shown.\n\nBUFFALO HALL FOR Dress Goods, Corsets, Hosiery, etc., Ready made Clothing.\n\nBETTS & GWYNNIE.\n\nDress Goods, all shades Irish Diaper Linen, India Linen, Muslins, Nuns' Veiling, Silk Gloves, Cottons, Ginghams, rints, Wincies, Ladies Jerseys Boys' Jersey Suits, Ready-made Clothing.\n\nFROM FOUR YEARS UP—AT R. C. WIGMORE & CO'S.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887072901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 2985, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3409, 2], [3409, 3409, 3], [3409, 12193, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]