[{"id": "2fd48fd16e109ac9f7e8b08f49d52a7fbda0b24a", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MAY 27, 1887.\n\n$2.50 A YEAR\n\nBANKINGHOUSE OF\nMARATHUR & KNOWLES, Prince Albert, N.W.T.\n\nROBT BUCKLEY, Auctioneer,\nAccountant,\n\nAnd General Agent\n\nN. H. COX, Advertising Valle,\n\nQUEEN'S HOTEL.\nLeading Hotel in Saskatchewan.\n\nTHOS. CRAM.\nSUPERINTENDENT.\nBOOTS AND SHOES.\nFootwear in Sizes and Kind for Ladies' Gents and Children's Wear.\n\nSPECIALTY.\nGum Rubber and German Felt Stockings, Suitable for Travelers and Landmen.\n\nCHEAP FOR CASH.\n\nSTRAVED!\nThe following persons were reported missing:\n\nMRS. JAS. A. FRASER'S CITY CONFECTIONERY.\n\nPUBLIC NOTICE.\nBy the Trustees of St. Andrew's Protest Public School District No. 46, they give notice that the Trustees of said district have unanimously resolved to accept the offer of Mr. R. T. Goodfellow, of 327 Main Street, Prince Albert, to donate a piece of land valued at $500.00 for the purpose of providing seating accommodation for the school, on the condition that the same shall be built by Mr. Goodfellow within two months from today.\n\nWINNIPEG, May 22.\nThere was a very small attendance at the meeting of the House of Commons today. After routine matters were disposed of, the distribution of a new province was proposed in the shape of a clause to lower duties on the iron manufacturers. Several alterations relating to drygoods were discussed. Mr. Nelson introduced a motion to give free trade to the Government to deal with it, but his brother has not yet stated how the bills may be altered.\n\nThe Other Representative at Ottawa is just now doing some very important work.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\n\nThe citizens of McGill have passed a resolution in favour of the dissatisfaction felt by Mr. Did not have Toronto for Ottawa this morning as intended, owing to a servant who had not been paid for her services, and when she went out, leaving him then do all the work herself, which she did, and thereby cheaping himself and others in the neighborhood; the result may be a great deal worse than he anticipated.\nEDITIONAL NOTES\n\nAccording to the Northeast Statement, Sir James Pirie stated that Sir James Edmonton will be unable to prevent the proposed increase in the rate of taxation.\n\nThe BUDGET-INCOME.\n\nPoveshell and Poveshell are oilier and uaderstanding attractive, but they have an especial charm when, on balancing up your bank account, you find that your cheapest good for ten years has become a favorite dish. Disallowed in form! What we want is production and encouragement to capitalists, and fewer charters granted to pious railway companies.\n\nThe fears expressed by some that the continuance of the policy of disallowance will prevent铁路的conservation to the Northwest originate more from political chicanery than anything else. Every inch of new territory has been used up in the disallowance in form! What we want is production and encouragement to capitalists, and fewer charters granted to pious railway companies.\n\nThe importance of overseas generally are in every case bringing our efforts as near as practicable to a level with that of the United States. Mr. Mike Fearnley, the National Policy Secretary, cannot object to this, and as remarked by Sir Charles Tupper, \"capitalists would not come with large Canadian enterprises without fear of any disturbance by a change of administration.\"\n\nSir James McCallum (Liberal) \"too often supports his views abroad in the North-West Liberals say to this, he does not find himself favored in the Old Country; but neither did the first installment of the National Policy. If we are to continue the policy of our neighbors until the British government gave its consent to the taxing of British warships by the Canadian Parliament,\" we should agree with Sir James Macdonald.\n\nSPEAKING OF Sir Charles Tupper's budget speech the Globe of May 18th says: \"There was a general feeling that Sir Charles Tupper, this afternoon, was able and, in some respects, admirable performer. There was a generous spirit for legitimate national conclusions and an absence of partisan demarcation which put the whole subject justly into the hands of the House, and lifted the discussion above the mean level of party warfare. And yet the whole speech was full of craft, alive with words and framed at every point to put the Government's case in the strongest light possible.\"\n\nThere was a manifest failure of conviction in the policies which the House had reason to expect. There was no attempt to deal with the manifold difficulties which it must have known will warrant. There was a manifestation of supreme concern for the interests of Canada but utterly regardless, and do not regard at the best evidence of devotion to Canada. Those few defects which were apparent in the deliverer of the model of discovery, and a very complete presentation of a case to the merits of whom there will be none but justice. But however highly thought of that minister can be no serious question.\" Mr. Macdonald, who refused to treat with a single member of the official opposition, spoke at great length upon the advantages for the interests of the Empire seeing that Canada is a part of it. Even this, however, would have been enough to have at heart the best interests of the Empire. Many, again, be disposed to deny the self-reliance which pervaded the late budget speeches, Sir Charles Tupper's speech was characterized by a general regard for legitimate mathematical conclusions, and a very complete presentation of a case to the merits of whom there will be none but justice.\n\nMr. Brown, another colonial of the same stamp and speaking of the same subject, with all allowances made for him, said there could be no member of the Liberal party suffer.\"\n\nIn reply to the question as to what the Government's policy was to do to allow malcontents to have their play, Mr. Macdonald replied as follows: - \"The policy of the Government has not been changed. Our policy is the same as that before the election. We have made an agreement with the C. P. R. Company, and we are bound in honor, to every Canadian, to observe such agreement. Some will say that in certain provinces, where there is a large surplus, we should take such lands in the same way that it does in regard to the Northwest. The principal portion of the contract has been entered into in the Northwest. It was designed to ensure the export trade. Now, we have agreed to some terms, but nothing has been done so far as the terms made with the individual companies, as far as the terms between the individuals and the Company.\n\nLORD LANSDOWNE has returned Salisbury offer of British Embassy at Paris.\n\nStatement of D. H. Macdowall's Election Expenses\n\n| Payments Made:                      | Amount   |\n|------------------------------------|----------|\n| For horse hire and stable keep     | $635 38  |\n| Interpreter                         | 5 00     |\n| Telegraphing                        | 82 78    |\n|                                        | $695 38 |\n\nExpected Payments:\n\n| Item                          | Amount   |\n|-------------------------------|----------|\n| Printing                      | $835 50  |\n| Meeting rooms                 | 8 00     |\n| Telegraphing                  | 12 15    |\n| Traveling expenses            | 250 50   |\n|                                        | $1,000 85 |\n\nI certify to the above statement.\n\nJ. F. BETTS\nAgent\n\nThe Prince Albert Times and Saskatchewan Review, Published by J. D. MAVEETY at Prince Albert N.W.T.\n\nTerms — 3¢ per annum in advance. Single copies, 1½ cents each.\n\nNo advertisements inserted in this paper, unless specially authorized.\n\nNo advertisements inserted in this paper, will be permitted.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVEETY, Proprietor.\n\nSunday Church Services\n\nSt. Andrew's — 10 a.m., Rev. Canon Procter.\n\nSt. John's — 10 a.m., Rev. Canon Pietz.\n\nSt. Mary's — 12 noon, Rev. Canon Procter.\n\nMethodist Church — Deep Deer Road and Hamilton Street, Rev. Wm. King.\n\nChurch of England — Near the old Town Hall, Rev. Canon Procter.\n\nSaturday Evening Social — At 8 o'clock, Rev. Canon Procter.\n\nT. N. Campbell.\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black Ink,\n\nALl SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nCaledonia Brewery East End.\n\nDartmouth Ropework Co., Halifax, Nova Scotia.\n\nThe proprietors of the above company are pleased to announce the opening of their new premises, First Ballots, $1 00 per dozen, Quarter Bottles, $4 00 per case.\n\nIn any sized casks delivered to all parts of town.\n\nA Billiard Table and Saloon in connection with the Brewery.\n\nThe finest Cigars always on hand.\n\nLivery & Feed Stable.\n\nChas. Woodman Proprietor.\n\nG. D. Northgraves Watchmaker and Jeweller,\n\nAt T. N. Campbell's New Stand.\n\nA LARGE STOCK OF Watches, Clocks and Jewellery\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Rowell & Co., Newsmarket Advertising Bureau, 10 Spruce Street, New York.\n\nSend 10c for pamphlet.\nFRIDAY, MAY 27, 1887.\n\nRUSE & DAVIS\nWHOLESALE & RETAIL\nButchers.\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham, and\n\nGAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station,\nFort Qu'Appelle, and\nPrince Albert.\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETTY.\nPublisher and Proprietor.\n\nMINTOSH & GERTON\nSEASON 1887\n\nPOSCHERON\n\nA Black French Canadian will stand four days in each week.\n\nTuesdays, Wednesdays, Thursdays and Fridays.\n\nTHOS. SCOTT'S STABLES,\nAt the Ridge.\nSeason commences April 27th and ends July 26th.\n\nHorses Pastured FREE of Charge.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nQUEEN'S BIRTHDAY.\n\nThe 24th of May passed off very quietly in the Royal City, the only excitement being centred in a cricket match between two teams composed of Honorary Police and members of the Prince Albert Club. The day was all that could be desired except that it was considered just a little dry. Two outdoor picnics were held in the country, one in the hollow flat and the other at Red Deer Hill, at which both young and old were present. It must not be inferred, however, from the composition of the parties that there was celebrated that the people of this town and surrounding country are any less enthusiastic about the Queen in the broad Dominion, the true reason of the apparent lack of enthusiasm being that the citizens have been loyalists until the end of July, when the Queen's Jubilee and Dominion Day will be celebrated in a variety of ways by such independent spirits as the citizens of Great Britain and the Dominion of Canada. Thus there will be no lack of the usual spirit which will make up for the shortcomings of the weather. With obstinacy they tread River street and draw their wind and sunshine without reservation. But we will not give the programme that day later on.\n\nEarly in the morning of the 24th flags were flapping to the breeze from the various flagstaffs in the town, as also the flagstaffs on the two sides of the grounds immediately east of the Mission schoolhouse. Tents were also erected on the grounds near the club. Sharp at ten o'clock the cricket match commenced. The Folk Club took the field to go to the wickets, retiring with a score of 77. The batting on the part of Mr. Macdonald, Sheppard, Parker and Sheppard was excellent, and the bowling of Mr. Red was very destructive, he having taken six wickets in eleven overs. The Folk Club then came out to take the wickets retiring with a score of 84. To this score Hannan contributed 27, Mr. Wilson 15, Mr. Macdonald 13, Sheppard 12, and Sheppard 10. The bowling on the part of the police was not as good as that of their opponents, though. Hannan and Wilson were dismissed in six overs with a score of 30. At the conclusion of the first innings the clubs adjourned to the Prince Albert Hotel. After lunch the play was resumed, but whether from the fact that partook of too much refreshment or from the fact that the second part of the game was nearly so well contested as the first, the Folk Club again took the field retiring with a score of 63, to which Mr. Hannan and Sheppard contributed 10 and 13 respectively. In the innings of Folk Club a score of 21 and Parker three wickets in four overs, to a score of 77. Taken the new total stands Folk Club 84, Hannan 81, the latter having to none 40 to win, which they accomplished with greater ease than the other party. Hannan's score was 35, the largest score of the day; D. Peterson 4, and Mr. C. Baker 9, not much, though the latter had some wickets to spare. Altogether the playing was very creditable to both clubs, and the spectators showed that they had to practice. The game was witnessed by a number of ladies and gentlemen in every part of the grounds. The ladies had given the usual cheer for one another, and they adjourned to the residence of Mr. Wilson, where during the day they—they were treated to the best that gentleman had at his disposal.\n\nFollowing is the score:\n\n| Innings | Score |\n|---------|-------|\n| 1st Innings | 77 |\n| 2nd Innings | 84 |\n| Total | 161 |\n\n| Innings | Score |\n|---------|-------|\n| 1st Innings | 81 |\n| 2nd Innings | 63 |\n| Total | 144 |\n\nLOCAL NEWS.\n\nRev. Mother Austin of St. Anne's Convent, died at six o'clock on Thursday evening. The deceased lady was one of the oldest members of the Order of Prince Albert, and was highly educated and much esteemed. The funeral service will be conducted by Rev. Father O'Connell at the church at 10 A.M. A public funeral service will take place in St. Anne's Church on Tuesday, May 7th of this week. We shall give a sketch of this next week.\n\nA large number of Metis came to town for the grain from the South Branch during the last few days. It appears that the reason they did not apply for the land grant was because they thought they had been led to believe that if they gave them on their farms and the crops would grow, they would be able to get other lands from them. Sept. Perry learning this immediately wired Mr. Macdonald, who wired back that he thought it was that the Government would not deal fairlyly with them, but that the time was not ripe for such action. They must wait until such time as they were able to do so. This being satisfactory, the Metis immediately wired Mr. Macdonald that they secured the seed they required.\n\nThe many friends of Mr. George Dack, late Dominion Land Agent at this place, will be interested to hear that his death took place in the Winnipeg Hospital on the afternoon of the 11th inst. Mr. Dack had been ill for several weeks since 1873, and was widely known and respected of. He was first in the employ of the Hudson Bay Company, and before that in the Dominion Lands office. He was a member of the Scrip Commission last year, and died in the hospital ward of this year also. The cause of his death was a cold contracted while on a visit to his home in England. It was believed that he was forced to return to Winnipeg and proceed to the hospital, where, although he appeared to be recovering, he died in the course of an hour. His remains have been sent to his old home, where he will be buried, for interment.\n\nTen dollars was bought by all wool Canadian tweed suit at Walters & Rennie.\n\n\"He House\" (a) in a familiar way the Bulletin has of referring to the Local Governor, meaning thereby that the Governor is not an honest man. The Local Governor states that the reason of the Edmonton scrip commission's delay in making payments was the fact that the latter had refused to issue a permit. Seeing that Frank Wilson was doing something or encouraging others to do so, we are afraid the Governor wrote in mistake. The reason remains the same, that His Honour was prevented from the fact that the former first went to Edmonton as member of the commission, and was appointed, annihilating His Honor and the appointed members, he found that he had mistaken his mission, and that instead of annihilating the Governor and approved members he was only a member of a committee. Mr. Wilson, the division of the Edmonton District was two by his Honor's order. Mr. Wilson was elected and he was defeated at the last election by Dr. Wilson.\n\nEDMONTON\n\nFrom the Bulletin, April 30.\n\nSome Indians left for Battleford on Friday.\n\nWork will be commenced shortly on the completion of the Calgary trail, extending at Edmonton to the North West Government account. Fraser & Co. has the contract for the construction of the road, which is to be eight feet wide, twenty feet long, and a half high, on the H. R. reserve, for Dr. McKay, chief trader for the H. R. Reserve, and Mr. Wilson, Mrs. McKay will come to reside in Edmonton. For the purpose of purchasing goods for the reserve, Mr. Wilson will take a route via Lake Athabasca, taking an outfit of goods purchased from Norris & Carey, Edmonton. Mr. Wilson will travel the river country from Qu'Appelle, in British Columbia, and is sending a large outfit of goods to the reserve. Mr. Wilson will take an experimental trip by way of Edmonton this fall, when, if he finds this route preferable, as it no doubt is, he will adopt it in future.\n\nJ. Kelly has 3,000 saw logs out for cutting this summer.\n\nW. S. Robson has been appointed deputy sheriff and A. Taylor deputy clerk of the court.\n\nDress Goods, all shades Irish Diaper Linen, India Linen, Muslins, Nuns' Veiling, Silk Gloves, Cottons, Ginghams, Prints, Wincies, Ladies Jerseys Boys' Jersey Suits, Ready-made Clothing,\n\nFROM FOUR YEARS UP—AT\n\nR. C. WIGMORE & CO.'S.\n\nBuffalo Hall!\n\nNEW SPRING GOODS\n\nWILL ARRIVE NEXT WEEK.\n\nALL GOODS NOW IN STOCK REDUCED.\n\nClearing Sale will continue until New Goods ARE OPENED\n\nBETTS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware,\nHouse Furnishing hardware,\nCarpenters' Tools,\nPaints and Oils,\nBarbed Fencing Wire,\nStoves and Tinware.\n\nALSO A FRESH STOCK OF\n\nGroceries, Teas, Tobaccos, Etc.\n\nCALL AND GET PRICES.\n\nJ. R. McPhail.\n\nTHE WEST END STORE\n\nJUST ARRIVED.\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNuns' Veiling in Cream and Light Shades, Persian Patent Roses, Tapestry Carpets, Crimson Rajput Window Hoods in Sage and Yellow, Door Matts, Crumb Cloths, Silk Corded Cushions, Empress Cloth in Black and Garnet, etc., etc.\n\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Pillows, Beecroft Veiling, Ladies Silk Ties, Trussets, etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Finest Goods of all kinds. Inspection is solicited.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887052701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5067, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4068, 1], [4068, 11116, 2], [11116, 12250, 3], [12250, 21100, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]