[{"id": "7aaea0bd495b2efb7f2275ed215ff11a50bdf7be", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 5, 1884.\n$2.50 A YEAR.\n\nBANKING HOUSE\n\n\"Macarthur Know-east\"\nPrince Albert N.W.T.\nTransact a General Banking Business.\nImplements available at all points in the\ncollections undertaken and promptly set\napart for BANOF's Mechanical Bank of Canada\nALEAN & KOLBE.\n\nPRINCE ALBERT,\n\nAgricultural Society.\nNotice—A meeting of the directors of the\nAgricultural Society will take place at\nthe WEST END HOTEL,\nPrince Albert, on\nTuesday, the 13th inst.,\nImmediately after\nCHAN ADAMS, Sec-Treas.\n\nNotice to Creditors.\n\nThe creditors of George McKay late of Prince Albert, infamous trader, deceased, who died on or about the 15th day of August, A.D. 1877, are respectfully informed that his residuary estate has been ordered to be distributed among his creditors as follows:\n\nCOLONEL J. D. BLAYLOCK, Proprietor\nof the FENCE LANE, near Prince Albert.\n\nDrill Hall,\nAt MANITOBA.\n\nGovernment House, Ottawa.\nSeptember 5, 1884.\nHENRY RUTTLE\n\nDrill Hall,\nAt MANITOBA.\n\nGovernment House, Ottawa.\nSeptember 5, 1884.\nHENRY RUTTLE\n\nNotice to Contractors.\n\nMr. John Meece, Engineer,\nDepartment of Public Works,\nRegina, Saskatchewan.\nContract No. 19.\n\nNotice to all contractors engaged in the construction of the public works department of the government of Saskatchewan, that the plans for the same have been completed and are now ready for distribution.\nThose who desire to contract for any portion of the work may do so by submitting their proposals to Mr. John Meece, Engineer, Department of Public Works, Regina, Saskatchewan.\nThe bids must be submitted not later than September 15, 1884, at the Department of Public Works Office, Regina, Saskatchewan.\nThe bids will be opened publicly on September 16, 1884.\nAny further information desired may be obtained from Mr. John Meece, Engineer, Department of Public Works, Regina, Saskatchewan.\n\nDeliveries, Watches, Clocks, &c., New.\nJoseph Rogers & Sons' Laundry, Gas Stove Works, &c., Regina, Saskatchewan.\nWatches, Claws, &c.\nJ. H. S. Abell, Regina, Saskatchewan.\n\nPayment of Pines or Penalties Under Criminal Laws of Canada in North-West Territories and District of Keewatin.\n\nGovernment House, Ottawa.\nNovember 1, 1884.\nHENRY RUTTLE\n\nCommunications.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nMr. Mitchell, of the County Court, has been appointed to the bench of the County Court at North-West.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSir J. T. Davis, chairman of the Agricultural Association, has been elected president of the Agricultural Society of Prince Albert.\n\nMr. Mitchell, County Judge, has been appointed to the bench of the County Court at North West.\n\nMr. Thomas, of the telegraph office, has been appointed judge of the North-West Territorial Court.\nONE OF THE ORDINANCES\n\nWe had intended to reserve criticism of the ordinances passed in the recent session of the North West Council until furnished with an official copy of them in detail; however, as notice has been already taken by the press of such a measure, we feel compelled to state that we regard it as a most unfortunate step, and we think it will be seen to be so when the details are made known.\n\nThe ordinance provides that all persons who have incurred debts within the Territories during the last six months shall be liable to arrest and imprisonment for non-payment thereof. This provision is intended to prevent the escape of debtors from the jurisdiction of the courts, and to compel them to pay their debts.\n\nWe believe that this ordinance is unnecessary and undesirable, and we hope that it will be repealed at the next session of the Council.\n\nFREEMASONRY\n\nClergymen are but human, but how often do they fail to see the true nature of Freemasonry? They are too often swayed by the opinions of others, and fail to see the true nature of Freemasonry.\n\nFreemasonry is not a secret society, but a system of moral instruction. It teaches the principles of morality, charity, and benevolence. It is open to all men of good character, and it is not necessary to be a member of any other organization to be a Freemason.\n\nWe believe that Freemasonry is a valuable institution, and we hope that it will continue to exist for many years to come.\n\nTHE WEST END HOUSE\n\nOffice and Workshop\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nOrders left at J. L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert\n\nMoffatt & Caldwell Bankers\n\nMoffatt & Caldwell Bankers\n\nMain Street, Winnipeg, Man.\n\nDeposits to be made at the Bank of Montreal.\n\nStocks and Debentures bought and sold.\n\nLoans made and collected.\n\nCollections made and sent by mail.\n\nBought and Sold on Commission.\n\nTHE WEEK\n\nPublishers\n\nCharles H. D. Roberts\n\nPublishers\n\nEvery Thursday, at 12 p.m.\n\nThe WEEK is a weekly newspaper containing news and information about the latest developments in the world of politics, business, and entertainment.\n\nAll parties indebted to us are requested to call and settle by note or otherwise, failing which we will be obliged to place same in the hands of our Attorney for collection. We are receiving no favors, and therefore none need be expected from us by parties whose accounts are long overdue.\nNORTH WEST COUNCIL.\n\nList of the Ordinances Passed During the Last Session.\n\nNo. 1. An Ordinance respecting the Hiring of an Auditorium, July 18th, 1883.\n\nNo. 2. An Ordinance to amend and consolidate as amended the Regulation of Titles Ordinance of 1879 and the Ordinance amending it—Richardson Hamilton.\n\nNo. 3. An Ordinance to amend and consolidate as amended the Ordinance respecting the Administration of the Laws in the North West Territories—Richardson Hamilton.\n\nNo. 4. An Ordinance repealing Municipal Jackson Hamilton.\n\nNo. 5. An Ordinance providing for the organization of Schools in the North West Territories—Richardson Hamilton.\n\nNo. 6. An Ordinance to amend and consolidate the Ordinance relating to Elections and all others—Richardson Hamilton.\n\nNo. 7. An Ordinance respecting the proposed elections—Richardson Hamilton.\n\nNo. 8. An Ordinance to regulate the sale of distress for rent and other Judicial sales—Richardson Hamilton.\n\nNo. 9. An Ordinance concerning the sale of land by auction—Richardson Hamilton.\n\nNo. 10. An Ordinance to declare the sale of real property held by two or more persons—Richardson Hamilton.\n\nNo. 11. An Ordinance concerning the planting of forest trees—Richardson Hamilton.\n\nNo. 12. An Ordinance respecting compensation to the families of persons killed by accident—Richardson Hamilton.\n\nNo. 13. An Ordinance to amend the Ordinance No. 12 of 1883 entitled \"An Ordinance respecting Auctioneers, Bankers and Dealers—Richardson Hamilton.\n\nNo. 14. An Ordinance to amend and consolidate as amended the Ordinance respecting the Marking of stock—Richardson Hamilton.\n\nNo. 15. An Ordinance to amend the Ordinance No. 5 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 16. An Ordinance for the protection of sheep and other animals—Richardson Hamilton.\n\nNo. 17. An Ordinance to amend the Ordinance No. 5 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 18. An Ordinance to amend the Ordinance No. 16 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 19. An Ordinance to amend the Ordinance No. 16 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 20. An Ordinance to amend and consolidate as amended Ordinance No. 7 of 1879, providing for the administration of Justice—Richardson Hamilton.\n\nNo. 21. An Ordinance to amend and consolidate as amended the Ordinance regarding the licensing of Hotels, Billiard and other places for the promotion of gambling—Richardson Hamilton.\n\nNo. 22. An Ordinance to amend and consolidate the Ordinance relating to the North West Territories to prevent further violations—Richardson Hamilton.\n\nNo. 23. An Ordinance to amend the Ordinance No. 16 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 24. An Ordinance to amend the Ordinance relating to the duties of the Judges of the Peace in cases of appeals—Richardson Hamilton.\n\nNo. 25. An Ordinance respecting Prostitution—Richardson Hamilton.\n\nNo. 26. An Ordinance respecting Prostitution—Richardson Hamilton.\n\nNo. 27. An Ordinance respecting Prostitution—Richardson Hamilton.\n\nNo. 28. An Ordinance to amend the Ordinance No. 16 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 29. An Ordinance to amend and consolidate the Ordinance relating to the sale of intoxicants—Richardson Hamilton.\n\nNo. 30. An Ordinance respecting Prostitution—Richardson Hamilton.\n\nNo. 31. An Ordinance respecting Prostitution—Richardson Hamilton.\n\nNo. 32. An Ordinance to amend the Ordinance No. 16 of 1879, respecting Infectious diseases of domestic animals—Richardson Hamilton.\n\nNo. 33. An Ordinance to amend the Ordinance No. 8 of 1883, respecting the protection of games—Richardson Hamilton.\n\nNo. 34. An Ordinance respecting Improving Roads and Building House Roofs—Richardson Hamilton.\n\nNo. 35. An Ordinance respecting the keeping of horses, cattle and other animals—Richardson Hamilton.\n\nNo. 36. An Ordinance to amend the Ordinance No. 9 of 1883, entitled \"An Ordinance to regulate the disposal of town and village houses.\"\n\nBISHOP MCLEAN.\n\nHis Lordship promised his first sermon since he returned from Great Britain at a general assembly in St. Mary's Church, on Wednesday last. His message brought in addressing the congregation and the church was filled with people who came to hear him speak. He spoke about the importance of prayer and how we should pray for our country and its leaders. He also spoke about the importance of education and how it can help us grow as individuals.\n\nNEW GOODS!\n\nAT\n\nMEDICAL HALL.\n\nBurdock Blood Bitters,\nBurdock Heating Ointment,\nBurdock Pills,\nVictoria Hypophosphites,\nVictor's Buchu and Uva Ursi,\nFreeman's Worm Powders.\n\nT. E. JACKSON,\nAT THE OLD STAND.\n\nSHANNON & MCLEOD\n\nHosiery, Gloves and Dress Linings,\nReady-made Clothing and Table Oil Cloths,\nEvaporated Peaches, Evaporated Apples,\nPrime Tomatoes, Choice Oat Meal,\nAnd Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Benanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nDEALERS IN ALL KINDS OF\nBoots & Shoes,\nRubbers, Etc.\n\nCUSTOMERS WANTED.\n\nBUY YOUR HARVEST TOOLS\nAT\nJ. L. JOHNSON & CO.\nA FULL STOCK OF\nHay, Manure, and Barley Forks, Scythes, Snaths, and Grain Cradles.\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookse e and Stationer\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884090501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3326, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5003, 1], [5003, 7452, 2], [7452, 13146, 3], [13146, 13146, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]