[{"id": "677b637f0f50e59c0fa26d9411661949aa3d4a58", "text": "The Prince Albert Times\nand\nSaskatchewan Review,\npublished by\nJ. D. MAVEETY\n\nPRINCE ALBERT, N. W. T.\nMay 3, 1889.\n\nSUNDAY CHURCH SERVICES\n\nST. MATTHEW'S EPISCOPAL CHURCH\nST. PAUL'S METHODIST CHURCH\nST. ANDREW'S PRESBYTERIAN CHURCH\nST. JAMES' METHODIST CHURCH\nST. JOHN'S METHODIST CHURCH\nST. ANNE'S ROMAN CATHOLIC CHURCH\n\nTHIS PAPER IS SENT TO SUBSCRIBERS FREE OF CHARGE.\n\nRAILWAY NEWS\n\nMay 1, 1889.\n\nWinnipeg, May 1.—The publication in this morning's paper of a dispatch from Dr. Dewdney announcing that Governor D'Arcy McGee had been invited to hold meetings, quite a sensation here. It was known that Dr. McGee was coming to visit us, but this district he showed no inclination to resume his agitating tactics. There may yet be some hope that the long delay in this season of the year will not do away with the railway promised them by the Dominion Government. Your correspondent has just received a letter from a Prince Albert merchant, who is in the city purchasing supplies, who says that the people of this district are still holding their rifles again it too late. They claim that the Dominion Government have broken faith with them on the railway question. Strong resolutions were sent to Ottawa last year and promises made in writing by Sir John Macdonald, Mr. Pope, Mr. Borden, Mr. Macdonald, Mr. Dewdney, Minister of the Interior, that a railway would reach them this year, while the same promises to Ottawa stated that no grant would be given to any North-West roads during the present session. The following extracts from the meetings held today by the Winnipeg city paper to-day may: \"It was just such a meeting as all who look upon the day with interest in the Saskatchewan relations in 1885. Rest is dead, but the boiler and other Dominion roads, let the Government see to it that they be renewed now. The Ottawa authorities have been very slow in doing what they knew it to be imperative. We want no more rebellions in the North-West. The people oppose the Winnipeg bill and hold an eloquent meeting to-day, protest against the ignored neglect which alone could make another possible.\"\n\nWhat Prince Albert merchants was in Winnipeg on the 15th April? That gentleman should have some regard for the truth and not make statements like the above, which we know he could not have been false and which must necessarily cause great deal of harm to this district, and could not under any circumstances do any good. The people on the Saskatchewan are not ready to pick up their guns again; they are governed where they think fit, and the delay in granting railway facilities, but they will think twice before a resort to violent measures is used to try and get redress. There are a few individuals here, doubtless, like the Prince Albert merchant referred to, who would be pleased to see a result, and who would willingly assist and stir up others thought they could induce the half-broads to join in as they did in '85. But if they once got the rebellion started they would be obliged to keep it going, and thus involve the innocent and misguided ones to do the fighting and suffer the consequences, while those themselves would take a back seat and save their coward souls from a shameful death. This is the situation that H. A. Dewdney, as Minister of the Interior, made a written promise to our legislature last year that we should have a railway this fall. Mr. Dewdney has been here several times, and Mr. Pope, Mr. Macdonald, Mr. Macdonald, Mr. Pope, Mr. Macdonald, Mr. Macdonald, Mr. Dewdney, Minister of the Interior, that a railway would reach them this year, while the same promises to Ottawa stated that no grant would be given to any North-West roads during the present session. The following extracts from the meetings held today by the Winnipeg city paper to-day may: \"It was just such a meeting as all who look upon the day with interest in the Saskatchewan relations in 1885. Rest is dead, but the boiler and other Dominion roads, let the Government see to it that they be renewed now. The Ottawa authorities have been very slow in doing what they knew it to be imperative. We want no more rebellions in the North-West. The people oppose the Winnipeg bill and hold an eloquent meeting to-day, protest against the ignored neglect which alone could make another possible.\"\n\nWhat Prince Albert merchants was in Winnipeg on the 15th April? That gentleman should have some regard for the truth and not make statements like the above, which we know he could not have been false and which must necessarily cause great deal of harm to this district, and could not under any circumstances do any good. The people on the Saskatchewan are not ready to pick up their guns again; they are governed where they think fit, and the delay in granting railway facilities, but they will think twice before a resort to violent measures is used to try and get redress. There are a few individuals here, doubtless, like the Prince Albert merchant referred to, who would be pleased to see a result, and who would willingly assist and stir up others thought they could induce the half-broads to join in as they did in '85. But if they once got the rebellion started they would be obliged to keep it going, and thus involve the innocent and misguided ones to do the fighting and suffer the consequences, while those themselves would take a back seat and save their coward souls from a shameful death. This is the situation that H. A. Dewdney, as Minister of the Interior, made a written promise to our legislature last year that we should have a railway this fall. Mr. Dewdney has been here several times, and Mr. Pope, Mr. Macdonald, Mr. Macdonald, Mr. Dewdney, Minister of the Interior, that a railway would reach them this year, while the same promises to Ottawa stated that no grant would be given to any North-West roads during the present session. The following extracts from the meetings held today by the Winnipeg city paper to-day may: \"It was just such a meeting as all who look upon the day with interest in the Saskatchewan relations in 1885. Rest is dead, but the boiler and other Dominion roads, let the Government see to it that they be renewed now. The Ottawa authorities have been very slow in doing what they knew it to be imperative. We want no more rebellions in the North-West. The people oppose the Winnipeg bill and hold an eloquent meeting to-day, protest against the ignored neglect which alone could make another possible.\"\n\nWhat Prince Albert merchants was in Winnipeg on the 15th April? That gentleman should have some regard for the truth and not make statements like the above, which we know he could not have been false and which must necessarily cause great deal of harm to this district, and could not under any circumstances do any good. The people on the Saskatchewan are not ready to pick up their guns again; they are governed where they think fit, and the delay in granting railway facilities, but they will think twice before a resort to violent measures is used to try and get redress. There are a few individuals here, doubtless, like the Prince Albert merchant referred to, who would be pleased to see a result, and who would willingly assist and stir up others thought they could induce the half-broads to join in as they did in '85. But if they once got the rebellion started they would be obliged to keep it going, and thus involve the innocent and misguided ones to do the fighting and suffer the consequences, while those themselves would take a back seat and save their coward souls from a shameful death. This is the situation that H. A. Dewdney, as Minister of the Interior, made a written promise to our legislature last year that we should have a railway this fall. Mr. Dewdney has been here several times, and Mr. Pope, Mr. Macdonald, Mr. Macdonald, Mr. Dewdney, Minister of the Interior, that a railway would reach them this year, while the same promises to Ottawa stated that no grant would be given to any North-West roads during the present session. The following extracts from the meetings held today by the Winnipeg city paper to-day may: \"It was just such a meeting as all who look upon the day with interest in the Saskatchewan relations in 1885. Rest is dead, but the boiler and other Dominion roads, let the Government see to it that they be renewed now. The Ottawa authorities have been very slow in doing what they knew it to be imperative. We want no more rebellions in the North-West. The people oppose the Winnipeg bill and hold an eloquent meeting to-day, protest against the ignored neglect which alone could make another possible.\"\nThe following is the gist of the speech made by Mr. Macdonald in the House of Commons concerning the debate on the liquor question:\n\nMr. Macdonald alluded to the recent discussion in the House of Commons regarding the liquor question. He stated that the government had introduced an amendment to the North-West Act, which would allow the sale of beer in the Northwest. However, he emphasized that the government was not interested in promoting the consumption of alcohol, but rather in ensuring the welfare of the people.\n\nHe went on to say that the government had received petitions from various parts of Canada, including the Northwest, requesting the introduction of the temperance system. He acknowledged that the temperance movement had gained momentum in recent years, and that many Canadians supported the idea of a dry law.\n\nMr. Macdonald also mentioned that the government had received petitions from the Northwest calling for the introduction of the temperance system. He stated that the government would consider these petitions carefully and make a decision based on the best interests of the people.\n\nHe concluded his speech by emphasizing that the government was committed to promoting the welfare of the people and ensuring their safety. He encouraged the members of the House of Commons to support the government's efforts in this regard.\n\n(Continued on Fourth page.)\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889050301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 2263, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8602, 2], [8602, 9986, 3], [9986, 9986, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]