[{"id": "b3248470755317a3c273fbe2d9b9a35fdcc2ed30", "text": "STOP CARD OF THANKS.\n\nWM. SHANNON'S\n\nWINTER GOODS\n\nMatta, Maclean,\n\nOverhauls of all sizes,\n\nHockey and winter-licensing.\n\nGuns of all sizes,\n\nBargains in every department.\n\nR. J. WARDEN,\n\nHunt, Inc.\n\nMORTGAGE SALE\n\nof valuable Town Property.\n\nUnder and by virtue of the power of said mortgagee, the undersigned hereby gives notice to all persons who may be interested herein, that the mortgagee has given notice of sale of the above described property, and that the sale will take place at the office of the mortgagee, at Prince Albert, on the 25th day of March, 1899.\n\nWILLIAM V. MACLISE,\n\nAdvocate, Notary, etc.\n\nPRINCE ALBERT PHARMACY\n\nLabatt's Compound Syrup of Red Rum, Quinine and other medicines, etc., are now on hand. We have also a large assortment of Fancy and Toilet Articles of every description.\n\nCanadian Pain destroyer most extraordinary. It is a powerful stimulant, acts directly on the stomach, and equally as effective for internal complaints as for external use.\n\nP. L. LAFOND\n\nMillinery\n\nNEW Winter Goods\n\nJUST RECEIVED AT\n\nMRS. A. C. STEWART'S\n\nDress & Mantle Basin — a Specialty\n\nAnother Nice Lot of\n\nButtons, Rings,\n\nNeck Buttons, etc.\n\nJUST RECEIVED AT THE\n\nPOST OFFICE JEWELRY STORE\n\nC. R. STOVEL\n\nDENTIST\n\nOffice near the Hudson's Bay Co.'s Branch Store, Tailor's Hall.\n\nJ. LESTOCK REID\n\nDominion Land Surveyor.\n\nPRINCE ALBERT\n\nA. C. PATTERSON\n\nForestering Agent.\n\nAll goods stocked and shipped immediately on arrival. Prices slightly reduced.\n\nROBERT THOMSON\n\nSign and Ornamental Painter.\n\nCustomizing and Paperhanging on Short Notice.\n\nROYAL MAIL STAGE\n\nWeekly\n\nBetween Appaloo Station and Prince Albert.\n\nLeaving Prince Albert every Saturday morning at 10 o'clock.\n\nPassengers accommodated.\n\nLEISER & SCOTT,\n\nRob't Buckley, Auctioneer, Accountant, Estate and General Agent.\n\nTown Lots which will be sold cheap on easy terms.\n\nIMPROVED FARMS\n\nTOWN\n\nQUEEN'S HOTEL\n\nT. GRAM, Proprietor.\n\nLeading Hotel in Saskatchewan.\n\nOpen day and night.\n\nThe bar is equipped with the finest brands of Cognac, Beer, Cider and Blackwood Rum, famous Soft Drinks.\n\nFree attention paid to the visiting public.\n\nTHOS. ORAM\n\nH. MCOLL\n\nTHE BOAT RACE\n\nOwner is Tadoussac the greatest river boat in Canada.\n\nSAN FRANCISCO, March 6.—The following are the particulars of the great steamboat race between San Francisco and Sacramento, which took place yesterday afternoon but for $2,000 a side and the championship of America between the two boats. The race was won by the steamer Tadoussac, which started from the wharf of the Grand Hotel at St. Louis. During the whole race the Tadoussac was ahead of the Sacramento, although she was considerably slower than her opponent. The race was won by the Tadoussac, which averaged about 14 miles an hour, while the Sacramento averaged only 12 miles an hour.\n\nTHE CANADIAN PRESS\n\nThe Canadian Press marks the commencement of the eighteenth year of its existence. This newspaper is now the oldest established journal north of the border, and its influence extends throughout the entire country. It has always been a leader in the field of journalism, and its articles have been read with interest by people of all ages.\n\nTHE BOAT RACE\n\nOwner is Tadoussac the greatest river boat in Canada.\n\nSAN FRANCISCO, March 6.—The following are the particulars of the great steamboat race between San Francisco and Sacramento, which took place yesterday afternoon but for $2,000 a side and the championship of America between the two boats. The race was won by the steamer Tadoussac, which started from the wharf of the Grand Hotel at St. Louis. During the whole race the Tadoussac was ahead of the Sacramento, although she was considerably slower than her opponent. The race was won by the Tadoussac, which averaged about 14 miles an hour, while the Sacramento averaged only 12 miles an hour.\n\nTHE CANADIAN PRESS\n\nThe Canadian Press marks the commencement of the eighteenth year of its existence. This newspaper is now the oldest established journal north of the border, and its influence extends throughout the entire country. It has always been a leader in the field of journalism, and its articles have been read with interest by people of all ages.\nSir John Macdonald is satisfied with the statement that there will be no general election for the Commons until May. Progressive candidates can therefore take it easy.\n\nIt would be interesting to the ratepayers to know whether or not the ratepayers have been approached to audit the civic accounts have been sent to the port to the Council, and it would be further interesting to know what such report is. We do not consider it right that these things should be kept hidden from the taxpayers. The public has a right to know what has been done with their money, and we trust that the required information will be speedily forthcoming.\n\nIt is reported that important changes are to be made during the present session of Parliament in the postal regulations. Drop letters will be charged at the rate of two cents each. The rate on letters for express mail will be three cents as for ordinary, except that the maximum weight allowance will be one ounce instead of half an ounce for a single rate. Registered letters will be charged ten cents instead of two cents.\n\nThe Government have made some important concessions to the North West members in the matter of second homesteads. We are not in possession of all the facts, but learn that second homesteads will be allowed to those settlers who would have been entitled thereto at the time the right to such privilege was abolished. Mr. Macdonald was largely instrumental in obtaining this concession from the Government.\n\nTo those who accuse Mr. Macdonald of all of being nothing but interested and being weak-kneed, we would say that such is not the case. We have every evidence that Mr. Macdonald is one of the hardest working members at Ottawa, and never allows an opportunity to pass by pressing the interests of his constituents into the hands of the Government. We consider the testimony of Mr. Macdonald, who opposed Mr. Macdonald's election, and who had since every opportunity of watching his actions as Ottawa is of influence, worth more than the opinions of a few politicians who mendaciously try to injure our member in the eyes of the public.\n\nCommissioner Herchmer, in his annual report, deals at some length with the liquor question, and complains of the difficulties in enforcing the present law. He suggests that the manufacture and sale of beer be allowed in the provinces under very stringent regulations. We long since advocated the course suggested by the Commissioner, and still believe it is the proper course to be adopted. We hope that the Government will at once act on the advice of the Commissioner in this matter.\n\nThe Dakota half-breeds are raising a hue and cry because they are asked to pay taxes like white people. It does not appear to be any party in the States blaming the authorities for imposing such tax or sympathizing with the half breeds. It would be very different if the trouble arose in our North-West. The Government would then be attacked for tyranny over the oppressed.\n\nOUR LITTLE SON\n\nPoor dear old afflicted with a painful complaint, which has caused him so much pain. We visited him yesterday, and found him in bed, suffering greatly from his complaint, causing us great sorrow. We shall pray for his speedy recovery, and hope that he may soon be able to enjoy the pleasures of life again.\n\nR.C. WIGMORE & CO.\n\nMen's and Boys' Underclothing\nMen's Carriag Jackets\nMen's Pea Jackets\n\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overcoats at cost for cash\nMitts and Moccasins\n\"A Paying Investment,\" examine our stock.\n\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High-School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black Ink,\nALL Sizes—Writing and Copying\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\nGENTS FURNISHINGS\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIn English and American Lines,\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIN ALL GRADES\nRobertson & Robertson.\nGENERAL NEWS.\n\nRev. G. Blund fell in the Methodist church, in Kingston, dislocating his leg and breaking several ribs. He had just returned from amputation of his leg in New York.\n\nThere are divers rumors of a sudden and sensational ending of the proceedings of the Parson Case. It is said that Mr. Rossell will not advise the Parsonists to not offer any testimony, but to rest their case when Pigott and other geographic experts have been called. The case is now adjourned until next week.\n\nDuring the last week of its stay in the United States, the Canadian Press was busy. His work will be chiefly examining bills sent from Congress. Twenty-two bills were examined and the majority of them were fair. The last day of Congress has not fairly begun.\n\nVery cold weather was reported on the 21st of March, with snow falling in New England States. At Nashua, N.H., the mercury registered 36 below zero. In Montgomery, Tennessee, 26 below zero. Cold weather was also reported in Canada.\n\nThe Rev. Dr. Wild, of Toronto, in a sermon lately urged the Quebec Protestant to get an injunction against the Jesuit Estates Bill.\n\nThe question is whether the law of Canada has no power to incorporate the Jesuits, or does the law of Canada have the power to incorporate the Jesuits? He doubted whether, if a man were to shoot a Jesuit in the street, that the British law could punish him. It is the right of the British constitution for a Jesuit to exist in the Dominion. He said that the Jesuits would be able to get the Dominion parliament to pay the $400,000.\n\nA mass meeting of Orangemen is to be held in Toronto on the 5th March for the purpose of petitioning the government to pass the Jesuit Estates Bill.\n\nJames Riddell, of Lachine, while feeling himself sleepy, and was driving them away. He said he had been awake for two hours between his legs and he felt forward the time of the fork penetrating his body. He said about five minutes after he had felt the pricking and pulled out the fork out, when he bled profusely from the mouth and wound. He then walked into the house and died. Mr. Riddell was Cunningham, who has hopes of his recovery although he is very low.\n\nJ. E. Campbell, of Hamilton, committed suicide by shooting himself. He was left about $25,000 a year ago, which he invested in the grocery business about a year ago, that is supposed to have ruined him.\n\nThe announcement that Prince Henry of Hesse-Homburg would probably marry Miss Lotzner, has been delayed owing to the discovery that the couple are already married. The lady is 28 years of age and the prince is 37.\n\nA great head was taken on one of the tracklaying gangs on the Portage & Prince Edward Railway. On going to work he found that the gang had been working on the line without the consent of the company. He could not see how the incorporation of this body was legal. It would be expected that the company in the world. The British have no reason for a Jesuit to be on British soil. The preacher could not see how the Provincial government could fail to pass the bill, and yet not allow the incorporation of a legal order like the Jesuits. He said that the Jesuits were merely a party. A Jesuit pledged himself to the utmost of his power to uphold the Pope's pretensions of authority over all national kings, princes, and governments, all being subject with the Pope's sacred condemnation, and the Pope may be said to be supreme. The secular power is merely a privilege. The Jesuits are the only ones who can make a king. He who goes to death a Jesuit is declared a martyr, whereas he who goes to death a secularist is not only a hateful but a horrible thing.\n\nVICTORIA\n\nLivery and Boarding Tables.\n\nBetween Johnson's and Campbell's Stores.\n\nNEILSON & M'BEATH\n\nFOR THE Best Assorted Stock\n\nOF CONFECTIONERY\n\nGO TO\n\nH. M'Dougall's Bakery.\n\nH. MacDougall\n\nW. Stobart & Co.\n\nIndian Traders\n\nGeneral Merchants\n\nPrince Albert and Duck Lake\n\nSASK.\n\nPaine's Celery Compound\n\nFor the Nervous\n\nThe Debilitated\n\nThe Aged.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Paper by addressing Geo. F. Bowell & Co., New York.\n\nG. H. Campbell\n\nGeneral Railroad & Steamship Ticket Agent,\n\nAlex. Loudoun,\n\nSec.-Treas\n\nAGENTS:\n\nP. G. Gray,\n\nEdmonton, Alta.\n\nJ. Fraser-Tims,\n\nPot Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\n\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. Campbell's.\n\nFirst Class Goods\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nJ. M. Campbell\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nHave a Large Stock of\n\nLUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas\nCOMMUNICATIONS\n\nIt must be distinctly understood that we shall not be responsible for any opinions expressed by correspondents. Certain matters will be printed in full, not necessarily for publication.\n\nTHE TOWN ACCOUNTS.\n\nSir,—Those who have been before called upon to give an opinion as to whether the officers of public utility corporations are liable to receive praise, censure or advice, in such a degree as to make it proper for anyone to call for, at the hands of the citizens whom they have been chosen to serve. Let me examine and pass an opinion as to what was best done in the management of their taking off a great deal was promised in placing the affairs of the town in the hands of a few men. Two months have elapsed which should be sufficient time for them to make some progress. The mayor, in his executive capacity and as a member of the legislative body, has carried out the instructions of the council carried out. We all remember how, when the mayor came into office last fall, he objected strongly to the manner in which the accounts of the town had been kept ever since the last incorporation. He said it was only just to the ratepayers, and not contributing to the credit of the business men of the town, that he should be represented in the council. Others in the council shared these views, and the result admits of no question. The present mayor was one of the committee formed to examine the accounts and draft a scheme for having a satisfactory form of accounts established. Probably the fact that there was existing a matter of unsettled accounts during a certain period of time from being pushed through before the end of the year, but it should have been attended to then. We are convinced that the accounts are now in order, and placed in the present mayor's hands to be forwarded so as to come before the council with the most different system from the hitherto kept. Why was it that this was not brought forward to be presented upon the present council? If of course there was no excuse for keeping it back. I do not know if the accounts reported that the accounts were in order, but if they were kept, so if they recommended a change. I can hardly believe the fact, if the accounts were kept for that purpose, that the latter part of the year, that the rate payers would like to know also. It may be the charge immediately brought against them, that the accounts have been kept in the past, the past councils have been to blame, not the officials of the present council, but the instructions given them. In all matters that have engaged the attention of the council the same care has been taken to advantage in the keeping of the accounts. They have been doing and undoing, without any other apparent object than to placate the feelings of the ratepayers, whether they have been incorrectly reported, in that they have taken up the question of the salary of the town's handmaster a salary, and that equal to the combined salaries of two or three of the offices of the town, in order to take things easy. I think the town council are partly justified in doing a little economy and a great deal of advice, carefully administered.\n\nA RATEPAYER.\n\nDUCK LAKE.\n\nMr. H. H. Smith will be here on Sunday the 17th.\n\nThe snow has all gone and wagons are in general use.\n\nThe Meds are getting ready for their spring trip, and will start shortly and dispose of Mr. McLean, merchant of Fish Creek, was in town this week renewing old acquaintances.\n\nMr. McLean for purposes bearing Mr. Smith shortly to purchase goods. He was delighted with his last visit.\n\nAn English school is badly needed here, and if this council and our people will get a school up and build one, it will be a great blessing.\n\nTwo of our young men report seeing geese on Monday night, and William John had a very singular experience that day.\n\nThe new schoolhouse is progressing, and the children are enjoying its occupation. This is an important settlement and she old homes.\n\nA meeting of the settlers will be held here on Wednesday, April the 17th, at 1 o'clock p.m., to form an agricultural society. It is to be hoped there will be a hearty attendance.\n\nMr. G. Carter, of Carlton, last spring bought seven turkeys from which he raised twenty-eight poults. He raised them for $25.00 each.\n\nMr. McLean, of Willoughby, brought in this week a large lot of eggs. He says raising turkeys costs one cent per egg.\n\nIt weighed thirty-eight pounds.\n\nHe made a present of it to an Irishman, someone thinking he was a Scotchman.\n\nThe event of the season took place at Batchelor on Monday last in the marriage of Mr. & Mrs. L. J. Miller. After the ceremony Elder Marion of Batchelor officiated. The ceremony was performed by the Reverend Mr. Miller. The groom is a highly respected citizen of this town, and the bride Miss De La Torre. The bride wore a black satin dress, rich trimmed with lace and plume. After the wedding breakfast, at 12 o'clock, the guests assembled at the residence until the following morning. The bride was the recipient of many valuable and useful presents.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder is more varied, more nutritious and more wholesome than any ordinary kind and is used by the best bakers and confectioners for their cakes, pastries, etc.\n\nROYAL BAKING POWDER CO., LTD., Wall-st.\n\nFOR SALE OR EXCHANGE\n\nThe Well-known Store of W. R. FISH.\n\nOwing to my premises being too small, and intending to build this spring, I offer for sale or trade, on easy terms. Call, if you want a bargain.\n\nW. R. FISH.\n\nRUSSELL & DAVIS\n\nWHOLESALE AND RETAIL\n\nButchers\n\nGame in Season.\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nHORSE SHOE STORE.\n\nThis spring, sweet, balmy spring,\n\nThe winter has been mild.\n\nSome stock that T.O. bought last fall\n\nHas been sold at a loss.\n\nSpring is really no use,\n\nAnd winter stock must go.\n\nSo T.O. bought some more,\n\nAnd gave the folks a show.\n\nIn spring like a drive,\n\nAnd winter like a ride.\n\nWe move what we can, when we can,\n\nAnd sell out and have none.\n\nAny sensible person knows that it is better to sell out and have none, than to keep the money for six months, what we can get together, and then have to buy again.\n\nYou get goods at dead cost.\n\nThis is business, not hawking.\n\nGive us a call and convince yourself that we advertise our sale.\n\nTHOS. O. DAVIS.\n\nFREE PRESS.\n\nThe publishers of the Manitoba Free Press, having a special object in view, make an unprecedented offer, as follows:\n\nAny person who will cut out this advertisement, and fill in this blank with Name and Post Office,\n\nNAME\n\nP.O.\n\nAnd enclose it (stamped) along with ONE DOLLAR, in registered letter, addressed FREE PRESS, Winnipeg, Manitoba, BEFORE FIRST OF APRIL, will receive the Weekly Free Press (regular price 8¢ per annum) from time of receiving order till January 1st, 1890.\n\nWINNIPEG, Feb. 25, '89.\n\nMANITOBA FREE PRESS CO.\n\nFOR SALE!\n\nTHE LELAND HOUSE\n\nFerry's Seeds\n\nGet Your SCHOOL SUPPLIES AT CANN'S\n\nNow is the Time To Order EAVESTROUGHING", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889030801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 4723, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4185, 1], [4185, 8206, 2], [8206, 12921, 3], [12921, 19892, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]