[{"id": "9abf1fb6c0a8274dc3769cfee012ae6ecac31364", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\nBill Heads,\nEnvelopes,\nCirculars,\nDodgers,\nBusiness Cards,\nLegal Printing,\nPamphlets,\nEtc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\nPROPRIETORS,\nRIVER STREET,\nPRINCE ALBERT\nTHE ROMANCE OF THE PIE.\n\n\"Do you like apple pie?\"\n\nThe soft, whispering wind of a dreamy, one-light-under-shirt-and-no-suspenders evening in June was blowing the fluffily mass of hair from that that decorated Ethlyn McNulty's perfectly shaped head, and as she looked triumphantly up into the eyes of the tall, dark, silent man who stood before her, she knew that she had given the priceless treasure of her girlish, innocent, unspoiled heart to the man whose feet the palm of her doughty breast on his lips and knew that, come weal or woe, he'd be the day's end, the golden hour of his life.\n\nFortune, or darkness by the grave, haggard figure of Despair, there would always be his heart, at least for him, and the blue eyes of his mother setting sun shall again gild the eternal hills and such stray cows happen to be standing in the pasture near the road shall make three times one for life and George will be £20 richer. This last thought seems ever him as he looks down upon Ethlyn across the river's rock, and as it awakes mournfully around the products of his soul his heart swells with a strange, yet piteous love. He was a merry, light-hearted boy with a sore toe. But suddenly the touch of a damsel's cheek against his own brings back the memory of those bright, sparkling eyes—eyes that will soon be picking out buttons at his expense—are looking at him now. The thought that Ethlyn has seen a tinge of melancholy, a lambent gleam of sorrow—no cares—for-three-days that goes to his very heart.\n\n\"You are sad, my darling,\" he said, pressing her closely to the midship rib of his steed's saddle. \"Why do you look so wistful?\"\n\n\"Because,\" she replies, \"you have not answered my question. I asked you if you had seen Ethlyn.\"\n\n\"Yes, he says. \"I do. I am deeply enamored of pie in every shape.\"\n\nHardly had the words left his lips when Ethlyn's hand fell from his arm, and presently her little form was shaken by a storm of sobs. George is horror-stricken. He has never seen such a sight since the Pinball game in the school yard.\n\n\"Why do you weep, my precious one?\" he asks, bending tenderly over her.\n\n\"I am afraid,\" she replies, raising a shower of kisses on the upturned face, \"you are more prone to me than ever.\"\n\nPROSPECTUS OF THE Prince Albert Directory\n\nBUSINESS GUIDE\n\nIt is proposed to publish a Business Directory for the town of Prince Albert and District of Louis in a pamphlet form which will contain the advertisements of each business establishment in the town, with full descriptive matter and a descriptive notice of each.\n\nThe purpose will be to contain all the information necessary for the present condition and future prospects, together with a statement of what can be expected for the future.\n\nLouis, existing as an isolated number of habitable farms, acreage increasing year by year, crop population of farmers, and other important information, written by a well-known journalist.\n\nAbout 500 or more copies will be published, and the proceeds thereof will be received, which will be distributed throughout the Dominion and the Mother Country.\n\nIt is hoped that by these means, benefits will result, not only to each individual, but to the entire community, and the whole country will benefit by the same and appreciated both at home and abroad and a healthy encouragement encouraged to the same.\n\nPrice of advertisement, whole page, with notice on opposite page, $10; two pages given free. Single copies, 50¢.\n\nTHOMAS O. DAVIS.\n\nHUDSON'S BAY CO.'S\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 3,000,000 acres in the Great Terrebel Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Stechen, N.W.T.\n\nC. J. BRIGGS, Land Commissioner.\n\nMEDICAL HALL.\n\nT. E. JACKSON,\n\nChemist & Druggist\n\nHas on hand a large supply of Drugs, Chemicals, Dye Stuff, Spices, Druggist's Sundries, Perfumery, Toilet Articles, Sponges, Patent Medicines.\n\nJabbers supplied on reasonable terms. Special discounts for large orders. Physicians prescribing and family to order carefully prepared.\n\nT. E. JACKSON.\n\nJ. D. T. UTHGRAVES,\n\nWatchmaker and Jeweller,\n\n(A. T. N. Campbell's New Store)\n\nA LARGE STOCK OF Watches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended to\n\nWatches, Clocks, Jewellery, and Stationery.\n\nJoseph Higgins & Sons, Watch Makers, Jewellers, and Stationers.\n\nEverything warranted as represented.\n\nOrders filled promptly.\n\nR. B. WAY,\n\nPost Office, Prince Albert, N.W.T.\n\nRead This\n\nONLY\n\n$3.50\n\nThe Greatest Offer ever made to the Canadian Public\n\nFOR $3.50\n\nWeekly Globe\n\nTHE GLOBE PRINTING CO., Limited.\n\nTORONTO\n\nThe Great Dollar Paper.\n\nTHE CLOVE\nTHE LAW'S DELAYS\n\nThe law's delays are proverbial. Sometimes the judges are slow, sometimes the system is sluggish. However, in this case, the delays have been extreme. The law has always been slow to everything, and as time goes by, the pace seems to slow even further. In this particular case, the delays appear to be rather long, they may be left to take care of themselves.\n\nThe delays which have occurred in this case are due to the fact that the case was heard before the Hon. Mr. Justice of the Saskatchewan District Court. The case, which has become so complex and protracted, has been heard in court several times, but each time the proceedings have been delayed. The case involves some public matters, and the judge has been unable to make any progress. The case is now in the hands of the judge, who has been unable to make any progress. The case is now in the hands of the judge, who has been unable to make any progress.\n\nOur Mammoth Stock\n\nWinter Goods\n\nIn all lines will arrive\n\nThis Week\n\nLarge Blocks of Goods\n\nTo meet Payments\n\nBraver Hats!\n\nFurs!\n\nWe are selling them at cost\n\nGood Warm Ulsters,\n\nHeavy Winter Clothing\n\nFor Boys' Gloves,\n\nMittens, etc., at cost\n\nJACKSON & JACKSON\n\nKNOX & BARKER\n\nHave respectfully announced that they have removed to their new workshop near the Presbyterian Church, and are in a position to fill all orders promptly attended to. Plans and estimates furnished. Satisfaction guaranteed. Office & workshop near the Presbyterian Church.\n\nBUFFALO HALL LEADS AGAIN.\n\nOur Great Closing Sale is still going on, and for a few days more we will offer all our Dry Goods at Cost, Ready-made Clothing, do., Gent's Furnishings, do., Ladies' Furnishings, do., Infants' Clothing, do.\n\nGROCERIES\n\nAt Greatly Reduced Rates. All Groceries, etc.\n\nBETTS & GWINNE.\n\nCITY AUCTION ART\n\nMARKLEY & ORR,\n\nReal Estate and General Agents. Sale Agents for this district for the\n\nThe Celebrated New York Singer Sewing Machines\n\nKNOX & PARKER, HUGH J. MONTGOMERY,\n\nReal Estate Agent, Auctioneer, Etc.\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nLadies, if you want\n\nBuffalo Breeds\n\nFor Boys' Gloves,\n\nMittens, etc., at cost\n\nJ. O. DAVIS & CO.,\n\nWholesale and Retail.\n\nPRINCE ALBERT, SASK.\n\nHOW TO SUBSCRIBE.\n\nForces TWO POLICE, Regimental Letter (writing name of Subscriber and Post Office very plainly) addressed to\n\nPRINCE ALBERT, WINNIPEG, MANITOBA.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883103101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 2051, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 473, 3], [473, 473, 4], [473, 5237, 5], [5237, 7607, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]