[{"id": "044069decc969c74595d4fbf2510c81d8284dd16", "text": "THE PRINCE ALBERT TIMES\n\nINTERESTING STATISTICS.\n\nFrom various sources we are enabled to furnish our readers with the following extracts. It appears from these that the total population at the Electoral District of Prince Albert is 7,168, of which 1,279 are farmers, while 5,890 are settlers and others are surprised at these figures, but we believe they are accurate. There are 1,384 voters registered in the Electoral District of Prince Albert in the North West Council. Average of wheat crop, 8 bushels per acre; acreage, 1,300 acres; oats, 200 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 17 acres; oats, 1,000 acres; potatoes, 300 acres; beans, 50 acres; peas, 10 acres; barley, 16\nPECK'S BAD BOY.\n\nMr. Peck is to be a Millionaire or Work Miracles. He Doesn't Care Much What.\n\n\"Well, I must see a big change in you,\" said the boy as he came up to talk with his friend. \"You look like you have had quite a hard time as a boy; so come to me with a poor story, looking tame, and bought him a piece of candy. 'I'm not going to work,' the boy answered, and began to go through the foolish act of eating the candy. But when he looked up and saw what was falling, the grocer said, \"What has got into you? You haven't got religion yet.\"\n\n\"Yes,\" said the boy, \"but I am a poor man who lives in a hard luck, and thinks the world is all a fraud, and who doesn't want to work, nor to eat. If I could get work and surprise the person with a bit of kindness, a smile, a word of encouragement, I could make much more than I do now. I have had more fun making people happy than I ever had before.\"\n\n\"But where do you find work?\" asked the grocer.\n\n\"Everywhere,\" replied the boy, \"in the parks, and along the streets, and at the corners. I have worked as a laborer, and I have tried every kind of work, and I have found that I can always make someone happy by doing something for them.\"\n\n\"Well, you are a good boy,\" said the grocer, \"but you need to work harder.\"\n\n\"I will try,\" said the boy, \"and I will work as hard as I can.\"\n\n\"Just receive.\"\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Carters' Rammers, Shafts and Tongs for sale.\n\nAnd a variety of other articles generally used in a first-class Blacksmith Shop.\n\nCHESTER THOMPSON.\n\nPRINCE ALBERT.\n\nReal Estate\n\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS ON THE PRINCE ALBERT\n\nPlanning Mills and Saw and Door Factory\n\nC. MAIR,\n\nPrince Albert, N.W.T.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nPlains and estimates furnished when required.\n\nPlansing ones. Matching done to order, next to H. M. Grist Mill.\n\nFARMERS ATTENTION!\n\nA. Harris Sons & Co., manufacturers of farm implements, have just introduced a new line of plows, consisting of the following:\n\nBrantford Reapers.\n\nBrantford Mowers and Rakes.\n\nSnowball & Spight Wagons.\n\nStubble and Grass Plows.\n\nA large stock of repairs.\n\nS. W. VANLIUEN.\n\nFirst Prize Wherever Exhibited\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO,\n\nONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nCONSUMPTION Positively Cured.\n\nAll sufferers from this disease are respectfully invited to visit Dr. Ash & Robbins's establishment, 300 Fulton St., Brooklyn, N.Y., and be cured.\n\nAsh & Robbins, Prince Albert, N.W.T.\nA MISSIONARY TRIP\n\nMr. Robert Johnson left Prince Albert, Oct. 26th, bound for Saskatchewan Forts.\n\nThe journey of 800 miles by horseback recently made by Mr. Robert Johnson, of Presbyterian Home Missionaries, was one of considerable interest. He started from Prince Albert, Oct. 26th, bound for Saskatchewan Forts.\n\nHe traveled over the prairie, through the Carrot River valley, and up the North Saskatchewan River, where he met with many difficulties. He reached his destination safely, and returned to Prince Albert, Nov. 15th.\n\nMr. Johnson's trip was a great success, and he was well received by all who knew him.\n\nCOAL OIL.\n\n500 GALLONS,\n\nAMERICAN AND CANADIAN.\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nREPORTERS.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 3,000,000 acres in the Great Prairie Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Edmonton.\n\nC. J. BRUGGERS, Land Commissioner\n\nPrince Albert Bakery.\n\n2LB LOAF, 12c.\n9 LOAVES, 15c.\n\nCakes and Pastry always on hand and made to order.\n\nWM. R. BELL\n\nNOTICE.\n\nJUST ARRIVED\n\n100 HORSES\n\nCONSISTING OF\n\nWORK, SADDLE AND BROOD MARES.\n\nFreighting, express and passenger line from Gatineau Crossing to Trois Rivieres and back.\n\nPH. GARNOT\n\nAgent, Gatineau Crossing, South Branch\n\nFURNITURE\n\nJust arrived. In addition to our former stock we have now on hand:\n\nFancy Parlor and Bedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\n\nChairs of nearly all descriptions.\n\nCrates & Cribs for the Babies.\nRocking Chairs for the Ladies.\nMattresses Single & Double to suit Customers.\n\nG. & C. E. CARTER,\nREPRESENTATION WANTED.\n\nThe North West Territories are, with entire patience, demanding representation in the federal parliament; and they have recently adopted by the Council of the Territorials, what is claimed to be their Charter. The North-West now has taken up, the question up, and the greatest possible question up, in terms of its importance. It is now also, that the representatives shall consider the matter at the earliest possible moment and endeavor to comply with the clear protest and resolution of the people.\n\nThere can be no sufficient cause preventing change. The manner in which the North-West has been treated is a flagrant violation of the most important of the constitutional rights of the people, and must be considered as the last possible moment and endeavor to comply with the clear protest and resolution of the people.\n\nThere can be no sufficient cause preventing change. The manner in which the North-West has been treated is a flagrant violation of the most important of the constitutional rights of the people, and must be considered as the last possible moment and endeavor to comply with the clear protest and resolution of the people.\n\nTHE QUAPPELLE TRIAL.\n\nOur readers will remember the letter of a correspondent, \"Half Breed,\" published in a late issue of this paper regarding the Quapelle trial, which appeared in the Leader. We clip the following from a recent issue of that paper:\n\n\"A correspondent of the Prince Albert Times most properly takes exception to the language used in connection with this trial. We are not disposed to make any comment for the sake of the half breed murder. An editorial editor is not held accountable for anything except what he says. We do not believe that we saw this report before the morning of the issue we should have run our pen, and we would have been disposed to say Half Breed. The likes of Half Breeds are just as much in our eyes as are the likes of the French or British or Englishmen. We take great exception to the idea that we have spared this outrage until we can be sure that an additional column of the Times would have been consumed in doing so, and until we had satisfied ourselves that there was historical evidence of the existence of the half breed. We have not heard the half breed's story, and we do not believe that there is one. He will not state his case and the final word. But may he never be heard again. When he returns he will have failed to prove himself a friend of the Metis as there is in the North West.\"\n\nWeather Report.\n\nMonday, Nov. 26. 1 21\nTuesday. 3 27 2 15\nWednesday. 4 29 2 13\nThursday. 5 30 2 15\n\nLarge Blocks of Goods\n\nTO MEET PAYMENTS,\n\nLadies, if you want\n\nBAKING POWDER!\n\nABSOLUTELY PURE.\n\nThis powder never varies. A market price is charged, and the product is examined under the ordinary tests of purity and quality. It is made from the finest flour, and is guaranteed to be the best.\n\nWe are selling them at cost.\n\nGents, if you want\n\nGood Warm Ulsters,\nHeavy Winter Clothing,\nFur Caps, Gloves,\nMittens, etc., at cost.\n\nWe mean business and intend to cut slash prices in all lines for cash down.\n\nJ. J. Gordon & Co.,\nGeneral Merchants,\nand\nHORSESHOEING.\n\nDone on the Most Approved Principles and with the Finest Materials.\n\nContractors for, Horseshoeing, and other services connected with the feet of horses.\n\nSleigh and Cutter Ironing.\n\nCarriage Repairing\nAnd Jobbing,\n\nWM. GORDON,\n\nFRONT STREET.\n\nJ. O. DAVIS & CO.,\nWholesale and Retail.\n\nWINTER GOODS\n\nIN ALL LINES WILL ARRIVE\n\nThis Week\n\nBeaver Hats!\n\nOR\n\nFURS!\n\nWe are selling them at cost.\n\nMANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\nTHE LARGEST PAPER IN CANADA!\n\nTHREE MONTHS FREE.\n\nThree Handsome Cash Prizes\n\n$500-$200-$100.\n\nBuffalo Hall!\n\nOwing to a change in our business, which will take effect on Jan. 1st, 1884, all accounts due and not provided for by that date, will be placed in the hands of our solicitor for collection.\n\nBETTS & GWYNNE.\n\nKNOX & BARKER, Farmers' Restaurant.\n\nMeals at all Hours.\n\nCarpenters, Etc.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nR. J. O'LEARY.\n\nPRIME ALBERT.\n\nBURIED PRINTING", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883113001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 5346, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6899, 2], [6899, 6899, 3], [6899, 9691, 4], [9691, 11883, 5], [11883, 16003, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]