[{"id": "e2e62639ede7a743aca1c6ed9a5386c85182c035", "text": "THE NEW FRANCHISE ACT.\n\nAlthough the North-West Territories are not very likely to receive the new franchise act in the Dominion Parliament, there is no reason why they should not come into the provisions of the new Dominion Franchise Act which Sir John has brought down. It may not prove uninteresting to our readers. The Bill appears to be based largely on the Ontario Act. The property qualification required by the new Act is as follows—In cities, towns, and incorporated villages $200 real property, or $20 rental; in rural districts $200 real or personal estate. All persons who have been residents of the district for five years will also be entitled to vote. In counties, farmers' sons who have been residents continuously on the land of their father or of their mother since the death of the latter shall be entitled to vote. The farm be of sufficient value equally divided among them as commoners to qualify them under the Act. In cities, towns, and villages, married men and women, and others who will be admitted to the franchise on the same terms as farmers' sons. Unmarried women possessed of the necessary property qualifications will also be entitled to vote, this clause to apply to the daughters of farmers and to those of property holders in cities, towns, and villages. The Act provides for the appointment of a revising officer whose duty it will be to prepare the voters' lists and hold courts for their revision.\n\nThe foregoing is a brief outline of the proposed Act as explained by the Premier. Apart altogether from the connection between the two parties as to whom the franchise should be left to, the Provincial Government or not, the bill has many peculiarities. Why should unmarried ladies possess such an advantage over married women? It seems an injustice to debar the mother of a family from a privilege enjoyed by her daughters. If we are to have female suffrage we should prefer it in its most unrestricted form under all conditions. The appointment of revising officers by the Government is receiving a good deal of opposition from the members of the Reform party, who claim that the Government, on the day following the passing of the act, will have to pay certain officials, and that the various township assessors would do the work for a very much smaller amount of remuneration than county surveyors. The bill will also be open to the objection that it will be much more expensive than the old method, as it will still be necessary to prepare the voters' lists beforehand for municipal and provincial elections. The expense of the preparation lists will be entirely additional. The expense to the municipality will be about trebled, notwithstanding the fact that the revisions will be paid out of the Dominion treasury.\n\nREARING OF CATTLE.\n\nIn no part of the North West is there as great a scarcity of cattle as in this vicinity. Cows cannot be had at any price here, young steers only rarely obtainable figures. While a large number are being brought into Manitoba and Assiniboia, it is regretted that none of them find their way to this locality. So long as the prices are high, the market for the Dominion breeders. No importation can be encouraged that will do better in Canada with farmers would be willing to import in stock if it could be had. The dairy farmers in On-land where he can secure 300 cows make money with them on about one hundred dollars less per head than he can get in the Canadian market. The difference mostly thrown to farmers, and when he comes to market for an abundant supply of milk, all his other implements, cheese at thirty and butter at forty together with his provisions are to be increased in about the same proportion. It is to be remembered that in proportion, he will indeed be a very poor man. In the Dominion there is a distinct market for the best beef cattle, and even the celebrated Red Polls. There is nothing in the Act binding the Government to furnish such meat as that found in the Dominion. We have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains Sleigh and Cutter Rungers, Shirts and Tongs for sale.\n\nAnd a variety of other articles in a first class Blacksmith Shop.\n\nHorse Shoeing and Repairing Farm Machinery.\n\nCHESTER THOMPSON,\n\nWAREHOUSING AT FORT QU'APPELLE.\n\nMECHANICS AND DEALERS\n\nGRUNDY BROS. & CO.\n\nSTEWART & WOOTTON\nJ. R. McPhail, The Prince Albert Times\n\nAND\n\nSaskatchewan Review.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 per annum.\n\n\"The Times\" contains all original matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your advertisement read by all.\n\nReplete with local and general news.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., etc., printed with neatness and dispatch.\n\nSpink & Maveety, Proprietors,\n\nRiver Street, Prince Albert.\nITEMS OF INTEREST.\n\nOur Island Home.\n\nPRINCE ALBERT\n\nBOOT & SHOE STORE.\n\nBoots & Shoes\n\nCheap, Cheap for Cash.\n\nAll kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\n1879.\n\nBUFFALO HALL\n\nOUR STOCK CONSISTS IN PART OF\n\nTransportation Co.\n\nWeekly Line\n\nMarquis, Capt. A. R. Bannell.\n\nNorthcote, Jerry Webber.\n\nNorthwest, James Sheets.\n\nPRINCESS.\n\nBETTS & Gwynne.\n\nJames Sinclair.\n\nMerchant Taylor.\n\nHas just received his new stock of\n\nSpring & Summer Goods.\n\nAnd is prepared to supply his numerous customers with\n\nSuites to please the fancy of all.\n\nJust received a large stock of\n\nUNDERCLOTHING.\n\nA fresh supply of\n\nSoft and Hard Felt Hats.\n\nGive me a call.\n\nJ. Sinclair.\n\nNOTICE.\n\nTo my Customers and the Public generally.\n\nIn thanking you for your kind patronage during the past few years I beg to inform you that I have added to my stock a number of new goods and have obtained the services of a first-class workman in the shape of Mr. Smith, who has been engaged in the business for many years.\n\nI am confident that you will be pleased with the results of these changes.\n\nMiss Mack & Co.,\n\nCambridge Block.\n\nPrince Albert.\n\nMEALS AT ALL HOURS.\n\nW. R. Bell.\n\nPRINCE ALBERT\n\nPlaning Mills and\n\nSash and Door Factory.\n\nPRINCE ALBERT\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'Leary.\n\nW. J. Carter.\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nGRAND UNION\n\nLivery & Sale Stables.\n\nHorses and Buggies always on hand.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only stable near town.\n\nS. J. Donaldson, Prop.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883060601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9270, "total-output-tokens": 1725, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4568, 2], [4568, 5099, 3], [5099, 5099, 4], [5099, 6880, 5], [6880, 6880, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]