[{"id": "e91a2936cce5aac8fd6b168f956091ed992fdcbd", "text": "The ceremony of swearing in the new Governor-General appears to have passed off in the usual satisfactory manner, and his Excellency was present with his heralds at the City of Ottawa to witness the most fitting and majestic event. His Excellency is filled with good taste. There is nothing in the reply or address to call for special comment. Lord Stanley has always been remarkably impartial as to what he does and says, and there is every reason to believe that he and Lady Stanley will find themselves quite at home in a short time. There is no doubt that he will be a great success as a vice-regal man, as he ranks very badly but, fortunately, his Excellency is under no pressure to shut himself up. The word \"Domestic\" must be used here, as the few months before winter sets in, no doubt, will be pleasantly spent in seeing what other parts of the Dominion have to offer in natural attractions and Canada's resources. We feel sure that Mr. Albert and the Territories would give him a good idea of the vast and fertile agricultural country he holds the vice-regal reins of.\n\nThe construction of the Regina & Long Lake Railway may now be considered a certainty. The company have got the land grant and in addition a money guarantee from the Government. This was all the company wanted to insure the extension of their line to this place. We believe that operations will commence immediately.\n\nThe appointment of Mr. Royal as Lieut. Governor of the Northwest Territories seems to be a matter of fact. Mr. Royal has assumed the gubernatorial chair bright with his many years of experience as representative of Saskatchewan in the Federal Government at Ottawa. From his affable manner and logical experience we predict for the honorable gentleman a bright reign as Lieut.-Governor of the Territories.\n\nIt is now authentically reported that His Honor Lieut. Governor Dewdney has been appointed Minister of the Interior. We feel deeply regretted at the loss of Hon. Mr. Dewdney as Lieut. Governor, we congratulate the Government upon its choice of him as successor to the late Minister of the Interior. From his long experience as governor of the Territories, from the able manner in which he has discharged his duties, and from his valuable knowledge of the various wants of our country, no appointment could have been more acceptable to the people of the Territories for the important folio of Minister of the Interior as the Hon. Mr. Dewdney.\n\nThe long struggle of Emperor Fredrick of Germany with the malady which afflicted him has at last ended, and death has been an easy and peaceful end to his sufferings. That he bore up so long as he did was a matter of surprise to his physicians, who during months past have many times looked for his collapse. Brief intervals of apparent recovery were enjoyed by the hearts of the people could hardly be compared to the joy felt by the farming community. I have decided to advance the following platform:\n\n1. Speedy railway communication with this District.\n\n2. The giving of all contracts for the Mounted Police and Indian Departments to firms residing within this District.\n\n3. More liberal allowances for the improvement of roads and building of bridges in the district.\n\n4. Substantial grants to our Agricultural Society.\n\n5. Consideration of the question pertaining to the secular will of the people.\n\n6. Recognition of the services of members of the N.W.M. Police in the same manner as were allowed the volunteer police.\n\n7. Special consideration given to children of Indians and half-breed natives who resided in the Territories at the time of the transfer and were born before the 15th March, 1898.\n\n8. The establishment, by the Indian Department, of a better system of medical attendance for the Indians.\n\nThese are the main points of this platform. I am confident that there are some of the suggestions which immediately occur to me. If, however, I have omitted anything I shall be glad to take such suggestions as may be made to me. Should you see fit to elect me as your representative I will to the best of my ability serve you faithfully and zealously as becomes one who has the best interests of the entire district at heart.\n\nI am, Gentlemen,\n\nYour obedient servant,\n\nWM. PLAXTON.\nMr. Hartley Reed has been appointed Indian Commissioner; Mr. A. E. Forget, Clerk of the Council, also the position of Assistant Commissioner, and Mr. R. H. B. Collins, Secretary of the Land Titles Office, assumes the position of Clerk of the Northwest Assembly. Mr. Reed—As Assistant Indian Commissioner—has been for many years an active and prominent member of the Indian Affairs of this country and will prove an excellent official as Indian Commissioner. Mr. Forget, as Clerk of the Council, and we augur a successful career for him as Assistant Indian Commissioner. Mr. Collins is a capable and efficient official and will be a worthy successor to Mr. Forget.\n\nPAID THE PENALTY.\n\nThe British Marquis Dropped his Accusation.\n\nEDMONTON, June 13.—Moses Reaert and James Giddings died on the battlefield at the hands of Indians, and the death of the latter is due to the murder of Hector McRee at his house near Wainwright in May, 1867. The Indians were killed by the Marquis' men before witnessing the law was carried out, said Sheriff Benson, who was present.\n\nMy life was spared.\n\nReaert answered \"Yes.\" He continued, \"But I could not have here. This with the Indians, they would have killed me. In statement, the most important part of which was as follows: \"I am now convinced that the Indians are not fair trial. Perhaps I would have a little longer to live, but it is not because I do not want to die. I am willing to die, but I have no chance to talk, because when I had my trial I had no chance to talk. Those men will forgive the people who got me my position.\"\n\nThe Indians placed the men on the ground near the prisoner's feet. He died shortly after, and the Indians then began to dig up the bodies, and the next day they fell. Locking down, not a movement in the bodies. The Indians then came back eight feet, and the man on Godly's back had jumped over to the back of his neck, and had been killed by the Indians.\n\nThus the murderers of Hector McRee, however, the rope had cut deep and badly, and the body was found in a condition which made it impossible to identify.\n\nDeath was instantaneous, according to Dr. Duff, who examined the body. Dr. Duff stated that the heart was pierced and examined the body, and all pronouncements of death were made. At 9:30 and at 8:30 the pulses had ceased. At 9:30 the body was removed from the Department of the South. They had proceeded to the scene of the crime.\n\nThus the murderers of Hector McRee paid the penalty of the awful crime they committed.\n\nSILK EBROINS:\n\nThree of our lady readers who would like to purchase silk Ebroins may have purchased them at the following prices: Mrs. Smith, $2.50; Mrs. Johnson, $2.75; Mrs. Brown, $2.25.\n\nGEORGE FISHER, Batrobe, Mer-\n\nchant.\n\nAnd further that unless the Election is otherwise terminated before the time mentioned herein, the Returning Officer shall, on the 30th day of July at Batchoche, open the ballot box and count the votes, declare the several candidates, and return as elected those having the highest number of votes.\n\nOf which notice, please hereby re-\n\nceive accordingly.\n\nGiven under my hand at Batchoche in the North-West Territories this 23rd day of June, 1888.\n\nRODOLPHE OUELLET,\nReturning Officer.\n\nInformation to Electors\n\nThe following is the Qualification of Election as prescribed by the Parliament of Canada:\n\n\"The persons qualified to vote at an election shall be citizens of Canada, by birth or naturalization (other than municipal), who have attained the full age of Twenty-one years, who have resided in the constituency for at least the twelve months, and who have been assessed for taxes for two months, respectively, immediately preceding the election.\"\n\nEach Elector can only vote at one polling station and for two candidates.\n\nThe qualifications for electors are as follows: To vote, in his turn, go up to the Returning Officer and declare his name, occupation, and place of residence, state for which candidates he votes, and take such Oath as the Deputy Returning Officer may require.\n\nEvery Elector after having voted ought to walk away quickly from the polling station.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nADDRESS.\n\nTo the Electors of the Electoral District of Prince Albert.\n\nGENTLEMEN:\n\nAt the request of numerous electors of all political opinions, I have this day formally tendered myself as a candidate for your suffrages at the coming election. Among other matters, I should be proud of the opportunity of serving my country by supporting the Government by the late Council, in which I had the honour of holding positions which—small as they may be—make a part of my life, and to which I shall continue to press upon the attention of electors.\n\n1st.—The necessity of the speedy construction of the East-West Railway across Canada and the transportation offered by the C.P.R., will be felt and appreciated by all who have boarded its cars and王子。\n\n2nd.—That the unproductive soil be given to the farmers—land waste or land barren.\n\n3rd.—That the townships of Minnedosa and Wasow be divided into represented parts; and that the undersigned be selected as members of the new townships created.\n\n4th.—That the expenditure of the State's revenue be properly applied; and that the undersigned be elected as members of the Committee for projects.\n\n5th.—That a system of compulsory military service for all men of military age, be established; and that the undersigned be elected as members of the Committee for sixteen hours per day of militia duty.\n\n6th.—That the right of habeas corpus be abolished; and that the undersigned be elected as members of the Committee for a bill to that effect.\n\n7th.—That the government of Canada be made more efficient; and that the undersigned be elected as members of the Committee for a bill to that effect.\n\n8th.—That the Queen's Birthday Holiday be celebrated in a better manner; and that the undersigned be elected as members of the Committee for such celebration.\n\n9th.—That the education of children be made compulsory; and that the undersigned be elected as members of the Committee for the same.\n\n10th.—That the school attendance be made compulsory; and that the undersigned be elected as members of the Committee for the same.\n\n11th.—That the control of public works be vested in the hands of the people; and that the undersigned be elected as members of the Committee for the same.\n\n12th.—That the sale of alcoholic beverages be prohibited: and that the undersigned be elected as members of the Committee against the same, placing their votes in the ballot box with those that would not sell liquor.\n\n13th.—That the game laws be enforced; and that the undersigned be elected as members of the Committee for the same.\n\n14th.—That the right to keep and bear arms be protected; and that the undersigned be elected as members of the Committee for the same.\n\n15th.—That the right to bear arms be restored; and that the undersigned be elected as members of the Committee for the same.\n\n16th.—That the right to bear firearms be preserved; and that the undersigned be elected as members of the Committee for the same.\n\n17th.—That the right to bear firearms be preserved; and that the undersigned be elected as members of the Committee for the same.\n\nELECTION NOTICE\n\nCANADA:\n\nNorth West Territories.\n\nElectoral District of Prince Albert.\n\nFor the purpose of voting at the forthcoming Election of the Electoral district of Prince Albert, a polling station will be held at Prince Albert Settlement tomorrow morning from nine until one o'clock, and polls will be open continuously throughout the day.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888062901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5674, "total-output-tokens": 2765, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4242, 2], [4242, 8716, 3], [8716, 12142, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]