[{"id": "1f6a316946170bd13c555db07ee175e0cc8861ee", "text": "It is rumored in Ottawa that the Hon. Mr. Dewdney, Minister of the Interior, will make an official visit to the Northwest this fall. If such should prove to be the case, an invitation should be extended to him to visit this District. Our interests would certainly appreciate the attention which they merited until after the late Minister of the Interior came and saw for himself what was wanted, and we believe that the present Minister would benefit this District. We have been for a number of years urging on the Government the pressing need of a railway, but so far without success. True, they have promised charters and are reported to have come to some arrangement with the directors of the Regina and Long Lake road, by terms of which that road is to be extended to Prince Albert sooner or later. So far, however, we have had no definite steps taken toward the immediate construction of lines of railway to the principal settlements on the Saskatchewan. It would very soon pay to operate a railway to this district. This year, as well as last, has demonstrated that good crops of all kinds can be raised, and the country is unsurpassed for stock-raising. Of course at present we do not raise more than enough for home consumption, but the market might carry our entire surplus. But with the prospect of finding an outside market, thousands and thousands of bushels would be raised annually, even by the farmers we now have. A railway would open up new markets, and millions of acres of choice farming and grazing lands would become productive. Saskatchewan is the garden of the Northwest; its soil is as fertile as that of any other district, and there is abundance of wood, water and building material wherever a farmer chooses to locate. We get very few settlers for the reason that immigrants do not wish to go long distances from the line of settlement, and when they do come, they usually have friends who located here in days when it was expected the main line of the C. P. R. would pass through this district. They have heard a good deal of talk, and when the hardships incident to pioneer life and their many disagree-ments have disappeared, a railway coming to Prince Albert will not be coming an empty vessel. The settlers will be coming to a large and thriving settlement, which will be so strong as it arrives—in a position to give it considerable carrying to do. Mr. Dewdney, although familiar with the Northwest affairs has never been here in his district, and cannot be here for over four years, and then only for a day or two, and consequently cannot truly appreciate our situation. He could learn a great deal which would be useful, and would be beneficial to us by spending a few days in the town. We earnestly trust that he should visit the Territory; he will find time to come to Prince Albert, where he will receive a hearty welcome.\n\nSince the above was in type, we are pleased to learn that a telegram has been received here from the authorities of the Regina and Long Lake railway stating that work had actually commenced on the road that it would be pushed through as far as possible this fall, and in all probability the line will be running into Prince Albert by next fall.\n\nVICTORIA\n\nLivery and Boarding Stables,\n\nBetween Schooner's and Campbell's Stores.\n\nNEILSON & McBEATH\n\nPaine's Celery Compound\n\nFor The Nervous The Debilitated The Aged.\n\nCampbell's Cathartic Compound\n\nThat Old, Reliable Killer of Pain.\n\nTONIC Elixir\n\nTonic and Elixir\n\nDUNN'S BAKING POWDER\n\nThe Cook's Best Friend\n\nR. C. WIGMORE & CO.\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nImported Tweed Suitings,\n\nTrowering and Overcoating\n\nWORSTEDS,\n\nIn English and American Lines,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationary, etc., etc.\nTHE FAIR.\n\nPrice list of the Fifth Annual Exhibition of the Prince Albert Agricultural Society.\n\nThe fifth annual exhibition of the Prince Albert Agricultural Society which was held last week, showed a decided improvement in several branches of agriculture. The attendance of live stock was held by Mr. Campbell's exertions, owing to the impracticability of obtaining a suitable building. Among the attractions and other classes the directors created an immense tent on the cricket grounds although the rain prevented much accommodation it answered the purpose very well and was a great convenience under the circumstances. We can only congratulate Mr. Campbell on the result here as it was much better in every way than last year. Everything was charming and at an early hour in the afternoon the grounds were thronged with visitors from all parts of the country. The energetic secretary, Mr. E. H. Macdonald, had the pleasure of receiving entries of which there were 68; so again we have another record to work at an early hour and by 2 o'clock hundreds of people had visited the shows thrown open to the public. Nearly 3000 persons attended the exhibition and the few people who were unable to get themselves so splendidly paid for their time and money from the time all classes. The grain was all of first class and the best prices awarded to judges to whom was entitled the honor of having their names included. Of the various classes of cattle, Mr. Patterson took first for heavy draught, while Mr. Macdonald was second. Mr. Patterson took the same place. In Class II., thorough-bred and grade cattle. There were a large number of entries, and some magnificent heads were shown. While Mr. Macdonald carried off the most prizes, taking five first prizes, Mr. Campbell, Mr. E. H. Macdonald and Mr. M. A. Brown, also carried away the best entries. In Class III., pigs—There was a very fair showing, there were several entries in each class, Mr. Campbell and Mr. Macdonald took first for heavy draught, while Mr. Macdonald took second. Mr. Patterson took the same place. In Class IV., thorough-bred and grade cattle. There were a large number of entries, and some magnificent heads were shown. While Mr. Macdonald carried off the most prizes, taking five first prizes, Mr. Campbell, Mr. E. H. Macdonald and Mr. M. A. Brown, also carried away the best entries. In Class V., sheep—There were a good number of entries, and some excellent specimens were shown. Mr. Macdonald took first prize, followed by Mr. Campbell and Mr. Patterson. In Class VI., poultry—There were a good number of entries, and some excellent specimens were shown. Mr. Macdonald took first prize, followed by Mr. Campbell and Mr. Patterson.\n\nA Dead Drop!\n\nON PRICES AT J. M. CAMPBELL'S.\n\nSUCH REDUCTIONS FOR First Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS Far surpassing any previous seasons, both for richness design and quality. The Variety of New Goods in Every Department IS IMMENSE Call and Examine Our Stock No trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER FOR SALE.\n\nALEX. LOUDOUN, Sec.-Treas.\n\nAGENTS:\n\nP. G. GRAY, Edmonton, Alta.\n\nJ. FRASER TIMS, Fort Saskatchewan Alt.\n\nMahaffey & Clinkskill, Battleford, Sask.\n\n(Continued on fourth page.)\n\nG. H. CAMPBELL\n\nRailroad & Steamship TICKET AGENT,\n\n471 MAIN STREET, WINNIPEG, MAN.\n\nHeadquarters for all Lines, as under:\n\nAllan, Dominion, Iron, Canadian Pacific, Great Northern, Canadian National, Canadian Pacific, North German Lloyd, White Star, Bremen Line, Direct Hamburg Line, French Line, Anchor, and every other line crossing the Atlantic or Pacific.\n\nPublisher of \"Campbell's Railway Guide.\" This Guide gives full particulars of all lines with maps, rates, etc., for passengers and freight.\n\nAGENT FOR THOR, COOK & SONS, the celebrated American Advertising World.\n\nPREPAID TICKETS, to bring your friends out from the Old Country, and save money.\n\nMONEY ORDERS AND DRAFTS on all points of the world and the Continent.\n\nSALES OF TICKETS checked through, and advised for the ship by telegraph.\n\nWrite for particulars. Correspondence answered promptly.\n\nG. H. CAMPBELL\n\n471 Main Street, Winnipeg, Man.\n\nP. G. Gray, Agent.\n\n61 Main St. and C.P.R. Depot, Winnipeg, Man.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888101201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 2011, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4065, 2], [4065, 8373, 3], [8373, 8373, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]