[{"id": "ad6686eda6b1740f5f571d9ae5b974258b949bca", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, MAY 20, 1887.\n\nBANKING HOUSE OF\nMazarthur & Knowles,\nPrince Albert, N.W.T.\n\nROB'T BUCKLEY,\nAuctioneer,\nAccountant,\nand\nGeneral Agent\n\nFOR THE\nQUEEN'S JUBILEE!!\n\nTHE VICTORIA\nSale and Feed Stables\n\nHURRAH!\n\nA LARGE SUPPLY OF THE GOOD OLD\nWIND CLOCKES,\n\nNICKLE CLAD AND STEEL BLADE\nSWISS WATCHES.\n\nFirst Interchangeable Spectacles. Call\nat our Post Office Jewellery Store.\n\nRepairing done promptly and warranted.\n\nR. B. WAY\nQUEEN'S HOTEL\nLeading Hotel in Saskatchewan.\n\nT. OHAM takes pleasure in informing the residents of Prince Albert and the travelling public that he has opened up his new hotel at Church street, where he will be pleased to entertain all guests and make many new ones as may require his excellent accommodation for travellers. Wall telephone No. 999.\n\nTHOS. ORAM\nPROPRIETOR.\n\nBOOTS AND SHOES,\nSlippers, all Sizes and Kind for Ladies' Gents and Children's Wear.\n\nMoccasins, Overalls and Rubbers for Ladies, Gents and Children.\n\nMits, Gloves, Stockings and Socks All Sizes and Kind.\n\nROYAL MAIL STAGE I\nWEEKLY\nBetween Qu'Appelle Station and Prince Albert, leaving Prince Albert every Wednesday morning at 10 o'clock. Passengers and express at lowest rates.\n\nLEON & SCOTT.\n\nJ. D. HANNAFIN,\nCommission Agent and Collector\n\nFURNITURE!\nCHEAPER THAN EVER.\nFor the next thirty days I will sell at 40 per cent less than list.\n\nGILBERT E. CARTER\n\nWILLIAM KNOX,\nCARPENTER, ETC.\n\nOFFICE AND WORKSHOP.\n\nISAIAH MCCOLL,\nGeneral Blacksmiths.\n\nCHURCH STREET\n\nWM. TAIT,\nAt the Black River, Prince Albert.\n\nBLACKSMITHING\nISAIAS MCCOLL has opened out a general blacksmith shop on the west side of Church street, where he is prepared to do all kinds of blacksmithing in the best style and at moderate rates.\n\nWM. TAIT,\nAt the Black River, Prince Albert.\n\nCIGARS.\nR. T. GOODFELLOW.\n\nFOR SALE,\nAND KEEP ON HAND.\nFlour, Wheat, Oats and Barley,\nGram and Shorts.\nHighest Cash Price Paid for Grain.\nSCRIP BOUGHT AND SOLD.\n\nWM. TAIT,\nAt the Black River, Prince Albert.\n\nTELEGRAPHIC.\nCHIT-CHAT LOCALS.\n\n(By Special Telegraph.)\nGathered by our Reporter.\n\nNext Tuesday will be Queen's Birthday.\n\nFifth for Boots, Shoes and Slippers.\n\nPrecaution against cold.\n\nD. Petersen arrived at the last mail, after spending a pleasant holiday in Ontario.\n\nMr. and Mrs. H. J. Montgomery are home from the east on Tuesday evening last.\n\nThe P. A. Cricket Club are practising hard for the coming match with the Police Club on the Queen's Birthday.\n\nA few trees were planted on Arbor Day, but the majority of the people had other plans for the day.\n\nPreparations are being made for a grand celebration of the Queen's jubilee and Dominion Day on the 31st July.\n\nChief Justice David Ross of St. Albans, has been appointed Clerk of the Court for the District of Saskatchewan.\n\nHeadmaster Pocket Dunn came by last mail and brought with him a full of useful information to the travelling public.\n\nTwo buildings in connection with the new barracks are under way and over sixty men are employed. The barracks will consist of three two-story buildings.\n\nCourses throughout the district are looking exceedingly well, and the indications are that this season's harvest will be the best bought the farmers have reaped for years.\n\nA banquet in aid of the building fund of Our Lady Roman Catholic Church, will take place at the Roman Catholic Hall, Thursday, the 1st and 2nd of June. Further particulars next week.\n\nGrasshoppers have formed a partner with George Melchett in the Victoria Livery and Sale Stable, and the firm have got in new signs and fresh paintwork, which they say will be sold at reasonable rates, night and day.\n\nMr. Smith, the pilot of the North Star, arrived at the Canadian Camp last Monday. He had not been heard from when he started, but it was expected she would be ready for the return trip early next week. She will leave in a few days for Grand Rapids.\n\nChief Factor Bellanger, of Cumberland House, visited the St. Ann's Church last week. After a long, pleasant and hour spent in recreation, music, etc., Mr. Bellanger returned thanks to the parishioners for their kindness and hospitality for the very pleasant entertainment they had given, expressing pleasure at the manner in which the church was being made in the several departments.\n\nA pilgrim who struck town the other day for the first time states that he had nothing but Boone county if he had known what a beautiful fertile country it was. He said that he could see the corn over two thousand in farming in Assiniboia and would not be bound to show pity to any but should show that corn will not grow in a desert no more than pigs will on thorns.\n\nAll we need is a way to secure our land titles.\n\nThe Northwest Farmer for May says—\n\"The Prince Albert Times, quoting the statement of Mr. Bellanger, that agriculture in the Northwest is grateful to know why seeding should be recommended so early as the end of May, if not earlier, says, 'It takes about six weeks to mature, surely it is wisest to take these weeks when the soil has least moisture, as it is actually useless to sow grain that is best not by seeding so late as to keep it from when the plant is at its weakest.' From this statement the Farmer says that it took fourteen weeks for flat to mature, and we took it at its worst. It is also stated that when spring crops are injured in this country, but when the grain is ripening, so much so that it is easy to see that it is injured, and if it is easy to see that it is injured from other crops when maturing all the sooner.\"\n\nWe care you give Fast a call for the cheapest and best Boot and Shoe ever offered in the town.\nHOUSE OF COMMONS\n\nSome discussion took place on the 4th of May on the question of the Government's action in India. The Opposition, under Governor Macdonald, was opposed to the proposal, while the Government contended that the situation required immediate action. The debate continued until late into the evening.\n\nThe next day, the House of Commons met again to discuss the same issue. The Opposition, led by Mr. Macdonald, argued that the situation in India demanded prompt action. The Government, however, maintained that the proposal was unnecessary and would cause further complications.\n\nOn the 6th, Sir Charles Tupper introduced a motion to adjourn the House until the 15th. This motion was defeated, and the House continued its discussion on the India issue.\n\nThe following day, the House of Commons met again to vote on the India bill. The Opposition, led by Mr. Macdonald, argued against the bill, citing concerns about the potential consequences. The Government, however, defended the bill, emphasizing its importance.\n\nThe debate continued until late into the evening, with both sides presenting their arguments. The House finally adjourned until the 15th.\n\nTHE PRINCE ALBERT TIMES\n\nSir Charles Tupper made his budget speech on May 15th, announcing the government's plans for the upcoming fiscal year. The budget included significant increases in military spending, as well as cuts to social programs.\n\nThe government also announced plans to expand the Canadian Pacific Railway, with the aim of connecting the country from coast to coast. The railway was expected to create thousands of jobs and stimulate economic growth.\n\nThe budget also included measures to address the country's growing debt, with the government promising to reduce the deficit over the next five years.\n\nTHE NEW YORK TIMES\n\nSir Charles Tupper delivered a speech on May 15th, outlining the government's plans for the upcoming fiscal year. The budget included significant increases in military spending, as well as cuts to social programs.\n\nThe government also announced plans to expand the Canadian Pacific Railway, with the aim of connecting the country from coast to coast. The railway was expected to create thousands of jobs and stimulate economic growth.\n\nThe budget also included measures to address the country's growing debt, with the government promising to reduce the deficit over the next five years.\n\nTHE CANADIAN PRESS\n\nSir Charles Tupper delivered a speech on May 15th, outlining the government's plans for the upcoming fiscal year. The budget included significant increases in military spending, as well as cuts to social programs.\n\nThe government also announced plans to expand the Canadian Pacific Railway, with the aim of connecting the country from coast to coast. The railway was expected to create thousands of jobs and stimulate economic growth.\n\nThe budget also included measures to address the country's growing debt, with the government promising to reduce the deficit over the next five years.\nA meeting of the Organization Commit-tee in connection with the proposed celebration of the Queen's Jubilee will take place this evening in the Council Chamber. All members of the Commit-tee should be present.\n\nTERRITORIAL NEWS\n\nEDMONTON\n\nFrom the Bulletin, April 28th.\n\nA large amount of last year's grain still remains in the farmer's hands.\n\nH. A. L. Dandridge, of the Calgary Land Office, is Chief of the Land Court, the judicial district of Northern Alberta.\n\nC. Delagrange, of St. Albert, has been appointed Clerk of the Court for the judicial district of Southern Alberta.\n\nArrangements are now being made by the Postoffice Department to run a fortnightly mail to Victoria after May 1st.\n\nRev. Mr. McCallum has purchased property and the name of the postoffice to be Pakan.\n\nP. Daly has opened a private banking business in the building occupied by him as a drug store.\n\nBATTLEFORD\n\nFrom the Herald, April 30th.\n\nThe telegraph construction party to operate here and Pitt will be gin work on Monday. It is composed entirely of young people.\n\nThe experiment of mining tried this week at the mouth of Battle River was crowned with complete success, as no less than two hundred pounds of gold was taken at one haul. The kinks taken comprise half a dozen varieties, from the conglomerate to the alluvial.\n\nA hurricane from the west visited this section on Wednesday, and brought down a prairie fire that had been started for some time. The fire swept through the town at lightning speed and had all but caught in Mr. Clark's hay stacks who had had his hands full trying to get out to fight the fire. Had it once got hold of the hay nothing could save the town.\n\nGENERAL NEWS\n\nCANADIAN\n\nMount Rose, of Regina, who have just returned from the Wood Mountain District, report that a band of five hun-dred cattle belonging to the Wood Mountain Ranch, near the town of Milk River country. This herd was supposed to have perished during the heavy snowstorms of last winter.\n\nThe Royal Canadian Academy, Mon-treal, closed on the 7th.\n\nSir Wm. Young, ex-chief justice, died at Halifax, N.S., on April 26th.\n\nThe recent scoundrel discoveries in the Quebec Mercury libel suit regarding the way conductors have been lied by politicians have led to the demand for a royal commission enquiry.\n\nA drowning accident occurred at Ma-gpie, Qu'Appelle, by which three people lost their lives.\n\nThe Governor General and Lady Lans-downe held a reception at Government House, Toronto, May 7th.\n\nYakima, an Indian, was maliciously shot and killed on a reserve near Dalhousie, Man., on the 7th, by an Indian named Thomas.\n\nSt. John, N.B., has been visited by a severe flood.\n\nPov, Gunner, T. E., died suddenly at Ottawa on the 6th.\n\nVancouver will celebrate the Queen's birthday on Dominion Day.\n\nThe Canadian Manufacturer comes out strongly against Mr. Wilkie's proposal for commercial union.\n\nWork will be commenced immediately on the South St. Marie bridge.\n\nThe strike, caused by the stonecutters' strike, Toronto, has been broken, several of the masters having given in.\n\nThe Liberal country press throughout Ontario is in favour of immediate action in regard to the men in the Toronto shipyard.\n\nByron Landry, of Montreal, was drowned while swimming near Almonte, on the 6th.\n\nTridel, chief of the water police, Qu'Appelle, is the second victim of acts of perjury.\n\nJ. K. MacNeil, North-Westerner R.R., was murdered by a man named Shaw.\n\nA terrific wind swept the country near St. Vincent, Man., last week, wrecking buildings and demolishing chimneys.\n\nAMERICAN AND FOREIGN.\n\nNo credence is given to the reported Franco-Russian alliance in English min-isterial circles.\n\nThe French trans Atlantic steamer La Champlain collided with the steamer Ville de Rio, near Havre. The pas-sengers and all cargo were saved.\n\nNearly two million pounds of tea were sent from Hiago, Japan, to the Canadian Pacific terminus last year.\n\nThe Australian colonies have resolved upon a common treaty to exclude French convicts from admission to Australia until France abandons her plans in re-gard to the settlement of New Hibernia.\n\nA meeting of the Colonial Conference was held on the 9th, at which a resolu-tion relative to laying of the sub-marine cable between Vancouver and Aus-tralia were agreed to.\n\nAt London a handsome calf in a stable, Hammersmith railway station, was killed by a collision with a van. Flying crawled out of four limbs.\n\nThe Chinese government have ordered that every foreign missionary in China must hold a passport from his own Gov-ernment in order to show his nationality.\n\nGladstone gave a banquet on the 7th at which Earl Spencer, Baron Wolse-ley, T. T. Sullivan, Justin McCarthy, and several English, Irish and Scotch members of Parliament were present.\n\nTHE FOX CHEATED.\n\nFrom the Press for the Times.\n\nA fox rushed for persimmons (this fruit is much relished at the foot of a tree. He was about to throw himself upon her when he heard the noise of a drum somewhere near. It was the branch of a tree which vibrated by the violence of the wind, were moving more. \"Oh, Oh,\" the fox thought, raising his head. \"Are there any fellows around?\" \"Who ever you are, by the noise you make you seem to have more feet on you than a dog. That is very extraordinary. I have eaten so many that I have had the gout for a long time. You shall have none of mine.\" \"I have eaten so many that I have had the gout for a long time. You shall have none of mine.\"\n\nThe prudent man does not quit the real for the imaginary. That which is most solid, neither the most advan-tageous.\n\nNotice\n\nAll persons indebted to the undersigned for work done in the West End Blacksmith Shop Michel Scheer's old stand will please call and settle immediately, as I wish to close up the business connected with that shop.\n\nISAIAH MCCOLL.\n\nGRAND UNION LIVERY STABLE.\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nTHE STAR KIDNEY PAD.\n\nA Permanent Painless Cure for Kidney Diseases and Allailles of the Kidney. For Sale by all Drug Dealers. Ask for Attendant Complaints—causing Pain in Kidney, Back, Legs, etc., also for Urinary Disorders such as too frequent Urination, Difficulty, Painful, or too Copious Urination, and for Kidney Stones and Secondary Urine. Important symptoms are often caused by these diseases, and are common to the Urinary Secretory Organs. Made by Star Kidney Pad Co., Toronto, Canada. Sold by all Drug Dealers.\n\nA. CLARKER & CO.\n\nMoore & Macdowall.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nRussell & Davis.\n\nWholesale & Retail Butchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and Game in Season.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETTY.\n\nPublisher and Proprietor.\n\nMcIntosh & Gerfond.\n\nSeason 1887\n\nPoscorron\n\nA Black French Canadian, will stand four days in each week.\n\nTuesdays, Wednesdays, Thurs-days and Fridays.\n\nTHOS. SCOTT'S STABLES,\n\nAt the Ridge.\n\nSeason commences April 27th and ends July 3rd.\n\nPoscorron is noted as the finest roadster in the North Western Territories. Is of the breed known as the French Canadian. Harris Street, Que., 17 years old. Was given to the celebrated French Canadian horse trainer, Mr. Gerfond, by Mr. Scott in 1877, and was sold at the age of 21.\n\nTerms made known on application.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nOver 16 feet extra\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTHE BATTLE OF RATOCHIE\n\nLast Thursday was the second anniversary of the storming of Ratochie by the troops under Sir Frederick Middleton, and we thought it would be a good idea to pay our respects to those who fell in the battle, and to give them publicity, recalling and commemorating, as they ought to be, the brave men worthy of remembrance. It will be remembered that Ratochie was attacked on the 12th of May, and the battle closed on the 13th, after three days hard fighting.\n\nThe day before the fight they sought\nWith skill and shot,\nTheir foe to slay.\nFrom out their lair\nThey came not forth.\nThree days I say,\nThey marched away\nTo seek the fray.\nThe drive from out\nTheir stronghold,\nBackward rolled\nNor scarcely knew\nTheir way.\nThose western men,\nRatocchie's sons,\nTheir friends beside,\nAnd none behind.\nAnother night,\nAgain the light\nWas seen to rise.\nThe \"forward\" sounds\nAnd bugles blare,\nInto the fray.\nThrough broken bread\nThey came to race.\nSouth led the hall;\nWest came the star.\nThe sounds of war\nWere heard afar.\n...a third to fight\nWith all their might\nAnd all their will.\nThough friends be foes\nAnd brothers die,\nThey all shall die.\nAnd they have sworn\nA solemn oath\nOn the field below.\nInterlocked they fall.\nInterlocked they fall.\nSo they sped,\nThus came of red\nAnd black.\nWhile each wild note\nWas heard.\nThey answered loud.\nOnce drew the share\nOf death and pain.\nWhile horror still\nThe earth did fill\nAs dust and dust\nInterlocked they fall.\nThen came the wind\nEach man its hand—\nAnd thus they came\nAnd with it died.\nPoveshell's sword\nThen they returned\nSoon sank the star\nThat shone so fair.\nThat western sky\nAbove the strife\nThe flag was flung.\n\nHENRY T. McINTYRE\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Town Council took place last evening. Present—Councillors Agnew, Bain, Buttenher and Stewart.\n\nThe minutes of the last meeting were read and adopted.\n\nCOMMUNICATIONS\n\nwere received from Mr. Woodman concerning land sales license and Percy Domingo concerning Catholic cemetery.\n\nJ. L. Sabinson & Co., No. 85; and J. D. Marcey, $40.50. Adopted.\n\nJ. L. Sabinson, Chairman of the Finance and Assessment Committee, reported that the sum of $300 had been granted the Lower Agricultural Society, said money to be used in purchasing land or erecting permanent buildings.\n\nIt was also that the following resolutions be adopted:\n\nJ. L. Sabinson & Co., No. 85; and J. D. Marcey, $40.50. Adopted.\n\nThe Special Committee appointed to confer with the Board of Works and to secure a building ground report series.\n\nCouncillor Bain reported that he would introduce a by-law to build and maintain sewers, drains, ditches and water courses.\n\nThe Council then adjourned.\n\nMurder or Suicide?\n\nPeter Smith Found Dead near His House with a Bullet Hole in His Head.\n\nEnd Play Suspected.\n\nPeter Smith, who at one time carried on a bakery in Prince Albert, was found dead near his residence, about two miles north of Touchwood Hills, by some freighters, on the 6th inst.\n\nDecember 1st being a stopping station, Peter Smith visited Prince Albert, and was living entirely alone, his only companion being two faithful dogs. The next morning he started early in the day on his way to Prince Albert, who, on arriving at the stopping place, found the body lying on the ground.\n\nThinking it strange that the house should be open and trembled he made a search of the premises, but could find nothing except his clothes, which were neatly hung up.\n\nHe then proceeded to the scene of the tragedy, and with some difficulty on account of the snow, succeeded in raising the body of the deceased, and was immediately sent to Dr. Doll, of Q.Apple, to come and see what could be done.\n\nMr. Wm. Dewey, of Prince Albert, who was on his way here, also saw the body, and made a thorough examination of the dogs, to ascertain if closely. He also states that he was warned on his way home by Q.Apple by Mr. Buttenher to look out for strange looking dogs near the Salt Plains.\n\nFor weeks Peter Smith refused to disclose any facts connected with the case, whether deceased met with foul play or took his own life. The fact that he was parted with his wife and children, and had no particular friend, while the fact that a string was attached to the trigger of the gun, and that the bullet hole in the mouth would suggest suicide. It is possible, however, that the string attached to the gun may have been there for the purpose of hanging the weapon on the wall, and that the deceased meant that he was about to commit suicide. He had been very ill for some time, and had been confined to bed for some time, and to this fact and his lonely state of life is doubted that the string was there. He was a bachelor, was in Winnipeg, and was an Englishman by birth, though he had been in Canada for some years.\n\nBoston Young Lady—Yes, sir, while visiting in the country last summer, I met a young gentleman, whom I never want to forget.\n\nDealer—May I ask what that—er—gentleman was?\n\nBoston Young Lady—Oh, yes, I made a fumblesteak for a blackberry.\n\nThe new American has been more honest with dinner, and has been less butter flick, creaked back and lazy legs upon the table.\n\nIt is said that the ex Express Engineer still bears the traces of great and delicate feelings, almost resembling her age and mystery.\n\nA man committed suicide the other day, and left a paper which he did not sign. The paper was not good for him. The jury thought this conclusion was correct, and that the man was in a state of delirium.\n\nThe Princess of Wales is always on the side of common sense, and is having her hair cut by a hairdresser. She is dressing, and has set aside to make a trip around the world that ought to be widely known.\n\nMiss Susan Wood, who was recently awarded by the London University the teachers diploma in the art, theory and practice of teaching, is engaged to teach third year women who have won the distinction.\n\nPatry's recent season in New York was a great financial success. The total result was $80,000.\n\nDress Goods, all shades Irish Diaper Linen, India Linen, Muslins, Nuns' Veiling, Silk Gloves, Cottons, Ginghams, Prints, Wincies, Ladies Jerseys Boys' Jersey Suits, Ready-made Clothing.\n\nFROM FOUR YEARS UP—AT R. C. WIGMORE & CO'S.\n\nBuffalo Hall!\n\nNEW SPRING GOODS WILL ARRIVE NEXT WEEK.\n\nALL GOODS NOW IN STOCK REDUCED.\n\nClearing Sale will continue until New Goods ARE OPENED.\n\nBETTS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware,\n\nHouse Furnishing hardware\n\nCarpenters's Tools,\n\nPaints and Oils,\n\nBarbed Fencing Wire,\n\nStoves and Tinware.\n\nALSO A FRESH STOCK OF Groceries, Teas, Tobaccos, Etc.\n\nCALL AND GET PRICES\n\nJ. R. McPhail.\n\nTHE WEST END STORE\n\nJUST ARRIVED.\n\nNEW GOODS AT CHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades. Persian Paper Bags, Tapstry Carpets, Chinese Key Wraps, French Linen in all colors, Face Masks, French Hats, Umbrellas, etc., etc., etc.\n\nEmpress Cloak in Blue and Green.\n\nLadies' Felt and Embroidered Bonnets, Ladies' Fancy Umbrellas, Beige Veiling, Ladies Silk Taffeta Shawls.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Bath Garments, Ladies' Corsets, Biscuits, Eggs, Dates, and Thread Goods of all kinds.\n\nInspection is ordered.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887052001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5760, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5662, 1], [5662, 8665, 2], [8665, 16728, 3], [16728, 23928, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]