[{"id": "d9d502e8ba60ef0b9ea6380671ec41813eddb03a", "text": "THE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. ALBERT'S ST. MARY'S (Churches)\n\n11 A.M.: Services in both Churches\n\nST. ANDREW'S (Church)\n\n11 A.M.: Service in Church\n\nST. CATHERINE'S (Church)\n\n11 A.M.: Service in Church\n\nST. PATRICK'S (Church)\n\n11 A.M.: Service in Church\n\nST. JOHN'S (Church)\n\n11 A.M.: Service in Church\n\nST. JAMES' (Church)\n\n11 A.M.: Service in Church\n\nST. PAUL'S (Church)\n\n11 A.M.: Service in Church\n\nMETHODIST CHURCH\n\n11 A.M.: Service in Church\n\nTHIRD SUNDAY IN APRIL\n\nNEW YORK\n\nFRIDAY, APRIL 27, 1888.\n\nTHE LATE HON. T. WHITE\n\nThe Northwest, in common with the rest of the Dominion, is called upon this week to mourn the loss of one of Canada's noblest sons and greatest patriots. The news of the death of the Hon. Mr. White fell like a thunderbolt on the people of this place; people of all races and creeds and of all political parties are sorely grieved at his unexpected demise. In the Northwest Territories he was a true friend and one of our most patriotic public men. He was pre-eminently a Canadian, and although a strong party man, he did not go so far as to make the general welfare of the country subservient to the exigencies of party. The party to which he belonged has lost one of its brightest ornaments, and the Parliament of Canada has lost one of its ablest debaters that ever took part in its discussions. Mr. White was of Irish parentage, and was born on the 9th August, 1858, and was educated there. In early life he engaged in mercantile pursuits, and the words spent in the pursuit of study of law was a member of the Grammar School Boards in Hamilton and Peterborough, and was for a number of years a representative of the Mounted Police Board. Trade in the Dominion Road, and for three years was a member of the Executive of the Dominion Board and represented the latter for five years on the North-West Board. Trade in the United States. He was one of the ablest newspaper men in Canada, and founded the Peterboro Review in 1865, acquired the Hamilton Spectator in 1865, and in 1873 the Morning Star of Toronto. Mr. White has been the chief editor. He was three times an unsuccessful candidate for the House of Commons and was first elected as member for Carleton, in 1878, when he held until his death. He was also a member of the Privy Council and appointed Minister of the Interior.\n\nNOTICE\n\nIn the Supreme Court of the North-West Territories, Judicial District of Saskatchewan, before Mr. Justice LEPH. B. EVANS, Plaintiff,\n\nUpon application of the plaintiff, and by consent of the defendant, I do order that service of a copy of the said application be made on the defendant in this action, by posting up in the office of the defendant, a copy of said summons and of this order, and by mailing a copy thereof by registered mail, postage prepaid, to the defendant at his last known address.\n\nDATED AT REGINA, this 20th day of April, 1888.\n\nT. H. McGUIGAN.\n\nADVERTISERS\n\ncan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 100 Broadway, New York. Send 10¢ for 100¢ postage.\n\nOffice Stationery, etc., etc.,\n\nTHOS. O. DAVIS\n\n'88.\n\nNOTICE!\n\nT. J. AGNEW takes stock and Closes his Books on 30th of April. Parties indebted to him would greatly oblige by arranging their accounts previous to that date.\n\nUntil said date all goods will be greatly REDUCED for CASH.\n\nFULL LINES ON HAND OF\n\nBREAK PLOWS, CROSS PLOWS,\n\nIRON HARROWS, GARDEN TOOLS, COAL OIL,\n\nBOSCH CHURNS, MILK PAILS, CREAMERS,\n\nBUILDING HARDWARE\n\nAT\n\nT. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\nNOTICE\n\nMISS AULD\n\nHas been informed by the ladies of Prince Albert that they will meet at the Town Hall on Monday evening at 8 o'clock.\n\nFirst-class Dress & Mantle Maker\n\nIn the West, will be able to execute all orders promptly and in the latest style.\n\nFOR THE Best Assorted Stock\n\nor\n\nCONFECTIONERY\n\nGO TO\n\nH. MACDOUGALL'S BAKERY.\n\nVICTORIA Livery and Boarding Stables.\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of the travelling public to these commodious stables.\n\nWell and river water almost the drier.\n\nWe have added some fresh horses to our stable, and assure the public that they can depend on getting as good a horse as they may want at reasonable prices.\n\nHorses taken at reasonable prices.\n\nH. MacDougall\n\nJ.M. CAMPBELL\n\nDRESSING ROOMS\n\nA LARGE STOCK OF Watches,\n\nClocks and Jewellery\n\nKEEP CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nDUNN'S BAKING POWDER\n\nTHE COOK'S BEST FRIEND\n\nFor sale by wholesale and retail grocers.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness in design and quality. The Variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock.\n\nNo trouble to show Goods.\n\nJ.M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nCHURCH CONCERT.\n\nThe leading song of the evening was the concert which took place in Prince Albert on Friday night. The programme was arranged by Mr. Jones, and the church was filled to its capacity. The programme included a number of songs, a recitation, an address, and a musical selection. The performance was excellent, and the audience was very appreciative.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER--Hop--ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERROND\n\nGO TO CANN'S BOOK STORE\n\nFOR STATIONERY, SCHOOL BOOKS, ETC. ETC.\n\nGRAND UNION LIVERY STABLE\n\nOpposition is the Life of Trade.\n\nA First-Class Livery Feed and Sale Stable.\n\nWe would like to invite the public to visit our stable and see the fine stock of horses we have on hand.\n\nWe keep the largest and best Livery Stable in the city.\n\nOur horses are well fed and well cared for.\n\nWe have a large selection of harnesses and saddles.\n\nWe also have a large selection of boots and shoes.\n\nFor further information, please write to:\n\nDonaldson & Pembroke.\n\nPaine's Celery Compound\n\nBUFFALO HALL!\n\nSPRING CLOTHING!\n\nHATS HATS HATS\n\nIn Endless Variety. Among which no second class dealer, old stock will be found, but all fresh New Goods direct from the new houses.\n\nBETTS & GWINNE.\n\nR. C. W. & Co.\n\nClearing Sale!\n\nWe beg to notify the people of Prince Albert and vicinity that we have decided to dispose of our entire Stock of Ready Made Clothing, Dry Goods, Groceries, Glassware and Crockery.\n\nAt prices which cannot fail to satisfy intending purchasers.\n\nAll parties indebted to us will please settle at once as our books are closed.\n\nR. C. WIGMORE & CO.'S.\n\nROBERTSON & ROBERTSON.\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nMONOPOLY BUSTED.\n\nCENTRAL STORE\n\nClose of the Season for Winter TRADE.\n\nThe Annual CLEARING SALE is now going on.\n\nDuring my absence I have instructed Mr. St. Louis on ordering everything in the store to make room for Large Importations.\n\nMany of these goods are on the way.\n\nAll the supplies winter stock will be sent out, but the cheapest boots and shoes will be sold at prices that will astonish you.\n\nDon't forget this sale. It will repay you.\n\nW. R. FISH'S\n\nCENTRAL STORE", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888042701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 2272, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3822, 2], [3822, 5805, 3], [5805, 8269, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]