[{"id": "8cd8ff6299e99f1088661e97a4c9022b6f087fc8", "text": "THE PRINCE ALBERT TIMES\n\nWEDNESDAY, SEPTEMBER 5, 1883\n\nTELEGRAFIC\n\nAs we expected, the strike is ended; the result being a victory for the miners. The men of this district have been able to crush their opponents. Some of the strikers have gone back to their old positions, while a large number of them will be left without employment. In every way, with regard to news, it may be interesting to know that John W. Mackay, the great bonanza king, who counts his fortune by the million, holds a controlling interest in the millions worth of stock in the Postal Telegraph Company, which is likely to prove a formidable rival to the Western Union, as a contemporary says Mackay never does anything by halves.\n\nPROTESTED ELECTIONS.\n\nFrom the description of the stage in the recent election, it appears that the MacKenzie election law is of the most stringent kind. Mr. Phelps of West Sioux has been unseated because at one polling place fire drums and drums have been given to the voters, hence the Conservative and Reformers, after they had voted. This may appear in the eyes of many a more than unnecessary stringency law, but this is not so. One notable result of the law is the absence from bribery generally as shown in the cases already tried as compared with similar actions under the previous Acts. As yet only one case before the courts in which there seems to have been any direct attempt at bribery is that of Muskego, where the infamous charges are said to have been taken by Mr. Shields, so far he should not convict Shields, although evidence of corrupt practice is abundant, and if for no other purpose than that of revealing more fully how much expense it is to be feared that Mr. Shields will produce his case against the Globe. It is to be regretted that Mr. Shields and other material witnesses in the Muskego case are not forthcoming.\n\nRAT PORTAGE.\n\nIt is only with the greatest difficulty that we can gather from our eastern exchanges any correct idea of the condition of affairs there. They, with a few exceptions, seem to look at the question almost entirely from a party standpoint. One very desirable change has evidently come to pass. The constant appearance of newspapers that the citizens are poor game, have taken to arresting each other. An Ontario constable having arrested one of Manitoba's officials for being drunk and disorderly, has since been arrested by a Manitoba constable on a charge of making a false arrest. When so little information of an authentic character can be obtained, the following extract from a letter from the Rev. Dr. Cochrane to the London Advertiser will be of interest:\n\n\"At Rat Portage I met with leading men of both Manitoba and Ontario parties. The result of a meeting of the representatives had been held, at which, by a very large majority, the proposal was made to incorporate the Dominion of Canada. Both parties admitted freely that full justice had been done them, and that representatives of both parties had been present. There was an opportunity to state their case without interruption. While those who favored the union were convinced that the union must be of some kind, those who opposed it were convinced that the union must be of some kind.\"\n\nMr. Norquay himself, in his published address two years ago, frankly stated that he would be willing to consider the matter regarding which he or the people of Manitoba need concern themselves or which might affect the future relations of the Dominion or Ontario. Nor does there appear any reason for a change of opinion. This question, however, is one of interpretation between the Provinces, will not be settled if a hasty a settlement of the preliminary question, which will but lead to complications and will no longer be as simple.\n\nWith all due loyalty to the Crown, therefore, we say that it is evident that after the matter has been submitted to an impartial tribunal of arbitrators there need not be any appeal to the Privy Council, nor declaration made by either party, when every party may be favored, will not carry on matters as the matter of national importance, and will be individually interested in its prosperity.\n\nIt is abundantly by all that whatever the present government may do, the Red River, and whatever measures have been inaugurated towards the setting up of a separate province, will be nothing but the Dominion government has done next to nothing. For the best interests of the people of Manitoba and Ontario and that the peace may remain on terms of the sincerest friendship, it is earnestly to be hoped that further conciliatory measures will be adopted, and that the question of this disputed district is finally settled.\n\nA FEW WORDS OF EXPLANATION.\n\nGeorge F. Peck, of Milwaukee, is carrying on a right-handed business at a big saw mill hereabouts. He has been bothered almost to death with anxious inquiries about the nature of the trouble the lumber yard is in. He has issued the following, addressed to \"The general questioning public\":\n\nThis is a test. Not a carbuncle. Just a test.\n\nI know you have had bills larger than mine, but this one is big enough for me. I don't want too big. I don't want the biggest bill.\n\nYes, I have tried this seed, bread and flour. It is slippery elm positions. Each is better than the other, and all of them are frauds.\n\nNo, the \"Red Eye\" has not been playing up to its name. This is no joke.\n\nYes, I think it is common sense working out of me.\n\nYes, it has broken. That is it, it has made an assment.\n\nSo I don't want another—Er.\n\nLorraine Patrick, D.L.S.\n\nTimber Limits Surveyed and all kinds of surveying done on shortest possible notice.\n\nWork let at reasonable rates & Co. will receive attention.\n\nLORRAINE PATRICK, D.L.S.\n\nPRINCE ALBERT, N.W.T.\n\nGeneral Merchants and Indian Traders,\n\nPRINCE ALBERT, N.W.T.\n\nS. W. VANLUVEN\n\nGRAND CHANCE.\n\nTHE PRINCE ALBERT Planning Mills and Sash & Door Factory\n\nFOR SALE.\n\nThe Machinery consists of:\n\n1 Surface Planer,\n1 Matcher,\n1 Jointing Machine,\n1 Sticker,\n2 Saws,\n1 Mortice Machine,\n1 Turning Lathe,\n1 Jig Saw, etc.\n\nAll new except power.\n\n20-horse Power Engine,\n20-horse Power Boiler.\n\nThe Building, 30 x 35 ft.\n\nFour Lots, 30 x 132 ft.\n\nWill be sold separately or with machinery.\n\nTransportation Co.\n\nTHE STEAMERS\n\nMARQUIS, Capt. A. R. Russell.\n\nNORTHWEST, James Sheets.\n\nWill form a WEEKLY LINE between Prince Albert and Edmonton, with connection with the Steamer Princess for Winnipeg.\n\nTHE STEAMERS\n\nNORTHOPE, Capt. Jerry Webber.\n\nMONTGOMERY, Capt. Jerry Webber.\n\nMANITOBA, Capt. Jerry Webber.\n\nWill form a WEEKLY LINE between Prince Albert and Edmonton, with connection with the Marquis and North West.\n\nTHE STEAMERS\n\nLILY, Capt. J. S. Seyra.\n\nWill run between Prince Albert and Medicine Hat, during the season of Navigation, connecting with the steamer Princess for Passage and freight at reasonable rates.\n\nH. SWINFIELD, Mgr.\n\nNo. 10, Main Street Building, Winnipeg.\n\nGRAND UNION Livery & Sale Stables,\n\n4 Nobel Street, Prince Albert.\n\nHorses and Buggies always on hand.\n\nOrders for double teams promptly attended to. Charges moderate.\n\nThe only first-class Livery in the Town.\n\nA line will await the arrival of all regular trains to convey passengers to any part of town.\n\nS. J. DONALDSON, Prop.\n\nPUMPSI\n\nFrom Proof Pump Manufactory.\n\nWells, Pumps and Pumps set. Urgent Jobbing Done.\n\nAcorn & Cross,\n\nFarmer's and Victorian Streets,\n\nPRINCE ALBERT.\n\nFARMERS ATTENTION!\n\nA. Harris & Co. have delivered and will deliver the following implements over land into the Saskatchewan River Valley:\n\nBrantford Reapers,\nBrantford Mowers and Rakes,\nSnowball & Spight Wagons,\nStubble and Cross Plows,\nA Large Stock of Repairs.\n\nTOGETHER WITH\n\n20 Brantford Cord Binders,\n\nWhich are now fitted at the Works of the Brantford Co., and will be guaranteed to be in perfect order when delivered.\n\nA competent person is now attending to the sale of these machines here to operate and repair.\n\nSTEWART & WOOTTON,\n\nGeneral Merchants.\n\nWholesale and Retail.\n\nSaskatchewan.\nBECOMING FLESHY.\n\nMrs. Mulkitte - Can't Mr. Peter be told not to be so fat.\n\nMr. Mulkitte - I'd like to know what would be the matter with this visit,\" said Mr. Mulkitte early morning, as he looked at his wife. \"It seems she was in such nervous manner which really needs sympathy, and is never thoroughly understood by a spectator.\"\n\n\"Which visit?\" thoughtfully asked Mrs. Mulkitte.\n\n\"Why this is one, of course. You certainly don't think that we'd work like she does when we've got other work as a subject of conversation, do you?\" and he covered himself again.\n\n\"The visit is too small for you, Mr. Mulkitte.\"\n\n\"I don't see how it can be too small for working fat.\"\n\n\"Yes, but you haven't worn it since last year, and you must remember that you're getting fat.\"\n\n\"Pfft!\" exclaimed the innocent gentleman, tossing his almost contemptuous eyes up his head. \"Getting fat? Emily, do think that tiny thing can be the silliest body, do? I love you.\"\n\n\"I did not intend to wound your pride, but the truth is plain. Anybody can see that you've been too big since you were here last.\" Of course, it's too late,\" and, incensed to his utmost, Mr. Mulkitte turned and glared at his wife.\n\n\"Oh! I don't know that I have committed or seen that your manner should be demanded in a manner so violent, but I can tell you. At the racetrack the other day I saw Mulkitte, and to me, 'Who knew that fat Mulkitte is getting.'\"\n\n\"Recklessly! Why, he couldn't talk. He had to go to a bane walk.\"\n\n\"Yes, he knows that, and during the conversation with me he declared, that was my married life. Fat!\"\n\n\"He didn't! I always knew that he was a fool, but I did not know that I was given to downright lying. I shall show how to keep him in the house and that unique manner of his, till the next town he ever learns to attend to their own belongings, and he'll be a point to go around and talk about somebody getting fat. Fat I hate that word; and I'm not users of it.\"\n\n\"It makes no difference, rejoined Mrs. Mulkitte, winking at her son, who seemed to hear her, and saw how my object is. The physician declared him to be fit for death.\"\n\nThere goes that fat preacher's wife.\" I won't be angry.\"\n\n\"Oh, look, you make me tired, and the same thing all over. Peter took a seat at the window, and looked down the street.\n\n分子 (E) = sin(x) + cos(x)\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\nThe Times contains all original matter.\n\nAdvertise in The Times.\n\nAnd have your Advertisement read by all.\n\nReplete with local and general news.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads,\n\nBill Heads,\n\nEnvelopes,\n\nCirculars,\n\nDodgers,\n\nBusiness Cards,\n\nLegal Printing,\n\nPamphlets,\n\netc., etc., etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET, PRINCE ALBERT\nFROLICSOME GIRLS\n\nHas a Dude Pared his Female Colleague?\n\nTwo citizens, not very old, were walking in a certain part of town when they began talking about coming entertainments, when one said, \"Let's go up to the Female College and see what they have in their amusement exercises. There is nothing I like better than to see girls who are just learning to be ladies, and to hear them listen to the ideas they advance in their addresses, which are far beyond their years.\"\n\nThe other man pulled on his spectacles oftentimes, while there was a faraway look in his eyes, and he finally said, \"Not any Female College for Great Grandpa. Never heard of such a thing. I had no experience at a female college. Several years ago I lived in Chicago, and I had a cousin who went there. She lived only a short distance from the city, and on Saturday I went up to the college to see her, and also for the day. You wouldn't think it, but she was a regular teacher. I was a regular teacher. I was not exactly a dude, but I was got up regularly with a white pants, a black coat and vest, a Panama hat, linen overcoat, a high standing collar, and cuffs that came down to my fingers. My cousin was glad to see me, and she said, \"Hello, and it seems like we haven't seen each other for ages.\" The other girls were all glad to see me, for it was not often that a live male man was allowed to enter the gates of the college teachers had all gone to Chicago, on a shopping expedition, and the girls were on duty. They had been told that I was a dude, and I was glad to them. I met my cousin in the reception room, and the girls came out to see me. They were all introduced, and before I knew it there were fifty of them around me, and I never felt so good in my life. I gave them a good deal like the dude in the opera of 'La Traviata,' where all the girls yearn for him, and they all have one of my chaps that beautiful evening for the opera of Vanderbilts. Before night I would have sold every fifty cents, or would have given my money away.\n\nFirst a beautiful blonde girl wanted me to allow her to draw a picture of herself in my shirt coat, and I thought it would be a good thing to have her there, where I could see it constantly, and I gave her a commission to paint it, and she did it. Then another, the blindfolded me and fit me up; consequently I thought it would be all right, they took a picture of me, and my picture made me promise to let it be sold until they gave me permission. Well, for an hour I sat there, and I looked through what they pleased, with me, and got so nervous I could hardly sit still. I could feel the touch of a gentle hand on my neck, while there was a constant snicker among the girls, and after while they took the bandage off my eyes, and looked at me at least a minute. Well, I was mad enough to bite every girl in the room. After a dance, girls stood around with paint brushes in their hands, and painters ran their thumbs through, and mix paint on, and they had painted my eyes, and they had painted my nose, and they had painted my lips, and they painted a black moustache on my lip, with terra cotta ends, and a sky blue lip, and they had painted my eyebrows low. They had painted a picture of a galvanised girl on my shirt bosom, my right shoulder, and they had drawn a long ear, my calf was a solid drumstick with two fighting roosters, and my white pants were painted with a representation of a comet in the Black star, and my white coat was the worst. You have never seen such a picture painted along, where they try all the colors of the rainbow. Well, the back of my coat looked like the back of a paint shop, only the artist had got a little bit of color on it. He had put a plague, in the center of which seemed to be a hot chili, looking around for wages, and he had put a sign off, if I should have got out of there in all the paint with which I entered I would have been able to make me take me out on the grass and play with me, and swing me in a hammock, but I wasn't able to do anything, because the girls looked out of the window, gasping and hanging signs of distress and they all continued to laugh and say things, and before I could look up, my eyes were filled with tears, and the face of the female teachers came into the room, and they came from the other side before they had been called, but they looked at me! Well, I should remark I tried to explain, but they would not listen to me, and I was forced to run away. The cousin spoke of me only once in my mind, and she had made other arrangements about relatives and didn't want me no more, and I went out into the wide world, a poor, lonely dude, and was never seen again before.\n\nAddress by Artemus Ward.\n\nArtemus Ward, after delivering a lecture once in New London, Connecticut, asked the principal of a young ladies' high school in the place to pay a visit to the institution the next day. He said, \"This is the first time I have visited this girls' school. While walking to the schoolhouse a short runaway occurred. A horse bolted, and Artemus Ward jumped on it, with what Artemus called the \"forequarters\" of a wagon clattering at his feet. Artemus Ward then proceeded slowly unhurt by its actions. Said he:\n\n\"The vehicular displacement which has caused me to be here today has for months been a timely object of ridicule. Young ladies' seminaries are ever exposed to the ridicule. Once while dealing with a school I met upon a female student who was indolent, and loafer too, as well as a very naughty. Many proper young ladies' schools are now being opened in the ground. \"Free!\" exclaimed. \"None of that, replied a solemn voice from the crowd. \"There are plenty of young fellows running off with their coquettes.\"\n\nThere is constant entertain-\n\nment in the schoolroom, however, if attached to a wagon, that is, if securely attached to it, will run away with the young ladies' school attached to a young woman, the school will run away with her, leaving no trace behind.\n\nHAD BEEN THERE.\n\nIt was on the elevated railroad the other morning when I was seen to smile merrily. I looked back and saw a seat, filled in all pockets, and gave vent over the loss of something or other.\n\n\"Have you lost your wallet?\" queried the man next to him.\n\n\"No.\"\n\n\"Had your watch taken?\"\n\n\"No.\"\n\n\"Lost a roll of bills, perhaps?\"\n\n\"Yes, I've lost my check book. I believe I left it at home. Dear, how careless I am!\"\n\n\"Hungry he swore,\" said the other in his smiling tone.\n\n\"I don't know how it could be,\" said the other. \"My wife will sit down and figure up the stubs, and when I go home I shall have to give her a half hour to make her believe this 'trick' of hers has anything to do with housework.\"\n\nA SHARP GIRL.\n\nJos. Hildebrandt, of Saskatoon, went to Washington hurriedly, without his trunk, finding he had got to remain there some weeks, telegraphed home for a trunk and his little daughter, opened the package and packed the trunk, and had it sent to papa. When he opened the trunk he found a number of letters, a winter coat, a bath towel, a bottle of whiskey, a pack of cards, and a writing book. Afterwards it was said he had sent his child for sending so many shirts.\n\nPUBLIC NOTICE IS HEREBY GIVEN\n\nThat the following brands of beer on the hop list are now being served in this establishment, and all patrons are warned against purchasing any other beer in their possession unless authorized in writing by the officers of the Department of the Interior.\n\nK. DEVILLE\nChief Inspector of Alcoholism Survey\n\nJUST RECEIVED\n\nBY\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING ST. WEST,\n\nNEXT ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\n1ST PRIZE WHEREVER EXHIBITED.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nJOHN WYERSKIRCH, PROP. PRINCE ALBERT N.W.T.\nBREWERY.\n\nWe notice in the last number of the Regina Leader that Mr. Macdonald has presented an application to the Hon. Colonel Smith, the Minister of Con- scription, that the Manufacture and Sale of Spirit for a beverage, beer, wine, or porter in this district be prohibited. This application is now being considered by the authorities. We believe that the manufacture of beer and wine is a profitable industry which will benefit the people of this district. We therefore urge them to support this application.\n\nDEATH OF MR. ANDERSON.\n\nWe regret to inform our readers of the sudden death, though not unexpected, of Mr. W. M. Anderson, of St. Andrews, Man. The deceased was in the employ of the Winnipeg and Western Transportation Company, and resided at the Stonewall Northpoint. A few weeks ago he was taken ill, and did not have the strength to go to work. He decided to move back to his home town. Last Saturday he left for Toronto with the company's agent, Mr. J. McNally, accompanying him. When they reached near the mouth of the Red River, they camped for the night. Mr. McNally went to sleep, and when he came to, he saw Mr. Anderson lying on the ground. He called out for help, but there was none. Mr. Anderson died shortly after.\n\nThe coroner's inquest into the cause of death revealed that Mr. Anderson had been drinking heavily before his death. It is believed that he died of alcohol poisoning.\n\nJ. L. JOHNSON & CO.\n\nHAVE A FULL STOCK\n\nPowder,\nShot,\nGuns,\nHarvest Tools,\nBuilding Hardware,\nPlaster and\nPlastering Hair.\n\nHORSE SHOE STORE,\nCAMPBELL'S BLOCK.\n\nSelling Off!\nSelling Off!\n\nNow is Your Time to Get Good Bargains\nCall and See, as We Must Close Out\n\nTHOMAS O. DAVIS.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Bleigh and Outer Runners, Shafts and Tongues for sale.\n\nA good variety of other articles.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nHUGH M'DOUGALL'S BREAD!\n\nBest in Prince Albert\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAUCTIONEER ETC.\n\nPrince Albert\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goulen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Prince Albert.\n\nC.J. BRIGGS, Land Commissioner.\n\nITEMS OF INTEREST.\n\nLatest News by Telegraph.\n\nMons. Emile Forest, professor of modern languages in the Toronto University, has returned.\n\nThe C. A. Campbell, from Collingwood, arrived at Port Arthur Aug. 31st, with 25 passengers.\n\nThe Royal Canadian Empire, from England, arrived at Port Arthur Aug. 31st, with 100 passengers.\n\nAlice Croes, aged nineteen, was brutally killed by four men on Aug. 31st, at Toronto.\n\nJames Malcolm, aged sixty, at one time owner of a grocery store, was found dead Aug. 31st, at Toronto.\n\nRev. Dr. Carberry, Prior of the Dominican Convent at Rome, has been appointed Vicar Apostolic of the District of New Westminster.\n\nAt St. John, N.B., a young daughter of John Price was burned to death by her clothes taking fire, Sept. 1st.\n\nThe Earl and Countess of Carnarvon are guests of the Governor-General and the Prince Louise.\n\nThe Governor-General and the Prince Louise presented the prizes to the successful marksmen in the Dominion Rifle Association Shooting Matches, Sept. 7th.\n\nSeveral thousand copies of books, addressed to the States by three publishers of Montreal, were seized at Room's Post Office, Sept. 1st, by the U.S. Customs.\n\nOn Aug. 31st, at Halifax, N.S., a child was burned to death while asleep in bed; he neglected to extinguish a kerosene lamp which was burning, and the child might have consumed it.\n\nRev. Dr. King, of Toronto, returned from Manitoba Aug. 31st. He will make his decision as to whether he will accept the principalship of Manitoba College, Sept. 4th.\n\nThe French Canadian raftsmen, names unknown, were drowned while coming down the Cascade Rapids, Deseret River, on Aug. 31st, while engaged in removing an island in the river.\n\nTwo French Canadian raftsmen, names unknown, were drowned while coming down the Cascade Rapids, Deseret River, on Aug. 31st, while engaged in removing an island in the river.\n\nA fresh supply of Farming Implements and Tools, Barley and Flour for sale, and all other farm Produce.\n\nHugh M'Dougall,\n\nBest End Bakery.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\n\nHugh M'Dougall,\n\nEnd East Bakery.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\n\nHugh M'Dougall,\n\nEnd East Bakery.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\n\nHugh M'Dougall,\n\nEnd East Bakery.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\n\nHugh M'Dougall,\n\nEnd East Bakery.\n\nHugh J. Montgomery,\n\nReal Estate Agent.\n\nAuctioneer Etc.\nCOMMUNICATIONS.\n\nTo the Editor of The Times,\n\nSir,\n\nAs the good sense of the cattle breeders of the absence of pasture land is generally known, and particularly so in this district, there is something of interest here to chronicle; it will be impossible to satisfy their complaints by the usual means of obtaining a hearing at the present opportunity to ventilate, and seek a remedy for, one of the most serious grievances which has been brought to our notice. There is probably no more legitimate case to which a hearty appeal can be made, and yet it has fallen from your own lips, you must be aware that this discussion, so far as affecting the interests of the cattle community, goes far to constitute its removal forever.\n\nThe adoption of this course, supporting the claims of the breeders, would at any rate result in one most desirable consequence, namely, the restoration of the breeders who have been induced to exercise their talents more particularly affecting the welfare of our cattle, those so far as they may be able to take part in the proceedings of the North West Council or Legislative Assembly. This may be, however, a considerably more distant date, than appears to have been the case hitherto, the object in electing members still all. The question might equally be raised to the importance of one and the same matter requiring attention, but this is not the case, and the breeder himself to be specially in need of redress, and diminishes the advantages which will result from the proposed measures.\n\nAvoiding the example of the sign post which points the road, it does not travel, and cannot be used as a guide, I may now offer, I may be allowed to draw the attention of farmers and other settlers to the subject, which more immediately concerns the former, yet bears directly and impressively upon the interests of the latter also, viz., the establishment of a fence line, absolutely to crops by heavy cattle, and the steps necessary to put a stop thereto. It seems essential to make an immediate estimate, for only an approximate idea of the amount of loss incurred annually, during the last five years, from this source? Take the past five years for a calculation, appear to me that the value of the crops destroyed would at once be seen, and that the loss would be of all. If we could not serve to build a branch line of railway to the C.P.R., we could certainly serve to put a stop to that work in hand. The peculiarly wretched features of this particular case, however, are, that the losses might have readily been prevented by reasonable care with regard to fencing for the purpose therein, and that the loss is not merely partly, but simple, either directly nor indirectly benefiting any one in any degree. Taking into consideration the fact that the owner has asserted that what is one man's loss is another's gain. Many losses might have been prevented by the police, and the economic loss not being essentially hurtful to a community, but greatly destroyed by the want of proper legislation, absolute loss to the owner of the destructive animal, that individual, even in the case of the owner, might be benefited, might as well as for the owner's benefit have filled itself with grass going to the cattle, and thus the owner's loss, the cattle's and man's waste, which by the way no settlement was ever afforded, consequently, the loss must be considered as a wrong, and some penalty be taken to prevent it. It is well worth while to inquire of what nature is of such a way they actually fail to effect the desired end. So far from wasting time, the owner ought to protect his crops by the fences, reasonably substantial fences, which he may fairly build, and which, by the fact that these are caused indirectly to affect others, should be the basis of the law, and would be justifiable in the attempt to attach some penalty to such neglect.\n\nThe question, therefore, consideration is given to the farmer who has been the first outlet for barbed wire fencing, however much cheaper that may prove, but which is not likely to be the case, of such means as, at their command, can be protected from the ravages of cattle, and that the owner of such fences can keep them up. Had we any immediate prospect of county incorporation, as far as we are personally concerned we might regard this difficulty as solved, but in view of the fact that nothing more is being done to incorporate the vast territory, the position of farmers in the Territories becomes one of great importance, and it is in this position to frame their own local laws, whose interests ought to be looked after by them, and not by the government of the Territories, in every necessary form to secure the protection of their property under existing circumstances must appear only to be found in one of two ways. Either by the enactment of a law, or else they must be furnished with more and speedy means of protection by having some workable form of legislation already enforced, some such laws already exist. With regard to the former, however, the possibility has been doubted, but were that settled, general indications point to the belief that the question would be finally disposed of, and the latter alternative thereafter seem to be the solution of the problem. That this question has been discussed, and we have gathered from the fact that in spite of the jealous care exercised, and we may say, the watchfulness of the magistrates, civil jurisdiction as much as possible to complaints of illegal trampling and encroachment, the question of the extent of power is given with regard to the matter under discussion, to Justices of the Peace, who are necessarily bound by the Act, unfortunately, however, for the interests of farmers this extreme care, and anxiety to see things in order, has not been sufficient to prevent the very object for which this law was framed. The Act has been broken and defrauded of its true spirit, and the definition of a lawful fence, as it stands, is difficult to swear to. Again why can the owners of any horse, mule or neat cattle, be permitted to go over the fence or without having first imprisoned their animals, and the owners of jack, sheep, goats, or swine, be permitted to do so in the event of that having been successfully accomplished. Have our legislators provided these provisions for the protection of the owner of the animals, the enlightened owner of respectable cattle, impelling the owner of the field to stand his ground, in the event of his animals being captured or driven to the pound an Irish greyhound, a lion, a bear, a tiger, or any other animal, which afforded such a spectacle, will quickly suffer loss, the extent of which they cannot possibly imagine. The question of the extent of the fence, and the question of the fence, not only the part breached, must be lawful, under that Act may be in question, and if the fence be unlawful, then the case, we find a special mention to that effect, as in sec. 5, of ordl. 6, which renders this Act practically impossible, would be less equivalently applicable. It is easy to say how owing to an amount of conflicting evidence an owner of a horse, mule or neat cattle, might be compelled to stand his ground, but the extent of which they cannot possibly imagine. The question of the extent of the fence, and the question of the fence, not only the part breached, must be lawful, under that Act may be in question, and if the fence be unlawful, then the case, we find a special mention to that effect, as in sec. 5, of ordl. 6, which renders this Act practically impossible, would be less equivalently applicable.\n\nJ. J. Campbell.\n\nBUFFALO HALL\n\nTHE LEADING\n\nDry Goods, Clothing and Grocery House\n\nOF PRINCE ALBERT.\n\nFor Thirty Days Only!\n\nDRY GOODS\n\nAND CLOTHING\n\nAt Cost for Cash.\n\nBETTS & Gwynne.\n\nCITY AUCTION MART.\n\nMARKLEY & ORR,\n\nReal Estate and General Agents—Solo Agents in this district for the\n\nCelebrated New York Singer Sewing Machines!\n\nCanada Life Assurance COMPANY\n\nESTABLISHED 1847.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $5,000,000\n\nAnnual Income, over $1,000,000.\n\nA general agent of the Company will be pleased to give any information required, and will be glad to see any person interested in the subject.\n\nA. SPROAT,\n\nAgent,\n\nPrince Albert District, N.W.T.\n\nTHE FIRST INSTALLMENT OF A\n\nMowers and Rakes\n\nFrom the celebrated Mower Manufacturing Co. of Art, Ont., and\n\nBufford Breakers\n\nHave arrived at the Implement Department of Jackson & Jackson, and are\n\nThe Lion Reaper,\n\nHoney Finning Mills,\n\nWatson Harrows and\n\nBufford Cross Ploughs\n\nAll these goods are guaranteed to give satisfaction.\n\nParties wishing to secure first-class implements are respectfully requested to call early and leave their orders.\n\nJACKSON & JACKSON\n\nTO THE LADIES.\n\nNEW\n\nSpring and Summer Goods\n\nJUST RECEIVED BY EXPRESS.\n\nMillinery,\n\nLadies' and\n\nChildrens' Furnishings\n\nEvery effort made to give satisfaction.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK,\n\nRIVER STREET,\n\nPRINCE ALBERT,\n\nN.W.T.\n\nThis Powder never varies. A market of equal quality is not to be had at any price. It is more economical than the ordinary kinds and is equal to the best. It is made from the choicest of the finest wool, short weight, clean or coarse, and is guaranteed to be the best.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883091201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9408, "total-output-tokens": 7800, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7990, 2], [7990, 10808, 3], [10808, 18729, 4], [18729, 23763, 5], [23763, 33037, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]