[{"id": "67e25ce20f2f2ec64b9ce5ddf870ed2711d8ffb6", "text": "The Prince Albert Times\n\nJ. D. Maveety\n\nPrince Albert N.W.T.\n\nThis paper is issued every Friday at Prince Albert, Saskatchewan.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nTHREE—60¢ per annum in advance.\n\nThis paper will be inserted in the Sunday Bulletin at 15 cents per line.\n\nNo advertisements inserted for less than $1.\n\nAdvertisements without instructions will not be accepted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVEETY, Proprietor.\n\nNEW YORK.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n10 a.m.—Rev. Mr. Bishop.\n11 a.m.—Rev. Mr. Maclean.\n2 p.m.—Rev. Mr. Chapman.\n3 p.m.—Rev. Mr. Wright.\n4 p.m.—Sunday School.\n7 p.m.—Rev. Mr. Maclean.\n\nSt. Catherine's.\n10 a.m.—Rev. Canon Pratt, B.D.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nSt. Paul's.\n10 a.m.—Rev. Mr. Maclean, B.D.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nSt. Andrew's.\n10 a.m.—Rev. Mr. Maclean.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nSt. John's.\n10 a.m.—Rev. Mr. Maclean.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nSt. Anne's R.C.\n10 a.m.—Rev. Mr. Maclean.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nSt. Paul's (Presbyterian).\n10 a.m.—Rev. Mr. Maclean.\n11 a.m.—Rev. Mr. Maclean.\n12 noon—Rev. Mr. Maclean.\n\nFRIDAY, JUNE 11, 1886.\n\nThe Dominion Parliament was prorogued on the 2nd inst.\n\nA Royal Commission has been appointed to enquire into Indian Department affairs in the Northwest.\n\nA Bill providing for the representation of the Northwest Territories in the Dominion Parliament has passed the House of Lords, and is now before the Imperial House of Commons.\n\nMr. Gladstone's Home Rule Bill was defeated on its second reading by a majority of 30. What course he will adopt in this emergency remains to be seen, but he will doubtless dissolve the House and appeal to the country.\n\nPreparations are being made in the North-West, along the C.P.R., for the visit of Sir John Macdonald, who will pass through about the latter part of this month on his way to Victoria, B.C. It is a pity the Premier cannot find it convenient to take a trip through Saskatchewan and the Edmonton, and thus become acquainted with the Saskatchewan country which is by far the most valuable portion of the great Northwest. But as we cannot have the honour of a visit from him we will have to content ourselves with wishing him an hon. voyage.\n\nTHE TOWN AND DISTRICT OF PRINCE ALBERT.\n\nLake Edmonton, St. Albert and other places to the north and west, Prince Albert district is in its history. Though not quite so old nor so far removed from civilization as the former settlements, still its founders, and its early settlers had to contend with the same disadvantages, had to overcome the same obstacles, which beset the paths of their brother pioneers farther west.\n\nIn 1866, just twenty years ago, the late Rev. James Nesbit, a Presbyterian minister, came here with a party of men, arrived at this point. An H. R. Post had been established some time previous, and Rev. Mr. Nesbit was to establish a Mission in connection with the Presbyterian Church, which he did succeed in doing. As the years crowded on, and as settlers commenced pouring into Manitoba, and there was a prospect that the tide of emigration would flow this way, the western branch of the then Presbyterian Province, many of the settlers of Kildonan, and French halfbreeds from St. Boniface, as also many Canadians, came to settle in this district, and the vermin. Thus slowly but surely the country increased in population and importance from a community of half a dozen white men, in 1866, to a population of thousands today. In 1866. It is not too much to say, as we might, the hardships which the early pioneers underwent. Those who have had any experience of Northwest life have a good idea of what they went through. Their history is but a repetition of that of the early pioneers of Canada with this difference, of course, that the latter had a different class of Indians to deal with, and the difficulties of their struggles were filled with vengeance and death and constant terror. Had the Northwest tribes been of a bloodthirsty disposition, had they looked upon the whites as the eastern tribes did, we think, we would have no fear however. Instead, they seem to be anxious to build another town on the sods of the detriment of this place, but we think the Government, if our claims are properly put before them, will, instead of pursuing us for our enterprise, be glad to see another town, and their encourage us to increase expectations in the direction of developing this district by locating the new police barracks in or close by the town of Prince Albert.\n\nBut though the permanent police barracks should be granted to us, if we would continue to prosper we must have railway communication. At present we have only a railway branching off from the C. P. R. in a northwesterly direction, one from Portage la Prairie, one from Hudson and one from Regina. The objective point of all these is definitely known, while that of the Northwest Central is Battleford. The Regina and Long Lake Railway will soon be completed to and through Prince Albert, connecting the Lake and Regina, and the work of construction will still continue toward along the Lake shore. The objective point of this railway is not known, although there are some people in this district who do not have Prince Albert at one end of a railway and Regina at the other, think that the great majority of the people are quite content to have railway communication with the outside world even by way of the capital of the Northwest. At all events this railway seems to us to afford the quickest means of escape from our present position, and we believe that Mr. Albert should be its proposed terminus and its promoters have the necessary financial strength to complete it. As matters stand, however, we would seem to be left out in the cold by the whole thing.\n\nGENERAL NEWS.\n\nPresident Macdonald was married at the White House on the 2nd inst., to Miss Francis Polson.\n\nArchibald Forbes, the distinguished journalist, who was in Winnipeg lately, has returned to his home on the North-West.\n\nMiss Margaret, wife of Louis Riell, died at St. Vital, May 31st.\n\nThirteen rebellion medals are reported to have been sold in Montreal. The quality relations will be investigated.\n\nWork on the Northwest Central will be commenced about the 15th inst. The contractors intend to build 150 miles this year.\n\nThe Windsor and Cleveland hotels with several adjoining stores, on the corner of Market and Main streets, Winnipeg, were cremated on the 30th of May.\n\nJudge Brooks, of Sherbrooke, is now engaged in the probable succession of his Honour Latest Governor General.\n\nLumber Lumber\n\nWe will place on banks of Saskatchewan River, at Medicine Hat, ready for rafting,\n\nDressed Boards, $25 per m.\nScantling and Joist, tp to 1 ft, 25 \" Flooring, Ceiling and Siding, 30 \"\nShingles, 4 \"\nTar and Brown Paper, 4cts \" lb.\nDoors, 2f 6in x 6f 6in, 1½ 2.30 each\nDoors, 2f in x f 8in, 2.40 \"\nDoors 2f 10 x 6f 10 ½ 2.70 \"\n\nSASH FROM $1 80 TO $2 80 PER PAIR GLAZED\n\nAbove prices for cash only.\n\nCorrespondence solicited.\n\nTHE MEDICINE H T LUMBER CO.'Y.\n\nW. T. FINLAY, Manager.\n\nP.S.—Bills cut to order.\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The size of the paper will be Eight Pages of Seven Columns each—65 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial and Special Departments of Particular Interest to the Home Circle. No effort will be made to make our Weekly a weekly visitor everywhere.\n\nParties intending to subscribe are requested to send their names, with the price of subscription to the office of\n\nTHE MANITOBA SUN,\nin Market St. E.,\nWinnipeg, Man.\nTHE LORNE AGRICULTURAL SOCIETY.\n\nA large and representative meeting of the directors of the Lorne Agricultural Society was held in Prince Albert on Friday last. The principal business of the meeting was to arrange a prize list for the fall show now being held at the fair grounds, with the addition of an old silver cup, cost £20 (300) donated on behalf of the Hudson's Bay Company by Mr. H. C. Clarke, Chairman of the Society.\n\nAfter the minutes of the previous meeting were read and approved, Capt. Hoey and Mr. Chas. Robertson advanced stock, as seems to be the custom of the members of the Society, so that such a valuable prize could be given for the importing of a few thoroughbred horses. It was thought that if we have a hard year—would be of incalculable value to the farmers in improving their stock.\n\nThe young interest was very clearly put forward by Mr. Tiss. F. Miller, who was able to account for his horse, No. 15, which, in a very forcible manner, convinced the directors present that grass was the best food for a good animal, and that it was not necessary to give grain to a horse.\n\nI was then moved by Mr. Tiss. F. Miller, seconded by Capt. Craig Maclean, that the Society should be prepared for the next exhibition of grain, consisting of fifteen bushels of wheat, (two colours), oats, barley, rye, buckwheat, black, and ten bushels of hay, and that this be sent three out of five years to the Exhibition Committee, and that the winner of each year receive a medal as a prize for having won the prize.\n\nThe motion was carried by a majority of the members present.\n\nThe next day decided in case there was no competition the awarding of a prize to the best horse.\n\nTiss. F. Miller James Thompson, W. Paterson, J. Maclean, Geo. Wilson, the Board of Directors, were appointed a committee to draw up the general prize list, and they expect to have it printed by the end of June.\n\nFactory working to do some special prizes should kindly send them to the Secretary, as soon as possible.\n\nFor the purpose of discussing the matter pertaining to purely agricultural matters.\n\nCapt. Craig proposed, and Mr. John Scott seconded a motion that the meeting recognize the delegates that are being sent from the Lorne Counties to the representatives of the Society, so that the President and Secretary with the mover will be under no appointment to make any report or statement regarding the proceedings of the meeting, and put the same into the hands of the representatives, so that they may bring the same before the Government at Ottawa without delay. Carried unanimously.\n\nThe committee having met, agreed to place before the Government in the strongest light possible, the serious feeling of the people of the district, whether members of the Society or not, that the government, which it aims at doing the greatest good to the district in the Saskatchewan District, should be located at or near the Town of Prince Albert, and that the reason for this feeling being that the said Town is the centre of population and wealth of the district, and that the farmers, who live in the Saskatchewan district are located here, have done much hard pioneer work, and are therefore entitled to every consideration, and that there should be a large mercantile class who have, at least, an outlet, both for the purchase of lumber and farming implements, and that during the late rebellion it was quite evident to everyone that the Government, in connection with the approach of danger immediately moved into Prince Albert as the natural point of safety, and that it was felt that those people still look to the town in the same way and would regard any attempt to remove the Government, or the withdrawal of the forces, or the bulk of them, from this place as entirely improper, the same as a similar movement in any other part of the country, which they consider themselves entitled to expect from the Government of the country; the committee request the delegates to impress upon the Government the fact that for several years in succession the farmers of the district have been struggling against a series of adverse circumstances, which have been prevented, and that the immigration on this extensive section of the continent has been delayed, from causes beyond our control, the greatest satisfaction and interest having been manifested by the farmers, who have been greatly encouraged by the Government, and that the recent talk of the Police at a distance from Prince Albert is discouraging in the highest degree, and it is sincerely hoped it will not be carried out.\n\nWM. MILLER, President.\nJ. STEWART, Vice-President.\nA. H. CLARK, Secretary.\n\nTOWN COUNCIL.\n\nPresent—Acting Mayor Betts, and Council Members—Baldwin and Goodfellow.\n\nIt was stated that previous meetings were held and adjourned.\n\nA communication was received from the Collector regarding remission from taxation on flour mill.\n\nReferred to Finance Committee.\n\nA motion by Mr. R. D. Riggs, for $112 for Assay fees, and $190 for the expenses of the assay, ordered to be paid.\n\nA communication from War Committee, for the disbursement of the river fund $100.\n\nReferred to Finance Committee.\n\nThe Committee on Work and Health recommended the payment of the account of J. L. Johnson & Co., for $375; the account of the Collector for $80; the account of the Fire Committee for $10; the cost of Red Fire appliances; and that the communication from the Band be held in abeyance until further notice.\n\nThe motion the report of these Committees was adopted.\n\nMr. Betts moved a new motion that he would introduce a by-law to license Saloons, etc.\n\nMr. Mayor Betts introduced a Penalty by-law.\n\nThe by-law to regulate Draymen was carried by a majority of the members present.\n\nThe by-law for Regulating and Restraining Dogs running at large was read a second time.\n\nThe by-law to Regulate Tramways was read a second time.\n\nThe Finance Committee were appointed to value all appliances of the East End Fire Company, and report at the next meeting.\n\nThe Clerk was authorized to get 100 copies of the Healthy by-law and the same be printed.\n\nThe Council requested to meet on Monday 25th inst., at 7.30 p.m.\n\nMr. Mackay, the town assessor, handed in his report at the last meeting, and stated that the assessed value of the town property is $16,410, taxable personal property valued at $1,400, taxable personal property valued at $1,400, and the total assessed value of the town property is $18,250, and that the report as far as his report could show, but it cannot be less than that. It took him two weeks to make the assessment, and he made the assessment, for which the Council allowed him $100.00.\n\nMr. Betts stated that he had understood that only those who were assessed for income were assessed.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 10 Spruce St., New York.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886061101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3810, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8022, 2], [8022, 15512, 3], [15512, 15512, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]