[{"id": "95a87e5726636d29905f7e8c458cfc17bd53193a", "text": "**THE PRINCE ALBERT TIMES**\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FFIDAY, FEBRUARY 22, 1884.\n\n$2.50 A YEAR.\n\n**CHIT-CHAT LOCALS.**\n\nGathered by our Reporters.\n\n**Personal.**\n\nMr. David Carter left for Calgary last Wednesday morning.\n\nThe Hon. Lawrence Clarke left for Winnipeg yesterday.\n\nMr. Butchart will shortly leave here on a visit to Ontario.\n\nMr. J. L. Reid, D. L. S., has purchased a farm near R. R. Keith & Co., and advertises in another column.\n\nMr. Hugh McDougall is expected to return today.\n\nMr. Riggs will be here next Wednesday to bring up supplies for Moore & Macdonald.\n\nAmongst the many excellent speeches delivered at the banquet, given by Mr. Clarke on Tuesday last, was one from Mr. John McNaughton, gardener. Mr. McNaughton had been here for some years in Manitoba before coming to Prince Albert. He recounted interesting experiences to do with the history of the Red River rebellions, and also with the early history of this town, and as he does not often speak in public we deem it not out of place to give particular mention of his effort.\n\nLest Fear—We hope that our ladies, young and old, interested in the future here, have not forgotten that this is but a temporary situation that they are exercising the privileges which the year confers upon them. Leap-year surprise parties are quite the thing nowadays, and we would suggest that they make good use of their liberty by gathering together in a warmer climate, but down East, in which the position of the sexes is reversed, and the males are put into the ring and round and pick up the young women and select their partners after a hearty hand shake. We say don’t start the “circle” in Prince Albert? Don’t all speak at once!\n\n**Adventures of an Overcoat.**\n\nA problem of a rather serious nature has been presented to me over what he has not seen for eighteen months. The last I saw of him was on board the steamer Lake Winnipeg going to September 3rd and having been separated from it at Cobville during the time it had visited knobbies about seven leagues from Wapusk. It remained placidly there until it finally turned up here, O.K.\n\nThings get mixed, and missing very much.\n\n**Secretary’s Address.**\n\nThe Secretary acknowledges with thanks the remarks made by Mr. Jones from Mr. Poveshell Howard of Edmonton, of the papers from the club, and other kind papers from kind, unknown friends, and expresses a hearty thank you. A large departure was taken from the usual course; the ordinary club list only had regular reports to be presented; the Queen’s message was read by Mr. Smith, who has been so useful to the successful career of Mr. Smith. Mr. Smith has returned to his post at his high position on Chief Justice, and has been most liberal in all public objects, and has expressed himself very highly in saying that in honoring his guest to his proper banquet, the citizens of Prince Albert were present. Mr. Smith, in responding, expressed the feeling of the Club as being expressed upon him by being tendered this honour. We regret that want of space prevented the Secretary from making a speech, in which he reviewed the progress of the Club; but he spoke very happily, and especially dwelt upon the importance of the proposed Hudson Bay Railway. He expressed the hope that it would be completed, and that the land would be opened up, and that the Dominion Government would see fit to take up the question of the North West. He expressed the hope that the Club would continue to prosper, and especially dwell upon the importance of the proposed Hudson Bay Railway. He expressed the hope that the Club would continue to prosper, and especially dwell upon the importance of the proposed Hudson Bay Railway.\n\n**PUBLIC NOTICE.**\n\nAll persons are hereby required to take notice that the calling of timber sales will commence immediately from the Minister of the Interior. The Local Agent will give notice to all persons permitted by law and all timber and land owner will be informed by the Minister and the sale will be conducted under the Dominion Lands Act.\n\n**Banking House.**\n\nMacarthur & Knowles,\n\nPrince Albert, N.W.T.\n\nTransact a Domestic Banking业务。\n\nBranches available at all points to Dominion.\n\nConfidential undertakings promptly attended to.\n\nDUNLOP, Merchant Bank of Canada.\n\n**MULLEN & ELLIOT.**\n\nBarrister, Solicitors, etc.\n\n**PRINCE ALBERT.**\n\nW. A. McGeean.\n\nRev. Gunning, M.A.\n\nRev. M. J. Furlong, B.D.\n\nRev. J. D. Maclean, B.C. Hist.\n\nRev. J. R. McCaig, B.C. Hist.\n\nRev. J. M. Macleod, B.C. Hist.\n\nRev. J. J. McLean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\n\nRev. J. M. Maclean, B.C. Hist.\nCOMMUNICATIONS.\n\nNORTH WEST REPRESENTATION.\n\nThe Editor of the Times,\n\nSir,\n\nAt the meeting called by our member, Mr. Macdonald, we had the privilege of addressing the House of Commons in regard to the question of representation for Canada West. We have been well pleased with the manner in which the debate has been conducted. We believe there is nothing like making an effort, and in the first place we want a telegraph office in every town in Canada West. We want something like looking for sheep, but we want them to be moved to some convenient site; we want the sheep taken care of, and the sheepmen paid. We want patents issued immediately; we want them (sheep) to be so much less as to make them profitable to the sheepmen across Canada, and an equal amount as a compensation; we want the navigation of the lakes opened up. We believe that if the Government can give us the Hudson Bay Railway, so as to make a market for our cattle, and if they will take the trouble to examine the reports of the P.E.R., we can put our hands on the resources of the province, and the result will be evidently prosperous.\n\nThe arguments presented by the Prime Minister are worthy of the attention of all who desire peace and prosperity for Manitoba and the North West. If these arguments do not prove to be important and therefore worthy of expenditure, we shall be obliged to say that we must rely upon the government for our future.\n\nIn conclusion, we will give a third argument on the question of education and the school system. We should be glad to see the government take this question into their own hands, which may properly concern the future prosperity of the province. We believe the North West Council had in view in having the ordinance passed and circulars distributed, the question of the administration of the schools, and the publication of the school law last week was our main object. We believe that the people from the North West ought to have any other interest placed in this discussion, than the subject of the education of our children, where we are sure in Prince Albert, and we desire to write upon it. We believe that the public's views on the subject should be heard.\n\nIn the case of Parliament, the one of the most important matters now before the people of Canada is the question of the administration of the schools. We believe that the people of Canada should be interested in this question, and that the government should take steps to provide for the education of our children, where we are sure in Prince Albert, and we desire to write upon it. We believe that the public's views on the subject should be heard.\n\nPLAIN SPEAKING.\n\nAn Ontario paper remarks in reference to the agitation in the North West:\n\n\"The early settlers in Ontario met many difficulties, and the difficulties are still greater today. The people of Ontario are not willing to be governed by the government of the North West, and they are not willing to be governed by the government of the North West. They are not willing to be governed by the government of the North West, and they are not willing to be governed by the government of the North West.\"\n\nA judge, or postmaster, that a trader indebted to him for the sum of two hundred dollars, is entitled to a writ of attachment addressed to the guardian of the estate which is possessed, in trust, of the estate which is required forthwith to be sold. Proceeds of sale to be paid over to the judge, who are to be disposed of immediately. And immediately the sale is made, the attachment is to be given; and the writ calling for the attachment is to be served.\n\nThere follows provisions regarding the making of creditors' payment of debts, etc.\n\nTHE WEEK.\n\nA new novel, \"Prince Albert,\" by Charles G. D. Roberts, published by Blackie & Co., Toronto.\n\nMILK!\n\nNO-ADULTERATION.\n\nThe undersigned is prepared to receive orders for quantities of milk only (quantity). Orders left with the undersigned at No. 12 Denon will be promptly attended to.\n\nWM. BROWN.\n\nP.S. - The undersigned can be supplied for the need of milk, and will be pleased to put them on them, who are expected to keep them in order.\n\nJ. O. DAVIS & CO.,\n\nDon't talk unless you have something to say.\n\nI whose purpose is to sell will praise but not exceed the truth, even to sell.\n\nThe Boom is off!\n\nWe are determined to sell out at actual cost. Hard Lines. Better luck next time.\n\nJACKSON & JACKSON,\n\nCarpenters, ETC.\n\nNear Presbyterian Church.\n\nTHE FIRST INSTALLMENT OF A\n\nSweet and Rakes\n\nFrom the celebrated Custom Manufacturing Co., of Ayr, Ont., and\n\nBufford Breakers\n\nHave arrived at the Implement Department of Jackson & Jackson, and are now on display.\n\nThe Lion Reaper,\n\nHoney Fanning Mills,\n\nWatson Harrows and\n\nBufford Croc Ploughs.\n\nAll these goods are guaranteed to give satisfaction, and are sold at reasonable prices.\n\nJACKSON & JACKSON,\n\nPublic Notice.\n\nPublic notice is hereby given that the following advertisements appear in the PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW, the former the property of Mr. J. O. Davis, and the latter the property of Mr. W. M. Brown, both of Prince Albert, Saskatchewan.\n\nA declaration respecting Municipalities, dated January 30th, 1884, is also on file.\n\nBRANCH STORE.\n\nNear the building occupied by the late firm of Ashdown & Agnew, in this west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO.,\n\nWholesale and Retail.\n\nPRINCE ALBERT.\n\nBranch Office.\n\nA. E. FORGETT,\n\nClerk of Council.\n\nRegina, 16th January, 1884.\nThis subject still continues to engross public attention in Manitoba and Ontario. An immense mass meeting was held in the opera house in Winnipeg on the 1st Feb., presided over by Mayor Logan, at which speeches were made by Mr. Duncan Macarthur and other leading men, and resolutions passed in favor of the project.\n\n1st resolution—Moved by Mr. Duncan Macarthur, seconded by Mr. Fonseca and supported by Mr. B. D. B. Taylor.\n\n\"This meeting hereby expresses its hearty sympathy with the building of a railway to some point on the Hudson Bay, and regards the early construction of the same as essential to the development of all the territories west of Manitoba and the North West.\"\n\n2nd resolution—Moved by David Glass, Q. C., seconded by Mr. William Bingham and supported by Mr. Moyne Daly.\n\n\"Resolved, That this meeting take this opportunity of expressing its opinion that encouragement and support should be given to any scheme to build a railway from Winnipeg to the coast, by taking the same course adopted by the Government of Canada in such a way as to prevent the road from falling into the hands of any private railway company or other corporation.\"\n\n3rd resolution—Moved by Mr. Kenneth McKenzie, President of Board of Trade, seconded by A. C. Kinloch M. P., F. P., and supported by Captain Macdonald.\n\n\"That the Hudson's Straits and Bay have been successfully navigated for the last 27 years, and that the navigation has no doubt been rendered more easy and safe, can be successfully carried on in the future, and that the iron steamers now generally used in the navigation of the Straits and Bay for a period at least as extended as the navigation of the St. Lawrence, if a better route to Europe, via Liverpool, can be found, should be made as successful, and in as short a time, as that from Montreal or New York to Liverpool.\"\n\n4th resolution—Moved by ex-Attorney-General Clarke, seconded by Mr. William Clarke, supported by Mr. Luxton and Hon. C. P. Brown.\n\n\"That in the opinion of this meeting the most important question at the present juncture is the question of a railway to Hudson's Bay, the extension of our boundaries to the Arctic Ocean, parallel of ninety-north, and further north, this meeting expresses its hearty sympathy with the efforts to that direction now being made by the Hon. Mr. Neepawa at Ottawa.\"\n\nNAVAL HISTORY OF HUDDSON'S BAY.\n\nSir,—At present, when anything bearing on the feasibility of the navigation of Hudson's Bay is of interest, I may mention a case which took place back in 1879, between Captain Macdonald, an iron steamer Polyphemus, and myself, while crossing the Atlantic. He says that the man who brought out the locusts of the Atlantic, which have since been used by the Hudson's Bay Company in the carrying of the North West, that he believed ultimately the Hudson's Bay route would be the greatest route in the world, and that it was possible to navigate it, and be bound to find as good as Quebec, and that the ice after leaving Davis Strait turns back, so that from the mouth of Labrador, the course to Cape Farewell would be so smooth that it would take vessels of any size to navigate it, and that there was nothing in running for the Gulf of St. Lawrence. The opinion of such a practical seaman as Captain Macdonald would be worth more to carry weight with it.—Wishing Free Press.\n\nTelegraph.\n\nWe have made arrangements with a company near us in Winnipeg to send us on a weekly budget of telegraphic news suitable to our readers. As this will in every case be sent to us direct, we shall have the advantage of this opportunity to earnestly request those of our subscribers and advertisers who are not already on our list to pay their balance owing. If all arrears were paid up, there are other improvements we could make in the paper without the cost we can do but little.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO.\n\nStill on the War Path\n\nWITH A LARGE LINE OF GOODS\n\nAnd Slaughtering the Prices.\n\nRemember, it is not old stock which we offer, but goods that have not the title of \"seconds,\" nor have been marked down because of age or condition. We offer goods that are new, and have been bought at wholesale prices. Our stock consists as follows:\n\nDry Goods and Novelties!\n\nIncluding a large line of Bread Goods, Ladies' Underwear, Ladies' and Gentlemen's Underwear, Jerseys, Bandkerchiefs, Laces, Ribbons, Umbrellas, Hats, Caps, Umbrellas, Blankets, Prints, Ginghams, Wrinkled Cottons, Flannel, Shawls, etc., also a large stock of Ready Made Clothing, for Caps and Overcoats, Knickers, etc.; also a large stock of Ladies' Goods, Boots, Shoes, Moccasins, etc.\n\nA large selection of goods, and a large variety of our stock will satisfy the closest buyers at bottom prices.\n\nJ. M. CAMPBELL.\n\nJUST RECEIVED.\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Cutter Runners, Shafts and Tongues for sale.\n\nAnd a large quantity of old articles generally purchased for cash.\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT.\n\nNOTICE TO THE PUBLIC.\n\nMeals at all Hours!\n\nFIRST-CLASS\n\nHAY & BARLEY\n\nW. H. BARTLETT\n\nROBERT THOMSON,\n\nSign & Ornamental Painter.\n\nUNDERCLOTHING\n\nA Large Assortment of\n\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\n\nEAST END BAKERY!\n\nEight Loaves for $1\n\nTakes and orders made to order.\n\nHUGH M'DOUGALL,\n\nEast End Bakery.\n\nPrince Albert Bakery.\n\n2LB LOAF, 12¢.\n\n9 LOAVES, 15¢.\n\nLakes and Pastry always on hand and made to order.\n\nWM. R. BELL,\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY\n\nPROPRIETOR.\n\nROCK BOTTOM STORE\n\nH. VALTERS, F. C. BAKER.\n\nMasonic Hall, Prince Albert.\nTERRITORIAL NEWS\n\nREGINA\n\nFrom the Telegraph, Feb. 13.\n\nMr. Metcalfe, the government Land Agent at Regina, left yesterday on Tuesday night. He will be away about three weeks.\n\nMr. Durnan, of the N.W. Land Company, is taking rooms a petition written to be sent to the government, which is in the hands of Mr. Metcalfe.\n\nThe last revenue from 1st January to 31st December, 1883, amounted to $6,425. The amount of registered letters mailed at and delivered at for the same period was $1,478. The amount of telegrams sent out during the same period of time was $1,090. There were nine more men sent out since Mr. Metcalfe left Regina. Mr. Jackson and Longbottom, at an early date, number of other officers will be opened which will be served from Regina.\n\nPORTRAJE LA PRAIRIE\n\nFrom the Review, Feb. 8.\n\nThe School Board have made arrangements.\n\nThe local government will meet about next week.\n\nThe Portage order has been issued.\n\nA $20 fine for the M. & N. W. Railways department.\n\nSCHOOL MATTERS\n\nFrom the Review, Feb. 8.\n\nAt a recent school meeting held at Edmonton, Mr. Oliver, member of North West Council, stated that District, who introduced the proposed new school ordinance (to which allusion is made in another column), expressed himself on the subject of the new school.\n\nThe chairman said that before the meeting closed he would like to give a little personal explanation. All present seemed interested.\n\nPORT MACLEOD.\n\nFrom the Gazette, Feb. 8.\n\nThe Banff mail came in on Tuesday. The Calgary mail came in on Saturday. Gold, said to be from the diggings, has been found on Belly River.\n\nThe Lieutenant-Governor visited the Blackfoot Reserve on Tuesday to ratify the treaty which had been signed there. On Wednesday morning he started for the Blackfoot Reserve, for a similar purpose.\n\nMANITOBA.\n\nBAT PORTRAJE.\n\nFrom the Telegram, Feb. 8.\n\nMiss Mack & Co., Farmers' Aid Society has been formed here.\n\nMr. E. E. Fury, the manager, has gone into the fish business.\n\n33 letters were sent to the dead letter office from here this week.\n\nThe Miners' Union of Manitoba met in Winnipeg on Feb. 14th.\n\nThe goods and chattels of the Canada Gold Mining Co. were sold by the bailiff, last Monday.\n\nSTONERALL.\n\nFrom the Star, Feb. 8.\n\nMajor Bowles dropped into town on Tuesday and disbursed $2,000.\n\nJack Lewis had two ribs broken by a kick from a horse Thursday night.\n\nIt is thought that salt may be found here at a depth of about 50 feet.\n\nTwo curling rinks will attend the opening on Thursday and Friday next.\n\nMr. S. J. Jackson will give a silver medal for the best point game to be played next week.\n\nNELSON\n\nFrom the Morning Post, Feb. 13.\n\nCoal has been found in the Pembina district.\n\nMr. T. W. Brownell has started a weekly paper at Nelson.\n\nBetween Jan. 1st and Feb. 17th, 14,175 pounds of flour were shipped from Dawson Station.\n\nMr. T. W. Brownell has received a large order for flour and provisions of $1,500 from the Provincial government to be shipped on payment of freight over the Pembina.\n\nLADIES' ASTRACHAN SACKCOATS, LADIES' AND MEN'S S.S. SEAL, PERSONAL LAMB, OTTER, BEAVER, ASTRACHAN AND CLOTH CAPS, KID MITTS, BUCK MITTS, AND AN IMMENSE STOCK OF LADIES', MEN'S AND YOUTH'S MOCASSINS, AT COST FOR CASH.\n\nBUFFALO HALL!\n\nGreat Clearing Sale of FURS, MITTS AND MOCASSINS\n\nDue to the above choice stock of goods reaching here so late, we have decided to offer\n\nJ. L. JOHNSON & CO.\n\nDEALERS IN\n\nGeneral, Shelf and Heavy Hardware, Glass, Paints, Oils, Etc.\n\nMain St., Prince Albert.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPRINCE ALBERT, N.W.T.\n\nHUDSON'S BAY CO.'\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 700,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO TOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gleschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg.\n\nC. J. DAYGEO, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884022201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 7410, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 10271, 1], [10271, 15806, 2], [15806, 21462, 3], [21462, 25760, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]