[{"id": "f16d6a8c1c6804ce84df2cfeed6d23fb1f976d5f", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nFRIDAY, DEC. 18, 1887.\n\nA good many people seem to think that our stories in last week's issue on the Mounted Police were rather severe. While we do not intend to eat humble pie and take back all we said, we are free to admit that there was a great outcry and is composed of a number of men as could be got together anywhere, and that their services could not altogether be dispensed with in the Territorial force but a feeling of hostility existed on the part of citizens, if not towards the men composing the division, then against the officer in command, no one will have the hardihood to deny. It cannot be denied did not they who should think better of it have espoused the cause of that officer find it necessary to hold a hole and corner meeting when discussing the advisability of petitioning the Commissioner to have him transferred? Why did they not call a public meeting and have a full and free discussion? We answer, because they were keenly interested in having Prince Albert would ask for anything else than the removal of that officer. It is not on account of his efforts to suppress the illicit traffic in spirits, but hopes that he is supposed. With the few exceptions, the people of this town have no sympathy whatever for whiskey smugglers, and we but echo the sentiments of nineteen out of our citizens when we say that this officer should be supported. The permit system is unsatisfactory and unpopular. It is condemned in the press, in the Council of the land, in the police, and by the district residents. Those who go to great lengths to legalize the sale of liquors clamor for a change, temperance advocates agree that a change of some kind is necessary, and public opinion throughout the country is moving in the same direction. Whether it is a question of a prohibitory law or a license system is a question which must at an early date be decided by the Parliament of Canada. Until after any legal motion is passed saying what it is to have, we feel that the Government should ascertain the wishes of those who are directly to be affected thereby, and that can only be done by taking a vote of the people of the Territories. We do not believe in the policy of granting licenses wholesale; nor do we believe in total prohibition. But we might be able to get a law passed so that two middle courses could be adopted, which would prove satisfactory. The first of these would be a high license fee, licensing a limited number of persons who kept the respectable men in important cities and towns and other large centers of population in houses to be kept under the most stringent regulations and under the closest supervision of the Mounted Police or other officers whose inspectors may be appointed for that purpose, and any infraction of the law to be visited with long terms of imprisonment. The second course, and the one which would most likely be the most feasible and most popular would be the granting of licenses to manufacture beer, ale, etc., and to sell the same and light wines, the distiller would be satisfied with this while the manufacturer would it would afford a ready market. For farmers barley, wheat, etc., best is a drug on the market and for the consumption of the people at large. But the liquor problem is not difficult one, and its solution must be left to those who are more competent to deal with the question.\n\nMAGISTRATES COURT.\n\nOn Saturday last George Sutherland brought before Capt. Gordon Young, Inspector of Police, and J. F. Smith, J. P., charged by Const. Leslie of the Police Force with having improperly issued a permit. The facts of the case were that Capt. Young had received information from a previous night suspect that Mr. Smith had been selling liquor in his house. Capt. Young did this thing and making a search found a considerable quantity of alcohol immediately in the possession of Mr. Smith, taking him to the Police box up at the station, and thereupon asked Smith whether he had any questions. For the information it was stated that he was permitted to stand behind the desk and explain himself. Smith said liquor. As there was no evidence to support that statement, the case was dismissed and Mr. Smith was returned to Sutherland.\n\nOn Wednesday last Capt. Gordon Young, Inspector of Police, and J. F. Smith, J. P., charged with having improper license in possession. Capt. Young stated that he had received information from a previous night suspect that Mr. Smith had been selling liquor in his house. Capt. Young did this thing and making a search found a considerable quantity of alcohol immediately in the possession of Mr. Smith, taking him to the Police box up at the station, and thereupon asked Smith whether he had any questions. For the information it was stated that he was permitted to stand behind the desk and explain himself. Smith said liquor. As there was no evidence to support that statement, the case was dismissed and Mr. Smith was returned to Sutherland.\n\nNEILSON & McBEATH\n\nTHE SUN!\n\nDAILY AND WEEKLY.\n\nIndependent in Politics.\n\nThe Leading and Popular Paper of the CANADIAN NORTHWEST.\n\nHas a City Circulation Greater than the Combined Circulation of the Other Western Newspapers.\n\nGreat Advertising Medium.\n\nIt is the Brightest, Swiftest and widest Brand of News in the Manitoban Bulletins.\n\nSUBSCRIPTION PRICE.\n\nTwo Months, $2.00; Six Months, $3.50; One Year, $4.00.\n\nONLY $2.00 TO 1839.\n\nTHE CARNIVAL\n\nThe first carnival of the season was held last evening, and the Saskatchewan Curling and Skating Club was all that could be desired. The ladies and gentlemen took advantage of it and got up some elaborate costumes. The ladies who came out in them were quite the ladies they must have taken in getting up their costumes. Miss Alberta McGregor, dressed as \"Cinderella,\" was certainly very nice, and although she was not awarded the lady prize, is well deserving of such attention. The most interesting part of the evening was watching the skating through. Miss Kitty Bennett, dressed as \"Valkyrie,\" took the prize. Miss Kitty Bennett was very nice in getting up her costume, and she showed off to good advantage and her graceful movements. Miss Bennett was as an \"Old Woman\" was well up to the finest both in costume and in skating, as was Miss Anna Murray, dressed as \"American,\" and Miss Monk representing \"America.\"\n\nAmong the gentlemen, And Nelson, as \"Knight,\" was very nice, and the handsome young man the Wigwam, who made a fine \"Bucky Doll,\" looked very fine. The best costume was won by Mr. Charles \"Crusader,\" W. R. Fish and B. Spratt, \"Red White and Blue,\" and Miss Women, E. J. Cass, \"Dancing Butler,\" Miss Cochran, \"Fat Man,\" R. Stanley, \"Chief,\" and Miss Murray, \"Gambler,\" J. Schmidt, as \"Old Tramp.\"\n\nThe ice was in good condition early in the evening, and was soon up by the skaters. Messrs. Offley and Co. arranged the services of the P.A.C. Band, which played several numbers during the evening. The skating was a great success in every way and the enterprise was very well managed and conducted, the ice being smooth and satisfactory and magnificent prizes as the following lady tickets were given away, a gold watch, a silver watch, a gold ring, and a gold watch chain.\n\nThe next event will be about Feb. 1st, when there will be more prizes given.\n\nTOWN COUNCIL.\n\nAn adjourned meeting of the Council was held last Wednesday evening last. All the Counsellors were present and Mayor Macar had presided.\n\nApplications for day license have been received from Peter Robertson and D. C. Reynolds and certificates will be granted.\n\nBy Laws.\n\nThe following amendments were ordered to be passed: A. Messrs. Stott for driving a horse and dray, and Mr. Smith for P. Launer, N. H. Smith, G. E. Smith for A. Launer, H. W. Neumann, 25 cents for stenographer, H. W. Neumann, 25 cents for stenographer, H. W. Neumann, 25 cents for stenographer, A. Smith for A. Launer, 25 cents for stenographer, Mr. Smith for A. Launer, 25 cents for stenographer, and D. Williamson, 25 cents, the balance due him on credit discharged.\n\nBy Laws.\n\nA by law for approving Deputy Re- ceivers, and for making provision for the sale of property by law No. 27 was passed through the usual stage-door panel. The Council then adjourned to meet on Friday 25th inst.\n\nClearing Sale.\n\nALL REMAINING\n\nParlor Stoves\n\nAT COST\n\nBox Stoves\n\nREDUCED TEN PER CENT.\n\nAcme Skates\n\nREDUCED TEN PER CENT.\n\nT. J. A GNEW'S.\n\nXMAS & NEW YEAR'S GIFTS.\n\nDressing Cases, Jewel Cases, Shaving Cases, Brush and Comb Cases, Olive Cases, Glove and Handkerchief Cases, Writing Cases, Carving Knives, Umbrellas, Umbrella Frames, Wall Pockets, Match Receivers, Ladies' Companions, Key Rings, Hard Painted Plaques, Toilet Bottles, Ladies' Satchels, Brush Boxes, Tobacco Tobacco, Tobacco Pouches, Pipe Pouches, Trinket Mirrors, Fancy Mirrors, Fans, Brass Ornaments, Glass Articles, Books, Games, Music, Hour, Chatboxer, Rays, One Annual, Girls One Annual, Infant's Magazine, Toy Books any variety, Standard Prayers, Prayer Books, Musical Instruments, Accordions, Concertinas, Violins, Harmonicas, Guitars, Checkers, Dominoes, Chess, Cribbage Boards, Playing Cards, Children's Games, Toys, etc., etc., etc.\n\nCALL AND MAKE YOUR SELECTIONS EARLY AT\n\nT. N. CAMPBELL'S\n\nThe Prince Albert Times\n\nAND\n\nSASKATCHEWAN REVIEW\n\n$2.50 PER ANNUM\n\nThe Times is the best medium for advertising your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply\n\nJ. D. MAVEETY.\n\nPublisher and Proprietor.\n\nMAGNIFICENT ARRAYS OF COSTLY AND HANDSOME PRIZES GIVEN AWAY WITH THE MANITOBA WEEKLY FREE PRESS\n\nCANADA'S MAMMOTH PAPER.\n\nThe Great Family Newspaper of the Canadian North West.\n\n1887 - CAMPAIGN - 1888\n\nSixteenth Year of Publication.\n\nOnly $2.00 Worth of Splendid Prizes Ever Free to Subscribers\n\nSelf-Binders, Mowers, Splendid Delecty Organ, Sewing Machines, Watches, Bread Making Guns, Stoves, etc.\n\nBALANOEE OF 1887 FREE.\n\nONLY $2.00 TO 1839.\n\nFREE PRESS: WINNIPEG, MAN.\nTRIP TO MISTAWASIS' MISSION\n\nWe were so late in starting on our trip to Snake Plain last week that we reached our intended camping ground at the mouth of the Snake River, after extra little trips of exploration. Finally, however, by the kindness of Mr. Beatty, we were able to make our way up the Lida to the crossing of the Saskatchewan where the sight of Mr. Sanderson's bright tent marked the end of our wanderings. After partaking of refreshments, to which keen appetites gave a peculiar zest, we lay down and fell asleep, only to be awakened by the sound of a distant fire which would wake us in good time for early morning. After breakfasting on some hardtack pike hills and bacon, we came to a splendid district which kept improving all the way to Mistawasis. We reached the latter early in the afternoon. Great was the surprise of those of us who had been there before to see the extent of the new and aggressive Indian settlement. The farm houses, stables, mission house, church and school were there, and the efforts of church and state in civilizing the savage population. Of the two or three families but little is being done.\n\nThe church is a log building 20 x 30 feet, well built and well heated. The schoolhouse is not yet to be put in. In the nearly fenced and well kept grave yard, in front of the church, just past the schoolhouse, is the grave of one of the earliest pioneers of this North West. Mr. McKay the father of our missionary, whose dust lies side by side with that of the first Indian dead belonging to the Mission.\n\nAt half past seven in the evening of the 7th, the wedding of Miss Jessie McKay and Mr. John Wilson took place. The Rev. Mr. McKay gave away the bride, and the knot was tied, in the usual manner, by the Rev. Mr. Campbell. It is unnecessary to add that the bride, who was attired in white, looked very pretty.\n\nA boating party was afterwards started, of which all the guests partook heartily. On Friday morning at 8 o'clock we started on our return journey reaching Prince Albert at 6 in the evening without any other mishap than a few scratches occasioned by the overhanging branches of the trees on our route.\n\nHOW BEACH WON.\n\nDetails of the Great Hanlan-Beach Boat Race.\n\nThe following account of the Hanlan Beach race in Sydney, N. S. W., Saturday last, is from the \"Courier Mail.\" The weather was rather hot, but not sufficient to cause postponement. From early morning the race course was thronged with spectators, and by three o'clock immense gathering had congregated. The race was set to start between that hour and six o'clock, but was delayed when the men put off the stake boats. Five to four were bet on Beach before the race started, and he was considered certain winner. Without warning him they were soon ready, and commenced racing. For the first 100 yards they kept even pace, then a terrific spurt. Beach then gradually worked his boat in front, but the advantage was not sufficient to enable him to win. The race was eventually won by Beach, who was able to hold a mile. Both men were very exhausted when the race was over.\n\nDressed Flooring, Undressed do., Dressed Siding, Undressed do., Sheeting, Common Lumber, Dimension do., Lath, 75 cts. per bundle, Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Advertising Advertising Bureau, New York City.\n\nGENERAL NEWS.\n\nToronto, Dec. 5.—Advices from Melbourne Australia, say that Beach, the oarsman, has resigned the world's championship, and returned to England. Mr. Beach has abandoned Rowing.\n\nN. F. Davis, M. P., interviewed the Minister of Indian Revenue about the question of the Indians of North West. Mr. Davis presented to the minister that due permission had been given for the establishment of a brewhouse and distillery on the reserve land, and that the prosperity of the world would be a loss to investors. He claims to have obtained from the Government a part payment of the order which was cancelled. Hon. Mr. Costigan has matter under consideration.\n\nRecent returns show the executive committee of the City Council shows a remarkable increase of crime in Toronto. During the past three months, the number of arrests was 2,666, 7,496 and 6,877 and for ten months this year 12,866. The number of licenses have been reduced.\n\n\"Dave\" Davis, the aboriginal, who killed poor Jennie Gilmore nine fifteen years ago, was sent to Kingston for trial, and will be released next January for having acted as a \"pigeon\" spy on the other convict.\n\nA young lawyer was appointed to defend a negro who was too poor to hire counsel of his own. After the jury were in the box, the lawyer laid his case before them, saying that while his client said he had a prejudice against him. \"Are there any more jurymen who have a prejudice against me?\" asked the young lawyer. \"No doubt, do you say all right; but now I want you to change your mind. You must do it at once, or else you'll be beginnin' to hab prejudice again.\"\n\nFISHING!\n\nFISH'S.\n\nSUCKERS\n\nLean Men's pants for Fish Poles. Fat Men's Suits for Floats. Dress Suits for Winter Reels. Heavy Overcoats for Sinkers. No Sample or Knit Shop. Shop Open. Line Us getting the Lowest Rates for Fish. Swim in and be Caught.\n\nW. R. FISH.\n\n\"BELL\" ORGANS\n\nUnsurpassed for Tone and Quality. CATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Advertising Advertising Bureau, New York City.\n\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods.\n\nEver yet shown in Prince Albert.\n\nDress Goods\n\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nWincees, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nAll Prices and Shades.\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMAN'S\n\nFancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes!\n\nMitts and Moccasins\n\nAND THE FINEST ASSORTMENT OF\n\nGlass and Crockery\n\nIN THE TOWN.\n\nA LARGE STOCK OF\n\nFLOUR!\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, Undressed do., Dressed Siding, Undressed do., Sheeting, Common Lumber, Dimension do., Lath, 75 cts. per bundle, Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders will have a reduction made.\n\nMOORE & MACDOWALL.\n\nTHE MORNING CALL\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of current European, Canadian and United States News.\n\nSpecial news reports compiled by resident correspondents throughout Manitoba, Ontario, Quebec, New Brunswick and British Columbia.\n\nComplete reports of Parliamentary proceedings, court cases, etc.\n\nTHE MORNING CALL also reports the night dispatches from the United Press, London, Paris, Washington, etc., and has complete news unexcelled scope of its growth.\n\nSubscription rates: One year $1.00; six months 50c; three months 35c. By mail, 10c additional postage. Free to any address on application.\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS\n\nPresident and Editor-in-Chief\n\nSASKATCHEWAN DIRECTORY\n\nAt the request of a number of inferior citizens of the district, I have prepared a list of the names of those who have been engaged in the work and progress of the various newspapers published within the limits of their natural resources, and giving a short description of each. This list will also contain names of the town officials, members of the legislative assembly, members of the municipal councils, churches and other directories.\n\nI have endeavored to make this directory reliable as a source of information, but cannot guarantee the accuracy of the facts stated herein. The rate of 50c per name, 50c per page, and 50c per page for each additional name, will be charged.\n\nH. T. McPHERSON\n\nPrince Albert, Sask.\n\nREAD R.A.D.\n\nThe North West Farmer will be mailed free to subscribers from the date of this issue, December 1st, 1888, for the purpose of carrying the subscription price of One Dollar. All papers received after this date will be marked up to the same date. New Subscribers will be charged One Dollar.\n\n\"The House Fair\" or its companion \"Country Life,\" are now being issued. The Publishers are determined to make \"The House Fair\" the best publication of its kind in Canada, and the North West, both in appearance and the offer now made. It is the first Agricultural Journal published in the Canadian Northwest, and is issued monthly, neatly got up, and a thoroughly practical paper, containing the latest developments in the agricultural departments, and the latest and best farming information published.\n\nThe department now among the Farmers.\n\nContaining descriptions of the latest stock and implements, valuable data for the management of farms.\n\nAGRICULTURAL SOCIETIES.\n\nContaining the names of the latest officers of the different societies.\n\nLIVE STOCK.\n\nVeterinary Department. In which Veterinary questions will be answered free of charge by a prominent Veterinary Surgeon.\n\nThe latest information on Poultry and Pet Stock, Expositions, The Field, Grains and Milling, The Garden and Forestry, Game and Sport, Books recently received, Exchange Mart, Land Titles, Land Questions and Answers, Household, The Market.\n\nThese departments are supplied by prominent experts in each line, who either themselves practical farmers or agriculturists, or who are connected with the business by a close association with the best in the country. Its original articles are copied from the best journals in the United States and Canada, and it is highly recommended as a valuable source of information on all facts of interest to the farmer. If you want to get posted on things as they are going on in the world, read the North Western Farmer, whose travelling correspondent keeps in constant communication with the pioneer farmers who are engaged in the great work of development.\n\nHOW TO SUBSCRIBE.\n\nExchange is registered at the post office as second-class matter, postage paid, and address\n\nNORTH WEST FARMER.\n\nWinnipeg, Man.\nMASS MEETING.\n\nA meeting of the residents of Prince Albert was held in the Town Hall on Thursday evening of last week, for the purpose of considering a change in the law regarding the acquisition of land territories, and also to consider the powers conferred upon the N.W.M. Police.\n\nThis was one of the largest public meetings ever held in Prince Albert. The meeting opened at 8 p.m., and after a few preliminary remarks, called upon Mr. MacLeod, who spoke for about an hour. He gave a good account of the grievances against this community by a man of high authority. He then charged the authorities with the Blue River, and reflects against the community. He then claimed the compensation which he thought was due to them, and said they would maintain, not the worst of the people but the best of them, as regards the police. He had reason to believe the good feeling existing between the N.W.M. Police and the civilians, and to that extent he thought the law was being enforced.\n\nHe then moved the following resolution:\n\n\"Whereas, One A. Bowen Perry, superintendent in the N.W.M. Police, in his report dated 30th November, 1896 mentions the conduct of the N.W.M. Police, and embodied in the Commissioner's report to the Department, and published in the newspapers, the most malicious statements formed to fact.\n\nResolved, That the inhabitants of Prince Albert view with much concern the last report of the Superintendent and superintendents which have been publicly levelled against them as a community, and Perry in his report has reported particularly in regard to certain trials, with reference to which he says: 'The evidence given by the prisoner was very weak and nothing existed for the persons accused whether they were guilty or not. Police officers have always shown strong sympathy. Evidence was produced for the defence which could not be answered. In other cases this produced this sympathy for crime; but in other cases it has been plainly evident that there was no sympathy, that it has diminished more in this case than any other case, and that there was no sympathy for convicted criminals.\n\nResolved, That this meeting believe that Judge McLeod, a gentleman of known probity and honesty, will allow him to be heard by the body of the performers of his public duty.\n\nThat the moral integrity of this community, it stands as high as any other, and this place is relatively perhaps, free from crime, either against property or person, than any other part of the Dominion.\n\nResolved, That said Perry's report is based entirely on the evidence given to the police of Prince Albert and His Honour Judge McLeod.\n\nResolved, That the charges made against this body be forwarded to Sir John A. Macdonald, the Minister of the Mounted Police and D. H. Macdonald and that the Government be requested to remove the said McLeod and all other officers who has inflicted the respect of this community and whose presence in its midst is undesirable.\n\nMr. John Stewart seconded the resolution. He read from the Blue Book the report of the Superintendent, and although his remarks were brief, they were to the point.\n\nThe Hon. Mr. McNab, T. O. Davis and Mr. Ross, Mr. McNab moved and Mr. T. O. Davis seconded that the Hon. Mr. Macdonald be asked to investigate.\n\nThe resolution was then put and carried.\n\nMr. W. R. Grant next addressed the meeting and spoke for about an hour. He addressed length to Short's Report and his duties, and to the present situation and then moved the following resolution:\n\nResolved, That the 15th Section of the Act respecting the N.W.M. Police force, Chapter 27, Consolidated Acts of Canada, 1868, in subsection (4), clothes with extraordinary powers a constable in the force; powers which should only be exercised with great discretion. But it is the common practice of the constables to exercise these powers without any grounds of suspicion, to go about private and public houses at night back through the streets, and in the dark, and wander through stable yards and making searches in haylofts and (2) to stop persons in the dark of night, with regard to the constables' own personal responsibility of the occupants, and with threats of arrest, usually search the premises for stolen goods. Now, how large are the powers conferred under such sections? They are firstly referred to as \"powers not intended by the words 'order and search,' and secondly referred to as an abuse of the provisions of the act.\"\n\nResolved, That the above open the door to perjury and the law is too lax in this matter.\n\nResolved, That the entries recently made of private dwellings without warrant, information, made of the contents of a constable's pocket-book, and the accidental intent to annoy, does not commend itself to the good sense of this community, and that the system of espionage, conducted at all hours of the day and night, and without warrant, is an outrage on the feelings of the community, and is arousing strong feelings of resentment amongst people of all classes.\n\nResolved, That the N.W.M. Police, in their conduct, have been a constant source of irritation and annoyance, and there is a growing belief here that the police have been engaged in a conspiracy to make citizens feel the profits of those whom they share, is a direct invitation to them to invade, by their own acts.\n\nResolved, That the law should be changed in such a manner that no search should be made except upon warrant in accordance with the written order of the police.\n\nAnd whereas, This meeting of good feeling and sympathy for the citizens of Prince Albert and the Mounted Police Force, and as this has been shown by their conduct, do hereby resolve:\n\nResolved, That the course pursued by Supt. Perry has a tendency to disarm public sentiment from the administration of justice, and that the citizens of Prince Albert become hostile to those who have been and should be their best friends.\n\nMr. MacLeod on acceding the resolution, reviewed the matter in a careful manner throughout the meeting. He stated that the best course to take was to wait, and spend upon during the last month by the Police. He also said the house which were not ordered, but he did not explain this.\n\nMr. MacLeod and Justice McNab called upon and expressed their disapproval of the resolution, as the matter referred to was at present before the courts.\n\nThe Rev. Mr. Howard being badly called for came forward, but did not get a hearing owing to the meeting being finally interrupted by a few persons.\n\nThe resolution was then put and carried.\n\nThe meeting was closed by Mr. MacLeod and seconded by Mr. T. O. Davis.\n\nResolved, That a petition be circulated for signatures throughout the district addressed to the Duke of Lorne, requesting him to take up the question of granting the sale of spirits licenses be determined by a man elected by the people of the N.W.M. Territories.\n\nMr. McNab then moved and Mr. MacLeod seconded that the Hon. Mr. McNab be asked to investigate.\n\nThat Messrs. MacLeod, MacNab, John Stewart and Mr. Davis be a committee to draft petition in accordance with the wishes of the meeting, and to present the same to the legislature regarding a vote on the liquor question.\n\nAfter the usual vote of thanks was passed the meeting was closed.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887121601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 6480, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10138, 2], [10138, 20814, 3], [20814, 28061, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]