[{"id": "838fbde3b89f46b06ecbcabf16a35ce29ffee02a", "text": "THE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nPUBLISHED BY\n\nJ. D. MAVETTY\n\nAT\n\nPRINCE ALBERT N.W.T.\n\nTERMS—$1.50 per annum in advance.\n\nSingle copies, 10 cents each.\n\nIn no case will pages be inserted in this paper.\n\nBusiness letters will be sent gratis.\n\nNo advertisements inserted for less than $1.\n\nAdvertisements without instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nJ. D. MAVETTY, Proprietor.\n\nTHIS PAPER may be found at\n\nROWELL & Co.'s Newspaper Agency,\n\nCorner of Main and Second Streets,\n\nPrince Albert, N.W.T.\n\nNEW YORK.\n\nFRIDAY, JUNE 24, 1887.\n\nTHE QUEEN'S JUBILEE.\n\nAt twelve minutes past two o'clock on the morning of the 29th of June, 1837, died William IV, who seven years before had ascended the throne of Great Britain and Ireland on the death of his brother George IV. It is an axiom of monarchical governments that \"the king never dies,\" and hence the French heralds of the olden time, when one of their monarchs was gathered to his fathers, would say \"Vive le Roi et vive le Roi!\" Victoria succeeded her uncle King William, and in virtue of this recognized law and custom, her accession to the crown is held to have taken place on the same day as her predecessor's. In point of fact, four hours after the king's death the youthful Princess was roused from her slumber and, before the outside world was aware that the great event had come, was hailed by the Primate of England as Queen of the British dominions. At eleven o'clock the same day (having attained her majority), she formally took the oath to govern according to law, and on the following day her accession to the throne was publicly proclaimed with the usual pomp and ceremony, the coronation taking place nine years after, on the 28th of June, 1838. On the 20th of this present month of June, 1887, our good Queen has thus completed the fiftieth year of her reign, and her Jubilee as sovereign of the British Empire has been celebrated by a loyal and affectionate people in the United Kingdom, in all her colonies and dependencies throughout the world, and in every foreign country where the British race are to be found located.\n\nVictoria Alexandrina is the daughter of Edward Duke of Kent, son of George III and brother of George IV and William IV, and her mother the Duchess of Kent was the daughter of the late Duke of Saxe Coburg. Victoria was born 24th of May, 1819, and her father having died the following year, the Duchess devoted herself to the care and education of her only child with such diligence that she became the example of her honored parents.\n\nThe accession of Queen Victoria occurred while Britain was enjoying that era of peace which followed upon the overthrow of the great Napoleon, and continued throughout without interruption till the present time. The British motto now-a-days is \"defence not offence,\" and the race is not fond of using its sword when it can avoid it. It was not always so with them. England and Scotland, which are now so happily one in the bonds of peaceful union, fought stubbornly against each other for centuries. Not until then, but the Prince of Wales, for merry England, borne down Montjoye, St. Denis, on the fields of France. The victories of the Black Prince at Crecy and Poitiers and of that of the field of Agincourt are emblazoned on the roll of fame and the names of Blenheim and Waterloo are amongst the most glorious and momentous that modern history records. These were enough for military renown. But even our Queen's reign, though on the whole peaceful, has again been marked by acts of war and bloodshed. Wars. Asia has seen the glitter of the British banner in Afghanistan and Persia, in China and Burmah, not will the Indian mutiny soon be forgotten.\n\nThe dark continent has been the scene of action in Ashantee and Zululand and the Transvaal, in Abyssinia and Egypt. Europe has witnessed the greatest struggle of all in that Crimean campaign that humbled the autocrat of the Russian, and even our own Dominion has not been free from troubles which, fortunately for all concerned, never assumed the proportions of war.\n\nIn looking back, however, over the reign of Queen Victoria, and comparing it with former periods of similar duration, we fail to mark the rapid and vast progress and development of the Empire in population as well as in material wealth, in commerce and industry, and above all in peace, prior to her reign; the advance in peace has been as great as in war. Space will not permit us even to glance at the principal events in the domestic history of the Empire during the last fifty years, but suffice it to say that the period has produced so many great and good men as the Victorian era is indeed a prolific mine for the future historian to work, and the more so because of some of the more prominent names sufficiently indicating the extent and power, the philanthropy and genius that have been at work for the moral and welfare of their race. In such men as Peel and Wellington, Lord Colborne and Bright, Lord Palmerston, Disraeli and Gladstone, one recognizes statements of the highest order. At the mention of Bristow and Faraday, Murchison and Herschel, Darwin and Hussey, we think of the mighty discoveries and inventions of the Victorian years. That art has suffered no neglect the names of Wilkie and Chantrey, Turner and Landseer, Millais and Ruskin are sufficient proof. In literature, Wordsworth and Southey, Dickens and Tennyson, while they stand out among the poets of their own time, take a high rank among the sweet singers of all ages, and history has never found more illustrious names than those of Lamartine and Grote, Macaulay and Hallam, Froude and Freeman.\n\nIn fiction, Bulwer-Lytton and Dickens, Thackeray and George Eliot have been equally richly endowed in raising the standard to the highest. A great literary teaching agent, and such writers as Carlyle and J. S. Mill, Buckle and Matthew Arnold among secular writers, and Chalmers, Irving, Newmann, Macaulay, Coleridge and Sidney Smith, have been the theologians and historians whose labors during the period under review show that the British mind has been actively and energetically engaged.\n\nIn colonial affairs the Confederation of the Canadian Provinces, the transfer of the Hudson Bay Territory to the Dominion, the extension of the railway up of the Northwest Territories and the construction of the Canadian Pacific Railway, the opening of the Suez Canal, the settlement of the question of the Northwest Coast and the conclusion of the treaty with the Indians, are amongst the most momentous and significant events in the history of the Empire. Possibly this question may in the near future assume the importance of great national interest, and the question of the rights of the Indians, the fear the idea has created by Prince Albert's visit to the other side of the Atlantic, the White Eagle's breaking race, Benjamin Franklin's Canada, the discovery of the region of utopian dreams, the publication of do not frequently happen in the walk of life, but they are expected to happen. Our history records only three previous instances of monarchs reigning for sixty years. Elizabeth I reigned thirty-five years, James I thirty-eight years, and Queen Victoria thirty-two years. Great Britain and George III the Queen's grandfather, who reigned fifty-nine years, has become noteworthy, but we hope the accession of Queen Victoria has a stronger incentive to replace our present anxieties.\nLOCAL NEWS.\n\nDrink Montmorency Linnets Champagne, cooling and refreshing, at Clark's Drug Store.\n\nShortly after the Judge's arrival on Monday evening, the members of the P. A. C. Band at the residence of Dr. Bain. After playing a tune or two, the band was presented with a testimonial by his honor in a few neatly turned sentences expressive of his gratification at hearing such a fine band. The band was presented with a most tangible token of his good will. The band then dispersed and returned to their homes. Mr. E. F. Smith welcomed him home in true Roman style.\n\nCommittee meetings are being held, and final arrangements completed for the Jubilee celebration. The program will include the usual attractions, such as the National Anthem, etc., in the early morning; noon the harvest meal; at 10 p.m. the grand ball. There will be various places on the platform east of the public school; athletic sport and games near the school; everything the fire works, the day being brought to a close with a citizens' ball in the court house.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAUT N Campbell's New Star.\n\nA LARGE STOCK OF Watches,\nClocks and Jewellery\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co.,\nNewspaper Advertising Bureau,\n10 Spruce St., New York.\nSend order for 100 copies Pamphlets.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRON'S SEASON 1887 POSCORRON\n\nA Black French Canadian will stand four days in each week, Sundays, Wednesdays, Thursdays and Fridays.\n\nTHOS. SCOTT'S STABLES,\n\nAt the Ridge.\nSeason commences April 27th and ends July 30th.\n\nHorses Pastured FREE of Charge.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nCommunications\n\nIt can be distinctly understood that Mr. Craig has been surreptitiously employed by Messrs. Boyd & Co., in order to prove his case. The facts clearly point to a plan and strategy behind such actions.\n\nSig Schwartz\n\nThe Editor of the Times\n\nSouth Africa. In his last issue of The Times I was very much surprised at the article by Mr. Craig regarding the use of barley as a cereal grain by Mr. Wu, now well-known throughout the country. It is difficult to imagine any one else who could have written such an article.\n\nSecond Gem\n\nTo the Editor of The Times:\n\nLast week's article on barley was well-written and thoroughly researched, as was the article about Mr. Wu by Mr. Craig. However, there seems to be a misunderstanding regarding the use of barley as a cereal grain. Mr. Craig's argument seems to be quite logical and convincing.\n\nYours Truly,\n\nJohn McCafferty\n\nPrevious通讯相关文章\n\n我们也不应忽视为解决农民问题所做的一切努力。尽管我们可能会遇到一些挫折，但信心坚定，士气高昂。\n\nJ. R. McPhail", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887062401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 2565, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7503, 2], [7503, 9668, 3], [9668, 10627, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]