[{"id": "ba3e8ba5ae1324f8b2be7bd58a06a3bfea8807a3", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\nFRIDAY, APRIL 5, 1889.\n\nINTERESTING TO LADIES.\nOur lady readers can hardly fail to have their attention called this week to the latest combination called the \"New Home Sewing Machine.\" As we understand it, a machine of this kind can be used by anyone of any age or sex, and requires no special skill to operate. It should be simple in its operation, and should run easily; in short, do not require much strength or effort. The sewing machine is designed to be light, handy, and portable, and as such can be used consistently with excellent results throughout the year. The \"New Home\" sewing machine has also been tested extensively and found to be consistent with excellent results throughout the year.\n\nThe \"New Home\" sewing machine is also recommended to purchasers on account of its durability, convenience, and reasonable price. Over half a million have been sold in the United States alone, and the demand continues universal satisfaction. This unexcelled sewing machine is now being manufactured by the New Home Sewing Machine Co., Orangeville, Ontario.\n\nTHOS. O. DAVIS.\n\nR. C. WIGMORE & CO.\nMen's and Boys' Underclothing\nMen's Cardigans/Jackets;\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overcoats at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\n\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\n\nNOTICE\nSealed tenders—Tender for the following lots of land will be received at the office up to noon of Thursday, the 6th of April, 1889, which consists of the Lots 1 and 2 of Section 3, Township 11 North, Range 1 East, and Lots 7 and 8 of Section 4, Township 11 North, Range 1 West, all in the Town of Prince Albert, Saskatchewan.\n\nMONTREAL, P.Q.\n\nSealed tenders—Tender for the following Lots of land will be received at the office up to noon of Thursday, the 6th of April, 1889, which consists of Lots 1 and 2 of Section 3, Township 11 North, Range 1 East, and Lots 7 and 8 of Section 4, Township 11 North, Range 1 West, all in the Town of Prince Albert, Saskatchewan.\n\nMONTREAL, P.Q.\n\nCampbell's Cathartic Compound (Liquid)\nCures Chronic Constipation,\nCostiveness, and all Complaints arising from a weakened state of the Liver, Stomach and Bowels, such as\nAsthma, Bronchitis, Bilious Affections, Hemoptysis, Heartburn, Indigestion, Cholera, Dysentery, etc., etc.\nPrice 25 Cents per Bottle.\nDAVIS & LAWRENCE CO. LIMITED,\nMONTREAL.\n\nHORSE SHOE STORE.\nJUST ARRIVED—LARGE ASSORTMENT\nDRESS GOODS!\nComprising Rum's Veiling, Serge, Cashmere, New Prints, Muslins, Searsucker Ladies' Trimmed Hats, Children's Hats\nFULL RANGE LATEST STYLES MEN'S\nAmerican Felt Hats.\nLatest in Men's, Youths' and Boys' Clothing\nCall Early and get Your Choice—Prices Lower than ever\n\nDUNN'S BAKING POWDER\nTHE COOK'S BEST FRIEND\nFor sale by wholesale and retail grocers.\n\nRED DEER HILL.\nA.D. Boylan is visiting here for a short time.\nThe roads are very rough, but will soon improve now that they are dry.\nJohn Gibbons recently lost a valuable colt also a valuable colt of Robt. Gilks died lately.\nThe snow has nearly all disappeared and some weather farmers will consider seeding in a few days.\nRobt. English is hard at work at his place on the three quarter section.\nWild geese were seen on the 23rd of March and ducks on the 25th. Prairie chickens are not as numerous as in former years.\nThe school trustees have secured the services, as teacher for the summer term, Mr. Cherry, of Island Lake, at a salary of $100 per month.\nCattle, horses and all kinds of stock that were grazed out winter and spring have returned to the neighborhood to be seen amongst them. McKay's sheep and all appear in good condition.\nAs a result of the recent meetings between the members held every Friday evening at And. Spencer's, who has kindly donated a building for purposes, there has been a great demand for the members nearly forty members.\n\nTHE NEW HOME SEWING MACHINE.\nThis is a machine of the latest design, made entirely of cast iron, and is constructed to be light, handy, durable, and as cheap as it can be made consistent with excellent results throughout the year. The \"New Home\" sewing machine is also recommended to purchasers on account of its durability, convenience, and reasonable price. Over half a million have been sold in the United States alone, and the demand continues universal satisfaction. This unexcelled sewing machine is now being manufactured by the New Home Sewing Machine Co., Orangeville, Ontario.\n\nTHOS. O. DAVIS.\n\nR. C. WIGMORE & CO.\nMen's and Boys' Underclothing\nMen's Cardigans/Jackets;\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overcoats at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\n\nR. C. WIGMORE & CO.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nA Dead Drop!\n\nON PRICES\n\nAT\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nSuch reductions for\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The variety of new goods in every department is immense.\n\nCall and examine our stock.\n\nNo time to show goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a large stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFot Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask\nTOWN COUNCIL\n\nThere is a great interest in the town council meeting, which was held last evening at the town hall. Mr. Smith, the mayor, presided. Several resolutions were passed, including one calling for a town meeting to be held next week.\n\nThe following resolutions were approved:\n\n1. That the town council request the Board of Health to investigate the condition of the town's water supply.\n2. That the town council request the Board of Education to provide additional funding for the town's schools.\n\nCOMMISSIONERS\n\nCommissioners were sworn in by Judge Smith. They are responsible for overseeing the town's finances.\n\nCLARK'S CROSSING\n\nClark's Crossing has been approved for the construction of a new bridge over the river. The bridge will be completed by the end of the year.\n\nNEW HOME SEWING MACHINE\n\nThe new home sewing machine is now available for purchase. It is advertised as being the only sewing machine that gives perfect satisfaction.\n\nTHE LIGHT RUNNING\n\nThe light running is now available for purchase. It is advertised as being the only sewing machine that gives perfect satisfaction.\n\nSHERIFF'S SALE OF LANDS\n\nA sheriff's sale of lands is scheduled for next week. All interested parties are encouraged to attend.\n\nAPRIL FOOL\n\nApril Fool's Day is celebrated with a variety of pranks and jokes throughout the town.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889040501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 2110, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5857, 2], [5857, 6407, 3], [6407, 7738, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]