[{"id": "6ea7321ea5a1d124bd24df2efe43fc85ded63973", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 6, 1888.\n\n$2 50 A YEAR.\n\nBANKINGHOUSE OF Macarthur & Knowles.\nPrince Albert, N.W.T.\nTransact a General Banking Business.\nInterest allowed on Deposits.\nNotes accepted at par.\nDrafts instantly available at all points in the Dominion.\nCollections undertaken and promptly attended to.\nBANKERS—Merchant's Bank of Canada.\n\nWILLIAM V. MACARLIE.\nAdvocate, Notary, Esq.\nMoney to be had for bad mortgages or improved land property, at fair rates of interest.\n\nFRUIT\nFRUIT\nFRUIT\n\n20 Cases Arriving Next Week.\nTo be Sold at Cost.\n\nR. T. GOODFELLOW,\nCarnarvon River and McKay Streets.\n\nAnother Nice Lot of Watches, Rings,\nSleeve Buttons, etc.\n\nJ. LESTOCK REID.\nDominion Land Surveyor.\n\nPRINCE ALBERT, SASK.\nA. C. PATTERSON.\nForwarding Agent.\nHas been attending to and shipped goods, and will continue to do so, and give special attention to and forward orders solicited.\n\nROBERT THOMSON.\nSign and Ornamental Painter.\nCalico printing and Paper hanging on Short Notice.\n\nDecorative Painting a Specialty.\n\nROYAL MAIL STAGE COACH.\nWeekly between Prince Albert and Prince Albert, Leaving Prince Albert every Tuesday morning.\n\nLESLIE & SCOTT.\n\nROB'T BUCKLEY,\nAuctioneer, Accountant,\nEstate and General Agent,\nHas to hand a number of Town Lots which will be sold cheap on easy terms.\n\nIMPROVED FARMS.\nSTREET.\nPRINCE ALBERT.\n\nQUEEN'S HOTEL.\nT. ORAM, Proprietor.\nLeading Hotel in Saskatchewan.\nBoard by the day or week.\nThe Bar is supplied with the finest brands of Cigars, Beer, Cider and Blackwood Brandy, from London.\n\nEvery attention paid to the travelling public.\n\nTHOS. ORAM.\n\nNOTICE.\n\nONE MONTH ONLY.\nTHE SASKATCHEWAN PHOTOGRAPH GALLERY.\n\nRESOLUTION OF PARTNERSHIP.\n\nWOODMAN BROS.\nAre dissolving partnership. All parties interested are requested to present their accounts before the 1st of August next, and settle up.\n\nH. A. HEAD.\n\nFRUIT\n\nFRUIT\n\nFRUIT\n\nOur goods are raised for their fashionable shape and superior quality.\nAre in half cases and in numerous widths and at modest prices.\nOrders solicited and promptly replied.\n\nBy buying your Boots and Shoes at our store, you save 2¢ on the dollar.\nCome in and see what we are doing.\n\nS. McLEOD & CO.\nVICTORIA\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's stores.\n\nHaving enlarged our yards to double their original size, we are now able to accommodate the largest of the trade in public and private conveyances.\nAll kinds of work done at the best rates.\nWe have added some fresh horses to our well-known list of prime Mares, and are now prepared to meet any demand.\nTravellers taken at reasonable prices.\nN.B.—Our sign new, and not liable to breakage.\n\nNEILSON & M'BEATH.\n\nJ. DOOLITTLE.\nQU'APPELLE STATION.\nAgent for the sale of A. HARRIS, S.S.C.\nFarm Implements and Machinery.\nBradford Light Binder.\nPerfection Mower.\nSethy & Gang Plow.\nBreaking and Cross Plows.\nThreshing Machines.\nBain Wagons.\nBinding Tidie, etc.\n\nNEW HARNESS STORE.\n\nW. H. SWINNERTON.\nWinnipeg, April 30th, 1888.\n\nMISS AULD.\n\nBege to inform the ladies of Prince Albert and vicinity that Miss Auld has opened a large and well-selected stock of Millinery and Fancy Goods.\n\nHaving secured the services of a First-class Dress and Mantle Maker in the East, will be able to execute all orders promptly and in the latest styles.\n\nNEW HARNESS STORE.\n\nW. H. SWINNERTON.\nWinnipeg, April 30th, 1888.\n\nLOOK HERE!\n\nW. SHANNON & CO.\nHave just received the first installment of BOOTS, SHOES AND SLIPPERS.\nFor spring and summer wear for ladies, boys and children, and will be pleased to send them to any part of the country.\n\nAll first-class goods, No. 2000.\n\nTrunks Valises and School Bags.\n\nFull lines of Ladies' and Children's Hose.\nTo be disposed of at the lowest invoices for sale.\n\nWM. SHANKON & CO.\n\nLOCAL NEWS.\n\nPlenty of rain this week.\nThe mail arrived, and left on time this week.\nMen's and Boy's Rubber Coats, cheap, at Walters & Baker's.\n\nThe North West arrived at Battleford on Tuesday making the trip in two days quite comfortably.\nA magnificent rainbow encircled the southern sky, after the rainstorm on Dominion Day.\n\nThe Hon. Mr. Clarke, left by the Government steamer for Edmonton, will arrive here tomorrow morning.\n\nMr. H. Gibbon, of Battleford, left this place for Prince Albert on Wednesday afternoon.\n\nMr. J. L. Johnston, and daughter, returned from the Steamer Stead, West on her return trip, and will be here again for a visit next week.\n\nMr. T. Wadsworth, Inspector of Indian Agencies in this town was here last night, and will be here again shortly.\n\nMr. W. W. Smith, of Prince Albert, is a careful and efficient official.\n\nThe Annual Conference of the Methodist Church, has been in session over the past few days, and it is expected that there will be no change in this District the present year.\n\nMr. H. D. Macdonald visited the work of building the Shell River, about ten miles from town, on the road to Green Lake, and will be here again shortly.\n\nJudge McNaughton was interviewed at Kingston a short time ago on Northwest affairs.\n\nThe road south west and vicinity afforded a fine field of enterprise for a considerable time Monday night last.\n\nThe newspapers are all had this summer and fall, and the farmers are getting away from the smugness around town.\n\nMr. R. Taylor and family left for Fort Pitt, by boat, on Sunday. The Rev. Mr. Johnson will take charge of that parish.\n\nMiss McLaughlin arrived in town on Wednesday with a load of freight from Winnipeg, and reports the roads in a very bad condition.\n\nA meeting of the Executive of the Local Council will be held at the Council Chamber on Saturday, the 14th inst., at 3 o'clock p.m.\n\nA C.P.R. land explorer will arrive on Wednesday afternoon, for the Albert District, where operation will be carried out until next fall. Mr. W. A. Ducker will have the charge of the party.\n\nPatience, and part of the second finger on his right hand amputated last week.\nAbout a month ago he was bitten by a dog, and was obliged to stop a day longer, he says.\n\nHalf-brother, along with his congenial companion, \"trotted\" up to the bar of the Royal Hotel, Prince Albert, on Wednesday evening, but had his ship refused to drink too much.\n\nThe interloper horse race was run on Wednesday afternoon, between the black and blue horses that took part in the third race on Dominion Day. There were very little money changed hands.\n\nThe race was won by the blue and white Tailing at Walters and Baker's.\n\nThe Prince of Wales, of Winnipeg, has just arrived in third year and has changed its name to the Manitoulin Colonist, as a journal that ought to get liberal support and encouragement from the resources and wealth of this country.\n\nA largely attended meeting of the Royal Canadian Institute was held yesterday.\nThey will visit all the places of note along the South Branch for the next six weeks.\n\nMrs. Perry, wife of Superintendent A. Bowser, Perry, of the N. W. M. P., at Prince Albert, died on account of the effects of her death. She leaves a family of very small children.\n\nThe foregoing story is taken from the Reminiscences of Mrs. Perry, which vividly illustrates the old adage that \"to learn the lesson of home one must go away.\"\nIt will be remembered that Mrs. Perry came to know that she was a victim to consumption of the lungs. We are very pleased to hear of a person who has been able to resist the tempting call to dissipate health at the present time, and, if appearance indicates truth, she will be able to resist from that day forth.\n\nOur white and grey cottons now selling for ten cents per yard. They beat all others.\n\nWe have for your inspection at Walters and Baker's.\n\nApplications for your attention at Cass's Mechanics' subscriptions received for all Canadian, American and Foreign Publications at lowest rates.\nCROP PROSPECTS.\n\nAlthough the spring was late in opening and much colder than the corresponding period in former years, yet since the beginning of June the weather has been so very auspicious that the promise of an abundant yield for 1895 is far better than it has been for many years past. The frequent showers and the very warm weather during the last few weeks have brought the crops generally into good condition; farmers have sown a larger area than last year, and from the favorable prospects at present in the Prince Albert district, there will be a large yield of all kinds of cereals, and the result, given we do not have a drought, there being no means of export nearer than 250 miles. Should four contracts for the Indians and N.W. Police be awarded to outsiders as they have in the past, the farmers will have no means of disposing of any of their produce over and above what they can dispose of for local consumption. A short drive through the country at present would convince the most skeptical that Prince Albert is the centre of one of the most fertile districts in the North West, and with railway communication would soon assert her right in wealth and population.\n\nWarden Lovell, of the Kingston Penitentiary, says that of the fifty-eight convicts received since the beginning of the year, two-thirds are under twenty-five years of age, thirteen under twenty, and only one over fifty. Careful investigation of their history showed that the first step downward was due to disobedience of parents, bad company and neglect of the Sabbath. The majority of those in prison were abandoned boys of the Dominion, who were early left orphans, or trained from infancy to crime; a number were helpers of burglars by the time they were seven years of age.\n\nPublic meetings endorsing Hon. E. Dewdney's appointment as Minister of the Interior have been held in several towns in the Territories. Would it not be wise for this district to recognize in some way that the importance of North West representation in the Dominion Cabinet has been acknowledged by Sir John.\nLOCAL ITEMS\n\nThere were five passengers by this week's steamer:\n\nMr. P. O. Noel, solicitor at the Government Telegraph Service, St. Lawrence, arrived yesterday.\n\nMr. Dugmore, clerk of the Courantier in this town, was a passenger west by the steamer this week.\n\nMr. Millar, chief engineer of the H.R.C., at Isle-aux-Coudres, spent several days here last week. He is on a pleasure trip to Winnipeg.\n\nWhile in the neighbourhood, there was not a meeting of the Town Council this week. Some of the members are getting rather anxious about its formation.\n\nMr. La Foreste, magistrate of Winnipeg, has purchased the offices and business of A. H. Clark & Co., druggists, of this place, and is engaged in making himself as good an individual as he can be.\n\nWe cordially wish him success in his new home.\n\nThere is to be a great gathering here Friday evening in honour of the Queen on the day of her birthday. Several of our people have asked eagerly about the programme and it promises to be a grand success.\n\nMr. Ogilvie, Superintendent Italian Inmate on Springs Island near Westport, left here Tuesday morning for the town at 2:30 p.m.; Mr. Millar, July 5th, the hospital Massena. On Friday at 11:15 a.m., Mr. Woodland, Prince Albert. At 4 p.m., Sunday, the 9th, he took off from Winkler, making the trip in about two hours; Mr. Wilson, Sept. 5th, estimated at 200 miles. This tour is exceptionally good. Mr. Gibson has opened a temporary office at the Queen's and will probably remain longer.\n\nNORTHWEST ASSEMBLY\n\nThe following men have been elected members of the Local Territorial Assembly at Regina:\n\nMessrs. Sawod and Jolley, Regina; Rev. Medveck; Mrs. McIlwain; Wolfner; Peter Isaac; Mr. Appelton; David Capron; S. Q. Appelton; Ross; Moose Jaw; Hamilton; Hedley; Mr. MacDonald; Moore; Brandon; Mr. Watson; Mr. Calverpa; Mr. Eldridge; Colin Heg-Kingston; Sir William Macdonald; Mr. Carter; Mr. James Simpference; Mr. Logborg; Mr. Schnepp; Mr. Applet; St. Vital; Mr. Moir; Mr. Godfrey; Mr. Constance; Mr. Hall.\n\nDEWODY ENDORSED\n\nKINGSTON, June 22.—Judge McMullan of Prince Albert, in an explanation, is interested in one or two of these matters. The proprietors care very little for this story. They were more interested me in local affairs. Speaking of Mr. Dewdney's statement, Judge McMullan said: \"I concur in the late Hon. Thomas White must have to contend with the difficulty of following the course which he followed. As Mr. Dewdney, I must confine myself to what happen, must be taken into consideration rather precipitated against him. It would seem that many others, too, might be brought up to their feet by many of the statements which Mr. Dewdney has made regarding the proposed sale of the C.P. R. and the subsequent failure of the company for the company's part. However, that will make the coterie get up and go to work at something else. After all, the best known has been a matter of opinion. We must trust in the attendance of the horse to go on the road when he goes.\n\nUpon reply, we must know that the house was better known than was actually answered by the horse. To show that the horse was better known than expected, I refered to the charges of supplying rotten bark to Indians and the like of other matters before the completion of the C.P. R., when supplies had to be drawn from Winnipeg to pay costs. I own a distance of six, eight, and ten weeks westward.\n\nIt seems to me that not so much economic way as more, morally or practically. It was more economical to change to Winnipeg. When supplies fell in pieces, they fell four feet deep. It seems to me that it was no use to argue the charge of supplying rotten bark the late Hon. Thomas White must have to contend with the difficulty of following the course which he followed, but that is a matter of opinion.\n\nEdwards recommended the same minister as the omission which has caused the delay in the departure of the steamer from Toronto. From a party point of view, I shall be obliged when the steamer comes again. For the satisfaction, the steamer has had a lengthy and somewhat varied experience and ample opportunity for improvement during its absence.\n\nFavouring the recommendation and requirements of all classes of the Territorials, and the general impression among those who know it best, he would make a good Minister of the Interior.\n\nOUR DAILY BREAD\n\nHeavy and sour bread or bunsit in it vast influence through_the digestive organs and consequently on health. We enjoy how important it is when in eating a turnun, and turnin. We have the bunsit of good health and a sound constitution are very posiuous. We note that they are eaten then, and when it is too late to repair the damage. Nowadays, these persons eat them and try to repair only their heads, but often live, and others are killed or maimed, not only their heads, but their lives, and the heads and lives of others by adding to the preparations of food that appear to be wholesome, although they know nothing. Perhaps a few cents may have been saved, or if there is more than nothing, it is not worth while, nor can it be worth while. Additives used, and the housekeeper takes responsibility and possibly will never ever undo the harm she has done.\n\nFurther, children may have spells of heat, diarrhoea, or indigestion without its being suspected. Theretore, the teeth, or rather the victuals themselves, are affected in their effects. The system of adulterated food goes on. There are some towns where stores are well founded, such as hot bread and cold, found grazed onto the lands, just as much for the royal, as the rivers are as much as the water is pure, as much as the burnt smell. All the systems are the same.\n\nDISTRICT OF ALBERTA\n\nTHE TOPEKA WORLD\n\nIS absolutely the best Daily Paper in Canada,\n\nThe latest and best Political and General News every day in our Edition. Sent free upon application for one month's term, or 5 cents per month.\n\nAddress: THE WORLD, Prince Albert.\n\nNESTLE'S CONDENSED SWISS MILK\n\nPREPARED IN SWITZERLAND.\n\n\"The Richest Cream.\"\n\nA half penny more will send you every article will be found sweet and wholesome.\n\nSMIRNOFF'S\n\nThese are our holy orders who would like to have elegant, large packages of Smirnoff's, Astrakhan, Ribbons by our former new order, containing the latest fashionable shades; adapted for Roman Nose Glasses, Spectacles, Home Brewed Beer and Drams, Fours, Fancy Work, Ladies' Lace, etc., that have so far registering in the past. We are now noticing the recent failure of a large number of dealers in this line by sending only five cents to the address we give below.\n\nAs a special offer, this house will give double the amount of any other sale or leave only five cents to the address we give.\n\nEvery night I scratched\n\nI felt the skin was raw. Body covered with cuts, blisters, open sores.\n\nTowel dyed with blood-red water.\n\nSigned by Captain Redhalles.\n\nMrs. Redhalles. I am going to tell you of the extraordinary happenings that have befallen me over the last few months. Not only do I feel my body fail, but thoughts themselves of it fail me. I am unable to think of anything but the sufferings and pain I have been inflicted. I feel as though I am on the edge of despair, yet I cannot bring myself to make a move. My life has been turned upside down, and I am unable to think of anything but the suffering I have endured.\n\nGEORGE L. COTER.\n\nMerrill, Wis., Sept. 8. Not a trace, whatsoever, of the horse who was stolen from me since I came back from Chicago. No. Since my return, I have been working with a horse named Geo. Cotter.\n\nMOORE & MACDOWALL\n\nFresh to inform the public that they have on hand for sale a half million feet of dry lumber consisting of matched, dressed and undressed\n\n1. **Dressed Flooring**, $48\n   - Undressed do., $42\n   - Dressed Siding, $48\n   - Undressed do., $42\n   - Sheeting, $30\n   - Common Lumber, Dimension do., $35\n\n   Over 10 feet extra\n\n   Lath, 75 cts. per bundle.\n   Shingles, $6.50 per M.\n\n   We are prepared to contract for buildings at cheap prices by any firm in town.\n\n   **We are prepared to contract for buildings at cheap prices by any firm in town**\n\n   Builders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\n   **We are prepared to contract for buildings at cheap prices by any firm in town**\nDOMINION DAY.\n\nHow it was Spent in the Royal City.\n\nFrom early morning people began to come from the country to witness and take part in the sports. The managing committee had sent posters announcing part of the programme, but enough to let the spectators know that the Dominion District knew that its big time was on for Dominion Day in town. The committee appointed a committee of five who raised event together nearly $250.00. The programme consisted mainly of horse racing, and the harness match between the local and Polish clubs.\n\nTHE HARNESS MATCH.\n\nAt about two o'clock a large concourse of people gathered at the grounds to witness the match which was to open the programme of the day's proceedings. Both teams had been practising hard for several weeks, and the excitement and the play on both sides was very good but we must say that it was a team the Polish played the better game, whose own team players thought the half they would almost always look around for one of their own side to throw in, while the Polish players thought if there was any way to get the sphere in the direction of their home regardless of who got it or what was done with it. The result was that Albert won three games in 35, 18, and 42 minutes respectively, and all put through by the Polish. During the last half the game was hotly played several very lively times. The following were the players and their positions:\n\n| Name       | Position |\n|------------|----------|\n| J. Ballantine | Goal     |\n| Kerr        | Point    |\n| Sprent      | Cover    |\n| Mark        | Guard    |\n| W. Ballantine | Defence |\n| Russell     | Officer  |\n| McKenzie    | Centre   |\n| McLeay      | Home Field |\n| Speers      | Horse    |\n| Knowles     | Home     |\n| Rev. Mr. Howard | Captain Coast |\n| Mr. Macleay | Uniques |\n| Mr. Maclean | Const. Garnich |\n\nThe Test.\n\nSoon after the harness match nearly all the ladies started for home, or for a short ride in the country, leaving them for them to see the finish of the horse-racing which was next on the programme. The crowd knocked around the starting and finishing points as well as the women who could not get hurt, for they would not keep back. The track was a quarter mile circular one, which was laid out on the side of the house that was liable to bolt. After the usual waste of time over a private chat among the judges, starters and other nobodies of the race course, the race was run up by Mr. Russell, who had charge of the bell.\n\n1. For ponies standing fourteen hands and under. Prize first $10, second $5, third $3. Distance, quarter of a mile. Three entries.\n\nH. Poch's Little Boy 1 2 1\nJ. McDonald's 2 1 2\nJ. Nelson's Dairy Queen dist.\n\n2. For ponies standing fourteen hands and half standing fifteen hands and under. Half mile. Six entries.\n\nJ. Umphreys' Blue 3 1 1\nG. Nelson's Bay 1 3 2\nF. Sinclair's Cream 5 2 2\nJ. C. Campbell's Blue 4 1 1\nJ. Deboy's Hy. Pearl's Get There dist.\n\n3. Open to all. Prizes, first $10, second $5, third $3. Distance, three quarters of a mile. Three entries.\n\nJ. Umphreys' Blue 1 1 1\nJ. McDonald's Black Back 2 2 2\nR. S. Cook's Green (beloved) 2\n\n4. Open to all, bar Bullenbacher and Cook Robins. Prizes, first $15, second $10, third $5. Distance, quarter mile. Three entries.\n\nF. Sinclair's Cream 1 1 1\nR. S. Cook's Green 2 2 2\nJ. H. McNair 3\n\n5. Trotting or pacing. Prizes, first $30, second $15, third $10. Distance, three-quarters of a mile. Two entries.\n\nH. Harbeck's Pacer 1 1 1\nC. Shipman's Trotter 2 2 2\n\nBetween the hundredth and third races the hundred yard best race was run on. The prize, a silver watch, brought out six contestants. A very bad start was made in this race. The start was by pistol shot, and by some unaccountable reason it was fired before all were ready but Mack and McLeay got off and started away a good pace in the turn. Mack coming in by only a few inches.\n\nAbout six o'clock, and before the programme was much more than half finished, it began to rain, and the weather put a stop to the sports for that day, but as far as they went they were carried on without interruption except in the rain. The officials and the judges of the games were—Judges, Messrs Far- ren, Sanderson and McLeod; starters, Messrs. Walling and McLeay; caretakers, Mr. McLea; clerk of course, Mr. Smith; managing committee, Messrs McLeay, Harbeck and Mr. Nelson.\n\nBUFFALO HALL.\n\nNEW GOODS NOW OPEN.\n\nLadies' Jerseys and Jackets, Cosets, Bustles, Hosiery and Gloves, and a full line of General Dry Goods. Fine assortment of Men's and Boys' Hats! In Felt and Straw. A Full Line of Men's and Boys' Clothing & Mens' Furnishings Groceries, All New and Fresh in both Staple and Fancy Goods.\n\nBETTS & Gwynne.\n\nR.C.W. & Co.\n\nA Large Assortment of Summer Dress Goods, The Latest Shades of Muslins, printed and white, Dress Lawns, India Muslins, New Prints and Wincies Hats, Caps and Straws.\n\nThese Goods will be sold at bottom prices. Inspection invited.\n\nR.C.Wigmore & Co.\n\nCentral Store\n\nClose of the Season for Winter Trade.\n\nThe Annual CLEARING SALE is now going on.\n\nMr. Sh. Lewis has reduced everything in the store in to make room for Large Importations.\n\nMany of which are now on the way.\n\nAll the surplus winter stock will be sold at prices that will astonish you. Don't forget this sale. It will repay you ten fold.\n\nH. Macdougall's Bakery.\n\nGoods delivered to all parts of the town free of charge.\n\nGet Your Houses EAVETROUGHED.\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888070601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 5845, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 7798, 1], [7798, 9871, 2], [9871, 18157, 3], [18157, 23579, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]