[{"id": "5f5f894c24f48ee12b2ad49b3b8b16c2f4ababe2", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., WEDNESDAY, APRIL 4, 1883.\n\nE. FLOOD & CO., Bankers and Brokers.\nNorth West Council Election.\nPRINCE ALBERT, N.W.T., Feb. 27, 1883\n\nD. H. MACDOWALL, ESQ.,\nDean Street.\n\nSir,\n\nWe, the undersigned electors of the District of Lorne, having the fullest confidence in your integrity and ability to represent our interests at the North West Council, hereby pledge ourselves to use our utmost exertions to secure your election as a candidate to represent us at the ensuing election.\n\nWe respectfully request you to accept our nomination and assure you of our support and vote for you at the ensuing election.\n\nWe are,\nYours faithfully,\n\nL. Clarke, Mayor North West.\nC. Miller, Alderman.\nThomas McKeen, Alderman.\nH. T. More, Alderman.\nPhilip Turner, Alderman.\nM. McNaughton, Alderman.\nWilliam McBeth, Alderman.\nJ. R. McMillan, Alderman.\nRobert Brearley, Alderman.\nC. F. Young, Alderman.\nJohn Macdonald, Alderman.\nJohn E. Batts, Alderman.\nR. Goyette, Alderman.\nGeorge A. Miller, Alderman.\nWilliam Miller, Alderman.\nGeorge A. Miller, Alderman.\nW. J. Carter, Alderman.\nAlexander Lang, Alderman.\nJ. M. Campbell, Alderman.\nJohn A. Kennedy, Alderman.\nT. J. A. Aiken, Alderman.\nJames Stevenson, Alderman.\nJames J. Campbell, Alderman.\nWm. Drewer, Alderman.\nJohn D. MacKee, Alderman.\nAlexander McBeth, Alderman.\nJ. Hamper, Alderman.\n\nREQUISITION\nTo D. H. MACDOWALL, ESQ.,\nPRINCE ALBERT.\n\nSOUTH BRANCH, March 18, 1883.\n\nSir,\n\nWe, the undersigned residents of the South Branch Settlement and surrounding country, having the highest confidence in your integrity and ability, respectfully request you to become a candidate to represent us at the ensuing election.\n\nWe are convinced that your character and qualifications make you the most suitable person to be elected to the North West Council, and we therefore respectfully request you to accept our nomination and assure you of our support and vote for you at the ensuing election.\n\nWe are,\nYours respectfully,\n\nEdward Taylor, Alderman.\nJohn H. Jackson, Alderman.\nGeorge Tate, Alderman.\nWilliam Evans, Alderman.\nPhilip Turner, Alderman.\nPatrick Anderson, Alderman.\nFrancis Fournier, Alderman.\nGeorge W. Knowles, Alderman.\nGeorge F. Whitford, Alderman.\nJohn Atwood, Alderman.\nAdam Ishler, Alderman.\nRobert Harper, Alderman.\nJohn McLeod, Alderman.\nJohn Donaldson, Alderman.\nPeter Campbell, Alderman.\nAlexander McBeth, Alderman.\nJeremiah Stevens, Alderman.\nJ. E. W. Brown, Alderman.\nBernard Brewster, Alderman.\n\nTO THE LADIES.\n\nNEW Spring Summer Goods\nJUST RECEIVED BY EXPRESS.\n\nMillinery, Ladies' and Children's Furnishings\nEvery effort made to give satisfaction.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK,\nPRINCE ALBERT.\n\nATTENTION TRAVELLERS\n\nTouchwood Hills House\nThis House is now open for the accommodation of the Public. Travellers will find that the proprietors are anxious to provide for all their wants, and that they will find good accommodation, both for themselves and their horses, at reasonable charges. The House is situated on the main road, and is easily reached by the stage coach from Prince Albert.\n\nLarge quantity of Hay on hand\n\nLOUIS CONTURE, Proprietor.\n\nFOR SALE\n1 Double Buckboard,\n1 Single Buckboard,\n1 Single Set of Harness\n1 Good Sized Native Mare.\n\nCHESTER THOMPSON,\nPRINCE ALBERT, N.W.T.\nTHE PRINCE ALBERT TIMES\n\nWEDNESDAY, APRIL 4, 1863.\n\nSATURDAY'S MEETING.\n\nNo more exciting spectacle, no more humiliating exhibition, was ever before witnessed in Prince Albert than that presented by the proceedings at the meeting held on Saturday last. Even his fellow members were disgusted at his conduct; it is only charity that prevents us from saying that he was doing something worse than usual.\n\nConducted by Mr. Clarke, on every point, Mr. Kennedy's conduct was most praiseworthy. He seemed like a gallant jay every time he had descended. For an honourable member of the Assembly to be so unfitted, but for one whose own platform was a shade of abuse and vilification so unprofitable, would have been an act of charity, but the conduct of Dr. Porter excited him away and made him feel that he was not doing his duty.\n\nHis repeated interruptions of Mr. Clarke, his refusal to allow him to finish his speeches, his utter recklessness as to what he did or said, his disregard of the rules of order, his loud and boisterous manner, might have been found sympathies, but he utterly failed to make any impression whatever upon those who knew his position was most swaggering. Even his own followers could see that he was not doing his duty.\n\nThe Assembly adjourned without doing anything more than to vote a motion that the proceedings of Saturday should not be allowed to stand, and that the members present should be instructed to meet again next week.\n\nNotice to Creditors.\n\nIn the Guards of Alexander Rederick Kennedy, deceased.\n\nBlack and Colored Cashmere, Colored Lusters, All Wood French Belges, Rich Broaches, Black Grey Grain Silk, Blue Satins, Colored Satins in all shades, Black and Colored Velveteens.\n\nPrints\n\nA full and complete assortment in this line, including Ashton's Celebrated Prints.\n\nYarns\n\nScotch Fingering Yarns, Canada and Homespun, in all colors.\n\nCottons\n\nA full line of Bleached and Grey Cottons, Canada Colored Shirtings, Loom Table Linen, Russia Cash Toweling.\n\nHandkerchiefs\n\nA Choice Assortment of Ladies' and Gent's Silk and Linen Handkerchiefs, Turkey Red Handkerchiefs.\n\nQuilts\n\nWhite and Colored Quilts in all sizes.\n\nBlankets\n\nWe offer special value in Hudson Bay Wool Blankets—$2.50 and $3.00. Grey Camp Blankets.\n\nSmallwares\n\nLinen and Cotton Spools, Silk Twist, Silk Spools, Buttons, Needles, Pins, etc., etc.\n\nWHOLESALE CLOTHING.\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nJames O'Brien & Co.,\nPrincess Street, Winnipeg.\n\nPRINCE ALBERT REAL ESTATE AND AUCTION ROOMS\n\nMESSRS. PETERSON, HANAFIN & KEENAN\n\nREAL ESTATE AGENTS,\n\nFor sale the following lots situated in the business part of the rising town of Prince Albert:\n\nMISSION PROPERTY.\n\nLot No. 10, Block A, Lot 29.\n\nHUGH & BAKER ESTATE.\n\nLot No. 10, Block A, Lots 28 and 29.\n\nHughes Estate.\n\nLot No. 10, Block A, Lots 28 and 29.\n\nDOUG. PETERSON, J. D. HANAFIN, H. KEENAN.\n\nOYSTERS, OYSTERS, OYSTERS.\n\nWe have just received a few CASES of FRESH OYSTERS, which will be sold at COST.\n\nAT THE ROCK BOTTOM STORE.\n\nALSO A FEW CASES\n\nDRY GOODS, GROCERIES, BOOTS and SHOES,\nRUBBERS, CROCKERY and NICKEL-PLATED OUTLERY.\n\nOur Motto: Small Profits and Quick Returns.\n\nH. WALTERS, F. C. BAKER.\n\nHATS THAT R HATS.\n\nIf you want a first-class HAT of the latest style go to the Horse Shoe Store.\n\n25 PER CENT OFF FOR CASH.\n\nWDODBINE BILLIARD PARLOR\n\nThe Palace Saloon of the North West.\n\nTwo Doors west of the Horse Shoe Store, River Street.\n\nTwo First-Class Brunswick and Balk Tables. Crowded nights. Best Beer. Sparkling Cider. Finest Imported Cigars.\n\nTom Davis — Prop.\n\nHUDSON'S BAY CO.'S FARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC J BRYDIE, Land Commissioner.\nMASS MEETING\nUnder Bust of the Porter Party\n\nMackay's Election Curtain.\n\nThe mass meeting arranged for last night under the Bust of the Porter Party was held at the Hall. Mr. Mackay, who had been invited by Mr. Porter, addressed the meeting. He spoke of the importance of the election and encouraged everyone to vote. The meeting ended with a vote of thanks to Mr. Mackay.\n\nFARMERS' NOTICE\n\nA HARRIS, SON & CO.\nHave delivered to the late-registered and still client number of Ploughs and Harrows\n\nS. W. VANLUVEN.\nPRINCE ALBERT.\nReal Estate\nFOR SALE - A NUMBER OF CHOICE BUILDING LOTS\nCENTRALLY SITUATED IN PRINCE ALBERT\nSuitable for business purposes or private residence.\n\nC. MAIR,\nPrince Albert, N.W.T.\nTHE BEST\nBEER AND CIGARS\nSTOBART,\nEDEN\n& CO.,\nGeneral Merchants\nAND\nIndian Traders,\nPRINCE ALBERT, N.W.T.\n\nRIDGE STORE.\nJohn E. Sinclair\nDry Goods, Groceries,\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nLay by Mr. Northgrave's New Store\nA LARGE STOCK OF\nWatches, Clocks and Jewellery\nKEPT CONSTANTLY ON HAND\nRepairing Promptly Attended to\nWatch, Clocks, Jewellery,\nStationery.\nJoseph Rogers & Sons Company, best\nQuarantine Electroplated Ware, Allotable\nWare, Glassware, etc., in stock.\nSpecial attention to repairing. Work of all kinds in offices and houses.\nR. B. WAY,\nPost Office, Prince Albert, N.W.T.\nPotatoes.\nPotatoes.\nOn hand for sale. Potatoes in lots wholesale and retail.\nE. W. SMITH\nTAILOR AND BARBER\nCall on Smith, the Tailor, for your Clothes.\nFit Guaranteed.\nCutting a Specialty.\nHair Cutting and Shaving.\n\nJAMES SCOTT,\nGABLE HOUSE,\nPRINCE ALBERT, N.W.T.\nFURNITURE I\nFURNITURE I\nG. & G. CARTER,\nOn hand a large assortment of selected goods, including furniture, bedsteads, couches, teets, bedroom sets, chairs of nearly all descriptions, cradles & cribs for babies, rocking chairs for ladies, mattresses single & double to suit customers.\n\nPUMPSI\nFresh Food Pump Manufacturer.\nWell sunk and Pumps set. General Agents.\nAcorn & Cross,\nTROY, C. P. R. WEST.\nNearest Point by Rail to Fort Qu'Appelle and all points N.W.T.\nStorage and Re-Shipping Warehouse.\n\nThe undersigned having opened a ware-\nhouse for the storage and re-shipping of\ngoods that he is prepared to receive from\nall parts of the world, offers the same\nstorage facilities to all who may be inter-\nested. Charges moderate.\n\nS. H. CASWELL,\nMEDICAL HALL,\nT. E. JACKSON,\nCHEMIST AND DRUGGIST,\nhas on hand a large supply of\nBlue Stone, Gaster Oil, Linseed Meal,\nEpsom Salts, Sulphur, Horse Medicines,\nAsin, Chemicals, Eye Stuffs, Spices,\nPatent Medicines, Druggist's Sundries, Perfumery, Toilet Articles, Sponges.\nPatent Medicines,\nJobbers supplied on reasonable terms.\nSpecial discounts on large orders.\nPhysicians' prescriptions and family recipes carefully prepared.\n\nTERMS--CASH.\nT. E. JACKSON,\n1879.\n\nBUFFALO HALL\nTo land this week INVOICES of SPRING GOODS now on the way from MONTREAL, TORONTO and HAMILTON.\nSTILL LEADING.\nOur Closing Sale the GRAND SUCCESS of the Season. Every article of HEAVY GOODS must be SOLD.\n24 DOZEN CHOICE ENGLISH and AMERICAN HATS now open.\nBETTS & Gwynne.\nT. N. CAMPBELL,\nBookseller and Stationer\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nNOTICE.\nFresh Oysters\n75cts per CAN.\n\nFresh Butter\nAt Ashdown's", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883040401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3039, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3314, 1], [3314, 7425, 2], [7425, 9744, 3], [9744, 10810, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]