[{"id": "a7494e664cc3ab659987a30ab26b7c2d5b744587", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT, N.W.T.\nTUESDAY—8½¢ per copy in advance.\nSingle copies—10 cents each.\nIt is not necessary to be connected in this paper. However, local, city, provincial,\nNo advertisement inserted for less than 10¢.\nAdvertisements without instructions will be rejected.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nTHIS PAPER may be found at the following places:\nPRINCE ALBERT—Corner of Main and 2nd.\nNEW YORK—14th Street and 6th Avenue.\nFRIDAY, MARCH 11, 1887.\n\nWARNING\n\nWe desire to warn our friends, against people who are going up and down the country stating that the Government has been defeated; as there is no truth to such statements. The Government had a majority of 24 on the 26th of February, and four more supporters have been elected since then. In Algoma, and for British Columbia, and when the remaining elections have taken place Sir John's majority will be over thirty.\n\nRemember Tuesday Next!\n\nElections of Saskatchewan, remember the date you owe to yourselves and to your country on Tuesday next! Rally to the support of a fellow settler. Rally to the support of a man who has given liberally of his means for the development of Saskatchewan. Remember the appeal of a man who makes his living in your midst, who will prosper if the country prospers. Away with party spirit. We have a common race, a common home, a common interest. As pioneers of the Northwest, rally behind Mr. Macdonald, the only man who is worthy of your support. Rally to the support of a fellow pioneer, remembering the while that if the development of our common home depends upon anyone else but Mr. Land's stamp it would not have emerged from its primitive state, and we would not be standing today in comparative peace and prosperity as the result of the Great North-West war.\n\nRally to the polls therefore, on Tuesday, and woe unto those who disapprove the interference of an outsider and a bachelor in the affairs of the House of Commons. Fight your own battles. Your enemies will not fight them for you.\n\nTHE LAST WORD.\n\nTuesday next, the 15th of March, 1887, will be a memorable day in the history of Saskatchewan. On that day the people of the province will be called upon, for the first time, to elect representatives to the House of Commons. For years now the people and the people of the Territories have been knocking at the doors of the Dominion Parliament for representation. For years they have claimed, and with good reason, that the interests of the Northwest would be neglected by a government elected in the House of Commons by men whose hopes and interests were centered in this eastern part of the Dominion. In view of that right, it is our duty to put in practice the doctrines we have been preaching, and to elect Mr. Macdonald and Mr. Macdonald alone, to represent us at Ottawa. Such representation as we are obtaining by the Liberal party is not so good, nor so safe, nor so certain as that which we had before. It certainly is not our idea of Northwest representation, nor do we believe that the people of any other district, none of them have been doing anything outlandish. We, above all others, desire that Liberalism should be accorded to whate'er doctrine we have espoused so long and so earnestly with our presentation. We also, through our Liberal friends, have gone a begging to the Atlantic coast, for brains to represent us in the Commons. We could have done better by ourselves. We are residents of Manitoba, because, no matter how far away we may be different from the rest of the world, we feel that Northwest interests would be looked after by a Prince Edward Islander in view of the fact that the interests of the latter would not be allowed to interfere with those of the former. As matters stand, however, we must make the best of things.\n\nTo make things worse, Mr. Land has a penchant for breaking loose from the party line. He was elected in 1878, and he is liable to do again if he has the opportunity. He is opposed to Mr. Macdonald, and he is opposed to the party line. He is opposed to the party line, and to their English-speaking neighbour, Mr. Macdonald. This is not the man to be supported. Mr. Macdonald is a political trickster of the worst stamp. Pray God he has not. His record is repugnant to every thinking man. He represents nothing. He is nothing, he is a political trickster of the worst stamp. Pray God he has not. His record is repugnant to every thinking man. He represents nothing. He is nothing, he is a political trickster of the worst stamp.\n\nMr. Macdonald will at the South Branch, and will visit Saskatchewan before he returns to Prince Albert.\n\nReports from the different settlements show a large majority for Mr. Macdonald. All his friends have to do is to go to the polling stations and vote for him.\n\nMr. Clink skill telegraphs from Ritterfield as follows: \"You can assure the people of Prince Albert that Mr. Macdonald is the man best fitted for the abilities of the respective candidates and on polling day will show that Mr. Macdonald does not interfere with their choice of the best man for the whole district.\"\n\nMr. Macdonald's knowledge of the wants and interests of Ritterfield and the Northwest is most desirable. As far as can be judged at present he will obtain very handsome majority, who, the polling takes place, will be able to hold his seat for many years to come.\n\nMr. Macdonald's ability and long experience, has come out square for Mr. Macdonald and will secure a large majority. Mr. Clink skill is evidently one who, while he holds his party name, loves his country and his fellow man.\n\nVote for Mr. Macdonald and a resident member.\n\nInformation to Electors.\n\nThe following is the qualification of electors as prescribed by the Parliament Act:\n\nEvery person qualified to vote at the election from the male resident and householder of the constituency, or any portion thereof, who is of the age of twenty-one years, or of the age of eighteen years and of sound mind, and who has been registered in such constituency or division thereof for at least six months immediately preceding the day fixed for the election, shall be entitled to vote for that constituency, or division thereof, at the election.\n\nEvery elector, after having voted, shall give his name and address to the returning officer, and shall declare for which candidate he votes.\n\nA further reduction of 10 cents, will be made if ordered.\n\nFERRY'S SEEDS\n\nRem.\n\nCamp Steves and Co.\n\nJAMES JAMES\nADDRESS\n\nTo the Electors of Saskatchewan.\n\nSASKATCHEWAN.\n\nOn behalf of a number of electors in the District of Saskatchewan, I beg to offer myself as a candidate for your suffrages at the coming election of a member for the Federal Parliament. If elected, I shall use every endeavor to secure the local interests of the District, and shall urge on the Government the necessity of aiding the railway community at Prince Albert, Battleford and Saskatoon.\n\nThe building of a bridge across the South Saskatchewan River; The granting of assistance to the island at Hudson's Bay; The school education of the aboriginal children of Halfbreed bands of families from the Territories between 1879 and 1883.\n\nThe two amendments of the permit system by repealing the liquor question. The privileges given to the Indians.\n\nA speedy passage on a liberal scale of all just claims against the Government for losses.\n\nThe introduction of a graduated land grant system under the most favorable circumstances possible.\n\nThe purchasing of supplies for public purposes within the district affected by the election.\n\nThe removal of a Legislative Assembly for the exclusive use of the Legislature of which the electors of Saskatchewan shall have full voice and part.\n\nAs a local man whose interests are closely identified with the future of Saskatchewan, I appeal to every elector at this important, for support.\n\nI am, gentlemen,\n\nYour obedient servant,\n\nD. H. Macdonald.\n\nAVIS D'ELECTION\n\nDistrict Electorali d'Saskatchewan.\n\nSASKATCHEWAN.\n\nAVIS public : est par le present donné pour recueillir les voix des électeurs de cette province sur l'emplacement du maire de la ville de Regina, et qui serait ouvert le premier jour de l'élection suivante.\n\nMarcha pionnier de jour d'Élections, Mars, 1887.\n\nLe dépôt non moins de quatre-vingt jours avant le jour de l'élection, ou suffisamment plus tôt que nécessaire.\n\nLa circulaire officielle de scrutin également.\n\nLes détails concernant les lieux d'évasion non mentionnés dans ces présentes et autres instructions, en vigueur, feront l'objet de deux autres instructions, lesquelles seront affichées à la fin de ce bulletin.\n\nLEGENDE : Pour le budget de l'élection suivante, se fait sur :\n\nDivision No. 1. — Comprendant les territoires sis au sud de la rivière Battle.\n\nDivision No. 2. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 3. — Comprendant les territoires situés à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 4. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 5. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 6. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 7. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 8. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 9. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 10. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 11. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 12. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 13. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 14. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 15. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 16. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 17. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 18. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 19. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 20. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 21. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 22. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 23. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 24. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 25. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 26. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 27. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 28. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 29. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 30. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nDivision No. 31. — Comprendant le territoire situé à l'est de la rivière Nechako, y compris la ville de Prince Albert.\n\nG. BOWEN.\n\nCORRUPT PRACTICES.\n\nFalsification is a Crime (why does the law exist to prevent corrupt practices at Federal elections in the N.W. Territories vide The Northwest Territories Representative Province Bill)\n\nPERSONATION. Every one who tenders his vote in another person's name or whom he represents the emblem of another party at an election, he commits perjury upon himself as well as to the person whose name he uses.\n\nNo person who is on the electoral petition fall to be disqualified or on being called upon to produce any paper required by the Judge to have been distinctly or inscriptively written, or to be answered or answering his questioning shall be proceeded against or summoned as a witness before any judge of any contesting court.\n\nPRIVILEGE. An elector who fails to be present at his polling station in person must not be charged with absence.\n\nTESTIMONY. The declaration that any elector shall be disqualified through the delayed service of a writ not delivered within the regular period is invalid.\n\nEXEMPTION. All persons who are exempt from the liability of service for any other purpose are excused from the personal service and are permitted to deliver the writ or give other evidence by mail.\n\nDISTRICT OFFICE. Election officials shall make known to every elector where the polling places are situated.\n\nVOTER TRUST. Any elector must be able to read or write or must be accompanied by any person who can do so.\n\nDEFENDANT. Any elector who refuses to answer any question put to him or who answers without giving his name or address and refuses to have his vote counted may be charged with assault and battery.\n\nFREE PERSON. Any elector who holds no office or public trust and who is of sufficient intelligence to understand the questions asked may be charged with free personage.\n\nCONTINUOUS VOTER. Any elector who has been adjourned at any time during the election and who does not attend at the specified place of voting may be charged with continuous voterage.\n\nDENIAL OF PRIVILEGE. Any elector who has refused to have his vote counted may be charged with denial of privilege.\n\nPRIVILEGE OF EXEMPTION. Any elector who is exempt from the liability of service for any other purpose is excused from the personal service and is permitted to deliver the writ or give other evidence by mail.\n\nElection officials shall make known to every elector where the polling places are situated.\n\nTHE BILL TO PROTECT THE EMBLEM. This bill should provide for the protection of the election emblem against tampering with or altering it.\n\nPRIVILEGE OF DISENTIREMENT. Any elector who has been adjourned at any time during the election and who does not attend at the specified place of voting may be charged with disentirement.\n\nPRIVILEGE OF ABSENCE. Any elector who fails to be present at his polling station in person must not be charged with absence.\n\nTESTIMONY. No elector is bound to give testimony beyond that which is required by law.\n\nCALEDONIA BREWERY\n\nEAST END.\n\nTHE PROPRIETOR OF THE ABOVE ESTABLISHMENT HAS PREPARED THIS ADVERTISMENT IN ORDER TO TEACH THE PUBLIC HOW TO DISTINGUISH BETWEEN THE BEST AND IMPROPER QUALITIES OF ITS PRODUCTS.\n\nA BILLIARD TABLE AND SALOON\n\nLIVERY & FE D STABLE\n\nCHAS. WOODMAN\n\nPROPRIETOR\n\nTHE STAR KIDNEY PAD\n\nPROFESSIONAL POSTICHEURIES FOR FIRST CLASS PERSONS\n\nBILLIARD TABLES AND JEWELLER\n\nA LARGE STOCK OF WATCHES, CLOCKS AND JEWELLERY\n\nA.C. PATTERSON\n\nFORWARDED AGAINST\n\n\"PART BUTCHERS\"\n\nORGANS\n\nCATALOGUES FREE\n\nSAXOPHONE\n\nBELL & CO., Geelong, Vic.\n\nBUFFALO HALL\n\nGRAND STOCK-TAKING SALE\n\nNOW GOING ON.\n\nDry Goods, Clothing And Groceries\n\nALL REDUCED IN PRICE\n\nBETTS & GWINNE.\nELECTION NOTICE.\n\nElectoral District of Saskatchewan.\n\nPolling Division No. 1 - Comprising territory from the South Branch of the Saskatchewan River to the 53rd parallel north, thence west along the 53rd parallel north to the windermere Lake; east along the 96th meridian to the Quaternary Sheets II & IV; north along the 96th meridian to Quaternary Sheet X; west along the North Arm of Quaternary Sheet X; thence south along the North Arm of Quaternary Sheet IX; thence west along the East Side of Quaternary Sheet VIII E & W; thence south along the West Side of Quaternary Sheet VII W; thence west along the 86th parallel west longitude; north into the Province of Manitoba.\n\nPolling Division No. 2 - Comprising the territory lying west of the 96th meridian, and north of the 53rd parallel; thence west along the 96th meridian and 49th parallel; northeast along the 50th parallel to old Canada border; thence east along the Canada-British border to the nearest point west of the narrowest part of the body of water between the extreme eastern extremity of the Peace River and Turtle Rock.\n\nPolling Division No. 3 - Comprising the territory lying west of the 92nd meridian and north of the 53rd parallel; thence west along the 92nd meridian and 49th parallel; northeast along the 50th parallel; northward thence west along the Canada-British border to the nearest point west of the narrowest part of the body of water between the extreme eastern extremity of the Peace River and Turtle Rock; thence south along the Canada-British border to the nearest point west of the narrowest part of the body of water between the extreme eastern extremity of the Peace River and Turtle Rock.\n\nPolling Division No. 4 - Comprising the territory lying west of the 90th meridian and north of the 53rd parallel; thence west along the 90th meridian and 49th parallel; northeast along the 50th parallel; northward thence west along the Canada-British border to the nearest point west of the narrowest part of the body of water between the extreme eastern extremity of the Peace River and Turtle Rock; thence south along the Canada-British border to the nearest point west of the narrowest part of the body of water between the extreme eastern extremity of the Peace River and Turtle Rock.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887031101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 4571, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6550, 2], [6550, 16072, 3], [16072, 18342, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]