[{"id": "e0ec7a8623ddb596d55971d2ace4fd50161a5aff", "text": "THE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT CHURCH SERVICES\n\nSt. Mary's\nSt. Andrew's\nSt. John's\nSt. James'\nSt. Anne's, Catholic\nSt. Paul's, Presbyterian\n\nFRIDAY, JUNE 12, 1865.\n\nOUR PROSPECTS\n\nIt is to be devoutly hoped that the Government will immediately be able to decide upon and make known its policy with regard to the protection of the property in the future, the termination of which is, of course, impossible to hope that any assurance which can be given will prevent a severe check to the prosperity of any individual or of settlement at some time to come. The prompt adoption and publication of some satisfactory course might have the much desired effect of putting a stop to a continuance of the present excess of all the families who are attempting every effort to get away. What the unfortunate people of Batoche, who, at one stroke, and by no fault of their own, have lost their homes and worldly means, appear to do cannot be easily imagined, as a number of them must have been deprived of even the means to get away. It is said that many who have witnessed the gradual, and all considered, the wonderfully rapid growth of this settlement under the most discouraging circumstances, to hear of the number who feel compelled to abandon it after all—see the result of years undone in a single day. Enough has been said in condemnation of those of our people who may have indirectly encouraged what has happened; but, after all, there is nothing more than a very insignificant proportion of those who have to suffer. The bulk of the loyal settlers, who, as long as Riel was allowed to remain Governor, showed an unfeigned spirit of evil, in the fear of being misunderstood, refrained from any marked expression of grievances none the less felt—were deeply wounded by the conduct of the Government in removing the arms from here. When necessity arose they postponed their efforts and openly responded to the call for help, which should never have been necessary. In doing this, they brought upon themselves the deepest enmity of those who over and over again assured them that their quarrel was with the Government alone. The friends of Riel, who have been hitherto so great a stumbling-block to be endangered because there may be influences brought upon the Government to make light of an evil they find rising to prevent? Unquestionably, and in the presence of others almost as dangerous as himself, be put beyond the power of doing further harm, the loyal settlers will sooner or later be made to suffer for standing by the side of a man who has been proved to be a traitor. As the ending of the file of French half breeds, we do not wish to see them further punished, but those who are well known to have assisted them up to the pitch of their bellows, and who have been given the opportunity to go, by renewed violence, and they neither deserve clemency, nor in the interests of law, having assisted, can be treated as such. Even if the first have been wounded, ordinary prudence will require the keeping up for a considerable time of strong garrisons at various points, and it would be especially wise to do this so well as to keep the government, by declaring its intentions, either to set our minds at rest, or let us make arrangements to leave the country as speedily as may be. As the Indians are only prepared at this stage to defend themselves, it seems best that they be removed far out of reach of us. Official despatches, as reported in the press, seem generally to speak of them as having been forced to retire, and it would attend us here barely to learn the compelling circumstances. The whites who went from here have been for years back almost entirely deserted by the settlers, and were deserted for supplies of food that would supply greatly their wants. This was not only refused to do, but were with difficulty restrained by the Metis from massacring our people—prevented from doing so—and it is considered important that the promises bargained for Rich for the place of killing the women, when this town should have been captured. That the Metis rubbish they are giving the commandants some excuse for their delay, or rather for having delayed, we do believe. By all means let the authorities say at once what they mean to do.\n\nWe perceive that the Winnipeg Times feels aggrieved because our issue of the 13th March contained no account of Riel's meetings at the south branch, which more immediately preceded the outbreak. We may say that the people here, and the Metis, were convinced of some who had had the courage of their opinions, would have, like the rebels, backed them at the risk of their skins—had no more liked the idea of going away at hand than had the citizen of the town. The intentions of Riel and those who sent for him were, we always believed, the very worst, but the utter indifference of the Government was naturally supposed to have for its object the quieting the amount and proximity of the danger than any one else, led the public naturally to conclude that such serious steps could be imminent. The feeling was, however, that something had to be done, and that the less notice taken of them, the less encouragement would be given to keep them up, and to many who were believed to be at\n\nCHESSTER THOMPSON,\nGeneral Blacksmith,\n\nSTEWART BROS.,\nTRADERS,\nGENERAL MERCHANTS\n\nRepairing Farm Machinery a Specialty.\n\nPRINCE ALBERT\nPlaning Mills and\nSash and Door Factory\nCORN, HERRIT AND GRAIN ST.\nSash, Doors, Frames, Blinds, Mouldings, etc.\nFurnishings on order\non the shortest notice.\n\nTHOS. POWERS,\nin Prepared to Take\nCONTRACTS\nfor\nBrick, Plastering and Stone Work.\nAll orders promptly attended to.\nEstimates furnished.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAt T. N Campbell's New Store.\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\nKEPT CONSTANTLY ON HAND.\nPromptly Attended to.\n\nJAMES SINCLAIR\nMerchant Tailor,\nand Dealer in\nBENTS' FURNISHINGS.\n\nNEW GOODS!\nMEDICAL HALL\nBurdock Blood Bitters,\nBurdock Healing Ointment,\nBurdock Pills,\nVictoria Hypophosphites,\nVictor & Bucha & Uva Ursi;\nFreeman's Worm Powders;\nYellow Oil.\n\nT. E. JACKSON\nAt the Old Stand.\nTHE REBELLION.\n\n(Continued from Our Last)\n\nThere can be not the slightest doubt but that many English half-breeds and Canadian settlers deliberated and finally came to the conclusion that they would be equally notorious that many of these two classes attended the meetings held in their localities. It was also generally admitted, whatever may be our sense of shame, in having to admit the fact, that some of those who gave anything fairly good social positions to our community, and claiming the possession of decent feeling and of some sense of honor, and who had issued an invitation inviting Red to hold and address a public meeting within the limits of their townships, and who were decidedly however indignant at the time, may have discovered in the unyielding events which followed, that their actions were a manifestation of our attitude of hostility towards the action.\n\nMeetings at various points during the time that Big Bear's people were here, may help us to understand why it took only a few white settlers attended them, yet why such an attempt was made by them, in the name of language which no doubt implies, to put their own principles to bear on the matters discussed. We know that the Metis, required no sooner than to have most permissive effect upon the clear conscience of those who came forward, that those men were more than worthless tools in the hands of their master—his followers. The Metis, however, must have felt fairly closely be questioned—at least by a large part of the population—seen among the blood of innocent women, who cried for vengeance, and the blood of innocent children, who were outraged and tortured by the savages. That they were warned again, and again, and that they knew they were outsiders in a country containing homes of already dispossessed Indians, who were there to protect them, and yet, we find that they did not think that Red meant to do them any harm. Do songs of them, from the mouths of others, ever come to that tune when they would start the government, and to implicate their own people? Would they not have been justified in doing so? If they chose to dignify with the name of thinking process by means of which they became convinced that they were treated unfairly, why, no, too late, too late to oppose their estimate of probable future, which they could easily see, that they would be harmed. That all who attended those meetings are equally guilty it would seem to be a fair statement. But why were none of our members of our community ever appeared at them at all, or even heard of them? Why does the difficulty of bringing home to the reality of the attempt to uproot rebellious tendencies, in the case of the Metis, appear so evident at this distance of time? Is it not perfectly useless, but just possible that some who attended those meetings are equally guilty? Would it not seem to be a just statement that perhaps some who attended those meetings are equally guilty? Would it not seem to be a just statement that perhaps some who attended those meetings are equally guilty?\n\nThe difficulties of bringing home to the reality of the attempt to uproot rebellious tendencies, in the case of the Metis, appear so evident at this distance of time? Is it not perfectly useless, but just possible that some who attended those meetings are equally guilty? Would it not seem to be a just statement that perhaps some who attended those meetings are equally guilty?\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nBuffalo Hall!\n\nStill continues to be a source of annoyance to general business men.\n\nFRESH GOODS THIS WEEK:\n\nTeas, Tobaccos, Sugars, Oatmeal, Canned Goods.\n\nOur prices for the past three weeks have given the greatest satisfaction.\n\nIt is now our intention to clear out the bulk of our stock remaining at still greater reductions.\n\nThe public will do a wise thing if they examine fully our lines in Dry Goods, Clothing, Messes' Moccasin, Fruit Groceries and Provisions before purchasing.\n\nThe largest stock of Furs, Mitts and Moccasins.\n\nThe largest stock of Groceries and Provisions.\n\nAnd the largest reductions from 1 time prices will be found at Buffalo Hall.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nFresh Groceries\n\nT. O. DAVIS\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings at cheap rates, any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885061201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2772, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6180, 2], [6180, 10779, 3], [10779, 11681, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]