[{"id": "28d168254410883fed6c415ed38eaf197eece3f6", "text": "ELECTION NOTES.\n\nMr. Macdonald is making a thorough canvass of the outlying portions of the District, and is meeting with the most gratifying success. He has already made a tour of the French settlements, a deputation having waited upon him and asked him to come to their aid. When he has visited all the adjoining settlements, he will return to Prince Albert and hold a public meeting at which he will give his views on the question.\n\nThomas Swan, Andrew Spencer, and Mr. Leslie left for Battleford on Tuesday last, to make a personal inspection.\n\nOn Wednesday last Messrs. Alex. Macdonald and Legare arrived here from Melville and St. Louis. Legare was instructed by Mr. Macdonald to make a report to the settlers to Mr. Macdonald.\n\nThe following letter has been received from Mr. Molloy:\n\nTo Mr. J. D. Macdonald,\n\nMr. Laurence, Jan. 26.\n\nIt is good enough to announce to the Committee of the Liberal that I have withdrawn from the contest, and will use my best efforts to promote the success of the party now in power.\n\nR. J. Molloy.\n\nPer Fremont, on receiving word of Mr. Macdonald's withdrawal, wrote to Mr. Molloy, immediately telegraphed to Mr. Hector Legare, offering his support to Mr. Macdonald.\n\nAt a meeting of the delegates of St. Catharine's and Lindsay districts, held on Tuesday last, it was unanimously decided to take a ballot. Mr. Macdonald, as the only Government supporter, or Mr. Laurence as the nominee of the Liberal party, or an independent candidate, should be elected to represent the support of those districts. The result of the ballot was as follows:—For Mr. Macdonald, 15 votes; for Mr. Laurence, 1 vote. In consequence a delegation immediately waited upon Mr. Macdonald to acquaint him of the unanimous result of the vote of the delegates.\n\nLIEUT. GOVERNOR DEWNEY.\n\nWe have found it our duty on one or two occasions to differ with Lieut. Gov. Dewney in regard to the manner in which he occupied the gubernatorial chair. Whether we were then in error, or whether he is now justified in declining the high and honorable duties pertaining to the Government of the North-West, we shall have to see. If so, we will not at present discuss. Suffice it to say that now, no such charges can be made, and we have no reason for standing in the way of frank manner possible, that during the past few years, he has proven himself to be an honest and able-minded man, who not only has ever been ready to grapple with all and any difficulties that presented themselves, but has been able to master them. We echo this to the Lieut. Governor, and we think we voice the sentiment of the whole country when we say that he should Sir John confer upon him another term of office. We believe that there is no link in the long chain that binds the Northwest to himself and his Government. We trust that he will be given consideration for our remarks and extend to Lieut. Governor Dewney that which he has so richly earned, and which the people of the Northwest desire.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER--(Hop)--ALE.\n\nDelivered to all Parts of the Town.\n\nMcINTOSH & GERRARD.\n\nT. N. CAMPBELL.\n\nJUST RECEIVED A LARGE STOCK OF\n\nMUSICAL INSTRUMENTS\n\nAccordeons, Harmonicas Violins, &c., &c.\n\nLATEST NOVELTIES IN TOYS,\n\nWHICH FOR THE NEXT WEEK I WILL SELL\n\nAT COST FOR CASH.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapistry Carpets, Crimson Red, Green, Black and Yellow, Door Mats, Crumb Cloths, Silk Corded Cushions, Empress Cloth in Black and Garnet, Fine Perforated Lace, Ladies' Felt and Embroidered Pina Coats, Ladies' Fancy Frillings, Beeze Veiling, Ladies' Silk Ties, Tinsel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Tinned Goods of all kinds.\n\nCLEARING SALE!\n\nALL REMAINING PARLOR STOVES\n\nAT COST.\n\nT.J. AGNEW.\n\nWM. STOBART & CO.\n\nGeneral Merchants AND Indian Traders\n\nWM. STOBART & CO.\nANALYZING THE BAKING POWDER DEPARTMENTS.\n\nUnder the direction of the New York State Board of Health eighty-four different kinds of baking powders, embracing all the brands now in use, were tested by Mr. G. L. Lovell, who was employed to examine and analyze by Prof. C. F. Chandler, a member of the Board. The tests were conducted under the supervision of the New York City Board of Health, assisted by Prof. Edward G. Love, the well-known United States chemist.\n\nThe official report shows that a large number of the powders examined were found to be adulterated, and many of them to such an extent as to render them seriously objectionable for use in the preparation of food.\n\nAll the leading powders of the market, with the single exception of \"Royal\" (not included), were found to contain foreign powders, which have been discarded as unsafe or inefficient by prudent housekeepers. Such a mixture of tartrate of tartar and soda is found to be far below line and utterly impossible in any samples to the extent of 93 per cent. of the original ingredients.\n\nAll the leading powders of the market, with the single exception of \"Royal\" (not included), were found to contain foreign powders, which have been discarded as unsafe or inefficient by prudent housekeepers. Such a mixture of tartrate of tartar and soda is found to be far below line and utterly impossible in any samples to the extent of 93 per cent. of the original ingredients.\n\nThe only baking powder yet put on the market which has been found to be absolutely pure is \"Royal.\"\n\nThis perfect purity results from the extreme care taken in the manufacture, refined and prepared by patented processes which totally exhaust the fat content of the wheat flour used. The result is that the chemically pure content of tartrate of tartar is greater than any other, and on account of this fact it is the best for use in baking powder bottles.\n\nProf. Love has made the analysis of baking powders for the Board of Health, State Board of Health, as well as for the Government, says the purity and whole consumption of \"Royal.\"\n\n\"I have tested the contents of Royal Baking Powder, which I purchased in the open market, and find it composed pure and simple of tartaric acid. It is a cream of tartar powder of a high degree of purity, and does not contain stings, also no phosphates or other foreign substances.\"\n\nE. G. Love, Ph. D.\n\nREVENUE AND EXPENDITURE.\n\nThe statement of revenue and expenditure for the month of December and for the year ending December 31st continues to show a most gratifying increase in the former and decrease in the latter. The total revenue for the year Customs, $27,604; Excise, $27,130; other sources, $223,914, a total of $278,548 as compared with $2,300,000 for the same period last year, showing an increase of $1,021,390, of which $148,014 is in income, $11,910 in overdue, and the remainder in interest, penalties, etc.\n\nThe expenditure of the month was $2,257,169; $8,952 less than December last year, but for the year the result has been as follows:\n\nRevenue, $1,027,667.\nExpenditure, $1,030,785.\nSurplus, $3,118.\n\nFor the same period last year the figures were:\n\nRevenue, $2,300,000.\nExpenditure, $2,257,169.\nSurplus, $42,831.\n\nOr to put it another way the revenue having increased about two million and a quarter, while the expenditure decreased more than two millions, a deficit of over two and three quarter millions has been converted into a surplus of more than three millions and three quarters. The greatest increases have been in customs ($1,057,238) and excise ($1,023,185), while the public works, including railways, also show considerable increase. Taxes alleged to be due from the Canada Southern is highly unlikely and indicates that, after allowing for the half yearly advance in the previous year, will not reach the amount stated. In this month, a very handsome surplus is likely to accrue before the close of the fiscal year.\n\nMONTREAL TIMES.\n\nTHE WEEKLY BULLETIN.\n\nREAD BY EVERYBODY\n\nAND\n\nBENEFICIAL TO ALL.\n\nJ. M. CAMPBELL'S,\n\nDEALER IN\n\nDry Goods, Groceries,\nReadymade Clothing,\nBoots, Shoes,\nCrockery,\nProvisions.\n\nAt such low prices as will make all old and new customers go home pleased, remember that it is the place to spend their money and do their trading.\n\nAll are invited to call and examine our stock.\n\nA FIRE LOT OF\n\nBEEF!\n\nJUST ARRIVED AT LOW PRICES.\n\nJ. M. CAMPBELL.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nTOWN COUNCIL\n\nThe Council met in Council Chamber on Monday evening last.\n\nPresent.—Mayor Macdonald and Committee Bain, Stewart, Agnew and Hartnab.\n\nThe minutes of the last meeting were read and adopted.\n\nA letter from Hon. W. Nockamah for Solicitor, from Wm. Dixon for Chairman of the Council Chamber, from S. J. Donaldson for the river bank opposite Church street, from Wm. Tait requesting rooms for the use of the Council, also a place for the applicant.\n\nACCT.\n\nAccounts were received from Mr. Davis for amounts of £15.96 from a loan, Mitchell for running expenses £2.50, from S. J. Donaldson for the use of his late Bishop Macdonald’s funeral.\n\nBY LAW.\n\nConn. Bratnocker introduced a by-law to appoint a Treasurer, Collector etc., and for the division of the same.\n\nAPPOINTMENTS.\n\nConn. Stewart, Bratnocker and Bain were appointed a Committee to make arrangements for the receipt of money by the Council and report to the next meeting.\n\nThe accounts were disposed of as follows:—Mr. Taylor, £3.75; Mr. Donaldson, £3.75; Mr. Donaldson, £5. The accounts of Adam Mellich was laid on the table for further consideration.\n\nThe communication of S. J. Donaldson was laid on the table, and that of Wm. Dixon was read at the first meeting.\n\nSTANDING COMMITTEES.\n\nThe following Standing Committees were appointed on motion of Conn. Bratnocker and Bain:\n\nFinance and Assessment—Conn. Stewart, Agnew and Bain.\n\nWorks and Health—Bain, Stewart and Bratnocker.\n\nThe by-law for the appointing of officers etc., was read a first and second time, and Conn. Agnew moved that it be referred to a Committee of the Whole to consider the same for the appointment of officers for December in this year.\n\nThe salary of the present officers were placed on:—Treasurer, £80; Assessors, £150; Collector, 2½ per cent. on all assessments; Assistant Assessor, £10; Surveyor, £2 per day when on duty; Postmaster’s fees fixed by Council; Constable, £50 per year when on duty by order; Solicitor, £30.\n\nOn motion of Conn. Stewart and Bain, the Committee rose and the chairman reported.\n\nThe by-law for the appointing of officers was then read a third time and passed, being referred to be signed, sealed and numbered.\n\nMoved by Conn. Stewart, seconded by Conn. Agnew, that Mr. Still be Treasurer.\n\nMoved by Conn. Stewart, seconded by Conn. Agnew, that Mr. Newlands be Solicitor and Mr. Cargill carried.\n\nAPPROVALS.\n\nMoved by Conn. Bratnocker, seconded by Conn. Agnew, that the approval of the minutes of last meeting be held over till next meeting, and that the Clerk receive applications for Assessor, Collector, Road Overseer, Poundkeeper etc.\n\nConn. Agnew gave notice that at the next meeting of this Council he would introduce a by-law for the division of the town.\n\nThe Council then adjourned.\n\nCARROT RIVER.\n\nFrom our Special Correspondent.\n\nA number of the friends of the present Government met in Carrot River schoolhouse on the 21st inst., for the purpose of forming a committee to oppose Association and organizing for the coming election. The meeting was a representative one, and several prominent men driven a long distance to be in attendance.\n\nMr. T. N. Irvine was appointed chairman of the meeting. Speeches were made by Messrs. Carrot River, Irvine and others upholding the policy of the present Government.\n\n“The Nineteenth Amendment,” was then formed, and the following officers elected:—President, W. M. MacLeod; 1st Vice President, Mr. Hill; Secretary, T. N. Irvine.\n\nAfter giving them charge for the Queen and Sir John the meeting closed.\n\nHon. David Laird is expected to arrive in Prince Albert shortly.\n\nTHE S. P. AND THE NOVA SCOTIA COAL TRADE.\n\nThe coal industry of Nova Scotia would not seem to have suffered much since last month’s special reference, if the following reports are correct.\n\nGeo. Johnson, writing to the Montreal Gazette, says:—\n\nThe total value in 1866 was $3,944,200. There was then a duty of $1.25 per ton on Nova Scotia coal imported into United States. Of the total value that year, $88,900 went to the United States and $3,856,300 to other countries, but of this last sum, only 1,000 tons distributed throughout the Dominion. In 1873 the United States duties were repealed.\n\nIn 1874, 76, 77 and 78, the years of greatest depression, when Canada had no means up to keep up production, here was a great increase in consumption, but little, while the quantity going to the United States filled till in 1879, $1,855,000, but in 1878, $1,700,000, and nine times less than the amount of 1873. There was also considerable protest during those years against the heavy duties, and Canada varied but little, being as follows: 77, 586,653 tons, and 78, 590,069 tons.\n\nThe duties on coal imported into Canada have been very heavy, and the result has been a great increase in consumption. Those who have been engaged in the trade will not forget how hard it was to get the people to buy our coal, and how difficult it was to get them to pay the high duties. Those who have been engaged in the trade will not forget how hard it was to get the people to buy our coal, and how difficult it was to get them to pay the high duties. Those who have been engaged in the trade will not forget how hard it was to get the people to buy our coal, and how difficult it was to get them to pay the high duties.\n\nThe business of the undersigned is being closed up.\n\nAll parties owing said firm will please settle at once at the old stand.\n\nBalance of stock at and under cost for cash.\n\nMISS MACK & CO.\n\nFirst Door East Telegraph Office.\n\nRUSSELL & DAVIS.\n\nWHOLESALE & RETAIL\n\nButchers.\n\nDeer, Pork, Mutton, Sausages, Bacon, Ham and Game in Season.\n\nBranch Stalls—Qu’Appelle Station, Fort Qu’Appelle and Prince Albert.\n\nRUSSELL & DAVIS,\n\nBROWN’S BRICK STORE.\n\nJ. L. JOHNSON & CO.\n\nFURNITURE.\n\nI have just received a large stock of all kinds of Furniture, consisting of\n\nBEDROOM AND PARLOR SUITS, Sideboards, Cupboards, Bureaus, Washstands, Sofas, Easy Chairs Bedsteads, Mattresses, Co’s, Cradles.\n\nAnd all kinds of Chairs, Etc. which I am Selling at 100 Per Cent. Below Former Prices.\n\nPlease Call and Inspect our Stock before Buying Furniture Repaired on Short Notice.\n\nW. B. GOODFELLOW.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder never contains any foreign material in the smallest quantity and cannot be more highly recommended. It is highly nutritious, being a pure form of food.\n\nRoyal Baking Powder Co. 100 Wall St.\n\nBuffalo Hall!\n\nOur books for 1876 show the largest year’s business we have enjoyed since opening in Prince Albert.\n\nWe start the New Year with Fresh Goods (which arrived too late for our Holiday Trade) in\n\nCitrus, Oranges, Dates, Scotch Jam and Canned Goods, Oysters, Finnan Haddie, Etc., Etc.\n\nAll Winter Goods in our Dry Goods and Clothing Department are now being offered at Greatly Reduced Prices.\n\nBETTS & Gwynne.\n\nSTOVES!\n\nA Further Reduction of 20 per cent. will be given on all BOX AND PARLOR STOVES Remaining on hand.\n\nCamp Stoves and Piping AT BOTTOM FIGURES.\n\nI have a first-class workman, and will execute all orders for Tinsmith’s work with promptness, and guarantee satisfaction.\n\nHARDWARE!\n\nA FULL STOCK.\n\nJ. R. McPhail.\n\nCOAL OIL\n\n75c per Gallon.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887012801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 4209, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4026, 2], [4026, 8953, 3], [8953, 16135, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]