[{"id": "31b70b7c46db0bff3867459245c37aeb13a3f83c", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nCHRISTMAS\n\nAt this glad season of the year, when the Christian Church and the Roman Catholic Church join in all their observances, we have a day to celebrate the greatest event that ever transpired in the history of our world; it may not be amiss to call to mind the origin of the Christmas Festival, and how the day was celebrated in former times. The original celebration of the event was undoubtedly the grandest and most important of all. On that day, 1857 years ago, the birthplace of the world was born, the fulfillment of prophecies, the Divine promise. On that occasion, while the shepherds of Bethlehem watched their flocks by night on Judea's plains, an angel announcement was made to them to announce his birth that the Christ was born. On that night was proclaimed glad tidings of great joy to all nations, and the heavenly heralds sang glory to God in the highest, and peace on earth will come down. There does not appear to have been any uniformity in the period of observing the holy day among the early Churches. Some held the festival in May or April, others in January, the former usually holding it near the time about the time of year Christ was born, and it is almost certain that the 25th of December cannot be the nativity of the Savior. It is thought that it is near the height of the rainy season in Judea, and Sheep herds could hardly be watching their flocks on the plains by night; they most likely then, as they do now, keep their flocks in the valleys. The Romans therefore attribute the institution of the festival to Teispharans in the reign of Antoninus Pius (138-161 A.D.), but the first certain traces of it are found in the third of the Roman Empire, Constantine I A.D. In the year 349 A.D., Diocletian a number of Christians assembled at Nicea to celebrate the festival, and they were all—by order of the Emperor—ordered to declare their faith; this decree was about the year 250 A.D. Christmas not only became the parent of many later festivals, but especially from the fifth to the eighth centuries gathered round it a vast secular literature, which supplanted all other Christian holidays to the manifold richness of its festivities and festivities. More than any other, the completion of the systematic distribution of church festivals over the whole year, the celebration of the Nativity was not celebrated casually anywhere on December 25th. Perhaps the most powerful of the causes that contributed to fixing this period as the proper one was that, almost all the year round, the weather regarded the water as a mirror, and reflected the sun in the year, as the beginning of the new life and activity of the powers of nature, and of the gods, who were originally only the symbolical personifications of these. This fact must have made itself felt, and was valuable in more northern countries—for from the earliest times the Celts and Germans celebrated the winter solstice as a momentous event. At the same time, the elaborate festivities of the same period, which held their great Yuletide feasts, and the consecration of the sun, and believed that the twelve nights prior to January 6th they could trace the personification of the sun, and the renewal of the earth's fertility. Many of the beliefs and customs of the old Germans and Romans relating to this matter passed over from heathenism to Christianity, and have partly survived even to the present day. In order to combat and banish the gloomy feeling—and to purify the heathen customs and feasts which it retained—the church devised its grand liturgies as so dramatic representations of the events of the birth and advent of its Lord. Hence springing what were called the \"Manger Songs\" and Christmas carols as we see them today, which at times degenerated into mere songs of love and lust. But at a later date, the Christmas or Christmastrees, adorned with lights and gifts, as in our own town. The custom of sending Christmas cards to friends has also grown up in recent years. Although some sects of the Christian church regard the festival in its religious aspect, as a mere human invention and is savouring of paganism, yet it is still a popular holiday. But within the last ten years, the ceremonies once appropriate to Christmas have greatly fallen off; these at one time used to be more or less brilliant and gay, and in the towns, day, now a religious service is held in some churches and social gatherings is done all that distinguishes the day from others. On the eve of Christmas there is the usual service in the St. Mary's Church, but very rarely there are many pretty and interesting customs and legends in different countries connected with Christmas which space will not permit us to notice.\n\nFLOUR CONTRACT.\n\nIt is quite a while since we have had occasion to find fault with the Government, but during the last two years treated the people of these Territories most liberally, but even yet they may be guilty of actions which subject them to adverse criticism and which call for the protest from the people. We have heard of the supply drop for the Grain Department, it at an outsider is a great injustice to the farmers of this District. The labors of the harvesters have this year been blessed with a good crop, but owing to the fact that there is no outlet for market, the grain raised in the district must be consumed there, the farmer is induced to raise a larger crop than he is able to dispose of for his own use, knowing that the prices are not required for the Indians and Pilegans, relying on these departments for a market for surplus grain. It is distressing to hear of the starvation of the Indians and Pilegans, and the want of the means to procure food for them in the district. The mission agent for supplying the Indians, Mr. O'Keefe, is now the head man, having taken charge of the school and hospital for Indians. For the Indians is such a dear creature, the food which the white man considers a luxury is not good enough for his delicate stomachs; the bread on which the Indians live is what we consider superior to the best flour, and they would so amaze the digestive organs of the Savage that his garments must needs go to the uttermost parts of the earth to secure a supply sufficient for his wants. Surely what is good enough for a white man should be good enough for the Indian whom we recently did not know what bread was. There is a large quantity of wheat in the district, which would grateful need to be brought from Manitoba or the States, and there are mile capable of turning out, as fine a quality of flour as we consume here even if the same wheat should have been delivered to people here, and thus afford a market to farmers as well as encourage them in their efforts to bring the land under cultivation.\n\nBIRTH.\n\nDavin.—At Prince Albert, on the 15th inst., the wife of J. O. Davin, Jr., of Moosomin, a daughter, on the 10th inst., the wife of Joseph McKay, jr., of a son.\n\nVICTORIA LIVERY AND BARLING STABLES\n\nTHE SUN!\n\nDAILY AND WEEKLY.\n\nIndependent in Politics.\n\nThe Leading and Popular Paper of the CANADIAN NORTHWEST.\n\nHas a circulation greater than the Combined Circulation of the Other Winnipeg Newspapers, and is recognized as the Great Advertising Medium.\n\nSUBSCRIPTION PRICES\n\nDaily, $1.00 per Year\nWeekly, 60 cents per Week\n\nAdvertising rates moderate, and published in every issue of Daily and Weekly.\n\nAddress\n\n\"The Sun,\" Winnipeg,\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods\n\nDress Goods\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nVelvets, Satins, Ribbons,\nAll Prices, and Stales.\n\nLADIES', MISSES' AND CHILDREN'S\nWool Hoods and Clouds\nIN ENDLESS VARIETY\n\nReady Made Clothing\nOF THE LATEST STYLES.\nGENTLEMEN'S\nFancy Underclothing\nAT PLAIN PRICES.\n\nBoots and Shoes\nAND THE FINEST ASSORTMENT OF\nMitts and Moccasins\nGlass and Crockery\nA LARGE STOCK OF\nFLOUR!\nOats, Wheat and Barley\nJUST RECEIVED.\nBOUGHT AND SOLD.\n\nAn Inspector of our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nW. R. FISH\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 30\nSheeting, 35\nCommon Lumber, Dimension do., 40\n\n\"Over 15 feet extra\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTHE HALIFAX SCARE.\n\nHalifax, N.S., Dec. 9.—Intense excitement prevails among the Imperial military officers here, who appear to be a deliberate attempt by blockading gun cotton tank on Georges Island. In the centre of Halifax harbour stands Georges Island. It is the most strongly fortified spot in the world. It not only commands the city but sweeps the entire entrance to the harbour. It is armed with mighty and one hundred ton guns and upon it is stored the largest portion of our country's supply of gun cotton, bombs, shells and other munitions of war, for which Halifax is the depot for North America. The killing of the whale also presents a task in which several tons of gun cotton is stored, and the explosion would cause an external smash. No one is allowed upon or in the vicinity of the Island except those who have been given permission. At 2 o'clock, the daughter of the prominent lawyer thought she overheard men talking. She called out to them that they had no right there. Then she raised the alarm. Some soldiers were called and they rushed towards the tank. The soldiers were heard firing and hearing them coming two of the men jumped into a boat, whereas the third one was killed instantly by a bullet shot during their dirty work. He made a spring for the boat and the three got away. Several shots were fired behind the soldiers concealed there, and as the latter were aroused out of bed they had not their rifles with them, even quantities of gun cotton were thrown into the bay. An alarm was immediately raised and information conveyed to the Lord Lieutenant. His Excellency, Sir Richard, ordered the wharves to be guarded, all vessels to be searched and double guard to be placed along the coast of the Island all night. It is believed the act of the men was to blow an angle bomb hole in the side of the tank. If this had been accomplished, any way George's Island with its magnificent fortifications would fall to pieces in the night and two of the largest ships here have been destroyed. It would have been the most tremendous and terrible explosion of all time, while the loss of life would have been appalling.\n\nThe news in England.\n\nLondon, Dec. 11.—The spirited attempt to blow up Fort Halifax further created a tremendous sensation here. All the London papers led their editions with the story and attributed the outrage to Fenians.\n\nA POLICE SCANDAL\n\nMontreal, Dec. 11.—Randy, if ever, have the citizens of any city so this time been surprised as were the citizens of Montreal Saturday morning when it became known that Private Detective Fahey, City Detective Nangle, son of the deputy chief, and Constable Macdonald were arrested on a charge of conspiracy in a number of robberies perpetrated in the city by the gang of thieves whose principal leader is that notorious T. R. depot about six weeks ago, when $1,203 was stolen. The secret of their discovery was revealed by Detective Inspector Thomas Harris Phillips, a well known sporting man now in England as John L. Sullivan, who had been engaged by the latter in charge of Detective Fahey. During his absence the house was apparently robbed, and as Fahey could not find the culprit he went to England to employ an American officer. He secured high detective Thomas Wilson, a certain house, got acquainted with Fahey and another time with Nangle and likewise, the latter night, he employed the services of the G. T. R. as a special constable. After this criminal no excuse seemed to exist why Wilson let them think he was so big a fellow. The next one he got to know their secrets. As a first hint having come, it was not until he came to the United States and Fahey proposed that they should attack Paymaster Wright, who is over $80,000 in his bank account, and rob him and relieve him of $10,000. Friday night it was thought the time had arrived for the conspiracy, and accordingly Fahey was arrested at the Royal Hotel along with Wilson and Macdonald in a room where the conspirators had gathered and sent a message telegraphing for some sympathizers in New York and then to see Col. Riggs. Instead of going to the United States, however, they were \"analyzed\" when they were removed on Sunday week to their permanent graves.\n\nGENERAL NEWS.\n\nMontreal, Dec. 11.—Mr. Van Horne, in consequence Saturday, sent his resignation to the Secretary of State. Mr. Van Horne has been acting as the Secretary for the Atlantic mail service, and it may seem surprising that minister should have resigned after the very successful manner in which he has conducted the service. It may be said that he has reduced the cost of the Atlantic mail service by one-half. Mr. Van Horne has been very popular among the people.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRARD.\n\nXMAS CARDS\n\nIn Endless Variety at CANN'S BOOK STORE\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGEN'TS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887122301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 3285, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7512, 2], [7512, 8686, 3], [8686, 13916, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]