[{"id": "645e755d4bd436c1f5ded13e1029b76c92354671", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N.W.T.\nPRICES: 15¢ per insertion in advance,\nsingle copies, 15 cents each.\nIn no case will parts be inserted in this paper.\nBusiness hours 12 o'clock.\nNo advertisement inserted for less than 3 weeks.\nAdvertisements inserted in advance will be inserted until forbid.\nAll letters to be addressed to the Proprietor:\nJ. D. MAVEETY, Proprietor.\n\nSUNDAY CHURCH SERVICES\n\nSt. Alban's and St. Mary's Churches.\nSt. Alban's: Services in both churches and at 7 p.m., Rev. Canon Fleet.\nSt. Mary's: Services at 10 a.m., Rev. Mr. Wright; and at 7 p.m., Rev. Mr. Cunningham.\nSt. Paul's Church: Services at 8 a.m.; and at 7 p.m., Rev. Canon Fleet.\nSt. Peter's Church: Services at 8 a.m.; and at 7 p.m., Rev. Canon Fleet.\n\nIMPERIAL FEDERATION\n\nIt is contended by the advocates of Imperial Federation that such an arrangement would solve the difficulties of the present situation and give a national strength to the Empire as a whole. But Imperial Federation would also mean the separation of the various provinces from each other, and the question naturally suggests itself to every Canadian—Would the provinces be able to do without such an arrangement as they would be subjected to? Would the provinces be able to take an interest in any movement having for its end the furthering of the interests of the Empire? Would we be able to separate ourselves from the rest of the Empire? Would we be able to maintain our independence?\n\nTHE INTER-PROVINCIAL CONFERENCE\n\nRemarking on the recent inter-provincial conference the Globe says:—It has been frequently asserted by Sir John Macdonald's admirers that he proved himself to be a great statesman by bringing the Provinces together and creating a Canadian national spirit. This should have been accomplished by the Dominion Parliament, but as we are not fitted to do so, it seems to me we are quite proper to seek an opportunity of doing it. Mr. Davis' knowledge of North-west affairs, however, should be a guarantee that his bill will be equal to our requirements. It is found out now that the rights of the people of the North-west, or any section of it, are likely to be sacrificed, we shall not fail to oppose it.\n\nThe time has come when the government must have the fees under the Torrens System in the North-west reduced. So far, the people of this district have not been able to take advantage of the system. The regulations as to the age required to prove title are not practical to state what the public opinion of this District is as to the fees.\n\nIn an interview with Messrs. Davin and Perley the Minister of the Interior spoke of the plan of allowing a second homestead for pre-emption was out of the question, but that the Government would grant second homesteads to those entitled thereupon the 1st of June, 1887, whether they be of the first or second class. This should be an encouragement to settlers, if a second homestead is worth anything.\n\nWe learn by our dispatches also that the Government are considering the granting of pensions to the Mounted Police after a certain term of service. Had pensions been granted before it would have been the means of keeping many good men in the force and keeping it in a higher state of efficiency. The police are as much entitled to pension as the soldiers, and we trust that the Government will pass the measure referred to this session.\n\nThe agitation in Manitoba against disallowance in Manitoba still goes on with unabated vigor, and the Manitoba members have not been able to make any impression on the Government in the way of securing the desired concession. Two charters have been granted by the Manitoba Legislative Assembly, and the promoters of them propose to go on with their construction whether their charters are dissolved or not. This will, we fancy, have the effect of bringing things to a head and deciding the question one way or the other.\n\nSPRING OPERATIONS\n\nFarming operations commenced about the middle of last month, and the crops being planted, farmers were busy. Those who prepared their land last fall are well advanced with their seeding, while those who did not prepare their land last fall are, as a consequence, not so far advanced as they otherwise would have been. The spring this year is not expected to exceed last year's. Up to the present wheat is the principal crop, and the prices are high, with some exceptions, left for sale in a few days, however, the coarse grains will sell well, while the prices of potatoes and other vegetables will be governed by the season. The season, it is true, has not been a little hard, but though the crops are not large, we have hoped of raising a good crop, and gardening operations have just commenced.\n\nCATTLE RAISING\n\nThe advantages this country possesses for the raising and wintering of cattle has been amply demonstrated by the experience of the last few years. Mr. Macdonald, however, has been unable to convince the farmers of the advantages of cattle raising. The cattle raised here are of a better quality than those raised elsewhere, and the cattle raised here are of a better quality than those raised elsewhere.\n\nEDITORIAL NOTES\n\nSir John Macdonald will visit the North-west after the session ends.\n\nThe Globe of the 5th inst. says:—In describing the proceedings of a meeting of the friends of Sir Macdonald at the home of Mr. Macdonald, the Prince Albert Times says:—Chairs were taken by Mr. Macdonald, Sir John Macdonald, the Mayor, and the Government officials. This is true as far as I know, but why leave out Mr. Macdonald, Mr. Campbell, Mr. Macdonald, Sir John and the Queen.\n\nFrom the report of the Superintendent General of Indian Affairs we learn that the Indians of the North-west, including those of Manitoba and the North-west have 30,500. The expenditure on these Indians in 1886 was $1,094,188, showing an increase of $86,725 over the preceding year, or just over 9 per cent.\n\nThe approximate quantity of land held by the Government in trust for the Indians is given as 3,000,000 acres. The encouraging feature in this report is the increase, instead of decrease, in the expenditure.\n\nThe Globe of the 5th inst. says:—As it would seem to indicate a retrograde progress on their part in the acquirement of the art of making their own living.\n\nTobacco, Carrot and Mangel Seedlet, Clark's Drug Store.\nTERRITORIAL NEWS.\n\nEDMONTON.\n\nFrom the Bulletin, March 26th.\n\nWeather fine, but spring is more lack-\ning than has been the case for several\nyears.\n\nNo prospect of a freshet this spring\nand scarcity of melty road, the snow\nis going away quickly.\n\nLumbermen have an order for\n370,000 feet of lumber for Prince Ross,\nBurlington, to be shipped first thing in\nthe morning.\n\nJ. Fraser left for the landing on Tues-\nday to build two York boats for Colin\nWhite who is going up to Edmonton to\nsell the lumber. He will accompany Mr. Fraser. They will leave\nearly in May.\n\nJ. Hume is working at placer mining\nnear his quartz claims, out on the south\nside of the river. A few feet above high\nwater mark there is a large deposit of\nsandstone about 100 feet in length along\nthe bank of the river, resting on\nwhite rock bedrock. Inside this bank Mr.\nHume has located a number of separate\nfeet, the dirt taken out averaging a con-\nsiderable amount of gold in the pan and getting better at each\nworking.\n\nThe Mining Department is taking\nsteps to experiment on the propagation\nof willow in this part of the country.\nWillow trees are being planted along\nthe banks of the river near the mouth\nof the Lahontan, directly by the gravel\nand indirectly by the larger numbers of\nwillow roots which have been\ntransported by this river. Willows will\nprobably be placed in the best situation\nto plant to the best advantage\nthis spring and will be planted\nnext summer. Several operations\nin town have also promised some\nbetter results than was anticipated\nhere, with view to attracting more\nbusiness.\n\nThe experiment is well worth, but as\nfar as the question of willow propagation\nis concerned, there is no one who\nthemselves in the matter have any prac-\ntical knowledge of the rise or growth\nthereby. They are not familiar with\nPlants familiar in any degree with the\ngrowth of willow and would confer a favor\nby calling at the Bulletin office to be in-\nterviewed on the subject.\n\nBATTLEFORD.\n\nFrom the Head of April 2.\n\nPrince Roulston is removing their\nsmall boat from the opposite side to the land\nof the Saskatchewan.\n\nSupt. Gagnon arrived by the last mail\nand will take command of this post dur-\ning the absence of Supt. Gordon, who\nwas sent on leave in a few days.\n\nJohn Daniels, arrested last week on\nsuspicion of having stolen the horse\nof another man, was brought before the\ncourt on Wednesday, there being no evidence\nto criminate him.\n\nRev. J. C. Gardner, who has now\naccepted the place of the Presbyterian Church of this place for the\npast year, will preach tomorrow between noon and 2 o'clock. It has not yet been\ndecided who will succeed him.\n\nA special stage arrived from Swift\nCurrent yesterday afternoon, bringing\nMr. Thomas Dawes back to his family. He\nleft another brother at Swift Current to\nchange horses and was not expected to\nbe detained until the mails clear up.\n\nThere was good deal of discussion and\nargument last year as to what was the\nbest method of disposing of pigeons. Pigeon\nwas generally accepted as the simplest\nand most effective method of killing them,\nbut there was considerable room for\naccomplishment, which would tend to\nkeep them in check, and that is to dis-\ncover the best method of disposing of\nyoung ones and hawks. Both these birds\nprey largely on gophers and other vermin\nin the fields.\n\nW. Lottman's farm house near Edmon-\nton was burned on Wednesday, with\nloss of property. Mrs. Lottman was\nsaved and tried to extinguish the fire which\ncaught from the chimney, using only\none cartridge which was in the house\nbefore she left off for church. The fire\nwas compelled to give up without saving\nanything.\n\nGENERAL NEWS.\n\nAMERICAN AND FOREIGN.\n\nJohn T. Raymond, the celebrated\nactor, died at Evansville, Ind., on the\n24th ultimo.\n\nMany farmers in Southern Dakota\nhave lost houses, barns and other pro-\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETTY.\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"The Star Kidney Pad.\"\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nLOCAL NEWS.\n\nArchbishop Prinkham, Bishop desig-\nnate of Saskatchewan, arrived last even-\ning and is stopping at the Queen's. He\nwas six days on the road from Qu'Appelle.\n\nThe ice in the Saskatchewan is slow to\nmove this year. It has probably got an\nidea that it ought to be kept there until\nthe end of summer. We believe, however,\nthat the election is over. Go east, go\ndown the rapids as fast as you can.\n\nWe have received the report of the\nelection meeting held at Morden, Mani-\ntoba. It is a neatly printed and well\nedited thirty-six column paper, and we\nare happy to see such a strong side of\npolitics. We wish it success.\n\nWm. Plaxton, President of the Lorne\nAgricultural Society, lately returned\nfrom his handsomely furnished from the Co-\nlonial Exhibition, awarded for a half-\nbushel of White Russian wheat. The\nmedal was directed to A. H. Clark, Esq.,\nSecretary of the Lorne Agricultural So-\nciety.\n\nIn the bowling tournament commenced\non Saturday night in the City Hall, Mr.\nJ. Hodgson, with a score of 291, D. Williamson,\nsecond, 229; J. Knowles,\nthird, 213; C. Nairn, fourth. The\nscore is fair and the prizes are expected to see\nthe season broken before the 12th May, when\nthe tournament will be resumed.\n\nWe understand that the demand for\nseed grain is greater than the supply.\nWe also understand that many who have\nmade up their minds to grow grain and\nare located on the east side of the South\nBranch, cannot get their seed until it\narrives, though a large quantity of\nseed grain is now being shipped locally\nowing to the farmers being unable to\ncross the Branch. The Department, it seems to us,\nwould do well in making some arrangement to meet the emergency.\n\nWe clip the following interesting para-\ngraph from the Ottawa Journal, Canada:\n\"During the past few days the citizens were very much interested on\nTuesday evening at the marriage of Miss Mary Ann McTaggart, daughter of Mr.\nMcTaggart, formerly of this place, but now of Prince Albert, N.W.T., to Mr.\nH. J. MacKenzie, of Prince Albert, N.W.T.\n\nThe marriage service was performed at 10:30 p.m., in the Presbyterian Church, by Rev. Mr. B. McLean, the\nprincipal guest being from England. It is not\nnecessary to say that the bride looked charmingly. She was accompanied by\nMiss Mary Ann Wilson, Miss Mary Ann\nKendall, her cousins, and the groom by\nMr. Ross MacKenzie. After the cere-\nmony, they proceeded to the home of Mr. Wm. MacKenzie, uncle of the\nbride, and partook of the bounteous re-\nception prepared for them. They left early\nin the afternoon for a trip east before re-\nturning to their future home in Prince\nAlbert, N.W.T.\"\n\nQUEEN'S JUBILEE.\n\nA public meeting took place on Wed-\nnesday evening in the schoolrooms for\nthe purpose of taking the first step to\ncelebrate the Queen's Jubilee, Mayor\nMacArthur presiding. After some dis-\ncussion, it was decided that the celebra-\ntion take place on Dominion Day, and\nthat a general committee be appointed\nwith instructions to arrange a programme\nand report back at a subsequent meeting. The\nfollowing gentlemen were then appointed\nmembers of the committee: Hon. J. W.\nClarke, Capt. G. S. Mac, Mr. N. Campbell, Com. Stewart, Dr. Bain, J.\nKnowles, G. T. Brown, J. L. Johnson,\nJ. R. Milne, Capt. J. F. Murray, Capt.\nAgnew, J. D. Macveety, Capt. Craig, J.\nF. Bell, Graham Neill, G. E. Carter, Dr.\nG. S. Davison, Capt. T. Eagles, Dr. Dr.\nJardine, Archdeacon McKay, Jas. San-\nderson, W. V. Maclean, John Macdon-\nald, J. H. MacKenzie, Capt. Goodfellow, Wm. Plaxton, J. F. A.\nStall, A. L. Hilton, the Sup't. Police and\nthe Mayor. At a subsequent meeting\nand the General Committee held a meet-\ning. Hon. Lawrence Maclean in the chair.\n\nAn Order in Council was issued com-\nprising Hon. Lawrence Clarke, Col.\nSpratt, T. N. Campbell, Chas. Mac and\nMayor MacArthur, who were to ap-\npoint sub-committees to consider the\ndifferent matters and report at an early date. Some discussion took\nplace on the question of establishing a\npermanent memorial, such as a hospital,\nand it was decided that whatever funds\nremained after the celebration of the cele-\nbration had been defrayed should be\nleft to the people to dispose of.\n\nWEIGHTS AND MEASURES ACT.\n\nFor the information of all concerned\nthis week give Section 41 of the\nWeights and Measures Act. After the\nAct is passed, any person or his\nassistant may, at any reasonable time,\nwithout notice, enter any shop, store,\nwarehouse, or other place of business\nover, within his division, where any com-\nmodity is bought, sold, exposed or kept\nfor sale, and examine every article or\nconveyance by weight or measure, and\nthere examine all weights, measures,\nbalances, scales, and other weighing\nmachines, and compare and try the\nsame with the local standards of weight\nor measure, and shall make such ex-\naminations as often as may be deemed\nnecessary, and shall be his duty from\ntime to time, and without previous notice, so as best to\nenable him to carry out the provisions of\nthis Act, and the discovery and punish-\nment of any infractions thereof; and it\nshall be his duty to attend at least once\nin each month, and shall be deemed\nengaged in the performance of his\nduties, for the purpose of inspecting and\ntesting all weights, measures, balances,\nscales, and other weighing machines in\nhis division; and he shall be also subject to regulations made\nunder this Act. Customer (addressing): \"They are, are\nnot they?\" \"Yes, I declare—they do look\nlike it.\" \"Remember, you said you would\npay me five dollars, you know, my dear?\" \"I'm afraid we know quite\nthe same thing,\" she replied, \"but you\nknow me—I'll make it two dollars.\" \"Call-\ning.\"\n\nA FRIEND IN NEED.\n\nIn the last volume of his memoirs,\nLord Kamesh relates an incident which\noccurred during the war after the Han-\nnibal revolution of 1815.\n\nKamesh had fled to Widkin, and, with\ncompanion, was in danger of being hung\nby the Jacobins. The latter could not\nbe immediately dispatched to Lord Kamesh, begging his interven-\ntion.\n\n\"I ought to go on,\" said he. \"While we\nwere thinking how this could be done, a\nman entered my department—a typical\nEnglishman—tall, dark, with a black\numbrella over his forehead, an immense umbrella\nunder his arm, covered with dust and\nlooking exceedingly weary. It could be\neasily seen that he had been on a long\njourney.\n\n\"Excuse me, gentlemen,\" said the man, \"am I not late? Take a\nchair.\"\n\nHe sat down, pushed his hat still further back, wiped the perspiration\nfrom his forehead, and laid his umbrella\nbetween his legs, and busied himself\nwith cleaning his finger nails.\n\n\"Hungington whispered to me—\n\n\"Who is that gentleman?\"\n\n\"I am late, gentlemen!\"\n\n\"I am late, sir; are we obliged you?\"\n\n\"I have come from India, to fight for\nthe freedom of Hungary. It looks as if\nI had come too late.\"\n\n\"Unfortunately, too late. Take a\nchair.\"\n\n\"Well, the matter is settled,\" said Mr.\nHannibal, \"and here he explained the circumstances. We\nrequire men who will travel to London\nwithout stopping and without sleeping,\nand who will not rest until he has placed\nhis head in Palmerston's hands.\n\nWill you do that?\"\n\nThe brave Englishman jumped up\nfrom his chair, reached into his coat,\nand produced a letter.\n\n\"I gave it to him, he put it in his knapsack,\ndrove his feet down over his ears,\nand wrote on the back of his hand:\n\n\"'All right, good-bye,' and he rushed out.\n\nIt took him a quarter of an hour to\nhear the sound of horses' hoofs on the\nstreet, and there he was, with a servant,\nriding due west. He took advantage of\nthe quickest route, and did not rest until\nhe had put my letter in Palmerston's\nhands. The latter also had the desired\neffect.\n\nI was travelling in Niagara, Canada,\nwhen I came upon a station to allow\nmyself time to read the newspapers in\nthe direction. At the desire of the people I\nwent to the window, and there I saw a\nvisiting card. I took it and read: 'Mr.\nPalmerston, Esquire.' I wrote it with\npen and ink, 'I gave Palmerston the\nletter, but I do not know the name of\nthe man, but never heard any-\nthing more of him afterwards.'\"\n\nCustomer: \"How much did you say\nfor these pants?\"\n\nSalesman: \"Two dollars and\na half.\"\n\nCustomer: \"That's too much.\"\n\nSalesman: \"Two dollars and\nhalf a quarter.\"\n\nCustomer (addressing): \"They are, are\nnot they?\"\n\nSalesman: \"Yes, I declare—they do look\nlike it.\"\n\nCustomer: \"My dear, my dear, my dear.\"\n\nSalesman: \"Remember, you said you would\npay me five dollars, you know, my dear?\"\n\nCustomer: \"I'm afraid we know quite\nthe same thing,\" she replied, \"but you\nknow me—I'll make it two dollars.\"\n\nCALL AND GET PRICES.\n\nJ. R. McPhail,\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNap. Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry\nCarpets, Crimson Rejps, Window Holand in Slate and Yellow,\nDoor Mats, Crumb Cloths, Silk Corded Clothings,\nEmpress in Rich Red and Garnet,\nFine Cretonnes,\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings,\nBeezee Veiling, Ladies Silk Ties, Tinsel, etc., etc.,\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including\nall the Conveniences of Fruits, Figs, Dates and Tinned Goods of all kinds\nImportation is solicited.\n\nRUSSELL & DAVIS, PRINCE ALBERT\n\nWHOLESALE & RETAIL\n\nButcherS.\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham, and\nGAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station,\nFort Qu'Appelle, and\nPrince Albert.\n\nDelivered to all Parts of the Town.\n\nAMBER--(Hop)--ALE,\n\nM'INTOSH & GERMOND\n\nAT FISH'S.\n\nBUFFALO HALL!\n\nGRAND STOCK-TAKING SALE\n\nNOW GOING ON.\n\nDry Goods, Clothing\nAnd Groceries\n\nALL REDUCED IN PRICE.\n\nBETTS & Gwynne.\n\nESTABLISHED 1879.\n\nBuilding Hardware,\nHouse Furnishing hardware\nCarpenters's Tools,\nPaints and Oils,\nBarbed Fencing Wire,\nStoves and Tinware.\n\nALSO A FRESH STOCK OF\nGroceries, Teas,\nTobaccos, Etc.\n\nCALL AND GET PRICES.\n\nJ. R. McPhail,\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNap. Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry\nCarpets, Crimson Rejps, Window Holand in Slate and Yellow,\nDoor Mats, Crumb Cloths, Silk Corded Clothings,\nEmpress in Rich Red and Garnet,\nFine Cretonnes,\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings,\nBeezee Veiling, Ladies Silk Ties, Tinsel, etc., etc.,\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including\nall the Conveniences of Fruits, Figs, Dates and Tinned Goods of all kinds\nImportation is solicited.\n\nRUSSELL & DAVIS, PRINCE ALBERT\n\nWHOLESALE & RETAIL\n\nButcherS.\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham, and\nGAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station,\nFort Qu'Appelle, and\nPrince Albert.\n\nDelivered to all Parts of the Town.\n\nAMBER--(Hop)--ALE,\n\nM'INTOSH & GERMOND", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887042201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 5605, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6382, 2], [6382, 11043, 3], [11043, 21689, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]