[{"id": "c9b54d4ed20a553ed08a9cac82ba5e1c389528c7", "text": "Notice to Creditors.\n\nThe creditors of William Stewart, late of Prince Albert, in the North-West Territories, are hereby notified that all other having claims against his estate, are hereby required to present their claims to Mr. Prince Albert, Merchants, on or before the 20th day of September next, giving full names and surnames, addresses and dates of the occurrence of any debt held by them, and also the amount thereof. If any claimant after the said 20th day of August, the assets will be distributed amongst the parties entitled thereto, having regard only to claims which have been presented within the time required. The undersigned will not be liable, under any circumstances, to make any payment to any person whose claims may not have been received at the time of such distribution.\n\nJOHN STEWART,\nAdministrator.\n\nStrayed!\n\nStrayed on my premises on Saturday, the 4th inst.,\n\nTwo Sows and 1 Barrow Pig\n\nThe owner is requested to pay damages and take them away, or they will be sold.\n\nWILLIAM SHIPMAN.\n\nWANTED\n\nBy the trustees of Prince Albert East Protestant Public School District No. 10,\n\nA Secretary, a Treasurer, and an Assessor.\n\nApplicants will state salary required.\n\nApply on or before August the 15th.\n\nJOSEPH COURTNEY.\n\nNotice\n\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 71, of the special survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nNotice\n\nNotice is hereby given that the partnership existing between us, up to the present time, is now mutually concluded, and the business will be conducted henceforward by Gilbert E. Carter.\n\nGILBERT CARTER.\n\nPRINCE ALBERT\n\nPlanning Mills and Sash and Door Factory\n\nCOL. MARST AND MACKEY ST.\n\nSash, Doors, Frames, Blinds, Mouldings and Builders' Furnishings made to order.\n\nDentist.\n\nPRINCE ALBERT, N.W.T.\n\nNotice\n\nNotice is hereby given that the partnership existing between us, up to the present time, is now mutually concluded, and the business will be conducted henceforward by Gilbert E. Carter.\n\nGILBERT CARTER.\n\nPRINCE ALBERT\n\nPlanning Mills and Sash and Door Factory\n\nCOL. MARST AND MACKEY ST.\n\nSash, Doors, Frames, Blinds, Mouldings and Builders' Furnishings made to order.\n\nA. GOODFELLOW.\n\nPrince Albert, N.W.T.\n\nNotice\n\nNotice is hereby given that the partnership existing between us, up to the present time, is now mutually concluded, and the business will be conducted henceforward by Gilbert E. Carter.\n\nGILBERT CARTER.\n\nPRINCE ALBERT\n\nPlanning Mills and Sash and Door Factory\n\nCOL. MARST AND MACKEY ST.\n\nSash, Doors, Frames, Blinds, Mouldings and Builders' Furnishings made to order.\n\nCHAS. WOODMAN\n\nProprietor\n\nNotice\n\nClaims of the Royal Family of Great Britain and Prussia.\n\nWINDSOR, July 26.—The installation of the Duke of Connaught as Governor General of Canada took place today at Windsor Castle. The Duke of Connaught was installed as Governor General of Canada by the Duke of Connaught's son, Prince Edward, Duke of Kent.\n\nPORT HOPE\n\nMontreal, July 26.—His Worship the Mayor today paid $250 to deceased Sergt. Wallingford's father, being the proceeds of the sale of the estate of Sergt. Wallingford, who died last week.\n\nTry To Do Your Best\n\nTry to do your best every day.\n\nHIGH SCHOOL\n\nST. ANN'S CONVENT.\n\nStudies will commence on 1st September.\n\nTwo silver medals presented by the Hon. L. Clarke will be offered for competition during the scholastic year.\n\nGENERAL NEWS.\n\nSAN FRANCISCO.\n\nSan Francisco, July 26.—The city council has approved the sale of the city-owned property at the foot of Market Street.\n\nTORONTO.\n\nToronto, July 26.—As matters now stand, the question of the great strike of the railway workers remains open. Sir George Cartwright and Lord Lansdowne are still at loggerheads over the question of the railway workers' demands.\n\nCANADIAN.\n\nLONDON.\n\nLondon, July 26.—Lord Lansdowne's visit to Canada has been officially announced.\n\nHAMILTON.\n\nHamilton, July 26.—The Clippers and Toronto played eleven innings at baseball. Clipper 11, Toronto 10.\n\nPRINCESS BEATRICE.\n\nReturn of the Royal Family to Osborne Castle.\n\nLondon, July 26.—Following the announcement last week of the engagement of Princess Beatrice to Prince Henry of Battenberg, the royal family returned to Osborne Castle yesterday afternoon.\n\nPORT HOPE\n\nMontreal, July 26.—His Worship the Mayor today paid $250 to deceased Sergt. Wallingford's father, being the proceeds of the sale of the estate of Sergt. Wallingford, who died last week.\n\nTry To Do Your Best\n\nTry to do your best every day.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nFirst-class flour at T. O. Davis for 8s.\n\nThe St. Andrew's Society meets this evening.\n\nWilliam's safe case and pills at Clark's drug store.\n\nFull assortment of diamond drugs at Clark's drug store.\n\nIt is very fine for cheap, cheap, cheap.\n\nGENERAL NEWS.\n\nSAN FRANCISCO.\n\nSan Francisco, July 26.—The city council has approved the sale of the city-owned property at the foot of Market Street.\n\nTORONTO.\n\nToronto, July 26.—As matters now stand, the question of the great strike of the railway workers remains open. Sir George Cartwright and Lord Lansdowne are still at loggerheads over the question of the railway workers' demands.\n\nCANADIAN.\n\nLONDON.\n\nLondon, July 26.—Lord Lansdowne's visit to Canada has been officially announced.\n\nHAMILTON.\n\nHamilton, July 26.—The Clippers and Toronto played eleven innings at baseball. Clipper 11, Toronto 10.\n\nPRINCESS BEATRICE.\n\nReturn of the Royal Family to Osborne Castle.\n\nLondon, July 26.—Following the announcement last week of the engagement of Princess Beatrice to Prince Henry of Battenberg, the royal family returned to Osborne Castle yesterday afternoon.\n\nPORT HOPE\n\nMontreal, July 26.—His Worship the Mayor today paid $250 to deceased Sergt. Wallingford's father, being the proceeds of the sale of the estate of Sergt. Wallingford, who died last week.\n\nTry To Do Your Best\n\nTry to do your best every day.\n**THE PRINCE ALBERT TIMES**\n\n**J. D. MAVETY**\n\nPrince Albert, N.W.T.\n\n**SUNDAY CHURCH SERVICES**\n\nSt. Mary's Church\n\n11 a.m. Rev. Mr. Maclean\n\nThe Mission Chapel\n\n12 noon Rev. A. H. Wright\n\n3 p.m. Sunday School\n\n7 p.m. Evening Service\n\nSt. Cuthbert's Church\n\n10 a.m. Rev. Canon Elliot\n\n11 a.m. Rev. Mr. Maclean\n\nSt. Paul's Church\n\n1 p.m. Rev. Canon Elliot\n\nSt. Andrew's Church\n\n10 a.m. Rev. Mr. Maclean\n\nSt. John's Church\n\n12 noon Rev. J. P. Pricknell\n\nSt. James' Church\n\n12 noon Rev. Mr. Maclean\n\nSt. Anne's Church\n\n12 noon Rev. Mr. Maclean\n\nSt. Paul's Church (Presbyterian)\n\n12 noon Rev. Mr. Maclean\n\n**FRIDAY, JULY 31, 1886**\n\n**OUR SETTLEMENTS**\n\nIt is idle to disguise the fact that there exists at present a strong feeling of irritation spreading throughout the loyal settlers of this district who so directly as well as severely suffered from the late rebellion, and the conduct of the Government in regard to the question of their compensation or otherwise. It will of course be admitted that the question of how to ameliorate the unfortunate status of these settlers is not an easy one to decide upon.\n\nIt seems to me that but slight consideration should be given as to whether it is incumbent on the part of those who have often been most seriously and immediately damaged by what has happened to take action. Although no better can be approved than the course which has hitherto been taken, the best course would appear to be to make some attempt at redress for the loss which they have sustained.\n\n**OUR TROOPS**\n\nThere have been a very serious discussion going on in the press regarding the treatment of the Indians and the conduct of our troops after the fighting of Riel's men. The question of whether the Government has been just or unjust in its treatment of the Indians during the war is a serious one. It is evident that the Indians have been treated unfairly, and it is to be hoped that the Government will take steps to remedy this situation.\n\n**SASKATCHEWAN RIFLE ASSOCIATION**\n\nThe first meeting of the Association will take place on its rifle ground, Prince Albert, Tuesday, September 1st.\n\nFurther particulars will be advertised as the matches are being arranged.\n\n**A LARGE STOCK OF**\n\n*Watches, Clocks and Jewellery*\n\n*Kept constantly on hand.*\n\n**Crockery AND Hardware, AT COST**\n\n**NOTICE.**\n\nAll parties indebted to us must be paid before the 1st August next, owing to an intended change in the business.\n\n**STEWART BROS.**\n\n---\n\n**DRY LUMBER.**\n\n**MOORE & MACDOWALL**\n\n*Wish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.*\n\n**Dressed Flooring, $48**\n\n**Undressed do., $42**\n\n**Dressed Siding, $48**\n\n**Undressed do., $42**\n\n**Sheeting, $30**\n\n**Common Lumber, $35**\n\n**Dimension do., $40**\n\n*Over 15 feet extra.*\n\n**Lath, 75 cts. per bundle.**\n\n**Shingles, $6 50 per M.**\n\n*We are prepared to contract for Buildings as cheaply as any firm in Town.*\n\n**Builders paying Cash or giving good security for LARGE Orders, will have a reduction made.**\n\n**MOORE & MACDOWALL**\n\n**THOS. POWERS, STEWART BROS., TRADERS, GENERAL MERCHANTS**\n\n*Have just received a large stock of DRY GOODS AND GENERAL GROCERIES.*\n\n**Teas, Tobaccos, Coffee, Oatmeal, Sugars, Canned Goods, Cal. Pears, Canning out the balance.*\n\n**KNOX AND BARKER, CARPENTERS, ETC.**\n\n**OFFICE AND WORKSHOP, Near Presbyterian Church.**\n\n**G. D. NORTHGRAVES, Watchmaker and Jeweller, At T. N. Campbell's New Store.**\n\n*Repairs Promptly Attended To.*\nCOMMUNICATIONS.\n\nTHE MAIL'S CORRESPONDENTS.\n\nTo the Editor of The Times.\n\nSir,—I have just read an article in your number entitled \"The Mail's Correspondent,\" which I believe was written by Mr. M., and I am convinced that the author could have nothing to do with it, for, in truth, the feeling which you there display would induce me to believe that you are not only a friend, but an unwavoured sentiment of hatred, so unjustifiable are the suspicions which you there cast out upon persons whose character places them above the reach of such a perilous calumny, and whose attachment to their country is particularly during the late insurrection, unshaken by all except the evil minded. And now, sir, whom would you place at the head of such a party? On seconding together the remarks you make upon the author \"F. R. M.\", and the nature of the letter, you evidently place yourself in the place in which, according to you, the author wrote, the advantages which the said author enjoyed are not so great, nor, indeed, so much as they appear. You attempt to draw the evil-minded public of this country into such symphonies as are evident that you were, Rev. Father Andre should desire to do so he had better exert himself by proceeding against such a party as you describe. Meanwhile we note that in place of a single downright denial of the charges you have brought against him, you will find us speaking plainly enough when, as here, we make no bones about it.\n\nWe learn that the Wood Creeks returned to Fort Pitt from the North with Wan-ding Spirit and some others concerned in the late insurrection. Wan-ding Spirit spoke to his captors that he would kill some white man and then kill him self. Afterward they came to be discovered, and later on he made a boastful speech, in which he called upon all who wished to look upon him while he was drawing a knife that he had borrowed for the purpose, to drive it deep into his own heart, saying that although he too high to reach the heart, but that he would puncture the left lung, inflicting a wound that would cause his death in his camp under the eye of the troops.\n\nPUBLIC NOTICE.\n\nPublic notice is hereby given that the following lots have been taken up for the erection of the proposed Municipality of \"The Town of Prince Albert,\" comprised of the foregoing tracts of land.\n\nLot No. 1, containing sixty-eight acres, seventy-one, seventy-two, seventy-three, seventy-four, seventy-five, seventy-six, seventy-seven, seventy-eight, seventy-nine, eighty, eighty-one, eighty-two, and of that lot known as the Reserve, \"The Government and Reserve Lots,\" being the lands of England trading into Hudson's Bay, and H. B. Co. Reserve, all said lots being part of the original grant of the Prince Albert Settlement, as shown upon the plan of Prince Albert Settlement, dated July 29th, 1885, approved by His Excellency, the Governor General, and of record in the Department of the Interior, Canada, and also abutting the boundary line of said lots, that is to say, commencing at a point where the western boundary line of said lot seventy-eight meets the waters edge on the northern shore of the North Saskatchewan River, thence south along said western boundary line to a point where said line passes the most westerly point of the townsite, thence east astronomically across lots sixty-eight to seventy-eight inclusive and eighty-nine, thence north seventy-nine to eighty, thence north to a point where said line passes the most westerly point of the townsite, thence west to the waters edge on the southern shore of the said North Saskatchewan River, to the place of beginning. Said townsite contains one thousand eight hundred and thirty acres of land.\n\nThis notice is given under and by virtue of the provisions of the One hundred and seventy second Section of Ordinance No. 4 of 1885, \"An Act to amend the Municipal Corporations Act\" by which it is ordered that an election shall be held in accordance with the provisions of said Ordinance, and this notice is given in pursuance of the first publication of this notice in The Prince Albert Times and Saskatchewan Review.\n\nE. DEVINEY,\nLt. Governor of the North West Territory,\nGovernment House, Regina.\nJuly 14, 1885.\n\nLE FRANCAIS ET LA MUSIC!\n\nFrench and Music are of the greatest importance. The first being a very useful and necessary accomplishment, and the latter known as the source of all enjoyment in life. We therefore urge our readers to attend the classes three times a week, at the Prince Albert School, where musical and other useful information may be obtained. Classes commence immediately, and may be attended by any person who wishes to improve his musical knowledge. Further information apply to Mr. L. R. ST. LOUIS.\n\nALEX. LANG\n\nGENERAL BLACKSMITH.\n\nHas opened shop in the east end, directly opposite the H. B. Co.'s grain mill.\n\nHorse-shoeing and general blacksmithing done promptly and cheaply.\n\nAll kinds of farm machinery repaired and put in order.\n\nALEX. LANG,\n\nPRINCE ALBERT,\n\nSASK.\n\nMEDICAL HALL.\n\nT. DE JACKSON.\n\nChemist & Druggist.\n\nJAMES SINCLAIR\n\nMerchant Tailor,\n\nAND DEALER IN\n\nGENTS' FURNISHINGS.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK.\n\nSHANNON & McLEOD\nTHE REBELLION.\n\nAs the police and a party came into the settlement near Carlton and drove up to the spot where the body was found, they finally located it, and it was noticed with pleasure that two or three of the men who had been engaged in the affair were there. The first news had been reported killed by a few official acts and opinions, and the news had been received with great satisfaction. The internal arrangements were rather uncommunicative taking possession of the police, but most of them were very anxious to see how matters would turn out, and work all day and night and had been with out food and sleep for several hours, point of leaving Carlton. The commandant of a body of men was not yet known, any man who could be found for dividing much time to formal courtesy, before taking advantage of what might offer for the benefit of the community. The men were now scattered about the town distributing their horses wherever they could find shelter, and were proceeding forward with much satisfaction to a good night's rest, a hope which was destined to be disappointed. It was remembered that important facts had been obtained at considerable distances from the town to give warning in case of an attack, and that the men had been piped down at the Ridge by the party coming from Carlton, and at the same time Mr. Macdonald, the Dominion Land Agent, was waiting to transmit to the town by telegraph any news that might have been received. Of course while the loyalist force was known to be if not necessarily between them and the town, any attempt to position to watch and secure the attention of the latter—there was a feeling of comparative security which naturally caused to each what was otherwise the whole force to pass to their other side. This without doubt prevented the men to be heard, so that when the Indians in their paint and feathers were observed moving along in the uncertain light of the fire, they thought it would be easier to get away than to make any attempt to defend themselves. It was now evident that it was the advance guard of a body of regulars, and that the Indians were on their way to join them. One of the Indians, and one Frank Cherry was the same was sighted them, and rode in telling to everyone that they must run for their lives as the Indians were coming after them. That sort of cry raised at that hour, and when there was no means taken by anyone watching the Indians, was calculated to produce a momentary panic among people sitting at a distance from the Indians, and including a majority of women and children. That these near the town made such a rush for shelter as they could, and that when the cry was passed on from mouth to mouth, losing nothing outwardly, the Indians came on in that way, and the bell of the church, which it had been agreed to ring in case of grave danger, was dangerous, the peril of a general stampede for the stockade took place, can easily be understood. It may seem strange to imagine that there was not the slightest possibility of panic among the armed men—for those outside and within the distance from the stockade were fallen back and held their own in the fort. The real distress was among the women as well as the men heard the alarm, and the only thing that prevented them from hesitating about receiving it as a genuine one, and worse still, were perfectly convinced that the Indians were in the town. The writer is not ashamed to confess that hearing the cries of women and children hurrying past the windows, and seeing the panic which was manifested, and having the responsibility of getting a wife and four children over to the fort, he himself felt that he had in mind in the most infectious excitement, as to have been working material to the memory of the scene. In about five minutes devoted to getting his charges lodged in the house he had an opportunity of witnessing the panic which was upon the weaker vessels, although the gloom was but a momentary one. It is the study of examples that the study of human nature becomes truly interesting, and on the whole what was observed at this juncture leads to the conclusion that human nature is not by any means so bad as some moralists would make it out. A good deal that appeared amusing when viewed as a retrospect, was mingled with much sadness.\n\n---\n\n**Buffalo Hall!**\n\n**SUMMER STOCK NOW COMPLETE**\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the section for our Grocery Department.\n\nCarmels, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Sodas, Fruits, Taffy Fingers, Lemon Creams and Iced Sultanas\n\nMake a choice addition to our well assorted line of GENERAL GROCERIES.\n\nPIPES, TOBACCOES, CIGARS, CIGARETTES.\n\nBEITTS & Gwynne.\n\nO. E. HUGHES & Co.,\nGeneral Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nMorton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nWhich defy competition. Also one car load Ogilvie's Flour, which we will sell cheap for cash.\n\nO. E. HUGHES & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\n\nJUST RECEIVED\nJ. M. CAMPBELL\nAT THE\nHORSE SHOE STORE\nA LARGE STOCK OF\nHats, Summer Suits, Prints and Dress Goods\n\nGenuine Imported\nHAVANA CIGARS\nUnder Brand of\nT. E. JACKSONS\nTRY THEM.\n\nAlso a supply of\nFRESH GROCERIES\n\nT. O. DAVIS J. M. CAMPBELL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885080701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 4984, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5989, 1], [5989, 9512, 2], [9512, 14793, 3], [14793, 20490, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]