[{"id": "ed61800d886302d35da99633b6c492307db5c470", "text": "DRESSMAKING!\n\nMiss McGuire wishes to inform the public of Prince Albert and the surrounding country that she has opened her Modern Dressmaking and Millinery Establishment in Campbell's Block, where she is prepared to undertake all kinds of work connected with the business, and guarantees satisfaction.\n\nMiss McGuire,\nCampbell's Block.\n\nWAR DECLARED!\n\nW. C. RAMSAY\n\nWould respectfully intimate to his friends and the general public that he has purchased Thomas & Co.'s blacksmith business, and has removed same to River Street, near J. A. Macdonald's residence. It should be declared war against the present high prices charged for horseriding and general farriery. A trial is respectfully advised.\n\nThe partnership heretofore existing, and known under the firm name of \"McIntosh & Ramsay,\" has been dissolved at this day. All debts owing to said partnership, and all claims against said partnership, will be paid by Mr. Ramsay. Any claimant desiring to make application therefor, as number two strictly limited.\n\nGrand opportunity to learn French in three months! Learn French in three months! Learn French in three months! Learn French in three months!\n\nHOLIDAY GOODS, TOYS, ETC.\n\nJust received - An immense assortment of XMAS PRESENTS consisting of Ladies' Hand Bags Ladies' Companions Writing Desks, Photo Frames, Whisk Holders, Photo Albums, Work Boxes, Autograph Albums, Dolls, Doll Furniture, Hand Sleighs, Tea Sets, Toy Pianos, etc.\n\nA meeting of the vestry was held in the Mission Chapel on the 8th inst. His Lordship, the Bishop, Mr. J. M. Scott, in place of the late lamented R. C. Elliot, who died while the Church building was being erected, took charge of the present building, and also for providing a salary for the clergy by the congregation.\n\nE. J. CANN.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nThis paper is issued twice weekly, on Tuesday and Friday. It contains news from Prince Albert and the surrounding districts, as well as local and national events. The paper also includes advertisements for various businesses and services.\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S\n11 a.m.: Rev. Mr. Wright\nThe Mission Chapel.\n11 a.m.: Rev. Mr. Matheson\nSunday School.\n7 p.m.: Rev. Mr. Matheson\nST. PATRICK'S\n11 a.m.: Rev. Mr. Matheson\nSunday School.\n7 p.m.: Rev. Mr. Matheson\nST. ANDREW'S\n11 a.m.: Rev. Mr. Matheson\nSunday School.\n7 p.m.: Rev. Mr. Matheson\nST. JOHN'S\n11 a.m.: Rev. Mr. Matheson\nSunday School.\n7 p.m.: Rev. Mr. Matheson\n\nFRIDAY, DECEMBER 18, 1885.\n\nLAND GRANTS\n\nWe are glad to see that some of the eastern and southern papers, quoting from the recent articles in The Times, have taken up the subject of the injustice done to the N.W.M.P. Police by the government in not granting them land grants similar to those given to the militia. This is a subject on which very little can be said apart from the actual facts themselves; and therefore, we have thought fit to refer our readers to the same article, so that it would only be tautology to go into it again. The justice of what we ask is so plain that we wonder why the government does not wish to act rightly, should at once allow the claim that we put forward. Surely if two men work together, and do the same and an equal amount of work, then in compensation for these two men, they ought to get equal remuneration. And to shield oneself behind some quibble as to under what Acts men who did the same service, engaged, is a very mean thing to do, but has been done especially in times of rebellion, when all efforts were directed to the same great and noble ends—such as the glory of our Queen and country, the maintenance of our laws and the safety of our streets, families and homes. We have suffered through some difference in the Acts of Parliament that we are not entitled to our land grant, and we do not allow it for a moment—surely it will be our duty to demand from the Government to give it to us, the more so as it would not cost them much, and would be a great boon, to say the least of it, to ourselves. So far as land grants are concerned, we have always been assured by the government that there was no question of money, and now, instead of making any complaint, we should allow the elected members to determine enough to throw away.\n\nDRESS FLOORING, $48\nUNDRESSED DO., 42\nDRESSED SIDING, 48\nUNDRESSED DO., 42\nSHEETING, 30\nCOMMON LUMBER, 35\nDIMENSION DO., 40\n\nLATH, 75 cts. per bundle.\nSHINGLES, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS PAYING CASH OR GIVING GOOD SECURITY FOR LARGE ORDERS, WILL HAVE A REDUCTION MADE.\n\nPROCLAMATION.\n\nVICTORIA, by the Grace of God, of the Kingdoms of Great Britain and Ireland, QUEEN, Defender of the Faith, &c.\n\nDEKINDEY, Lieutenant-Governor.\n\nTo all whom these presents shall come or whom they may concern,\n\nGREETING:\n\nWhereas by Section I of Ordinance No. 1881, entitled \"An Ordinance respecting Sale,\" it is hereby ordered that the Lieutenant-Governor be directed to make proclamation the portion of the North West Territories, and that the same shall take effect forthwith.\n\nAnd whereas a proclamation has been made by me, the said Lieutenant-Governor, in a certain portion of the said North West Territories, by virtue of the powers hereinupon vested in me as aforesaid, I do hereby proclaim that the said Act and Ordinance No. 1881 shall take effect forthwith and take effect from the date hereof following the Proclamation of the North West Territories.\n\nWest of the Second Principal Meridian.\n\nTownships numbered 46, 47, 48 and 49, in Ranges 23, 24, 25 and 26.\n\nWest of the Third Principal Meridian.\n\nTownships numbered 46, 47, 48 and 49, in Range 1.\n\nNotice! On account of my recent loss by fire, I must request all those indebted to me to call and settle their accounts immediately.\n\nI will be found for the present in A. L. Sifton's law office next door west of Stewart's store.\n\nSTEWART BROS. T. E. JACKSON\nNOTICE.\n\nTHOS. POWERS,\nCONTRACTS\nFOR\nBrick, Plastering and Stone Work.\nOwner can have work done by paying property and paying expenses.\n\nMr. O. E. Hargrave, M.M.W., for this district, has been a very busy worker in the cause of Education. He took a deep interest in the School and other Obligations affecting the Territories generally, and he has not been able to do justice to his duties. He got a very liberal award for the Agricultural Society, and also a considerable amount of money for the expenditure on roads and bridges.\n\nThe members of our School Board, along with Mr. Hargrave, visited the Public School on Monday, and spent the afternoon there. They expressed themselves highly pleased with what they saw and thought. The views taken are of great importance, and show that an interest is manifested in our Public Schools. We should all be interested in an interest in our school, and often visit them. We have no institutions in our midst in which we could be more proud or glad, and if we wish to add another glory to leave our children, let us endeavor to give them a good Public School education.\n\nWe have been allowed to take a peep at the stage in the Hudson Bay Company's yard, and see how the N.W. Mounted Police Band will carry out for this winter's entertainment, and they are sure to be congratulated. The band is made up of the best men of its kind, and everything is being done to make the entertainments a thorough success. We are sure that the band will give satisfaction to the audience. The opening programme will take place this evening, and we feel sure that we can look forward to spending a very pleasant evening. The second part of the programme will consist of a concert, and the third part of a grand firework display. The band will be in attendance. Mrs. Perry has very kindly lent her piano, and we are sure that the audience will be delighted with the music. We hope that if the first entertainment draws a good house they will be continued about once a fortnight during the winter.\n\nNORTH WEST FACTES\n\nEDMONTON.\n\nFrom the Bulletin.\n\nPloughing ceased on Friday, the 6th inst.\n\nGood skating on the river on Sunday last.\n\nJudge Travis left for Calgary by last Friday's stage.\n\nCanoe race again on the second Wednesday in April.\n\nThe Snowman has now ceased running for the season, and is now grinding.\n\nA grain threshing machine is on the way in for Hardisty - Fraser's great mill.\n\nIndians are said to be leaving the reserves here for the south. A good reliance.\n\nThe Taylor, of the H. B. Co., at Lac Ste. Anne, was in town on Wednesday, attending the Indian trials here as a witness.\n\nBATTLEFORD.\n\nFrom the Herald.\n\nOne afternoon last week a party of four sportmen shot 300 rabbits.\n\nThe first genuine commercial match ever held in this town took place here on Saturday last.\n\nCapt. Nash has received information that the Department of Militia has granted him a sum of money of $15 each as compensation for clothing.\n\nThe payment of the fine Indians entitled to receive their annuities was completed last week.\n\nThe weather up to Friday night was mild and damp, but towards Saturday morning the wind got colder and a little bit of snow fell.\n\nMr. Chisholm, of the firm of Macleod & Chisholm, left for Saskatoon Friday for the New Year (or New Year Day) in his newest bullion.\n\nThe first part of the land of cattle he brought to Gallagher & Co. got into the river last week, and was in better condition than when they left Winnipeg.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION 14th.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Premiums and Grand Prize Scheme.\n\nOver $1,400 worth of Handsome Prizes to be given away\n\n100 Splendid Prizes.\n\nBalance of 1885 FREE. Only $2 to 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nHOW TO SUBSCRIBE.\n\nEnclose Two Dollars in registered letter writing name and postoffice very plainly and address to\n\nFREE PRESS, WINNIPEG, MAN.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory.\n\nSubscribe or The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nSaskatchewan Diocese\n\nHis Lordship the Bishop's Recent Trip.\n\nHis Lordship the Bishop of Saskatchewan returned home on Saturday last from a visitation of the Alberta district of the diocese. At the close of the visitation, which the Bishop made in order to inaugurate a mission by arranging to have fortnightly Sunday services carried on by the Rev. H. T. Brown, who resides in Fort MacLeod, and who has already been commissioned to the pagan Indians in that neighborhood. A clergyman will be settled in Lethbridge as soon as possible. Sir Alexander Galt has promised fifty dollars a year to the bishopric for the first five years, also a donation of two hundred and fifty dollars towards the building of a church. The population of the place is rapidly increasing. At Fort MacLeod the Bishop held a service for the consecration of the fine new church recently erected there, and placed Mr. Hilton (formerly of Emmanuel College) in charge of the mission. At Pincher Creek, where he met the Rev. E. P. Brown, and visited the newly opened mission, a very fine church has been built and dedicated by request of the congregation. In the Bishop's address to the congregation at Pincher Creek, he spoke of his intention to make a second visit to the mission there during his stay, and obtained liberal subscriptions for the support of the mission.\n\nThe Bishop spent two days at Edmonton, where he visited the Rev. J. W. Trim, and arranged for the immediate building of a substantial church there.\n\nAt Calgary the Bishop heard of the opening of the new Rev. J. W. Trim's residence, and visited the mission house. He paid a visit to Red Deer, the chief of the new reserve, twelve miles from the mission house, and arranged for the immediate building of a substantial church there.\n\nIn Calgary the Bishop heard of the opening of the new Rev. J. W. Trim's residence, and visited the mission house. He paid a visit to Red Deer, the chief of the new reserve, twelve miles from the mission house, and arranged for the immediate building of a substantial church there.\n\nTOWN COUNCIL.\n\nThe Council met at Mr. Woodman's place on Monday evening. Present: Coms. Brown, Betts and Beaton. Com. Brown in the chair.\n\nMinutes of last meeting read and approved.\n\nCommunications were received from Mr. Beaton, enclosing an application for a loan of thirty pounds, from Mr. Brown, enclosing an application for a loan of twenty-five pounds, and one from Com. Betts, tendering resignation as a member of the Council.\n\nMoved by Com. Betts, seconded by Com. Beaton, that Coms. Brown, Beaton and Betts be appointed to consider the above applications, and report thereon at next meeting.\n\nMoved by Com. Betts, seconded by Com. Beaton, that the above applications be accepted. Carried.\n\nMoved by Com. Beaton, seconded by Com. Brown, that the above applications be rejected. Carried.\n\nMoved by Com. Betts, seconded by Com. Beaton, that the above applications be rejected. Carried.\n\nMiss Mack & Co.\n\nJUST RECEIVED:\n\nA large assortment of Ladies' and Children's Straw, Felt, Velvet and Cotton Hair Hats, Hair and Hat Shapes, Feathers, Flowers, Buckles, Jet Lace, Ribbons, Satins, Velvets, Plushes, Craps, Fur Caps and Muffs, Cloaks, Shawls, Coats, Wraps, Glaces, Hose, Buttons, Linings, etc.\n\nAt low prices possible. Coms. and cons.\n\nFirst Door East Telegraph Office.\n\nJ. M. Campbell.\n\nREADYMADe CLOTHING\n\nDry Goods\n\nCrockery,\n\nAND\n\nGroceries!\n\nWINNIPEG FLOUR.\n\nCHEAP FOR CASH.\n\nJ. M. Campbell.\n\nCALLEDONIA BREWERY\n\nEAST END.\n\nLIVERY & FE D STABLE\n\nCHAS. WOODMAN\n\nPRINCIPAL\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885121801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 3467, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1773, 1], [1773, 5951, 2], [5951, 10100, 3], [10100, 13755, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]