[{"id": "9b8d283a7ffee426fc7d430b4e4f8166a4dbfbeb", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nThis paper may be found in\nNew York, Chicago, St. Paul,\nMinneapolis, Toronto, etc.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's—His Lordship the Bishop of Sask.\nTrinity Memorial Chapel—Rev. A. H. Wright.\n3 p.m.—Sunday School.\n7 p.m.—His Lordship the Bishop of Sask.\n\nSt. Catharine's—\n10 a.m.—Rev. J. F. Prichard.\n3 p.m.—Rev. E. Matheson.\n\nSt. Paul's—\n11 a.m.—Rev. Canon Pickett.\n5 p.m.—Rev. J. F. Prichard.\n\nSt. Andrew's—\n10 a.m.—Rev. J. F. Prichard.\n3 p.m.—Rev. E. Matheson.\n\nSt. John's—\n6 p.m.—Rev. J. F. Prichard.\n\nSt. James'—\n6 p.m.—Rev. J. F. Prichard.\n\nSt. Anne's, R. Catholic—\n9 a.m.—Rev. J. F. Prichard.\n\nSt. Paul's (Presbyterian)—\n11 a.m.—Rev. Mr. McWilliam.\n\nFRIDAY, AUG. 21, 1885.\n\nRIEL'S SENTENCE.\n\nWhile the trial of Louis \"David\" Riel was yet in the future, there existed no reason to doubt that he would be treated without fear or favor, and carefully abstained from the indecent and maliciously offensive remarks calculated however remotely to prejudice his individual case. The fact that what was all along a foregone conclusion has now become confirmed by the trial and condemnation under the laws against which he so grossly offended, removes all restriction upon our utterance, so we may now without hesitation express the firm conviction that the sentence of death pronounced upon him should be carried into effect. The recent recommendation to mercy by the jury seems too difficult to understand and in our opinion somewhat gratuitous nor capable of justification by the circumstances. As far as we can judge there can only be two explanations of their motive in acting as they did. The first is that the first of these is to be found in the fact that a fictitious political colour has been imparted to the motives and actions of Riel, while the whole of the case is directly responsible not shall such under the circumstances so abhorrent to humanity which commonly accompany a deliberate murder, nor indeed has any of it been shown to have been spilled unwittingly by the hands of the wretched murderer. In view of this it must be remembered that whatever may be urged in extenuation of the conduct of his dupes, the motives of the man most responsible for the delusive smile wrapped round them by a mawkish sentimentality, and viewed dispassionately, disclose the full vagueness of a spiritless desire to revenge injured personal vanity and a sodden growth of gain. That these ordained incentives to commit brutal murder led Riel to shed blood in a different way is owing to the fact that it was in that other way alone that he could hope to accomplish his end, having a Government instead of an individual to strike at, and that he did so deliberately and actually take life that may have contributed to his physical condition. Had he been guilty of ordinary murder, the number of his victims must have been vastly diminished, and the number of those who died for whom he was professedly friend-ly, nor others whom he can not affect to hold in any way responsible for what roused his vile passions. In estimating the enormous magnitude and importance of this man's crime, it must not be forgotten that even had it not been conclusively shown that he used every effort to incite the Indians, his most serious harm corresponded with his knowledge of their body, soul, legal and morally—for the atrocities committed and the yet worse possibilities so mercifully averted. The last shock of the political situation in which he may have been involved, the naked boldness of his conduct disappears with the consideration of the fact that neither his own active effort nor those of the opposition have been able to prevent the grave injustices such as would afford the slightest justification for the introduction of civil discord under far less dangerous conditions. The only other explanation of the condemnation of Riel would be the possibility of a doubt in the minds of the jury as to the man's sanity. This question of the responsibility of a certain number of criminals is a wide and difficult one, and each case must be considered on its own merits; but in dispute that Riel is mentally sane enough to understand the consequences of his actions would be a matter of common knowledge. As to the moral responsibility, the opinion of experts taken to make out a case for him, nor should much weight be attached as a rule to the moral views of those who have by long experience been brought to a close attention to this peculiar study ought to regard the bulk of their fellow creatures as falling short of their ideal standard of mental and moral excellence. Even the question of his being judged by an ideally common sense of ordinary men, unprejudiced by the conflicting opinions of specialists. Nothing has been adduced to show that in ordinary life he was insane, and even more Riel had any difficulty in distinguishing between right and wrong, while e.g., there may be cited to prove the contrary, his own personal pecuniary loss caused by his lack of prudence. The only difference was that when the stakes seemed high enough he was inclined to run risks, and while nursing his vicious designs unmeasured the sympathy of the public and the fitness of the Government. Louis Riel belongs to the most dangerous class of criminals, and personally is only redeemed from absolute vulgarity by the absence of any enthusiasm. This is not his first offence, and he says himself that if he can get the rope off his neck, it will not be the last. The vindication of justice and the future peace of the country are many feet distant if equal justice is not asked, and must therefore profitably agree to work together. Mr. White's own career as a journalist will naturally incline him to a fair consideration of views urged upon his notice by the press.\n\nTHE NEW MINISTER.\n\nWe cordially endorse the many congratulations offered to Mr. Thos. White upon his appointment as Minister of the Interior, and assure him that should the interests of the Territories find that he is honestly anxious to adopt a broad, vigorous and just policy in dealing with this vast country, he will find them quite ready to sympathize with the many and great difficulties necessarily incident to the task of its development. We feel sure that his appeal to his acknowledged sound common sense, as well as to the general results of his large experience, when we remind him that the one thing which is essential to the prosperity of any nation is the adoption of some system of law and order, will be successful. Mistakes cannot be expected to be altogether avoided, but there can be no reason why people who express their desires and requirements in a reasonable manner should fail at any rate receive a clear explanation of why they cannot be granted, when such may be the case. We may remind the new minister that the difficulties with which he has to deal as to what is best for the Territories and its inhabitants he will have to exercise particular care with regard to the manner in which he may appear to public opinion, as he will inevitably see through the medium of their eyes, and upon their judgment must depend the success or failure of his policy. While we do not desire to spend dilatory words of mere merit, we from the east, too often chosen as a reward for some service done, rather than from any regard to their fitness for the positions they have to fill, we may observe that it is far more natural for those who stand in other ways equally qualified, are likely to do much better service in consequence of the intimate knowledge of the country and its resources, of the people and their wants, acquired by a long actual residence. We observe that the Regina Leader takes the opportunity of coupling with its congratulation to the new minister up on his installation of a good advice with regard to the best land policy suggested by our circumstances. Of course this matter is only outlined, and we have no doubt the Leader will give us further information on the subject when it becomes available. We may say that we cordially agree with what we have seen of what has been said so far, and think it would be well if the land given to the new receiver goes to support Space does not permit of much touching upon a subject about which so much requires to be said, but we hope to approach it immediately. We believe that what is combined action on the part of the Territorial officers may to a considerable extent account for delay in the amelioration of our condition, and while we each may have our local axes to grind, there are many feet distant if equal justice is not asked, and must therefore profitably agree to work together.\n\nTHE DRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made,\n\nTHOS. POWERS, STEWART BROS., TRADERS, GENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL CROSERIES\n\nTeas, Tobaccos, Coffee, Oatmeal, Sugars, Canned Goods, Cal. Peas.\n\nClearing out the balance\n\nCrockery and Hardware, AT COST\n\nNOTICE.\n\nAll parties indebted to us must be settled before the 1st August next, owing to an intended change in the business.\n\nSTEWART BROS.\nTAMPERING WITH THE INDIANS.\n\nTo the Editor of The Times,\n\nSir—There are a number of half-breeds buying themselves among the Indians by circulating what I imagine to be false stories, which are calculated to keep the minds of the Indians in an unsanctified state. I will ask you to insert some of these stories with the view of ascertaining whether those who have been guilty of actions deserving reports among the Indians.\n\nI. A half-breed told a missionary belonging to the Church of England, that six American officers had been sent to Regina to demand the release of Riot, and that Riot was now held under the hands of police keeping guard over the prisoners there, that they let Riot go at once. Further, Riot was then in the State making friends, and would be another and more successful campaign, and that this campaign would soon be in the hands of half-breeds and Indians.\n\nII. Another half-breed told the chief and several of his followers (same band), that Dumont was on his way back from the United States, (he is not all wrong,) and that those who fled to the police for protection would soon have to flee where again.\n\nIII. A third half-breed told the same chief, that he had received his news papers in which was given a full account of the different battles fought between the half-breeds and soldiers, and added with much satisfaction \"it is not a little blood that has been spilled,\" and being asked how many soldiers they had killed, he said \"five hundred.\" The same man to other parties, with a plausible story, gave them every reason why Indians and Americans, coming to clear the country of Canadians. These rumors may be true or false, but I believe myself, simply ridiculous, but we must remember that the Indian's knowledge of the white man is very limited, and only know what he is told, not being able to read papers for himself, and as the half-breeds who are now possessed of the outside world, who have been educated principally by these half-breeds—a specimen of such education I have given above, show that we shall have some idea of his troubled state of mind. Since these rumors have been going around, I have had chance to converse with some of his followers in asking me many questions relative to the same remarks. The half-breeds after returning to old Canada, were anxious against the Government, but were among those who claimed to have been loyal, while in truth they had been disloyal at least as those who fought at Batoche, only doing so, using they were grown cowards. I repeat again, that any government official whom you think empowered to search into these matters, applying for your aid and assistance, you are permitting to give you advice, but not to acquire who may simply use to satisfy their curiosity.\n\nYours, etc.,\n\nFAIR PLAY.\n\nTHE SOLDIER PRIEST.\n\nWe have great pleasure in publishing the following letter to His Lordship the Bishop of Saskatchewan, from the Rev. Mr. Smith, commenting on the bravery of the Rev. Canon McKay during the late rebellion:\n\nMy Lord—I feel it my duty to bring to your attention the self-sacrifice and gallantry of a man of our Church, the Rev. Canon McKay. In the last instance he was wounded and subsequently unhorsed for the dangerous task of driving away big Bear's camp with a horse carrying the London Times newspaper. He never desisted from his self-imposed task, going in advance of his followers and attacking the enemy in order to open a passage for those following him. He subsequently returned to his horse with the hope of rescuing the ladies who had been taken previously by the Indians, and with a modesty well becoming his sacred office have been the admiration of the whole force. Such an example among young soldiers is most commendable.\n\nGENERAL NEWS.\n\nGREAT BRITAIN.\n\nLondon, Aug. 10.—John Rankin is ill; friends report his condition worse.\n\nQueensway, Aug. 10.—The Etruria came across the ocean to fasten its 28-hour record anchor line.\n\nThe Amazons are preparing another large force of Afghan troops for the protection of India. Further, the British government has instructed Russian authorities concerning their alleged brutal conduct toward the native women.\n\nThe Anglo-Chinese Alliance has been concluded between Great Britain and China for mutual action in the event of a war between England and Russia.\n\nFRIDAY, AUGUST 21, 1885.\n\nNOTICE.\n\nAs no person has paid in a claim for the pipe advertised by me, I will sell at my farm on the\n\n5th Sept. Next, at noon\n\nWILLIAM SHIPMAN.\n\nJust received at Shannon & McLeod's a large assortment of Men's Riding Boots, Walking Boots, Lace Boots, Fine Tie Shoes, and all kinds of Cowhide Work.\n\nAlso a large assortment Ladies', Misses, and Children's Fine French Kid Button Boots and Slippers.\n\nOf all kinds and sizes and at prices to suit purchasers.\n\nSHANNON & MCLEOD\n\nPUBLIC NOTICE.\n\nPublic notice is hereby given that proceedings have been taken against the erection of the proposed Municipality of \"The Town of Prince Albert,\" comprised of the following tracts of land, namely:\n\nParts of lots numerically eighty-eight, ninety, seventy-one, seventy-two, seventy-three, ninety-four, ninety-five, ninety-six, ninety-seven, ninety-eight, ninety-nine, eighty, eighty-one, and eighty-two, and of that lot known as the \"Town Site.\"\n\nThe Governor and Company of Adventurers of England trading into Hudson's Bay, by virtue of the Royal Charter, and also being in the special survey of Prince Albert Settlement, as shown upon a plan of Prince Albert Settlement, executed by Mr. J. H. Davis, by Mr. Davis for the Surveyor General, and of record in the Department of Public Works, have been surveyed and bounded as follows, that is to say, commencing at a point where the western boundary line of the town site crosses the water's edge on the northern shore of the North Saskatchewan River, thence along the northern water's edge bearing due north astronomically forty-three degrees eight minutes and thirty seconds east, to a point where the same line crosses the water's edge on the southern shore of the North Saskatchewan River, thence due south astronomically forty-three degrees eight minutes and thirty seconds west, to the point of commencement.\n\nThereupon under and by virtue of the provisions of the one hundred and seventh Section of the Ordinance No. 4 of 1876, intitled \"An Act respecting Municipalities,\" I do hereby order that an election shall be held in accordance with the provisions of said Ordinance, in four weeks from the date of the first publication of this notice in The Prince Albert Times and Saskatchewann Review.\n\nE. DEWNEY,\nLt. Governor of the North West Territories,\nGovernment House, Regina,\nJuly 18, 1885.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\n\nOf all descriptions done neatly, quickly and cheaply\n\nJOB PRINTING\n\nSubscribe for The Times and get the latest news and happenings around town.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\nADDRESS\n\nTo Major Crozier, S.W.M.P., by the Volunteer Rangers in the West Lake Fight.\n\nThe following is the copy of an address presented by Major Crozier by the Prince Albert Volunteer Rangers at the time of his departure from here:\n\nTo Major L. N. F. Crozier, Assistant Commissioner, North-West Mounted Police.\n\nSir — At an informal meeting of several of the members of the Prince Albert company, which was unexpectedly called out and under arms at Carleton, it was suggested in view of the very large amount of work which the North-West affairs generally and Police matters particularly are subjected by a class of people who are not possessed of the knowledge appertaining to fundamental facts, that we should place on record our appreciation of your services and get history on the occasion of the memorable encounter with the rebels near Duck Lake on the 29th of July last, in which engagements we had the honour to serve under your command.\n\nThe fact of such an encounter with the enemy under the circumstances then existing, in such a position and in such force could in no way have been anticipated, and was not at the time, and we consider it a privilege to be able to express our grateful thanks under the circumstances.\n\nThat the disposition of the forces in the engagement was most unfortunate and that our success on the occasion was purely attributable to the nature of the ground and the large force from secure positions of which the enemy directed us against which our detachment deployed, and further still by leaving the field of action every endeavor was made to destroy all the wounded, and that in the face of the heavy fire to which we were subjected it would have been impossible to make any expenditure of human life to have attempted to carry off our dead.\n\nAs the result of these sad fatalities we have been able to bend a sense of sympathy between us, offer this our testimony to your personal merit and as an expression of our regard and esteem we record the brave conduct of the individual members of the North-West Mounted Police Force on the occasion referred to.\n\nWe are dear Sir,\n\nYour obedient servants,\nH. Stewart Moore, Capt.; T. N. Campbell; J. H. Murray; G. Johnston; C. Ramsey; Wm. Duffield; Wm. Tait; Lawrence Clarke; Alex. McNabb; W. T. Haskin; Wm. Dickson; T. Purser; George Wilson; A. Stevenson; John Waymirekirk; James Flatt; W. Barker; Chas. Byram; C. A. Newitt; Jas. Brown; Thomas McKee; Wm. Harris; R. Markby; Hugh Nelson; C. Gibson.\n\nREPLY.\n\nCOMMUNICATIONS.\n\nVERITAS.\n\nTo the Editor of The Times.\n\nSir — In a late issue of the Manitoba Daily Press there appeared an article by Mr. J. C. McKenzie, in which he accuses D. J. Waggman, Crown Timber Agent or owner of being the author of a letter signed \"Veritas,\" published in the Times of July 2nd. I beg to inform Mr. McKenzie that neither myself nor any member of my family ever appeared under the name of Veritas, but it appeared in the Times, and I firmly believe that Mr. McKenzie when he penned down those words knew full well the author of \"Veritas,\" knew at the time he was stating a deliberate falsehood, but judging from Mr. McKenzie's conduct during the recent late rebellion, in which he accuse the N.W.M. Police of cowardice at the battle of Duck Lake, and the conduct of the Government of Prince Albert in acting in an arbitrary and tyrannical manner, I can only conclude that Mr. McKenzie is a narrow minded political bigot, who would willingly see anything, let it be true or false, brought about through him, he was making a point against the Government, so Mr. McKenzie goes whining about the \"Free Press\" and says that if it is not, it is nothing more than to make charges about him without letting him defend himself. Mr. McKenzie is a narrow minded political bigot, who would willingly see anything, let it be true or false, brought about through him, he was making a point against the Government, so Mr. McKenzie goes whining about the \"Free Press\" and says that if it is not, it is nothing more than to make charges about him without letting him defend himself.\n\nI feel sure that Mr. McKenzie, if he had any pride, would know the name of the man who wrote the letter, it is a pity that he does not, this when he was making his cowardly and untruthful charge against the mounted police, he thought of Prince Albert and Prince Albert. And I now challenge him to name the politician or Government official who wrote the letter as described, and if he does not do so he must stand convicted before the public as a cowardly slanderer. As Mr. McKenzie always petitioned for the money to bring Riel here, I am one that always believed him to be doing so, and I have heard him to say in sympathy with the agitation carried on by Riel and his dupes, and often connected with the same demands of giving the slightest encouragement to a man like Riel—who was nothing more or less than a revolutionary—Mr. McKenzie with the argument that a little rebellion was what we wanted in the North-West.\n\nI am under the impression that had it been for the sake of the movement and sympathy given to Riel's agitation by McKenzie and others of a similar type, there would not have been such an unmitigated rebellion, which was the means of shedding the blood of some of our best citizens, and which has brought anguish and desolation to many a happy home throughout the Dominion.\n\nHugh J. Montgomery.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine Plastering Hair, steam refined Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the selection for our Grocery Department, Carnels, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Sodas, Fruits, Toffee Fingers, Lemon Creams and Food Biscuits.\n\nMake a choice addition to our well assorted line of GENERAL GROCERIES.\n\nFor a luxurious smoke we recommend Buffalo Hall.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. Hughes & Co., General Merchants and Indian Traders.\n\nHave just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of Groceries now on hand is the most complete ever received, comprising Morton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar.\n\nWhich we will sell cheap for cash.\n\nO. E. Hughes & Co.\n\nT. N. Campbell, Bookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885082101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5349, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9632, 2], [9632, 16620, 3], [16620, 23477, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]