[{"id": "58b4780dadfefb89eaea56300649c8acd91c91e9", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVETTY\nPRINCE ALBERT N.W.T.\nTRAVEL—$2.50 per month in advance\nBooks—$1.00 per month in advance.\nIn case we fail to meet in this paper, please notify us at once.\nTransit advertisements $6 per line for space taken up by the ad.\nNo contracts made under three months.\nNo advertisements inserted for less than $1.00.\nAdvertisements must be paid for before publication.\nAll communications addressed to the Proprietor.\nJ. D. MAVETTY, Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Albert's Church—9:30 a.m., 11 a.m. and 7 p.m.; Sunday School—11:45 a.m.; Lessons—12 noon; Sermon—12:45 p.m.; Service—1:30 p.m.\nSt. Matthew's Church—10:30 a.m.—Rev. Canon Flett.\nSt. Andrew's—10:30 a.m.—Rev. Dr. McNaughton.\nSt. John's—9 a.m.—Rev. Dr. McNaughton.\nSt. Mark's—10:30 a.m.—Rev. Mr. Macdonald.\nSt. Paul's—9 a.m.—Rev. Mr. Macdonald.\nSt. Peter's—9 a.m.—Rev. Mr. Macdonald.\n\nThis Paper is Published Every Friday at the Office of the Editor, Prince Albert, Saskatchewan. It appears every week and is sent by mail to subscribers in New York.\n\nFRIDAY, APRIL 19, 1889.\n\nAs will be seen from our telegraphic despatches, there is not one cent in amounts to be voted this session, which has been spent in the Northwest. It is all gone to local lines in the eastern provinces. We did not expect to see a cash subsidy offered to any line running in this direction, and are therefore not much disappointed. It is quite evident that we need not expect help from the Government or the C.P.R. and we should look now in some other direction, and we think the overtures should be made to the M. and N.W.T. to begin with. We are now only about the same distance from the latter road as from the C.P.R. Our merchants should take the initiative, and bring their supplies over the M. and N.W.T., and give the C.P.R. the go by. The road has been grinding its doom long enough.\n\nThe last issue of the Regina Journal, under the caption \"Stepmothering the North,\" has an able and pointed article on our status and our rights to assistance from the Government in securing railway facilities. Exactedly so. The Journal's article is true and to the point, and has the right ring about it. En Qu'Appelle Vedette also sympathizes with us in our endeavors to secure a railway.\n\nThis has been an early spring all over the Territories, and as a consequence seeding will be much earlier than usual, with every prospect of good crops. In this immediate district seeding is about over. The area under cultivation this year will be about the same as last, but very little difference can be seen. Those who have not yet call out their farmers are putting in as large, and in some instances a larger, acreage than last year, while many of the poorer class are sewing very little, and in some cases not even sowing at all. While there is no encouragement to raise grain for market, there is no reason why every person owning land in the district should not raise enough grain to supply themselves with bread for a year. Because we are not likely to get a railway, and consequently no market, is not a reason why farmers, if they intend to remain here, should sit idle and allow the summer to pass without making provision for their daily bread next winter. The man who does not do this is doing his own destruction, and deserves and better fate than that of starvation. We would strongly advise every farmer in the district to put in a crop, and make himself independent of any surplus grain he may have, it will not necessarily be labor for nothing. He can hold his surplus over until we find a way to the markets of the world, which time we trust will not be very far distant.\n\nIf we cannot have a railway to the south, we are at least to have a means of communication with the north. We understand all arrangements have been made to lay a deep ploughed river and turnpike at once. The best part of the affair is that it is to cost the town little or nothing. It will prove a great convenience not only to ourselves, but to those who live further and further north of the river and will bring some trade to the town as well. The rifle association should now be able to utilize their new range on the north side of the river.\n\nThe School Board on No. 3 School District evidently think their town does not possess sufficient educational facilities. We believe a new school is to be opened in the near future. A school there might be a necessity, but we are of the opinion that the education of the young is being rather over provided for. With a population of six hundred we have six schools, and this will make seven.\n\nW. STOBART & CO.\nIndian Traders\nGeneral Merchants\nPRINCE ALBERT\n\nM.W. STOBART & CO.,\nIndian Traders,\nGeneral Merchants\nand Millers\nDUCK LAKE - SASK.\n\nNOTICE\n\nCampbell's Cathartic Compound\nCure Catarrh, Constipation, and all Complaints arising from a diseased state of the Liver, Stomach and Bowels such as Dyspepsia, Indigestion, Biliousness, Atrophies, Hemorrhoids, Constipation, etc., etc.\nPrice 25 cents each bottle.\nDAVIS & LAWRENCE CO. (Limited)\nMONTREAL.\n\nHORSE SHOE STORE.\nJUST ARRIVED—LARGE ASSORTMENT\nDRESS - GOODS!\nComprising Fun's Yelling, Serge, Quakers, Men's Felt Hats, Machine, Sporran Ladies' Trimmed Hats, Children's Hats\nFULL RANGE LATEST STYLE MEN'S\nAmerican Felt Hats.\nLatest in Men's, Youths' and Boys' Clothing\nCall Early and get Your Choice—Prices Lower than ever.\nTHOS. O. DAVIS.\nR. C. WIGMORE & CO.\nMen's and Boys' Underwear.\nMen's Cardigan Jackets.\nMen's Pea Jackets\n1,000 Armaments | Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Underwear at cost for cash\nMitts and Moccasins\nA Paying Investment. Insure Our Stock.\nR. C. WIGMORE & CO.\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Pecquisites of every description,\nStephens' Blue Black INK,\nALL SIZE WRITING AND COPING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nA LARGE STOCK OF Imported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS\nIN ENGLISH AND AMERICAN LINES.\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion.\nSUMMER SUITINGS\nIN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson Robertson\nRAILWAY NEWS\n\nHope for Saskatchewan\n\nMacdonald Working Hard.\n\nGood Prospects of Success.\n\n(By Special Telegraph)\n\nSo far as going to press we have received no special message from Regina, in connection with Mr. Macdonald's working hard for railway connection, and that he has so far succeeded that the Government has authorized a new cash subsidy outside of the estimates.\n\nGENERAL NEWS.\n\nMr. Campbell will move an amendment to the Franchise Act, in the House of Commons, to the effect that there shall be national suffrage throughout Canada, excepting only those who are unable to read or write, and that the franchise shall be extended to all persons gainfully employed.\n\nIt is said that the death of the officer whose death was reported last week, caused the resignation of the presidency of the Evangelical Alliance, in the alleged fact that the late president had given his chief objections to the Jesuit Bull, the condemnation of Protestant Institutions, and not giving the Roman Catholic Church its due share of the patronage.\n\nP.F. Pratt, captain of the Fat National Bank, at Amisk, Alta., embarked on the steamer \"Montana,\" bound for Edmonton, last week, to try him for an aged widow, and her two children, who had been sent to Minnesota ten days ago, and it is said that he will go there for Canada a week since. The bandit, who was arrested by the United States examiner from Washington will take charge of the case. The prisoner, named Bowler, was accompanied in his flight by a woman, who is said to be the mother of the child he had an illegitimate child last year.\n\nThe recent re-opening of life in the Montana State Jail, made famous by its prisoners, has raised a storm of public indignation. If the stories told are correct, the inmates are said to be engaged in selling young criminals. All are charged with habitual drunkenness, and are said to be insane, and much worse.\n\nNever before known English speaking families have been placed in such a state of going west. It is a notorious fact that all advertised auction sales in homestead territory are conducted by thieves. Miss McKean, of Edmonton, and daughter of the late Dr. McKean, who was missing for several weeks after whose vigilance party were searching for her, was found in a brick kiln in the western part of the county. She was badly injured and appeared to have fainted for a week. The girl was recovering from typhoid fever when her body was found.\n\nThe Rev. J.J. Donaldson was tried for indecent assault at Edmonton, on several boys. He was charged with having says to the effect that he had been with the only witness examined. Tony sold a simple copy of the assault while stopping with Donaldson, and gave the names of consenting parties to the assault the other night at a party.\n\nSeveral farms near the Red Deer River are demanded their notes from A. Robe, trustee for a Halifax firm. One of the farms was purchased by Mr. Robe against a certain charging him with obtaining money under false pretenses.\n\nRobe has been arrested for General Boulanger at the Continental Hotel to London. The general and his entourage are expected to arrive here next week during this week. This move is understood to be intended to prevent their arrest, contrary to the wishes of the British Government.\n\nThe duchess of Cambridge, and the Queen, mother of the Duke of Cambridge, is the eldest daughter of the Lord Ludlow, Friedman of Hesse-Cassel, and was born May 24, 1837, at Windsor Castle, May 17, 1858, the second daughter of Cambridge, the youngest son of King George III.\n\nGreat interest has been raised by some of the religious papers over the fact that the Prince and Princess of Wales are engaged to be married, according to the advice of the First Lord Lieutenant of King's Bench, barrack, and subsequent engagements of various young women, who are said to be engaged in the same way. The engagement was made public by the Prince and Princess of Wales, and the engagement was made public by the Prince and Princess of Wales.\n\nThe Prince of Leinster was warned of an anonymous letter of a plot to assassinate the Prince of Wales at the races on the 26th of April. Keen precaution was taken to prevent any untoward light occurrence and nothing occurred.\n\nA man has been held in custody in the Town of Princeton by the appearance of Alfred C. Carter, organist of St. Andrew's church, with Miss Annie Graham, who is the leading lady in the opera, who appeared in the town recently.\n\nApril and was so carefully planned that the Prince of Wales was able to attend. Graham was of a quiet disposition and, though pleasant and somewhat reserved, was considered a handsome youth. Carter took his only child, a little girl, with him and left his wife behind.\n\nMr. Clinton has given notice that he will call the Government whether they intend, during the present session, to introduce a Bill incorporating the Orange Order.\n\nA telegram signed by L.E. Irvin, may have been sent by Mr. Lawrence, Dkt., was received by Mr. Chamberlain of Minnesota, who is doing all he can for the farmers of that region.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nEvery Department\n\nCall and Examine Our Stock\n\nJ.M. Campbell\n\nLumber\n\nMoore & Macdonald\n\nLimited\n\nHave a Large Stock of\n\nLumber!\n\nFor Sale.\n\nAlex. Loudoun, Sec.-Treas\n\nAgents:\n\nP.G. Gray, Edmonton, Alta.\n\nJ. Fraser Tims, Fort Saskatchewan Alta.\n\nMahaffey & Clinkskill, Battleford, Sask.\n\n---\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Bowell & Co., 1000 Broadway, New York.\n\n---\n\nG.H. Campbell\n\nRailroad & Steamship\n\nTicket Agent,\n\n171 Main Street,\n\nWinnipeg, Man.\n\n---\n\nAGENTS:\n\nP.G. Gray, Edmonton, Alta.\n\nJ. Fraser Tims, Fort Saskatchewan Alta.\n\nMahaffey & Clinkskill, Battleford, Sask.\nMEMORIAL.\n\nThe following memorial was discussed and a resolution passed at a late meeting of the Prince Albert Town Council that the council would present to the Hon. Mr. Macdonald, at Ottawa, by be laid before the Government, showing the latter the true state of affairs in this district.\n\nThis memorial will reach the House of Commons of Canada in Parliament as soon as possible. The Prince Albert Town Council of the Municipality of the Town of Prince Albert, Province of Saskatchewan, North-West Territories of Canada.\n\nHandily shown—\n\n1. That large petitions and representations have been made to the Government and Parliament of the Dominion calling attention to this region and its needs and necessities of its inhabitants.\n\n2. It has frequently been pointed out that Prince Albert and the North-West Territories are not partly due to the failure of public administration and grave maps which at one time all pointed to the C.P.R. would be built and very largely too upon a belief that the conditions enjoined by Parliament must open a company which would be charged with the M.A. & W. Railway be carried out.\n\n3. The result of these statements and of this belief was a large immigration to this region, whose good climate, rich soil and exceptional conveniences in wood and water and abundant supplies of fuel, formed an ideal spot for a farming community. All these immigrants believing that they would immediately be furnished with suitable land, and that their means here having no fears that the agreements would not be carried out and railway construction would be started at once, instead of this they have witnessed with exceeding regret, not only the C.P.R., delayed in carrying out its promised route but also still further than their interests, the M.A. & W. Railway, whose terminus was Prince Albert, not only forgotten but practically abandoned and actually allowed to cut down their construction from fifty to twenty miles.\n\n4. In this case, realisation after eight years of effort and hard labour to reach this settlement, though, according to the terms of its charter ought to be here.\n\n5. Last winter the people of this district having heard that it was the intention of the Government of the Manitoba & North-Western Railway to send a delegation for a consultation of their affairs of construction, and for a reduction of mileage, and for other matters of importance and specially detailed these problems, at great expense, to go to Ottawa and bring their case before the government, and that the result of these interviews and discussions in Ottawa, were to lead in every case to the adjournment of the question, and that there was no assurance that the Region and Great Lakes Road would be immediately constructed with the result that Prince Albert. They said that their best position came from leading members of the Government that the end of the latter road would be near.\n\n6. Yet a year has elapsed and nothing has been done nor does this community see any nearer to the desired end than it had last winter. Meanwhile the territories are sinking daily, there is no market for our cereal except wheat, and for this we have to pay high prices, owing to a milling interest where, taking advantage of our utmost depression the market for this cereal is now practically non-existent under that of the nearest point of the C.P.R., all other grains are lying unused in people's granaries until it is necessary to sell them, even at reduced prices to dispose of any other produce including stock with which this district is well supplied.\n\n7. These grave facts are seriously disturbing and unsettling the public mind. It is impossible for the people to be long delay in the opening up of the Saskatchewan country and the supplying of its existing pioneer communities with cattle, horses, sheep, swine, poultry, people, in Dakota, a region with a climate more vigorous than that of ours, with a maturing season much more uncertain, and with soils and other resources greatly inferior.\n\n8. Yet with grave developments that territory must be opened up of Manitoba into a province attracted vastly greater population than that of Manchuria and all her Territories put together and is well known that the Government must have, as a matter of fact, been pushed ahead of settlement in that country.\n\n9. We do not point to this through alarmism or through a diabolical spirit, but merely as an evidence of what would be certain to happen just as surely as the development in a good region like this, much superior in climate and soil to that of Dakota or any other American Territory.\n\nAt the same time the duty is inescapable upon us of placing before the Government and Parliament in the face of the most prominent frequently made to the people of this region are not carried out it is our special concern that the Government shall be informed and will exhibit itself in the world the disastrous spectacle of a large and industrious farming community deprived of one of the richest regions in the North-West Territories breaking up through bad faith and the neglect of the Government. It is our solemn duty it is to foster and assist by refusing to supply it with an outlet for the products of its industry.\n\nThe announcement is made that Hon. George on the part of America, Mr. W. J. Macdonald, on behalf of the Government and Hon. Thomas on the part of Government have arranged to hold the international conference on the land question in the City of Chicago on June 1st. In view of the remarkable success which has attended Mr. Macdonald's services in Regina and elsewhere, the attendance in the conference will be very great.\n\nThe Knights of St. Patrick, New York, have forwarded Pursell the sum of $2,000, the receipts of the entertainment given by them on St. Patrick's day.\n\nI beg to inform the public that I have opened on the Bakery between J. L. John & Co., and the Bank. I shall always have on hand a first-class selection of Bread and Fancy Cakes, Xmas and Wedding Cakes, various kinds of biscuits, etc.\n\nH. M. COLL\n\nA GOOD FISH!\n\nIt is a trite saying, often for the sake of discontinued lives, that there are good fish in the sea as well as bad, but this does not hold good in the case of W. R. FISH.\n\nThe Merchant.\n\nWho keeps a full line of General Goods at his establishment. He is the only merchant who can give a guarantee that he will stand behind his goods and sell a good story of himself if necessary. This, however, does not prevent him from attending to his customers' wants in person. His business is conducted so that he has one of the best stocks in town. Call on him.\n\nT.J. AGNEW\n\nSelling Out\n\nFifteen per cent.\n\nFOR CASH\n\nThis is No Humbug.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889041901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 4378, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6266, 2], [6266, 12048, 3], [12048, 18733, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]