[{"id": "02071c6adb4d63a9206c8b31e31577f50f23a243", "text": "OUR VOLUNTEERS.\n\nSome time has elapsed since our attention was drawn to various remarks in the papers belatedly made against the discipline of our volunteer militia companies, and although we have never intended to sit down quietly under the unjust and offensive reflections cast upon our people, an account of this fact—the cause of matters being more immediately for notice—has made our silence of longer duration than we desired. Perhaps the most frequently repeated observation, which has been applied to the disarming of our companies has been grounded upon the suspicion of disloyalty, while the least offensive one has been the inefficiency of our corps. Now, however, to recur to remarks about the disarming of our companies is simply to meet by a statement of the fact that as there was no men enrolled at the time the arms were removed from the companies, we hardly see in what sense they can be said to have been disarmed. The fact of there being no men enlisted may require some explanation, and as the true one will serve to remove the suspicion of disloyalty and the disarming, we may be able to explain what resulted in this state of things.\n\nWhen the officer who came to the Territorial charged with the formation of these companies reached Prince Albert, he called upon the settlers, so far from finding any want of loyalty and zeal on the part of our settlers, he was offered men enough to form three companies instead of the two he proposed to employ, and we safely say that had there been a moderate amount of interest taken in them by the authorities they would have been efficient to-day and enabled the Government to dispense with a large proportion of the militant police force which we find necessary to keep ready against contingencies in our neighborhood at present. The officer who represented the militia department upon the occasion referred to as assuring the company representatives that as soon as he returned to Winnipeg a message could be flashed along the wires to Ottawa our uniforms would be ordered and no unnecessary delay in the forwarding of the same. In fact, for days after the men began to drill, many of them driving considerable distances after their days work was done to get instruction from the men arranged for annual drill, more enthusiasm was manifested, and although the circumstances of the country necessitated their camping and messing at head-quarters away from their homes, during the whole of the first season, and it very hard for them to leave their work—no allowances could be obtained for themselves or horses. This they submitted to as long as their officers could hold out, but when year after year passed and the companies were left without anything further than the rule, and laymen were held to distribute between civilians, it was easily intelligible to anyone in the slightest degree conversant with military matters how utterly hopeless was the attempt to keep up any military enthusiasm. Our disarming was not due to any military enthusiasm, but disarming was due to attributing our inefficiency to want of loyalty, and offer ing it as an excuse for removing the Government arms from our settlement. We believe the people below to understand that nothing but a demand on the part of the militia department prevents the existence of efficient and loyal companies of volunteers in the Territorial today. No doubt there is a good deal of dissatisfaction among the people—some of it undoubtedly the result of ample provocation—but as to loyalty at heart and readiness to do their duty when called upon, we believe that the companies as a whole, compare very favorably with others who have not had so much to discourage them in various ways.\n\nCURLING.\n\nOn Tuesday last the Argyle and Saskatchewan Curling Clubs played a very interesting match on the rink of the latter club, which resulted in victory for the Argyle side by ten stones. The game was a good one, and was anybody's till the last stone was played, but on No. 1 rink the home team, although a strong one, appeared to be the only ones interested, and were beaten by eleven shots. The players and game stood:\n\nSASKATCHEWAN. ARGYLE.\n\nMcKinnon. Murray.\nWynne-Smith. Macdonald.\nJohnson. Macdonald.\nMcKinnon. Macdonald.\nMcKinnon. Macdonald.\nDuck. Miller.\nMcKinnon. McKendry.\nMcKinnon. McKendry.\nNorthern Alberta Curling Club. P. Macdonald, Argyle Curling Club.\n\nThe return rink will be played on the Argyle rink next Thursday. H. B. Gervin, of the Argyle Club, won the medal presented by the Hon. L. Clarke to that club.\n\nWe are pleased to learn that Mr. and Mrs. Macdonald are each to present a medal to the Argyle club.\nTHE FUR TRADE.\n\nIn view of the approaching fur sales in London, which commence on the 26th inst., the following may be of some interest to our readers:\n\nThe Hudson's Bay Company has had several fur advisers. The Moose ship has not been advertised, but about the same time the sale was made at $30,000 per ton, and a further increase in lynx and mink will be fully expected. The large quantity of furs now being imported from China in these articles, and bear will also sell somewhat lower than the enormous quantity of mink now being sold. In view of that article, how it is now is. No rise need be expected in rats as the unseasoned market is still very large.\n\nThe following is a statement of the importation of furs by the Hudson's Bay Company during the months of November and December, 1884:\n\n- Bear, 10,355; Beaver, 119,553;\n- Fisher, 6,411; Otter, 2,130;\n- White Fox, 9,000; King Fox, 7,462;\n- Marten, 78,884; Mink, 110,000; Otter, 12,358; Muskrat, 82,099; Skunk, 12,665; Wolf, 1,837; and Wolverine, 1,000.\n\nNew York, Jan. 8.\n\nConsignments are now coming in in quantity, and the quality could not be better for this season of the year. There are no sales however, and may not be for some time. If the market is weak, buyers have an abundance of time ahead, and owing to the great depression in the market, buying is increasing. It is shown that the part of the fur trade the London auction sales, also, are well off. They occur January 23rd, and though there are many lots and quantities only are sold, the sales will be a guide and stimulus to the trade. From this activity may be inferred the condition of the March London sales, at which every kind is sold. After that the March sales will be weak, owing to the times rain and snow can be thrust upon a buyer, by making great effort and selling with determination, and quantities of other kinds. This will be the case until spring, however, beyond this, so far, rain and snow cannot be given away.\n\nCORRESPONDENCE.\n\nCARLTON.\n\nAny one who has visited Fort Carlton for the first time within three months ago, would hardly recognize it when he saw the new building erected for the N.W.M. Police. The old stockade on the south side has been demolished, and a large stable and several commodious stables for horses for public service, on the north side of the quarter-master's store and surgery on the west side of the hospital, and on the west the sergeant's quarters.\n\nThe officers of the force reside in the old house, formerly occupied by Mr. Clark. The post is under the command of Capt. Gagnon, while Surgeon Miller attends to the sick. Sergt. Major Dyer, Sergt. Brownlie and Sergt. Prud'homme, who was lately promoted, are also here. The quarter-master's store is under the able supervision of Mr. McNeil, who has not forgotten the importance of the Commissary Department. Mr. McNeil, quite a different man from his predecessor, turned only to meet obliging Charles Gibson and his assistant, on a visit here. Now the officers and men are all hard at work, and the place quite lively. On Wednesday last following, Mr. Gibson, accompanied by Mr. J. P. with his band, attempted to procure two years' Indian annuity money, which was not forthcoming. In fact, the Indians had been away doing just what they pleased, and the Agent was obliged to accept the promised money for telling a lie. The case was adjourned till Sunday next, when the Indians will be called upon to account for their absence. If there is nothing to it, perhaps the future Agent will take him home and read a lesson or two. We hope the Indians will come together, promising that the one he engaged to pay Mr. Gibson, will take a hand in the business. We understand this proposal satisfies the Chiefs, and Mr. Gibson, who after pressing them hard three weeks, has finally given up. Other necessary buildings are to be erected in spring, and probably will be completed before the fall. It is indeed surprising that no enterprising merchant from Prince Albert has opened a store here. We understand Mr. Gibson has a well arranged collection of Hudson's Bay goods, and there is no doubt of its success.\n\nPUBLIC NOTICE.\n\nGreat Clearing Sale for Cash.\n\nAt Cost for Fifteen Days.\n\nSHANNON & MCLEOD'S\n\nBOOT AND SHOE STORE.\n\nWe have the largest stock of Boots and Shoes in Prince Albert, consisting of all styles and sizes.\n\nMen's Field Boots and Shoes,\n\noveralls. Oil Tan Larrigan,\n\nGerman Field Socks,\n\nChildren's, Men's and Children's\n\nFelt Boots and Slippers.\n\nLadies' Fine Kid Button Boots\n\nand Slippers.\n\nLady's Fur Lined Skating\n\nBoots.\n\nAlso a full stock of Men's,\n\nWomen's, Misses' and Children's\n\nOvercoats.\n\nIn order to clear out our stock we will commence our clearing sale Monday, 16th January, 1885.\n\nRemember the fact that we have been trading in Prince Albert for over twenty-five years, and that you are not at a disadvantage in purchasing your boots and shoes.\n\nJ. H. ROBERTSON, JR., Returning Officer.\n\nEMMANUEL COLLEGE\n\nPRINCIPAL:\n\nThe Rev. W. R. FLETT, B.A.,\n\n(Cantab.), Late Foundation Scholar of Sydney College, England.\n\nTHE NEXT TERM BEGINS ON\n\nMonday, January 12th.\n\nBesides the ordinary subjects read at a Public School, each pupil is taught the Elements of Scientific Agriculture.\n\nA Laboratory is provided, where the Principles of Elementary Qualitative and Quantitative Chemical Analysis are taught.\n\nSpecial Evening Lectures to Students Reading for the Matriculation Examination of the University of Saskatchewan.\n\nFor further particulars apply to the\n\nREV. THE PRINCIPAL,\n\nEmmanuel College, Prince Albert, Sask.\n\nBuffalo Hall!\n\nCARD OF THANKS.\n\nDuring the whole time we have been in business we never have had a more successful holiday season than the one just past. Our sales have been large and of a substantial character, and we feel sure that we have enrolled many new names as regular customers. Such a state of affairs is gratifying to us, and we feel that our continued efforts to provide the best of everything in our line at the least possible cost have been so generally appreciated.\n\nTo all who have patronized us, not only during the holiday season but throughout the whole of 1884, we tender our thanks and hope that they will continue their patronage. Our stock of Dry Goods, Hats, Furs and Groceries is still fresh, well selected and extremely varied, and in order to clear up before spring trade every department has been overhauled and articles marked at clearing sale prices.\n\nBETTS & Gwynne.\n\nNOTICE.\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nTHE SKATING RACE.\n\nOn January third a race was advertised between the Southwest Carling and Neilson Bank for winning the race in December last year. The scene was set outside the Carling Hotel and Mr. Neilson decided to make his appearance at the starting line. The race started when snowfall began and although conditions were difficult it should have been easier.\n\nThe race went off in good shape and with the aid of a hearty cheer the skaters finished in fairly close order. Mr. Neilson came out second and is one of our best hockey skaters; he had quite a tough time during the race and lost at the last minute.\n\nBIBLE COMPETITION.\n\nThe publishers of the popular American Bible have announced an international competition for the best interpretation of the Bible. The competition is open to anyone who follows the rules established by the Bible Society.\n\nNEW MILLINERY.\n\nFANCY GOODS.\n\nWOOL GOODS.\n\nLADIES' CLOAKS.\n\nThe following distances were made by:\n\nPlace. Name. Distance.\n\nFirst place. Mrs. Cooper. 6 miles.\n\nSecond place. Miss Davis. 5 miles.\n\nThird place. Mr. Wilson. 4 miles.\n\nANNUAL MEETING.\n\nThe Annual Meeting of the Lorna Agricultural Society was held last night at the West End Hotel on Wembley Avenue. The President, Mr. W. G. Cameron, occupied the chair and called the meeting to order.\n\nMISS MACK & CO.\n\nPUBLIC NOTICE.\n\nMISS MACK & CO.,\n\nWe are now prepared to contract for orders of any size, and we are willing to give builders who order large quantities a reduction in price.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES.\n\nAND\n\nAvis Public.\n\nMISS MACK & CO.\n\nPUBLIC NOTICE.\n\nMISS MACK & CO.,\n\nWe are now prepared to contract for orders of any size, and we are willing to give builders who order large quantities a reduction in price.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES.\n\nAND\n\nAvis Public.\n\nMISS MACK & CO.\n\nPUBLIC NOTICE.\n\nMISS MACK & CO.,\n\nWe are now prepared to contract for orders of any size, and we are willing to give builders who order large quantities a reduction in price.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES.\n\nAND\n\nAvis Public.\n\nMISS MACK & CO.\n\nPUBLIC NOTICE.\n\nMISS MACK & CO.,\n\nWe are now prepared to contract for orders of any size, and we are willing to give builders who order large quantities a reduction in price.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES.\n\nAND\n\nAvis Public.\n\nMISS MACK & CO.\n\nPUBLIC NOTICE.\n\nMISS MACK & CO.,\n\nWe are now prepared to contract for orders of any size, and we are willing to give builders who order large quantities a reduction in price.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL.\n\nWish to inform the Public that they have on hand for sale a Half Million feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nLath, 75 cts. per bundle. Shingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBUILDERS paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHE PRINCE ALBERT TIMES.\n\nAND", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885012301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3862, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4646, 2], [4646, 11572, 3], [11572, 16003, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]