[{"id": "60c1926d7157f307f508e570c549a276fa37edd2", "text": "**THE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW**\n\n**PRINCE ALBERT, N. W. T., WEDNESDAY, SEPTEMBER 5, 1863.**\n\n**PONY FOR SALE.**\n*A Notice Pony for sale (more in fault). Will be sold cheap.*\n\n**GRAND CHANGE.**\n*The PRINCE ALBERT Planing Mills and Sash & Door Factory FOR SALE.*\n\n**BANKING HOUSE**\n*of Macarthur & Knowles, Prince Albert, N.W.T.*\n\n**BANKERS.**\n*BANKS FOR BUSINESS.*\n\n**JOHN B. DUNLOP, M.D.**\n*Lic of the Royal College of Surgeons.*\n*Lic and Lic of Medicine of the King's and Queen's College of Physicians, Ireland.*\n\n**MECHANICS.**\n*MECHANICAL WORK.*\n\n**CONFIDENTIALS**\n*Confidential Notices.*\n\n**GOODFELLOW BROS.**\n*PRINCEALBERT BAKERY.*\n\n**WHITLOCK & MIVOR.**\n*Notice.*\n\n**H. J. MONTGOMERY**\n*BRICK, CORDWOOD, ETC.*\n\n**NOTICE.**\n*DENTIST.*\n\n**PRINCE ALBERT, N.W.T.**\n*BOOTS AND SHOES CHEAP.*\n\n**FOR SALE**\n*TO LET.*\n\n**JOHN FLETT.**\n*Commodious Store.*\n\n**Lorraine Patrick D.L.S.**\n*Trenderer Limit Surveyed.*\n\n**SHANNON & McLEOD.**\n*Custom Work Repairing.*\n\n**UNITED STATES Life Insurance Co'y.**\n*ESTABLISHED IN THE CITY OF NEW YORK.*\n\n**O. E. HUGHES & CO.**\n*General Merchants AND Indian Traders.*\n\n**PERSONAL**\n*Mr. Alex. Lang left for the east last Thursday.*\n\n**PRINCE ALBERT, N.W.T.**\n*CHIT-CHAT LOCALS.*\n\n**MAGISTRATES COURT.**\n*Mrs. F. Campbell, B.P.O.U. on the Bench. It appears from the statement charging her with being responsible for the death of one of the cattle by the accidental shooting near Prince Albert.*\n\n**THE PRINCE ALBERT TIMES AND SASKATCHEWAN REVIEW**\nTHE PRINCE ALBERT TIMES\n\nNORTH WEST APPOINTMENTS.\n\nThe Dominion Government, the master of appointments to offices in the North West Territories, appears to be acting under the idea that anything and anybody is good enough for the purpose of its main policy, which they seem to have adopted, is pursued much further however, they may be roused from their delusion in a manner which will make them see the truth. The inhabitants of these Territories have shown themselves to be a patient and long suffering people. They have borne all manner of grievances under which a less noble people would have revolted. They have suffered the inconvenience and the loss occasioned by the non-granting of the land patents, to which they were entitled years ago. They have patiently endured year after year the failure of the promise that an official from the Department of the Interior or the Land Office would be sent up here to settle many questions of title which are in abeyance and which it is thought will come up this year because Mr. Lindsey Ramsay self has broken his leg and cannot travel, if there was only one man in the Department whose capable deal ing with these questions, and as he died in the whole lands question of the North West must be kept back until he recovers. They have seen the best lands in the country reserved for the Government, or granted to railway, colonization and land companies at the incoming settler driven away because there was \"no test for the sole of his foot.\" They have waited for the wood lands, except those in Athabasca, and off for the rest of the settlers as promised, and now they are told that all these lands are also \"reserved,\" and as if to add insult to injury two officials are sent up from Ontario, key to the west of the very land the poor settlers have no use for domestic purposes. They have submitted to all these, and many more indignities with scarcely a murmur, and not doubt the Government will be encouraged by its patience and apparent meekness with which after having been smitten on one cheek they have offered the other. But let them beware, there is always a calm before the storm, and when the straw that breaks the camel's back If that point has not yet been completely reached every seems to be hastening it on. But to return to the subject of appointments made to the North West. One wonders to think that with the immense patronage which the Government enjoys, that they could afford to bestow the few offices in their gift pertaining to the newcomers to residents, who are not natives of the province of found in the country. Surely if the country at once struck there cannot in common justice be denied that the men who live in the country, who have grown up with it, or who have grown up in their lot with it, and have made their homes in it, and grown old and died with it, and are not the best entitled to positions here upon the country, whatever patronage the Government may be able to give in the way of public offices, but not so entitled as the original settlers, the most competent to fill such offices. So long as employers and employees are satisfied it will be better to leave well alone, but when the policy is pursued to a few grasping scoundrels of the land, and the result is sure success in gaining the offices of responsible office, the duties of time in real value, and then close, which are enormous and off times of about thirty-five percent profit upon a delicate nature. This above all his losses millions it is quite time to others should be held by a competent and trustworthy man, and hence an officer of trust should be held by a man of integrity, who do we find appointed to it? A man whom only recommendation seems to have been that he is the brother of a Cabinet Minister, who is the President of Quebec Railway, who has only recently been discharged from the Department of Public Works at Ottawa for taking a bribe of $4,000 from railway contractors to furnish them with contracts. It is a fact to be admitted himself in his evidence before the Railway Commission which investigated the matter. Very, as the Winnipeg Free Press puts it, \"A new minister of the Sheriff, but he is worse than his predecessor, who ran a bar-room in Winnipeg, pocketed his salary religiously and never troubled his head about his shirvaincy in the North West. We believe that he was well known because they were here sacrificed for the benefit of the Eastern manufacturers, no attention was paid to them. The Government feelingly expressed the desire that the scattered districts treated us with indifference. Lately, however, a change has come over the spirit of their dreams, and they begin to find their chickens coming home to roost. At present the settlers are using their persuasive powers to prove that the Government will in no way be responsible if a period of stagnation should have to be met by our business men, and the motley standing army of that few years ago were showing that if some of their wonderful scheme of making people rich by legislation were adopted the balance of trade would \"never move\" be against them that would be lost and that commerce would be clogged by an over importation into this fair Canada of ours, that under the benign influence of the N.P.W. our workmen would have steady work and increased wages, that there would be no mortgagees, bankrupts, banks, farmers would get higher prices for their grain, our people money would not be sent out of the country to purchase foreign goods, and the country would be with greater regularity crops would fail not and the yeomanry would never again be required to lift up his voice in lamentation over the ravages of the potato bug, the blight that is not, nor ever would come visitation that would be forced to follow in the wake of and to be an evidence of the divine displeasure with the rule of the free trade system. We fancy however, that the Government would take a keen a power on the expression that they would prevent the recurrence of such disasters will have to shoulder the responsibility, and unless in the future the Government of the North West is of a more liberal character than that of the past, we sincerely hope that they will be compelled to do so.\n\nTHE STRIKE.\n\nThe telegraph operators still continue on strike, but looks very much as if they would have to go to the wall. The monopolists have been very successful in getting operators to their aid, and as there are a sufficient number of these to continue the business the force of the strike was very much weakened. Had the telegraphers union been able to maintain its strength, the effect of the strike upon the districts of Ireland to the Canadian North West, where they will be obliged to send their telegrams to be sent through the country and the very moment they set foot in the provinces they will be obliged to pay for themselves. They will be put on farms upon which buildings have already been erected, and will be furnished with tools, implements, cattle, seed, etc., to make a start, etc. They will be required of course, to make a small return for the services rendered, and the compensation will be so small that it will not press unduly upon the beginners. If properly managed, the telegraphers union will in then the qualities necessary to make successful settlers, the proposed scheme will be a great benefit to the country, and to the country at large.\n\nIRISH IMMIGRATION.\n\nThe scheme proposed by David Lloyd George and adopted by the Conservative government for the encouragement of a large emigration from Ireland appears to have met with favor in some quarters. It is stated that the scheme is based on the conviction that the surplus population from the overcrowded districts of Ireland to the Canadian North West, where they will be obliged to send their telegrams to be sent through the country and the very moment they set foot in the provinces they will be obliged to pay for themselves. They will be put on farms upon which buildings have already been erected, and will be furnished with tools, implements, cattle, seed, etc., to make a start, etc. They will be required of course, to make a small return for the services rendered, and the compensation will be so small that it will not press unduly upon the beginners. If properly managed, the telegraphers union will in then the qualities necessary to make successful settlers, the proposed scheme will be a great benefit to the country, and to the country at large.\n\nPRINCE ALBERT TIMES\n\nWednesday, September 5, 1883.\n\nNORTH WEST APPOINTMENTS.\n\nThe Dominion Government, the master of appointments to offices in the North West Territories, appears to be acting under the idea that anything and anybody is good enough for the purpose of its main policy, which they seem to have adopted, is pursued much further however, they may be roused from their delusion in a manner which will make them see the truth. The inhabitants of these Territories have shown themselves to be a patient and long suffering people. They have borne all manner of grievances under which a less noble people would have revolted. They have suffered the inconvenience and the loss occasioned by the non-granting of the land patents, to which they were entitled years ago. They have patiently endured year after year the failure of the promise that an official from the Department of the Interior or the Land Office would be sent up here to settle many questions of title which are in abeyance and which it is thought will come up this year because Mr. Lindsey Ramsay self has broken his leg and cannot travel, if there was only one man in the Department whose capable dealing with these questions, and as he died in the whole lands question of the North West must be kept back until he recovers. They have seen the best lands in the country reserved for the Government, or granted to railway, colonization and land companies at the incoming settler driven away because there was \"no test for the sole of his foot.\" They have waited for the wood lands, except those in Athabasca, and off for the rest of the settlers as promised, and now they are told that all these lands are also \"reserved,\" and as if to add insult to injury two officials are sent up from Ontario, key to the west of the very land the poor settlers have no use for domestic purposes. They have submitted to all these, and many more indignities with scarcely a murmur, and not doubt the Government will be encouraged by its patience and apparent meekness with which after having been smitten on one cheek they have offered the other. But let them beware, there is always a calm before the storm, and when the straw that breaks the camel's back If that point has not yet been completely reached every seems to be hastening it on. But to return to the subject of appointments made to the North West. One wonders to think that with the immense patronage which the Government enjoys, that they could afford to bestow the few offices in their gift pertaining to the newcomers to residents, who are not natives of the province of found in the country. Surely if the country at once struck there cannot in common justice be denied that the men who live in the country, who have grown up with it, or who have grown up in their lot with it, and have made their homes in it, and grown old and died with it, and are not the best entitled to positions here upon the country, whatever patronage the Government may be able to give in the way of public offices, but not so entitled as the original settlers, the most competent to fill such offices. So long as employers and employees are satisfied it will be better to leave well alone, but when the policy is pursued to a few grasping scoundrels of the land, and the result is sure success in gaining the offices of responsible office, the duties of time in real value, and then close, which are enormous and off times of about thirty-five percent profit upon a delicate nature. This above all his losses millions it is quite time to others should be held by a competent and trustworthy man, and hence an officer of trust should be held by a man of integrity, who do we find appointed to it? A man whom only recommendation seems to have been that he is the brother of a Cabinet Minister, who is the President of Quebec Railway, who has only recently been discharged from the Department of Public Works at Ottawa for taking a bribe of $4,000 from railway contractors to furnish them with contracts. It is a fact to be admitted himself in his evidence before the Railway Commission which investigated the matter. Very, as the Winnipeg Free Press puts it, \"A new minister of the Sheriff, but he is worse than his predecessor, who ran a bar-room in Winnipeg, pocketed his salary religiously and never troubled his head about his shirvaincy in the North West. We believe that he was well known because they were here sacrificed for the benefit of the Eastern manufacturers, no attention was paid to them. The Government feelingly expressed the desire that the scattered districts treated us with indifference. Lately, however, a change has come over the spirit of their dreams, and they begin to find their chickens coming home to roost. At present the settlers are using their persuasive powers to prove that the Government will in no way be responsible if a period of stagnation should have to be met by our business men, and the motley standing army of that few years ago were showing that if some of their wonderful scheme of making people rich by legislation were adopted the balance of trade would \"never move\" be against them that would be lost and that commerce would be clogged by an over importation into this fair Canada of ours, that under the benign influence of the N.P.W. our workmen would have steady work and increased wages, that there would be no mortgagees, bankrupts, banks, farmers would get higher prices for their grain, our people money would not be sent out of the country to purchase foreign goods, and unless in the future the Government of the North West is of a more liberal character than that of the past, we sincerely hope that they will be compelled to do so.\n\nTHE STRIKE.\n\nThe telegraph operators still continue on strike, but looks very much as if they would have to go to the wall. The monopolists have been very successful in getting operators to their aid, and as there are a sufficient number of these to continue the business the force of the strike was very much weakened. Had the telegraphers union been able to maintain its strength, the effect of the strike upon the districts of Ireland to the Canadian North West, where they will be obliged to send their telegrams to be sent through the country and the very moment they set foot in the provinces they will be obliged to pay for themselves. They will be put on farms upon which buildings have already been erected, and will be furnished with tools, implements, cattle, seed, etc., to make a start, etc. They will be required of course, to make a small return for the services rendered, and the compensation will be so small that it will not press unduly upon the beginners. If properly managed, the telegraphers union will in then the qualities necessary to make successful settlers, the proposed scheme will be a great benefit to the country, and to the country at large.\n\nIRISH IMMIGRATION.\n\nThe scheme proposed by David Lloyd George and adopted by the Conservative government for the encouragement of a large emigration from Ireland appears to have met with favor in some quarters. It is stated that the scheme is based on the conviction that the surplus population from the overcrowded districts of Ireland to the Canadian North West, where they will be obliged to send their telegrams to be sent through the country and the very moment they set foot in the provinces they will be obliged to pay for themselves. They will be put on farms upon which buildings have already been erected, and will be furnished with tools, implements, cattle, seed, etc., to make a start, etc. They will be required of course, to make a small return for the services rendered, and the compensation will be so small that it will not press unduly upon the beginners. If properly managed, the telegraphers union will in then the qualities necessary to make successful settlers, the proposed scheme will be a great benefit to the country, and to the country at large.\nFIRE PROTECTION.\n\nThe adjourned meeting of the Prince Albert Fire Protection Company was held at Mr. T. E. Jackson's residence on Thursday evening last. A number of new members were added to the Company.\n\nThe election of officers was then proceeded with, Mr. H. B. Garven was chosen as captain, Mr. D. Dawson as first lieutenant, and Mr. G. Munro as second lieutenant. Mr. J. R. McPhail as secretary-treasurer.\n\nA committee was then appointed to complete by law the place a copy in the hands of each member.\n\nAppliances will be procured gradually as the Company grows in numbers and the necessity arises.\n\nThe meeting was adjourned.\n\nThe utmost good feeling and unanimity prevailed during the meeting, which augurs well for the successful working of the Company.\n\nMATRIMONIAL ADVICE.\n\nThe young woman and her lover were coming on the midnight train and she was going with him to the next station to be married. Whenever the old lady said she had heard of experience in the marrying business, and would give the young lady some advice, and here it was what she said: \"Never marry a man who carries a raincoat, for he is likely to get killed at any time. Besides, he has such a nice character and dirt. Never marry a man who is likely to go to town and get sick. Besides, his gorgeous clothes attract the attention of the women. Never marry a hotel keeper. My first husband was a hotel keeper, and fell through the elevator opening and broke his leg. He died of consumption. I think of that man. Never marry a travelling man, for he is always away from home. Nobody knows what may happen up above. Never marry a man who is likely to carry a steamboat. My second husband was a steamboat captain, and got drowned. Never marry a drunkard. I am terribly mad when I think of that man. Never marry a dry goods man. They often have to work nights and lose half their sleep. Never marry a grocer. My third husband was a grocer, and he was always away from home. Never marry a man who is likely to die. When I think of him I'm completely disgusted. Never marry a surgeon. My fourth husband was a surgeon, and he fell off a ladder and smashed his head. Never marry a chemist. My fifth husband was a chemist. I'll never forget the day he was brought home on a board. I didn't recognize him. He looked like a corpse. I hit him plain in the face, and spread his nose all over his countenance. I promised not to take my eyes off him until there wasn't a trace of him left. I think there the train rolled in, and the old lady asked, \"Child, what business is your nose in? You ought to be ashamed of yourself! You don't mean to marry him. My sixth husband was an insurance agent. But the youngster had gone to meet her.\n\nMr. Trivison, French ambassador at Pekin, has been recalled on account of ill-health.\n\nThe American students of early American history opened their fifth congress at Copenhagen. The Princess of Wales and members of the royal family attended the opening ceremony.\n\nThe gauge of the Toronto and Nipissing railway along Somerville Junction has been changed to the broad gauge. The switch will be removed only after completion of the road that retains the narrow gauge.\n\nColonel Stephenie the inability of France to continue its alliance. It says—America is England's rival. America has already approached Russia. Why should it be bound by the hypocrisies between America and France?\n\nIt is proposed to divert the course of the river Thames so that the mill will be located in the village of London West. Another suggestion is to erect an embankment. Either plan, it is thought, would prevent any future damage.\n\nThere was a hot discussion among the members of the council regarding the question of the British missionary, Mr. Smith, the British missionary, by the French in Madagascar. Mr. Smith's residence depends upon the teaching of the French, as well as the sympathy existing between France and England. This was received with cheers.\n\nMEDICAL HALL.\n\nT. E. JACKSON,\n\nChemist & Surgeon.\n\nHas on hand a large supply of\n\nDrugs, Chemicals, Dye Stuffs, Spices, Druggist's Sundries, Perfumery, Toilet Articles, Sponges, Patent Medicines.\n\nJewelry supplied on reasonable terms.\n\nSpecial discounts on large orders.\n\nPhysicians' prescriptions and family remedies carefully prepared.\n\nTERMS CASH.\n\nASH & ROBBINS,\n\nCONSUMPTION\n\nPositively Cured.\n\nAll sufferers from this disease that are suffering from the effects of very celebrated consumption remedies are invited to try our preparation known that is very effective. We have a large stock of cough syrup and lozenges, and, as we are sure they will be found to be superior to any other remedy now on the market, we are confident that they will be found to be superior to any other remedy now on the market.\n\nASH & ROBBINS,\n\n360 Fulton St., Brooklyn, N.Y.\n\nKNOX & BARKER,\n\nCarpenters and Builders,\n\nJob Work Promptly Attended To.\n\nPlans and Estimates Furnished when Desired.\n\nResidence—BELL'S RESTAURANT.\n\nJAMES SINCLAIR,\n\nMerchant Tailor,\n\nHas just received his new stock of Spring & Summer Goods.\n\nAnd is prepared to supply his numerous customers with\n\nSuits to please the fancy of all.\n\nJust received a large stock of UNDERCLOTHING.\n\nA fresh supply of styles.\n\nSoft and Hard Felt Hats.\n\nGive me a call.\n\nJ. SINCLAIR,\n\nPRINCE ALBERT,\n\nPlaning Mills and Saw and Door Factory.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended To.\n\nPlans and estimates furnished when required.\n\nPlumbing and Matching done to order, next to H. B. C. Grid Mill.\n\nREMOVED!\n\nJ. M. Campbell\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., Etc., PRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPROPRIETORS,\n\nRIVER STREET,\n\nPRINCE ALBERT.\nTHE BAD BOY.\n\nHe gets in Speculating on Scriptural Subjects and Evoking Some Strange Feelings.\n\n\"What are you sitting there half an hour for, staring at vacancy?\" said the grocery man to the bad boy, who had been there about half an hour, every morning, when everybody took to squirming, with his fingers clasped around his head, as though he did not know enough to let him be bad.\n\n\"What you thinking about any way?\"\n\n\"I was wondering where you would have been last night. Now, if you had got into such a fog as this, and there had been no fog horn on Mount Assiniboine, and the boat had not made a landing, and had floated around on the flecked until all the men came back from their fishing, and sang and heard a hole in her bottom. I tell you, we can all congratulate ourselves that Noah happened to be there just then, and that if that boat had been lost, either by being foundered, or being blown up by a torpedo, or being eaten by an Englishman, it would have been a good work trying to populate this world. In that case another Adam and Eve would have been created, and they might have gone wrong again, and failed to raise a family, and where would we have been? But now, if you think of the narrow escapes we have had, it is a wonder to me that we have got through so well.\"\n\n\"Well, what will you get out of the asylum?\" said the grocery man, who had been standing back with open mouth looking at the boy, who had been in the grocery. \"What you want is to have your head soaked. You are getting so you run out too far that some of your ideas are getting wild, and you will want to run this world yourself. I don't think you are reforming very much, but you do go for the right size to argue about such things. Your folks better send you to college.\"\n\n\"What do I want to go to college for, anyway?\" said the bad boy, a poor base ball player. I can be bad enough at home. That must be read the most of it, I believe, before I can be bad enough to go to heaven anyway, and I guess I will go into the new line, where I am sure to be thought to be good, and where they have pasture everywhere. Do you know, I think, when I was half grown, I thought of going into something in my head. I can't think like some boys. I get to thinking about Adam and Eve, and Eve's red hair, and the apple with the clever look that flirted with Eve, and treated her and Adam to the dry apples, and the evil eye as it looked at Eve, and with a fig leaf palaver, and dig leaf veins. I imagined them dressed in a tree, and Eve's bare feet, and the devil that is what a poor boy has to suffer who has an imagination, and where did get the idea from? This morning the motion of mine shows me Adam with a plug hat on, just like our minister wears, and a stand-up collar, and Eve's hair all in a ring, and Eve is pictured to me with a crushed angle worm costume, and brown striped stocking, and more wiggles than I could make it set out, and a hat with diamonds on, and a red parasol, and she has her hair in a ring, and Eve winks with her left eye to the minister who is standing by the corner of the house, and Eve has the devil's mark on the dart on the end to wound around the main water barrel, as Eve won't eat it and get sick, and I am saying, what is it for a boy to think of our first parents with clothes on, than to think of them almost naked exposed to the elements of the woods, and Eve's hair being there pinned out! I want to do right as fast as I can, but I had rather be a bad boy, and do right, than to think of them in a cage house with leaves for their sleeping apparatus, and Eve's hair right, but I don't think if Adam had put on a pair of big gloves, where he found the devil was, and Eve had put on a pair of mittens, and snatched him off in couple of seconds, and posted him in the nose, and fired him out of Adam's garden, that it would have been a bad thing, that it would have been a bad thing, that it would have been a bad thing, that it would have been a bad thing, that it would have been a bad thing.\n\n\"Look here,\" said the grocery man, \"you haven't been looking at this boy inside any. 'Tis better you right inside, and let your ma fix up some warm drinks for you and send them to here. You are very late in the house, and you have not attended to will have brain fever. I tell you, boy, you are in danger. Come, I will go home with you.\"\n\n\"Oh, dangercruthin.\" I am just telling how things look to a boy who has not got the facilities for being a good in the eyes of the world, and yet he does it as they read them, and not think any for themselves, but I am a thinker from the bottom of my soul, and I hate the dickens with me. There is nothing I read about old times but what I can picture it in the same manner as it was sung, and I am sure that when I think of the fishermen of tallies, drawing their seines, I wonder what they must have felt as they went out, and as they landed seines; as there is in Wisconsin today, and I see one a fisherman with a pole, and he goes out in the middle of the river, smashing the old apostles and taking them to the police station in a gander boat. He says he is doing just like that, but how can I help it. Say, suppose those fishermen had been out hasting their seines, and they had come back with his good clothes on, his painted red, his neckbeaded red, and his silk fish line, and his big buck skin coat, and his fish net, and his hook, and east his line near the Gulliver fisherman and go to trolling for fish? What do you suppose those fishermen would have thought about the gander of the painted red fisherman? Do you suppose they would have said, \"That fellow was trolling, or would they have told him there was good trolling in a point, and he could have taken the place there? Don't know if he wouldn't get a bite in a week, the way a fellow at Muskeg Lake had our minister.\"\n\nAnd the boy puts his other knee in the air, and crosses his arms behind his fingers and both hands, and waits for the grocery man to argue with him.\n\n\"I wish you would go away from here, I say, and go to the minister and the grocery man. I would give anything if your pa or the minister would come in and show you how to think, and stop wandering,\" and the grocery man went to the door and looked up and down street, everybody evidently didn't come and watch the breakfast boy, and he went to breakfast.\n\n\"Oh, pa and the minister, you take a few minutes and come here. Pa gets mad when I ask questions, and the minister thinks I am past redemption. I said yesterday day that I thought the minister and the boys ought to be sent to the school, and I thought if he had met our Sunday school superintendent coming down the street, he would have given him his hand on my head, and said my pa, was all wrong. Now, I will leave it to the minister and the boys to decide that. Say do you know what I think is the most beautiful thing in the Bible?\"\n\n\"No, I don't,\" said the grocery man, \"except when you go to sleep for fifteen just five minutes, and then I am going to shut up the store and go to breakfast. You make me tired.\"\n\nWell, I think the finest thing is that story about the prodigal son, where the boy took all the money he could scrape together, and went to the country, and got rich. He spent all money in riotous living, and saw everything that was going to be seen in his life, and he struck all the range of himself, both male and female, and his stomach went back on him, and he came back begging, and he had to eat bread that the dogs didn't want, and got pretty low down, and then the father came and said, \"Come, come, to be getting around house, where he had three meals a day, and spring meat every day, and told him to go on the train, and he didn't know whether the old man would receive him or not, but he opened the gate, but the old man came down to the depot, and said, \"Come, come, come in,\" and then the boy went in, and sat down, and his ragged, and broken, though he had been on the rail, and the old man fell on his knees, and said, \"Come, come, come in a back and had a real pot pie for dinner. That's what I call come. A minister really ought to be able to send the police on the tramp and had him ordered out of town. What, you going to go to college? I tell you, boy, you are late. You later, I want to talk with you about something that is weighing on my mind,\" and the boy got out just in time to save his coat tail from being caught in the door, and when the grocery man came back from breakfast he said nothing further notice.—SIRUPY.\n\nPUMPS!\n\nFirst Post from Winnipeg:\n\nPlaster Paris,\nBuilding Paper,\nPlasterers' Trowels,\nMasons' Trowels,\nGuns,\nCanister Powder,\nMining Machines,\nAND A FULL LINE OF Hardware.\n\nPrices the lowest in town.\n\nTen per cent, off for Cash\n\nAT\n\nT. J. AGNEW'S\nWholesale and Retail\n\nReal Estate\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nC. MAIR,\nPrince Albert, N.W.T.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\n\n(A T. N. Campbell's New Store)\n\nA LARGE STOCK OF\n\nWatches,\nClocks and\nJewellery\n\nKEPT CONSTANTLY ON HAND;\n\nRepairing Promptly Attended to\n\nWatches,\nClocks,\nJewellery,\nStationery.\n\nJoseph Rogers & Sons, Watchmakers, Best Quality Watches and Clocks, etc., etc.\n\nNEW PATENT BRIDGES.\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nJOHN WYNERSKIRCH, PROP. PRINCE ALBERT N.W.T.\n\nESTABLISHED - 1860.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE,\n\nTORONTO, - - ONT.\n\nPianos to Suit the Climate of the North West.\n\nALL MADE OF THE BEST MATERIAL AND FINISHED IN FIRST-CLASS STYLE.\n\nFIRST PRIZE WHEREVER EXHIBITED.\n\nR. B. WAY,\nPost Office, Prince Albert, N.W.T.\n\nTHE GABLE HOUSE,\n\nTHE BEST BEER AND CIGARS\n\nOf the Finest Brands always on hand.\n\nWHOLESALE AND RETAIL.\n\nJOHN WYNERSKIRCH, PROP. PRINCE ALBERT N.W.T.\nITEMS OF INTEREST.\n\nRev. Wm. Baker, of Boston, well-known author, is dead.\n\nThe wheat harvest in Manitoba is 25 per cent larger than last year.\n\nChina negotiating with Germany for the purchase of 100,000 tons.\n\nGreat interest manifested at Sigle in the success of the Hazen field victory.\n\nAn outbreak of plague pneumonia is reported among cattle at Salem, Conn. Railroad officials have had flight attendants notify officials when animals die.\n\nEx-Secretary of the U.S. Treasury Winwood was entertained in London.\n\nThe North Star steamer was captured off of Colchester, Va., as it was to Montreal.\n\nThe United States government purchased surplus of $8,000,000 for the past five years.\n\nA large shipment of Clydebairds has been received at Montreal for western dealers.\n\nPictures from Canada to the Sierras of the Lady of Lourdes have been presented to the Pope.\n\nThe wheat crop in the county of Kent is almost a failure. Eight bushels from acre is the average yield.\n\nMr. Donald A. Smith has presented $100,000 to McGill University to endow a medical professorship.\n\nNew Brunswick has been substituted for Nepigon stone in erection of public works at Ottawa.\n\nThe losses of the Wall street brokers, South & Knight recently caused a renewal of the depression.\n\nKing Milan of Serbia, is in Vienna and has arranged visits with the Emperor of Austria.\n\nHis Excellency the Governor General and Princess Louise will visit Kingston on May 16th of this year.\n\nThe new crop of barley has made its appearance on the Belleville market. The market is good.\n\nGeorge Stephen, former president of the Canadian Pacific railway, has donated $8,000.00 toward the Montreal general hospital.\n\nThe sale of two million acres of land in Minnesota was completed. The average price commanded is $3.50 an acre.\n\nBusiness was suspended at Conlithbay, Newfoundland, owing to the existing feud between Orangemen and Catholics.\n\nBy an explosion in a cellular near Caribou, Washi., one person killed and two severely injured.\n\nThe Florida ship canal scheme is to be pushed with vigor. It will cost $45,000,000 and will be $37,200,000 saved.\n\nThe region most distant in Alberta, N.W.T., comprises 30,000 square miles and another 65,000 square miles.\n\nCapt. Davy of the Alaska Forestry Service has recommended that for the purpose of saving trees, no settlers live within 250 feet of the line.\n\nThe Merchants Bank seeks to recover $15,000 invested by Bradley Jackson, the bank vice-president for nearly three months.\n\nST. PETERBURGH authorities say the Russian law was exploded in connection with the rule forbidding Jews to live in the city.\n\nA recent storm in Winnipeg which caused extensive commodity damage, several public buildings among others, the penthouse.\n\nHundeen's Bay Company has been incorporated at the meeting of shareholders at London, Ont., for the purpose of purchasing 92,000 acres of land.\n\nThe rules of the railroad transportation commission are being enforced more strictly than ever before.\n\nAn unknown number of 200 tons bar coal carrying a black flag is reported to have struck Morin Harbour, N.B. There are great possibilities of profit.\n\nThe third annual meeting of the Federation of organized trades and labour unions of the United States was held in New York on the 25th Aug.\n\nFrank James again visited Ocoee, working with local cutters and farmers. United States railroads have adopted a standard time table.\n\nThe fifth edition of the catalogue of the Dominion Capital Savings Bank went into effect beginning June 1st.\n\nJohn Woods, formerly a Baptist minister in the township of Chathamville, committed suicide in Norfolk county Jail, who also was confined for forgery.\n\nLapey has been discovered among the Chinese in Nevada.\n\nFishing on the coast of Labrador is reported very poor. Fishing at Port Nova at present very good.\n\nSTOBART, EDEN & CO.\n\nhave the following hundreds of their wares at very low prices.\n\nO. E. HUGHES & CO.\n\nWho will continue the same from the date\n\nSTOBART, EDEN & CO. July 1, 1883.\n\nI will sell below cost a large assortment of Fancy Goods, Picture Frames, Brackets, etc.\n\nBoots and Shoes, Ready Made Clothing, Patent Medicines, all kinds of Groceries and Dry Goods.\n\nFrom 2 lbs to a ton of sugar at 3 cents a pound.\n\nFresh Eggs, and Butter, Vegetables, Etc.\n\nAlways on hand.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Terrible Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nDetails regarding these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nJ. R. LENNON\n\nJ. R. LENNON\n\nTHE ROYAL ROUTE\n\nChicago, St. Paul, Minneapolis - St. Paul, Omaha, and Chicago Southern Railways.\n\nRoyal Route Passengers have the choice of the Western Railroad Train, Platte Valley Line, or the Great Northern Express Sleeper and elegant Day and Night Travelling Cars, or the Royal Route Sleeping Car, with exchange of cars for the Empire Express, Chicago, Minneapolis, St. Paul and Chicago; also exchange between St. Paul and Council Bluffs, with exchange on the Great Northern Express.\n\nIf fitted with the best travelling Accommodations and Arrangements for comfort.\n\nROYAL ROUTE.\n\nJ. R. LENNON.\n\nINFORMATION.\n\nS. M. RAYMOND\n\nManager Express Office, Detroit.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\n\nINFANT'S MILK POWDER AND COMIC ILLUSTRATIONS.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\n\nMISS MACK & CO.\n\nCambeeld Block, Duke Street.\nTHE NORTH WEST COUNCIL.\n\nSpeech delivered by the Lieutenant-Governor.\n\nEdmonton, Aug. 22.—The North West Council opened today at two o'clock in the new Council Chamber. The members of the Council were sworn in as a guard of honour under Col. Dickens, who was in attendance on the Lieutenant-Governor. A large number of Indians were in attendance. Considerable interest was manifested in the proceedings from the Hon. Mr. B. H. Ross, who wore the Windsor uniform, delivered the following:\n\nSpeech from the Hon. Mr. B. H. Ross.\n\nIn answering for this the fifth session of the Council of the North West Territories, I take this opportunity of congratulating you on the prosperity and growth of the vast territories whose affairs you are called upon to assist me in administering. We have met here in the North West Council at Swan River, the temporary seat of Government in 1873, when the first set of Government buildings at Battleford—these were completed in the fall of 1875, and the second set of buildings were finished at that point. The North West Council sat at that place in 1878, 1879, and 1880. The North West connected with the Railway, and the consequent large settlement of the country, both north and south of the line between the Dominion and the provinces, has been a great encouragement, and a new central point for the administration of the public business of the Territories. The North West Region was considered the most favourable point, and I think every day makes it clearer that this was the wisest course. It is in the heart of one of the most fertile regions of the Territories and easily accessible to all parts. The class of farmers settled on the land adjacent to Regina, upon which no less than 15,000 acres have been granted for homesteads, shows that the advantage claimed for it in an agricultural point of view is not without foundation. Letters that continually reach me of the returns expected from land only partially worked indicate that the future will be bright when the country is brought into a good state of cultivation. Up to 1881 only one report was received or heard of at the Council meetings, and if anything was wanted to demonstrate the progress we have made, there is nothing that after a couple of years, the composition of the present Council will do so, for while the members of the Council have sat at the Council, we have new settlers coming from Regina, Edmonton, Brandon, and other places. The town of Prince Albert has been established along the line of the Canadian Pacific Railway, which naturally attracts many people to settle there, but I am glad to say we have two members from the town and farming district of Prince Albert and Edmonton, who add probability of an increase before very long. I am also in receipt of applications from the town of Edmonton, and if I could have delayed the meeting of the Council for a few months, I might have been able to add to our present number. My appointment to the position of Lieutenant-Governor is a matter of fact, and there was an uncertainty as to the powers conferred on the North West Council until the date of my appointment, and to the expense of summoning the Council until we were placed in a position which required action. I believe it would have been felt that a few months delay would give me the assistance of representative men from different parts of the Territories, which could not fail to be advantageous to the country as well as gratifying to myself. I think we have demonstrated that a Council is a very useful institution.\n\nI have but lately received a copy of the order-in-council empowering the Lieut.-Governor to call a special session of the Legislative Assembly to make ordinances for the several subjects upon which it is now most important for us to legislate. This will be laid on the table for your information.\n\nIt is proposed to amend the following ordinances:\n\nNo. 6, of 1880, respecting the administration of Civil Justice;\n\nNo. 12, of 1878, respecting the making of contracts;\n\nNo. 6, of 1879, respecting licenses;\n\nNo. 8, of 1879, ordinances exempting certain property from seizure and sale under orders;\n\nNo. 6, of 1881, an ordinance respecting trespassing and stray animals.\n\nNo. 11, 1881, an ordinance for the protection of sheep.\n\nA number of new ordinances will be presented to you for your consideration.\n\nOne in regard to municipal institutions; one respecting the election and appointment of officers; one regarding police; one appointing commissioners for taking affidavits; one ordinance respecting partnerships; one or two others; one regarding the sale of liquor; an ordinance respecting protection of game, and others that I have not thought desirable to legislate upon.\n\nI am quite sure you will all agree that the present will soon arrive when we shall have our population over General Sir Garnet Wolseley, and his august successor Lord Lorne, and I will ask you to join me in an address to their Excellencies respecting our feeling towards them at this juncture.\n\nI will ask your earnest consideration of the important duties which devolve upon you, and pray you to give your attention to the matters which may prove conducive to the advancement of these new and important territories and to the welfare of the inhabitants thereof.\n\nThe Council then adjourned till the next day.\n\nAt the Fall River regatta on Aug. 21st, Hamilton was through the swampy region.\n\nA terrible cyclone visited Minnesota on the 28th August. A large number of lives were killed, and damage done to houses and buildings all along the track of the storm. The loss money is estimated between $100,000 and $200,000.\n\nJ. L. JOHNSON & CO.\n\nHAVE A FULL STOCK\n\nPowder,\n\nShot,\n\nGuns,\n\nHarvest Tools,\n\nBuilding Hardware,\n\nPlaster and Plastering Hair.\n\nBUFFALO HALL\n\nChoice Selections in DRESS GOODS at BUFFALO HALL\n\nInfants' Elegant ROBES & CLOTHES at BUFFALO HALL\n\nClapp & Bailey's celebrated LACE REMNANTS can be had only at BUFFALO HALL\n\nThe largest and most reliable stock of READY MADE CLOTHING in Prince Albert at BUFFALO HALL\n\nThe popular Double-stitched OVERALLS are made expressly for BUFFALO HALL\n\nFresh arrivals per steamer Marquis for BUFFALO HALL\n\nLong Clear Bacon, Canadian Ham, Tea, Sugar, Salt, Coffee, Tobacco, Canned Goods, and a full line of Staple Crockery and Patent Medicines.\n\nThe Leading House of Prince Albert is BUFFALO HALL.\n\nBETTS & Gwynne.\n\nCITY AUCTION MART.\n\nMARKLEY & ORR,\n\nReal Estate and General Agents—Sale Agents in this district for the\n\nThe Celebrated New York Singer Sewing Machines!\n\nCanada Life Assurance COMPANY\n\nESTABLISHED 1847.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $8,000,000\n\nAnnual Income, over $1,000,000.\n\nA general agent of the Company will visit this town a few days hence, and will assist in arranging the sale. He will also be able to derive from insuring in this old and reliable company.\n\nA. SPROAT,\n\nAgent,\n\nPrince Albert District, N.W.T.\n\nFARMERS ATTENTION!\n\nA. Harris, Son & Co., have delivered the undersigned, the largest variety of farming implements ever offered in this district:\n\nBrantford Reapers,\n\nBrantford Mowers and Rakes,\n\nSnowball & Speight Wagons,\n\nStubble and Grass Plows,\n\nA Large Stock of Repairs,\n\nTogether with\n\n20 Brantford Cord Binders,\n\nWhich are now being sold at the lowest prices ever offered in this district.\n\nA complete assortment of seed, grain, and fertilizer, together with a large selection of farm implements purchased at the lowest prices.\n\nAll these goods are guaranteed to give satisfaction.\n\nParties wishing to secure these articles should apply at once, as we will not carry any more orders.\n\nS. W. VANLUVEN JACKSON JACKSON", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883090501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9454, "total-output-tokens": 11022, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1500, 1], [1500, 17928, 2], [17928, 24043, 3], [24043, 33847, 4], [33847, 39860, 5], [39860, 47521, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]