[{"id": "e723ae86def17333c8e1f5674ffb473b2b871508", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\nFRIDAY, FEBRUARY 10, 1883.\n\nMANITOBA POLITICS\n\nThe political atmosphere in Manitoba is somewhat unsettled at present. On the resignation of the Harrison Government last month Mr. Greenwood, leader of the Reform party, called upon the Premier to resign the reins of power and to form a Cabinet. After a good deal of trouble he has succeeded in doing so. Mr. Greenwood is now Premier and Minister of Agriculture; Mr. Joseph Martin, of Portage la Prairie, Attorney General; Mr. Sanderson, a hardware merchant of Winnipeg, Minister of Public Works; Mr. Raymond Jones, Mayor of Winnipeg, Provincial Treasurer; Mr. Pendergast, is to be Provincial Secretary. Mr. Jones at present holds the seat of Mr. Norquay, who is expected to be Mr. Laurier's nominee for South Winnipeg, will resign in his favor. In the event of Mr. Jones consenting that costing by his party may be strengthened by his resignation, Mr. Norquay's party may be strengthened by his resignation. Mr. Pendergast, too, from all we can learn, is certain of defeat, and as every effort will be made by the Conservative party to defeat members of their own Cabinet when they present themselves for re-election, the prospects of the Greenwood Administration are not very bright. The strength of the two parties in the House of Assembly are as follows: Conservatives 46, Liberals 17, Independent 1, so that if one of the new Ministry be defeated the Conservative party again be in the majority. It would be almost a pity that Mr. Greenwood should not have control of the affairs of the Province for a year or two. Under the present administration, the people of Manitoba would be glad to renew the confidence in Mr. Norquay which they have for five years past in him, but which appears at present to be totally shaken, owing to his failure to build the Red River Valley Railway and to the groundless charges which have been made against him by his opponents.\n\nFEDERAL BANK.\n\nYesterday, Jan. 29 — The Federal Bank has decided to go into liquidation. This was decided at a meeting of the various shareholders. After much discussion after full discussion, it was decided to wind up the bank. Other banks will also be forced to close their doors in full. It is expected the shareholders will be called upon to pay something, perhaps half of their balance.\n\nThere has been a steady drain on the bank's resources since November first. The bank has been unable to make any payment as something has been going wrong for some time. The report says that the Bank of Nova Scotia, the Montreal Bank, and Merchants' Bank have advanced about $10,000.00 upon satisfactory security, and the Bank of Toronto have arranged to advance another large sum.\n\nIn other words, friendly relations have been severed. The bank, for the trouble dates back a good many years, when there was considerable antagonism between the Central Bank and low of confidence by depositors and sustainers of the institution. The bank, however, the only source open to the bank has been paraded, and the present feeling is that the bank is in a state of disappearance of what has long been one of the chief institutions in the city. The old bank disappeared when Hammond and Headrie were elected and could hardly take to the rear of the bank. The bank, however, the citizens after looking into the affairs became convinced that only one course, that now pursued, was open.\n\nHURRAH!\nFOR THE CHEAP CASH STORE.\nCash Will Tell Where You Can Get Bargains\nAfter considering the matter over carefully, we have decided to make\nThe Horse Shoe Store\nA CASH STORE\nFOR THE YEAR 1883.\nIt is impossible to sell cheap on a credit basis. We do not rob\nPeter to pay Paul.\nWe have everything you want in\nDry Goods, Readymade Clothing, Underclothing, Hosiery, Moccasins, Boots and Shoes, Glassware, Crockery.\nOUR STOCK OF GROCERIES!\nIs Complete in Every Department.\nCall early and get the benefit of our Cash System.\nOur aim is Small Profits and Quick Returns.\n\nTHOS. O. DAVIS.\nClearing Sale.\nALL REMAINING\nParlor Stoves\nAT COST\nBox Stoves\nREDUCED TEN PER CENT.\nAcme Skates\nREDUCED TEN PER CENT.\nT. J. AGNEW'S\nClearing Sale.\nHAVING ON HAND A LARGE STOCK OF\nFancy Goods and Toys\nWhich must be disposed of to make room for other lines, I have decided to offer the balance of\nThese Goods at Cost.\nCall early and take advantage of this offer, which will remain open until February 15th.\n\nT. N. CAMPBELL'S\nTERRITORIAL NEWS\n\nEDMONTON\n\nFrom the Bulletin, Jan. 14.\n\nCattle are doing well at this time if this is a late spring some farmers will be short of feed.\n\nLumbermen have begun to open up and drill in the Saskatchewan area where before Riddle took charge this winter, and to take out 800 tons of coal for Riddle's use.\n\nThe complaints of O division of police stationed at Fort Saskatchewan and Edm. were heard by the citizens of Edmonton last Monday night. Everything possible had been done by the committee to remove the complaints, but they only came from a distance, and to make the affair one to be considered as most enjoyable.\n\nAll the noise credit is due to the constables as they managed the whole affair so efficiently, making no part of it.\n\nJanuary and February are the heart of the winter in this district. There are no months when the snow falls more heavy down low, the wind rises and the snow falls. There is seldom good sleighing, but it is nearly always very fine weather up to January. After the first of March little or no snow falls and the weather becomes very fine. The snow is nearly all, or nearly all, bare ground by the first of April. Where the cattle are not fed, they are forced to live on what is left in the fall, December, January, February and March are the only months in which, we are told, there is snow above two feet prior to June 1st.\n\nBATTLEFORD\n\nFrom the Herald, Jan. 21.\n\nA party of \"walkers\" returned the other day from a protracted hunt. The only success that was had was that they promised the old dog they met not eat them.\n\nThe Rev. F. Frithacker held services for the religious people who compose the third Sunday in the month, returning to Battleford in time to hold evening service. Service is also held on the second Sunday in the month, the fourth month at Breanor.\n\nFor the first time in years the Caribou Camp was behind that in anything like shape, having been delayed a day at the South Ranch by the storm. It was also delayed a day at the North Ranch this end of the line, Gen. Smith, the driver, having been detained to give evidence against the man who was to the finding of the body of Mr. John Mitchell. The outward bound mail of the previous week was also detained bound a day at the North Ranch.\n\nLETHBRIDGE\n\nFrom the News, Jan. 26.\n\nOn the 15th the snow and spell stick men had begun to get anxious about the cattle on the range, but yesterday's climate made a decided change, and it is now expected there will be no trouble with more snow this winter.\n\nThere was an splendid scene seen on Nov. 3rd at Lethbridge Station's yard, inside the Town Hall, the Gordon Highlanders, C. A., Kennedy's house and a few others, were engaged in a friendly contest. Yesterday McLeod was engaged and today the Company's own snare and Fiddichfield, Darnley.\n\nFORE MACLEOD\n\nFrom the Gazette, Jan. 25.\n\nAs far as can be learned from various parts of the range, cattle have not suffered from the present cold weather. There is plenty of feed for the present, and cattle are in fine condition.\n\nThursday night last 53 men started for the range, and on Friday morning the way was reported to be clear. The night was very cold, and nearly all the cattle have been brought back. They got there, then turned back and went to the range, bringing them to the foothills next month.\n\nJ. M. CAMPBELL\n\nIn now receiving one of the Largest and Best Selected Stocks of\n\nFall and Winter Goods\n\nDress Goods\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nin ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGentlemen's Fancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF\n\nMitts and Moccasins\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nFLOUR!\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD:\n\nAn Inspection of Our Stock So fitted.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nBLUE RIBBON BINDER TWINE!\n\nManufactured by\n\nThe Dartmouth Ropework Co.,\n\nHALIFAX, NOVA SCOTIA.\n\nSUPERIOR TO ALL!\n\nFARMERS SHOULD USE NO OTHER.\n\nSee that Each Ball is Bound With\n\nA BLUE RIBBON!!\n\nFOR THE Best Assorted Stock of CONFECTIONERY GO TO\n\nH. MCDougall's BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL\n\nSASKATCHEWAN DIRECTORY\n\nAt the request of a number of individuals connected with the town, I have prepared a list of about the first of this issue the directory contains the names of those who have been connected in any manner whatever with the town, and will be distributed throughout the district, setting forth the names and addresses of those who are now residing within the town limits.\n\nIt will also contain names of the town of Prince Albert, and will be distributed between the lines of the actual settlers throughout the district, and will be distributed as near as possible and possible, and will be distributed to every person who is in a thoroughly reliable and source of reference.\n\nAdvertisements will be inserted at the rate of five cents per copy, and the entire publication will be sold for ten cents per copy; to those who advertise.\n\nOrders for copies of Directory may be directed to the undersigned, Geo. P. Rowell, St. Thomas, Prince Albert.\n\nGeo. P. Rowell must be directed.\n\nThose who have not sent in their adver-\n\ntisements, also, who have kindly\n\nnotified me of their intention to advertise, will please not forget to send with the next week's paper.\n\nH. T. McPHILLIPS\n\nPrince Albert, Sask.\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advertising Bureau, 1019 Broadway, New York, Room 100 for Copying Pamphlets.\nTHE RIFLE ASSOCIATION.\n\nOn Wednesday evening last the annual meeting of the Saskatchewan Rifle Association was held in the town hall. From the large attendance of members and the very favorable reception given by the association, there is more interest taken, shooting than any other pastime.\n\nAbout 8:30 p.m., Mr. A. J. Johnson, the president, came into order and explained the position in which the association now stands with regard to the rifles. He stated that the association had been formed for the purpose of promoting the use of firearms among the citizens of the province, and that the government had been asked to lend an armory. The secretary, Mr. W. M. Miller, read the minutes of the former meeting, and the treasurer's report which showed a balance of $150.00 in the association's funds. After discussion, it was decided that the association should take full charge of the rifles and that the association should sign the government contract on behalf of the association.\n\nOn motion of Mr. T. Agnew, seconded by Mr. A. B. Burns, it was decided that no ammunition be sold or issued before or after the leasing or recall of the rifles. This was a very important question, and it was decided that some steps be got ammunition for other purposes than that which was originally intended. Consideration was given to the question raised about the granting of a range to the association, but being in a rather unsatisfactory shape, it was decided that the association should send a member to Ottawa, asking for fuller information.\n\nMr. John Stewart, the representative made in the matter of the association at Ottawa, addressed the meeting at some length, congratulating the association on their success and financial standing, and expressing his satisfaction with such an organization.\n\nThe only business remaining was the election of officers, which resulted in the present president and secretary retaining their offices by acclamation. Those elected were:\n\nPresident, J. L. Johnson.\nVice President, T. E. Baker.\nSecretary, T. Agnew.\nTreasurer, S. Beever.\nAsst. Secretary, T. J. Agnew.\nRepresentative, J. Stewart.\nExecutive Council, J. W. Hard, D. Williamson, A. R. Burns, J. D. Macvey, J. McCay, J. J. Taggart, G. Horriss, H. W. Newlands, J. P. A. Stull and D. J. Gann.\n\nAdjournment of J. Stewart, seconded by J. McCay, was moved, and consideration was given to the question of whether this association was able to perform its duties in a manner worthy of the confidence placed in it. It was displayed in furthering the interests of the association, due to the secretary's work. Mr. J. Stewart, seconded by Mr. McCay, instantly accepted the offer and thanked the association very heartily. After a short discussion of the subject as to the benefits of the association, and congratulating them on their success, the meeting adjourned.\n\nTOWN COUNCIL.\n\nThe Council met in the council chamber on Monday last. All the members were present except Capt. Davis. His wardenship was in the chair, presiding over the meeting. The council discussed the matters arising out of the last meeting and the introduction of a by-law to regulate trading on very little business. The council was principally spent in discussing technicalities, neither beneficial to the council nor the public. The council seemed determined to retard business rather than advance it. It is a great pity that any member of the Council Board should fail to be an obstructionist. Every member was elected to attend and attend to the interests of the town rather than be here for the sake of a petty squabble, which will now no doubt continue until the end of the year. We do not intend to attend any more of the council in future. We will give credit to whom credit is due, and those who have been doing their best we would like to see the business of the town done in an amiable spirit, and all questions discussed fairly and treated up on their merits without personal animosity.\n\nLester.—\"Suppose you really engaged to him, dear? He is forty, you know, and you are twenty—just twice as old anyway, you know, when you are forty you will be eighty.\"\n\nClarke.—\"Good gracious! I hadn't even thought of that.\"\n\nAGRICULTURAL SOCIETY.\n\nThe annual meeting of the Lower Agricultural Society was held in the town hall on Tuesday last. The president, Mr. Wm. Plaxton, in the chair, opened the proceedings by calling on the members of the former meeting were re-elected. The Sec. Treasurer's report was then read.\n\nThe election of officers was next brought up for consideration. Mr. A. L. Sutton that the election be held by ballot. Capt. Craig and Thos. McKay were proposed for ballot for, and returned the election of Mr. Sutton to the presidency for the present year.\n\nMessrs. Jan Thompson and Wm. McMillan were elected 1st and 2nd vice-presidents respectively.\n\nThe Rev. Mr. Howard was elected Sec. Treasurer unanimously.\n\nAfter the election of officers the following were elected a Board of Directors: Wm. Plaxton, Wm. Miller, Mr. Lyttle, James Macintosh, J. P. Prichard, Wm. Miller, Jr., and Oscar Adams.\n\nMoved by Capt. Craig and seconded by J. T. Agnew, that Mr. A. L. Sutton be appointed to the office of secretary, for his efficient services in the past. Carried.\n\nMoved by Capt. Craig and seconded by J. T. Agnew, that Mr. A. L. Sutton be appointed to the office of secretary, for his efficient services in the past. Carried.\n\nA vote of thanks was also tendered the retiring president, Mr. Wm. Plaxton, and the same was recorded in the minutes. Carried.\n\nThe meeting then adjourned.\n\nPRINCE ALBERT BREWERY.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GEFROND\n\nGO TO CANN'S BOOK STORE\n\nStationery, School Books, ETC., ETC.\n\nGRAND UNION LIVERY STABLE.\n\nOpposition is the Life of Trade.\n\nA First Class Livery, Feed and Sale Stable.\n\nWe would like to invite the public when visiting this place to see our fine stable of horses and mules in our new barn. We have a good supply of Feed Stable in town.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder contains a marvel of strength and purity. It is free from the ordinary acids and cannot be compared with any other brand of low price, every weight, size or shape of box.\n\nROYAL BAKING POWDER COMPANY LTD., WALL STREET, TORONTO.\n\nPRINCE ALBERT BREWERY.\n\nPure and Sparkling AMBER--Hop--ALE.\n\nDelivered to all Parts of the Town.\n\nJ. R. McPHAIL'S.\n\nThe balance of our Heating Stoves and Drums will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on\n\nJ. R. McPHAIL.\n\nIMPORTANT NOTICE.\n\nOwing to the long delay of our goods in transit, we have made a sweeping reduction in every department, consisting of:\n\nPlushes, Velvet, Dress Lawn, India Linen, Muslin,\nIrish Diaper Linen, Cashmere, All-wool Dress Goods,\nFurniture Cretonne, Pillow Cotton,\nWhite and Grey Flannel, Boys and Men's Top and Undershirts, Tapestry Carpets and Mitts\nLady's Winter Jerseys, Boys' Jersey Suits.\nLadies' and Gentlemen's Persian Lamb Caps.\n\nR. C. WIGMORE & CO.'S.\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888021001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 4584, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4489, 2], [4489, 10776, 3], [10776, 18573, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]