[{"id": "f194a9c4da9fa7bc35fd14d7e25f2d4b44f0bd9c", "text": "PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nPRINCE ALBERT, SASK., FRIDAY, JULY 17, 1885.\n\n$2.50 A YEAR.\n\nBANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nTransacts a General Banking Business\nInterest allowed on Deposits.\n\nA. GOODFELLOW,\nPrince Albert, N.W.T.\n\nNOTICE.\n\nAs we intend dissolving part-\nnership, all parties indebted to\nus will be required to pay us in full to date on or before the last day of August, 1885; otherwise their accounts will be placed in court for collection.\n\nMARKLEY & CO.\n\nMILK.\n\nTwelve Quarts for a Dollar.\n(Fresh milk will be delivered to any part of town every day. Leave your order at J.M. Campbell's store.)\n\nWM BROWN\n\nEncourage Home Manufactures\nWASHING MACHINES\nMADE TO ORDER.\n\nPrice $10. Give Them a Trial\nWells Sunk and Pumps Made and Repaired\n\nOrders left at J.L. Johnson & Co.'s will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert.\n\nDENTIST:\nPRINCE ALBERT, N.W.T.\n\nNOTICE.\n\nNotice hereby given that the present partnership existing between us, to the present date, will be dissolved on July 31st, and this business will hereafter be conducted by Gilbert E. Carter, solicitor.\n\nGILBERT CARTER\nGILBERT E. CARTER\n\nEAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nHugh McDougall,\nEast End Bakery.\n\nTHE GABLE HOUSE.\nThe best Outfit of Pool, Carom & Pigeon Hole Table in the Territory.\n\nJohn Wynnekirch, Prop.\n\nROBERT THOMSON,\nSign & Ornamental Painter.\n\nDecorative Painting; a Specialty.\n\nCasting and Paperhanging on short notice.\n\nL. YANGQUISTH\nAgent of Indian Affairs.\nDepartment of Interior, Ottawa.\n\nPRINCE ALBERT\nPlaying Cards & Saah and Door Factory\nCor. Saah and MacKay Sts.\nSaah, Doors, Frames, Blinds, Mouldings and Builders' Furnishings made on the shortest notice.\n\nJOSEPH COURTNEY\n\nWANTED TELEGRAPHIC.\n\nA TEACHER\n\nMale or Female—For Prince Albert East Public School.\nApply before 5th inst. to JOSEPH COURTNEY.\n\nTHE VERY LATEST NEWS BY WIRE\n\n(By Special Telegraph)\nQuébec July 16.\nThe C.P.R. Bill has passed the Commons.\n\nSir John A. Macdonald introduced a resolution granting volunteers two quarter sections of land, which passed the House.\n\nThe bill introducing the Forestry, School, Land Settlement and Insolvency Act dropped through.\n\nLemonia, Fitzpatrick and Green-\nshields, Rio's council, have arrived at Regina.\n\nThe 9th Battalion was given an enthusiastic reception on behalf of Canada in Winnipeg on Wednesday.\n\nEl Mahdi is reported dead.\n\nSeveral Orange riots occurred in India on recent days past.\n\nTwenty-two soldiers arrived in Regina from Battlefield, including Poundmaker.\n\nThe contracts for completing the South Western Railway are to be let immediately.\n\nLord Wolseley has arrived in London.\n\nClark's Crossing, July 17.\n\nA large number of teams are engaged in hauling government supplies from here to Battleford. A sure crop span the road but little difficulty is experienced on the way.\n\nJudge, lawyers, witnesses and prisoners are all hurrying to Regina to take part in the great legal drama which takes place about the 22nd.\n\nLt. Col. Irvine en route from Prince Albert to Regina, arrived at Clark's Crossing yesterday morning.\n\nCamilleri, the Moore Jan murderer, suffered the extreme penalty of the law this morning at 8 o'clock at Regina. The execution was private, only about a dozen persons besides the guard being admitted to the yard.\n\nThe condemned man refused to confess and ten minutes after the bolt was drawn his pulse ceased to beat.\n\nBritish and Afghan forces are again meeting near the front. Trouble is anticipated.\n\nWHEREAS the Secretary of the Department of the Interior has been requested by the Honorable Minister of the Interior to direct the Honorable Minister of the Interior to make arrangements to provide suitable accommodations for the accommodation of families residing in the North West until the completion of the railway line.\n\nMr. Cameron's motion referring to Territorial representation was rejected in the Commons.\n\nAmong the estimates for the coming year are the following:\n\nTo build the new court house and jail at Prince Albert, $15,000 for the relief of the Indians in the North West, and $2,000,000 for railway expenses.\n\nTENDERS\n\nSupplying of Furniture\nFor the Prince Albert Provincial Public School.\n\nFor particulars apply to JOHN STEWART, Sec. Board.\n\nL. YANGQUISTH\nAgent of Indian Affairs.\nDepartment of Interior, Ottawa.\n\nMay 24th, 1885.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S.\n11 a.m.—Rev. E. Matheson.\nThe Mission Chapel.\n11 a.m.—Rev. A. H. Wright.\n3 p.m.—Sunday School.\n7 p.m.—Rev. A. H. Wright.\nST. CATHERINE'S.\n10:30 a.m.—Rev. Canon Flett.\n3 p.m.—Rev. P. Petten.\n2 p.m.—Rev. C. Macdonald.\nST. ANDREW'S.\n10:30 a.m.—Rev. J. F. Prichard.\nST. JOHN'S.\n3 p.m.—Rev. J. F. Prichard.\nST. JAMES'.\n7 p.m.—Rev. J. F. Prichard.\nST. ANNE'S (Presbyterian).\n10:30 a.m.—Rev. Mr. Smith.\nRev. Mr. Smith.\nFRIDAY, JULY 17, 1885.\n\nMR. JAMES INSTRINCT.\n\nIt is always difficult to engage strongly entertained conviction grounded upon what one considers experience ample to justify them. It is therefore with reluctance that we feel compelled to admit that the true home of the Irish is to be found in the North-Western Territory, rather than in British India. While the native of the latter empire can express, suppress, the truth or assert the false in a manner leaving little to be desired, the North-West offers no means of escape from suspicion. A case in point is Mr. J. Ishbister's lately published statement that the Hon. L. Clarke advised him half-breeds, through him, to resort to rebellion in order to secure their rights. Our sympathy has been with Mr. Clarke's course—the treatment of such utterances with contemptuous silence. We now less agree with his main friend, that the defender of a nation who had done far less for the good of a settlement than he has done for this comes within the legitimate duties of the local press, and in different terms than those used to convict Mr. Ishbister, who by the way is obviously only another of the ignorant dupes who are at present lending their names to screen no less vicious but much more sneaking assaults on the Government. With it, may be noticed that Ishbister grounds his charge upon what he alleges to have occurred at an interview when no third party was present, and Mr. Clarke's account of what passed is decidedly to the contrary. Mr. Clarke claims that inter alia he told Ishbister that Messrs. Mair and Macdowall and he himself had been to Ottawa in connection with the half-breed claims; that all the best possible equity had been admitted; and that now nothing more than a little patience was required. He further warned Ishbister distinctly of the danger he would individually incur should any attempt to coerce or intimidate the Government result from the bringing in of Riel by himself or his colleagues. Ishbister, intoxicated by the fancied importance of his new appointment as delegate, refused to abandon his scheme, and was very properly ordered out of Mr. Clarke's presence. Were there not evidence beyond these two diametrically opposite statements, a regard to the probabilities of the case and a knowledge of the two men would be in the mind of any unbiased observer that Ishbister was out of court at once. Fortunately, there is a mass of evidence which might be adduced to support Mr. Clarke's version. Ishbister's instigator had cunningly concealed his identity, and must be found to give plausibility to the charge of this monstrous accusation, and suggested that Mr. Clarke though speculation in the new country was half-breeds had identified his interests with those of the rebels. The refutation of this could only be obtained from the gentleman himself, who in proof of his emphatic denial handed us his written undertaking to pay back the sum demanded. The honest dollar to any one convincing him of any bargains for or purchase of a single acre or land grant from any one entitled to participate in the forthcoming issue, would make this disappearance, we may select from a quantity of disinterested evidence corroborative of Mr. Clarke's version—which we have not made a step to seek. Ishbister's own statement after the affair was over, that he had been ordered out of the office, and had then for the first time changed his opinion with regard to Clarke being a gentleman, his administration of W. G. M. Kay when frequently in the same house with Mr. Clarke strongly warned him against any connection with such a movement, and his giving to a well known gentleman his assurance of having never heard of Mr. Clarke nor one connected with him so engaged as was so engaged with all connected with Riel and his agitation that he did not like to approach him. We may rather superfluously add that since we knew a certain Canadian whose official connection with any rate the constitutional agitation gave him the means of judging, so far from accusing Mr. Clarke of having been a traitor, explained to us that his opinion was marked by such from the beginning had rise in politic jealousy of Riel's influence. To exhaust Ishbister's lies is beyond the limit of our space or patience. We need only say that Mr. Clarke, the only contact given to C. Nain was one from the telegraph committee of our citizens, that M. Dumas' appointment as farm instructor was dissipated by Mr. Clarke; and that while Ishbister was perfectly willing to accept a position under his name when put before the Lieutenant-Governor was promptly rejected and another substituted, Mr. Clarke's only sin consisted in having moved Ishbister away from all the powerful, generous and patriotic influences that he had repeated of his dealings with Riel, recommending him for the appointment. This is the reward of the most towering treason. As to Ishbister's conduct here, when his indiscretion kept him from joining his friends at Bathoche, his guilty conscience prevented his coming into the town. When in fear that his double treachery would bring the vengeance of the law upon him he was forced to submit—coming in to surrender for his own protection, when arrested by our volunteers. Lastly, with regard to those widespread statement that something said by Mr. Clarke to the Metis at Batoche precipitated the rising, we may say that every statement received by him at Humboldt induced him so far from saying anything to excite the French, to pass through an hour and a half in a way to prevent any such thing occurring. Half the danger of the insurrection disappeared with its premature outbreak. Mr. Clarke might be proud to claim the credit, but can not truthfully do so. Were it not for the lack of the proper qualifications, he would certainly be the judge of Ishbister and his friend would entice them to divide the cake between them.\n\nTHE N.W.COUNCIL.\n\nIt seems to us that there is an inclination to make far too much of the fact that the Territorial Government gave one or two appointments recently to men known to be Riel's supporters. Regarding the matter disparately, it would appear that this step, which has been magnified into a crime, amounts at the most to an error of judgment. Of course it is, as we all know, easy to be wise after the event, and the obvious errors of yesterday decide a day. To say however, that that error was criminal at the time when it was committed involves certain knowledge upon the part of those making the assertion, such as to make it hazardous whether they possess it—or—and the contrary how ever often asserted, has not yet been proved—the authorities at Regina having made the best use of the information placed at their command, honestly believed that Riel had only a few sufficiently fanatical supporters to really disturb the public peace, they cannot be blamed for taking a step likely to appease the wishes of the Government supporters. That these men would be likely to uphold the Government from which they drew their salaries was surely not extravagant calculation, and certainly the amount of good faith, and acrimony assumed the correctness of this being the state of the case, was purchased in the public interest. In effect, in fact the very making of such appointments goes far to indicate just what would serve as their justification was the case—viz., that the Lieutenant-Governor was not in receipt of information calculated to inspire caution. This has been more readily admitted when we remember how utterly surprised, even here next door to St. Laurent, almost all of ourselves were when the actual facts came to light. It may be that the information supplied to Regina did not receive that careful consideration which—in view of what was at stake—it should have received, and that has been shown to have been the case we should endeavor to be just, and should suspend our judgment. It is not easy to understand how this conciliatory measure should be charged to the Government as a whole, by those who in the next breath condemn them for having neglected a conciliatory policy towards the Metis.\n\nDRESSING LUMBER.\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 1 feet extra.\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTRADERS,\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugar,\nCanned Goods,\nCal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware, AT COST\n\nKNOX AND BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nSTEWARD BROS.\n\nFAMILY FITTING MACHINES.\n\nBought to be the BEST FAMILY FITTING MACHINE IN USE.\n\nIn a number of the many articles that can be made on our Patent Machine, there are none that can be made on any other. There are none that can be made on any other machine that can be bought in Canada and the United States.\n\nOUR RIDDER IS PERFECTION.\n\nWith more stitches in the top than in the stitcher, the stitcher is unable to make a stitch that is as strong as the stitcher. The stitcher cannot make a stitch that is as strong as the stitcher. The stitcher cannot make a stitch that is as strong as the stitcher.\n\nHOSIERY IN THE WORLD.\n\nWith more stitches in the top than in the stitcher, the stitcher is unable to make a stitch that is as strong as the stitcher. The stitcher cannot make a stitch that is as strong as the stitcher.\n\nCREELMAN BROS.,\nGEORGETOWN, ONT.\n\nThe Dominion Organ and Piano Co.\n\nHas the largest and most complete range of Eight Sizes ever offered in any Piano House in Canada.\nCOMMUNICATIONS.\n\nTHE LEADING LADIES.\n\nThe Editor of The Times,\n\nI have more than once been asked the question, \"What was the leading ladies' spirit?\" This question, asked in a somewhat spirit, often displays other good qualities. It seems to me that the essence of the question; or what the essence of a lady—for ladies are the best part of the human race—therein lies the question. In a present day society, there seems to be a tendency toward the feminine mind of the gentleman, and one can not easily avoid the question, \"What is the leading ladies' spirit?\"\n\nThe speculation seems to have arisen from the fact that certain ladies amongst us have been distinguished by their \"leading,\" have joined together to present Lt.-Col. Irvine with some tangible tokens of their esteem, and by virtue of their influence and energy, when we last met up in town for some two months. These ladies, of course take the responsibility of getting things done, and they do so in this beyond that crema de la crema which compose the leading ladies.\n\nMay I say that I am very glad that so many individuals took part in this affair, and only know that several whom I have seen were very much in a jolly mood. I am sure they are free from prejudice, perhaps the first step towards answering the question is to recognize what it is that makes men and women distinctive.\n\nHere I am puzzled. It may be perhaps that they lead in a style which is not found amongst the ladies.\n\nIf so, why should some of those distinguished for all that is most lovable in women in a country, viz., staying quietly at home, witnessing to the comfort and happiness of their families, instead of running about doing insignificant things?—I refer here to the ladies in the select circle. Suppose again that the responsibilities leading to their husbands and children were freed from them, would they not be able to perform their duties without assistance, still more have been capriciously excluded. I feel deeply for the good ladies who would have thought that good ladies such as leading ladies are supposed to be, would have preserved their dignity, it seems to me, by withdrawing themselves from the women who joined in the affair to Lt.-Col. Irvine, who as an old friend of mine, I am sure, is simply satisfied with a verbal expression of the appreciation of the way in which he has conducted himself.\n\nThe leading ladies may suppose that the sacred value attached to them procured them the position given. If so, the women who at one time, as far as their humble means permit, to make some suitable acknowledgment to the leading ladies.\n\nI am, Sir,\n\nYours faithfully,\n\nONE OF THE WOMEN.\n\nTHE POLICE SHARE FOR BIG BEAR.\n\nAfter the Police left Prince Albert to hunt up Big Bear, they first made Carlton, then turned back to the rescue of Matasauk and Star Bluff. A party was left to patrol the Carlton trail, while others were sent all over the country. The police have now been engaged in moments necessitating equally delicate progression by the Police—who as they report each day's intelligence from the scene of operations—have been kept almost three months. At the end of the fifth day out they reached Green Lake. The road at the head of the lake was impassable, but the party had not eaten provisions or horse feed could be packed, so each man had to carry his own supplies. The next day the force on the east side of the lake from Green Lake to twenty lodges of Lake Creek, who claimed to be friendly, but who were guarding the H.B.C.'s building from sharing the destruction of the goods. The H.B.C. from there to the head of Lake Loon Lake, where they met, but intelligence that Big Bear would probably pass the point of Pelican Lake brought back to the head of Lake Loon Lake. From there the party of Indians reported by their scouts made their return to Pelican Lake where they started one of Big Bear's men and a Fort Pitt man. The scouts now\n\nCHESTER THOMPSON,\nGeneral Blacksmith.\n\nEnd next to Hudson's Bay Store.\n\nRepairing Farm Machinery\nA Specialty.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJAMES SINCLAIR\nMerchant Tailor,\nAND DEALER IN\nGENTS' FURNISHINGS.\n\nDISSOLUTION OF PARTNERSHIP.\n\nNotice is hereby given that the partnership heretofore existing between us, the undersigned, this day came to an end by mutual consent. All debts owing to the said partnership to be paid to the undersigned Andrew Goodfellow who will settle accounts against the said partnership.\n\nA. GOODFELLOW,\nW. H. GOODFELLOW,\nR. T. GOODFELLOW.\n\nAndrew Goodfellow will carry on the business as usual. It is necessary for all parties interested in the firm to call and settle their accounts immediately, otherwise they will have to be dealt with by the new partners.\n\nA. GOODFELLOW.\n\nFORSALE\n\nBERKSHIRE PIGS!\n\nCan be seen at\n\nJ. D. THOMSON'S,\nSouth Branch\n\nNOTICE.\n\nAll parties indebted to me are requested to call and settle immediately, or their claims will be placed in my lawyer's hands for collection. This notice is given on the 1st July next.\n\nS. J. COOK.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\nJust received at Shannon & McLeod's large assortment of Men's Riding Boots, Walking Boots, Boots, Fine Tie Shoes, and all kinds Course Work.\n\nAnd a large assortment Ladies', Misses, and Children's Fine French Kid Button Boots and Slippers of all kinds and sizes and at prices to suit purchasers.\n\n3RD ST., PRINCE ALBERT, SASK\nTHE REBELLION.\n\n(Continued from Our Last.)\n\nWhile the engagement proceeded thus from the left flank along the centre and from its right, things had been faring badly for the Unionists stationed along the field. The joint charge of the militia against the enemy's position was met by a heavy fire from the enemy's batteries, which caused considerable loss among the Unionists. However, the Unionists continued their advance, and the enemy began to retreat. The Unionists pursued them, but the enemy rallied and counter-attacked, forcing the Unionists back to their original positions.\n\nThe situation became critical when the enemy launched a surprise attack on the Unionists' rear. The Unionists were forced to retreat further, and the enemy advanced towards their lines. The Unionists fought bravely, but they were outnumbered and outgunned. The enemy's artillery fire was devastating, and the Unionists suffered heavy losses.\n\nThe Unionists' morale was low, and many soldiers were injured or killed. However, the Unionists refused to give up and continued to fight. Despite the odds, they managed to hold their ground and prevent the enemy from advancing any further.\n\nThe battle ended with the Unionists retreating to their original positions, but they had managed to inflict significant damage on the enemy. The enemy retreated, and the Unionists were able to regroup and prepare for future engagements.\n\nBuffalo Hall!\n\nSUMMER STOCK NOW COMPLETE\n\nOur Dry Goods, Clothing, Gent's Furnishings, Hats, etc., have been selected with the greatest care, while special attention has been given to the selection for our Grocery Department. Garnels, French Creams and other Mixed Candies, Nuts and Raisins, together with Fresh Biscuits in Tubs, Fruits, Taffy Fingers, Lemon Creams and Iced Butters, make a choice addition to our well assorted line of GENERAL GROCERIES.\n\nPIPES, TOBACCO, CIGARS, CIGARETTES.\n\nBETTS & Gwynne.\n\nO. E. HUGHES & CO.,\nGeneral Merchants and Indian Traders,\n\nHave just received a Large and Complete Stock of\n\nDry Goods, Hats,\nReady Made Clothing,\nBoots and Shoes, etc.\n\nMorton's Celebrated Jams,\nJellies, Pickles, Confectionery\nTeas and Sugar,\n\nWhich defy competition. Also we can send Ogilvie's Flour,\nWhich we will ship cheap for cash.\n\nO. E. HUGHES & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nTHOS. POWERS,\nIS PREPARED TO TAKE\nCONTRACTS FOR\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates free.\n\nBRICK AND STONE ALWAYS ON HAND.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\n\nAT T. N. Campbell's New Store\n\nA LARGE STOCK OF\nWatches, Clocks and Jewellery\n\nKEEP CONSTANTLY ON HAND.\n\nRepairing Promptly Attended to.\n\nPRINCE ALBERT - N.W.T.\n\nJUST RECEIVED\nHORSE SHOE STORE\nA LARGE STOCK OF\nHats, Summer Suits, Prints and Dress Goods\n\nALSO A SUPPLY OF\nFRESH GROCERIES\n\nT. O. DAVIS J. M. CAMPBELL.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885071701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 5550, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4377, 1], [4377, 14857, 2], [14857, 20421, 3], [20421, 23457, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]