[{"id": "e24df8cbdaec10f98c21ddbc03ee52cd6155b5ee", "text": "The question of the day, both here and in the United States, is whether Cleveland or Harrison, Mitchell or Fisher, had the plurality or the majority? We await the answer in dimm silence.\n\nSince we raised the question as to the legality of the elections, many papers and officials have been heard from on the subject, but so far we have not heard any thing to convince us that there was no question of legality, but we notice that it appears to be the prevailing opinion that legislation at Ottawa will remove any doubts and legalise the North West Assembly.\n\nThe Regina Leader, speaking of the North West Assembly, says—“The Assembly is a very strong organization. The Legislators, even the Assemblymen, and merchants are far ahead of Manitobans.” True as to the relative abilities of the members of the two Legislatures, but as to the rest we cannot say. The Assembly is a rest too powerful. Manitoba settler and merchants are as good as any on the continent.\n\nCannibals and Woolen History, of all kinds and sizes, Linoleum Jerseys, and Cardigan Jackets for guests, etc. All goods will be sold to suit the times Walter & Baker.\n\nGO TO\n\nAGNEW'S\n\nFOR\n\nStoves\nStoves\nStoves\nHeating Drums\nStovepipe\nCoal Oil\n\nT.J. AGNEW\n\nW.STOBART & CO\n\nIndian Traders\n\nGeneral Merchants\n\nPrince Albert and Duck Lake\n\nSASK.\n\nFOR THE\n\nBest Assorted Stock\n\nor\n\nCONFECTIONERY\n\nGO TO\n\nH. M'Dougall's BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL.\n\nR. C. WIGMORE & CO.\n\nHave removed to their new premises,\n\nSECOND DOOR EAST OF OLD STAND\n\nWhere they will be pleased to meet their numerous new and old customers.\n\nClearing Sale still going on.\n\nR. C. WIGMORE & CO.\n\n1879.\n\nBuffalo Hall!\n\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\n\nNow in stock will be sold\n\nFOR TWO WEEKS ONLY\n\nAT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & Gwynne\n\nT. N. Campbell\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed uitings,\n\nTrowsering and Overcoating\n\nWORSTEDS,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion\n\nSUMMER SUITINGS\n\nIN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nTERRITORIAL NEWS\n\nMEDICINE HAT.\n\nFrom the Pioneer, Nov. 9.\nWe had a little flurry of snow on Saturday morning.\nOver one hundred people were entertained right royally at the Orangeman's Hall last night.\nThe city was lit up on Monday night by the light of a firework sent to the south.\nJos. Wm. Percy and wife, of Fort Saskatchewan, Alta., have been guests of Mr. and Mrs. Percy Smith this week.\nMr. Percy went east two weeks ago, and the marriage license was issued in Edmonton.\nThe bride was Miss Taylor, formerly of Medicine Hat. We extend our hearty congratulations to the young couple.\n\nREGINA.\n\nFrom the Journal, Nov. 8.\nWhat has been raining during the past couple of days, some thousands of barrels have been marketed here. The establishment prices are low, but for some $15 it was paid yesterday.\nCommissioners Robson and Matheson of the municipal police, embarked on a visit to the headquarters of Master Mason by entertaining the Masonic brethren to a banquet at the Windsor on Tuesday night.\nSeveral of the municipal policemen, who are on duty in Saskatoon, attended dinner service at the Windsor on Sunday night, having been invited by members of the Salvation Army, were asked to assist in the service.\nMr. Fehrleibach, the inspector of the C.P.R. experimental farms, is in town collecting samples for the C.P.R. exhibition care.\nHe visited North Battleford on behalf of Master Mason this year. A committee of the Board of Trade is intending how to promote them in this vicinity, but he will not be able to visit the exhibits from each district will be kept separate and carefully handled.\n\nLETHBRIDGE.\n\nFrom the News, Nov. 8.\nChief Campbell returned home from taking prisoners to Regina on Saturday last.\nThe weather for this week looked being very fine indeed; so, very fine and the nights not very cold, ranchers are busy harvesting whatever marketable vegetables they may have on hand.\nThere is a ready market for them from the grocers and provision merchants.\nThe rivers in this vicinity rose to a considerable height on Friday, but the day laid and were impassable for freight teams which in consequence had to go back by the old Up Line to Fort Macleod.\nThe same was the case Saturday, but by the warm spell of the few days previous melting the snow in the mountains.\nMr. Gilmore, of Manitoba, arrived here this morning with a carload of two and three-year-old calves which he holds for sale. The cattle are in good condition, better than we have ever seen, being large, well graded and in good condition.\n\nFORT MACLEOD.\n\nFrom the Gazette, Nov. 8.\nThe post mill business was wound up on Saturday. Some $45 expenses were returned to be paid, and the balance remaining, less taxes, to those who had paid the fees.\nLumber & McArthur, solicitors for the Alberta & Athabasca Railway Co., are now engaged in the erection of its offices, giving attention to its erection, construction, equip and operate its line of railway from its northern terminus point at Macleod to the Canadian Pacific Railway, whereby to the international boundary; and also from its northern terminus point at Macleod to the Peace River, northwesterly to the Peace River, and to increase the coastal stock thereof, as per agreement.\nOn Thursday a party of prisoners named Wright, confined in the guard room on a charge of an assault, for selling liquor, were released on bail. The prisoners have not yet been captured. The prisoners' weight on the head, were sitting out in the yard when they were released from their bonds. As soon as Wright took his pipe out of his mouth, he made a bolt and escaped from the yard. The matter was investigated, and as a result, Sergeant O'Neill was released to the custody of Const. Watts.\n\nCharles Steenman, in charge of the ox-hay team at Stood Off, met with what might have been a fatal accident while on his way to Macleod.\nThe four horses team he was driving ran away and pulled him down. His head struck against the front wheel, which hit him on the ground, and the horses fell and brought the team to rest when Charlie released himself.\nFor his injuries he was badly cut, though he received no serious or permanent injuries.\n\nCALGARY.\n\nFrom the Tribune, Nov. 7.\nLast week a court martial with match set for to see something in the Palace hotel, but fortunately it was discovered before it was too late.\nHalf-breed are packing out on an average 300 pounds of meat per day from their camps close to the line to Aamodot. Most of it comes out by the Northern Pacific. The cow are valued at $100 per ton. Mr. Wright will probably about the same price for his herd's claims.\nFriday night was 6 o'clock the firemen were called out to put out an alarm and in a few minutes the whole town was on the streets to find out where the fire was. In a short time the fire was extinguished, but the firemen could not get at the fire, and on further inquiry it was found to be caused by Mr. Wright's cow.\nThe firemen, ten in number, were paid $200 and was soon completely demolished. Mr. Wright's losses will be about $500 on his herd's claims.\nAll kinds of Woolen goods for ladies and children. Our Dress Goods and Flannel are the best value in the market. They are cheap and well worth buying.\nCall and examine our stock.\n\nONE MORE Great Clearing Sale.\n\nNot to be missed! A wonderful sale!\nThe wise and sagacious buyer has come to realize that the best time to buy is now and the good hearted and spirited the best time to sell. Hurry, hurry, hurry, and now they too are the happy possessors of some of our prizes.\nDon't be late, come in now! Echo, ans where?\nThere will be a grand Clearing Sale of every dollar worth buying.\nHonor Bright the monuments are magnificently and true.\nDon't be late, come in now! Hurry, hurry, hurry.\nNow one way of conducing an honest business.\nOne dollar, in plain figures. Goods exchanged or money returned. Goods bought that they are. This league given.\n\nW. R. FISH'S CENTRAL STORE\n\nPaine's Celery Compound\n\nCURES Nervous Prostration, Nervous Weakness, Neuralgia, Nervous Diseases, Rheumatism, Dyspepsia, and all Disorders of the Kidneys.\n\nWEAK NERVES\n\nPaine's Celery Compound is a Rare Tonics and Stimulants. It is a powerful nerve tonic. These wonderful stimulants is splendid for all nervous complaints.\n\nRHEUMATISM\n\nPaine's Celery Compound purifies the blood, removes the causes which produce inflammation, and restores the blood vessels to their normal condition.\n\nKIDNEY COMPLAINTS\n\nPaine's Celery Compound quickly restores the kidneys to perfect health. The compound, makes it the best remedy for kidney troubles.\n\nDYSPEPSIA\n\nThis article strengthens the stomach and helps the nerves of the digestive system.\n\nCONSTIPATION\n\nThis article is a natural laxative very easy and natural to the bowels. Regularity surely follows.\n\nRecommended by physicians and business men.\n\nPrice $1.00. Sold by all Drug Stores.\n\nMELLIS, ROBINSON & CO., Prop'ts\nMontreal, P. C.\n\nSOOTHING, CLEANSING, HEALING, CATARRH, Cold in Head, Hay Fever.\n\nEASY TO USE.\n\nCATARRH\n\nDropplings from the throat and nose, sold in small boxes. Sold by all Drug Stores.\n\nFULFORD & CO., Brockville, Ont.\n\nA Dead Drop!\n\nON PRICES\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ.M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL (LIMITED)\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\nTHE LAST RITES.\n\nIt is with deep regret that we have to announce the death of Mr. George A. Miller, one of our most esteemed and re-\nspected citizens. About four weeks ago he was taken ill with an infectious fever which finally developed into ty-\nphoid. No fears were entertained of his recovery, but unfortunately when from a slight draft he took a re-\nlapse and presently set in and although his physicians had been unable to save his sufferings, yet in Sabbath morning \nlast at about six o’clock he passed over to join the great majority. Mr. Miller was one of the first settlers to this settlement, to which he came a number of years ago and took up a homestead a few miles from here. He owned considerable property in the east-\nern part of the town where he resided for past thirty-three years and still followed the avocation of a farmer. He took a deep interest in all matters per-\ntaining to the welfare of the town and his death was chairman of the Board of Trustees Prince Albert East End Public \nSchool. In religion he was devout and constant member and regular at \ntenant of the Presbyterian church. He was known as a kind and affectionate husband and father, a generous and obliging neighbor. He leaves be-\nhind him a wife and six children, three of whom are now living. He died of typhoid fever. His body was placed in a very handsome casket, covered with a beautiful black silk shroud, and left in his office as tyler of a Masonic hall. The funeral took place on Sunday last and the deceased was buried with Masonic honors by the members of the fraternity to which he belonged as tyler of the hall. The remains of the Masonic fraternity assembled at the hall at 12:30 and were driven there to the residence of their late brother and tyler and there remained until noon at which a part of the beautiful and im-\npressive Masonic burial service was con-\nducted. The services were officiated \nby the late Mr. D. M. B. Rev. \nRev. Canon Fleet. At three o’clock the body was placed in the hearse and proceeded to the grave. The P.A.S. \nband, also consisting of the members of the Masonic fraternity, in full regalia; \nthen came the ladies following, followed by friends, members of the St. Andrew’s Society and friends in carriage. On arrival at the grave the coffin containing the body was placed over the grave, and the Rev. Dr. Jardine held the burial service of the Fredrickson family after which the Masonic fraternity closed their eyes and the body of their late brother lay in its last resting place. The funeral, in spite of the severe weather, was attended by a large number of friends and members of the largest—of not the largest—over \nseen in Prince Albert. We are glad that this is the first time ever that a Funeral \nor fellow citizen ever preceded on a similar occasion in this district, and it is need-\nless to say he performed his duties ad \nand well.\n\nDUCHE LAKES.\n\nMr. A. J. MacNeil, Labrador’s clerk \nhere, was married Saturday afternoon to \nMiss M. McNair, of Charlottetown. We wish them every success and prosper-\nity. He will be back in about a month.\n\nMr. A. J. Vincent, clerk of the Land \nDepartment, has been transferred from Quinton Lake to Snake Plain agency, where he arrived yesterday.\n\nSergeant Morrison, of Batesville, is in this district arranging for the return of seed \ngrain lost some time ago to settlers.\n\nBaptism occurred, and was recorded in the matter of a family, who were distin-\nguished between here and Carlton. This is needed \nvery badly, as parents are compelled to send their children away for a dis-\ntance of from five to eight miles.\n\nThe dinner on Saturday evening, Mr. Mitchell’s birthday, was most enjoyable, \na success. Special mention must be made \nof Messrs. Ambrose Fisher, Louis Martin, S. M. McCaffrey, John McKenzie, J. Kelly, Mr. J. F. Smith, and others whose \nwere highly entertaining, especially those \nby Mr. S. R. McNaughton and Mr. Fisher. We only hope Mr. Mitchell had five or \nsix birthdays in a year.\n\nAn old Indian brought in this week \none deer, one moose and two elk.\n\nMr. T. W. Smith will go on Wednes-\nday for the north end fishing expedition. He will market them in your town.\n\nGreat quantities of freight have been \npending at the port for Snake Plain \nand other points north.\n\nStuart & Co. have just got in their \nwinter goods.\n\nTHE ROADS IN THIS PART ARE VERY BAD, \nBEING NEITHER WHEELING OR SLIDING.\n\nThere is an excellent race at Carlton on \npony races. The animals were owned by \nMessrs. Smith and Bird, the latter winning by \ntwo lengths.\n\nWe understand the post will be again \nrunning on December 1st. Jack Mc-\nCaffrey will be employed on the road working night and day putting it in re-\npair, and good work may be expected.\n\nSergeant Morrison, of the N.W. Mounted \nPolice, is on the mail. He will be sta-\ntioned at Prince Albert.\n\nHORSE SHOE STORE.\n\nWe have now completed our Fall Importations, and are displaying the Or y \nFirst-class Stock of Horse Shoes, in full line. \nLadies Dress Goods, Velvets, Plushes, Lace Flouncing, \nManilas, Wraps, Underclothing etc. \nMen’s Fur Coats, Caps, Ulsters. Underclothing, \nGloves, Mitts, Mocassins, etc., etc. \nBoys’ Overcoats, Caps, Top Shirts, Underwear, etc. \nAlso Boots, Shoes and Moccasins for the millions, that we intend for the next \nChristmas. We also have a large assortment of Ladies’ Finest Kid Boots, $3 50; Heavy Felt Skating Boots, $1 55; \nMen’s Cordovan Boots, $3 50; Arctic Overshoes, $3; Felt Sox, 75c. \nGutter Robes, Whips, Belts, Horse Bags, etc.\n\nWe have always on hand a First-class Stock of Groceries, not to be had in \nany other store in town. Fresh Butter and Eggs always on hand.\n\nTHOS. O. DAVIS.\n\nTHE GLOBE Christmas \nNUMBER \nREADY FIRST WEEK IN DECEMBER, \nA GREAT HOLIDAY PAPER \nNew Type, New Press, Fine Paper, Five Hundred Lithographic Plates, First-Class Illustrations, Original Matter \nand Superior Workmanship. \nTHE BEST XMAS PAPER EVER ISSUED IN CANADA.\n\nTHE LITERARY MATTER in the CHRISTMAS GLOVE will be entirely original \nand will include stories from the able pen in Canada. The subject treated \nbeing “The Caribou.”\n\nFIVE HUNDRED LITHOGRAPHS PLATES accompany the paper, the principal \none being a scene from Vancouver Park, B.C., from a painting by Mr. L. R. O’Neill.\n\nMECHANICALLY THE XMAS GLOVE will be in every way first-class and no \nexpense will be spared in having it surpass anything of the kind heretofore \npublished in Canada.\n\nAS THE DEMAND will be very great, we would advise immediate purchases \nto lessen the crowd at their head-quarters and avoid disappointment.\n\nTHE WEEKLY GLOVE, the best family newspaper in Canada, \nand THE RURAL CANADIAN, the best agricultural \npaper in Canada.\n\nRUSSELL & DAVIS\n\nWHOLESALE AND RETAIL\n\nButchers\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham and\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nDonaldson & Pembridge.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nAT T. J. Campbell’s New Store.\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKEPT CONSTANTLY ON HAND,\n\nREPAIRING PROMPTLY ATTENDED TO.\n\nNEILSON & McBEATH\n\nBOOK STORE.\n\nVICTORIA\n\nLivery and Boarding Stables,\n\nBetween Johnson’s and Campbell’s Stores.\n\nHaving enlarged our premises to double their original size, we shall respectfully \ncall the attention of the travelling public to \nthis arrangement immediately.\n\nWell and river water almost at the door.\n\nWe are now able to make fresh hams for \nour well known list of customers, and the \npublic can depend on getting on good a \nham as ever came out of Windsor, at \nan reasonable price.\n\nBusiness taken at reasonable prices.\n\nN.B.—Our rigs are new, and not liable to \nbreakdown.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888112301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 4475, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2612, 2], [2612, 10307, 3], [10307, 17920, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]