[{"id": "c26b34becf7ea29cc4b6d91885dbdb476305a445", "text": "What whoppers some of the Canadian correspondents send to the United States. There is an unusually big one going out the rounds just now. It is said that Mr. Gladstone's Tacheverism was smashed in Toronto and that a mob of Young British broke the windows of the hotel in which his Eminence was being banqueting. And the police came called, and the mob fled, and it is stated that St. Michael's Palace, the residence of Archbishop Lynch, would be attacked. All this is, of course, new to Canadians, but there is money in it for the imaginative correspondent.\n\nThe Scotch yacht having failed to win the America cup and carry it back to the old country, an Irish yacht has been constructed in Canada, it cannot succeed where the Scotch yacht failed. It is conceded on all hands that the Scotch yacht did the best it could. Its failure to win the cup is owing to its construction rather than to its way in sailing; it was handled, the Irish have established the superiority of the centre board where speed is the object sought. The yacht which is probably the best is being of Irish design, to be built in Ireland and sailed by an Irish crew. Under these circumstances it must be admitted that it will be sufficiently Irish to satisfy the greatest lover of the sea and will be found on either side of the Atlantic coast. Our American cousins are planning themselves on the fact that they are able to turn out yachts which run away from their Scotch competitors. Perhaps they will not be able to run away from the Irish ones. An Irish yacht would arouse a great deal of enthusiasm in the United States, where there are so many Irishmen, but enthusiasm would not fill the void, and the Irishman would need the proper system it need hardly cross the Atlantic to compete against the fast sailing yachts to be found over here.\n\nIt looks as if matters in Ireland were approaching a crisis. Mr. Gladstone is vigorously denouncing the Government for enforcing the Crimes Act and is championing the Irish cause with great zeal, even going so far as to attack the police. He has been obliged to use his authority set them to do. But despite Mr. Gladstone's vigorous denunciations the Government seems determined to continue in the line it has taken up for itself, the purpose of which is to make the Irish question to be raised by the Executive or the National League. Whatever people's opinion on the abstract question of home rule may be, there certainly is a difference of opinion in regard to this type of Executive. To enforce the laws passed by parliament for the express purpose of governing the Green Isle. Mr. Gladstone describes the present system as \"Irish Government\" by the word \"imperative,\" which he declares to be the only one by which it can be described. No doubt every law on the statute book is looked upon as an impermanence by those who desire it to be repealed, but as the law affecting Ireland were passed by the same authority as the laws affecting England or Scotland, it is hard to see where the impermanence lies. With Mr. Gladstone pushing the question forward and the Government driving them back, it is not at all surprising that occasional collisions should take place. There are those who are looking forward with no little apprehension to seeing something much more serious occur.\n\nThe Toronto Telegram says that in defending that Canada could only have considered itself independent of the United States at the close of separation from Great Britain, Mr. Champlain evidently not only said what he meant but meant what he said. As a result of the arrangement between the colonies and the mother country is only a temporary one and cannot remain as it is; either it will be strengthened by ties of federation or loosened altogether. Until it is strengthened, Canada can not be permitted to make a trade arrangement with the United States of the character proposed, for \"it is impossible that Great Britain should retain all the responsibilities and obligations of the colonial connection when all the advantages are taken away.\" From the British point of view this seems fair enough. In the event of Canada becoming involved in difficulty with any other country Britain would not be able to offer protection. The only nation that Canada could possibly have trouble with is the United States. It would be asking a good deal of the British Government to Canada to expect her to take on the cudgels on her behalf after entering into a bargain with the United States to shut the door against British goods coming to this continent. It is clear that this scheme is not Mr. Champlain's idea, when Sir John Macdonald pronounced against commercial union, which he is sure to do, he will have the British Government at his back, and will thus be able to hold his own and keep the old flag flying.\n\nANNUAL SCHOOL MEETING.\n\nELECTION OF TRUSTEES, ETC.\n\nThe annual school meeting of School District No. 3 was held on Tuesday last in the new school building.\n\nThe various reports were read and adopted, when the election for trustees took place.\n\nThe following were nominated:\n\nJ. F. Beattie, J. M. Campbell, T. O. Davis, J. L. Johnson, John Stewart, James Macfarlane and W. J. Carter, trustees; Robert Johnson and Macfarlane, deputies. The poll demanded, the vote at 4 p.m., stood:\n\nJ. M. Campbell ........... 38\nJ. F. Beattie ............. 39\nT. O. Davis .................. 34\nW. J. Carter ............... 27\n\nThus the Board of Trustees for the current year will be Messrs. Campbell, Beattie, Davis and Carter.\n\nWhile congratulating those gentlemen upon the honor conferred upon them, we would remind them that they have a very important position to fill. The sustaining of an efficient school is one of the greatest assets that can be possessed by any community, and it is to be hoped the same deep interest that has been taken in the school by the old Board of Trustees will not lessen in those who have been appointed to fill their positions.\n\nThe old Board of Trustees deserves the hearty thanks of every citizen for the excellence to which the school has attained under their management, and more particularly of the very handsome building they have left as a monument of their term of office.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 10 Service St., New York.\n\nTHE SUN!\n\nDAILY AND WEEKLY.\n\nIndependent in Politics.\n\nThe Leading and Popular Paper of the CANADIAN NORTHWEST.\n\nHas a Circulation Greater than the Combined Circulations of all Other Winnipeg Newspapers, and is Recognized as the Great Advertising Medium.\n\nSUBSCRIPTION PRICE\n\nDaily or monthly, $1 per Year. $10.00\n\nWeekly 6 months, $5.00\n\nAdvertising rates moderate, and publish in every issue of Daily and Weekly.\n\nAddress\n\n\"The Sun,\" Winnipeg.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNon's Veiling in Cream and Light Shades, Persian Porter Rugs, Tapestry Carpets, Crimson Rayon, Window Holands in Slate and Yellow, Door Mats, Crumb Cloths, Silk Corded Cloakings, \"Empress\" Cloth Back and Garnet, Ladies' Felt and Embroidered Petticoats, Ladies' Fancy Frillings, Breezy Veiling, Ladies' Silk Ties, Tinsel, etc., etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confections, Biscuits, Figs, Dates and Tinted Goods of all kinds. Inspection is solicited.\n\nMAGNIFICENT ARRAY!\n\nOF\n\nCOSTLY AND HANDSOME PRIZES\n\nGIVEN AWAY WITH THE\n\nManitoba Weekly Free Press\n\nCANADA'S MAMMOTH PAPER.\n\nThe Great Family Newspaper of the Canadian North West.\n\n1887 - CAMPAIGN - 1888\n\nSixteenth Year of Publication.\n\nOnly $2.00 Worth of Splendid Prizes Given FREE to Subscribers\n\nSelf Binders, Mowers, Splendid Delecta Organ, Sewing Machines, Watches, Beach Bowling Cans, Stoves, etc.\n\nBALANCE OF 1887 FREE.\n\nONLY $2.00 TO 1889.\n\nSee the Grand Prize List in the Weekly Free Press.\n\nFREE PRESS, WINNIPEG, MAN.\nREGINA.\n\nFrom the Leader, Oct. 29.\n\nThe North-West Committee gave a big dinner at the Hotel Chamber on Friday night, Oct. 28.\n\nOwen H. Hughes, Esq., M.P., W.C., of Prince Albert, was present at the dinner.\n\nThe committee has now completed its work and will be disbanded shortly.\n\nCALGARY.\n\nFrom the Herald, Oct. 22.\n\nA force of police has been sent out to investigate the cause of the fire in the town hall. It is thought that a large amount of hay has been burned.\n\nCalgary has been thrown into a state of confusion by the recent events. The police have been called upon to maintain order and the public are being warned against panic.\n\nThe government has promised to send troops to assist in maintaining order.\n\nEDMONTON.\n\nFrom the Bulletin, Sept.\n\nJudge Redman is expected to be here next Monday.\n\nThe government has decided to remove the Lethbridge detachment.\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETTY.\nPublisher and Proprietor.\n\nHURRAH!\n\nFOR THE\nQUEEN'S JUBILEE!!\n\nTHE\nVICTORIA\nSale and Feed Stables\n\nHave just got in their\nNew Rigs and Fresh Horses\n\nAnd the public invited to come and see them.\n\nFIRSTCLASS TURNOOUT\n\nAt reasonable prices.\n\nA reliable man in attendance day and night.\n\nTelephone—No. 599.\n\nStable-No. 6 River & Rabbit Sts.\n\nNEILSON & McBEATH\n\nPRINCE ALBERT\n\nBREWERY\n\nPure and Sparkling\n\nAMBER—(Hop)—ALE.\n\nDelivered to all Parts of the Town.\n\nMOORE & MACDOWALL\n\nDRY LUMBER.\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., $42\nDressed Siding, $48\nUndressed do., $42\nSheeting, $30\nCommon Lumber, $35\nDimension do., $40\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings at cheap rates.\n\nAny firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nGENERAL NEWS.\n\nNo change in the Northwest or Maine governmentship till or unless until next May at the earliest, as the Govern- ment considers the continuance of the present government a necessity at such an unpleasant season of the year.\n\nA delegation to Lieut. Gov. Dewdney as Indian Commissioner has not been considered.\n\nAlex. Begg has left for Southland to promote cattle emigration to the Pacific coast.\n\nSixteen of the riflemen who won first places have already agreed to go to Winnipeg.\n\nHon. Wm. McDougall will probably address the inter-provincial conference here to-morrow.\n\nThe Department of Justice is seeking the extradition of W. K. Horey, now in custody in St. Paul, Minn., for forgery at Regina.\n\nIt is understood that J. H. Rolland, paper manufacturer, of Montreal, will be appointed to succeed the late Mr. Seaman in the Senate.\n\nSir Charles Tupper is busy engaged in arranging his work for the fisheries commission.\n\nThe order to move the contingents from A and B batteries to British Columbia, which was sent forth last week, will probably be postponed this week.\n\nThe vacancy thus caused in A and B batteries will be filled as soon as possible; in fact, the necessary personnel is now being enlisted for the period of three years.\n\nThe greater part of a day was taken up at the provincial conference in the discussion of the disunion question.\n\nMayor J. M. L. Macdonald of Mani- toba delivered addresses on the disunionism of Manitoba railways.\n\nA general strike was declared by all other kindred societies.\n\nNo conditions as yet have been made.\n\nTwo hundred armed students started on a journey to Montreal and attempted to sack a police station where they thought out their aims would beimple- mented.\n\nBut when they were met by the police, they marched into another station, where they reached him. The police were dispersed.\n\nThe salute of God, belonging to Buff- lo, went ashore near Port Hawkesbury, and was landed there. The news was received.\n\nThe cook, a woman, was lashed to the mast and perished.\n\nHon. Mr. McLeary made a strong campaign against the Government. His triumphs are certain.\n\nEx Premier Prue was nomi- nated, but he declined to lend himself to the movement.\n\nMr. Prue is now Canada's representative on the Railway commission.\n\nThe Montreal Waterpower company says that the Red River road has been handed to private hands, but believes the time will come when the Government will have to take control of it.\n\nIn Quebec a mysterious murder was discovered. William Brown was found dead on a chair cut in several places. There is no sign as yet to the murderer's identity.\n\nMr. Henry Carling, M.P.P., Ren- county, was robbed of $400 by a burglar, who broke open his safe.\n\nThe Western Valley Railway Company will pay a dividend of $100,000 to ten dollar shares, has been incorpor- ated.\n\nGladiators are suffering from a bad cold, and is confined to his bed. He is also suffering from excessive fatigue super- added to the exertions of the past few days and the many speeches made by him in that time.\n\nA delegation of Scotch housewives visited Dublin, and were received by Lord Mayor Salves at the Imperial hotel. Reception were not admitted.\n\nThe Irish housewives are gathering in vast crowds, but the utmost good order prevailed.\n\nThomas J. Conolly, M.P. for Tay- rary, and a prominent member of the league, was arrested at Mitchelstown for inciting the crowd to violence.\n\nLondon, Oct. 25.—Several thousand unemployed men marched in a body from Town Hall square to Westminster Abbey this afternoon, carrying a red flag. Twelve hundred of them were ad- mitted without opposition. The red flag was held aloft, and the marchers kept their hats off, whistled and sang upon the platforms of the statues. Others joined with the regular audience but the greater portion of the latter departed as soon as possible, leaving the strangers most welcome. The unwelcome visitors offered no violence, but showed disregard for the laws of public order.\n\nThe conduct of the marchers was orderly, expecting, etc. During the first few hours they grew louder and louder, until the crowd dispersed in confusion. This conduct was repeated at the second hour.\n\nAll wood Planks, 30c. a pack, regular price, 50c.\n\nWanted—A Porter has again left town. He went east by special conveyance last Thursday, and will pro- bably make his old home in Nova Scotia before returning.\n\nJudge Taylor of Winnipeg has been appointed the Chief Justice of the new province of the Child Justice Wall- bridge. The names of H. M. Howell and J. A. M. Atkin are favorably men- tioned as likely to fill the vacancy caused by Judge Taylor's elevation.\n\nROYAL\n\nBAKING POWDER\n\nAbsolutely Pure.\n\nThis powder contains a large amount of wheat flour and wholesome ingredients. It is the best known and most used of its kind. Every weight contains 100 grams of pure flour.\n\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods.\n\nDress Goods\n\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nVelvets, Satins, Ribbons,\n\nAll Prices and Singles.\n\nLADIES', MISSES AND CHILDREN'S Wool Hoods and Clouds\n\nIN ENDLESS VARIETY.\n\nReady Made Clothing\n\nOF THE LATEST STYLES.\n\nGENTLEMEN'S Fancy Underclothing\n\nAT PLAIN PRICES.\n\nBoots and Shoes\n\nAND THE FINEST ASSORTMENT OF Mitts and Moccasins\n\nIN THE TOWN.\n\nGlass and Crockery\n\nA LARGE STOCK OF\n\nJUST RECEIVED.\n\nFLOUR!\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nSEARCH\n\nR. C. WIGMORE & CO.'S.\n\nFOR\n\nReady-made Clothing,\n\nDry Goods,\n\nGroceries.\n\nALL LINES EXPOSED\n\nThe Cheapest Cash Store IN TOWN.\n\n1879.\n\nBuffalo Hall!\n\nTO HAND THIS WEEK:\n\nElegant Jerseys and Jersey Jackets.\n\nBlack and Polka Dot Shawls.\n\nBlack and Colored Shawls.\n\nWool Fringes and Garters.\n\nFur Caps and Jackets.\n\nFurnaces, Crate and Lace Curtains,\n\nCurtains—Best materials only.\n\nTapir Table Covers.\n\nAnd a Long List of Men's Fur Caps.\n\nNew open and ready for inspection.\n\nBETTS & Gwynne.\n\nESTABLISHED: 1879.\n\nUPRIGHT AND BOX\n\nHeating Stoves\n\nFrom the Plainest to the Most Elaborate Design.\n\nHeating Drums\n\nIn Great Variety.\n\nAmerican Coal Oil\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\n\nTrowsering and Overcoating\n\nWORSTEDES,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887110401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4011, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7980, 2], [7980, 10128, 3], [10128, 16652, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]