[{"id": "a9c6d1d199d2328452abc1bc94e79edbbc635327", "text": "THE NOMINATIONS.\n\nThe nominations for the Town Council for the ensuing year were held in the Council Chamber on the 25th inst., from 9 o'clock till 12 noon. A copy of the proceedings was printed in the election papers handed to all voters at the polls.\n\nDr. Bain, nominated by T. N. Campbell and seconded by J. F. Betts.\nMr. Thos. Knowles, by J. O. Davis and A. L. Sifton.\n\nELECTION RESULTS.\n\nWard No. I.—L. J. McPhail, nominated by E. Dooner and seconded by H. B. Macdonald.\nJoseph Courtney, by T. O. Davis and R. C. Wigmore.\nWard No. II.—J. L. Johnson, nominated by W. J. Macdonald and seconded by W. J. Carter.\nT. E. Baker, by J. D. Maveety and W. Drain.\nJim Knowles, by J. F. Betts and Jas. Sinclair.\nSam. McLeod, by T. O. Davis and Jas. Macdonald.\n\nWard No. III.—R. C. Wigmore, nominated by A. L. Sifton and seconded by Harold E. Ross.\nJohn Carter, by Jas. Macdonald and W. J. Carter.\nT. O. Davis, by A. L. Goodfellow and N. A. McKenzie.\nRichard Gwynne, by Wm. J. Carter and Harold E. Ross.\nWard No. IV.—Chas. Mair, nominated by T. O. Davis and seconded by J. E. Murray.\nT. J. Agnew, by John McTaggart and James Macarthur.\nR. C. Wigmore, by Wm. J. Carter and J. D. Haasdonk.\n\nMr. Gwynne withdrew after the nominations closed, and Mr. Mair has since filled his place as Returning Officer, but he has not been signed according to the Ordinance his name should have been signed. We think it is a great mistake for electors to nominate candidates for civic honours without having given notice in part of the person's willingness to stand. If a man wishes to be a candidate let him stand himself and if not let him bring someone else forward; and if not let each ward nominate their own candidates.\n\nTHE ELECTION.\n\nThe election for mayor and councillors took place on Monday last and passed off very quietly. The contest for mayor was between Mr. McPhail, who was nominated in opposition to Dr. Bain, withdrew before the election began.\n\nIn Ward No. I, although Mr. Courtney was nominated he virtually was not in the field. The race was in that ward was over for Mr. McPhail.\n\nWard No. II was only contested. Sam. McLeod withdrew at the commencement, thus leaving the field to Mr. Joseph Courtney and David Macdonald.\n\nIn Ward No. IV Mr. Chas. Mair, with draw leaving the field to Messrs. Agnew and W. R. Gwynne and resulted in the return of Mr. Agnew by a majority of one.\n\nThe following is the result of the poll:\n\nWARD NO. I.\n\nMcPhail...16\nCourtney...10\n\nWARD NO. II.\n\nKnowles...41\nJohnson...33\nBaker...32\n\nWARD NO. III.\n\nStewart...36\nMaclean...28\nWigmore...26\n\nWARD NO. IV.\n\nAgnew...9\nGunn...9\n\nThe council for 1888 will be:\nMayor—Dr. Bain, Couns. Stewart, Agnew, McPhail, Knowles, Johnson and Davis.\n\nClearing Sale.\n\nParlor Stoves\nBox Stoves\nAcme Skates\n\nReduced ten per cent.\n\nT. J. AGNEW'S\nXMAS & NEW YEAR'S GIFTS.\n\nDressing Cases, Jewel Cases, Shaving Cases, Purses and Comb Cases, Oak Cases, Glove and Handkerchief Cases, Writing Cases, Card Cases, Poker Cases, Whist Cases, Photo Frames, Wallet Pockets, Match Receptacles, Ladies' Companions, Key Rings, Handkerchiefs, Umbrellas, Umbrella Stands, Silk Stockings, Work Boxes, Shaving Tidies, Collar and Cuff Boxes, Pincushions, Trifidicate Mirrors, Fancy Mirrors, Fans, Brass Ornaments, Bible Covers, Books, Books, Books, Books, Books, Books, Dalton's Artistic Books, Sunday at Home, Leisure Hour, Chattelet, Boys Own Annual, Girls Own Annual, Indian's Magazine, The Times, various newspapers, Practical Books, Church Services, Miscellaneous Books and variety, Musical Instruments, Accordions, Concertinas, Violins, Harmonicas, Guitars, Banjos, Dominoes, Chess, Croquet, Playing Cards, Children's Games, etc., etc., etc.\n\nCALL AND MAKE YOUR SELECTIONS EARLY AT\n\nT. N. CAMPBELL'S\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n$2.50 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY\nPublisher and Proprietor.\n\nVICTORIA THE SUN!\n\nLivery and Boarding Stables\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of travelling public to their convenient location.\n\nWe have also added some fresh horses to our stable, consisting of four thoroughbreds and the public are invited to examine them at a tournament as can be had west of Winnipeg, at an extremely reasonable rate.\n\nBoarders taken at reasonable prices.\n\nN.B.—Our rigs are new, and not liable to breakage.\n\nNEILSON & McBEATH\n\nTHE SUN—Winnipeg.\nJ. M. CAMPBELL\n\nIs now receiving one of the Largest and Best Selected Stocks of Fall and Winter Goods\n\nEver yet shown in Prince Albert.\n\nDress Goods\nOf the Latest Styles, with Trimmings and Buttons to match.\n\nWincies, 10c to 40c.\nVelvets, Satins, Ribbons,\nAll Prices, and Sizes.\n\nLADIES', MISSES' AND CHILDREN'S\nWool Hoods an Clouds\nIN ENDLESS VARIETY\nReady Made Clothing\nOF THE LATEST STYLES.\nGENTLEMEN'S\nFancy Underclothing\nAT PLAIN PRICES.\n\nBoots and Shoes\nAND THE FINEST ASSORTMENT OF\nMitts and Moccasins\nIN THE TOWN.\n\nGlass and Crockery\nA LARGE STOCK OF\nFLOUR\nJUST RECEIVED.\nOats, Wheat and Barley\nBOUGHT AND SOLD.\n\nAn Inspection of Our Stock Solicited.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\nMOORE & MACDOWAL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matche, Dresse and Tarred.\n\nDressed Flooring, $48\nUndressed do., $42\nDressed Siding, $48\nUndressed do., $30\nSheeting, $35\nCommon Lumber, Dimension do., $40\n\n\"Over 17 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWAL.\n\nFOR THE\nBest Assorted Stock\nof\nCONFECTIONERY\nGO TO\nH. M'Dougall's\nBAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. M'Dougall\n\nSASKATCHEWAN\nDIRECTORY\n\nAt the request of a number of influential citizens of Prince Albert, who desire to be informed at once about the first issue, we have been directed by the publishers to make the following announcement throughout the district setting therefor a special rate of postage of five cents per copy for the year 1885.\n\nIt is respectfully requested of the citizens of Prince Albert, and of Bathfield, an allusion to the above announcement, to send in their names as soon as possible, and post them promptly.\n\nNo pains will be spared to make the publication of this directory as complete as possible, and to give it the widest circulation possible.\n\nOrders for copies of Directory may be sent direct to Mr. J. Dunn or T. N. Campbell, proprietors of the Prince Albert Times, or to any person who has not sent in their addresses, will please do so immediately.\n\nThose who have already sent in their names are requested to contribute articles descriptive of the various localities included in the directory, and also to send in their names as soon as possible.\n\nThe publication will be inserted at the rate of five cents per copy, and subscription price to advertisers will be thirty-five cents per year.\n\nH. T. MacDougall\nPrince Albert, Sask.\n\nREAD, READ.\n\nThe North West Farmer will be mailed to new subscribers, from now to December 31st, 1885, for the regular yearly subscription of twenty-five cents. Subscribers, when renewing, will be marked up to date.\n\nThe publication is now in its third volume, and contains the best agricultural information in the world.\n\nThe publishers are desirous of making the North West Farmer and the North-West, both in Canada and the United States, the best Agricultural and Stock Breeding publication in the North West. It is a 34 page monthly, handsomely got up, and a thoroughly practical publication, full of valuable information in its departments, and the latest and best farming news from all over the country.\n\nThe departments are:\n\nAMONG THE FARMERS.\nContaining descriptions of the farms (stock and agricultural) visited during the past month.\n\nAGRICULTURAL SOCIETIES.\nContaining the news of the latest doings of the different agricultural societies.\n\nLIVE STOCK.\nVeterinary Department—In which veterinary practitioners will be answered free of charge by a prominent Veterinarian.\n\nThe Dairy, Poultry and Pet Stock.\nEntertainment, Milking, The Field, Gardening, Milling, The Garden and Forestry, Game and Sports, Fishing, etc., received.\n\nExchange Mart.\nWith prices, answers to questions and Answers.\n\nThe Markets.\nThe department is supplied by the best market men, who are themselves practical farmers, and who are in constant communication with the best farmers in the country.\n\nThe North West Farmer is edited by the best agricultural papers in the country, and is submitted by all to be the most reliable source of information on all facts of interest to the farmer.\n\nIt is the best guide to be had, and the cheapest and safest guide in the North West. It is the best guide to be had, and the cheapest and safest guide in the North West.\n\nHOW TO SUBSCRIBE.\nEnclose twenty-five cents for a year's subscription, and post to every place in the world.\n\nN.W. WEST FARMER.\n\nWinnipeg, Man.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888010601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 2518, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4571, 2], [4571, 9190, 3], [9190, 9190, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]