[{"id": "0b8e1181a06ff703c6ec978a844ee04d71e785c8", "text": "THE RIFLE ASSOCIATION.\n\nOn Wednesday evening last the annual meeting of the Saskatchewan Rifle Association was held in the town hall. From the large attendance of members and guests it was evident that there had been a very hopeful report of the treasurer, there being three times more interest taken in shooting than any other sport.\n\nAbout 8 p.m., the president, Mr. J. L. Johnson, called the meeting to order and explained the proceedings of the association now stands with regard to the rifles loaned by the Government, indicating that the Government would lend a bond as security. The secretary, Mr. Stephen Brewster, then read the minutes of the former meeting, and the treasurer stated that about $150.00 was on hand at about $80.00. After discussion it was decided to elect officers. We take charge of the rifles, and that the president and secretary sign the Government bond on behalf of the association.\n\nOn motion of Mr. T. J. Agnew seconded by Mr. A. R. Burns, it was decided that no ammunition be sold or issued to the men until the rifles are returned to the association. This was an important question, as it was suspected that some men had gone out shooting for purposes other than that which it was really intended.\n\nCommunications and telegrams were read and discussed, and a range of the association, being in a satisfactory shape, it was decided to make the same known to the public. The association will be our best friend, and we ask for full cooperation.\n\nMr. John Stewart, the representative in the Dominion Rifle Association, attended and addressed the association at length, congratulating the association on their success and financial standing, and explaining the benefits of such an organization.\n\nThe only business remaining was the election of officers, which resulted in the present president and secretary retaining their offices by acclamation. Those elected were:\n\nPresident—Mr. L. Johnson.\nVice President—T. F. Baker.\n2nd Vice President—R. J. Pritchard.\nSecretary—Mr. J. Agnew.\nAsst. Secretary—T. J. Agnew.\nRepresentative Member—J. Stewart.\nKneese Chair—C. J. Smith.\nWilliamson Chair—J. H. Marcy.\nJas. McKay—J. McTaggart.\nG. Gervais—H. W. Newlands.\nJ. F. A. Still—D. A. Macdonald.\nAuditors—J. Stewart—T. N. Campbell.\n\nOn motion of J. Stewart, seconded by Mr. Agnew, it was carried unanimously that the association should, in consideration of the able manner in which he performed his duty and the untiring energy he has displayed during his term of office, tender him the sum of $25. Mr. Howard accepted the money, saying that he had been very much obliged to the association very highly. After a short speech from the chair as to the benefits of the association and congratulating them on their success, the meeting adjourned.\n\nTOWN COUNCIL.\n\nThe Council met at the council chamber on Monday last. All the members were present except Coun. Davis. His Worship Mayor Bain in the chair. He asked for a report on the proceedings at the last meeting and the introduction of a by-law to regulate transient traders very little time ago. The question was principally spent in discussing technicalities, rather beneficial to the council than not. The two councillors seemed determined to retard business rather than advance it. It is a great pity that any member of the Council Board should be so much the obstructionist. Every member was elected to attend to and advance the interests of the town rather than be behind the scenes in a petty squabble, which will now go doubt continue until the end of the year. We do not want to appear too severe on the council in future. We will give credit to whom credit is due, and those who have been faithful and honest, we would like to see the business of the town done in an amiable spirit, and all questions settled fairly and promptly according to their merits.\n\nAgricultural Society.\n\nThe annual meeting of the Lewis Agricultural Society was held in the town hall Saturday afternoon. Mr. Wm. Plaxton, in the chair. After a few remarks from the president, Mr. Wm. Plaxton, the annual report was read and adopted. The Sec. Treasurer's report was also adopted.\n\nThe question of the new store being built was discussed and motion of John Stewart seconded by A. L. Sifton the election by ballot.\n\nMr. Wm. Plaxton, Mr. McKay were proposed and balloted for, and resulted in the election of Mr. McKay to the position of president.\n\nMessrs. Jas. Thompson and Wm. Macdonald were elected 1st and 2nd vice presidents respectively.\n\nMr. Howard was elected Sec. Treasurer unanimously.\n\nAfter considerable discussion the following officers were elected: Mr. Wm. Plaxton—Pres.; Messrs. Capt. Hugh, James Macintosh, Wm. Lytle, John Stewart, R. J. Pritchard—Vice Presidents; Mr. Howard—Sec.; Messrs. Capt. Craig and Macdonald to J. Agnew that a testimonial be presented to Mr. A. H. Clark, for his services during the efficient service in the past. Carried.\n\nOn motion of J. Stewart and seconded by Mr. Agnew, Mr. Wm. Plaxton, Capt. Craig, and J. Macdonald to the committee to consult with the committee on the constitution or representation, and report the same at next meeting.\n\nCarried.\n\nMotion by Capt. Craig seconded by Mr. Howard that a vote of thanks be tendered the retiring president, Mr. Wm. Plaxton, and that the name be recorded in the minutes.\n\nA vote of thanks was also tendered the retiring vice presidents, Capt. Craig and Mr. Chas. Adams, on motion of J. Stewart, seconded by Mr. Agnew.\n\nThe meeting then adjourned.\n\nGENERAL NEWS.\n\nOTTAWA, Jan. 28.—The appointment of Mr. J. E. Sparrow, Esq., P. P., as post master at Vanscoy, has been made. The Englishmen here have sent the following cablegram to Halifax, Chief Secretary: \"Englishmen here send you our hearty congratulations on your appointment as Chief Secretary between England. English and English men everywhere expect you to do your duty to the empire.\"\n\nMr. Lawrence distributed presents to the employees of the Government house today, according to usual custom.\n\nTORONTO, Jan. 29.—Yesterday the day fixed for Arch Campbell, provincial legislator, to file a notice of his position as a candidate for the seat he holds, but he did not do so and the court will compel him to do so tomorrow.\n\nThe police report showed there was a wicked plot to ruin the bank, the principal figures being Captain Macdonald, Mr. Macdonald, Cox and others. The detectives do not seem to be guilty of crime, only lackeys of the chief conspirators.\n\nMr. Macdonald, who is acknowledged his estate for the benefit of the bank, was worth $200,000, but he will not reach more than half that at the outside. Rumour has it that if he is put into protection by the court he will retire and give starting evidence as to how the bank was wrecked.\n\nTORONTO, Jan. 29.—The prosecution against the retired Montreal Halibut demand was dismissed on Saturday with costs. They got nothing, merely confirmed the verdict as they found it, and they would be successful. Dr. Montague commented on all hands.\n\nTORONTO, Jan. 29.—Halibut Redline died suddenly of heart failure. The funeral will be next Saturday.\n\nWinnipeg, Jan. 29.—The Coll case has been dropped. The charges have been answered since Confederation, as against 36 Conservatives. Eight of these cases have been dropped, while only one has been continued on the same date. We get the Conservative charge sheeted with corruption, and the Liberals boast of their party.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder contains no starch, sugar, or other foreign ingredients. It is absolutely pure and will keep indefinitely. It is sold in quantities with the substitute powders. Sold only in original packages.\n\nPRINCE ALBERT BREWERY\n\nPure and Sparkling\n\nAMBER—Hop—ALE.\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERRARD\n\nGO TO CANN'S BOOK STORE\n\nStationery,\n\nSchool Books,\n\nETC., ETC.\n\nGRAND UNION LIVERY STABLE,\n\nOpposition is the Life of Trade.\n\nA First-class Livery, Food and Safe Stables.\n\nWe would like to invite the public when visiting this city to inspect our stables as they are the finest in the west.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS\n\nIn all grades, from the best materials to the commonest.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nTITLED BY\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, FEBRUARY 17, 1888.\n\nTRADE OF CANADA.\n\nThose who cast at the prosperity of the Dominion and preach that under our present fiscal policy the country is going to run down would do well to consider carefully the following table taken from the Government's navigation returns for the year ended June 30, 1887, which show that the total foreign trade of Canada for the year amounted to $204,289,647, while for the same amount was only $14,000,000, over the previous year of $14,000,000 in round numbers. The exports for 1887 exceeded those of 1886 nearly $9,000,000, while the increase in agricultural products about $5,000,000, and cattle and their products over $2,000,000. There was also a small increase in the value of fish exported, while exports of provisions of the mines and forest snow slight decrease. The total imports for the same period amounted to $12,900,000 against $16,000,000, showing an increase of over $3,000,000. Our trade with Great Britain, calculated on the basis of goods entered for consumption and exported shows an increase of $1,000,000 of $7,500,000, made up by a decrease of imports for consumption, $4,000,000; increase of exports over $1,000,000. Our trade with the United States, calculated on the same basis, shows an increase of $1,886 of very little over $1,000,000. Canada's trade with Germany and Belgium has increased largely in the last few years. In the case of Germany, Canada has had losses of fifty per cent., and in the case of Belgium eighty per cent. over the previous year. Trade has also increased to a considerable extent with China and Japan, which latter has been a slight loss off in that with the West Indies. A perusal of the above figures will show that the foreign trade of Canada is expanding in a most satisfactory way, and that the commercial relations of the Dominion are not suffering under the N.P.R. and energetic Government of Mr. Macdonald. It will also show that Great Britain and not the United States is the natural market of the country, and that the former is a more profitable market for Canada. This rapid increase in our trade underlines the prominent arguments of commercial unionists and disproves their contention as to the decline of our trade. The public accounts, which have also been published for the year ending June 30, 1887, show that the country's health is improving in all its affairs. The net rate of interest paid has been a little under three and one-fifteenth per cent. The total revenue of the year was $1,000,000, or more than $1,000,000 over the previous year, and the largest in the history of Canada, and the expenditure was $1,000,000 exceeding for the year was $1,000,000 (or $1,000,000) on account of the consolidated revenue. Besides this there was a large expenditure on capital account, still leaving a very handsome surplus in the treasury.\n\nGENERAL NEWS.\n\nOttawa, Feb. 6.—Sir John and Lady Macdonald attended the recent meeting here today. Sir John attends the first day of the session of Parliament. The Government has decided to undertake the analysis of samples of water from the principal cities of the Dominion.\n\nOttawa, Feb. 13.—The register of the Bankruptcy Court has made a new entry of Mr. Robert McMillan, of London and Toronto, upon application of Mr. James McMillan, of Toronto. Mr. McMillan's creditors presented by James McMillan, with the consent of the Trustee, for $1,000. The liabilities of the estate are $1,000.\n\nThe Imperial parliament assembled today the session was opened by the Governor General.\n\nThe trial of a second batch of Indians of the Island of Lewis, charged with the rape of a woman, continued today. The case is now in the hands of the Crown's Solicitor.\n\nHon. R. Ross of Abercorn, Dakota, visited Winnipeg this week for the purpose of purchasing a quantity of furs from the Indians and the Northwest last year. Mr. Ross wanted the game for sealing purposes, but as he could not purchase any furs he limited his stay to two days. He did not want Mr. Ross, but he admitted that he varied his diet by eating the quality grown in Dakota.\n\nThe buffalo, so prevalent in the northern part of the continent, are now being raised in the south, and they are held at the highest prices. They are now being raised in the north, and they are fast approaching when the first class buffalo skin will be more highly prized than any other. The buffalo is now becoming more likely to come into the future as a substitute for buffalo fur for the purpose of making coats, and they will sell at about the price that buffalo skins sold many years ago, when they were plentiful.\n\nBerlin, Feb. 3.—The Reichs-Jahresbericht says that Germany and Austria have declared war on Russia, and that the latter will publish the fact in the treaty alliance between the two nations, October 7th, 1879, in order to put an end to all doubts regarding the defensive character of the alliance. The Reichs-Jahresbericht goes further to say that the alliance is only to include peace on terms of equality, with the stipulation that it either shall be attacked by the other power the other will not support the aggressor. It is stated that the neutrality under Russia shall assist the aggressor, when the latter shall gain the upper hand. It is also stated that the treaty provides that the treaty being broken, it shall be kept secret in order to prevent misunderstanding, and communicated to a third power, without the consent of the contracting powers. The Reichs-Jahresbericht concludes by expressing the hope that in view of the announcement that the Czar is most likely to make, the present military preparations of Russia will not prove to be menacing to Germany or Austria and that they will be met by similar measures. However this hope should prove to be groundless, it is considered that the use of both powers to prevent the Czar that the situation will be regarded as an attack upon the other.\n\nCASH—1888—STORE\n\nEmporium of Fashion.\n\nDry Goods,\nReadymade Clothing\nUnderclothing,\nHosiery,\nBoots and Shoes,\nCrockery.\n\nAnd Other Articles too numerous to mention.\n\nSpecial Bargains in Teas for Two Weeks.\n\nTHOS. O. DAVIS.\n\nClearing Sale.\n\nALL REMAINING\n\nParlor Stoves\nAT COST\n\nBox Stoves\nREDUCED TEN PER CENT.\n\nAcme Skates\nREDUCED TEN PER CENT.\n\nT. J. AGNEW'S\n\nClearing Sale.\n\nHAVING ON HAND A LARGE STOCK OF\n\nFancy Goods and Toys\n\nWhich may be disposed of to make room for other lines, I have decided to offer the balance of\n\nThese Goods at Cost.\n\nCall early and take advantage of this offer, which will remain open until February 15th.\n\nT. N. CAMPBELL'S\nTERRITORIAL NEWS\n\nEDMONTON.\n\nA child of Dr. Gold, surgeon of the hospital, was killed while playing on the lawn Friday, partially strangulated by a dog brought into the yard by the child.\n\nLieut. Gray, Secretary of State, left for Ottawa today. He will attend the Grand Council of the North West Mounted Police at Edmonton, where he will be sworn in as the Governor's representative.\n\nOne hundred and seventy-five people attended the banquet last night. Mayor Macdonald occupied the chair and Mr. W. Smith the second vice chair. Mr. W. R. Scott sat on the right of the chairman. The banquet was a great success.\n\nFORT MACLEOD.\n\nFrom the Bulletin, Jan. 23.\n\nCecil Constance, who disappeared from the prison yard Saturday, was taken to the penitentiary for the murder of his step-mother, is back home at Leduc. He has been released on bail.\n\nThe people thought it would be unjust of the authorities to attempt to make him into custody again, as they had the opinion that he was innocent. However, it is not understood that they propose to resist should the attempt to retake him be made.\n\nH. W. SAVAGE had a narrow escape from drowning at Nippon Sunday. He was swimming in the river when he was swept away by the current. He was saved by Mr. Neal, who was fishing near by. Mr. Neal was able to save him because he had the assistance of friends on shore who got out safely.\n\nUnder the continued influence of the warm climate, which sent the water over the land, the river levels have been away very rapidly and unexpectedly. All the rivers throughout this part of the country are either entirely broken up or so swollen as to make it impossible to cross them. The 28th of January is pretty early for the rivers to break up, but Mr. Savory and Mr. Neal came on a snow sled of ice at Kipp. But the water was running over it three feet deep, and was very swift.\n\nA large number of Indians were watching and yelling into town from the Blood reserve on Monday afternoon. The Indians were very excited and agitated and disturbed over the several incidents which have been shot by white men during the past few days. There is much talk and a demonstration.\n\nWe have heard it rumored that a great meeting of the Bloods, Blackfeet and Peigan Indians will be held on this matter. It is about time for the eastern papers to get up the annual spring outbreak, and this will give them good ground to work on.\n\nLETHBRIDGE.\n\nFrom the Herald, Feb. 2.\n\nThe cricket and lawn tennis season commenced on Monday.\n\nCaptain McLean acting for the removal of the N.W.M.P. headquarters from the garrison to the town.\n\nThe Grand Lodge of Manitoba A.F. & A.M. has received permission for the formation of new lodges as Lethbridge and Athabasca.\n\nAs it was expected the crossing of the river would take place Monday the stage went down the Snake River and crossed over to the other side.\n\nMr. Ben Whitney, who has the concession at the Snake River Crossing, N.W.M.P., is announcing the disappearance of the ice, and there is little probability of persons of his ability to fulfill his contracts.\n\nCALGARY.\n\nFrom the Herald, Feb. 2.\n\nAn Oregon train carrying 160 million of eggs was captured on the Snake River west, yesterday, and spilled shortly afterwards on the banked embankment. The eggs were packed in boxes and 250 so far.\n\nA position is being hawked around town among the corporations to try to land a public contract. The city will only rent the citizens $5,000 to make the\n\nJ. M. CAMPBELL\n\nIn our yard, we offer the largest and best selection of Fall and Winter Goods.\n\nDress Goods\n\nWincies, 10c to 40c.\n\nVelvets, Satins, Ribbons,\n\nLADIES', MISSES' AND CHILDREN'S\n\nWool Hoods and Clouds\n\nReady Made Clothing\n\nFancy Underclothing\n\nBoots and Shoes\n\nMitts and Moccasins\n\nIN THE TOWN.\n\nA LARGE STOCK OF\n\nJUST RECEIVED.\n\nOats, Wheat and Barley\n\nBOUGHT AND SOLD.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed\n\nDressed Flooring, $48\n\nUndressed do., 42\n\nDressed Siding, 48\n\nUndressed do., 42\n\nSheeting, 30\n\nCommon Lumber, 35\n\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nBLUE RIBBON BINDER TWINE\n\nManufactured by The Dartmouth Ropework Co., Halifax, Nova Scotia.\n\nSUPERIOR TO ALL FARMERS SHOULD USE NO OTHER.\n\nFOR THE Best Assorted Stock of CONFECTIONERY GO TO H. MACDOUGALLS BAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MACDOUGALL\n\nSASKATCHEWAN DIRECTORY\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspapers Advert. Agents, 105 Broadway, New York.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888021701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 4951, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8400, 2], [8400, 15067, 3], [15067, 19954, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]