[{"id": "a5421a94e7b30b5583d2a83b95e354288992303a", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\n\nTENCS.—10¢ per number in advance.\nSingle copies, 10 cents each.\n\nNo advertisements will appear inserted in this paper unless full payment is received in advance. No advertisements inserted for less than $5.00. All advertisements without instructions will be ignored until paid.\n\nJ. D. MAVEETY, Proprietor.\n\nTHIS PAPER may be found on\nNEWTON'S NEWSPAPER ADVERTISING\nAGENCY, PRINCE ALBERT, N.W.T.\n\nNEW YORK\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—Rev. Lawrence McVey, P.P.\nSt. Anne's, Catholic.\n12 noon—Rev. Canon Plott, R.D.\nSt. Paul's.\n3 p.m.—Rev. Canon Plott, R.D.\nSt. Andrew's.\n3:30 p.m.—Rev. E. Murray.\nSt. John's.\n3 p.m.—Rev. E. Murray.\nSt. James'.\n3 p.m.—Rev. Lawrence McVey, P.P.\nSt. Anne's, Catholic.\n3:30 p.m. and 3 p.m.—Rev. Peter Andrews.\nSt. Paul's (Presbyterian).\n11 a.m. and 3 p.m.—Rev. Mr. McWilliam.\n\nFRIDAY, APRIL 30, 1886.\n\nTHE C. P. R.\n\nWe have the railway completed from ocean to ocean within five years of the time stipulated in the original contract, more than four hundred miles further than contemplated by the line of steamships upon Lake Superior, a telegraph system almost ready for public service, a line in respect of equipment, roadbed and operating services, running on the crossties, all secured without the addition of a dollar to the original subsidy. It is true that the Government has advanced to the company something less than ten million dollars, but there was no cash subsidy given in 1881, but in consideration of that subvention the country receives back nearly seven million acres of land, a property fully as valuable as the additional millions which the Canadian Pacific could or among the best in the North west, and constitute a good asset to the company as it represents. The company's credit will enable it to obtain readily all the capital required for the further development of the railway and the development of traffic, for the consummation of the important schemes contemplated in connection with Asian trade, and for the enormous feeding grounds out the Northwest. The success of the enterprise has been truly phenomenal—a brilliant vindication of the policy which had been adhered to over the work to a great extent completed and now in its completion two years earlier than was contemplated, without adding a dollar to the original subsidy.—Montreal Gazette.\n\nThe Canadian Pacific is turning out a greater financial success than was anticipated. Its standing in the markets of the world has been greatly improved, it is repaying much of the money borrowed from the Dominion Government, and in more ways than one is disappointing the predictions of the pessimists. It is not now commonly stated, as was once the case, that the company will not be able to pay its debts, but will fall into the hands of the Government. On the contrary, it is being more and more regarded in the light of a commercial enterprise, and its readiness to make returns or trade in such a manner as to indicate that it is to be a formidable competitor to any existing line with whose interests it clashesthe confidence that has been in spite of the road still steadily rising. In the face of the tremendous difficulties of lands placed by the company on the London markets was readily taken up, the applications coming in from all quarters, the amount subscribed for. This exhibition of confidence should be gratifying to all Canadians, for the reason that lands in the road necessarily means lands in the country. Capitalists feeling assured of the future prosperity of Canada, and more particularly of the northwestern portion of it, there is justification for supposing that the possibilities before us are being in sufficiently appreciated. The Great Western Railway project and Canadian investments and Canadian prosperity will be the result.\n\nA further indication of the success of the Canadian Pacific is that the Hudson's Bay project is being put on an equally hopeful footing, so that there is reasonable expectation of success. In any event, the progress of the negotiations will be watched with interest, in the closest hope that a favorable conclusion will soon be reached.\n\nEMMANUEL COLLEGE.\n\nHis Lordship, the Bishop of Saskatchewan, is making arrangements for carrying on the work of Indian training at Emmanuel College on a larger scale than has hitherto been attempted. Up to this time the Indian students have been in training only for mission work, and their numbers have been small; but it is now proposed to train as large a number of Indians as possible not only in the ordinary English branches, but in the elements of chemistry, especially the application of farm manure and agriculture. The College possesses a very good chemical laboratory, and for the last four months lectures on chemistry have been delivered daily and experiments performed. The pupils are taught how plants grow, what substances in the soil and atmosphere form their food—how different kinds of crops withdraw from the soil different constituents or different proportions of the same substances, and how therefore the soil becomes impoverished and in need of replenishment from manure—how especially ordinary farm manure ought to be treated and kept to preserve its value, and how to use it in full fertilizing, and generally whatever relates to intelligent cultivation of the soil.\n\nThe College possesses two hundred acres of the best farming land near Prince Albert, being well adapted for farming and gardening, and the pupils may have practical outdoor training in addition to that of the class-room. Indians will be trained in the art with the view, in some cases, of their becoming intelligent farmers, and in others acting as schoolmasters to Indian children on the reserves.\n\nThe Bishop has received a most encouraging letter from the Marquis of Lansdowne, Governor-General of Canada, in which His Excellency warmly approves of training Indian students in agricultural chemistry in the way proposed, and expresses his desire to help in the carrying out of the plan. He also states his intention of giving prizes to the most deserving Indian pupils.\n\nGreat arrangements to the work of Emmanuel College have been received during the past week. The Hon. Lawrence Clark of Prince Albert, has sent a draft for seven hundred dollars toward the endowment fund, by effect of the Hon. Hudson's Bay Company and two of the sons of the late William McKay, Esq., H. B. C. Factor at Fort Pitt, for a testimonial to the Bishop, and to assist him in obtaining the funds necessary to purchase the land and to erect a building for the college, and the interest to form a substantial ship to be given to a deserving Indian student, to aid him in obtaining higher education at Emmanuel College, the school to be known as \"The William McKay Scholar.\"\n\nThe Bishop having thus plans for extended Indian work before him, has written to the Bishop of Prince Albert, that gentleman having done so much for the advancement of the Indians by promoting the immediate gift of a large and valuable piece of land adjoining the College premises. The Mayor of Prince Albert, The Hon. Mr. Esq., has also started his donation of being helpful in the scheme.\n\nBISHOP OF SASKATCHEWAN.\n\nHis Lordship the Bishop proposes to hold Easter Sunday at St. Mary's as the morning, and to the Mission Chapel in the evening. As has frequently been the case of late, there were not seats enough in the Chapel for the people who came to hear His Lordship's message. The capacity of the Chapel was 250, at the Chapel 244 50 including 50 given on Monday by the Bishop to Mr. Commissary Mr. Massa to add to the collection.\n\nOn Sunday morning next, 2nd May, the Bishop will hold an Ordeal and Confirmation at St. Mary's Church, South Bay Street, and the following day, May 3rd, will be the twenty-fifth anniversary of his consecration as Bishop of Saskatchewan.\n\nST. MARY'S CHURCH.\n\nThe annual Easter meeting of the congregation at St. Mary's was held on the evening of Easter Monday. His Lordship the Bishop of Saskatchewan being in the chair. A new vestry was appointed, the Mayor of Prince Albert, Thomas McKay, Esq., being elected chairman.\n\nA resolution was passed by motion of the Mayor that a subscription list be opened to obtain funds sufficient to pay Mr. Massa's fees for providing the church. The Bishop said he would supply two hundred dollars towards the object. The Mayor was elected as delegate to the Synod of the Diocese of Saskatchewan.\n\nTHE TIMES is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, FULLISHER AND PROPRIETOR\n3RD ST., PRINCE ALBERT, SASK.\n\nC. D. NUKHICHAVES,\nWatchmaker and Jeweller,\nALT N Campbell's New Store\n\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery\nKEPT CONSTANTLY ON HAND\n\nRepairing Promptly Attended To\n\nNOTICE.\n\nAll parties indebted to the Hudson's Bay Company are requested to call and settle their accounts before the last day of May 1886. After that date all accounts unpaid will be placed in the hands of our Solicitors for collection.\n\nGEO. B. DAVIDSON,\n\nHardware and Tinware.\n\nSee what $1 Cash will Buy:\n\n5 Milk Pans, 5 lengths Stove Pipe 9 pounds Shot,\n6 pounds k.p.a. 4 boxes Axle Grease.\n\nCoal Oil 75c gallon,\nBreak Ploughs $25,\nBaths, from $3 to $3.\n\nUntil further notice I will sell all hardware retailed here by men not in the hardware business at cost\nAs we make up all our Time-wear, we can sell lower than any house in town. See our prices before purchasing elsewhere\nEverything done on short notice.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nTHOS. POWERS,\nis prepared to take\nCONTRACTS\nfor\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nBrick and Lime always on hand.\n\nNotice.\n\nAll parties indebted to the Hudson's Bay Company are requested to call and settle their accounts before the last day of May 1886. After that date all accounts unpaid will be placed in the hands of our Solicitors for collection.\n\nGEO. B. DAVIDSON,\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES\nFOR\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinens, etc.\n\nGO TO\n\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMEGGE & MACDOWALL\nFACTS ABOUT WHEAT.\n\nDuring the present session of the U.S. Congress, the Senate passed a resolution calling the Secretary of State to report to the Senate the information received from foreign countries concerning the United States and foreign countries in regard to Mr. Haywood, in reply.\n\nThe conclusion to be drawn from the statement collected by our own agents in Europe, Russia excepted, is that wheat will be plentiful in the present market, and may even decline. In Europe, Russia excepted, there is a considerable surplus of foreign wheat for the needs of the population, and these needs become less each year.\n\nThird—Russia and India are active competitors of the United States only under favorable circumstances, but not under unfavorable ones. If they are capable of greatly increasing their exports, the situation is not calculated to develop further competition.\n\nFourth—The South American countries prove to be the most dangerous competitors, that the wheat trade will meet in the wheat markets of the world, but in their present undeveloped state, they cannot be considered as a menace to those markets.\n\nFifth—While these new countries are not yet in a position to compete, they are occupied, and capable of being devoted to wheat culture at a cost that is little more than the cost of cultivation, an abundant supply of wheat at the world's needs, and with favorable harvests preceding, will be assured.\n\nSixth—Hostile tariffs of wheat consuming countries have practically made Great Britain a neutral power for what has resulted in prices lower than have been paid for more than a century in a market which controls prices for the world.\n\nSeventh—The influences tending to maintain low prices are more active than those which would, if exchanged, result in higher prices.\n\nThe population of Europe is increasing rapidly, while that of India is still in the stage of development. The increase of wheat in Europe is being met by the importation of foreign wheat, which will be needed to feed its population. The consumption of wheat has been increasing steadily during the last ten years as the basis for the average European, except Russia, and the British Empire, which consume about 12,000,000 tons of wheat annually. This deficiency in the supply is made good by the consumption of Russian, Indian, Australian, and New Zealand wheat, and with so many competing markets to draw from, each has varied from year to year.\n\nThe laws of trade as well as under artificial influences imposed by the governments of the nations importing foreign wheat are likely to decline in volume. The large exports in the past few years have been due to the comparative cheapness of the country, while the methods of agriculture are such as to make it certain that the wheat grown with other countries cannot be imported. India is regarded as unable to maintain a competition with the United States.\n\nTHE GREATEST CLOCK IN THE WORLD.\n\nThe famous clock of Strasbourg is put completely into the shade by the great Paris clock, or the \"Gros Horloge,\" indicating the time by means of a figure, during many years' labor, by Mr. Christian Martin, clockmaker. The clock is worked by人力and gravity, and will run for a hundred centuries, when its mechanic work will have to be changed. The clock is 36 feet high, 10 feet square, and has a number of dials and little niches where 12 little figures are constantly moving. These latter are to allegorically show life, death, a minute a sorrowful looking angel sits in a dark alcove, holding a lamp. Which has done this fifteen times another angel in a red robe strikes the first quarter. The Genius shows a fine Louis XIV costume, and a child appears at the figure shown. At the same time the figure of the child appears at a lower door. At the second quarter the Genius shows the third a middle aged man with spectacles and a high hat, and at the fourth a decrepit old man with a long beard. While all this is going on below, Death, in the shape of a Cossackish Indian with\n\nTERRITORIAL NEWS.\n\nQUAPPELLE.\n\nFrom the Progress.\n\nBuilding lively.\n\nEncouraging rains.\n\nA heavy fall of snow and sleet west-west for the Indian Department on Wednesday.\n\nNow our business places have just opened. A complaint with the Town is talked of.\n\nThe prospect for the change in the market between the C. P. R. and the northern settlements are very dry growing more slender. We have very little to show for the crops raised in what has died out. We have, however, learned that difficulties in the way of the Post Inspector for the Northwest, has reported against the proposed change, and says that if the change is made, the matter will be referred to Prince Albert and Belvedere than at present, there will be no change.\n\nFORT MACLEOD.\n\nFrom the Gazette.\n\nA couple of men deserted from this place last week.\n\nWork in the mines at Lethbridge was recommenced Tuesday last.\n\nThere was quite a heavy shower of rain and snow last night, and another heavy fall this morning. It was much needed. Day is decidedly cooler, and the wind is blowing a strong, cold, thickening cloud.\n\nA large number of the Ojibway Indians have been seen near the Old Man River last week, probably to escape from the fire.\n\nIt is said that a large number of calves were caught in the fires across the river, and perished.\n\nRange hands say the Frontier Creeks have been very poor this spring.\n\nThe country east burned has not been burned over before for several years.\n\nEDMONTON.\n\nCattle all out.\n\nCow beginning to open opposite the town.\n\nWater began to run on the ice of the river on Sunday last.\n\nLetters postally have been applied for on behalf of a lumber company.\n\nJack Levy of the mining scene is reported at Calgary on his way to Edmonton.\n\nThe Stephen's Cow River settlement was visited on Wednesday.\n\nNOTICE.\n\nSEAL TENDERS\n\nAdjudicated to The Hon. the Commissioner Regina, and sealed Tenders for Instrumental Music, to be delivered at the Indian Office, Prince Albert, up to noon Saturday, May 1st, 1886 for the erection and completion of the Band House, Regina's Band's House, Lake.\n\nTender must, in addition to the signature of the tenderer, be signed by the Agent, and delivered to the Department, for the proper purpose of acceptance.\n\nPlans and specifications may be seen at the Indian Office, Prince Albert. The Agent may be consulted accordingly.\n\nCHAS. ADAMS,\n\nActing Indian Agent,\nPrince Albert, April 29, 1886.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886043001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3999, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 10365, 2], [10365, 10949, 3], [10949, 17367, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]