[{"id": "f075f479220762e8761dafc3410943ca298d864b", "text": "WANTED.\n\nWanted a man, furnished or unfurnished, in Prince Albert, by two unmarried men. Apply at Town Office.\n\nCARD OF THANKS.\n\nI take this means to return thanks to my Prince Albert friends who contributed so generously towards my expenses. I received on the eve of my departure a large sum of money from friends in New York. It was altogether unexpected, but none the less appreciated. I believe it was given with all sincerity.\n\nA. S. STEWART.\n\nBLACKSMITHING.\n\nThe OLD RELIABLE.\n\nMcCALL BROS.,\nGeneral Blacksmiths,\nCHURCH STREET.\n\nN. W. M. POLICE\nTENDERS FOR HAY.\n\nR. B. WAY.\nCITY BILLIARD HALL.\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nGEORGE A. BENTLEY,\nBarber and Hair Dresser.\n\nJ. D. HAMMATT,\nTaxidermist and Commission Agent.\n\nFURNITURE!\n\nCALL AT\nMiss Maquire's,\nand see the largest and best selection of\nHATS & BONNETS Season 1886.\n\nWANTED\n\nTo Shippers\n\nSHANNON & McLEOD\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY,\n\nAT PRINCE ALBERT N.W.T.\n\nTHERMONIUS BUSINESS-HOURS.\n\nTerms £6 per month in advance.\n\nIn all other cases 10 cents added.\n\nAnvertisement inserted for less than £3.\n\nNew York - B. S. Norton.\n\nSUNDAY CHURCH SERVICES\n\nSt. Martin's Church\nand\nThe Chapel\n\nH. H. Services in both Churches and The Chapel at 10 o'clock.\nResident Vicar — Rev. Joseph P. Hunt, R.D.\nServer — Mr. Cranmer.\nChoir Master — Mr. Webster.\n\nST. CATHARINE'S\n\n2 p.m., Mrs. Smith's Church.\n\nST. PAUL'S\n\n3 p.m., Mrs. Cranmer's Church.\n\nST. ANDREW'S\n\n7 p.m., Mrs. Cranmer's Church.\n\nST. JOHN'S\n\n4 p.m., Mrs. Cranmer's Church.\n\nST. JAMES'\n\n3 p.m., Mrs. Cranmer's Church.\n\nST. ANNE'S R.C.\n\n8.30 p.m., Mr. Anderson's Church.\n\nST. PETER'S\n\n9.30 p.m., Mr. Pender's Church.\n\nST. PAUL'S (Presbyterian)\n\nH. H. Morning and Noon Services.\n\nFEUDAL, AUGUST 20, 1886.\n\nHis Hon. Lieutenent-Governor\nDewdney still expects to pay a\nvisit shortly.\n\nThe death of Samuel J. Tilden makes the fourth prominent Demo-\ncrat who has passed away within the\nlast few months. Death and the\nRepublican party would seem to be in\nleague against the Democrats.\n\nThe Ring and the Mac-\nLeod are thus called again by\nnaughty names, all in account of\nthe late Poundmaker, and if they\ndo not soon stop we will expect the\ngreat chief to come back and scalp\nboth of them.\n\nJudge Gray, before whom this\nChicago physician was tried,\nhas decided that \"when oaths\nare administered with a view to\nobtain a confession of facts, it is\nimproperly done.\"\n\nMr. Blake, however, was very\npleased upon hearing that he had\nbeen elected Mayor of Toronto.\n\nTHE WEEKLY SUN!\n\nAmong more than £1,000,000 being made under the publishers' agreement with THE CANADIAN NEWS, THE WEEKLY EDITION will contain\n\nThe News of the Week,\nSelected Miscellany,\nInteresting Serials, and\nSpecial Departments of Local Information and Renewal.\n\n$1.50 PER ANNUM\nPAYABLE STRICTLY IN ADVANCE.\n\nJUNE 21, 1886.\n\nNO. 1 OF MAY 26, 1886.\n\nAn Ordinance to extend, amend, and repeal, an ordinance, to be rescinded, regarding Police and Fire Departments.\n\nPassed 12th Oct., 1886.\nBe it resolved by Council that the laws of the City of Prince Albert shall be the same as those of Canada.\n\nAny person who comes upon any land which belongs to the property of anyone else shall be deemed to have broken the law.\n\nNEW GOODS!\nJUST ARRIVED!\n\nCENTS' FURNISHINGS!\nTELEGRAFIC.\n\nTHE VERY LATEST NEWS BY WIRE.\n\n(By Special Telegraph.)\n\nWinnipeg, Aug. 16.—Sir John and party were greeted at the New Westminster on Friday and Saturday. There was also a procession, addresses, etc. The party left for the east this morning. Sir John will attend the annual Conservative Association in this city next week. He will arrive here on Sunday.\n\nThe royal delegation proceeded twice to St. Mary's church yesterday, and will leave for the east immediately.\n\nThe Manitoba rifle company, consisting of thirty-two men and women, under the command of Mr. Smith, has been making arrangements for the departure of the regiment tonight. They are now in San Francisco endeavoring to secure the services of the chief of police of that city, the chief of the Canadian Pacific, which will remove strangers from that city to the western terminus of the road.\n\nThe Canadian Pacific adopted the Pacific division, and Spencer of the eastern division, are mentioned in connection with Sir John's plans.\n\nHorses for the Royal Well and Easter will arrive to morrow for the Pacific Coast.\n\nMore rising in Belfast yesterday, several people were killed. It is reported that the rioting was caused by the death of a man named George E. Patullo who has been appointed registrar for the County of Oxford.\n\nPhipps, member for West Simcoe, has been appointed to the Legislative Council.\n\nThe new parliament buildings for Ontario will be proceeded with immediately.\n\nWINNIPEG, August 18. Canada defeated the United States in the international cricket match.\n\nManitoba, August 19. For Ottawa, a delegation of prominent members of the legislature, Calgary, one of the towns declared ineligible by Ottawa authorities, has been sent.\n\nNorway returned to the city last evening.\n\nChicago nationalized convention opened today.\n\nThe Queen's speech will be delivered tomorrow in the Imperial Parliament. The House of Commons will be empty of any statement of policy or matter leading to controversial discussion. Oppositions of the government will be unable to make a single proposition contained in the Queen's Speech, but will have to content themselves with the task of opposing the government in order to keep the house an extraordinary good house, but must be prepared to meet the government's demands for the life of the house, both in the ordinary course of business and in the event of a motion for the dissolution of the house.\n\nIn the absence of Sir John, the government has been unable to avail themselves of the generous offer of a land purchase act.\n\nA meeting of citizens are making a tour through eastern Canada. Preparations are being made at all the leading points for their reception.\n\nThe new railway commission of that body becomes more important than ever.\n\nAn Indian Head dispatch says: The police have been engaged in search for the fugitives at Rigby last Tuesday and on Monday arrested Ernest Fitchett on suspicion of having committed the murder of his former wife. He was charged with the crime of murder, and when confronted with the evidence against him, confessed, giving the name of his accomplice, Hugh McIntyre who lives in the Appaloo valley near here. McIntyre was arrested.\n\nArrangements are being made for the convocation of the council on the 25th. Sir John arrives on the 27th and leaves on the 30th.\n\nHon. Mr. Bowell and Hon. Mr. Patten passed through the city for the Pacific coast yesterday morning. They will be in Chicago to-day and will proceed west to locate H.R.H. himself and express the Pacific and Intercolonial.\n\nEMMANUEL COLLEGE.\n\nThe Christmas Term of Emmanuel College began last Monday 16th August. The following students prizes have been awarded:\n\nCharles Cunningham, Louis Schiller, Honours for Mathematical Subjects.\nCharles Cunningham, Silver Medal for General Subjects.\nCharles Cunningham, Special Prize of $20 for Philosophy of Logic and Moral Philosophy.\nDuncan N. McLean, Special Prize of $20 for Chemistry.\nDuncan N. McLean, Special Prize of $20 for Experimental Chemistry.\nJohn MacKay and William McKay, Prizes each for Senior Division for Geology.\nMorrison McKay, Prize Book in Junior Division for General Subjects.\n\nINDIAN DEPARTMENT.\n\nThe Bear, Prize Book in English Subjects.\nThe Bear, Prize Book in English Subjects.\nThe Bear, Prize Book in English Subjects.\nThe Bear, Prize Book in English Subjects.\n\nBATTLEFORD.\n\nFrom the Herald.\n\nThe Government Superintendent of the Government telegraph service in the Northwest, Mr. Edmiston. He will be in the country to watch the line be constructed to the lakes. Stations will be established at Clover Bar, Fort Saskatchewan, Victoria and Smiley Lake, all of which will be completed this fall. The line from Battleford to Pitt will also be opened this season, leaving Battleford in October. The line will be constructed next year. From Pitt west ward the line will be on the north side of the river. All stations will also be built on the same line. Look for Telegraph Coaster, east of this place.\n\nLANSOWNE.\n\nCANADA.\n\nEXCITING THE GRACE OF GOD, OF THE UNITED KINGDOM OF GREAT BRITAIN AND IRELAND, QUEEN REGENT.\n\nTo whom it may concern,\n\nWe have heard with great satisfaction that the Governor General has issued a proclamation authorizing the sale of land in the province of Quebec, and we take this opportunity to inform you that the sale of land in the province of Quebec is now open for applications.\n\nA PROCLAMATION.\n\nQUEEN'S BIRTHDAY.\n\nWHEREAS the Governor General has issued a proclamation authorizing the sale of land in the province of Quebec, and we take this opportunity to inform you that the sale of land in the province of Quebec is now open for applications.\n\nA BRILLIANT TABLE AND SALOON.\n\nIn connection with the above.\n\nThe Best Cigars always on hand.\n\nLIVERY & FEED STABLE.\n\nContact Mr. Woodman.\n\nCHAS. WOODMAN\n\nNOTICE.\n\nMATRIMONIAL AGENCY.\n\nEstablished to supply matches in Canada for respectable young women who are willing to come to England. Applications should be addressed to the undersigned.\n\nJENSEN & CO.\n\nLondon, England.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., New York.\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR\n\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelings,\nDress Goods,\nSilks,\nLinen, etc.,\nGO TO\n\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nThis to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\" \" Over 16 feet extra\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nA TRIP DOWN THE SASKATCHEWAN AND OVER-LAKE WINNIPEG.\n\n(Special to The Times.)\nPortage La Prairie.\n\nAugust 18, 1886.\n\nWe arrived at the mouth of the \"Great Low Land\" on Tuesday last, about 10 o'clock, just eleven days after we set out from Portage La Prairie.\n\nThe Marquis is a large, commodious and comfortable boat, well kept, with a jolly crew under the command of Capt. Begley, who is an honest, kind and able officer, and the same may be said of all under his command. Each second mate was paid for each day's work, so that he made all the passengers on board feel happy and contented.\n\nThere were nine passengers on board as far as the Rapids, where there were added to our number by the arrival of the North-West Mounted Police, the following: Among the passengers we noticed the Hon. L. Clarke, M.P., Mr. Grey of London, Ontario, and his wife; Mr. Tomlin, of Winnipeg, and eldest son of Hon. Mr. Jordan Clarke of Hudson, Quebec, who had been residing for some time at Victoria; also Mr. Robert B. Hallett, who had made the journey to Battleford in four days by a skillful pilot, with but a loss of big steers, who knew every rock and every bend which hereafter they might overtake him. Nothing can be more interesting than to voyage down the Saskatchewan beyond these confluences that are common on waterways. We had not as yet seen any feature on board until we reached Grand Rapids, so they were transferred to the Arctic Storehouse, and the Marquis had also to pass.\n\nAfter having our midday dinner after all the usual formalities, nothing of interest took place until we reached the Rapids. Silver River opposite Fort Qu'Appelle. Every eye was anxious to catch a glimpse of the famous beacon. The weather was very cool and pleasant, perhaps taking his meaning in the evening. A fire was kindled on the deck, and the shelter of the cabin. The Captain, who is a \"dead shot,\" began firing at the duffers, which, got up on a log, and danced round the cabin. On a repetition of the experiment, we jumped from our seats in silent submission to the laws of nature. Our daring fellow boatsmen soon fell into a state of repose.\n\nWe succeeded in getting off in good order, and satisfied with the first exposure. The Prime Minister performed the usual ceremony or send him over to his home.\n\nAbout 9 p.m., we tied up for the night in the middle of Coal Rapids, where we landed and went on horseback. We passed the Main Lakes and returned by the Bay to Prince Albert. If we think of our short experience, it was very exciting and would fill the pages of the most interesting chronicle. We fell into overwrought enthusiasm when the thought struck us that we were now on board a steamer. Day after day passed away waiting for a change to get back on land.\n\nSaturday proved a clear and beautiful day, with a brisk breeze through every cabin and delightful. The first order of the day was breakfast, and the remaining ones followed alike as to the joyful sound that all was ready. On this occasion we were treated to beef steak, scones, tea and coffee. We could say whether it was prepared in a refiner's or a furnace. Our antagonist was easily convinced, and he gave up without a challenge. We got back to Portage La Prairie by last mail.\n\nWe are now prepared to sell Furniture cheaper than ever offered in Prince Albert. My stock consists of old furniture, new furniture, clocks, watches and costumes. I am now prepared to sell Furniture cheaper than even offered in Prince Albert. My stock consists of old furniture, new furniture, clocks, watches and costumes. I am now prepared to sell Furniture cheaper than even offered in Prince Albert. My stock consists of old furniture, new furniture, clocks, watches and costumes. I am now prepared to sell Furniture cheaper than even offered in Prince Albert. My stock consists of old furniture, new furniture, clocks, watches and costumes.\n\nHARDWARE. AMMUNITION! SHOT. SHELLS and WADES. Dupont's Celebrated Duelling Powder. Loaded Shells always on hand.\n\nJ. L. JOHNSON & CO.\n\n1878.\n\nGOTO CANN'S BOOKSTORE\n\nBooks, Stationery, Fancy Goods, Toys, Musical Instruments, Wall Paper & Borders\n\nThe Latest Books and Papers Always on Hand.\n\nPOST OFFICE BOOKSTORE.\n\nC. D. NORTHCRAVES,\n\nWatchmaker and Jeweller,\n\nAt T. Nelson's New Star.\n\nA LARGE STOCK OF WATCHES, CLOCKS AND JEWELLERY.\n\nKEEP CONSTANTLY ON HAND\n\nTO THE LADIES. GENERAL MERCHANTS\n\nNEW GOODS AT MISS MACK & Co.\n\nIndian Traders.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886082001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 3664, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 874, 1], [874, 3242, 2], [3242, 10209, 3], [10209, 14632, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]