[{"id": "a3aeeafcc68fa6306c5d1aba642e2bbeb0904e83", "text": "THE PRINCE ALBERT TIMES.\n\nWEDNESDAY, JANUARY 3, 1865.\n\nGOOD NEWS.\n\nThe return of the delegates, after having completed satisfactory arrangements with the South-Saskatchewan Valley Railway Company, has awakened for the first time much interest in matters, and everybody is now looking forward to the publication of the particulars of the agreement. We understand the delegates had a meeting with their friends and made a report of their proceedings, but we have not yet been made acquainted with the details of their plans. It is understood, however, that the land which has been agreed should be handed over to the Crown (legends) with that reserved by the proprietors, and that a large amount of real estate will be shortly placed on the market. This looks like business and will make things easier for Prince Albert for some time to come. We understand that the land patents will be shortly issued, which will give a great impetus to real estate transactions. The result of the sale of land which has shown a settled fact, will also have a most beneficial effect upon trade and commercial operations generally.\n\nIt is believed that the death of Sir Hugh Allan, although it is a very serious loss, will not interfere with the arrangements for the transfer of the Portage, Westhampton and North Western Railway, and that the line will be carried on to Prince Albert. There is also reason to believe that the outlook for Prince Albert for the new year is bright and promising, and we may safely congratulate ourselves on our future prospects.\n\nThe death of Sir Hugh Allan, the eminent merchant and steamboat proprietor, who recently occurred in Edinburgh, will be a serious loss to the mercantile community of Dominion. Sir Hugh has been connected with many prominent men in business circles, and has also taken an active part in the politics of the country. He leaves a large family of twelve children, and a vast amount of wealth accumulated at the rate of millions of dollars.\n\nWe regret to hear of the death of Mr. Whitcher, the Commissioner of Fisheries for the Dominion, which took place at Ottawa, from typhoid fever. Mr. Whitcher was an able and efficient officer, and took a very prominent part in the fishery movement in the St. Lawrence River a few years ago. His loss will be much felt in his Department and by the public service generally.\n\nIt is generally understood that the Hon. James Macdonald will meet on February 8th.\n\nLieut. Col. Denison, of Toronto, recently received a letter from Sir Samuel Wodehouse, a passage in which reads: \"I had a couple of Canadian battalions with me, and they were treated. This is something our citizen soldiers and their friends may well bear in mind. The Canadian regiments showed great forbearance when Canadians can do, and he has decidedly not done so.\"\n\nHon. Mr. Allan arrived in Winnipeg on the 1st, accompanied by Mr. Aikins, the Missionary Allan, and Jeremias, from Toronto, and the Canadian Valley, known as \"Hummer Valley.\" The trip was made from Toronto to Lake Louise three hours, and was an easy stage. Mr. Allan visited Mr. Macneill and the members of the Cabinet met him at the depot. At 4 p.m. the cabin window was surrendered to Mr. Miller and Dalhousie, in the presence of the members of the government, the Rev. Canon Campbell, the local Legation, the Archdeacon of St. Boniface, and the Bishop of Rupert's Land.\n\nRAILWAY CLIPPINGS.\n\nReview of C.P.R. Construction Work.\n\nDuring the year which is about to close, the C.P.R. has made great strides in its construction across the continent. The graders have reached a point 956 miles west of Winnipeg, and have covered 250 miles of track distance. From this point to the Saskatchewan, a distance of sixty-five miles principally heavy cutting, earthwork and filling, has been employed all winter, so that by a time spring opens work can be as Leopold, the terminus of the line, the work will be ready for the rails. Westward from Leopold the line has been located to within thirty miles of the summit of the Rockies, to be finally decided upon next year.\n\nThe difficulties to be encountered will be very great, some of the heaviest grading known in the annals of road building. The average height of the line between the past year's 63 miles of track have been laid, taking into account the main line, Southern branch, and side tracks in various locations.\n\nLOW RATES ON THE C.P.R.\n\nGeneral Manager Cowan has reported the following low rates for the carrying of the two articles of wheat and fuel, viz., one cent per ton for farmers and householders that this is true, for it is the very policy which the Press has long advocated.\n\nTERRELL AND FATAL ACCIDENT.\n\nA frightful accident occurred at the Hudson Bay grain mill, at Fort William, on Thursday last January 1st, resulting in the death of Mr. Michael Cochran, an employee at the mill. It appears that Cochran was attempting to adjust a belt on the engine, and had loosened one of the wheels, and must have got his arm entangled in it, so that the wheel turned around and crushed his body and almost completely torn apart. There was only one man on the same flat at the time, and he was not immediately aware of the accident. He had been out for a short time, and when he returned, he found the scene of the accident. He immediately called for help, and the doctor arrived soon after. Mr. Cochran died instantly, and the doctor pronounced him dead.\n\nSTEWART AND WOOTTON, GENERAL MERCHANTS.\n\nPRINCE ALBERT.\n\nALWAYS BUY FOR CASH.\n\nVALUE FOR YOUR MONEY.\n\nFresh Groceries, Teas, Sugars.\n\nO'Giel's Hungarian Patent Process Flour.\n\nPrince Albert XXXX Flour.\n\nEvaporated Peaches, Dried Apples.\n\nNew Raisins, New Currants, California Fruits.\n\nGray's Celebrated Scotch-Jam.\n\nMarmalades.\n\nSyrup in legs and tins.\n\nCanned Meats, Canned Fish.\n\nCanned Soups.\n\nSugar-Cured Hams, Super-Cured Hams.\n\nCross & Blackwood Pickles, Worcestershire Sauce.\n\nYorkshire Biscuits, Spices, etc., etc.\n\nBiscuits, Candies, Dry Goods, Clothing, Boots, Shoes.\n\nFURS: Sets Elk, Wolf, Robes, Lined and Trimmed.\n\nSets Grey Wolf, Robes, Lined and Trimmed.\n\nBuffalo Robes, Buffalo Coats, Grey Wolf Robes.\n\nR. E. WAY, STEWART & WOOTTON, PRINCE ALBERT.\nTHE PULPIT ON DRAILWAY.\n\nOn Thanksgiving Day in Winnipeg, one of the leading newspapers wrote to the editor of the Ottawa Free Press the following report of the remarks of Rev. Mr. Pitblado:\n\nRev. Mr. Pitblado—But then the railway must be our servant, not our master. We must not allow it to be the way kings in managing their business, but they must not be allowed to become political tyrants over the common people. Rules we will obey, but despots we cannot tolerate. Rich capitalists will get fair play in our country, but hereafter their labors must be productive. Monopolies for us are like the scaffolding which partially obstructs the sunlight and the air, and which must be swept from the building. It may be tolerated as a temporary arrangement, not as a permanent one. And all who believe in the principles must in the end give way to fair competition. And man must learn that the country does not exist for railway companies, but railway companies exist for the good of the country. When they cease to serve that purpose, then they cease to exist. The building by which we think in building up our institutions need not become the burdens which we carry on the present day.\n\nRev. Mr. Cameron.—God has given us a country of unrivaled fertility, and of vast resources. We have been visited with promise, and ever widening as the boundary of a new empire. Talk of checking Manitoba's westward neighborly advance on the Red River in the northward course, as by disallowance or any other government that expects to do the evil that it threatens, which would be doomed to be the house of millions, and the theatre of many of His eternal purposes, must be rejected. We must go in our own natural routes, as surely as streams through their native channels. When the resources of the country are such as to admit of competition, the coming line must be built. Von Zedlitz will be von Dan, and when the people will rise, they will demonstrate no government can ever venture a conflict. The Providence that opened this country shall keep it open. Let us thank God for that.\n\n\"Manitoba has risen up in unanimous protest against the recent proposal of provincial railway legislation by the Federal Government. The Liberal, Conservative and Independent, have declared their opposition to the policy of disallowance. They say that it is not safe to order a flight of success, while all are agreed upon resistance. The Romanos have also joined in the protest, a protest that will result disastrously to any movement. In the determination to see the province remain free from the policy disallowed by the present government, fully sympathizes, and should Sir John Macdonald enforce it, a movement to the same effect will be made to place on the backs of both provinces by any means possible. If the united people will get behind the movement, as he has done, whom Mr. Cameron, Minister of Militia, would find an army to suppress them.\"\n\nOttawa Free Press.\n\n\"Yes,\" said a witness, \"I remember distinctly the scene. The witness whom I am about to refer to, she was wearing a black dress, and her hair was tied back, and the tears were running down her right cheek. She was talking to someone who could not be heard. 'Please, your honor,' said the witness, 'she was in a state of great excitement.'\n\nA Sunday school superintendent in Rockwood, Ont., relates the following incident chalked on his blackboard. Miss E. M. Supplee, aged nine years, died Friday, just after dinner. Mary Smith, wife of the undersigned, and daughter of the late Mr. Smith, died Saturday morning. The corpse was highly respected by the highest class families; but death came unexpectedly, and took up the basket with perfect calmness, so that she could have a showplace on the other side of the door. The plant was transplanted to the grave at her bidding, near Willow street. Condolences come.\n\nHow much will this cost in your paper? I am very interested looking over, as he handed in the following advertisement at the Eagle's counting-room, yesterday afternoon:\n\n\"Miss E. M. Supplee, aged nine years, died Friday, just after dinner. Mary Smith, wife of the undersigned, and daughter of the late Mr. Smith, died Saturday morning. The corpse was highly respected by the highest class families; but death came unexpectedly, and took up the basket with perfect calmness, so that she could have a showplace on the other side of the door. The plant was transplanted to the grave at her bidding, near Willow street. Condolences come.\"\n\nPRINCE ALBERT ESTABLISHED 1860.\n\nPRINCE ALBERT PLANNING MILLS AND SASH AND DOOR FACTORY, DOORS, SASH, &C.\n\nGOODFELLOW BROS', W. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to\n\nPlans and Estimates furnished when required.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT N.W.T.\nTHE SELF HELPING BABY\n\nAn Englishman who passed many years in the West came back to England and says, \"The first general impression of the West came while he was riding over an arid prairie on a steaming hot day which revealed to him the wonderful fact that a Western woman adopts herself to circumstances and makes the best of her limited resources.\" There was nothing he says, very peculiar about the appearance of this baby that I saw just now, but it was wrapped in Indian fashion to a board about two feet long and one foot wide.\n\nBoard and the blanket were leaning against the log wall of a frontier shanty on the bank of a river not far from the scene near. The baby seemed very happy. The little arms were free and kept up constant movement.\n\nAs my horse came nearer I saw that some strange thing was hanging about the baby's neck. It was tied round the big toe of one of the tiny little feet.\n\nSuddenly the baby grew very red in the face and opened its eyes widely and its little arms beat the air with frantic energy. At that moment the mother appeared.\n\n\"That baby is choking, madam,\" I cried.\n\n\"No, he ain't, and he can't,\" she replied.\n\nAt this instant the infantile legs began to work. One kick, two kicks, and there on the board lay the piece of pork pickled in salt water and tied by the string tied to the big toe.\n\n\"Ain't you ever seen this afore, mister, asked another, observing the Englishman's surprise.\n\n\"No-o,\" he answered slowly.\n\n\"Then kind o' remember it. Mayhaps yer wife won't go back on it.\"\n\n\"I thought so,\" said the man, and since that day I have seen that baby in a hundred different guises. From sheer habit it has become a second nature to me, wherewith to gauge moral instances of the three qualities of western men, and women, will help, self-confidence and adaptability.\n\nA MARRIAGE ADVICE.\n\nIt is easy enough to secure a husband. Most any attractive little dumpling with a bright eye and cooing voice can gather in a noble husband, but it is pretty difficult to find him who will be able to stand thicker than blood on a dog, but the great difficulty in obtaining their true nobility and securing their fidelity.\n\nA wife understands her husband and she can introduce the working racket in her new field of operations and walk away with him, while the same wife, though nice to be loved and needed, there is something in the man's great rough, easy manner, his hearty laugh, his cheerfulness and manner with gentleness and pie than by the logic of the broom handle and a lack of sense of reasoning with bread and milk diet.\n\nWe have seen a girl who understood her husband's trade and became agent by the mere art of speech, and led him through life in such a way that she was lost on the ranch. So perfect was the character of the wife that she could bring in a scuttle of coal, or get up in the night short to kill a burglar that he knew was lurking behind the fence. Four blocks away, he always went, and felt as though he counted in a mark or spot. He had no idea what the woman did; she did him by being so right and dedicated to go and chase a loose cow away from the corral, and an old herd, slave, and clothed in nothing but a brief authority and a kind understanding.\n\nWe cannot exactly describe this magic power of a devoted wife over her husband and do not wish to try to do it. It is an unseen force, and an unseen thing that makes the husband get up in the dead of midnight and get the pancake batter near the pan.\n\nA man need not think because he gets up and looks for burglars in the night and is never too impatient, that it is because he has backbone.\n\nIt is simply because he is the husband of a woman of whom he ought to be proud.\n\nHUDSON'S BAY CO.'Y.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 5,000,000 acres in the Great Fertile Belt and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goshen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and elsewhere.\n\nC. J. PRYCE, Land Commissioner.\n\nSTOBART, EDEN & CO.,\n\nGeneral Merchants and Indian Traders.\n\nSeven Cases of Fancy Goods\n\nJust received from England containing\n\nLadies', Girls' and Children's Underwear,\n\nBall Dresses,\n\nLadies' Mantles and Saletots,\n\nLadies' and Maids' Winter Jackets,\n\nLadies' and Maids Costumes,\n\nAnd other articles non-necessaries to mention.\n\nCall and see our new stock at the old stand which everybody knows.\n\nTHE ECHO HOUSE,\n\nQU'APPHELLE.\n\nThe favorite resort of all visitors to the beautiful valley of the Qu'Appelle.\n\nWell accommodated. The only frame hotel in the valley.\n\nTerms moderate.\n\nD.A. McGregor\n\nToaster Artist and Hair Manipulator\n\nPRINCE ALBERT\n\nTO THE LADIES.\n\nMillinery and Ladie Furnishings\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK,\n\nRIVER STREET,\n\nPRINCE ALBERT\n\nGRAND TIMES\n\nThe Only First-class Newspaper in the Saskatchewan District.\n\nThe Best Newspaper in the N.W.T. to advertise in.\n\nGREAT SUCCESS!\n\nCirculation Increasing Daily\n\nNOW IS THE TIME TO ADVERTISE\n\nAdvertise.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which unfortunately, was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETY,\n\nPROPRIETORS.\nPATRICIA KEMBALL.\n\nA NOVEL\n\nBy R. L. STEVENSON, author of \"Little Lord Fauntleroy,\" \"The True Story of Joshua Marwood,\" &c.\n\nCHAPTER XI—CONTINUED.\n\nMr. Hailey was watching Patricia involuntarily arching her brow. She felt the room go numb, and the floor slide from her feet, as she afterwards told Miss Prichard; who put her hands anxiously for her, but could not affect any change in noting odd sensations; so standing up and clearing her eyes, pressing both hands upon them, she felt a strong hand, without wishing to arrange herself, to put up her hair or to put on a ribbon, the necessary thing to do in a situation that was not going well; but all for Gordon—she ran down into the little park, for it could not be called a drawing-room, where she sat down as ordered as she was.\n\nMr. Hailey was waiting for her; and while they sat there he had been examining with a critical eye the extraordinary collection of rubbish and real curiosities in terracotta and other materials, that she had set about the chimney pieces and on the side table. Magnificent big of corn were fixed in a large vase of blue glass; a bowl of nuts and dry fruit with brown table tile, an exquisitely carved vase in jadestone had for its pedestal a monstrous sepulchral pillar, with a picture of the last supper on the oblongs distributed by certain weekly papers were joined unfurled against the walls, the whole being surrounded by whirlwinds of yellowing oak leaves and tendrils and fruits of sunflower, green and scarlet and purple, simple; which made an arrangement that looked very well if it also spoke of poverty. Mr. Hailey, however, did not respect taste if taken with poverty, and thought it rather a good, heavy, handsome gloomide glass a little faded, of a certain colour of olive and just not handled in the best leaves and straw concocted with pine round a tawny halfpenny prism given away by some friend.\n\n\"Not worth a pound the lot,\" he was saying to himself as Patricia opened the door and came in.\n\nShe saw a tall, largely-framed man with dark curled hair; a clean shaven face save for a pair of whiskers that met in a point, a pair of eyes deeply set, grey, bright, black, and keen; a large obstinate kind of nose; and lower lip, square and firm, squared out when he spoke, and showed a close row of short redish pointed teeth and thin lips; upon his head he wore it was a tall, thin hat, with a rather unattractive look of good living and prosperity about him. In the thousand lines of his slight, rather pale face there was not yet only slack; in the showy attitudes and pectoral gestures in the measured accents, there was not yet the glitter of the manicure gold chain across his ample front, the sparkle of the huge diamond in his large finger, the flecks clearly drawn upon the tips of his shining hair down to their roots; the shining boots, and in the sudden flashes and glimmering of all his limbs there would be no such completness of the man and the success of the man. He was Mr. Hailey of Abbey House, whom Patricia knew. He was not ashamed to add, the man who had begun life in an armed boy's school and now stood in Mr. Hailey's drugstore, born in a house and bred in a stable; but who by industry, good sense, talent, and natural ability, had risen to the position of owner of a town and the husband of Admiral Sir Robert Kemball's daughter. He was an admirer of Mrs. Kemball, the glass maker, and asked the world to glorify him too.\n\nHe had early decided on his tactics, which were to stick to the place where he had known himself and had made a colossal fortune, and to make the society there to recognize and admire him. The closed paradise of his past was the only one that gave him of his cruelly crushed ambitions; and he had always received on an equality by the poorest Millionaire gentlemen whose wives had once been his companions. He was not more than be counted by people who he had not known in his hard-earned days Millionaire gentlemen whose wives he had not known himself to count. And he had succeeded.\n\nHe put his face into the purest expression of the smile that was a part, a natural part, in spite of himself, of his manner; took the precedence, and said, \"Good morning, Miss Kemball.\"\n\nShe said, \"Good morning, Mr. Hailey.\" He had not expected to see anything so beautiful, and he wished that he had not. Not that here was the kind of beauty he liked best; certainly not. He liked very much the glistening, caressing, smoothness of women—women who were timeworn and who screamed easily; women he could protect and console, and who would be grateful to him for doing so; women who, when they put on parastyles of social grandeur—he giving up to them the airs of the fashionable—would be grateful for helping all the other soprices in a shabby garment; women who were fond of wealth and clothes and sparkling jewelry; women he could buy with gifts and sublime through them as he could the male race, and by pleasant conversation. He hated all enthusiasm in women, may prove trivial announcements; all declamations of love; all the pretensions of a show of learning; and the doctrine of their rights (which however he did not believe); and all the other things he had forgiven a little graceless deception, especially if it was of his own favour. In his mind, women who talked too much or called them anything but ladies and that might mean that to fit as he did, or that they were not ladies, were too severe on their want of house in love affairs or money matters, providing they were not vulgar. He thought that they were too much like \"mamas,\" when they were found out; but if they were pretty he thought that they were charming; and also too that they should take very short steps—pretty pitifully useless kind in steps—of course, women's fashions were walked in, and that they should keep their heads bent downwards, looking up from under their eyebrows singly. And then there was the question of the art of the stay maker and the milliner was apparent; and the only kind of appearance that fascinated him was that called stylish.\n\nThe handsome medium presented by Col. Speck's Ontario Eastern branch to Mr. Prichard's Albert Cottage Club are on view at Stewart & Watson's store.\n\nGRAND UNION\n\nLivery & Sale Stable,\n\n4 Nechet Street, Prince Albert.\n\nHorses and Cutters always on hand.\n\nTry, for double teams promptly attended to. Charges moderate.\n\nThe only first class Livery in the Province.\n\nS. J. DONALDSON, Prop.\n\nMEDICAL HALL,\n\nT. E. JACKSON,\n\nPRINCE ALBERT,\n\nDRUGS & CHEMICALS,\n\nDEALER IN\n\nDye Stuffs, Patent and Veterinary Medicines, Druggists,\n\nSanitary, etc.\n\nHardware,\n\nChains,\n\nRope,\n\nGlass,\n\nBread and Chopping Axes\n\nSHELF HARDWARE\n\nJ. R. McPHAIL,\n\nLOWEST PRICES.\n\nJ. R. McPHAIL,\n\nTRAVELLERS GUIDE.\n\nTo Messrs. Acorn & Cross.\n\nThe pump which you have put in my well is giving entire satisfaction, being easily worked and proof against the severe frosts of the North West.\n\nYours Truly,\n\nROBERT ROSS.\n\nPrince Albert, Dec. 26th, 1882.\n\nT J AGNEW\n\nHAS JUST RECEIVED:\n\n5,000 feet Glass—14x28, 15x30, 16x32.\n\nAxes and Handles,\n\nWhite Lead,\n\nCook Stoves,\n\nPowder and Caps,\n\nCutter Runners and Shafts,\n\nLamp Chimneys,\n\nBuilding Paper,\n\nParking Paper,\n\nUnion Churns.\n\nTwenty 30 ft. loads to arrive next month.\n\nWholesale & Retail,\n\nTAILOR AND BARBER,\n\nCall on Scotty, the Tailor, for Your Clothes.\n\nFit Guaranteed,\n\nCutting a Specialty.\n\nHair Cutting and Shaving.\n\nJAMES SCOTT,\n\nGABLE HOUSE,\n\nPRINCE ALBERT,\n\nN.W.T.\n\nTRY\n\nHUGH M'DOUGALL'S BREAD!\n\nHugh M'Doagall,\n\nEast End Lake Rd.\n\nPRINCE ALBERT,\n\nBAKERY\n\nTRY TO ACCOMMODATE MY CUSTOMERS AND THE PUBLIC IN GENERAL WITH THE BEST POSSIBLE BREAD AND OTHER ARTICLES FOR SALE.\n\nBREAD, CAKES, PIES, ETC.\n\nAnd other things in addition to mention.\n\nAll things promptly attended to, cooked and served.\n\nW. R. BELL,\n\nWAREHOUSING\n\nAT\n\nORT QU'APPELLE.\n\nThe undersigned having ample accommodation are prepared to receive goods at reasonable rates, and will be glad to forward them from Fort Qu'Appelle most favorably at reasonable rates.\n\nMERCHANTS AND DEALERS.\n\nWill send the greatest charges for personal service to those who desire it.\n\nPersonal attention by members of the firm in receiving special orders.\n\nGRUNDY BROS. & CO.\n\nFOSTER QU'APPELLE.\n\nReal Estate\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nCENTRALLY SITUATED IN\n\nPRINCE ALBERT\n\nSuitable for business purposes, suitable for further particulars apply by letter or telegraph.\n\nC. MAIR,\n\nP. O. DRAWER 10.\nTO THE PUBLIC.\n\nWe have made arrangements to leave papers at T. J. Agnew's hardware store, the first floor of T. N. Campbell's news store and Markland & Co.'s dry goods store. Those living near any of the above mentioned places will find their spirits there.\n\nTOWN NEWS.\n\nInjury against accidents in the Sun Life Assurance Company of Canada. E. Flood, Esq., has been appointed by the Lieutenant-Governor of Manitoba a commissioner to sit as an arbitrator in any court of record in Manitoba. New Year's Day was generally observed in various parts of the town. Many friends, whilst others engaged in the rifle competitions, of which there were two.\n\nThe weather has turned decidedly cold. On New Year's night the thermometer was down to 27° below zero, and yesterday day was 34° below zero, with a keen blowing.\n\nAn annual insurance of $1000 will be paid in the event of death, or $60 weekly in deminutely in the Sun Life Assurance Company of Canada. Secure a policy. E. Flood, Esq.\n\nAn evening party took place on New Year's night, at Mr. Ian Macdonald's residence. The guests enjoyed themselves all night long. The supper was excellent.\n\nThe telegraph poles are being laid to wash the town, and an early opportunity in spring the line will be extended to Prince Albert. The last will have to be furnished by the Provincial Government.\n\nThe Toonache congregation of the Church of England, presented Mr. H. Hilton, who had been absent from them for some time with a rupture amounting to $50, on Xmas Day. In appearance of his recovery.\n\nLook out for the grand ball, to be held on the 13th inst. in John Macdonald's saloon, for the benefit of the poor sick men of Prince Albert. Tickets to sale at N. Campbell's. Knowing the consternation we predict a grand success.\n\nMr. McLean, the land agent, says he understands that land patents will shortly be issued for the North West. This will be good news for those who desire to remove the grievances under which they labored, and which has seriously interfered with their prosperity.\n\nWe received by the last mail a copy of the Winnipeg Herald, a weekly paper devoted to the interests of the inhabitants of the Province of Manitoba and the North West. It is published by H. T. McPherson, an employee of the Canadian Pacific Railway.\n\nWe are informed by Mr. Bradson, the mail driver, that the statement that a new road will be opened between here and Appellee is not correct. Every exertion is used by the contractor, Mr. McLean, and his drivers to keep the road in good repair, although owing to the accumulation of mail matter, at times it is very difficult to do so.\n\nMessrs. Ashdown and Bevitts arrived from the east on Thursday evening. They made the trip in three days' time, and back in six weeks having spent several days in Winnipeg and the same at Appellee. This is quick travelling. Mr. Bevitts says he will make a trip on the road, and Mr. Ashdown has ordered an extensive stock of groceries, etc., for his sporting season.\n\nBilly Mitchell is going up next stage between here and Appellee, for the purpose of purchasing a pair of boots and carriage of saddle gear. He will start on the 15th of January, and will be able to accommodate any passengers. Any one wishing to go to Appellee may call at Billy Mitchell's store. He will also bring parcels from the same town. This will be a great boon to the public. Mail time made.\n\nOn Friday last several ladies waited upon Miss Baker, who had written for the purpose of presenting her with a purse containing $57 and a handsome cruet valued at about $20. The ladies visited the residence of Miss Baker. Dear Miss Baker, in recognition of your personal worth and faithful services in connection with the Public School, and as a slight acknowledgment of your valuable aid in connection with Sabbath School work, the ladies of Prince Albert have accepted the accompanying gift, and at the same time express their sincere wishes for your continued welfare.\n\nMiss Baker, who was taken by surprise, made a suitable reply. Refreshments were then served, and the ladies spent an enjoyable evening.\n\nNEW STORE.\n\nNEW GOODS.\n\nNEW PRICES.\n\nWALTERS & BAKER\n\nHave received a Mammoth Stock of Dry Goods, Clothing, Boots and Shoes, Groceries & Provisions.\n\nIn the store formerly occupied by J. O. DAVIS & CO.\n\nThe public are invited to call and inspect the stock before purchasing elsewhere.\n\nH. WALTERS, F. C. BAKER.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nToys, Etc., Etc.\n\nCHRISTMAS CARDS!\n\nJust arrived, a Large assortment of Raphael/Tucks Prize Exhibition Cards.\n\nCall early and make your selections.\n\nA LARGE STOCK OF Musical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nBUFFALO HALL.\n\nIt is reported that W. H. Vanderbilt is worth the enormous sum of $160,000,000.\n\nIf you are hungry, read this over again.\n\nHolidays are over, now for business.\n\nIn order to make room for our early spring importations, every article of winter goods in the house will be REDUCED.\n\nGoods must go. Call and see the drop.\n\nDry Goods, Groceries, Boots, Shoes, And Clothing.\n\nAll included in the rush.\n\nBETTS & Gwynnes\n\nBuffalo Hall.\n\nHORSE SHOE STORE.\n\nOh my! I am so awfully nervous today, and the reason you see, John he forgets for to buy me some of Tom Davis' 50 cent Tea. One pound of those Teas will go further than two, and so easy to steep. I really don't know how he manages to sell them so awfully cheap.\n\nTry one pound of my 50 cent Black Tea, and you will never buy any other.\n\nALSO\n\nClothing, Dry Goods, Furs, Boots, Shoes, Moccasins, etc.,\n\nAs prices that beat the waters of the Saskatchewan in the fall.\n\nTHOMAS O. DAVIS.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883010301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 7401, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6183, 2], [6183, 11247, 3], [11247, 16734, 4], [16734, 25184, 5], [25184, 30965, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]