[{"id": "993bd41f4bce9d8d312bfc7e13f8f0d3f22de8d2", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 18, 1887.\n\nBANKINGHOUSE\nOF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\nPrince Albert, N.W.T.\nBanking House.\nA. C. PATTERSON,\nForwarding Agent.\n\nCITY CONFECTIONERY\nCheap Groceries\nCanned Goods\nAlso Cigars.\nR. T. GOODFELLOW,\nCorner River and McKay Streets.\n\nROBT BUCKLEY,\nBakeryman,\nAccountant,\nGeneral Agent\n\nFOR THE\nBest Assorted Stock\nof\nCONFECTIONERY\nGOLTO\nH. M'DOUGALL'S\nBAKERY.\nGoods delivered to all parts of the town free of charge.\nH. M'DOUGALL\n\nLOCAL NEWS.\nUse Clark's Glycerine Cream for beautifying the skin.\nTramway payments in this district commence Tuesday next.\nA considerable amount of freight arrived in Prince Albert last week, and innumerable are on their way from Troy loaded with merchandise for our merchants.\nTenders are asked for the erection of a log building for the Collegiate School district. Specifications can be had from the Secretary of the Board, Mr. H. W. Halpin.\nMr. J. M. Campbell, with his usual enterprise, has imported a thoroughbred stallion. He is a good horse, a little over four years old, a beautiful dapple grey, with a star on his forehead, good bone, nice white markings, and very good temper. His action is only one year old.\nMr. Thomas Rodgers, who for some time was the express agent here, has returned from Europe, improved so much that he came back on Thursday last in company with his brother-in-law, Mr. N. R. Rodgers, for whom he has been away for several months. He will soon recover his usual health.\nThe fire appliances purchased by the town have been placed in the hands of the fire brigade, and the fire brigade thoroughly organized so that in case of need everything will be in its place and everyone knows his duty. It will also be possible to lock up the stable door after the horse has been taken out.\nThe secretary of the Lorne Agricultural Society will be pleased to receive sample bunches, about three inches thick in the center of width, of barley or wheat. The latter are to be used for sowing purposes. Come, also sending immaculate wares that can be grown here.\nWe understand that the building of Harris Son & Co., lately used as a store house, will be let by tender. We understand that the same premises will be made available for a grain elevator, and an additional space was put up to hold seed. Some of our enterprising men might take into consideration, and send in their samples for the benefit of the town. Why does not the Agricultural Society secure the use of it for their annual show?\nClark's Vegetable Sugar Coated and Amalgamated Pills.\n\nTENDERS TELEGRAPHIC.\nTenders for\nCollection School Building\n(Loc. 1842) will be opened on September 17th.\nFor specifications apply to\nMRS. W. HALPIN,\nSecretary.\n\nPRINCE ALBERT FIRE BRIGADE\nCommittee No. 1 and 2.\nA full meeting of the Brigade will be held in the Council Chamber on Tuesday next at 7 p.m.\nEvery member requested to attend.\nBusiness of importance.\nA. H. CLARK,\nSecretary.\n\nCHIT-CHAT LOCALS.\nGathered by our reporter\nB. B. Ritter at Clark's Drug Store.\nJudge Macleod and family are expected here shortly.\nMr. Williamson commenced work on the main drain on Tuesday.\nMiss Simcoe, mother of Carleton, visited us a day or two this week.\nAre you a member of the Lorne Agricultural Society? Only one dollar.\nMr. Wm. Knox was out at the South Branch a few days last week prospecting.\nMr. Fortescue and family, of Athabasca, visited us on their way here from Qu'Appelle.\nThe Prince Fire Brigade will meet in the Council Chamber on Tuesday next, at 7 p.m.\nMr. E. T. Baker, foreman of the police force, was out on the sick list during the week.\nThe Carrot River Agricultural Society will hold their second annual exhibition on Saturday next.\nMr. Beatty of Carrot River district was in town this week, and was the guest of Mr. J. M. Campbell.\nThe Prince Saskatchewan Lottery takes place on Tuesday next, at the residence of Mr. Dan Cameron.\nMr. Duncan Campbell of the east end, brought Mrs. Maclean with him and three little children for dinner, etc.\nWe are informed upon good authority that Mr. Albert Hudson's father has fallen heir to the balance of about $100,000.\nBy becoming a member of the Lorne Agricultural Society you assist the Society to secure a larger Government grant.\nMr. Goodfellow is doing the work on the new schoolhouse, and we have now ready for occupation about the first of October.\nMr. Goodfellow has purchased one of the very best organs for their church. This speaks well for the energy of the new pastor Rev. Mr. Howard.\nMr. Edward Johnson, of Qu'Appelle, visited us in a boat of Oregon hones this week. This is the third band brought into Prince Albert this season.\nMany will be interested to learn that Mr. Miller lost his pair of imported horses. They were worth at least $600. He also had a fine young stallion, two mares, and a colt.\nMr. H. W. Peters, Government overseer of the police barracks, has received instructions to erect two more buildings, one a hospital and the other a stable for six horses.\nThe celebrated West Highland terrier, which was bought by Mr. Mitchell at Quebec, has been brought to Prince Albert. His thoroughbred Anglia Polled bull has reached his ranch at Duke Rock.\nMr. Clarke and Mr. John Stewart returned from Winnipeg on Thursday. They were brought in by stage and made the trip in three days without mishap.\nMessrs. Andrew and Hugh Nelson have commenced the erection of a house on the hill just east of Mr. Hardy's dwelling, and facing Mr. St. Louis mansion.\nMr. John Stewart is importing a thoroughbred Durham bull and cow, and some Shropshire sheep from the well known breeder, Messrs. J. & R. Baker, of Athabasca. Mr. Stewart is also getting a thoroughbred Durham bull from the same breeders. They are ex excellent specimens of their breed.\nThe committee appointed by the directors of the Lorne Agricultural Society to select a suitable building for the display of their exhibits, found the most convenient place is Mr. McIlroy's shop on the Hard & Baker block, opposite the post office, and an addition made at the south end and covered with canvas.\nFor coughs and colds use Clark's syrup of Tar and Wild Cherry, with lime.\nThe Toronto Telegram says that the headway is being made towards the settlement of the fisheries question by the appointment of a commission. We may say at once that such a commission will not be set until a settlement of the question has been reached. While the commission is about it why should it not be set up to power to take up the question of extraterritorial settlement also? These subjects have been before the people of the two countries long enough. As for the fishermen, there are more fish in the sea than will ever be caught, just as for the Indians there is plenty of land. The only reason for not handling them over to the courts of their own country. A defaulter who came out from his native land, by the sale of so doing furnishes prima facie evidence of his guilt. If he were not guilty he would not need to become a fugitive from justice. Settle the fisheries question, settle the commerce law, and establish close commercial relations between the two countries, and then this talk of annexation will come to an end.\n\nIn one of the English magazines Mr. Gladstone makes some calculations of interest to the Liberal party—the object being to show that the country is turning its face more and more towards Liberalism, and that the present reaction is simply a Liberal triumph. Mr. Gladstone is always sanguine. It is this quality that so largely commends him to his followers. If he were not to be convinced by the facts showing that the tide of the picture spread on the bright side they would desert him in shoals, so heavy are the demands he makes upon their loyalty to himself by allying themselves to his cause. Take Irish Bills as an example. These were swallowed by the Liberal party mainly because they were Mr. Gladstone's. Any body else who had made such a proposal the Liberals would have been hooted out of public life. His desire is said to be wind up his career by settling the Irish question. He fails to see that he has laid down, but it is quite evident that at his time of life he cannot expect to live to see the effect of the settlement. Two things the Irish agitation has done—deprived Ireland of her landlord out of the country, and the other to put an end to English rule in Ireland. Is this not rather more than they have a right to expect?\n\nEnglish visitors all speak highly of Canada and her trans-continental railway. They come over expecting to find this a sparsely settled country with a simple state of railways running through it, and the most flourishing cities and railways running in all directions. To most of them, when they take as in with their single eye glass, Canada is a revelation, and they do not hesitate to express their astonishment at the progress the country has made. But why should it not make progress? It is peopled by men and women of hardy growth, who are fond of adventure, in a country which any country must well look forward with hopeful expectation. There is probably no country on earth where the comfort of life are so generally distributed as in the Canadian States. Here are millions of millionaires. We do not need them, and the sentiment expressed by one of themselves the other day that the time will come when it will be a reflection on a man to be very rich will prevail, and the result will be the end most that a good harvest is a matter of vital concern.\n\nThe summer has been short but too short most people think. But it must not be assumed that summer is short because of a few cool days. There will be warm weather yet. The finest months in the year of our Canadian climate are still before us. November cannot be more charming than September and October. The reports of the crop prospects are not peculiarly gratifying, except as regards the Northwest, where the crops are reported good. The early frosts have usually managed to arrive in time to do no end of mischief, but this year they have been anticipated. So much depends on the weather, and many farmers have all they can do to make both ends meet, that a good harvest is a matter of vital concern.\n\nCall and inspect our improved Heating Drums\n\nStoves and Stovepipes put up and cleaned on short notice\n\nPanel Doors and Sash,\n\nAT\n\nT. J. AGNEW'S.\n\nT. N. CAMPBELL.\n\nSchool Books and Stationery,\n\nPublic and High School Text Books,\n\nSchool Requisites of every description,\n\nStephens' Blue Black Ink,\n\nALL SIZES—WRITING AND COPYING.\n\nOffice Stationery, etc., etc.\n\nTHE WEST END STORE\n\nJUST ARRIVED,\n\nNEW GOODS\n\nAT\n\nCHAS. MAIR'S WEST END STORE,\n\nNun's Veiling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson and White Bow Rugs, Red and Yellow, Door Mats, Crochet Silk Corded Cloakings, Empire Cloth in Black and Garnet.\n\nFrieze Curtains,\n\nLadies' Felt and Embroidered Bonnets, Ladies' Fancy Frillings, Beercloth Veiling, Ladies' Silk Ties, Timel, etc., etc.\n\nALL AT LOW PRICES.\n\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fancy Confectionery, Biscuits, Figs, Dates and Tinned Goods of all kinds.\n\nInspection is solicited.\n\nPRINCE ALBERT\n\nBREWERY\n\nRussell & Davis,\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBeef, Pork, Mutton, Sausages, Bacon, Ham, and GAME IN SEASON.\n\nBranch Stalls—Qu'Appelle Station, Fort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\n\nBROWNS BRICK STORE.\nTERRITORIAL NEWS\n\nREGINA.\n\nFrom the Leader, August 29.\n\nA farmer has lost his crop for lack of water. The wheat was planted in June and was still growing when last seen. It was then about three inches high. Mr. H. B. Heydges, vice-President of the Macdonald and North-Western Railway Company, visited the farm from Edmonton where he has been for some months past in connection with railway and colonization matters. Mr. Heydges said that he had been successful in the object of his visit, which was to see the land and find a location for a town site. He has also been engaged in buying up land for the purpose of purchasing lands and establishing a settlement. The company has approved of the Minister of the Interior's plan for the settlement of the land. The company will be careful not to make any settlement until such time as the land can be purchased at a reasonable price. The company will also be careful not to make any settlement until such time as the land can be purchased at a reasonable price.\n\nEDMONTON.\n\nFrom the Bulletin, August 29.\n\nT. P. Wadsworth, Inspector of Indian agencies, arrived today from Fort Saskatchewan. He has been appointed to the position of Inspector of Indian agencies at Fort Saskatchewan and Edmonton at $12 per day.\n\nThe total amount of land in the district is about $40,000. The rate of taxation probably will be about $15 per acre.\n\nFrom the Leader, August 29.\n\nThe Prince Albert Times\n\nSASKATCHEWAN REVIEW.\n\n$250 PER ANNUM\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY.\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 15 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nPUBLIC NOTICE.\n\nby the Trustees of Colliston School District No. 9 of the North West Territories.\n\nWhereas a report has been received by the Trustees of Colliston School District No. 9 of the North West Territories, from the Secretary of the School District, that the school building at Colliston has been destroyed by fire, and that the school has been closed since the fire occurred, the Trustees of Colliston School District No. 9 hereby give notice that the school will be closed until further notice.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nAt T. Campbell's New Star\nA LARGE STOCK OF\nWatches, Clocks and Jewellery\nKEPT CONSTANTLY ON HAND.\nREPAIRING PROMPTLY ATTENDED TO.\n\"BELL\" ORGANS\nUnapproached for Tone and Quality.\nCATALOGUES FREE.\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Bowell & Co.,\nNew York Advertiser, 105 Broadway, New York.\nSend 10¢ postage paid.\n\nTHE MORNING CALL\nOnly Conservative Morning Newspaper in Manitoba and N.W.T.\n\nFull cable and telegraphic reports of Canadian, United States and United States News.\nSpecial news reports compiled by representatives in Canada, Ontario, Quebec, Manitoba, the Northwest Territories and British Columbia.\n\nComplete reports of Parliamentary proceedings at Ottawa and Winnipeg.\nTHE MORNING CALL appears every morning except on Sundays, being distributed by the United Press Association in Winnipeg, and reaching the most remote and isolated parts of the great lakes.\n\nSubscription rates: One year, $1; six months, $1; three months, $1; single copies mailed in advance. Sample copies mailed free on application.\n\nSubscribe by Address.\n\nThe Call Printing Co., Winnipeg.\n\nACTON BURROWS\nPresident and Director-In-Charge.\nGENERAL NEWS\n\nNew Westminster, B.C., Sept. 2.—A San Francisco dispatch says: The Cana-\ndian Pacific steamer here, large, well-\nloaded, consisting of wheat, dry fruit,\nwines, etc. Yesterday was the arrival\nof the steamer in San Francisco of the steamer \"St. John's.\"\n\nSt. John's, N.B., Sept. 4.—All vessels\narriving in the past few days report\nheavy storms on the Atlantic. The\nNorwegian bark Marquis, from London,\nencountered a hurricane on the 30th\nult., during which she carried away a\nnumber of sails and was forced under lars poles. The bark Ireland from Liverpool met tremendous weather,\nand was stripped of her sails. The bark\nTwilight, from Londonderry, carried\naway a number of sails off Seal Island\ntwo weeks ago.\n\nVictoria, B.C., Sept. 2.—The sailing\nschooner Pathfinder arrived here noon\nhaving on board 2,377 tons salt. During\nthe last few days the schooner has\nonly spoke one vessel, and did not learn\nof the seizure of the other schooners\nwhich have arrived to-day. Another\naction is expected shortly.\n\nThe Pathfinder is the second vessel that\nevaded the blockade.\n\nQuebec, Sept. 1.—Premier Macdonald\nstates that there is actually no govern-\nment acting governor or administrator of the\nprovince in this province, and that\nhaving been unable to take Mr.\nMacdonald's place while he is in Europe.\n\nToronto, Sept. 1.—The death is an-\nnounced of Mr. Thomas, Esq., of South Norfolk, popularly known as\nthe father of the Bag Baby.\n\nSir John has no intention of visiting\nEngland this year.\n\nSydney, N.S.W., Sept. 1.—Hon. Mr.\nWhite and party—consisting of Mr.\nWhite and daughter, Judge Boultbee,\nD. H. Macdonald, M.P., Mr. Pearce,\nInspector-General—have arrived by private secretary—arrived here to-day\nabout 1:30 from Battleford. They were\nreceived by Mr. White and Mr. Pearce.\n\nThe only obstacle to mar their trip\nwas a slow, steady rain, which set in\nlast night and continued all day today\nnight and part of the day, making the\nroad very slippery. Mr. White and\nhis family have for Regatta Day landed on\nthe train at Edmonton, and will take\nthe morning train to Calgary and Mr. Mac-\ndonald down to Victoria.\n\nToronto, Sept. 1.—It is stated on good\nauthority that the promoters of the pro-\nposed new Conservative paper, Empire,\nhave decided to abandon the project, and\nthat further efforts will be made to find a\nnew owner. It is rumored in journalistic circles\nthat it is the intention of the promoters\nto return to old allegiances at an early\ndate.\n\nKingston, Sept. 1.—Two convicts who\nescaped in the steamship Jean, from\nthe penitentiary landed near Oranges\nand sank the yacht on the sandy beach.\nThey were captured and returned toward\nthe interior of New York state. The\npolice are in pursuit.\n\nToronto, Sept. 1.—The militia district\nhas notified Colonel Macdonald, M.P., that\nhe has resolved to have the last course\ndecided upon the disputed accounts\nbetween the militia and the com-\nmander of the 6th battalion.\n\nQuebec, Sept. 1.—The French local\npaper says that as a result of the battle\nof Lachine, the birth of a child with two\nheads, three eyes and two mouths.\n\nSudbury, Sept. 1.—Shipper's saw mill\nwas destroyed by fire last night. Loss\n$10,000; no insurance.\n\nKingston, Sept. 4.—Alex. Doughearty,\na young convict, succumbed in the dark\nat this morning.\n\nToronto, Sept. 4.—A fifty-mile road\nbetween ten miles southwest of Toronto\nand the Wanganui Station, was won\nby the Wanderers by 117 points.\n\nToronto, Sept. 2.—Rev. Dr. Jardine,\nPrince Albert, is here in the interest of\nthe medical academy, to be established\nthere.\n\nWinnipeg, Sept. 2.—Archbishop Faber\nof Montreal will arrive at Winnipeg on\nSaturday, and probably be joined by Archishop Tasche for a trip to\nVictoria, B.C. They are expected to\nreturn on the 17th inst.\n\nLondon, Sept. 2.—Chamberlain will\nstart for America in November. It does\nnot appear to be definitely settled yet\nwhat member of Chamberlain cabinet\nwill be on the commission.\n\nNew York, Sept. 4.—John Murphy\ndrove about $8,000 worth of horses Saturday in 2:17. The last record was\nmade in 3:00. Bonner a few days\nago presented Murphy with the trotter\nwhich holds the record in 2:19, and is\nvalued at $6,000.\n\nLast week a cowboy on High River\nkilled two Blackfoot Indians killing\nrather than shooting them off. They\nrefused to go and pulled their guns on\nthe cowboys, but the latter shot one of\nthe Indians dead and wounded another. Trouble is feared in conse-\nquence, and fifty police, twenty-five of\nwhom are mounted, are being sent to\nrealizus to march for the Blackfoot Crossing at a moment's notice.—McLeod (Calgary).\n\nThe following in reference to Gabriel\nis taken from the Fargo County (Montan-\nta) Argus: \"Gabriel Pummett returned\nto Lawrence county, where he resides in\nthe upper country. Whatever his mission\nwas he has accomplished it. We have\nheard it said that he was trying to gather\nsome followers to make a raid. It is\nnot to be supposed that he is among\nthe half-breeds and he cannot make\nthem off with his herd, and proceed he\ncan with his herd. He has had enough\nmoney out of the half-breeds to purchase\na herd and a cart and will start soon for\nFort Benton. He expects to join the Wild West show\nlatter fall. It will be remembered\nthat Dumas was here last fall, but he did not dare\nventure on British soil, so remained at\nhome. Gabriel Pummett will go along\nwith him without much work, but\nlosing prestige among the half-breeds, and,\nindeed, a harmless character.\"\n\nA NORTHWEST MUSEUM.\n\nThe Historical Society has done a wise thing in purchasing the Hudson\nBay Company new assembly hall for\nreception at its noon, this afternoon.\nThe museum, especially those whose\nroots are situated in the far north and\nnorthwest, will splendid opportunities\nfor historical missions and specimens\nof geological, botanical and ethnological\ninterest. The members of the society\nare acquainted with many facts regard-\ning the history of the Northwest which might\nbe brought to light through such a\nmuseum and would be of great value\nto the students of the subject. The\nHudson Bay factors furnished the institute\nwith one of its most valuable collections,\nespecially those relating to the\nNorthwest. Indeed, the Smithsonian\nInstitute contains the only complete\ncollection of Hudson Bay artifacts on\nthe continent, and Canadians have to\ngo to Washington to properly study the\nsubject. The museum will be of great\nvalue to the students of the subject in\nthe country. The Hudson Bay officers\nwere without doubt but only too glad\nto assist the Historical Society in such an\nobject instead of sending their appear-\nances to United States museums.\n\nAnd what a fine record which this\ninstitute has made which will illustrate\nmore clearly than any other how\nWashington collection is simply because\nthere is nothing in the Northwest which would\nappreciate their donations.—Calif.\n\nAnxious to Mention.—Are you distur-\nbed at night and broken up of your rest by\nthe noise of the children? Are you tired of\ncutting Teeth? I am sure at once and\ngave both of \"Mrs. Windsor's Soothing\nSpray\" and \"Mrs. Windsor's Soothing\nTonic.\" It is highly efficacious. It is\ninvaluable. It will relieve the poor little\nchild of the pain and suffering. If there,\nthere is no mistake about it. It\ncomes in a small bottle. It is made in\nthe Research and Bowles, circus Wind Dale,\nand the times reduces inflation.\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES.\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion.\nSUMMER SUITINGS\nIn all grades\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887091601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 5684, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6204, 1], [6204, 11474, 2], [11474, 15541, 3], [15541, 23130, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]