[{"id": "df5aeb7723b7226e97e62fd98950df55a9510864", "text": "THAT “SENSATION.”\n\nThe first idea to occur to us upon long coming comparison between a period of G.A.F.’s despatch from their cold-bloated heads in St. Prince Albert dated April last, and holding them when they did and that, published in the Winnipeg New, well of News folkling during the burnt g. headen, “A Sensation,” is one of those instant requisites to us to wonder by the fact of that being suddenly present, but that whilst the latter was made a nod of by populace who will be happening the very thing, he per- knew he had not been among them as perfectly calm and collected as himself, for instance, the former were with us long enough to investigate the plainly ignorant that anything unal- claim so high a degree of veracity and spirit, then transport back his face to its natural urban aspect, now that desire was manifested itself in him; indeed, it seems all the more surprising from the fact that in the few close words in which he speaks for himself instead of making so much as a quarter of it, he opens up the appearance to have arrived at certain conclusions with regard to what is necessary for the future peace and order of the Territo- ry, which, as far as they go there, is seemingly unapposed to all that can be done out of sight, and without unneces- sarily a lot casual commotion thereof. Surely a slight consideration of the fact that our law cases afford those assured to have been too many of the victims of one or two bad, unholy, injustice aimed at them for reference sufficient of the judgment of their fellow sufferers, should have made him more con- cerned with regard to receiving e x- plicit men whom we shrink to te- stifying under the circumstances, the vanity of objects, or taking the vengeance of those whom they can confessedly be unable at present isterly to openly address. This implied state of craven helplessness or the part they must reflect is no less visible upon them as upon their alien oppressors, and is no less false than offensive. Com- pared with this course of theirs, that of Mr. MacKenzie, whose remarks published by the Western Review, make it appear, in a way quite applicable to the one now under discussion, in a lesser published in another part of this issue, is a main- ly distinct.\n\nInternal troubles and causes ef- fective in the mind of this community to single out will be too easily tamped down among the clique of malcon- tent who spend their time in lying down the law in holes and corners and other refuse places, where the same, as elsewhere, has allured G.A.F.’s sensational report. They belong to that class who count positions they are utterly unfit to fill, who hate all who from education are aside, who would sooner be put upon the lowest post if possible, and by an exhibition of rabid intolerance proving that were their positions reversed they would “out-Hered Hired,” drive men who otherwise might be limited in their sympathy with them to throw their weight aside of the decidedly the lesser evil—the so- called local magistrates. Probably enough more has appeared than was anticipated on the premises of the written statement—two district, some of which may be found in the letter above referred to—concerning the Police, although accepted by the public as a good faith, have a keen sense of their supposed of great personal grievances, each one anxious to advertise are better known or another have been handled by the Force in the district to this day, the authority in charge of the same submitting to the Police, they sometimes inadvertantly succeed in pleasing the task of fulfil- ing their own ends, and in the opinion of their fellow citizens each party attaches to the holding of spots here it must be shared with the Police by our volunteers, and while\n\nTHAT “SENSATION.”\n\nUnfortunately, from the very nature of their crime—although the direct penalty may, and should, fall upon the men—the indirect, and perhaps the most grievous one, under proper provisions, must take cognizance, it will be looked not away, but down upon the women and children.\n\nThat this to a considerable extent already is the case we are assured by people who have been amongst them—and who are very willing to come forward and help—feeling sure that they will certainly hear the rebels no great love.\n\nThat some of them have not been left with a false sen- sation of charity is a source of comfort, at least as far as matters at all should be reduced, having quite rightly been deprived of their gems—to hunting little birds and gobblers with bows and arrows, which, with what dry eggs they can find, for the latter being strange nothing like as nice as ours; and although they say thus in a manner, although they say thus in a manner, that the Government should send some humane agent there at once with the necessary means to relieve their most pressing necessities.\n\nThe measure proposed by the territo- ry act in recent years (or at times as well as of misery), and surely we have had enough of both. Although the settlers of this district stood wholly by us at the moment, the trite old adage, that wisdom is often found in its extremity after all, still holds good. If such a distress has been brought about by individuals to get themselves redeemed by being set free, I could not help but notice it.\n\nThat while we are sure that the authorities will not be able to prevent it, yet it is not easy for us to say that there is any prospect of numbers of them being so very short, nor do we feel this is the case, and that they are but looking towards the present state of things, so as to get the garrison.\n\nHad we the sanction of another of your lordships, that of any part of another authority, for taking the step, while we really believe that the present state of things is doing nothing towards the preservation of life, that itself is only demandable by the efforts of the authorities who stand in the way of these matters being pressed. We are ready and willing to cooperate in any measure which may be needed to maintain our rights and liberties, and that this should be done without delay is something which cannot be sufficiently emphasized.\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nJ. M. & MPB LL\n\nREAD/MADE CLOTHING\nDry Goods\nCrockery,\nGroceries!\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nThe volunteers departed, the defense committee assembled and while naturally enough all felt that prompt measures must be taken, there was some diversity of opinion regarding what should be done. It was finally decided that in case of attack Mr. Col. Spratt command the volunteers at Duck Lake. As Mr. McKay agreed to assist, Mr. Col. Spratt command the volunteers at Duck Lake where Mr. McKay was appointed assistant to Mr. Col. Spratt. They met near the fort where they were joined by a number of men from Fort Erie. Since Mr. McKay was questioned about the existence of two men named McKay living near the fort, Mr. McKay replied that he had seen two men named McKay living near the fort.\n\nIn the meantime, the volunteers assembled at Duck Lake and marched westward toward Fort Erie. On the way, they met another group of volunteers who had heard about the situation at Fort Erie. Mr. McKay rejoined them and together they marched toward Fort Erie.\n\nAt Fort Erie, they were met by Mr. Col. Spratt who informed them of the situation inside the fort. Mr. McKay then addressed the volunteers and requested their assistance in repelling any attack. The volunteers readily agreed and proceeded to Fort Erie where they joined forces with those already present at the fort.\n\nOn the following day, Mr. McKay led a group of volunteers on a reconnaissance mission to investigate the movements of the enemy. During the mission, they encountered a party of Indians who were hostile to the volunteers. Despite the threat, Mr. McKay managed to negotiate a truce with the Indians and gained valuable information about the enemy's plans.\n\nBack at Fort Erie, the volunteers were put to work strengthening the fortifications and preparing for any possible attack. Mr. McKay continued to lead the volunteers and instilled confidence in their abilities to defend the fort.\n\nIn conclusion, Mr. McKay demonstrated exceptional leadership skills and courage throughout the events described. His dedication to the cause and his determination to protect the fortification made him an inspiring figure for the volunteers under his command.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885062601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 1930, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6127, 2], [6127, 6475, 3], [6475, 8590, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]