[{"id": "9e94210a3f592eea750b543d65ca02afac49c312", "text": "MAMMOTH STOCK OF FRESH GOODS\n\nJust received by steamers Northcote and Manitoba\n\nWe have decided to sell at special prices for the next two months.\n\nCall and get the best value for cash ever offered in Prince Albert.\n\nDry Goods Groceries Provisions Crockery Hardware Boots and Shoes Wooden Ware Fancy Goods Clothing\n\n20 bl Mess Pork Bacon and Ham Canned Fruits Maple Sugar Biscuits Cigars and Fancy Pipes baskets, etc., etc.\n\nSTEWART & WOOTTON\nKISSES & KISSING.\n\nA MORAL VIEW OF THE SUBJECT.\n\nThere seems to be nothing that can make people more happy than kissing. It is a natural instinct, and one that cannot be denied. The act of kissing is a sign of affection and love, and it is a way of expressing these feelings in a physical manner.\n\nThe act of kissing is not just limited to humans. Many animals also engage in kissing behavior. For example, dogs often lick each other's faces as a sign of affection. This behavior is similar to human kissing, where the lips are used to convey love and affection.\n\nIn conclusion, kissing is a natural and healthy way of expressing love and affection. It is a sign of connection and intimacy between two people.\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., Etc.,\n\nPRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY, PROPRIETORS.\n\nRIVER STREET, PRINCE ALBERT\nITEMS OF INTEREST.\n\nAn earthquake was felt at Athens recently.\n\nMiss Ada J. Jackson, Danish lady, is dead.\n\nThe report of the death of Carway is confirmed.\n\nLoughborough, the poet, left a property valued at $300,000.\n\nA state of siege has been imposed on Niloos, Nepalese capital, for fear of a famine. Disgusted with the Khalsa, they have left all the churches lately.\n\nA vessel lying at Craney Island, Va., has several cases of yellow fever aboard.\n\nThe Alamo Club, which had been closed for six months, arrived at Glasgow on July 25th.\n\nThe Municipal Council of Paris rejected the proposal to pay a loss of $200,000.\n\nThe news of Carway's death has produced a profound sensation throughout London.\n\nKing George IV visited the Crimea, where he died on the 26th of June.\n\nAt Kingston on the 25th July the transportation of the Nile P. W. O. took place.\n\nSeven women and children were drowned by the upsetting of a boat in the river.\n\nThe French government proposes to use 50,000 francs to cover the cost of a similar misfortune in France.\n\nIt is reported that Mr. Vaughan has resigned that his husband is suffering from the effects of poison.\n\nFourteen persons have been committed to the Magistrate for complicity in the murder of Mrs. Smythe.\n\nAt Belleville, recently, Alex. Arbuthnot, owner of the \"Belleville\" on Trenton, was found dead in his room.\n\nAt Kingston one of Barrow's thieves put his pistol through his cage and killed W. Smith, who was sitting in the cage.\n\nAt Churchill, in Russia, several cases of cholera are reported, and great efforts are being made to prevent its spreading.\n\nAnother death of an aged man and woman occurred in the hospital in the Kingston jail—the fifth in two months.\n\nThe county as seen from the Nelson tower is said to be the most beautiful in the county of glens and valleys.\n\nThe opening of the International Electrical Exhibition has been announced.\n\nAntiques will be sold at public auction.\n\nIt is understood that the late Henry Kendall makes a bequest of $10,000 to the public library of Providence.\n\nThe faculty of the new Woman's Medical College at Kingston have been sworn in.\n\nThe opening will take place in October.\n\nThe heavy rain which have prevailed in England during the past few days continues seriously to interfere with the harvest.\n\nCholera has spread to Russia, where a few cases are reported. The existence of the disease is said to be confirmed at London Bridge.\n\nThe suppression of the Tract Society by the Government brought into the possession of the authorities the press for some time.\n\nThe death of the Tract Society's leader, Mr. B. L., a three-year-old son of Mr. B. L., while playing with his mother in the attic, set fire to his clothes, and was burned to death.\n\nThe English government has withdrawn the agreement with M. de Lesseps concerning the Suez Canal.\n\nThe death of the Duchess of Kent was announced on July 27th, and she died after a short illness.\n\nMr. Macphail, prominent Presbyterian, resignation of any war declared repugnant, and the utilization of all parties is desirable.\n\nOn the 25th June, on the Wallachian border near Bessarabia, a freight train collided with a military train, killing 20 soldiers.\n\nThere was some agitation in financial circles at Montreal on the 25th June, when a report was received that the bank of the consolidated loan was about to warn exposure of the shareholders of the company.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK,\nPRINCE ALBERT.\n\nPRINCE ALBERT\nBOOT & SHOE STORE.\n\nKNOX & BARKER,\nCarpenters and Builders,\nJob Work Promptly Attended to.\n\nResidence - BELL'S RESTAURANT.\n\nBELL HOTEL.\n\nMEALS AT ALL HOURS\n\nJAMES SINCLAIR,\nMerchant Tailor.\n\nJ. C. MACKENZIE,\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nREMOVED.\n\nHORSE SHOE STORE,\n\nRIVER STREET,\n\nHas been removed to CAMPELUS BLOCK, near door east of Miss Mack's Millinery Establishment.\n\nI have opened out in my new premises, and will be glad to meet all my old customers.\n\nAn early inspection of my stock invited. All goods marked down to lowest cash prices.\n\nTHOMAS O. DAVIS,\nT. N. CAMPBELL,\nBookseller and Stationer.\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own large tracts of land in the Great Lakes District, and now offer for sale generous areas already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Portage la Prairie and Couchiching, N.W.T.\n\nThe above will be disposed of at reasonable prices, and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nPRINCE ALBERT\nBOOT & SHOE STORE.\n\nBOOTS & SHOES\n\nCheap, Cheap for Cash.\n\nAll Kinds of Leather Work and Repairing done on short notice. The best of Leather always on hand.\n\nJ. C. MACKENZIE,\n24 WATER STREET.\n\nSIGN OF THE BIG BOOT.\n\nREMOVED.\n\nHORSE SHOE STORE,\n\nRIVER STREET,\n\nHas been removed to CAMPELUS BLOCK, near door east of Miss Mack's Millinery Establishment.\n\nI have opened out in my new premises, and will be glad to meet all my old customers.\n\nAn early inspection of my stock invited. All goods marked down to lowest cash prices.\n\nTHOMAS O. DAVIS,\nT. N. CAMPBELL,\nBookseller and Stationer.\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company own large tracts of land in the Great Lakes District, and now offer for sale generous areas already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS\n\nFOR SALE\n\nIn Winnipeg, West Lynne, Portage la Prairie and Couchiching, N.W.T.\n\nThe above will be disposed of at reasonable prices, and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\nCHIT-CHAT LOCALS.\n\nGAND UNION\nLivestock & Sale Stables.\nNaked Street, Prince Albert.\nHorses Safe on Board.\nOrders for double teams promptly attended to.\nCharges moderate.\nThe only first-class Livestry in the Town.\n\nS. L. DONALDSON, Prop.\nT. J. Agnew is having his hardware unpacked and fitted up in grand style, which will add greatly to the appearance of the building.\n\nSTOBART, Eden & Co., General Merchants.\nToby & Campbell’s Black & White.\n\nIndian Traders,\nPRINCE ALBERT, N.W.T.\n\nHUGH J. MONTGOMERY, Real Estate Agent.\nAUCTIONEER, ETC.\n\nJ. L. JOHNSON & CO.\nHave removed to their new building four doors west of the old stand.\nN.B.-We claim to have the best assortment of Seed and Heavy Hardware in Prince Albert.\nPrices Guaranteed Satisfactory.\n\nREMOVED.\nSHANNON & McLEOD have removed into their new store, one door west of their old stand, and are now prepared to give to the people of Prince Albert a quality of Boots and Shoes never before offered in this town.\n\nThe entire stock has been personally selected, and none but first-class material purchased. We keep no shoddy goods, and sell at prices that cannot be competed with. Our motto is small profits and splendid satisfaction.\n\nOrdered work done in first-class style. Repairs promptly attended to. We intend keeping up our reputation for doing first-class work. Always on hand a good supply of leather, shoe findings, etc.\n\nOwing to our loss at the Troy fire, we are compelled to conduct our business on a strictly cash system.\n\nREMOVED.\n1879. BUFFALO HALL.\nChoice Selections in DRESS GOODS at\nBUFFALO HALL.\n\nInfant’s Elegant ROBES & CLOAKS.\nAt Clapp & Bailey’s celebrated LACE REMNANTS only at\n\nBUFFALO HALL.\nThe largest and most reliable stock of READY MADE CLOTHING in Prince Albert.\n\nBUFFALO HALL.\nThe popular Double-stitched OVERALLS made expressly for BUFFALO HALL.\n\nBUFFALO HALL.\nFresh arrivals per steamer Mangnup for\nLong Clear Bacon, Canadian Hams, Teas, Sugars, Salt, Coffee, Tobacco, Canned Goods, and a full line of Staple Grocery and Patent Medicines.\n\nThe Leading House of Prince Albert is BUFFALO HALL.\n\nBETTS & Gwynne, Messrs. Peterson, Hanafin & Keenan,\nWill sell by Private sale until the First of September next the following property Parcel No. 1. (Lot) acres & 76.83 sq. yds. according to the survey of Mr. McKay's plan. Part of lot 9, block C, Mission property Lot 6, Geo. Macleay's lot from 34th street. Lots 12, 15, 16, and 19, north side of Second street. Lots 17, 18, and 19, north side of Third street. Lots 20, 21, Lots 24, and 28, north side of Second street. Lots 33, 34, Lots 24, and 27, south side of Fourth street. Lots 33, 34, Lots 24, and 27, south side of McLaurin's south side of McLaurin street. Lots 1, 2, and 3, north side of McLaurin’s district.\n\nFor further particulars apply to J. D. HANAFIN & H. KEEGAN.\n\nCITY AUCTION MART.\nMARKLEY & ORR, Real Estate and General Agents—Sales Agents in this district for the\nCelebrated New York Singer Sewing Machines\n\nSOLD\nBAKING POWDER", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883080801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9316, "total-output-tokens": 2900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 443, 2], [443, 1153, 3], [1153, 1668, 4], [1668, 7833, 5], [7833, 10811, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]