[{"id": "216a52c198d0d3a72618457bc7d1bdaa211efd6f", "text": "THE PRINCE ALBERT TIMES\n\nWEDNESDAY, JANUARY 10, 1883\n\nTHE LATE ACCIDENT.\n\nNow that the first feeling of horror at this frightful accident at the Hudson Bay Company's mill at Gouchee, which resulted in the death of Mr. Sheppard, has worn off, particular inquiries are beginning to enquire whether there are sufficient safeguards in this and other mills, to protect the lives and limbs of those employed therein. It is not much to be regretted, for several reasons, that an investigation before a coroner's jury did not take place. Whilst there may be no suspicion or imputation of unlawful acts, or of wilful neglect on the part of any one causing death, yet we think there were in this case sufficient circumstances which called for investigation. In the other provinces of the Dominion, in all cases, where death has been caused by accidents from machinery, in steam mills, manufactories, steamboats or railroads, an investigatory coroner's jury has been held without fail, for the purpose of satisfying the public mind, of clearing or incriminating as the case may be, the conduct of others, and for the satisfaction of the relatives and friends of the deceased. In the North West Territories the law on this subject is as follows:\n\n\"Except as hereinafter provided, no person shall be charged with the body of any deceased person, by any coroner, unless it has been made to appear to such coroner, that it is necessary to believe the deceased was killed by the manner or by culpable or negligent conduct, either of himself or of others, under such circumstances as would constitute murder and not through mere accident or mischance.\"\n\nThere can be no doubt that the power of the Coroner to direct such an investigation. In this case there would seem to be circumstances which peculiarly called for the exercise of this power. A man employed in the mill, of no previous experience, as far as is known, in mill machinery, whose duties it does not appear to have been to have had charge of the belting, up to the time the belt was broken, has been loosened from a wheel, for another purpose, and is directed by the miller, who has long experience in such matters, to adjust the belting. He attempts to do so, and proceeds to a platform for that purpose, and whilst the mill's back is turned, the unfortunate man is caught in the machinery, nobody knows exactly how, but it is supposed his clothes were caught in a cogwheel close by, and he is crushed to death.\n\nThe miller gave an evasive statement, not altogether wholly, maybe, to the Coroner, said that the deceased attempted to adjust the belt from the wrong side of the wheel, against repeated warnings, which he had given him to that effect. Thus imputing negligence on the part of the man whose lips are sealed by death. Subsequent enquiry has elicited the fact that there is a difference of opinion upon this point. Some say that he went to the side of the wheel where there was a sort of a platform, and that if he was on the wrong side, then the platform must also be on the wrong side; again, others say that he went up on the right side by which access could be had to the wheel.\n\nWhatever story may be correct and at present we pass no opinion upon the subject, sufficient is known to show that there was abundant need for an investigation, whatever may have been the result. It is but fair to state, that the Chief Factor of the Hudson Bay Company, Hon. Lawrence Clarke, Esq., and Col. Richardson, who happened to be in town, immediately after the occurrence of his office as Superintendent, Macarthur holds the position of coroner in the North West Territories, and expressed his willingness to investigate the matter, if arrangements were made for it, as required. Col. Richardson said that as far as the internal evidence produced before him went, he did not consider it necessary that a coroner turn up before he left Edmonton. Allow me to state it was perfectly ready to hold an inquiry, and so the matter rested. It appears to be the impression amongst some, that it was unnecessary, in order to have a coroner's inquest held, that a coroner turn up before he left Edmonton. Allow me to state it was perfectly ready to hold an inquiry, and so the matter rested.\n\nDesire to return sincere thanks to their customers for their kind patronage during the past year, and trust by energetic push and constant application to business to still merit a like continuance of you kind favors during the present year.\n\nSTEWARD AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nALWAYS BUY FOR CASH,\n\nAND GET FULL VALUE FOR YOUR MONEY.\n\nFresh Groceries,\nTeas,\nSugar,\nO'Gillie's Hungarian Patent Process Flour,\nPrince Albert XXXX Flour,\nEvaporated Peaches,\nEvaporated Apples,\nDried Apples,\nNew Raisins,\nNew Currants,\nCalifornia Fruits,\nGray's Celebrated Scotch Jams,\nGranulated Syrup in kegs and tins,\nCanned Meats,\nCanned Fish,\nCanned Soups,\nSugar-Cured Hams,\nSugar-Cured Bacon,\nCross & Blackwell Pickles,\nHorsemeat Sauce,\nYorkshire Edish,\nSpices, etc., etc.\n\nBiscuits,\nCandies,\nDry Goods,\nClothing,\nBoots, Shoes,\nFURS:\nSets Blk. Wolf,\nRobes, Lined and Trimmed\nSets Grey Wolf,\nRobes, Lined and Trimmed\nBuffalo Robes,\nBuffalo Coats,\nGrey Wolf do.\n\nSTEWART & WOOTTON,\n\nPRINCE ALBERT, W.T.\nTO THE PUBLIC.\n\nWe have made arrangements to leave papers at J. J. Agnew's hardware store, the Post Office, T. N. Campbell's news store and Mackley & Co.'s dry goods store. These being near some of the above mentioned places will find their [address] there.\n\nNEW YEAR'S ENTERTAINMENT.\n\nThe Sabbath School entertainment held in the Methodist church on the evening of the New Year was very enjoyable to all who had the privilege of attending, and the programme was a repetition. The following is the programme, each doing their part very creditably:— Opening hymn—\"All hail the power of Jesus' name.\" Prayer. A little song by the pastor. Recitation by James Eby. \"Wreck of the 'Temeraire' sung by the children. \"Jewels\" recitation by Clara Pride. \"Be gentle,\" recitation by John Turner. \"Who will bear the showery load?\" singing by Miss Anna Cass. \"Recitation by Miss Anna Cass. \"Recitation by Miss Anna Cass. \"The snail and the cricket.\" Song by James and Willie Willis. \"Over the snow.\" Recitation by Alice Sinclair. \"The little lamb.\" Song by Anna Cass. \"Pilgrims of the night.\" Recitation by Robert Martin. \"Speech by little Mary Hamilton.\" Speech by little Mary Hamilton. \"Speech by little Mary Hamilton.\"\n\nLONGEST.\n\nWe had the pleasure of a conversation with old Mr. George McKay the other day, and while talking about his age, he said that he had just about completed his 90th year—to-day or tomorrow. Mr. McKay undoubtedly the oldest settler on the Red River, having come to this country in 1823, when he was only 16 years of age, and been here ever since. His remains are the only history of this country are very interesting. He has lived through many changes, and his body, as we purpose spending an hour so with him tomorrow day in order to get a few facts regarding the early history of this country in its earlier days. We can imagine the old gentleman telling us of the adventures that took place, and how he will live to see more of them. On the morning of our visit to him, he was engaged in writing on a piece of paper, which he had placed on a table below, whilst his pipe was out, and his eyes and ears are fine and sharp. He seems to be in good health, and there is no suspicion of form or wrapping, and yet he and the doctor feel the cold air of the North-west, and the people of the present generation say to themselves, \"How can the old gentleman stand such things?\"\n\nThe goods of Mr. T. E. Jackson will arrive shortly. Call at his new store at the Mission.\n\nJ. SINCLAIR,\nMERCHANT TAILOR.\n\nNew Goods\n\nSUITS\n\nA full assortment of French, English, Irish, Scotch and Canadian Tweeds. English and French Worsted. Fine Silk Broadcloth and Doeskin always on hand. Bevans and Chariots Overcoatings. GENTS' FURNISHINGS.\n\nJ. SINCLAIR, Merchant Tailor.\n\nFarmers' Restaurant.\n\nMeats at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY,\n\nPROPRIETOR.\n\nREAL ESTATE.\n\nThe undersigned having purchased a NUMBER OF LOTS ON THE HERD AND BAKER ESTATE, Wishes to inform the public that they are now on the market.\n\nHARRY E. HURD.\n\nImportant to Farmers.\n\nThe undersigned have purchased the Engine and Threshing Machine lately owned by Thom McKay, Esq., and are having them thoroughly repaired and will be ready in a few days to attend to all who may require their services.\n\nFarmers may depend on having their grain threshed in their own locality.\n\nApply to\n\nB. L. SHANNON\n\nor W. JOHNSON.\n\nN.B. Murray, Shannan & Johnson have another first-class engine and thresher for sale next season in connection with the one lately purchased.\n\nMACPHERSON & CLARKSMILL.\n\nGENERAL DEALERS.\n\nMAINS BLOCK, Prince Albert, N.W.T.\n\nCash Paid for Grain.\n\nJ. L. JOHNSON & CO.,\n\nHave just received a large and general assorted stock of Hardware;\n\nALSO\n\n500 GALLONS OF COAL OIL.\n\nNo. 1 Campbell's Block, Prince Albert.\n\nRIDGE STORE.\n\nJohn E. Sinclair\n\nDry Goods, Groceries,\n\nETC., ETC.\n\nStorage and Re-Shipping Warehouse.\n\nPRINCE ALBERT ESTABLISHED - 1860.\n\nPLANTING MILLS AND SASH AND DOOR FACTORY.\n\nDOORS, SASH, &c.\n\nGOODFELLOW BROS'.\n\nW. J. CARTER,\n\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and Estimates furnished when required.\n\nHEINTZMAN AND COMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nNEXT ROSSIN HOUSE.\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES\n\nNone but First-class Workmen Employed in their Manufacture.\n\nAPPLY AT\n\n\"The Times\" Office,\n\nPRINCE ALBERT N.W.T.\nHudson's Bay Co. Farming Lands\n\nFor Sale in Manitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nTown Lots For Sale\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Goschen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC.J. Frydges, Land Commissioner.\n\nStobart, Eden & Co., General Merchants and Indian Traders.\n\nSeven Cases of Fancy Goods Just received from England containing Ladies', Girls' and Children's Underwear, Call Dresses, Ladies' Mantles and Balotels, Ladies' and Maids' Winter Jackets, Ladies' and Maids' Costumes.\n\nThe Echo House, Qu'Appelle.\n\nD.A. McGregor, Principal Artist and Illustrator.\n\nAcorn & Cross, Pump, Sleigh & Carriage Factory.\n\nTo the Ladies, Millinery and Ladie Furnishings.\n\nPotatoes.\n\nMiss Mack & Co., Campbells Black River Street, Prince Albert, N.W.T.\n\nGrain Wanted.\n\n3,000 Bushels of Grain (Oats and Barley).\n\nApply to John Wymerskirch, Prince Albert, N.W.T.\n\nThe Gable House, The Best Beer and Cigars.\n\nOf the Finest Brands always on hand.\n\nWholesale and Retail.\n\nJohn Wymerskirch, Proprietor.\n\nFurniture Store.\n\nG. Carter & Son.\n\nRed Brick Store.\n\nOccupied by Mr. E. Jackson's team store, and will be prepared to take orders for Bedsteads, Cupboards, Lounges, Tables, and other heavy furniture.\n\nG. Carter & Son, Proprietors.\n\nCaledonian Restaurant.\n\nOpposite the H.B. Mill.\n\nMeals at All Hours.\n\nLivery and Feed Stables.\n\nIn connection.\n\nNotice.\n\nWe have duplicated the order for stationery, which unfortunately was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSpink & Maveety, Proprietors.\n\nSubscribe.\n\nSubscribe.\n\nSubscribe.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which unfortunately was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETY, PROPRIETORS.\n**Masonic Funeral**\n\nBurial of Mr. Hiram Budd, late master of the Masonic Lodge at Coburg.\n\nOn Sunday last, the funeral of Mr. S. Graham, who died last week, took place at the Harmony Church, Wiseman street, and was attended by many friends and relatives.\n\nThe Rev. Mr. Thomas, Principal of the Masonic Lodge, was present throughout the service.\n\nThe body was carried by members of the lodge and laid to rest in the family vault.\n\n---\n\n**Town News**\n\nAll changes for last, December, are hereby posted.\n\nThe far south passage will close at noon today.\n\nRev. Mr. Clark, of Bathurst, who has been spending his summer holidays in Prince Edward Island, has returned home yesterday.\n\nThe Rev. Mr. Macdonald, whilst here, visited with many friends, and expressed very strong opinions against the proposed amalgamation of the two parishes at St. Mary's Church.\n\nSergt. John Reid, left for Duck Lake, on the 21st inst., to meet Col. Henderson, who is stationed there.\n\nMr. Judge, of Bathurst, socio at the club hall, went to Winnipeg, with a proposition for some new members.\n\nDick Lahey, of St. John's, returned to Prince Edward Island, where he expects to remain until after the election.\n\n---\n\n**Best Baking Powder**\n\nDr. Edward M. Lee, the present President of the Royal Society, has counter the many experiments on the composition and value of baking powders. Dr. Lee's tests were made to determine whether the powder was most economical to use, and as their uses are almost identical in bakers' goods, the results of Dr. Lee's tests would be of great interest to the trade.\n\n---\n\n**Horse Shoe Store**\n\nAt prices that beat the wares of the Saskatchewan in the fall.\n\nTHOMAS O. DAVIS.\n\nG. B. B.\n\nAT THE ROCK BOTTOM STORE\n\nSome of our leading line are:\n\n- Grey and Fancy Flannels\n- White and Grey Blankets\n- Fancy Comforters and Quilts\n- Shawls, Nubias, Scarfs,\n- Wincies, Cottons, Sheetings, Presses, Prints, Duck, Denims, Towels, etc.\n\nA call is solicited. Store formerly occupied by J. O. Davis & Co.\n\n---\n\n**Walters & Baker**\n\n1879.\n\nThe Buffalo Hall CLEARING SALE\n\nA Grand Success\n\n---\n\n**Betts & Gwynne**\n\nT. N. Campbell, Bookseller and Stationer\n\nCHRISTMAS CARDS!\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\n---\n\n**Royal Powder**\n\nThis powder is now marketed.\n\n---\n\n**Shopping**\n\n---\n\n**Real Estate**\n\n---\n\n**Christmas Cards!**\n\n---\n\n**Coal Oil**\n\nNo. 1 Campbell's Block, Prince Albert", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883011001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 3659, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5224, 2], [5224, 9793, 3], [9793, 11943, 4], [11943, 11943, 5], [11943, 14382, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]