[{"id": "55fe1aaf0ed2d8073a4f63f279c7a1ee1d456b83", "text": "BANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nGENERAL MERCHANTS.\n\nWE MEAN BUSINESS\nClearing Sale!\nEverything goes at Prices never heard of before!\n\nR.C. WIGMORE & CO.\nThe Old Reliable\nA large supply of second-hand old weight clocks.\n\nSeason 1886\n\nTo Shippers\nThe Lake Steamer will leave Selkirk at 9 o'clock A.M. on Friday, May 28th.\n\nAll Goods at Selkirk at this date awaiting shipment by the Saskatchewan River Navigation Company (Limited), through their agent Messrs. Baillie & Co., who will make special rates for shipments and arrange for payments to be made in accordance with the following:\n\nThe best packages, accommodation to be sent in Room, Table and Attendance furnished in the steamer.\n\nFor further information apply at the Hudson's Bay Company's Office, Prince Albert.\n\nGEO. A. BENTLEY.\nPRINCE ALBERT\nPlaning Mills and Sash and Door Factory\nOne Reilly and MacKay Sts.\n\nFURNITURE!\nCHEAPER THAN EVER.\nFor the next thirty days I will sell at 40% less than cost.\n\nGILBERT E. CARTER.\nWILLIAM KNOX.\nCARPENTER, ETC.\nOffice and Workshop.\nNear Presbyterian Church.\n\nA.W.R. MARKLEY,\nGen. Agent and Auctioneer.\n\nORDINARY.\nAt Shannon & McLeod.\n\nSHANNON & McLEOD\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nHow is Sheep for Rip?\nWhen shall we get our medals?\nChoice Cigars at Clark's Drug Store.\nWhat is wheat doing now?\n\nLadies' Shoulder Bears at Clark's Drug Store.\n\nHis Lordship the Bishop will preach in the Roman chapel next Sunday evening.\n\nAug. 1st\n\nMr. A. L. Sifton and child (wife) and Mrs. Sifton from Prince Albert came here last evening.\n\nDominica Brand of Lima Juice is one of the purist and best refined on the market. Sold at Clark's Drug Store.\n\nMr. H. P. Polson under Superintendent Perry, returned from Regina on Wednesday last.\n\nMr. F. Pritchard won the cup at the Saskatchewan Rifle Association match yesterday.\n\nDalmatian Insect Powder. It will kill Cockroaches, it instantly destroys Flies, Bugs and Plaice, Fly. For sale by A. H. Clark.\n\nPhotography using young pine canoes, used by the Indians from Spruce Woods, Deer Hill, or by leaving their orders at Tom Turner's.\n\nMiss Stewart of Montreal, arrived here this morning. This young lady is a niece of Mr. John Stewart, merchant, of this town.\n\nAn old adage says today will be remembered as a striking and instructive illustration of the comparative worth of the various kinds of baking powders now on the market.\n\nThe steamer North West, in charge of Commodore Robert Napier, left for Edmonton, with some 200 tons of freight on board.\n\nA challenge match between two members of the Bridgie Rifles Association, Mr. William E. Baker took place on the range this morning, Mr. Baker firing 77 points and Williamson 55 points. Mr. Baker winning by two points.\n\nHarvest is now in full swing. Mr. R. Macintosh delivered a farewell sermon to his late parishioners at St. Catharine's. There was a large congregation, no doubt many of whom were disappointed not being able to attend the church. The service was impressive, the band played, everybody getting up regularly, and Rev. Mr. Matheson preached at Lindsay, when the audience was so thick that the sermons had to be repeated.\n\nThe medal given by the President of the Saskatchewan Rifle Association, and which was won by Mr. T. E. Baker on Monday night, was delivered yesterday afternoon. It is the handsomest design in the way of medals we have seen for years. The medal is an oval mounted with crossed rifles and bayonets and a gold wreath of maple leaves in the center. On the reverse side is the inscription \"Given by the President.\" It has to be won twice by the same competitor.\n\nOn Monday evening a large congregational meeting was held at St. Paul's Presbyterian Church, according to the usual custom. Rev. Mr. McWilliam, after making a short address, stated that they had received the Rev. Mr. Matheson's resignation. It was moved by Mr. MacLeod and seconded by Mr. Graham concerning the Presbytery in accepting Mr. McWilliam as a member. Mr. Graham moved that Mr. McWilliam be asked to accept a suitable minister for this charge, who may be expected to arrive here some time in September.\nTHE PRINCE ALBERT TIMES\n\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nTERMS—$2.50 per annum in advance.\nSingle numbers 10 cents each. No issue will fail to be inserted in the paper. Business letters 15 cts. per line.\nNo advertisement inserted for less than $1.\nAdvertisements without instructions will be inserted until further notice.\nAll letters will be addressed to the Proprietor.\n\nJ. D. MAVEETY, Proprietor.\n\nTHIS PAPER may be found at:\nKerr's News Agency, Advertising Bureau, 189 Main Street.\nA. C. Wilson, Advertising Bureau, 189 Main Street.\nM. J. Wilson, Advertising Bureau, 189 Main Street.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church\n\nThe Mission Chapel.\n\n11 a.m.—Rev. Mr. McMillan, R.D.\n1 p.m.—Rev. Canon Flett, R.D.\n3 p.m.—Rev. Mr. McMillan.\n\nSt. Andrew's.\n\n10:30 a.m.—Rev. Mr. Maclean.\n11 a.m.—Rev. Mr. Maclean.\n\nSt. John's.\n\n1 p.m.—Rev. Mr. Maclean.\n\nSt. James'.\n\n3 p.m.—Rev. Archdeacon McKay, R.D.\nSt. Anne's. R. Catholic.\n\n10:30 a.m. and 3 p.m.—Rev. Mr. Anderson.\n\nSt. Paul's (Presbyterian).\n\n11 a.m. and 3 p.m.—Rev. Mr. McMillan.\n\nFRIDAY, JULY 30, 1886.\n\nOUR VOLUNTEERS\n\nA few months ago we took occasion to set out in these columns the claims of our volunteers for recognition at the hands of the Government. At that time there was a rather wide spread feeling that our claims were likely to be ignored, but we have always been sanguine enough to expect that full recognition would be forthcoming in time, and the result has proved the correctness of our views.\n\nThe last mail brought notices to those who served in the Prince Albert Barracks that the Act 40 Victoria Chapter 90, setting the question at rest in a way that cannot fail to be agreeable to our volunteers.\n\nWe may now allow to congratulate all concerned on this decision of the Government, the more so as it is another, and we think a conclusive proof, that the Government are far from entertaining any feeling adverse to the interests of our settlement, and a few热心men seem to dread. Indeed, when along with their action in connection with the Police Barracks, a report is made which will be found in the present issue, it goes to prove that the interests of the important settlement are at present having, and in future will receive ample justice from those in authority.\n\nWe have good reason to believe that the Government will be disposed to admit the Prince Albert volunteers to the benefits of the Bounty Act has been at least hastened by the exertions of Capt. Macdonald, who once and again has pled the cause of the local force, and in this he has been ably seconded by Acting-Mayor Betts, his colleague in the late deportations on the barracks matter. New difficulties may arise; but forget that thanks are also due to our member Mr. Hughes, and others who brought the weight of their influence to bear in the right direction.\n\nWe have not yet heard whether the volunteers are to receive medals as well as scrip, but we have no doubt this will follow as a natural consequence.\n\nThere seems to be little doubt that a new extradition treaty between the United States and Great Britain will be concluded, and that which there will be a reciprocity in defaulters and dynamiters between the two countries. There is no reason why there should be any more difficulty in following a similar practice between Canada and United States or between the United States and Canada, than from one province or state into another. International boundary lines should not afford a screen for crime.\n\nTHE SYNOD.\n\nThe Synod of the Diocese of Saskatchewan will meet in St. Mary's Church on Wednesday next, the 9th August, at 11 a.m., with the Bishop in the chair. His Lordship the Bishop will preach, as a rule, when at the Synod. Mr. McMillan's in the morning and the Chaplain's in the evening.\n\nSt. Catharines.\n\n10:30 a.m.—Rev. Mr. McMillan, R.D.\n11 a.m.—Rev. Mr. McMillan.\n\nSt. Paul's.\n\n10:30 a.m.—Rev. Mr. McMillan.\n\nSt. Andrew's.\n\n10:30 a.m.—Rev. Mr. Maclean.\n\nSt. John's.\n\n1 p.m.—Rev. Mr. Maclean.\n\nSt. James'.\n\n3 p.m.—Rev. Archdeacon McKay, R.D.\nSt. Anne's. R. Catholic.\n\n10:30 a.m. and 3 p.m.—Rev. Mr. Anderson.\n\nSt. Paul's (Presbyterian).\n\n11 a.m. and 3 p.m.—Rev. Mr. McMillan.\n\nFRIDAY, JULY 30, 1886.\n\nCOMPARATIVE WORTH OF BAKING POWDERS.\n\nREPORTS OF GOVERNMENT CHEMISTS\n\nAs to Purity and Wholesomeness of the Royal Baking Powder.\n\n\"The above diagram illustrates the comparative worth of various Baking Powders. The Royal Baking Powder is tested by Professor E. G. Levis, Ph.D., of the University of Pennsylvania, who finds it contains tartar powder of high degree of merit, and does not contain any traces of phosphate, or other injurious substances.\"\n\nE. G. Levis, Ph.D.\n\n\"I have examined a package of Royal Baking Powder purchased by myself in the market. I find it entirely free from alum, torn aside, and placed in a solution of tartar powder of high degree of merit, and does not contain any traces of phosphate, or other injurious substances.\"\n\nH. A. Mortz, Ph.D.\n\n\"I have examined a package of Royal Baking Powder purchased by myself in the market. I find it entirely free from alum, torn aside, and placed in a solution of tartar powder of high degree of merit, and does not contain any traces of phosphate, or other injurious substances.\"\n\nS. B. Hartz, Ass't Manager, American Institute, New York, and at State Fairs throughout the country.\n\nNOTE.—The above diagram illustrates the comparative worth of various Baking Powders. The Royal Baking Powder is tested by Professor E. G. Levis, Ph.D., of the University of Pennsylvania, who finds it contains tartar powder of high degree of merit, and does not contain any traces of phosphate, or other injurious substances.\"\n\nTHE WEEKLY SUN!\n\nArrangements are being made by the publishers of THE MANITOBA SUN for the publication of a Weekly Edition at an early date. The price of the paper will be Eight Pages of Seven Columns each—56 Columns in all—and the price will be placed at the very low figure of $1.50 PER ANNUM.\n\nPAYABLE STRICTLY IN ADVANCE.\n\nTHE WEEKLY EDITION WILL CONTAIN\n\nThe News of the Week, Selected Miscellany, An Interesting Serial, and Special Departments of Peculiar Interest to the Home Circle. No effort will be wanting to make our Weekly a welcome visitor everywhere.\n\nPARTIES intending to subscribe are requested to send their names with the price of subscription to the office of THE MANITOBA SUN, 19 Market St., Winnipeg, Man.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886073001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2745, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4135, 1], [4135, 10537, 2], [10537, 10537, 3], [10537, 10537, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]