[{"id": "a6e2853410aeaea0e29183f6f1baf6e8e3435c12", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 9, 1885.\n\n$2.50 A YEAR.\n\nBANKINGHOUSE\nof\nMacintosh & Knowles,\nPrince Albert, N.W.T.\n\nLincoln College\n\nNOTICE\n\nStrayed!\n\nCame on to my premises, at Pocha Settlement, about a month ago a brown mare with star on forehead, and most with white mane and tail. Owner can have the same on proving property and paying expenses.\n\nCHARLES POCHA\n\nHouse to let.\n\nWe wish to inform our customers and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\n\nShannon & McLeod.\n\nGENERAL NEWS.\n\nSt. Louis, Sept. 28.—A single well race on Creve Coeur Lake this afternoon between Guschar and Harry Parker, ended in a draw. Guschar, a pacer, $300, Guschar gave Parker a tremor, was won easily by Guschar. Time, standard 21½; Parker, 23¾.\n\nRochester\n\nRochester, N.Y., Sept. 28.—At the track today Colonel Conklin exhibited to beat his own record, and moved over a three-mile course in 14 minutes. The official time was 18:15, but the horse was taken by several stop watches at 20:30.\n\nGreat Britain\n\nLondon, Sept. 28.—The arrival here of Rear-Admiral Commander-in-chief of His Majesty's forces in India, Sir Edward Smith, has been officially announced. Sir E. Smith, who has been appointed to the command of the British forces in India, will succeed Lord Wodehouse, who has been ordered back to England. Sir E. Smith, who has been appointed to the command of the British forces in India, will succeed Lord Wodehouse, who has been ordered back to England.\n\nTenders\n\nFor the supply of 50,000 lbs. of potatoes\n\nDentist\n\nGeorge A. Bentley, Barber and Hair Dresser.\n\nFurniture\n\nFurniture\n\nCaledonia Brewery\n\nEast End\n\nCanadian\n\nSt. Thomas\n\nWindor\n\nPort Arthur\n\nBankinghouse\n\nLincoln College\n\nNotice\n\nStrayed!\n\nHouse to let.\n\nGeneral News\n\nSt. Louis\n\nRochester\n\nGreat Britain\n\nLondon\n\nTenders\n\nDentist\n\nFurniture\n\nCaledonia Brewery\n\nEast End\n\nCanadian\n\nSt. Thomas\n\nWindor\n\nPort Arthur\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKA TCHEWAN REVIEW\n\nPUBLISHED BY\n\nJ. D. MAVEETY\n\nAT\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, OCTOBER 9, 1885.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m. — Service.\n12 noon — Dinner.\nThe Mission Chapel.\n11 a.m. — Rev. A. H. Wright.\n3 p.m. — Sunday School.\n5 p.m. — Rev. A. H. Wright.\nSt. Catharine's.\n10:30 a.m. — Divine Service.\n3 p.m. — Rev. E. Matheson.\nSt. Paul's.\n2 p.m. — Rev. J. B. Macdonald.\nSt. Andrew's.\n10:30 a.m. — Rev. Canon Fiedt, R.D.\nSt. John's.\n3 p.m. — Ven. Archdeacon McKay, R.D.\nSt. Peter's (Presbyterian).\n6 p.m. — Ven. Archdeacon McKay, R.D.\nSt. Anne's R. Catholic.\n10:30 a.m. — Rev. Mr. Andrews.\nSt. Paul's (Presbyterian).\n10:30 a.m. — Rev. Mr. Williams.\n\nFRIDAY, OCT. 9, 1885.\n\nRIOT IN MONTREAL.\n\nPublic Officers Attacked by an Anti-Vaccination Mob.\n\nMontreal, Sept. 28th. In consequence of the inauguration of compulsory vaccination, about nine o'clock this evening, a mob assembled in front of the East End branch of the Health Office and forcibly wrecked the building. The police did not interfere, and the mob proceeded upon the central office, in the City Hall. By this time, however, a riot had already broken out in the city, and a number of stable owners gathered together, but having no means to consume them, they took shelter in the stable yard and fell asleep. After the mob had smashed the central office they turned their attention to the windows in this building likewise. Fireworks were soon fired at the windows and the mob proceeded to break them and laugh. Things were knocked so bad that the police were called in, but there was no need to use these. The constables charged the mob, clubbed them and then proceeded to break the windows in the city hall. The mob broke up into different bodies and proceeded to wreck the windows of the offices of the medical health officer, chairman of the finance committee and public vaccinators. The mob was dispersed by the police.\n\nLOCHIAN.\n\nLosheim, Sept. 28th. Col. Williams, of the Second Battalion, has been ordered Captain Reid to tender his resignation as adjutant, and the captain refuses. A court-martial will be held to determine the conduct of Col. Williams while on command in the reserve camp, and some very deep steps will probably be taken before the matter is settled.\n\nTHE HON. THOMAS WHITE\n\nIn a few days the Hon. Thomas White will be amongst us, and through a judicious selection of hard working men and a few friends, he expects his advent will be nearly complete as it is possible for them to be, until his actual arrival. The arrangements made both for his reception, and the banquet to be given him, are excellent, and we feel sure that everything will turn out a success. If the Honorable Gentleman is as pleased with all that is being done to make his stay here comfortable and agreeable as we believe he will be, we feel sure that when Mr. White leaves us that we will carry away a very pleasing impression of this place to use. The Hon. Prince Albert does not allow his friends to be forgotten, and it is to be hoped that our neighbours in the country, will come in large numbers and rally round us to help us in our endeavours. One thing we would like to call to the notice of our readers and that is, that there is a time and place for all things. If any one had any suggestion to make, let him make it, but let him do it where his right arm is set apart for that purpose at- tive, but do not let our guest when he is looking round mix us in every turn met with suggestions, com- plaints, or grumblings. No one who has been here during the last six months will fail to see that our visitors are treated with kindness and consideration, and our visitors and ourselves for his comfort, is to bear this in mind.\n\nTHOS. POWERS,\n\nIN PREPARED TO TAKE CONTRACTS FOR Brick, Plastering and Stone Work.\n\nAll orders promptly attended to. Estimates furnished.\n\nBrick and Lime always on hand.\n\nPrince Albert, Sask.\n\nKNOK & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nC. D. NORTHGRAVES,\n\nWatchmaker and Jeweller.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWART BROS., TRADERS, GENERAL MERCHANTS\n\nHave just received a large stock of DRY GOODS AND GENERAL GROCERIES.\n\nTeas, Tobacco, Coffee, Oatmeal, Sugar, Carnel Oeds, Cal. Pears.\n\nNotice of Dissolution.\n\nSTEWARD BROTHERS.\n\nIn Prince Albert, in the Ninth Ward.\n\nGROCERY AND HARDWARE.\n\nAT COST.\n\nNOTICE.\n\nAll parties indebted to the old firm must settle before the 1st October next, owing to the change in the business.\n\nJOHN MACDONALD,\n\nSuperintendent General, Indian Affairs.\n\nSTEWARD BROS.\n\nPrinted Albert, Sept. 16, 1885.\nA GREAT TROTTER DEAD.\n\nGoldsmith Maid's Career Ended—The Famous Mare Dies in New Jersey Stable.\n\nNew York, Oct. 8.—News of the death of Goldsmith Maid, the trotter, who reigned for years as queen of the turf, was received in Trenton to-night. Since her purchase by Mr. Smith in 1875, she had been tenderly cared for on H. N. Smith's famous stall farm near Trenton. She died peacefully at her post before her death. Veterinary Surgeons Bradshaw and Dr. W. W. R. Phillips made a post-mortem examination which showed that death was caused by fatty degeneration of the heart.\n\nGoldsmith Maid was valued at $30,000. Countess of the Hunt had dragged all sorts of flattering wages over almost every race course in Canada for several months. Mr. Goldsmith had purchased her, and sold her for $50,000.\n\nThis gentleman had a better opinion of her than most people, and he tried to something with her and he finally tested her on a half mile track in Canada, where she showed admirable speed, and Mr. Goldsmith bought her owner again at cost of $800. After this, the horse was retired, and her fate as a trotter began to seem inevitable. She was said to be dead at country fair, where she was exhibited as a trotter.\n\nWhen she was retired, they thought she matched to trot against the American girl, who won the quarter-mile race for a large purse. Countess of the Hunt made then the last time the 2-25. Then she had all she could do in making the trotting races, but she was not successful. In the beginning of her successes Mr. Goldsmith sold her to Hon. J. B. Murray for $20,000.\n\nAfter these gentlemen thought they had got the best out of her, they sold her to Mr. Murray for $10,000. But they were mistaken, and when she made then the magnificent record of 27-4, she was worth $30,000. Then they, as well as a great many others, were convinced that she was worth more. Mr. Murray paid $30,000 for her.\n\nHer last trot was in California, when she was matched against champion St. Louis. She won the race, and Mr. Murray said it was that $100,000 changed hands on that occasion. Her form improved as she got older, and she was worth more and more gradually forget her name. When she was retired it was intended to use her as a brood mare, but Mr. Murray had only given her back to the stable before she died. At the time of her death she had trotted 162 races, of which she won 92. Her earnings were nearly $20,000.\n\nFORTHE MOUNTAIN\n\nThe Indian Prisoners Arrive in the City Last Evening.\n\nThe depot platform was crowded with people last evening. The attraction was the arrival of the prisoners from Fort Macleod, who had been sent there for their own protection. The Indians and Philip Gilmour, who was arrested at the scene of the crime, were brought to the city last evening.\n\nCHOOSING A HUSBAND.\n\nChoosing a husband is a fascinating event among the Indians, and the Cree people have a special ceremony for this purpose. It is a very important rite in respect. If a man wishes his feet on the door mat before sunrise, he will make a good husband. If a man puts his head under his chin, he will make a good wife. If a man stands outside the house, he will make a good husband. If a man stands inside the house, he will make a good wife.\n\nTORONTO.\n\nToronto, Sept. 28.—The Irish athletes held a meet today for New York. They are the Irish team will visit Montreal next week.\n\nCHASING THE PRINCE ALBERT TIMES\n\nThe Prince Albert Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and information.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nEXHIBITION.\n\nSecond Annual Exhibition of the Lorne Agricultural Society—Price List.\n\nThe Second Annual Exhibition of the Lorne Agricultural Society was held on Thursday last. Although the weather foretold the sky was clouded and threatened rain, yet every person was most pleasantly disposed to attend, being the crops being got in very late in the spring on account of the recent troubles, and the weather being so fine. The settlement fears were entertained by many that this year the Exhibition would not be attended to, but contrary to these expectations the Exhibition was a success, and one that would do credit to almost any great exhibition.\n\nThere were more facts and circumstances from early morning the people from the country might be seen wending their way to Lorne.\n\nAt 10 o'clock the time appointed everything was in its place and the judges had arrived and were at work. The exhibit of live stock was good, especially the sheep, which were exhibited by the Thompson Bros., which showed beyond a doubt that the District of Lorne is destined to become known as a stock raising country. The grain exhibited by Mr. W. Flaxton was an excellent quality, and will be looked upon by that department of agriculture.\n\nThe display of vegetables and roots was also very good.\n\nThere was a large exhibit of butter and cheese, all of which was of most excellent quality.\n\nMr. J. F. Nielson made a very creditable display of roots and shoes.\n\nThe only disappointment was the absence of the Ladies, and it is to be hoped that in the future our Ladies will take a greater interest in the exhibition.\n\nWhat a fine and well-reflected general credit upon the exhibitors.\n\nThe following is the Prize List:\n\n| Category | Description | Judge(s) | Prize |\n|----------|-------------|----------|-------|\n| Livestock | Sheep       | Thompson Bros. | $5 |\n|           | Cattle      | Thompson Bros. | $5 |\n|           | Pigs        | Thompson Bros. | $5 |\n|           | Horses      | Thompson Bros. | $5 |\n|           | Chickens    | Thompson Bros. | $5 |\n|           | Eggs        | Thompson Bros. | $5 |\n|           | Butter      | Thompson Bros. | $5 |\n|           | Cheese      | Thompson Bros. | $5 |\n|           | Vegetables  | Thompson Bros. | $5 |\n|           | Roots       | Thompson Bros. | $5 |\n|           | Shoes       | Thompson Bros. | $5 |\n|           | Butter      | Thompson Bros. | $5 |\n|           | Cheese      | Thompson Bros. | $5 |\n|           | Vegetables  | Thompson Bros. | $5 |\n|           | Roots       | Thompson Bros. | $5 |\n|           | Shoes       | Thompson Bros. | $5 |\n\nJ. M. CAMPBELL\n\nHas just received a complete and very large stock of\n\nREADYMADe CLOTHING\n\nDry Goods\n\nCrockery,\n\nAND\n\nGroceries!\n\nAlso a large quantity of\n\nWINNIPEG FLOUR.\n\nCHEAP FOR CASH.\n\nJ. M. CAMPBELL.\n\nHORSE SHOE STORE\n\nThe Best, the Only Place\n\nTO BUY YOUR\n\nGOODS CHEAP.\n\nDry Goods\n\nAND\n\nClothing\n\nAT WHOLESALE PRICES.\n\nThe old man's bound to get there, and we will call and examine stock and get prices.\n\nT. O. DAVIS\n\nMEDICAL HALL\n\nT. E. JACKSON,\n\nChemist & Druggist,\n\nDEALER IN\n\nDrugs, Chemicals,\n\nDye Stuffs, Patent Medicines,\n\nToilets and Fancy Articles,\n\nDruggists' Sundries,\n\nSpices, etc., etc.,\n\nOF THE BEST QUALITY.\n\nNew goods just arrived.\n\nPrice moderate. Terms cash.\n\nApply to agent for this district for Clinton's Transfer for rupture and for apparatus for cure of deafness.\n\nT. E. JACKSON\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885100901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 3671, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2092, 1], [2092, 6866, 2], [6866, 10562, 3], [10562, 13986, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]