[{"id": "d74e2c5ed996bdc3d61e7f61b8050e19c4ef811d", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m. - The Rev. Principal Firth.\nThe Missing Chapel.\n1 p.m. - The Rev. Mr. Wright.\n\nSt. Catherines.\n10:30 a.m. and 6 p.m. - The Rev. E. Matheson.\n\nSt. Paul's.\n10:30 a.m. - The Rev. Mr. Prichard.\n\nSt. Andrew's.\n10:30 a.m. - The Rev. J. F. Prichard.\n\nSt. John's.\n9:30 a.m. - The Rev. Mr. Wilson.\n\nSt. Peter's.\n7 p.m. - The Rev. Mr. Prichard.\n\nSt. Paul's (Presbyterian).\n11 a.m. and 5 p.m. - The Rev. Mr. McWilliam.\n\nC.M. Church, Red Deer Hill.\n10:30 a.m. - The Rev. Mr. Wilson.\n\nC. Methodist Church, Gauchan.\n7 p.m. - The Rev. Colin Parker.\n\nC. Methodist Church, Mission.\n7 p.m. - The Rev. Colin Parker.\n\nFRIDAY, NOVEMBER 21, 1884\n\nN.W.COUNCIL ELECTION\n\nAs we asserted in a recent issue, we have no reason to believe that the French will be successful at the next election for the choice of members separate and distinct from our own. We furthermore entertain very slender hopes of an additional member being granted to the district as a whole. If these views are correct, the next matter requiring consideration is the report that at the coming election it is the intention of the French to stick together and offer their votes to such a person they expect virtually to control the result. The idea at present entertained is that the recipient of that vote is to be decided upon by a convention assembled for that purpose. Take this wisdom will work as well as is hoped by its promoters to say the least of it, extremely doubtful, and will depend entirely upon the course of events. It remains to be doubted whether the proposed convention can decide upon a representative with sufficient unanimity to insure anything but a failure to take place when the election is actually held. In the next place it is neither unnatural nor unreasonable to suppose that the French may desire to return one of their own, whether for personal reasons or simply to keep warm the place until M. Riel may have by an increased term of residence, qualified for the privilege. Any such move as this would be charged with the anomaly on our part, as they are well aware. In fact their obvious expectation, and not an unreasonable one, is that while we are squabbling among ourselves, they will step in and decide the matter for us. We take it that as the members of our own community who have been of late professing such warm love for their fellow-countrymen, have only done so in the hope of being able to influence each one of themselves to the front, even they will be disposed to join in concerted action to pre-\n\nPUBLIC NOTICE.\n\nHORSE SHOE STORE\n\nFOUND.\n\nO. E. HUGHES & CO.,\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and Youths Clothing.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING.\n\nPRINCE ALBERT.\n\nPHOTOGRAPHS!\n\nNEW STUDIO!\n\nNEWSTANDS!\n\nEAST END.\n\nPETER SMITH,\n\nBaker and Confectioner.\n\nAll kinds of Bread Orders Made to Order.\n\nThe Best Bread West of Winnipeg.\n\nTERMS STRICTLY CASH.\n\nThe Dominion Organ and Piano Co.\n\nSHANNON & MCLEOD\n\nDEALERS IN ALL KINDS OF Boots & Shoes, Rubbers, Etc.\n\nHas the largest and most complete Factory in the West.\n\nWe are now manufacturing SQUARE AND GRAND PIANOS.\n\nDOMINION ORGAN AND PIANO COMPANY.\n\nDOMINION BUILDING, PRINCE ALBERT.\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884112101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 989, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 3292, 2], [3292, 3292, 3], [3292, 3292, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]