[{"id": "35b53e5d96609f038d8a2ac53c06b8620707ef98", "text": "THE PRINCE ALBERT TIMES\nPUBLISHED BY J. D. MAVEETY\nPRINCE ALBERT N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's Church—Rev. Mr. Charles.\nSt. John's Church—Rev. Mr. Smith.\nSt. Andrew's Church—Rev. Mr. Maclean.\nSt. James' Church—Rev. Mr. Taylor.\nSt. Paul's Church—Rev. Mr. Wright.\n\nThis paper may be found in the following newspapers:\n\nThe New York Times.\nThe New York Tribune.\nThe New York Herald.\n\nFRIDAY, APRIL 6, 1888.\n\nTHE LIQUOR QUESTION.\n\nThis question is now engaging the attention of the Northwest, and is one with which, if reports be true, the people will very soon be called upon to deal. It is reported that the Dominion Parliament will not deal with the question any further than to give the Northwest Council power to legislate in the matter. The question before the people will be whether they should have a licence system or total prohibition, or some half way measure such as breweries and beer or the system now in force, and already many declare is undesirable, that it should be made the main and in fact the only issue at the next local election, that the candidates should and must be prohibition and anti-prohibition and other matters public interest questions of a secondary place. We take the ground that such a position is wrong, that the electors should not be called upon to support men whose only qualification might be that they have certain views with regard to the liquor traffic. The election should not be conducted on such principles. The best men should be elected, men of ability and known probity, and who are known to be for the general welfare of their particular district as well as the Territories generally at heart, and men who could be depended on to carry out the best views of the electors on the liquor question. To save expense it might be taken simultaneously with the election, and should be by ballot, and is likely by secret vote that the true feeling of the people could be obtained on this question. We are aware that there are many men who would not be ashamed to vote for liquor if they could do so secretly, but who would not vote openly; and on the other hand, many who are opposed to liquor would be intimidated or influenced to vote contrary to their convictions unless the ballot sheltered them. Open voting would undoubtedly strengthen the prohibition cause.\n\nLEGAL INTELLIGENCE.\n\nTHE SUPREME COURT.\n\nThe court opened on Tuesday, 27th ult., in the new court house. His Honour Judge McKeown on the Bench.\n\nThere was a great crowd present before the court sat, and more than one case of vast importance, and one which must affect the interests of all, and the liberties and privileges of a large number whichever it may be decided.\n\nHORSE SHOE STORE\n\nThe Only First-Class Store in the District.\n\nWe Are Right ON THE BOOM\n\nThis is no Regency Sale. We are not Dissenting Partnership. Our Health is Good and Our Friends not Weak. We Don't Try to Give You Cheasants.\n\nBut we can give you Goods Cheaper than any other House in town.\n\nWe have just received a Mammoth Stock—All Fresh, Clean Goods!\n\nLATEST STYLES, PATTERNS AND DESIGNS\n\nWhat we will sell at cost, just to make room for our friends.\n\nFRESH GOODS—We offer you no old shop wares goods or winter stock, but new Spring Importations—such as the following prices, and SMITH'S Gingham 10c, Grey Cottons 6, Prints 8, White Cottons 8, Flannels 20, Plush $1.\n\nClothing—Men's Suits $5, Felt Hats 25c.\n\nGROCERIES\n\nBlack Tea 25c, Tomatoes 20c, Corn 20c, California Fruit 45c, Dried Apples 12c, Evaporated Apples 17c, Rice 8c, Matches 15c, Currants 8c, Codfish 10c.\n\nAll Other Goods in Proportion.\n\nBoots and Shoes at Cost.\n\nTHOS. O. DAVIS\n\nNOTICE\n\nT. J. AGNEW takes stock and Closes his Books on 30th of April. Parties indebted to him would greatly oblige by arranging their accounts previous to that date.\n\nUntil said date all goods will be greatly REDUCED for CASH.\n\nFULL LINES ON HAND OF\n\nBREAK PLOWS, CROSS PLOWS,\nIRON HARROWS, GARDEN TOOLS, COAL OIL,\nBOSS CHURNS, MILK PAILS, CREAMERS,\nBUILDING HARDWARE\n\nAT T. J. AGNEW'S.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books.\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK.\n\nALL SIZES—WRITING AND COVERING.\n\nOffice Stationery, etc., etc.,\nA Dead Drop!\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMAGNIFICENT NEW SPRING GOODS\n\nFar surpassing any previous seasons, both for richness in design and quality. The Variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock.\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., $42\nDressed Siding, $48\nUndressed do., $42\nSheeting, $30\nCommon Lumber, $35\nDimension do., $40\n\n\"Over 13 feet extra\"\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL,\n\nTORONTO, CANADA\nROYAL BAKING POWDER Absolutely Pure.\n\nPRINCE ALBERT BREWERY\n\nAMBER--Hop--ALE\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & GERROND\n\nGO TO CANN'S BOOK STORE\n\nSTATIONERY, SCHOOL BOOKS, ETC., ETC.\n\nGRAND UNION LIVERY STABLE.\n\nOpposition is the Life of Trade\n\nA First-class Livery, Feed and Sale Stables\n\nWe would like to invite the public to see our new stable yard, which is now in full operation, and to inspect our horses and carriages.\n\nMr. A. H. Clark arrived by the last mail from England, where he has been engaged in improving his health since he left. Mr. Clark intends carrying on his business as usual.\n\nSee our stock of clothing, now selling at Montreal wholesale prices. Walker & Baker.\n\nTobakery and cherry tooth paste at the Medical Hall.\n\nA grand concert will be given in St. Albans Church Friday the 25th inst. Further notice will be given later.\n\nOatmeal 6c, rolled oats 7½c, raisins 10c, currants 10c, rice 8c, sugar 10c, good tea 25c, coffee 30c, tobacco equally cheap at Walters & Baker's.\n\nMr. A. H. Clark arrived by the last mail from England, where he has been engaged in improving his health since he left. Mr. Clark intends carrying on his business as usual.\n\nSee our stock of clothing, now selling at Montreal wholesale prices. Walker & Baker.\n\nBUFFALO HALL\n\nSPRING CLOTHING!\n\nHATS HATS HATS\n\nIn Endless Variety Among which are several sizes, shades, old stock will be disposed of, but all fresh New Goods, fitted from the best materials.\n\nBETTS & GWYNNE\n\nR. C. W. & Co.\n\nClearing Sale!\n\nWe beg to notify the people of Prince Albert and vicinity that we have decided to dispose of our entire Stock of Ready Made Clothing, Dry Goods, Groceries, Glassware and Crockery.\n\nAt prices which cannot fail to satisfy intending purchasers.\n\nAll parties indebted to us will please settle at once as our books are closed.\n\nR. C. WIGMORE & CO.'S\n\nFOR NEW GOODS And Close Prices go to J. R. McPHAIL'S.\n\nThe balance of our Heating Stoves and Furnaces will be sold at cost for cash.\n\nBoots and Shoes\n\nA Large Stock. All Felt Goods must be cleared out.\n\nIf you want your money's worth in Hardware, Boots and Shoes, Clothing or Groceries, call on J. R. McPHAIL.\n\nROBERTSON & ROBERTSON Merchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES,\n\nCANADIAN TWEEDS\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888040601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5904, "total-output-tokens": 2094, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4243, 2], [4243, 5115, 3], [5115, 7568, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]