[{"id": "3120bc3ea75e5f98ed80287b825da72236101572", "text": "THE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S\n10 a.m., Rev. Canon Wells\n12 noon, Rev. Canon Wells\nThe Mission Chapel\n10 a.m., Rev. A. H. Wright\n12 noon, Rev. A. H. Wright\nSt. Andrew's\n10 a.m., Rev. J. F. Pritchard\nSt. John's\n10 a.m., Rev. J. F. Pritchard\nSt. Anne's R. Catholic\n10 a.m., Rev. J. F. Pritchard\nSt. Paul's Presbyterian\n10 a.m., Rev. J. F. Pritchard\n\nFRIDAY, JULY 10, 1885.\n\nREPRESENTATION.\n\nThere must be ample ground for reflection afforded the Government by the now superseded Rebellion in the Territories, nor can it be supposed that any feature will be brought more clearly into view than the utter hopelessness of trying to govern so large and tattered out department from a distance. The difficulties incidental to handling a Territory in which the increase of settlement has been unprecedentedly rapid, and yet so small when compared with the vast extent of country to be governed, have always existed. That all the efforts should have been directed to the completion of the great railway work undertaken is also very natural, and we cannot help the impression that upon the whole what has happened must be the result of the very nature of such a case; there was no deliberate neglect or mis-government. The question which presents itself with greatest force to nine tenths of our settlers is not as to whether the Government of the Territories should be carried on by Councils of the majority at Ottawa, but as to whether it is for their interests that the affairs of their country should be controlled at Ottawa at all—that is of course in matters elsewhere subject to Provincial instead of Dominion legislation. More than equal rights, with representation throughout, with the other Provinces which constitute the Dominion, no one can expect, and where allowed to represent ourselves in the national assembly we are not likely to prove more obstructive than anyone else. Whether the time has yet arrived when in the best interest of the Province they would have been granted control of their own affairs, and a Legislative Council should have replaced the North West Council, was until recently an open question, nor can the people reasonably blame the Government for thinking that the time was not ripe, when half of the representatives sent up to the Council by them who had been elected did not attempt to present a reasonable enough \"Bill of Rights\" at Ottawa. There can, however, be little doubt now as to the impossibility of carrying on our affairs by a Council which will, even when most electors districts have been added, be too weak to elect members who can be depended on to stick absolutely together, continue to contain an overwhelming majority whose vote will be under the direction of whatever party is in power at Ottawa. Again, it seems sufficiently obvious that the Territorial Government has been unable to receive their disposal on a very different scale from its present paltry one, and that such revenue must be at the disposal of the people's representative instead of being as hitherto absolutely under the control of the Lieutenant-Governor. There has been much speculation as to why might not have been held for the election of new representatives to replace those whose term expired a month ago, and it now appears that the delay is caused by waiting confirmation of recent legislation, which will enable the number of representatives from each electoral district to be increased in proportion to the advancing population. This reason is a good one, and consequently the delay in summoning the Council will be borne with composure. We have not the data at hand to calculate just how long the election must be postponed before the necessary confirmation will have taken place, how far short we will still be of the one and two members—attainment to which numbers will have to constitute our Council a Legislative Assembly, but we think the patience will not be wanting. Under these circumstances we presume the people will remain patient to patience for another couple of years, but yet we cannot help expressing the opinion that that delay is not really required; nor can we imagine any more favorable opportunity for the settlement of the present anomalous state, when men's feelings are strongly reacting from indolence of action, and when they feel the serious responsibility attaching to the privilege of governing.\n\nWe have heard from Judge Rolton his decision with regard to the site for the court house, and while of course it would be nice to expect that his Honor's selection will please the settlers, we must be less than human indeed to regard such a situation as any spot that could have been chosen. The site selected is upon what is now part of the town as appears by the map, and an acre of land has been presented to the Government by the Presbyterian Church so that there will be no danger from fire of the court house, and said being immediately crowded in by other buildings. The Judge is not in a position to speak with certainty as to when the work will be proceeded with, but hopes it will soon be commenced. We are glad to hear that he has been able to secure a competent architect to undertake as much in the way of public works as possible in order to help the people through the hard time which is before them, and rights consider that this is not only better for all concerned than anything in the shape of direct assistance, but is the only method likely to be acceptable to a people who certainly are by no means wanting in a spirit of independence.\n\nWe notice that several gentlemen have been appointed for particular duties to administer the oath of office to those taking offices of various kinds, residents within the limits of the County. Information from other sources, leads us to the belief that the fact has at last become recognized that not only is it unfair to send up men to fill every local vacancy as it occurs, but furthermore that the additional expenses of the country are really not worth while, and that it is likely to do better public service.\n\nWhile the Mounted Police cannot and will not wish to claim more than their share of the stretchedly arduous and dangerous work incurred in hunting down Big Bear, we are none the less glad that the final capture was made. We are pleased to learn that public sentiment is ever rising from the too hastily assumed position of regarding a body of men who, while numerically insignificant, has by unflinching pluck and faithful devotion to duty prevented any outbreak for twelve years, as the leaders of the banditry of the Prairies. It has to be remembered that the force was kept so small a standard as to render it only possible for them to do what they have done, when supported indirectly by the settlers, and that when the settlers in numbers only witnessed their success, they had already approved of arms against the contemplated banditry of Police, nothing but the utmost caution upon their part could have enabled them to protect the lives of the loyal settlers until the necessary force arrived to quell a schismatic movement which they were never likely to tolerate.\n\nOnce freed from the less familiar duty of guarding the settlers, their families and property, they have shown that none could get ahead of them in bearing hardship or danger, and nothing will prevent them of ever doing their duty in the future, and most emphatically, that both officers and men would not have hesitated to exchange their garrison day for active service in the field.\n\nFor cheap cottons, we assortment at Stewart Bros. Carls still arriving daily at J. M. Campbell's.\n\nWe wonder if our public school board will take any notice of the matter, and not wasting a building therein, but in the event of the members of the Presbyterian Church desiring the building for a school purpose, they would not have to be turned out on the streets.\n\nG. D. NORTHGRAVES,\n\nWigmaker and Jeweller.\n\nWe have received a large stock of Tea, Tobacco, Coffee, Oatmeal, Sugars, Canna Goods, Cal. Pears.\n\nCrockery and Hardware, at cost.\n\nNOTICE.\n\nAll parties interested in the sale of the largest and most complete factory of Square and Upright Pianos in Canada, are respectfully informed that before the 1st August next, they will be obliged to make an important change in the business.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48 per 1000 feet.\nUndressed do., $42 per 1000 feet.\nDressed Siding, $48 per 1000 feet.\nUndressed do., $42 per 1000 feet.\nSheeting, $30 per 1000 feet.\nCommon Lumber, $35 per 1000 feet.\nDimension do., $40 per 1000 feet.\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nOUR FAMILY KNITTING MACHINE\n\nRecognized as the BEST FAMILY KNITTING MACHINE.\n\nA few of the many articles that can be knitted on our Machine are: Underwear, Knitted Mitts, Hose, Stockings, Shawls, etc.\n\nOUR RIDER IS PERFECTION.\n\nMakes the Pearl Hill-Stitch and one, and is the only machine that can be used in knitting any pattern of stitches, and is beautiful in appearance, more durable and less liable to breakage than any other.\n\nOur Machines make the only perfect seam for Cashmere.\n\nHOSIERY IN THE WORLD.\n\nWith needles stitches in the machine is the best known. Our machines are made of the finest quality, and are guaranteed to be free from defects. They can be bought and paid for once, and will last for years.\n\nCREELMAN BROS.\n\nGEORGETOWN, ONT.\n\nThe Dominion Organ and Piano Co.\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\n", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885071001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 2349, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 9771, 2], [9771, 10130, 3], [10130, 10130, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]