[{"id": "196a94d8ae868ef2f9ba0d5c1ee790cc9e922e46", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nThis Paper may be found in every town and village in the North West Territories, and in every post office in Canada.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n10 A.M.—Rev. Mr. Wright.\nThe Mission Chapel.\n11 A.M.—Rev. Mr. Wright.\nSt. Paul's.\n10 A.M.—Rev. Mr. Wright.\nSt. John's.\n10 A.M.—Rev. Mr. Wright.\n\nFRIDAY, FEBRUARY 19, 1886.\n\nIt is understood that building operations will be commenced very soon, at the head of Lake Winnipeg.\n\nEuropean advisers indicate a prospect for a considerable emigration to the Canadian North West this season. It is devoutly to be hoped these expectations will be realized, and that whatever else its satisfaction to know that the \"Founders' scare\" has been drowned at the early date.\n\nWe understand that Mr. Alexander Begg, of the Canadian Pacific Railway, has been in communication for some little time past with Professor Macadam, of Edinburgh, regarding the possibility of obtaining from him an analysis of the prairie grasses of the North West. As complete a set as possible of these grasses has been secured and forwarded to Professor Macadam who will shortly report upon them especially with regard to their feeding qualities for cattle. The result of his investigations will be awaited with interest, and will doubtless be of great value in establishing the suitability of a large area of the North West for cattle and sheep raising.\n\nAn Ottawa telegram of the 15th inst., says: \"It is said that Sir John A. Macdonald upon his return to Canada will grant full and unconditional pardon to all prisoners now undergoing sentence in the North West for offences committed during the rebellion in that country. The Saskatchewan Herald says Sir John had better make haste shortly in that matter. The Indians here believe Sir John will send a message to the Governor General last week to the effect that Poundmaker's band should not be cut or any of the rebels punished, so he would avenge their cause.\"\n\nThe forbearance in Poundmaker's case is attributed to fear on the part of the Government, and if the prisoners now in confinement are released, it will confirm them in their belief of the power of influence and make them truculent still. This is a dangerous feeling to encourage, and one that suggests the desirability of having things settled this spring before setting free the leaders in hostilities. If the Indians have no idea, it is at any time the full measure of the law is not visited upon the offenders, it is attributed to the authorities being afraid to enforce it.\n\nFor the first few days the air has been thick with rumors to the effect that the contract for the construction of the Hudson Bay Railway had been signed. Great difficulty was experienced in procuring definite information as those who were in a position to know were not disposed to do so. It was, however, learned this morning, from official sources, that a successful climax had been reached, and that satisfactory and definite contracts had been received from England by virtue of which the construction of the road is understood to be assured. It came about thus: When the surveyors were out on the proposed route last fall their expenses were borne by Messrs. Grant and McLennan, the well-known railway contractors, on condition that they would have the first opportunity of tendering for the work. The engineers returned, and their report being highly satisfactory, this contracting firm was given the opportunity of tendering on the work. They made a definite offer to build the road for a sum much less than it was originally supposed the line could be built for. This offer President Sutherland cabled to the Prime Minister, who had cable scheme in mind. An English cable reply was received from England instructing Mr. Sutherland to have the contract signed at once. It is now a question of rapid preparation, and in a very short time the signatures of the contracting parties will be attached.\n\nRESOLUTIONS.\n\nPassed by the Council of the North West Territorial Assembly, February 12th, 1886.\n\n21. That claims for compensation from the Government for losses sustained during the late rebellions, should in the opinion of this Council, be promptly attended to by the Government; and within our knowledge that great inconvenience and hardship is being inflicted on many persons who have lost nearly in consequence of the outbreak.\n\nThis Council would recommend in the strongest terms that the Government recognize its duty to hold in abeyance the claims of such as may have been wronged by the late disturbances, and consider the claims of those who were loyal to the Government. Also that compensation be paid to those who have been injured by acts of violence and whose property has been destroyed.\n\n22. That the cattle stock is kept in a hazardous state, some rule should be adopted and made a part of the land laws, whereby the owner of a stock of homesteads, once fixed, shall be allowed to count cultivation duties in which he is, and shall encourage the settlement of the country, and the carrying on of agricultural duties.\n\n23. That the Government be requested to take into consideration the fact that the Indians are in their opinion, it would be more satisfactory to the people of the Territorial Assembly, and the Government at large, that the Indians now undergoing sentence for offences committed in future in allegiance to governments appointed by treaty, and punishment from amongst themselves.\n\n24. That owing to the unexpectedly rapid development of the agricultural resources of the Territories, and to the erection of grading mills at several points, as well as the extent of the cattle interests of the North West, this Council recommends both in the interests of the Government and the settlers, that in future all pastoral lands be held by the North West Mounted Police and for the Indians be purchased in the Territories. Should the present system of selling Indian instead of American pack, be more satisfactory to all the tribes. We respectfully urge that the same be adopted for similar quantities, the necessity not to exceed five per cent, and that the same purchase, when made, should attend the listing of the cattle thereon. In this manner, we believe the settler will be helped, and the Government will receive a cheaper and a better article.\n\n25. That the Council of the North West Territories, in which the Crown is interested, prove from year to year more unsatisfactory owing to the fact that the settlers are taxed in a manner most unsound, which are increased in value owing to the expenditure of the Government in the North West towns, the Crown tax being being levied without sharing any of the burdens of the town. And as great difficulties exist with regard to the school system, containing schools and municipal organization in each township, so as to operate as a unit, the Council of the North West Territorial Assembly should at next session of their assembly take such measures so that the settlers may be made aware of the situation.\n\n26. Whereas the Hon. Mr. Justice Wilson, members of Prince Albert, St. Albert and Edmonton, have been endeavoring to secure funds for the establishment of rural districts, viz., the Edmonton, Alberta Colonization Company, and the Edmonton, Prince Albert and Edmonton Colonization Company, have entered into agreements with each other, and that large blocks of land have been offered to these districts, and the lands are now being surveyed, and the companies interested, and it is found that such representations are correct, and that the companies are prepared to carry out their agreements entered into with the Government, or the cancellation of their agreement.\n\n27. That this Council has learned with satisfaction that in the submission of the report of the Royal Commission, the voice of the people who were engaged in suppressing the late rebellions. We would respectfully urge that the recognition of the valuable services rendered by the North West Mounted and the Prince Albert and Edmonton special forces should be extended to them on every occasion, where the force had an opportunity of rendering themselves that service of which Canada could be proud, also that services rendered by many loyal halfbreeds during the late troubles be recognized by the Government.\n\nMoved by Mr. O. S. Hughes, seconded by Mr. J. H. Macdonald.\n\nWhereas a large number of halfbreeds have been subjected to the severest rebuke, and have been confined in the Magdalen Farm, and the terms for terms of imprisonment varying from two to seven years. Whereas this Council is convinced that these same prisoners were innocent, into the hands of those who ignored the evil consequences of the act, and that by their malice or hatred for the aboriginal race.\n\nWhereas the Government of Canada has been compelled to maintain its army in order to suppress the insurrectionary authority, and its military strength, by the exhibition of which it is upon the point of rendering itself ridiculous.\n\nWhereas, the principal leader of the rebellion has suffered the penalty of his offence, and whereas the Council is aware that if clemency is extended to him and prisoners, it would have the effect of encouraging others to come towards the Dominion government and a large proportion of the population of the North West would be resolved, that in the opinion of this Council, it would be highly advisable to extend clemency to the halfbreed and Indian prisoners now undergoing sentence for offences committed in future in allegiance to governments appointed by treaty, and punishment from amongst themselves.\n\nThe officers for the Town for the present year are—Solicitor, W. V. McLean; Clerk and Treasurer, J. F. A. Smith; Assessor, A. W. R. Markley.\n\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, Dimension do., 35\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nNOTICE.\n\nROBERT THOMSON,\nSign & Ornamental Painter.\nCalomine and Paperhang-\ning on short notice.\nDecorative Painting a Specialty\n\nLINGOLN COLLEGE.\n\nIn addition to the Acts mentioned in the schedule to \"The North West Territories Act, 1880,\" as being applicable to the North West Territories, the following Acts of the Parliament of Canada have been extended by Proclamations to the said Territories, namely—\n\n1st July, 1882.\n31 Vic. cap. 60, intituled, \"The Fishery Act.\"\n\n28th April, 1883.\n31 Vic. cap. 29, intituled, \"An Act for the Protection of Voluntary and Active Subjects thereto.\"\n\n3rd June, 1883.\n31 Vic. cap. 42, intituled, \"An Act respecting Vagrants.\"\n\n4th June, 1883.\n31 Vic. cap. 31, intituled, \"An Act to provide for the better protection and prevention of crimes against the person.\"\n\n17th July, 1883.\n31 Vic. cap. 26, intituled, \"An Act to provide a Declaration to be taken by the Governor in Council, and to be under the control of the Government, and to provide for the administration of Telegraphic Messages, and to declare the contents of certain telegrams.\"\n\nBy Command of His Honour the Lieutenant-Governor of the North West Territories,\n\nA. E. FORGET,\nClerk of Council.\n\nRegina, January 31st, 1886.\n\nThe Nor'West Farmer\n\nWANTED\n\nMANITOBA AND THE NORTH WEST\n\nTo Yield a Greater Return to the Farmer\n\nHelp Along the Good Work\n\nONLY $1 A YEAR.\n\nTo everyone who subscribes before the end of March, 1886, we will give free a copy of the great book entitled \"Manitoba, Its Resources, History, and Prospects,\" containing valuable statistical and other information.\n\nSubscription Office: Winnipeg, Manitoba.\n\nThe Nor'West Farmer Printing and Publishing Co. (Ltd.)\n\nWinnipeg, Manitoba.\n\nC. B. KENNY, Prop.\n\nSubscriptions sent to the office of the Prince Albert Times.\nARGYLL RINK COMPANY.\n\nThe first annual meeting of this Company was held on Monday last, Mr. J. H. Macdonald in the chair. A letter from Mr. Macdonald, the vice-president, regarding his inability to be present. The members then read the President's report, and in doing so, the following statement was made:\n\n\"Sir, In presenting our first annual report, we would remind you that this company was only formed one year ago, with a stock of 350 shares, and that you, our supporters, have been generous enough to support us to collect fifty per cent. Of these 350 shares we are happy to say we have now succeeded in selling 277, leaving a balance of 23 shares, which we have not thought it advisable to dispose of, considering the great demand for curling clubs, sufficient funds to build and equip the rink, and to cover all expenses. We therefore feel justified in taking this position to declare a dividend on shares paid up this year, and which we think will be appreciated by all.\"\n\nWe are pleased to inform you that we are free of debt, and have a balance though small, or nearly equal to what we started with, or having purchased consisting of a lot containing 50 x 120 feet, for which the land has been valued at $1,000. The building is erected, wind the roof built on the back end, and yet fronting on McTavish street, with a frontage of 40 feet on said street, and 290 feet on river street, and which we consider the most desirable part of the property. The house of lands is not valued, and if any of you gentlemen consider it a good investment, we would be glad to pay you for it. We have no intention of buying more, but shall continue to purchase land for the purpose of erecting new buildings, and when the time comes for selling, we shall be glad to sell at a reasonable price.\n\nWe would also like to bring to your notice that the Argyle Curling Club has purchased two head lights at a cost of $6 each, which the Curling Club has rented within the last few weeks.\n\nWe would recommend that the voting for officers for the coming year, be by secret ballot, as in the case of the last election, and that we would think it advisable to reduce the number of directors to five instead of nine, as at present, as there are too many directors, and that we would think it advisable to carry on the business of the company herself, before electing officers, and that we would think it not yet practicable to have the company incorporated without much trouble and expense, therefore, we did not attempt to vote on this subject at the meeting.\n\nWe are, etc.,\nR. H. BARRAGAN,\nChairman Board of Directors.\n\nThe Master, Parker, was elected as the appointed auditor, and three gentlemen having the same name, the report of the Secretary, Mr. Macdonald, stated that 277 shares sold at par cost $20,500, and 23 at par cost $575, making $25,075, less taxes, and interest paid up, $750, leaving a balance of $18,325. Balance on Rink, etc., $750.00. Balance on land, $1,000.00.\n\nA vote of thanks was tendered the Board of Directors for the manner in which they conducted the business of the company, and to Mr. J. H. Macdonald for his services as treasurer.\n\nThe meeting adjourned until the following year was thus proceeded with, reassembling in the election of L. Clarke Roy, President; J. H. Macdonald, Vice-President; J. H. Miller, Secretary; J. H. Macdonald, Treasurer; Messrs. H. McCullough, H. H. Brown, J. H. Miller, A. Holmes, H. Rogers, and T. Parker, Directors.\n\nMr. Lawrence Macdonald, Inspector of Indian Agencies, at the Indian Office, wishes to hear of any destitute persons in this district, so that assistance may be rendered them.\n\nLarge numbers of residents are still living in very bad lodges with lumber for walls, and are in need of shelter.\n\nTHE PRINCE ALBERT TIMES\n\nINSISTING ON RIGHTS.\n\nThe Times is the best medium in the Territorial to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nTOWN COUNCIL\n\nMayor McKay took his seat for the first time.\n\nRESOLUTION OF THE MEMBERS OF THE FIRST COUNCIL.\n\nThe Council met Monday evening in the Council Chamber, for the transaction of business.\n\nMayor McKay handed in his declaration of office and took his seat.\n\nBefore proceeding with business, Councilor Bettis moved a resolution was adopted welcoming Mayor McKay to his seat at the Council Board, by which the Mayor made a very appropriate speech.\n\nThe minutes of the previous meeting having been read, upon motion, were adopted.\n\nThe Clerk read accounts from Mr. W. Fawcett, furniture, $175.00; Mr. David Williamson, constable, $2.50.\n\nA petition was presented to the Council, asking that a public meeting be called to make arrangements for reoccupying the Town Hall.\n\nThe accounts of Coms. Goodfellow and Bettis, the accounts of W. Fawcett and D. Williamson were brought to the Finance Committee, who after a discussion, approved them.\n\nCom. Goodfellow introduced a by-law to amend by law No. 1.\n\nMotion was made by Councilor Braden, seconded by Com. Braden, that the petition asking for a public meeting be granted, that the same be held in the Council Room Saturday night next in the Public School House.\n\nThe Council then went into Committee of the whole to consider, by law to prevent the encroaching of streets and corners in other places.\n\nCom. Brown in the chair.\n\nThe by-law was read and discussed clause by clause.\n\nClause 1 was amended by striking out the words \"and shall keep the said main streets clear and free from all obstructions.\"\n\nThe remaining clauses of the by-law were read without amendment.\n\nThe Council retained and reported as above, and on motion of Coms. Bettis and Braden, it was ordered that the by-law be read a second time and passed.\n\nThe Council again went into Committee of the whole to consider, seconded by Com. Braden, that the by-law be read a third time and passed.\n\nThe Council retained and reported as above, and on motion of Coms. Bettis and Braden, the by-law was read a third time and passed.\n\nMotion by Coms. Goodfellow, seconded by Com. Braden, that a by-law be provided money for current expenses be not raised a second time but thrown out.\n\nCarried.\n\nOn motion of Coms. Bettis and Goodfellow, the order for Mayor and Town Clerk to meet to consider an expenses account be cancelled. Carried.\n\nMotion by Coms. Bettis, seconded by Com. Braden, that a Red Seal unit be added by the Mayor and Treasurer be the seal of the Municipality of Town of Prince Albert. Approved.\n\nThe by-law to amend by law No. I was read a first and second time.\n\nThe Council then adjourned to meet on the following Monday evening.\n\nThe Council went pursuant to a previous motion.\n\nPresent: Mayor McKay, and Coms. Bettis, Braden, Goodfellow, and Braden.\n\nThe minutes of the last meeting were read, and on motion adopted, the Clerk read a communication from H. W. Newton, Principal of School District No. 4, re school plan.\n\nThe Finance Committee recommended to the Council that the necessary amount of security by the taxpayer, has been agreed upon, and that he be authorized to deposit the same with the bank of Macdonald & Co., Ltd.\n\nThe minutes of the last meeting were read, and on motion adopted, the Clerk read a communication from H. W. Newton, Principal of School District No. 4, re school plan.\n\nJ. M. Campbell\n\nWM. STOBART & Co.,\nGeneral Merchants and Indian Traders,\n\nHave Just Received A Large Assortment of Prints, Hats, Crockery and Groceries,\n\nWhich they will sell at the lowest cash prices.\n\nBest American Coal Oil 90¢ per gallon.\nSeasoned Cordwood $3.50 per cord.\nGolden Syrup $4.50 per keg.\n\nPrince Albert, Sask.\n\nG. D. NORTHGRAVES,\nWatchmaker and Jeweller,\n\nAt T. E. Jackson's New Store\n\nA LARGE STOCK OF\n\nWatches, Clocks and Jewellery\n\nKept Constantly On Hand\n\nRepairing Promptly attended\n\nT. E. JACKSON,\nNew Road, in the building lately occupied as a Post Office.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886021901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 4694, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 12130, 2], [12130, 16159, 3], [16159, 20072, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]