[{"id": "439035921d391a10778e943fe3edcf7588ebe595", "text": "WANTED.\n\nSTRAYED!\n\nTELEGRAPHIC.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nThe Anglican and Saskatchewan Curling Clubs play a match next Tuesday after noon.\n\nAlex. McPrath has got back from Troy, and reports having a very cold trip.\n\nA meeting to select school trustees is called for Monday evening at 8 o'clock in the Mission School House.\n\nClark's Sylvester Cream (Solidified) stops chapped hands and lips. Removes all grease, chapped hands and lips. Leaves no greasy feel.\n\nAnother of the Canadian voyagers landed Dec. 16th, from Ottawa, was drawn off by the steamer.\n\nA Cairo correspondent says the Mahdi has accepted the conditions proposed by Sir Herbert Kitchener.\n\nMajor Hugh Macdonald has been appointed minister, but has to pay a big fine and heavy costs of litigation.\n\nThe Great Northern Trunk Ry. has cut down the rate from Quebec to Chicago, very low.\n\nManitoba delegates to the convention meet at Winnipeg.\n\nThe demonstration in honor of Sir John A. Macdonald at Montreal has been a great success.\n\nThe Rev. Mr. Smith of Simcoe has been appointed Superintendent of the United Methodist Church.\n\nNebraska has been visited by a succession of heavy snowstorms. Twenty-one inches have fallen in three days.\n\nMiss Mack & Co.,\n\nPUBLIC NOTICE.\n\nAll parties are hereby notified that the following notice has been posted at the office of the Town of Prince Albert.\n\nNotice is hereby given that the Town Council has approved the following resolution:\n\nResolved, That the Town Council recommends to the citizens of the Town of Prince Albert to vote for the following candidates for the election of the Town Council:\n\n1. Mr. Smith\n2. Mr. Johnson\n3. Mr. Brown\n\nAnd hereby call for a vote of the citizens of the Town of Prince Albert.\n\nThe date for voting will be announced at a later date.\n\nMiss Mack & Co.,\n\nPUBLIC NOTICE.\n\nEncourage Home Manufactures\n\nWASHING MACHINES\n\nMADE TO ORDER.\n\nPrice $10. Give Them a Trial.\n\nWells sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co. will be promptly attended to.\n\nNATHANIEL ACORN\n\nPRINCE ALBERT.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter,\n\nDecorative Painting & Specialty.\n\nCarrot River\n\nAccording to arrangement a number of the \"brothers\" assembled in the Public Hall here, on the evening of Jan. 1st, for the purpose of organizing under the laws of Warrant No. 1522 issued by the Grand Lodge of Canada in Thomas N. Lodge No. 1522, Carrot River Lodge in this district.\n\nThe officers elected for the ensuing year are:\n\nW. Bro. Theo. N. Irvine, M. W. Bro. David Pollock, D. M. Bro. James Sanderson, Secretary; George Cooper, S. W. George Irvine, Chapl. Fred. Engen, Director; F. S. Roy, Inspector; T. E. M. Secretary.\n\nThe Lodge meets on the afternoon of the first Wednesday in each month at 2 o'clock.\nFRIDAY, JANUARY 16, 1885.\n\nGREEN APPLES\nAT\nMARKLEY & CO'S,\nTHOS. POWERS, PRINCETON, ONT.,\nIS PREPARED TO TAKE CONTRACTS\nFOR\nBrick, Plastering and Stone Work.\nAll orders promptly attended to. Estimates furnished.\nPrince Albert, Sask.\n\nPRICES TO SUIT THE TIMES,\n\nNEW GOODS\nAT\nMEDICAL HALL\nBurdock Tea, Blood Eitters,\nBurroak Heating Ointment,\nBurdock Pills,\nVictoria Hypophosphites,\nVotive in Bath and Eva Ursi,\nFreeman's Form Powders\n\nJAMES SINGLAR\nMerchant Taylor,\nAND DEALER IN\nGENTS' FURNISHINGS\n\nRALPH'S MAGAZINE BEEF,\nAT THE OLD STAND\n\nPATENT COOKES,\nXXX and\nStrong Bakers,\n\nT. A. MACDONALD,\nPRINCE ALBERT, SASK.\n\nCREELMAN BROS.,\nJACKSONS, ONT.\nThe Dominion Organ and Piano Co.\n\nROYAL BAKING POWDER,\nAbsolutely Pure.\n\nKEEP CONSTANTLY ON HAND\n\nFRIDAY, JANUARY 16, 1935.\n\nNEW COUNTRIES.\n\nThere appears to be a growing tendency among even the most generous souls to secure the development and general welfare of new countries to rush on settlement without the slightest regard to the fitness or otherwise of the settlers for the conditions of affairs with which he has to come. In the fresh order of things which necessarily surround him in the new country in which he is induced to throw himself, especially in its causes as well as to bring about utterly unsatisfactory state of things. Of course it is natural enough that in countries which have become over-populated, there is where the political capital has been brought larger than can be supported by the natural productive powers of the land combined, these members of society who have managed to obtain titles of unmixed satisfaction on the case, should recognize the law of humanity requiring them to make some provision for the actual existence of their weaker brethren, till the easiest provisions for securing their existence are made away. It is not always a question whether they should or should not, recognizing the humanitarian requirement to make some provision for the actual existence of their weaker brethren, till the easiest provisions for securing their existence are made away. It is therefore incumbent upon all those who have obtained titles to their lands by means of unscrupulous means to make every effort to advertise their want of a useful population to occupy their vacant lands. That this may be a wise policy for the old countries may be allowed, but while the modern world is so easy to divine, the mentality of men or even the humanity of the proceed, seeing more than doubtful. In a general way there seems little reason to dispute the logical conclusion that some time will come when the lands of Britain, covered by the wishes and strangled by a large portion of the civilized world, will be sought after by those, so it is not unnatural to see whether those who have accomplished the strange feats of existence under the maltreated colonial condition of an aged civilization are the suitable subjects to select to overcome the vastly greater natural difficulties of a new country. It may be said that nature, just as when left to herself, will in time regulate matters so it cannot now be stated what will the regulate the emigration from one country to another, but unfortunately in this respect artificial civilization is interposed over nature's own assignment of duties, and means of lowering the eternal and energetic who require a bigger field wherein to exercise their energies to enormous, holds out false hopes and promises, and having done the former, produces a result which crumbles down like a broken fort in a land, where they believe their paths may be sewn with glory. Now, however much the people who adopt this policy may put off the experiment, they must do it just as much must the new country suffer. Of course we cannot pretend to deal with individual instances in detail, for undoubtedly there are cases in which the attempt was made both for the largest energies and produce the most splendid results of a most stirring nature, but these are few and far between. What we mean to say is that on the whole the police force necessary to maintain a new country, is decidedly that number was assigned to us the subject of the experiment. To illustrate in a most general way what constitutes our contention, it will be sufficient to produce a statement that if a new district be created, and that sits without any difficulties whatever, it will be found that immediately the new settlers will have nothing but competition for their services, while the market is ruined by the mere fact that the merchants are ruined by over competition, and the end is universal failure. We want settlers here, as much as elsewhere, but unless they are prepared at least to take up the work of nature, such as obtaining timber, clearing land, etc., the market is ruined by the mere fact that the merchants are ruined by over competition, and the end is universal failure. We want settlers here, as much as elsewhere, but unless they are prepared even to go out and root up trees to make firewood, the market is ruined by the mere fact that the merchants are ruined by over competition, and the end is universal failure. We want settlers here, as much as elsewhere, but unless they are prepared even to go out and root up trees to make firewood, the market is ruined by the merchants being ruined by over competition, and the end is universal failure.\n\nOn Wednesday, July 26th last week, Sir A. Macdonald introduced in his historic speech before Parliament, that the Premier's plan does not disclose any indication of the intention of the government regarding the Canadian Pacific Railway, which is the most disappointing feature of the scheme. He is opposed in England and seems destined to coincide with the Imperial Government's views concerning the North-West interests. It may be noted that the Canadian Pacific Railway bill is likely to become an accomplished fact during the next two weeks.\nOn Tuesday last the old country team played off for the medal won by them from the Canada team last year. The medal was presented by Mr. J. G. Macdonald, brother of Mr. H. Macdonald, of N.W.T., by whom the game was arranged. The members of the Club promised it immediately after the conclusion of the game. The weather was very fine and the game was played in the open air. Mr. Macdonald has been very fortunate this season as he won the second medal, which was the second highest prize by teams shipped by him.\n\nThe teams were:\n\nT. J. Agnew, J. W. Macdonald,\nW. H. Mitchell, W. N. Macdonald,\nT. S. Macdonald, A. Macdonald,\nMacdonald, son, J. J. Macdonald, etc.\n\nA very interesting race was played on the track on Saturday last between two riders chosen by Messrs. J. Simler and Mr. J. Macdonald, who were the proprietors of the horses. The riders were:\n\nR. Middleton, B. H. Montgomery,\nB. Gibson, A. Macdonald,\nG. T. Smith, J. J. Macdonald.\n\nJust arrived at Clark's Drug Store, Grey Street, a splendid selection of Imperial Dyers, including Methylene, R. B. Dyes, and a full assortment of Diamond Dyes.\n\nA bunch of keys on a ring, with A. E. Harris's name on it, addressed, was lost near the corner of Main and Second streets on the evening of the 19th inst., and will be returned by leaving them at the Town office.\n\nPOLICE NEWS.\n\nSept. 20th. Inspector Morris has been transferred from Battleford to Carlton.\n\nSergeant Proctor stationed at Carlton and Corp. O'Brien at Moose Jaw.\n\nCorp. C. Leonard has been promoted to the rank of Sergeant.\n\nSupt. Carter and Gagnon paid a visit to the detachment here.\n\nSept. 20th. Inspector Morris inspected the men of the detachment on full dress parade and left a complaint against a man named Hartfield.\n\nCHIEF COMMISSIONER'S OFFICE.\n\nAn important meeting of the Board of Trade, including, Lord of Energy, Lewis Appelgate, Mr. Macdonald, and constable, was held at the office yesterday afternoon.\n\nThere was a discussion last month in the House of Lords about a subject of the last importance to England and her colonies, viz., the question of the appointment of our coal mining stations abroad. Of course in time of war neutral coaling stations are closed to belligerents, and as our warships can only carry a few days' supply, it becomes necessary to maintain coaling stations in neutral countries to keep our merchant vessels in a fairly good position should they be unable to hold their own stations at which to take in coal.\n\nThe recent appointment of Capt. Dunn as superintendent of the Regina District is said to be causing dissatisfaction amongst the other officers of the force. The appointment has been made over the heads of many officers who have been serving in the service, and the new superintendent is stated to be so blindly ignorant of Indian negotiations that a junior has to assist him when anything important turns up.\n\nThis has been the result of lack of satisfactory appointments in the Mounted Police. What was there in either his record or his standing, even justified the appointment of Inspector Morris, late of Calgary, who has been found to be a gaining belief that a man's record has been having little of late to do with his promotion. Men like Inspector Steel, of long service and acknowledged merit, are the ones who promote, and not men whose only \"record\" are of their lack and not of their deserts—Calgary Herald.\n\nEMMANUEL COLLEGE\n\nPRINCIPAL:\nThe Rev. W. R. FLETT, B.A.,\nCantab. Late Foundation Scholar of Sydney College, England.\n\nTHE NEXT TERM BEGINS ON Monday, January 12th.\n\nBesides the ordinary subjects read at a Public School, each pupil is taught the Elements of Scientific Agriculture.\n\nA Laboratory is provided, where the Principles of Elementary Qualitative and Quantitative Chemical Analysis are taught.\n\nSpecial Evening Lectures to Students Reading for the Matriculation Examination of the University of Saskatchewan.\n\nFor further particulars apply to—\n\nREV. THE PRINCIPAL,\nEmmanuel College, Prince Albert, Sask.\n\nNOTICE.\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nCertain business men have just KETCHED UP\n\nTo the fact that their $2 Face must be reduced in order to compete with the all wood ones we offer at\n\n$2.50.\n\nKeep your eye on the prices attached to the balance of our\n\nDry Goods,\n\nFur Caps,\n\nMitts and Mocassins\n\nWe have the finest range of these goods in town, and they must be sold.\n\nFresh Goods, Butter, Cheese, Lard, Beef, Pork, White Fish\n\nOrder at close prices.\n\nIt is now generally acknowledged that for Reliable goods at fine prices Buffalo Hall takes the lead.\n\nBETTS & Gwynne.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Montreal, Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nUNIVERSITY OF SASKATCHEWAN\n\nThe Matriculation Examination shall be conducted at a place to be selected from time to time by the Senate.\n\nEvery candidate for Matriculation must send in to the Registrar, his name and address and if a Matriculated student of any other University or College, a certificate from the Registrar of that University or College together with such other particulars as may be required, at least thirty days before the date fixed for the examination, and pay a fee of ten dollars.\n\nCandidates at this examination shall be required to pass in each of the following subjects:\n\nI. Latin. One paper, two hours.\n\nII. Greek. One paper, two hours.\n\nIII. English Composition. A paper of questions on Latin and Greek grammar with references principally to the Latin and Greek authors.\n\nIV. English Composition. A paper of questions on English Grammar.\n\nV. English and Canadian History. A paper of questions on Canadian History.\n\nVI. English and Canadian History. A paper of questions on Canadian History.\n\nThere shall be one paper on each of the above subject; each paper shall have thirty questions assigned to it.\n\nIf a candidate fail to pass in any one subject he may afterwards pass the same subject as an additional subject; but if he fails in any subject, he shall be required to pass in all the subjects at a subsequent examination.\n\nOrdinances regarding the Matriculation examinations.\n\nThat no more examinations during the year will begin on the first Monday in May and the first Monday in December.\n\nThe selected subjects for each examination will further be as follows:\n\nI. Latin. One half-filling. Book 11.\n\nII. Xenophon's Anabasis. Book 11.\n\nIII. English Grammar. Mod. 1. Wycliffe.\n\nIV. English Composition. English History to A.D. 1632.\n\nThe subjects for the previous and final examinations will be published shortly, together with the date of the examination for the B.D. and B.D. degrees.\n\nEmmanuel College.\n\nWe are glad to inform that the number of students of all classes this term has already reached thirty seven—a larger number than has ever yet been enrolled in any previous session by Emmanuel College.\n\nThe chemical laboratory is nearly ready; on its completion we shall be able to give special attention to practical chemistry especially in its application to agriculture. Eight large apparatuses have been purchased by the Bishop in England and are ready for use; these consist of apparatus imported by him from Germany and one from Wümpen, waiting for delivery from Albert, near Berlin, in spring.\n\nNine of the students are candidates for admission to the University of Saskatchewan as B.A., B.B., B.M., B.A., B.D. The work for the department of trained native helpers is vigorous and promising, and we have three students from three of the Cree and one of the Blackfoot tribes. No fewer than three of our students are now engaged in teaching in the schools of the Crees and Blackfeet.\n\nWe congratulate Principal Reitz on the excellent progress of the institution here. He has received a knowledge of literature which he spent his earlier years, with a Cambridge University training, and is now engaged in teaching in some of the best English schools. We think the Bishop was fortunate in having selected such a Professor for Emmanuel College.\n\nJ. F. Reitz, B.A., having offered a prize to Emmanuel College, the following resolutions were passed and forwarded to him:\n\nResolved—That the prize offered by J. F. Reitz, B.A., for the greatest number of Emmanuel College students, as far as possible, the College authorities may designate himself, is hereby assigned to the student who shall secure the highest aggregate number of marks in the subjects prescribed for the Matriculation Examination, the examination to commence as to be held in December, 1885.\n\nResolved—That the cordial thanks of the College Board of Emmanuel College are tendered to J. F. Reitz, B.A., for his enthusiastic kindness in offering a prize to the most deserving student of the College. We respectfully appreciate the act of kindness and recognize it as a welcome encouragement to the students.\n\nResolved—That a copy of these resolutions be forwarded to Mr. Reitz.\n\nBIBLE COMPETITION.\n\nThe publisher of the popular humorous work entitled \"Our Joshua\" has recently offered a prize of five hundred dollars to the person sending the best answer to the following question before the 1st June, 1885.\n\nWill receive TEN DOLLARS in gold for the best answer, the person submitting the best five correct answers one dollar each, and the five persons submitting the last correct answers one dollar each in all five answers.\n\nEach person competing must enclose twenty-five cents with their answer and must be willing to return a copy of \"Our Joshua\" and \"The Reporter,\" a work of 100 pages of which the Provincial Secretary has kindly placed at our disposal. Stamps must have been used.\n\nQuestion—Multiply the number of letters that John saw in his vision by twice the number of gates in the new Jerusalem, add number of shocks of corn that Moses gathered, subtract the number of false prophets called upon Mount Carmel, produce the number of sheep and oxen, and subtract Eliezer's age at the day of his death.\n\nThe correct answer and names of successful competitors will be announced in the next issue of \"Our Joshua.\"\n\nAddress: H. M. PITTS, Manager, \"N. B. Reporter,\" Fredericton, N. B., P. O. Box 107.\n\nSTRAYED.\n\nStrayed on my premises THREE STEER CALVES,\n\nthe mangled red and black, one red, one black and white. Owner will please prove property, pay expenses and take them away.\n\nALEX. STANSFIELD,\nRed Deer Hill.\n\nPUBLIC NOTICE.\n\nAll persons are hereby notified that the annual school census will be taken on Monday, the 1st day of February, 1885.\n\nT. O. DAVIS\n\nAvis Public.\n\nPar le présent document je constate que les écoles de la province ont été ouvertes et que les écoles publiques ont été ouvertes.\n\nL'avis public est donné que le gouvernement provincial a décrété que les écoles publiques devraient être ouvertes.\n\nJOHN DOUGLAS, Commissaire.\n\nAVIS PUBLIC.\n\nPar le présent document je constate que les écoles de la province ont été ouvertes et que les écoles publiques ont été ouvertes.\n\nL'avis public est donné que le gouvernement provincial a décrété que les écoles publiques devraient être ouvertes.\n\nJOHN DOUGLAS, Commissaire.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 11 feet extra.\"\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply.\n\nJ. D. MAWEETY, Publisher and Proprietor\n\n3RD ST., PRINCE ALBERT, SASK.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885011601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4866, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2773, 1], [2773, 8664, 2], [8664, 13682, 3], [13682, 20948, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]