[{"id": "c17bcf0d37e5b6232e0a832c87ceb45250f6ee1d", "text": "THE PRINCE ALBERT TIMES.\n\nWEDNESDAY, NOVEMBER 22, 1862.\n\nMOUNTED POLICE LANDS.\n\nAt the time of the organization of the Mounted Police Force for the North West Territories in 1874, it was provided by the Government, that each member, on the completion of three years' service, if his previous land had been granted, should receive a grant of 160 acres of land, to be taken from the ungranted lands in Manitoba or the North West. At this time these lands were selling at about $50 per acre; now, the price is two dollars, and according to the strict interpretation of the law, the warrants would only entitle the members of the Force who have already sold, (for many of the officers have not yet sold, (for many of the officers have not yet sold, (for many of the officers have not yet sold,) their rights) to eighty acres at the new selling price. This would be a manifest injustice to men, part of whose inducement to join the service was the securing of a grant of 160 acres of land at the expiration of their term of service, and the Government should see that they obtain their full grants.\n\nThe Mounted Police, as a rule, are a fine set of men both in body and character, engaged in arduous and often unpleasant duties, and they should be protected in their rights. Sergt. Keenan, who has just left the force, having served three years and seven months in all—seven of which he was in command of detachments in various parts of the country—has been granted a grant of 160 acres of land, and we trust that the Government will recognize his services by appointing him permanently to those offices. We have an absolute right to expect that every man who resides here spends his salary in Winnipeg. This is a matter which requires airing, and we shall refer to it again.\n\nTHE MAIL SERVICE.\n\nAfter the positive statements published in our last issue, and made by two gentlemen who had interested themselves in the matter, and who ought to have been in a position to know, to the effect that a contract had actually been signed with the Dominion Government, for a weekly mail between Prince Albert and the East, we were much surprised to find, when the last mail came in, that nothing was known of it by the regular mail contractors, or any body else at Qu'Appelle. There seems something strange about this, and we trust that our friends in the East will not relax their efforts until the contract is signed. The reasonable demands of Prince Albert and the rest of the North West in this matter. To have to wait three weeks for our letters and newspapers, or to have no telegraph to inform us of the doings of the great out side world, may have been the lot of the last decade, but will not do for this generation. So moving along ye Government officials, and give us our weekly mail, or you will hear further from us.\n\nTO THE PUBLIC.\n\nWe have made arrangements to leave papers at T. J. Agnew's hardware store, the Post Office, T. N. Condon's meat store and Mr. MacKay & Co.'s dry goods store. The ladies may also at the above mentioned places will find their paper there. Also at this office.\n\nTHE GREAT NORTH WEST.\n\nAn eloquent address by the Bishop of Saskatchewan, delivered at the opening of the North West, in London, England, was followed by a most interesting talk from the address of His Lordship the Bishop of Saskatchewan.\n\nIn his preliminary remarks upon the facilities of communication with the North West, he spoke at length with His Lordship and his proposal to speak this evening not so much of Manitoba itself as the great river which flows through it, and to give a vivid and interesting word picture of the fertile land lying in the North West, and more particularly the Saskatchewan and Nelson rivers, and the vast streams which flow into them, specifying the distinctive features of soil, climate, and other essential elements. In the early spring, the river had been heard from the Saskatchewan across the lakes and streams until it reached the English Channel, where it joined the Atlantic Ocean, and saw truces of iron. The fact that iron is abundant in that region would make the river more valuable as the country becomes more settled. He alluded to the fertility of the Saskatchewan, and said that it was certain that a great city would be located at the Forks of that river, as an emporium for the district, and soon eclipsing all other Montreal or New York. By this means all the freight could be carried down the river, and the steamer would navigate almost all the distance by water, except 300 miles, and he believed that in the course of time our grain from the mouth of the river would reach Liverpool. He spoke of the difficulty that might be experienced in carrying the grain from the river to market, stating that it would be impossible to get the grain until the following spring. He described the town of Prince Albert, which was situated on the Saskatchewan, and the following paragraph of the text: \"Prince Albert is situated on the Saskatchewan River, and there was one great advantage it possessed, that it had never been visited by the Indians, and consequently the crops brought in other districts by this plague, and expressed his surprise that this river was not more productive. The most fertile lands in the North West, has always been exempt from the grasshopper. Another advantage of the district was its proximity to the sea. Although they had lost trees there, they believed that with proper cultivation there would be more freedom from frost, which had been the experience at the Portage. He spoke of the future of the commerce of the place. Another point he made was that there is abundant evidence that excellent wheat has been found, so that there is every requisite needed by settlers.\n\nHe expressed his conviction that the Saskatchewan district is destined to play a prominent part in the future history of the West. He then proceeded to a talk of the navigation of the Saskatchewan, believing that with an artificial lake, and a canal, a great deal could be made a high way for the transportation of freight. The speaker next turned his attention to the question of the future of the railway to the Rocky Mountains. He was greatly astonished at the enormous cost that had been expended on that country. On the Belly River he entered a mine, and carried away a large quantity of gold. The river was started harnessed with a clear bright light, and is fully equal to the best of English streams. Upon the river there is a good coal bed, and the length and width is the same all through. He believed that the river was destined to form a great future for the country. The address throughout was a most brilliant effort, and the graphic manner in which the facts were presented to the North West were depicted produced continued and hearty applause. He concluded amidst an outburst of prolonged applause.\n\nJ. O. DAVIS & CO.,\nPrince Albert, N.W.T.\n\nRECEIVED: STEWART & WOOTTON\n\nGeneral Merchants,\n\nFURS.\n\nWe are now showing the largest and most complete assortment of Furs ever imported into Prince Albert, and invite inspection before purchasing elsewhere. These goods are imported direct from the manufacturer, and are sold at the lowest possible prices.\n\nLadies' South Sea Seal Sets,\nLadies' Persian Lamb Sets,\nLadies' Astrachan Sacsques\n\nMUFFS.\n\nMisses' and Children's Muffs, Ladies' Persian Lamb Muffs,\nLadies' South Sea Seal Muffs, Ladies' Grey Lamb Muffs,\nLadies' Alaska Seal Muffs, Ladies' Astrachan Muffs,\nLadies' French Seal Muffs, etc., etc.\n\nCAPS.\n\nLadies' and Gent's Fur Caps,\nNatural Hair Oiler Caps,\nSouth Sea Seal Caps,\nPersian Lamb Caps,\nGrey Lamb Caps,\nAstrachan Caps,\nFrench Seal Caps,\nBeaver Wraps,\nSealite, etc., etc.\n\nCHILDREN'S WHITE CONY HOODS,\nBUFFALO COATS,\nMOCCASINS,\nMOCCASINS.\n\nThe Largest and Finest Stock of Mooccasins ever offered in Prince Albert, at prices which cannot be beat. Call and see for yourselves.\n\nGLOVES, &c.\n\nFull Line of Ladies' and Gent's Gauntlets, Mitts, Gloves, Etc., at Very Low Prices.\n\nCLOTHING.\n\nOUR STOCK OF Fall and Winter Suits,\nOvercoats, Ulsters & Overalls\n\nNow complete, and comprises the largest variety ever offered in Prince Albert, at Winnipeg Prices.\n\nUNDER-CLOTHING.\n\nScotch Underclothing\nCanadian Underclothing\n\nQUILTS!\nQUILTS!\nQUILLS!\n\nScotch Fingering Yarn.\n\nCARPETS.\n\nTAPESTRY AND WOOLLEN CARPETS just in, with\n33 CARTS OF GENERAL GOODS.\nA new Railway Company for Prince Albert is being formed, to run from Wood Mountain through Creel, on the C.P.R. via Jumping Creek, crossing Fort Qu'Appelle through to Prince Albert. We have received the following names of a few of the prominent men of this place, who think it would be advisable to join in the movement, among them the names of a few of the leading non interested, Major Walsh, Col. Jarvis, S. H. Caswell, Mr. McKechnie, Col. McKechnie, Mr. McKechnie, Mr. Kirkpatrick, Mr. M. M. Hartz, President of the Credit Valley Railway, Mr. J. O. Davis, Mr. Laidlaw, (President of the Credit Valley Railway), W. R. Smith, Mr. Davis.\n\nMEDICAL HINTS.\n\n1. If the man faints, place him flat on his back and let him lie.\n\n2. If he is not swallowed, drink immediately half a glass of cool water, with a helping teaspoonful of common salt, mixed into it; this helps to neutralize the stomach; but for fear some of the poison may have been swallowed, take one or two raw eggs, or drink a cup of strong coffee, these two being antidotes to poisons. If there are any other articles known, with the advantage of their being always at hand; if not, a pint of sweet cider, or honey, or syrup, will do. These are all good stimulants, especially if they are eaten quickly.\n\n3. The best thing to stop the vomiting is something cold, such as milk to cover it well with, oblige, rent and salt, half a bottle.\n\n4. If the blood comes from a wound by pieces or heaps, bury, or the man may die in a few minutes, because the artery is exposed; tie a piece of cloth around near the part between the wound and the heart; put a stick between the hinder end and the skin, and press so as to make the blood flow down to the knee, it then must fill the slower vessels. If in a place where the wound is not bad, tie a piece of cloth around the neck near the wound between the wound and the heart; increase the pressure until the blood flows down slowly, and the pressure for an instant before, the pulse returns active, so as to give up by congestion.\n\n5. If your child may take, use, slide the hands down the throat, keeping them to the side, to prevent the tongue from sliding, to them by the back of the throat; this has a soothing effect upon the brain, if not extinguished by great haste, and the child will soon be able to eat once or better, except your self, in a couple, egg, breadloaf, or any other food, which will give both of us ways preferring water.\n\n6. If the body is tired, rest it in bed.\n\n7. If the bruises are loose, lie down and warm bed remain there, and eat nothing but milk.\n\n8. If the action of the bowels does not occur at the usual hour, eat nothing at all, and take chocolate for thirty minutes, or more, and drink a cup of hot water or butter, and exercise in the evening, up to the extent of a good perspiration, and if the bowels do not move, follow this suggestion if practical, would soon appear of itself every year, both in the morning and evening.\n\n9. The three best medicines in the world are warmth, abundance and rest.\n\nJOB PRINTING.\n\nWe have duplicated the order for Stationery, which unfortunately, was left at Cumberland, and will shortly be able to supply our numerous patrons with all kinds of Job Printing.\n\nSPINK & MAVETTY,\nPROPRIETORS.\nTHE HUDSON'S BAY ROUTE.\n\nA New Route from Europe to the Interior of North America.\n\nTo the great majority of the people of the old country, and in fact to many of the inhabitants of the Dominion, the Hudson Bay and surrounding territories is a terra incognita. It is the region beyond the polar circle, with the frozen tundra of the arctic circle, and is looked upon as uninhabitable, save by the Esquimaux, and the land as unfit for cultivation. Of late years, however, public attention has been more particularly directed to this locality, especially in connection with a short route to Europe via the harbor of Churchill and the Hudson Bay, and railway line connecting the grain regions of the north-west provinces of Canada and Manitoba with this new outlet between the old world and the new.\n\nA few facts, mainly taken from a very interesting report of Dr. Bell, U.S., on the subject referred to, will be introductory to our remarks. The great inland sea (Hudson's Bay) is 1,900 miles in length and over 600 miles in width, and its total area is about 500,000 square miles, or about half of that of the Mediterranean Sea. It is enclosed on all sides by the land, except on the north-east, where it communicates by different channels with the outer ocean. The principal strait, which connects Hudson Strait, which is about 200 miles in length, with a width of about 100 miles, is Hudson's Bay. This is the central basin of the drainage of North America. The limits of this basin extend southward to the Labrador peninsula, or some distance inland on the east side, and to the Rocky mountains, or 1,500 miles on the west side. Over a great part of this region there is a temperate climate, and although the soil is sandy, at times it is extremely barren, yet large tracts are very fertile. But perhaps, the most important of the resources of the country around the Bay are its soils, timber, and minerals. To the south and west of James Bay, but that part from Lake Superior to the farthest one to the North West Territories of Canada, the climate sufficiently favorable for the production of grain, cattle, stock and dairy farming. The river water, and is drawn on an average for six months in the year). The fur trade is the American Content, and yet owing to the convergence of the merchandises which have been imported into and exported from this region, there is a considerable trade in oil which might be largely extended. There are other trade experts, such as whalebone, fish and seal for purposes of the Hudson's Straits. Water food are New York, via Cape Clear, 3,400 nautical miles, showing sixty-four miles in favor of Churchill, as compared with parts afford a plentiful supply of Montreal, and 114 miles compared with Toronto. To the west of the above, is another point of interest. Some years ago the timber lands of the North West Territories, say from a point between the North Saskatchewan and the Peace River to Churchill, was about the same as the city of Edmonton. Now as the sea voyage from the former to Liverpool is rather shorter than from Montreal to Liverpool, it follows that by adopting the Hudson's Bay route, when commerce between Liverpool and Montreal is saved by way of Lake Superior, the amount to 1,724 miles and by way of Chicago to 1,806 miles. The total distance from Winnipeg to Liverpool (via New York), is greater than to Montreal. Thus a consignment of grain or beef sent from the Saskatchewan or Peace River districts by way of Churchill might be in Liverpool as soon as it could arrive at Montreal, if seen by the Lawrence route. Even from Winnipeg in the south-eastern part of the great territory, the distance to Liverpool is at least 800 miles less by taking this route. Having thus shown that this route is the shortest to Europe, the next point to be considered is the practicability of the route as regards the length of the season during which navigation is possible. Authorities seem somewhat conflicting on this point, varying from four to six months in each year.\n\nMESSRS. J. H. BROO & CO., manufacturers, agents of St. John's, Newfoundland, state that they have no doubt of the practicability of navigating the Straits and Bay with proper steamers during the months of June, July, August, September and October. From all that can be learned on the subject, it appears probable that the Straits and Bay are navigable for steamers for at least four months in the year, or from the middle of June till the middle of October, inclusive, and probably including also ocean passage in the first spring and the last autumn voyages. This will bear comparison with the navigation of the St. Lawrence, as regards the absence of ice either in the spring or fall. This is a very important subject, as regards the interests of the great North West, and cannot be properly discussed in a single article. We propose to refer it to a future issue.\n\nNOTICE.\n\nPRINCE ALBERT\n\nFURNITURE STORE\n\nG. CARTER & SON\n\nWould inform the people of Prince Albert and the surrounding country that they have opened up their hands in the RED BRICK STORE for BEDSTEAD, CUPBOARDS, LOUNGES, TABLES, AND other heavy furniture.\n\nUpholstering and other work done here.\n\nWe have also a large stock coming by rail.\n\nC. CARTER & SON,\n\nPRINCE ALBERT.\n\nJ. SINCLAIR,\n\nMERCHANT TAILOR.\n\nFIRST CLASS GOODS\n\nALWAYS ON HAND\n\nCUT & FIT GUARANTEED\n\nCENTS' FURNISHINGS\n\nA SPECIALTY\n\nFirst Store East of Bank\n\nPRINCE ALBERT - N.W.T.\n\nESTABLISHED - 1860\n\nHEINTZMAN\n\nAND\n\nCOMPANY,\n\nPiano Manufacturers,\n\n117 KING - ST. WEST,\n\nTORONTO, ONT.\n\nPianos to Suit the Climate of the North-west.\n\nALL MADE OF THE BEST MATERIAL\n\nAND FINISHED IN FIRST-CLASS STYLE\n\nFIRST PRIZE WHEREVER EXHIBITED\n\nNEW PATENT BRIDGES\n\nApply at\n\n\"The Times\" Office,\nCOMMUNICATIONS.\n\nHERE PRINCE ALBERT CLUB.\n\nTo the Editor of The Times:\n\nMy attention has been directed to a proposal made by the Education Committee with regard to the \"Saskatchewan Club\" organized in this town. The proposal is as follows: Prince Albert Club, who have received a permit for 200 gallons of beer for club purposes this season. It is said that this proposal referred to the sale of beer when asked, but that Mr. C. Mair went to see Sir John about it, and Dowseley was asked to be present at the time. Sir John is not aware of what the proposal was, but the folk of Prince Albert. They should have been here three weeks ago. As there is no Mr. C. Mair I am unable to say anything in Prince Albert, I presume that the proposal pertains to the sale of beer. The editor of the Bulletin has been silent, and I think this paragraph regarding our club is erroneous. No person has ever been permitted to sell beer in this city until existing regulations have been rescinded, which is to be hoped for the best of the North West. If this is to be the case, some permits have been issued to members of the Club individually, and these permits will expire when received, will in due time be surrendered. It seems necessary to explain in the editorial column that the \"Saskatchewan Club\" is not a political, but a social club. It consists of members of both parties, and while they may be religiously disposed, are utterly indifferent to politics. This being the case, the members would be equally opposed to Sir John's proposal, and a highly honourable man, so that for Sir John to be prominent for his social qualities he is in other respects ignored. Mr. Mair would be doing a disservice to elect Mr. Mackenzie, and on precisely the same grounds. It is quite certain that neither of these men would be necessary for gentlemen to be at daggers' points, and refuse to meet each other. Such an attitude of mind as this happens to differ in matters of politics or religion. Society would benefit greatly by the removal of the North West, and one of the most powerful agencies now gaining such a status of things in the world would be removed. There is a existence in Manitoba, and has long since been founded here. Fortunately, Canada does not lack able-bodied men, and there are none but few honest men, who may imperil in the eastern provinces, while the North West is still young, and are particularly desirable. Prominent and influential men in all walks of life are making their way to the North West, and increasing numbers of the best and ablest of the country (alas! proverbially) through sacrifice and service, are preparing themselves in every way possible to equip them for situations. What can be a greater convenience, then, or more hopeful to the good of the country than the establishment of a line of travel, providing that the object most abused, than the retirement to a well furnished home, where the owner may enjoy the plainest comfort and the most luxurious conveniences and absolute quiet of mind and spirit? It is only fair to say that the greatest inequality is by reason of this, and it is to be hoped that not only Prince Albert, but the entire North West will be interested in the welfare of the Saskatchewan Club. We are too far apart to live in rivalry or jealousy of each other. Rather than the time be wasted concerning this subject, we have a larger provincial and social interest at stake.\n\nWith regard to the \"beer people\" of Prince Albert, I have nothing to say. If I read the club rules correctly, I cannot think in Prince Albert a Liberal member, unpretentious and kindly toward people of any party. This is the case. If I understand the word rightly, it is a very doubtful breed of either man or woman who would be the chief of the party at Edmonton as it is here. Let the editor of the Bulletin should assume as an argument against the formation of the Saskatchewan Club, it may be as well to inform him that when the announcement was made that the club would be formed in Prince Albert, it was to be expected, with a view to the ultimate provincial organization, into the Dominion Club, that the club would be considered right, following the precept of the Manitoba Club, to give to the name it deserves. Perhaps the editor of the Bulletin will be convinced by the above necessary correction, and inform his readers that the Saskatchewan Club is an ornament and a credit to Prince Albert.\n\nYours respectfully,\n\nC. MAIR\n\nPrince Albert, Nov. 28th, 1882.\n\nWe are pleased to hear that Messrs. Walters & Baker will start a general store in J. O. Davis's old stand.\n\nW. R. TOWN has returned to the Brick Store of the W. M. McLean & Co., Prince Albert.\n\nMr. T. Wilson has removed to their new offices, near the Bank.\n\nWe are pleased to hear that Mr. A. Ash has moved into the old Town Hall, and hopes that it will be occupied by one of our citizens.\n\nWe understand that Mr. C. Thomson, Blacksmith, has purchased the stock at Mr. A. Ash's old shop, and is now engaged in business.\n\nApply to\n\nE. H. MASON,\n\nAt Dobbin's Old Bowling House.\n\nBLACKSMITHING\n\nHorseshoeing,\n\nCarriage and Sleigh Ironing\n\nJubbing of all kinds done on shortest notice.\n\nIRON FOR SALE.\n\nCHESTER THOMSON,\n\nPRINCE ALBERT N.W.T.\n\nHARDWARE\n\nTinware,\n\nChains,\n\nRope,\n\nGlass,\n\nPutty,\n\nOrders will receive special attention.\n\nThe latest designs in\n\nDRUMSTHEATERS\n\nA select stock of\n\nBOOTS AND SHOES\n\nLADIES AND MISSES\n\nFRENCH KID LACED BOOTS\n\nHardware and Groceries expected daily.\n\nJ. R. McPhail,\n\nREMOVAL\n\nThe undersigned will remove to the Mission and will start a\n\nFIRST CLASS HOTEL,\n\nOPEN FIRST OF DECEMBER,\n\nMEALS AT ALL HOURS.\n\nA. DORIS\n\nFOR SALE ONE\n\nTeam Driving Geldings\n\nFour and Six Years Old.\n\nFor further particulars, call at\n\nWM. DILWORTH'S.\n\nFOR SALE ONE TEAM\n\nHeavy Draft Ontario Horses\n\nSeven and Eight Years Old, with Harness and Sleigh Complete.\n\nApply to\n\nJohn G. Tait,\n\nGable House.\n\nE. FLOOD & CO.,\n\nBANKERS AND BROKERS.\n\nReal Estate, Insurance and Financial Agents.\n\nDrafts issued on, and Collections made at all points in the Dominion.\n\nInterested parties are advised to deposit at current Office in new building, one street west of City Square residence.\n\nNotice.\n\nThe Partnership heretofore existing and known as E. FLOOD & SMITH, Prince Albert, has this day been dissolved by mutual consent. All engagements entered into by the firm will be paid to E. Flood and all claims against the firm will be paid to E. Flood. Mr. E. Flood will continue the business.\n\nTHOMAS O. DAVIS,\n\nSign of the Horse Shoe.\n\nCARD.\n\nI beg leave to inform my customers and the public in general that I have dissolved partnership and intend to carry on the business alone, and hope, by close attention to quality and low prices, to merit your patronage.\n\nTHOMAS O. DAVIS\n\nHORSE FOUND\n\nHave just received a large and general assorted stock of\n\nHardware;\n\nNOTICE.\n\nAll parties indebted to us, are requested to make immediate payment, otherwise their accounts will be placed in suit.\n\nMOORE & MACDONALD\n\nMason's Mill, Nov. 26th, 1882.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1882112201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9224, "total-output-tokens": 5748, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 8363, 2], [8363, 11622, 3], [11622, 11622, 4], [11622, 17360, 5], [17360, 24391, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]