[{"id": "7d665e37c3dc927fe6d994cedb0577ba699b3782", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FRIDAY, NOVEMBER 23, 1883.\n\nBANKING HOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nFORMAL OPENING\nOF THE YOUNG MEN'S LIBRARY AND ATHLETIC CLUB.\n\nThe formal opening of the rooms of the Young Men's Library and Athletic Club was held on Thursday, November 22nd, at Prince Albert. The club was established by Mr. John M. Campbell, who has been a generous donor. The club offers various facilities for recreation and intellectual growth.\n\nCUSTOM WORK\nPromptly attended to.\n\nSHANNON & MCLEOD\nNOTICE TO THE PUBLIC\n\nMEALS AT ALL HOURS\n\nFORTY SHARES\nIn the above Company for sale. First payment cash. All parties having paid back rach share will be entitled to purchase by order.\n\nPRINCE ALBERT, N.W.T.\n\nJACKSON & JACKSON\n\nTHE MISSION\nMcLEAN ELLIOTT\n\nTHE GRAND CENTRAL RESTAURANT\n(Old Woodbine Saloon)\n\nO. E. HUGHES & CO.\nGeneral Merchants\n\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT GREAT OFFER.\n\nTHE WINNIPEG WEEKLY SUN\nFROM NOW TO January 1st, 1885 for $1.50, PAYABLE IN ADVANCE.\n\nTHE LION REAPER\nHoney Fanning Mills, Watson Harrows and Buford Cross Flax\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FRIDAY, NOVEMBER 23, 1883.\n\n$2.50 A YEAR.\n\nBANKING HOUSE\nof\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nFORMAL OPENING\nOF THE YOUNG MEN'S LIBRARY AND ATHLETIC CLUB.\n\nThe formal opening of the rooms of the Young Men's Library and Athletic Club was held on Thursday, November 22nd, at Prince Albert. The club was established by Mr. John M. Campbell, who has been a generous donor. The club offers various facilities for recreation and intellectual growth.\n\nCUSTOM WORK\nPromptly attended to.\n\nSHANNON & MCLEOD\nNOTICE TO THE PUBLIC\n\nMEALS AT ALL HOURS\n\nFORTY SHARES\nIn the above Company for sale. First payment cash. All parties having paid back each share will be entitled to purchase by order.\n\nPRINCE ALBERT, N.W.T.\n\nJACKSON & JACKSON\n\nTHE MISSION\nMcLEAN ELLIOTT\n\nTHE GRAND CENTRAL RESTAURANT\n(Old Woodbine Saloon)\n\nO. E. HUGHES & CO.\nGeneral Merchants\n\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT GREAT OFFER.\n\nTHE WINNIPEG WEEKLY SUN\nFROM NOW TO January 1st, 1885 for $1.50, PAYABLE IN ADVANCE.\n\nTHE LION REAPER\nHoney Fanning Mills, Watson Harrows and Buford Cross Flax\n\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, N.W.T., FRIDAY, NOVEMBER 23, 1883.\n\n$2.50 A YEAR.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\nT. A. SPINK\nPRINCE ALBERT, N.W.T.\n\nPRINCE ALBERT, N.W.T.\n\nTHEM: Either advance or recede in our case will be determined by this paper. We shall be obliged if all letters are addressed to the Proprietors.\n\nA NORTH WEST CONVENTION\n\nNot long ago we wrote to you that we were preparing the Means and Means by which we could not make a very good thing out of the convention held at Regina, and we thought that the best course would be to hold another convention place along the line of the P. R. R., to discuss the question of a North West Alliance with North West Allies, with a view to effect some arrangement between those who were opposed to the proposal during the ensuing session of the Dominion Parliament, to permanently bring before the members of the House of Commons the most pressing of our demands concerning grievances and requirements. The idea is a good one, and we trust that it will be carried into effect without delay. The efficiency of delegations, provided that the right men are selected. Persistent pressure from the right quarters will more likely prove beneficial results than all the speeches and petitions that could be presented, or resolutions drawn up, and, we believe, the result of the Education and St. Albert delegations will show. The only thing that can prevent success is lack of enthusiasm. Members can put themselves in their proper places and forget all party considerations. We believe that the game quite easily, and something great their opinions to afford the opportunity for action. Last winter, we urged upon our people the importance of sending a delegation to Ottawa, to present our demands, and we believe that if this had been done there would, at least, an opportunity for a better understanding of our points; there would have been improved relations. We have not lost sight of the matter, and a further rights association, which will be called the North West Alliance, has been formed. We have been working hard for this purpose, and we believe that the time is ripe for its organization. We are anxious to see an organization of this kind, and we believe that it will provide funds for the expenses. The result of sending a delegation to Ottawa will be to bring about a better understanding of our views, and we believe that such an organization will be of great benefit to us. We believe that the time is ripe for its formation, and we believe that it will provide funds for the expenses.\n\nWANTED - A POLICE MAGISTRATE\n\nAmong the many wants of this place, and the country in general, there is none so pressing as the want of a police magistrate. The want of a police magistrate is felt throughout the entire country, and we believe that the time is ripe for its formation, and we believe that it will provide funds for the expenses.\n\nThe Mounted Police\n\nQuite a sensation was created on Sunday by the arrival of a large force of Mounted Police, under the command of Capt. Anderson. Of course there was still much excitement in the air, and it was said that they came here in response to a request from the citizens of Prince Albert. The Mounted Police are now stationed here, and they have been sent out in response to a request from the citizens of Prince Albert. They have been sent out in response to a request from the citizens of Prince Albert.\n\nJ. M. CAMPBELL\nTRESTON HOUSE\n\nBest Billiard Hall west of Winnipeg\n\nFIRST CLASS POOL & CARO TABLES\n\nWM. BURKE - Prop.\nJAMES SINCLAIR\nMerchant Tailor,\n\nHas just received his new stock of Fall and Winter Goods,\nAnd is prepared to supply his numerous customers with\n\nSuits to please the fancy of all.\n\nAlso a large stock of UNDERCLOTHING\n\nA Large Assortment of FUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR\nEAST END BAKERY\n\nEight Leaves for $1.\n\nHugh McDougall\nEast End Bakery\n\nWALTERS\nAND\nBAKER,\nGeneral Merchants\n\nPrince Albert.\n\nG. & C. E. CARTER,\n\nFURNITURE\n\nFancy Parlor and Bedroom Sets.\nSideboards, Bureaus, Bedsteads, Couches, Sofas.\n\nChairs of nearly all Descriptions.\nCradles & Cribs for the Babies\nRocking Chairs for the Ladies\nMattresses Single & Double to suit Customers.\n\nSTEWART & WOOTTON,\nWholesale and Retail.\n\nSaskatchewan.\n\nNOTICE.\n\nTo Lumbermen and Others\n\nWho are desirous of obtaining Permits to cut New Logs, House Logs, Rail, Fence Posts, etc., in any part of the District of Prince Albert, North West Territories:\n\nBe advised that the Crown Timber Agent will strictly comply with the rules and regulations of the Dominion Act, which forbids any trespassing on Crown Timber Land. Any person who cuts timber on any land without a permit is subject to seizure, and can be prosecuted under the provisions of the Act. It is also stated that the Crown Timber Agent will strictly comply with the law, as laid down in said Act, will be well treated and fairly dealt with.\n\nThe public is requested to assist in preventing the wanton and reckless waste of timber, using every means in their power to prevent the destruction of trees of value. If not prevented, the local waste of the people who are only engaged in settling on the fertile prairies.\n\nPersons claiming wood already cut on north side of the South Saskatchewan River (between the townsite and the river) will be asked to produce permits, and settle dues at my office on or before the 15th day of November, 1883, otherwise the timber will be subject to seizure and double dues charged.\n\nAny information with regard to the location of timber, or the number of the various kinds of timber cut to accountance with the Act, will be cheerfully given by Mr. McLean at Meacs & Elliott's law office.\n\nD. J. WAGGONER,\nCrown Timber Agent,\nPrince Albert District, N.W.T.\nOctober 31, 1883.\n\nNOTICE.\n\nDuring my absence from Prince Albert.\n\nMR. GEORGE CASSE,\nwill act as my agent.\n\nG. T. BROWN\n\nNOTICE\n\nI have given notice to the Hon. Secretary of the Valley Railway Company, respectfully to the Parliament of Canada at Queen's Park, for an Act to extend the time for the completion of the railway, and for the construction upon their Railway, and to otherwise amend their Act of Incorporation.\n\nKILVERT & DUGGAN,\nSolicitors for Applicants.\n\nHamilton, October 2, 1883.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nThe New Fort And Town Site.\n\nThe Progress of building - A new barracks.\n\nThose who have visited the town of Fort Macdonald will be aware that the site upon which the new town was laid out and the fort built is a most beautiful one. The town site extends from the river to the south, and covers a large tract along the south side of the river. The town is well laid out with streets and sidewalks, and is surrounded by beautiful parks and gardens.\n\nThe fort is situated on a hill overlooking the town, and is connected with it by a good road. The fort is being rapidly built up, and will soon be completed.\n\nThe town is expected to be completed by next spring, and the fort will then be ready for occupation.\n\nThe following is a list of the names of the people who have subscribed for lots in the town:\n\nMr. J. Smith\nMr. W. Johnson\nMr. H. Brown\nMr. G. White\nMr. J. Green\nMr. F. Black\nMr. R. Brown\nMr. J. White\nMr. H. Green\n\nThe following is a list of the names of the people who have subscribed for lots in the fort:\n\nMr. J. Smith\nMr. W. Johnson\nMr. H. Brown\nMr. G. White\nMr. J. Green\nMr. F. Black\nMr. R. Brown\nMr. J. White\nMr. H. Green\n\nThe following is a list of the names of the people who have subscribed for lots in both the town and the fort:\n\nMr. J. Smith\nMr. W. Johnson\nMr. H. Brown\nMr. G. White\nMr. J. Green\nMr. F. Black\nMr. R. Brown\nMr. J. White\nMr. H. Green\n\nCOAL OIL.\n\n500 GALLONS,\n\nAMERICAN AND CANADIAN.\n\nAT\n\nJ. L. JOHNSON & CO'S.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nHUDSON'S BAY CO'Y\nFARMING LANDS!\nFOR SALE IN\nManitoba & North-west\n\nThe Hudson's Bay Company owns 15,000 acres in the area, fertile belt, and offers for sale 20,000 acres already surveyed by the Government of Canada.\n\nTOWN LOTS FOR SALE\nIn Winnipeg, West Lynne, Fat Portage, Portage la Prairie and Bochen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information regarding these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. BRYGER, Land Commissioner.\n\nPRINCE ALBERT BAKERY.\n\n2 LB LOAF, 12c.\n9 LOAVES, 1s.\n\nCakes and Pastery always on hand and made to order.\n\nWM. R. BELL.\nNOTICE.\nJUST ARRIVED\n100 HORSES\nCONSISTING OF\nWORK, SADDLE AND BROOD MARES.\nFreighting, express and passenger line from Gabriel's Crossing to Troy and back.\n\nPH. GARNOT.\nTO THE OLD STAND.\n\nTHOMAS O. DAVIS.\nHORSE SHOE STORE.\n\nHO FOR THE WEST.\nGENERAL BLACKSMITHING.\n\nHORSESHOEING\n\nHorse on the Most Approved Principle and the Best Shoeing Materials.\n\nSleigh and Cutter Ironing.\n\nCarriage Repairing.\n\nAnd Jobbing\n\nPROMPTLY ATTENDED TO\n\nWM. GORDON.\n\nR. WAGNER.\nWagoner Timber Agent.\n\nAll the Boys who subscribe for The Times, only $25 a year.\n\nCommunications.\n\n\"DEAR WAGNER.\"\n\nTo the Editor of The Times.\n\nSir, — In reply to \"Examiner's\" letter of this date last week, I would say that there is no such thing as a \"Certainty.\" Certain things have reference to the merchant, mechanic, speculator or professional gambler who has a certain sum of money at stake, their condition is known.\n\nNeither can it be the farmer who receives three dollars for his day's work. As far as the farmer is concerned, he is paid a fair wage for his work, but he cannot make a living by farming a few acres to eat, sell, or barter.\n\nIf the farmer does not have enough to live on, he is poor. If there are no farmers in the town of Prince Albert, and can tell me where each went to, I shall be obliged. If there are no farmers of less than ten acres, I will cheerfully grant the privilege, and will assist in getting them started. I am sure that through the inclemency of the winter months. Yours truly.\n\nD. J. WAGNER.\n\nCanada Pacific R'y. Co.\nWestern Division.\nTRAIN SERVICE.\nCHANGE OF TIME.\n\nOn and after June 10th, 1893, trains will move as follows:\n\nGoing West\n\nGoing South\n\nWhen going\n\nEAST\n\nFor more your tickets read via the Canada Southern and Credit Valley Railways.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS.\n\nTHE ROYAL ROUTE.\n\nSt. P., M. & M. Railway.\n\nTime Table.\n\nN.B. — We sell by Imperial Measure. You get one-fifth more by buying Imperial Measure. Test it by the weight.\n\nCredit Valley R'y.\n\nWHEN GOING\n\nEAST\n\nFor more your tickets read via the Canada Southern and Credit Valley Railways.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS.\n\nTHE ROYAL ROUTE.\n\nSt. P., M. & M. Railway.\n\nTime Table.\nINCORPORATION.\n\nA meeting was held on Wednesday evening at Mr. Hogg's Hotel, to discuss the question of Incorporation, which was largely attended. On motion by Mr. Stewart, Mr. Macdonald and Mr. F. E. Cochran was appointed secretary. The chairman briefly explained the object of the meeting, viz., to consider whether they were going to take Incorporation, that they would have municipality and that they would all work together for the common good.\n\nMr. John B. Betts said that he had not had an opportunity of studying the distance between the town of North West Council, relating to Incorporation, but he had read the statement which was published in the newspapers, and thought that a committee be appointed to examine the claims expressed by the Act.\n\nThe Chairman then read from the Town Trustee's report on the Incorporation of town.\n\nMr. Betts suggested that the question should be discussed by the town Incorporators.\n\nMr. Wm. Stewart explained if the Guelphs people had considered the Ordnance and whether they were satisfied with it.\n\nMr. Dawsom said that the subject has been discussed extensively in the field of discussion and that the question is decided in favor of town Incorporation. He was himself appointed at that time to go to the town of Prince Albert and District of Leves in a pamphlet form which will contain the advertisements of the various firms who have been engaged in the publication of the Ordnance and other matters.\n\nMr. George Miller expressed himself in favor of the measure.\n\nMr. James Brown thought the town should be four miles long and half a mile wide.\n\nMr. Dawsom suggested that there ought to be a town hall to take care of the affairs of the town and women's associations in the centre.\n\nThe meeting then proceeded with the appointment of a committee to arrange details.\n\nMr. Barker suggested that the committee should meet next week.\n\nThe following gentlemen were the duly proposed and seconded and several elected: Messrs. Thomas McKay, Wm. Stewart, J. B. Betts, J. D. Macdonald, Miller, J. D. Murray, J. B. M. Miller, R. Deasom and J. E. Hooper.\n\nMr. Barker said that the Committee be appointed to make the details required by the ordinance, to prepare necessary papers and plans, define the limits of the town, designate town wards, etc., and to report at a future meeting of citizens to be called for that purpose.\n\nIt was moved by Mr. Barker and seconded by Mr. Deasom that the town be incorporated into a town under the provisions of the Ordinance of the North West Council, passed for that purpose, which was seconded by Mr. Stewart and passed unanimously.\n\nA vote of thanks was then passed by the Chairman and Secretary and the meeting adjourned.\n\nNow that the hall has been bought, we hope to have a good season. The ordinance provides that the annual election shall take place early in January, except case of a previous election, for which there may be a special increase.\n\nA petition has been presented to the Council and Secretary, which must be answered by the Council and Secretary, and the number of inhabitants, etc., must be determined by the Council and Secretary, and the number of electors must be determined by the Council and Secretary.\n\nThe office of the Clerk of the Council has been removed to the new building nearly opposite Mrs. Macdonald's mill, River street. Office hours from 10 a.m. to 4 p.m., on Saturdays and Fridays.\n\nJOSEPH FINLAYSON,\n\nClerk of the Council.\n\nPrince Albert, Nov. 3, 1883.\n\nBUFFALO HALL.\n\nFall and Winter Stock\n\nCOMPLETE IN\n\nDry Goods, Clothing, Groceries and Provisions,\n\nWHICH MUST BE SOLD,\n\n4,000 POUNDS RYAN'S CELEBRATED\n\nShort Clear Bacon,\n\nHead Light Coal Oil.\n\nREMEMBER,\n\nWe sell all kinds only, and at Close Prices for Cash.\n\nBETTS & Gwynne.\n\nCITY AUCTION MART\n\nMARKLEY & ORR,\n\nReal Estate and General Agents — the Agents in the Market for the\n\nThe Celebrated New York Singer Sewing Machine.\n\nKNOX & BARKER, Farmers' Restaurant.\n\nOFFICE AND WORKSHOP,\n\nNear Presbyterian Church.\n\nMANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\nTHE LARGEST PAPER IN CANADA!\n\nTHREE MONTHS FREE.\n\nThree Handsome Cash Prizes\n\nof $500-$200-$100.\n\nJ. O. DAVIS & CO.,\n\nWholesale and Retail.\n\nPrince Albert, Sask.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883112301.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9178, "total-output-tokens": 4554, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2376, 1], [2376, 8577, 2], [8577, 8577, 3], [8577, 8577, 4], [8577, 13157, 5], [13157, 17362, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]