[{"id": "dc967b6c0d127763b08d6853b912f7ddbc16b472", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N. W. T.\nPRINCE ALBERT TIMES is issued once a week, and will be sent by mail to any part of Canada. It is also available in Prince Albert, Saskatchewan, and other parts of the province. The paper is published every Friday.\n\nTHIS PAPER IS NOT TO BE SOLD TO ANY PERSON UNDER THE AGE OF 18 YEARS. It is intended for the use of adults only.\n\nFRIDAY, MARCH 18, 1887.\n\nD. H. MACDONALD, M. P.\nIf we had a cut of a game cock we would place our bet on Mr. Macdonald. He has been a constant supporter of the Conservative party, and his principles are well known to all who have had the pleasure of associating with him. We therefore believe that he will be re-elected as our Member of Parliament.\n\nNORTHWEST ELECTIONS.\nAs we expected, the Northwest has fallen into the hands of the great Conservative party under the leadership of Mr. Macdonald. We are rejoiced at this, not because we love party more than country, but because Mr. Macdonald is a strong supporter of the Conservative party. He has always stood up for the rights of the people, and has never been afraid to speak out against the wrongs done to them. We therefore believe that Mr. Macdonald will be re-elected as our Member of Parliament.\n\nTHE LATE ELECTIONS.\nThere is still a wide difference of opinion among the leading journals as to the actual majority secured by Mr. Macdonald in the recent election. The Globe claims that Mr. Macdonald has a large majority, while the Toronto Star says that he has a small majority. We believe that Mr. Macdonald has a large majority, and that he will be re-elected as our Member of Parliament.\n\nAMERICAN COAL OIL\nAT\nT. J. AGNEW'S\nT. N. CAMPBELL.\nJUST RECEIVED A LARGE STOCK OF\nMUSICAL INSTRUMENTS\nAccordeons, Harmonicas\nViolins, &c., &c.\nGames of all kinds. Progression Backgammon, Chess, Checkers, Dominos, and a large variety of Round Games.\nAlso a small stock of\nLATEST NOVELTIES IN TOYS,\nWHICH FOR THE NEXT WEEK I WILL SELL.\nAT COST FOR CASH.\nTHE WEST END STORE\nJUST ARRIVED.\nNEW GOODS\nAT\nCHAS. MAIR'S WEST END STORE,\nNos. Velling in Cream and Light Shades, Persian Parlor Rugs, Tapestry Carpets, Crimson Repps, Window Holand in Slate and Yellow Door Mats, Crumb Cloth Silk Corded Cloakings, Empress Silk Blinds and Garnet.\nFine Creations.\nLadies' Felt and Embroidered Petticoats, Ladies' Fancy Fillings, Beere Veiling, Ladies' Silk Ties, Tinsel, etc., etc.\nALL AT LOW PRICES.\nAlso a large stock of Ready-made Clothing and Fresh Groceries, including Fruit Collections, Biscuits, Figs, Dates and Tinned Goods of all kinds.\nInspection is solicited.\n\nSTOVES!\nA Further Reduction of 20 per cent. will be given on all BOX AND PARLOR STOVES Remaining on hand.\nCamp Stoves and Piping\nAT BOTTOM FIGURES.\nI have a first-class workman, and will execute all orders for Thomp's work with promptness, and guarantee satisfaction.\n\nHARDWARE!\nA FULL STOCK\nJ. R. MCPHAIL.\nMeeting at the Queen's\n\nMr. Macdonald Thanks His Supporters.\n\nMr. Macdonald called a meeting of his friends at the Queen's last Wednesday evening, in order to thank them for their support. A large number of people attended, and the utmost enthusiasm prevailed. Hon. Lawrence Clarke, Hon. Robert Macphail, Mr. Macdonald, and Mr. Moore Agnew, were present.\n\nThe Chairman, who was rising, was received with cheer, and said that it was most agreeable to address such a public meeting in a congratulatory sense. He thought we had reason to congratulate ourselves upon having attained a result so sought after—an election of a real man. (Cheers.) They all knew the feelings of the man who spoke from the centre, he had expressed Mr. Macdonald's views, and he felt proud to be able to say that he had been associated with a local man they had returned a commercial man—a man who represented the wants and interests of Saskatchewan. He had created his capital here, who had come here ten years ago, and who promised to make his home there. He would do anything against the local opposition for his candidate, but he objected to foreign influences interfering with the election. We had confidence in our ability to manage our own affairs, and we wanted our men to return to Parliament. Although Mr. Macdonald's majority just now was only 160 he would give his best for three years longer, and believed he had done all the returns were in. He had told them that we were young and ignorant, and needed an experienced man to lead us in affairs of importance, but Mr. Macdonald had proved himself the equal of any opponent at every place where he went, and the returns would be returned to him in the House of Commons not only with interest, but also with credit, for he had done more for the interests of a great district. He introduced Mr. Macdonald, who was received with encore.\n\nMr. Macdonald added: Mr. Clarke and gentlemen—I thank you for your great kindness to me, and I am glad to think you have done so much for me. I am proud of our success, and I am proud of what I have accomplished during the recent contest. When I was nominated by the Conservative Association, I did not expect to succeed, nor because of my own personal strength, but because I knew that in the hands of Mr. Macdonald, the result would be assured. Throughout the contest I have endeavoured to uphold the cause and principles which I believe in, and of that fact I feel all the more the honor you have done me, and I hope to see you all again next year. With the confidence you have reposed in me, I have a majority at present of 186, but I am sure that in the future, when I am between two and three hundred, and all the returns are in. That will mean an ordinary majority. I consider it a large vote, and I am glad that they polled for any man in Canada. I do not say because I consider it equal to the votes cast for any other party, but the confidence you have reposed in me, I have a majority at present of 186, but I am sure that in the future, when I am between two and three hundred, and all the returns are in. That will mean an ordinary majority. I consider it a large vote, and I am glad that they polled for any man in Canada. I do not say because I consider it equal to the votes cast for any other party, but the confidence you have reposed in me.\nNORTHWEST POSTAL DEVELOPMENT\n\n(From the Winnipeg Commissary)\n\nThe publication of postal service in Manitoba and the Territories may not be taken as an index to the general development of the country. It is well established that the mail was carried by horseback in the country with Great Britain via Hudson's Bay, the country being served by the Hudson's Bay Railway. This is another argument in favor of the railway, as the great majority of immigrants agree that the greatest portion of the North American Continent is not only the most remote but also the only means of regular communication with the outside world. Later postal communications were established via Eastern Canada, via Lake Superior and the Ottawa river. As late as 1853 these were the only routes. In 1862, one mail being received each year from the Old Country, via Hudson's Bay, and two twice yearly. In 1864, the first mail is received by the C.P.R. from the east, by way of the same route as that formerly traversed, while the length of time in transit has been reduced to less than three days, whereas it formerly occupied five weeks. In the future a daily mail will be sent and received from Hudson's Bay. In the year mentioned above, postal communication was opened between Manitoba and a monthly mail having been arranged for. By 1862 two mails per week were received in Minnitonka, via the Red River steamer. In 1863, the steamer was discontinued and the postal regulations. The mail was carried from Pembina on horseback, via the Red River steamer and trains in the winter. After the North-West postal service under the control of the Canadian Government was instituted immediately following the publication of the country from the disturbing influences of the first war, the postal service of the newly organized Province of Manitoba was assimilated with the general postal service of the Dominion. This was in the year 1871. At this time the nearest railway point was St. Cloud, Minnesota, some 425 miles distant. Fort Garry (now Winnipeg) was the nearest point arranged for from the railway terminus to Fort Garry, and trips were first made to Fort Garry in June. In 1872, a daily stage and mail route was established between Winnipeg and Pembina, which was continued until 1879, when the railway was completed to Winnipeg, in 1879, and which connected the latter place with the railway system of the Dominion.\n\nIn the meantime post offices had been established at various points throughout the province. From 1867 to 1872 there were forty-four post offices in Manitoba. These offices covered a distance of 380 miles, representing a population of about 10,000 people, constituting an annual travel of 84,438 miles. In addition to these post offices within the province, a post office was established on the far away North Saskatchewan, was established in 1872. The route supplied by this office was via Edmonton, one of these being Battleford, which place had about that time been made the seat of administration, although there was at that time very little to govern in the Territories, excepting the Indians. The mail was carried by wagons from Fort Garry, via Pembina and Winnipeg in the winter, the trip occupying six weeks.\n\nIn 1872 the postal revenue from the Province was placed at about $10,000, of which about three quarters were derived from the old route. With the opening of the provincial service, exclusive of the Edmonton route, was about $15,000 in excess of the revenue. During the same year the postal orders issued at the Winnipeg office amounted to about $35,000, and last year were to the amount of about $30,000. Post offices were opened in the bank department, established in 1871, which for the year ended June 30th, 1886, showed a deficit of about $200. In 1877 the staff of the Winnipeg office consisted of nine persons, all told.\n\nSince 1877 postal development in the Northwest has been much more rapid, until now there are about 450 offices in the entire district, distributed over the Northwest. Of these about 300 are in Manitoba, and about 80 in Assiniboina and the balance scattered over the territories. The postal work of the Northwest still necessitates an expenditure considerably in excess of the revenue, owing to the sparseness of the country, which has to be supplied, whilst the population is comparatively very small. Manitoba, however, contains a great portion of the country, the only long stage routes being those connecting points on the North Saskatchewan river with the main line of the C.P.R., such as Edmonton, which is supplied from Calgary. Only about 200 miles had to be travelled in this way. Edmonton, which was nearly 1,000 miles distant, was reached by stage coach. About 1875, a telegraph line was established in the country, so many years earlier offices as there were post offices. After that time there was a telegraph line between Winnipeg and Edmonton, and the story of her life was that of a daring young woman, who was engaged in the settlement, who was found dead in the woods, where she had been shot by a man, who had been killed by a bear. The story of her life was that of a daring young woman, who was engaged in the settlement, who was found dead in the woods, where she had been shot by a man, who had been killed by a bear.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887031801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 2846, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2944, 2], [2944, 6275, 3], [6275, 11555, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]