[{"id": "7a5e81e67ee5b560027bc74424cc3b39e4e5b494", "text": "PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nPRINCE ALBERT, SASK., FRIDAY, MARCH 5, 1886.\n\nBANKING HOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\n\nPRINCE ALBERT\nPlaning Mills and\nSash and Door Factory\nC. V. VIGETT AND MACKEY LTD.\n\nA. GOODFELLOW.\nShannon & McLeod\nare selling off the balance of their winter stock at cost, to make room for their\nSpring & Summer Goods\nNOW ON THE WAY.\n\nSHANNON & M'LEOD.\nWatchmaker and Grocer.\nHAMILTON, ONT.\n\nSEEDS\nALL THE LATEST NOVELTIES IN\nLadies' and Gent's Gold Rings\nWatches.\nChains.\nAll Gold Goods in the Line.\nWedding Rings Made to Order.\nARTICLES SENT ON APPROVAL.\n\nR. B. WAY.\nNotice Officer.\nJ. H. TAYLOR.\nNotice Officer.\n\nDENTIST.\nPRINCE ALBERT, N.W.T.\n\nGEORGE A. BENTLEY,\nBarber and Hair Dresser.\n\nCHARGES—MODERATE.\nSHOP—FIRST DOOR EAST IN SIMCOE'S BLOCK.\n\nJ. D. HANNAFIN,\nAuctioneer and Commission Agent.\n\nFURNITURE!\nCHEAPER THAN EVER.\nGILBERTE CARTER.\nWILLIAM KNOX,\nCARPENTER, ETC.\n\nOFFICE AND WORKSHOP.\nNear Presbyterian Church.\n\nA.W.R. MARKLEY,\nBank Agent and Auctioneer.\n\nBOOK STORE\nBooks, Stationery, Fancy Goods, Accordions, Violins, Violin fittings.\n\nE. J. CANN.\n\nPRINCE ALBERT FURS AND SKINS.\nNOTICE.\nI will pay the highest cash price for\nFurs and Skins, and will purchase\nall kinds of Beaver, Otter, Fox, etc.\nG. W. GOERNFLO.\nHAMILTON, CANADA.\n\nLOST\nA North-West Mounted Police chaplain\nin favor of Const. J. Campbell, No. 826.\nNumber of chaplain 693.\nNot endorsed.\nPlease return to officer commanding.\nPrince Albert.\n\nSEEDS\nWhen you select a Grade A Seed, you select a Grade A Farm. Seeds, you will be well pleased with our high grade seeds.\n\nROBERT EVANS & CO.,\nSeed Merchants and Growers.\nHAMILTON, ONT.\n\nTELEGRAPHIC.\nTHE VERY LATEST NEWS BY WIRE\n(By Special Telegraph.)\nOTTAWA, Feb. 27.—Mr. Fisher, one of the United States' West delegates, leaves for Prince Albert today. He expects to arrive here before the 15th February, 1886, otherwise they will be placed in the hands of the Attorney General of the Saskatchewan Court of Law here. If not convenient to meet me at the railway station, I am sure that I should have seen you there.\n\nParties having accounts against me will please render them to myself.\n\nA. E. PORTER.\nPrince Albert, Jan. 12, 1886.\n\nDRESSMAKING\nI WILL SELL\nHATS\nAND ALL\nWOOLEN GOODS!\nAT VERY LOW RATES.\nCall and get prices.\nMiss MAUIRE,\nCAMPBELL'S BLOCK.\n\nNOTICE!\nMr. Hughes, M.M.C., having been authorized by the Lieutenant Governor to expend a certain sum of money on the Main Trail between Prince Albert and Battleford, would be glad to receive all necessary particulars on application, and to receive tenders for the work. Mr. Hughes has also a small amount available from the funds voted by the Crown and which can now be used to his advantage. Applications to both sums should be made at once.\n\nJ. C. MacKenzie has thus far received the first installment of his spring Books and Shoes. Call and see them, and will send by mail.\n\nWe have heard through Mr. G. S. Davison, of the H. B. Co., that the Winnipeg & Western Transportation Co. will be able to reduce their prices for spring 1886. Prince Albert, general merchandise, per 100 lbs., 40¢; Books, 50¢; Fish, 15¢.\n\nCHIT-CHAT LOCALS.\nGathered by our Reporters.\n\nElegant Parlour at Clark's Drug Store.\nThe new few weeks business has been very briskly.\n\nThe skating race on the Saskatche-\nwan river will take place on Monday, the 11th inst.\n\nThe Prince Albert Hockey Team has been doing its best, and is very much improved in appearance.\n\nFollow a Syrup of Lemon, Sour's Eau-\nde-Cologne, and a Cup of Liver Oil at Clark's Drug Store.\n\nMr. J. F. Small, the popular teacher at our Public School, returned from South Dakota, where he studied the Sioux Indians.\n\nThe interest in our Town Parliament seems to have flattened out on about the same rate as taken in our Town Council.\n\nCol. Spratt and party left for Carlton on Wednesday last for the purpose of purchasing a horse for the next season. They will be absent about four months.\n\nMr. T. J. Agnew arrived home yesterday by way of an extended tour during which he visited, among other places, his old home in the Channel Islands.\n\nAs will appear by their advertisements, Mr. Chamberlain & Co. are selling the balance of their winter goods at reduced prices.\n\nTheir new spring stock has been shipped from Winnipeg.\n\nThere was a big crowd at Mr. Irving's, N.W.M.P., last night giving a ball next Monday evening to the citizens. A huge number of in-\nvitations were sent out, and every eligible man is expected.\n\nWe are pleased to hear that Mr. J. M. Lee, the popular Indian Agent, has been appointed to the position of Inspector of Indian Agencies. This is undoubtedly a well-deserved promotion.\n\nThe single hand curling match for the medal presented by the Hon. L. Clarke was concluded this afternoon. The last two matches were played by Messrs. Ross and Brown. Mayor McKay won by a few points, and holds the medal till next year.\n\nWe regret to have announce the death of an old and esteemed settler of the parish of St. Catharine's, Mr. Henry Murray, who died last week. His funeral on the last day was a large affair.\n\nThe members of the Town Band turned out on Wednesday evening, and drove to the residence of Mr. Belanger, Esq., to hear a string of songs. Mr. Belanger received the boys in his own hospitable manner, and a few hours were spent in speeches, songs, etc.\n\nThe members of the Argyle Curling and Shooting Club held their first meeting last night at the Argyle Club. We hope to see a large turn out of the citizens from both ends of the town. The band played some music and danced a sweet music during the evening.\n\nWe call the attention to Mr. Hughes' notice in another column. We congratulate our member on his success in obtaining a grant from the Dominion government for the use of our school, which are badly in need of it. We believe this grant is about the first indication we have had of any movement toward the funds at the disposal of the Lieut. Governor to this part of the country, although large grants have been made to the schools in the more populated districts.\n\nA game of points was played this evening between the Saskatche-\nwan Curling Club and the Calgary club. The ice was in bad shape, and the game was not made.\n\nThe game was played by Mr. J. F. Pringle, who scored fifteen points. The medal was then played for by the winners of the previous year, Mr. J. F. Pringle and Mr. Col. Spratt (last year's winner being absent), and resulted in favor of Mr. J. F. Pringle, who is now the holder of the Calgary medal played for in the North West.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT N.W.T.\n\nPRINCE ALBERT TIMES\n\nSUNDAY CHURCH SERVICES\n\nST. MARY'S\n\nST. PAUL'S\n\nST. JOHN'S\n\nST. ANDREW'S\n\nST. CATHERINE'S\n\nFRIDAY, MARCH 5, 1866\n\nN. W. C. DELEGATES\n\nMESSRS. W. D. D. PERLEY OF WELLSLEY, J. ROSS OF MOOSE JAW, AND DR. J. T. WILSON OF EDWARDSVILLE, WERE APPOINTED TO REPRESENT THE NORTH WEST COUNCIL TO GO TO OTTAWA AND TO SUBMIT TO THE DOMINION GOVERNMENT ON BEHALF OF THE PEOPLE OF THE NORTH WEST TERRITORIES THE FOLLOWING BILL FOR THE YEAR 1866:\n\nThat the Council have power to incorporate companies having purely territorial objects, the immediate settlement of old settler's claims, and the sale of land.\n\nThat the Government should use its influence to have the freight rates on the Canadian Pacific Railway reduced, especially on lumber from British Columbia.\n\nThat no measures be made to settle the wood or fuel, and that each homesteader be allowed 4,000 local feet of building timber on a five year permit.\n\nThe early improvement of the North Saskatchewan.\n\nThe granting of the right of habitation to the North West.\n\nThe opening for settlement of ceded lands.\n\nA Special Court of Appeal.\n\nThe construction of a trail to Peace River.\n\nRepresentation in the Senate and House of Commons.\n\nThe establishment of the Territorial road of land transport.\n\nThe right to enter a pre-emption as a second homestead.\n\nThe encouragement of railways through the territories.\n\nThat the same will be given equal to the duty now imposed on agricultural implements and lumber.\n\nThat the odd-numbered sections should be opened for settlement.\n\nThat measures be taken by Parliament to provide a system of government in the North-West should be agreed in the North-West Council, as the representatives of the people.\n\nThe early and rapid construction of the Hudson's Bay Railway.\n\nThe immediate appointment of a commission to settle outstanding half-breed claims.\n\nThe prompt settlement of claims for compensation for railway losses, and the payment of settlers and merchants who furnished supplies to the troops in good faith.\n\nThe appointment of residents of the Territories to positions of trust and responsibility in the Territories.\n\nThat all food supplies for the Mounted Police and Indians be purchased in the Territories.\n\nThe recognition of the services of the Mounted Police and the Prince Albert and Battleford special forces in a manner similar to the volunteer force.\n\nThe delegation arrived in Ottawa on the 17th ult., and felt satisfied with the reception they received. It is expected that the provisions of the Bill of Rights will be granted.\n\nThe territories will receive five representatives in the House of Commons and two in the Senate; Alberta being represented by two members, while one will be given one, Saskatchewan with 8,000 population, one, and Assiniboina with 15,000, two.\n\nThe St. Paul Pioneer Press says Donald Grant, the railroad contractor left St. Paul last evening for the South. He admits that he and Roary McLennan have contracted with the Canadian Pacific Company to build the first part of that line, and hopes to start work early in the ensuing spring. Mr. Grant said he had full faith that the line would make a profit to the proprietors of not only the Canadian Northwest but also get a share of the States' and Territorial business as well.\n\nIn laying the matter before the English capitalists, the testimony of the captain of the steamer was most emphatic in what he removed the season's crop product before the close of navigation. Of course, Mr. Grant further said, steamers could not navigate the river after navigation closed, that is, after the ice came down, and that sailing vessels from four to eight months of the year.\n\nThe new mill machinery will arrive here next week, and will be installed at once. The new mill machinery will be installed at once.\n\nMr. Behanger, of the H.R.C., left yesterday morning for the east. He expects to reach Edmonton Monday and then proceed by dog train across the lakes to his home at Cumberland. He expects to return here on the opening of navigation by river boat.\n\nJAMES SINCLAIR\n\nMerchant Tailor\n\nGENTS' FURNISHINGS\n\nSETTLERS' MEETING\n\nA meeting was held at St. Catherine's on the 19th inst., to consider the question of establishing a school in the adjoining parish. Mr. Hughes M.N.W. C., who was present by invitation, addressed the meeting. Mr. Wm. Craig, Secretary. The Rev. Canon Field detailed the steps he had taken in the matter, which were so limited in quantity, that they could not meet anything like a general application for relief. The meeting was unanimous in opinion that the Rev. Canon had done all in his power to meet the case, but that the matter was beyond his control, and ought not to be undertaken. As it was very evident that a large majority of the Half-Breed population of both parties were unable to pay their taxes, a committee was appointed to interview Mr. Adams, the Indian Agent, and the Chairman and Secretary of the Board of Commissioners of the deputation, none of whom are applicants for relief. After a vote of thanks to the Secretary, the meeting adjourned.\n\nIn accordance with the above resolution, a committee consisting of Mr. Adams, L.D. and Mr. Pritchard, the relief officer, but although both gentlemen expressed sympathy with them, they stated that they had no power to meet their demands. The deputation then requested Mr. Hughes to forward the facts of the case to His Honour the Lord-Governor.\n\nIt appears that about four hundred souls are living in the various parishes, and that at present the Government allowance would only admit of an increase of about twenty-five cents per head, or less than one and three-quarters of an ounce of beef per day per head.\n\nWe understand that the English people living partly in the same neighborhood as the Indians, were amongst those detained here last spring at seeding time to garrison this place and were unable to put in their crops. We understand also that the Indians were instructed to be there in order to state that they were led to believe by Brigadier Major Hayter Reid that they would receive rations until next harvest. We have heard this statement from several sources, and should like the subject ventilated, perhaps some of our readers could enlighten us.\n\nQU'APPÉLIE\n\nFrom the Editor,\n\nDr. Semple has received instructions to conduct a medical inspection of the adjacent district.\n\nA medical examination is to be held in the creek house on Tuesday next, and we understand that quite a number of persons are likely to appear.\n\nThe new mill machinery will arrive here next week, and will be installed at once.\n\nMr. Behanger, of the H.R.C., left yesterday morning for the east. He expects to reach Edmonton Monday and then proceed by dog train across the lakes to his home at Cumberland. He expects to return here on the opening of navigation by river boat.\n\nJAMES SINCLAIR\n\nMerchant Tailor\n\nGENTS' FURNISHINGS\n\nDRY LUMBER\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra,\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nNOTICE.\n\nROBERT THOMSON,\nSign & Ornamental Painter,\nCalomining and Paperhanging on short notice.\nDecorative Painting a Specialty\n\nWAR DECLARED!\n\nW. C. RAMSAY\n\nWould respectfully intimate to his friends and the public generally that he has purchased Thompson Castle, a handsome building, and has renamed it River Street, near J. L. John's hardware store, where he has determined to reside. He charges high prices for his engraving and general blacksmithing. A trial is respectfully solicited.\n\nThe Nor West Farmer\n\nTo Yield a Generous Return to the Farmer\n\nIt is desired, a good deal to bring about this happy state of affairs, and wants the co-operation of every man in the province.\n\nThe Nor West Farmer is devoted to the interests and advancement of agriculture, and will give every facility to those who desire to run over with information and news of the latest developments in the world of farming and its branches. It will give every facility to those who desire to run over with information and news of the latest developments in the world of farming and its branches.\n\nHelp Along the Good Work\n\nBy SUBSCRIBING AT ONCE.\n\nONLY $1 A YEAR\n\nThe Nor West Farmer Printing and Publishing Co., Ltd.\n\nWINNIPEG MANITOBA\n\nSubscriptions taken at the office of the Prince Albert Times.\nNORTH WEST NOTES\n\nFORT MCKEO.\n\nFrom the Gazette.\n\nA very light fall of snow fell last night past midnight, but making the ground look white. It has all disappeared. There men named Sota, Matson and Simpson have been Trappered. They have not been captured.\n\nThe ice is now open at Kipp, and at several other places, where fishing is impossible. At no place is the ice safe to cross on.\n\nWe understand that the services of Mr. Chipman, teacher on the Methodist Mission on the Reserve reserve, have been dispensed with.\n\nConstruction has been commenced on the Roman Catholic church at Pincher Creek. From the information received it is going to be a very handsome building, and will be a great acquisition to our sisters.\n\nThere was a heavy fall of tropical rain on Friday. Somewhere in the neighborhood of 14 inches fell in the rain and hail. The weather will probably continue through several more weeks in a most unseasonable manner. It is going on every day.\n\nFor the past week the weather has been very windy, beautifully calm and cool, by day. The weather was warm and the nights hot. There being only one really cold day, viz., Sunday, the maximum of the thermometer during the time specified has been about 30°, while the minimum (Sun) varied from 25° to 28°.\n\nEDMONTON.\n\nFrom the Bulletin.\n\nThanx on Friday.\n\nToboggans in the snow.\n\nMr. Anderson is still suffering from the effects of the tragic accident of last week.\n\nMisses Hardisty and Anderson were seen some time earlier driving on Friday Night.\n\nRed River Lode has almost certainly been saved from further attack of that sinister fever.\n\nLess than a mile of Red River is expected to be covered before being up settlers for the Red Deer country.\n\nThe Indians made a very poor hunt during January as the weather was cold, and the crops prospects were not good.\n\nOwing to the increase use of coal, however, has been hampered in farm duties, the present thus in any previous year.\n\nJ. Hutton returned from a trading trip to Batoche on Friday of last week. The snow is very deep and the conditions very bad.\n\nX. St. John has dug well on his premises on Main street, striking water at a depth of about feet. About 100 feet below the brink of the high bank of the river, which is almost perpendicular at that point.\n\nHe went to T. G. Hutton's place, Little Mountain settlement, last week, at a depth of about 18 feet, but found nothing except a layer of sand immediately underneath a bed of gravel. A bucket full of the gravel which was washed out showed that there was no real being in the form of coarse gold. The well is to be progressed further.\n\nLETHBRIDGE.\n\nFrom the News.\n\nThe new town is looking up. Nearly all the outside work is done on it.\n\nThe ice has gone out this year, the depth of the river being good. On the river have the ice still remains and teams are still crossing on it, but it is getting thinner.\n\nThe Dominion Government will send an official to the Northwest in the spring to examine the claims of those half breeds who are now engaged in fighting the Commissioner.\n\nA meeting will be held in the railway waiting room at Lethbridge, next Friday for the purpose of organizing a rifle association at Lethbridge.\n\nA number of young men have been gathering at the corner of Main and Main streets, playing cards and shooting guns.\n\nMr. Nelson brought into our office today some live native grasshoppers, which he had captured in the field with them. This shows what kind of weather we have in this part of the country. We speak seriously for it as a fact.\n\nREGINA.\n\nFrom the Leader.\n\nMr. Ponson has gone out to take the building materials for the bridge to be built across the Qu'Appelle River.\n\nCapt. Parsons mill at Moose Mountain is now nearly completed and will be a great addition to the city there.\n\nWe call attention to a circular of the P. R. Co. barley. It shows that there will be a good market for barley next year.\n\nRailway officials are anxious to change the location of the station house so that the members of the Board of Police Commissioners may be able to get there without difficulty.\n\nMr. Macdonald paid Regina a visit on Tuesday. He explained the wants and wishes of the Crooked Lake Indians, to His Honour the Lieutenant Governor.\n\nMr. Neale arrived here on Thursday night and was placed under arrest by Col. Irvine for the alleged beating of his wife. He was at once sent back to his mission. Capt. Neale claims when placed under arrest by orders of Col. Irvine he was told that he would be charged with assault and battery, but was never granted him the desired leave of absence.\n\nThe affair has created some sensation here.\n\nA HERO.\n\nHe holds his life as a trust, and not as a possession. His general course of action is that of a administrator, rather than that of an owner.\n\nHe thinks little about himself, but much about others. The ordinary man would have let go out of his life, but what can he do with it.\n\nIt promotes or hinders, or weakens, confidence in his capacity to manage his affairs. To serve because he looks out on life from the standpoint of the least Christ-like hero wrote:\n\n\"I am not my own.\"\n\nHe was born at Mataura, Ceylon, educated for its diamonds, and on Mr. Lawrence's return he went with him.\n\nShe asked if she had brought any with her.\n\n\"Yes,\" and the mother, producing her baby, \"here's my Mataura diamond.\"\n\nShe was prophetic, though in words, which were not heard by the child, but which were spoken by the child, which could not be heard by anyone else.\n\nIt was a boy and man. He never \"found\" anything, but always gave it away.\n\nHe was a man of estate, who had a hand to give, woman, child, or beast, to any creature that was down.\n\nHowever, he was self-effacing, even at a great sacrifice, when self-sacrifice demanded by another's welfare. His father, a retailer, lived on a small income, and the family was obliged to make money at the ordinary where cadets prepared for the East India Service.\n\nFoot-ball and cricket were as essential to an English boy's happiness as three meals a day. But Henry never indulged in these pastimes, and he would not ask his father for the money.\n\nAt the end of his vacation, the boy started home, collected a bundle of clothes for a poor lady in London. On arriving at the station, he bought a large one, thrown over the streets, and delivered it to her.\n\nA sample deed. Yes, but one which stood at the head of the list, and which was not claimed to sell itself, but was carried by a bundle through London streets.\n\nNow, with a few hundred and another thousand of Henry's, which had been sold, he had expanded his business.\n\nA sheet of flame, a terrific report, and dense darkness were followed by his low voice saying, \"I am here.\" I am here.\n\nHe lingered two days, his mind intent on serving till the last. Monday dinner was given to the garrison, and he joined the defence of the place, with the order \"never to give in.\" He took the place when asked to retire, and ordered the gunners to blow up the bomb.\n\nHere lies Henry Lawrence, who tried to do his duty. May the Lord have mercy on his soul.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVEETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nCommunications.\n\nSeed Grain\n\nTo the Editor of The Times.\n\nThe farming community has been largely interested in seed grain during the past season. The supply of seed grain to the settlers of this district by the Government has been very satisfactory, and the prices have been reasonable. The farmers have been pleased with the quality of the seed grain received, and have been able to plant their fields with good results.\n\nThe following are some of the seed grain suppliers:\n\n1. Mr. Smith, 123 Main Street, Regina.\n2. Mr. Johnson, 456 Main Street, Regina.\n3. Mr. Brown, 789 Main Street, Regina.\n4. Mr. Green, 1012 Main Street, Regina.\n5. Mr. White, 1234 Main Street, Regina.\n\nThese suppliers have been able to offer competitive prices and high-quality seed grain to the farmers of this district.\n\nMiss Mack & Co.\n\nJust Received:\n\nLarge assortment of Ladies' and Children's\n\nStoves, Felt, Velvet and Cashmere Hats, Hoods and Bonnet Shapes, Feathers, Flowers, Buckles, Jet Lace, Ribbons, Satins, Velvets, Plushes, Crepe, Feathered Collars, Muffs, Cashmere Shawls, Curtains, Woolens, Gloves, Honesty, Buttons, Lining, etc.\n\nAt lowest prices possible. Come and see.\n\nFirst Door East Telegraph Office.\n\nJ. M. Campbell\n\nHas just received a complete and well assorted line of\n\nREADYMADE CLOTHING\n\nDry Goods\n\nCrockery,\n\nGroceries!\n\nAlso a large Quantity of WINNIPEG FLOUR\n\nCHEAP FOR CASH.\n\nJ. M. Campbell.\n\nCaledonia Brewery\n\nEast End.\n\nMr. Breckman, the Italian Inspector left for Regina last week. While here he visited many farms and inspected various matters connected with his department, was generally well received. His arrangements for the coming season are very commendable, and doubtless he will be able to extend his services to the extent of his present position.\n\nA Billiard Table and Saloon\n\nLivery & Fe D Stable\n\nChas. Woodman\n\nProprietor\n\nWatches, Clocks and Jewellery\n\nkept constantly on hand\n\nT. E. Jackson\n\nNew Stand, in the building lately erected, as per a Fire Act.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886030501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 5907, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6564, 1], [6564, 15362, 2], [15362, 22575, 3], [22575, 24554, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]