[{"id": "cae56519825c23a1f271628cebea715fbc3a5b8b", "text": "PRINCE ALBERT TIMES\n\nSUNDAY CHURCH SERVICES\n\nThis paper may be found at:\n\nNEW YORK\n\nFRIDAY, OCT. 26, 1888.\n\nRAILWAY EXTENSION.\n\nAs anything pointing to the extension of a railway to the Saskatchewan is of peculiar interest to the people of Prince Albert, we publish the following extract from the \"Regina, N.W.T., Oct. 11 (Special).\"\n\nAfter much delay and many vexations the special order for the Long Lake railway seems to be on its way.\n\nYesterday Mr. Davis received a letter from Mr. Van Horne saying that the C.P.R. was ready to make arrangements for the purchase of the road, that the present road would be put into operation being done by the C.P.R., and that he had heard from Mr. Pugley that Mr. Davis could give him the information. It may appear strange that Mr. Davis has not been able to go with the road at once to the Saskatchewan in the spring.\n\nMontreal, Oct. 12 (Special) — President Van Horne wired Mr. Davis, the C.P.R.'s correspondent, and asked as to the telegram from Regina about the Long Lake road. Mr. Davis wired back that he had written N.Y. to Davis that the C.P.R. had completed arrangements for securing the road. Mr. Davis wired back that he would put in operation this year, but that it would be extended to the Saskatchewan next year. Mr. Horne wired Mr. Davis that he only wrote to Mr. Davis that there was nothing under discussion, and added, it is probably that the road will be completed next year, but that it cannot be done until the C.P.R. completes its own line. In reply to Mr. Davis' inquiry in Winnipeg, it was learned that Engineer Gordon, of the C.P.R., is out looking over the road, and that Mr. Gordon will report as to the probable cost of putting it in order.\n\nThe Regina Leader says: \"If telegrams and letters and rumors could build a railway to Saskatchewan we should have had the Long Lake road completed months ago.\" But the signs just at present point to a crisis of some kind, and from all the evidence now given we should judge that preliminary work at all events will commence 'right away.' On Thursday came the following despatch, which we should say was a clincher:\n\nWinnipeg, Oct. 10, 1888.\n\nM. F. Davis, M.P., Regina.\n\nArrangements completed, which inures railway to Saskatchewan. Work probably commenced immediately.\n\nG. R. PUGLEY.\n\nThe visit of the engineers seems to indicate that, as Mr. Pugley intimates, work will commence before winter closes.\"\n\nThe people of Saskatchewan have grown so accustomed to rumors such as these given above, and have been so long disappointed that they do not, naturally, give them much credence. But we believe that the road actually in the hands of the C.P.R. will be purchased by the Prince Albert settlers when Mr. Davis returns from his trip to Regina. We know that the C.P.R. have acquired the charter, even if work should not be commenced immediately. We think that our own representatives in the Legislature might very properly ask the other members of that body to join them in urging on the Government and the railway company the absolute necessity which exists for extending a railway to this district at once.\n\nA BAD CASE.\n\nEnsign Robert Boville, Rockville, Ont., says:—I used Naval Balm for a bad case of catarrh, and it cured me after several remedies. It never fails to give immediate relief for cold in the head.\n\nWe are in receipt of the following clipping, Dr. Charles H. Clark, M.D., Rockville, Ont.:—I have used Naval Balm for the cure of the throat of the Board of Education which all teachers and pupils can use. The teacher's certificate in this case shows that Naval Balm has been used, and you that on and after the last November under McMillan's Northwest Territorial Act, 1879, are fit for First Class Stenographer's \"Julia Caesar,\" or Second Class Copyist's \"Dick.\"\n\nWEAK NERVES.\n\nPaine's Celery Compound is a Nerve Tonic. It strengthens the brain and nerves, cures those wonderful stimulants, and speeds up digestion.\n\nRHEUMATISM.\n\nPaine's Celery Compound purifies the blood, removes the cause of rheumatic inflammation, and restores the blood vessels to their normal condition. The remedy for Rheumatism.\n\nKIDNEY COMPLAINTS.\n\nPaine's Celery Compound cures a Kidney Complaint. It strengthens the liver and kidneys to perfect health. It is a powerful diuretic and tonic. No more stones, makes it the best remedy for Kidney Complaints.\n\nDYSPÉPSIA.\n\nPaine's Celery Compound strengthens the digestive organs, and restores the digestive organs. This is why it cures even the most obstinate cases of Dyspepsia.\n\nCONSTIPATION.\n\nPaine's Celery Compound is a Colon Tonic. It cleanses the large and small intestine in the bowels. Regularly sure and effective. Recommended by professional and business men throughout Canada.\n\nPrice $1.00. Sold by Drugists.\n\nWELLS, RICHARDSON & Co., Prop's.\n\nMontreal, P.C.\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's Store.\n\nNEILSON & McBEATH\n\nREMVED REMOVED\n\nR. C. WIGMORE & CO.\n\nHave removed to their new premises,\n\nSECOND DOOR EAST OF OLD STAND\n\nWhere they will be pleased to meet their numerous new and old customers.\n\nClearing Sale still going on.\n\nR. C. WIGMORE & CO.\n\n1879.\n\nBuffalo Hall!\n\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\n\nNow in stock will be sold\n\nFOR TWO WEEKS ONLY\n\nAT COST FOR CASH.\n\nThe Public are invited to examine the bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & GWINNE\n\nT. N. CAMPBELL\n\nSchool Books and Stationery.\n\nPublic and High School Text Books.\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK.\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\n\nROBERTSON & ROBERTSON\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Uitings,\n\nTrowsering and Overcoating\n\nWORSTEDS\n\nIn English and American Lines,\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nTERRITORIAL NEWS\n\nCALGARY.\n\nFrom the Tribune, Oct. 10.\n\nThis morning an Indian man was riding a very nice pony on section 16 he was attacked by a party of natives who took his horse. The Indians were heard shooting and stopping in a gopher hole he keeled over and broke his neck. The Indian got up rubbing his head violently but was soon killed, but demonstrating the Indians fell off the trip in was something terrible.\n\nInformation comes from Banff that the approach made to the Louis (Louisiana) by Mr. H. B. Smith, who has been given the right to make the first trip in the sale of wine and beer at the Station as the C. R. railway, has been refused by Mr. Smith. He had applied for Royal approval of his application. Permission of these wine permits is evidently the order of the day, and Mr. Smith will probably close his store to make a trip and seek shelter elsewhere.\n\nWhile New Westminster has been doing its best to grow grapes, the Fort Macleod district has gone so far as to speak of a second crop of ripe strawberries. On Saturday night some fellows gathered together at the edge of the river and came across a quantity of ripe fruit. There were also some blueberries growing on the banks of the river which will be marketable for the 7th of October, but with the thermometer dancing away up in the seventies, it seems unlikely that these berries should yield a second crop.\n\nQU'APPHELLE\n\nFrom the Fiddle, Oct. 11.\n\nThe close season for whitefish is now at hand, and the season, however, Wiggins' claim is supposed to have started at night when most of the people were asleep which accounts for the few known cases.\n\nThe festivities of today are to be concluded with a ball and supper. The new town will take place in the hall and this will be the last day of the season.\n\nWe understand the Indian Department have established a new Agency at Polly, and that Mr. W. E. Jones, of the Tsimshian tribe, has been appointed agent there.\n\nThe fall show is a pleasant day, and from the reports received from the territories handled, we have every reason to believe that the show will be a grand success—perhaps the better is proportions.\n\nThe pioneer crop of Mr. A. J. Reid, our enterprising immigrant agent, yields at the rate of $500 barrels to the acre.\n\nPrevious Tuesday's disastrous fire in the town of Fort Macleod was caused by a spark from a passing train.\n\nFortunately the fire did not extend beyond the open plains with flinty boggy soil.\n\nThe destructive prairie fire on the Pienaar Plains to which we referred last week, has now been extinguished by burning up a field of flinty grass and the fire getting beyond his control by not having been prevented by an effective fire guard. We understand he has offered to pay part of the damage done to his neighbour's property.\n\nFORT MACLEOD\n\nFrom the Globe, Oct. 11.\n\nA number of our law-breakers are camping out in Montana for their annual outing, fishing, shooting and otherwise amusing themselves.\n\nThe meeting of the ex-policemen's association held for Saturday last was postponed until later date as no members of the former force attended.\n\nThe many friends of Capt. Sanders, N.W.P., will join in congratulating him on his marriage to Miss Anna, daughter of Mr. J. J. Jukes, of Calgary, and son of Mr. N. W. M. Polson at Regina.\n\nLocal Co., Hotelier, and Messrs. Condon & Co., of Edmonton, have been engaged for Montrose's important hotel.\n\nAt the request of the Department of Justice, the Commissioner of Police has issued a warrant for the arrest of an officer, who is to be stationed along the northern boundary of Manitoba to prevent the crossing of timber and evasion of customs duties therein by American citizens. The department has received information that a large quantity of timber has been landed at Fort Macleod, particularly the Cypress Hill district, by Americans, and smuggled across the line.\n\nEDMONTON.\n\nFrom the Bulletin, Oct. 10.\n\nCoal oil firms in town now.\n\nHarvesting is over. It is very late but very good.\n\nMr. J. L. Kelly returned from Beaver Lake on Saturday well loaded with geese and waterfowl.\n\nPlum trees in bloom in the gardens, and some tomatoes vines are still untouched by frost.\n\nOtto J. Kutz, government astronomer, who was taking observations here this week, revealed the location of the fifth principal planet has reached Winnipeg.\n\nIt is reported that a man with two white men and a negro from across the border, the white men named Mr. Whitehead, Mr. Whitehead, and the negro, Hoock, George says he was unarmed until he reached Battleford where he bought a gun and a pair of moccasins.\n\nBATTLEFORD\n\nFrom the Herald, Oct. 8.\n\nOn Saturday evening a fellow who had been driving a driver on L. Copps' freighting outfit was brought into town with a broken leg. He was trying to get away from the police, but was caught the Wednesday previous, by climbing up between the wheels, when he missed his footing and fell under the wheel, striking the side of his body against the knees and hip. The sufferer displayed a good deal of nerve in the face of the accident. He held on to the reins all the time, and when the wheel had passed over his leg he backed the wagon over, and tried to escape. He has been taken to hospital, and his injuries are being attended to in town.\n\nDuring the investigation into the last affair, Mr. Copps visited the parents of children attending the Protestant public school against T. Beath, the teacher, for cruelty in punishing children, than whom he had never seen the like of the discipline he lately received from some country college or other, in so far as the severity of the punishment is concerned. Mr. Copps has been called upon by the parents of the children to explain what they call it. The trustees have often, and almost since the beginning of the school year, threatened to strike Mr. Beath upon the excessive punishment he gave to children of tender age, and forbidden corporal punishment in any case. They have now overcome the schoolmaster seems to have prevailed upon the opinion that true treatment of children requires that the law would not permit to be used on animals was within the limits of the law. Mr. Copps agrees with him, and have now forbidden him the privilege of inflicting corporal punishment in any case during the short time he has been in charge.\n\nJ. M. CAMPBELL'S\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alt.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\nTOWN COUNCIL\n\nOn Monday evening last Council John-\nson, Mr. Paul, Stovin, Knowles, Davis\nand Agnew assembled at the City Board\nby special notice.\n\nMr. Ward, acting Mayor not being pres-\nent, Mr. Agnew was called to occupy that position.\n\nA communication was received from Mr. Geo. Foulks, of Winnipeg, re open-\ning of streets across R. L. No. 72; and other matters have been discussed,\nto report if days or days are com-\nmunicated.\n\nCOMMITTEES.\n\nThe following accounts were received and referred to the Finance Committee:\nPrinting Office, $85.25; Wm. Far-\nney, $16; Wm. Payne, $.50.\n\nPeter Robertson, the town constable, presented his first official budget, which contained a remarkably accurate list of his expenses from the N. W. M. P. head\nof liquor funds.\n\nThe Fire, Water and Light Committee\npresented the following interesting documents:\n\nYour committee beg to report that T.\nJ. Agnew's tender for rope and J. L.\nJohnson's tender for chain was ac-\ncepted.\n\nYour committee would recommend the taking over of the tank as constructed by James Hamilton for the purpose of holding water for the fire department. We do not consider the arrangement for the fire department as ideal, but that your committee would be willing to consider such a proposal.\n\nYour committee would also recommend that your committee give the contract to fill the tank for $35.00 per yard, six feet and one half feet per barrel.\n\nCOMMITTEE OF THE WHOLE.\n\nThe meeting then went into Committee of the Whole, and discussed the reports of the Fire, Water and Light Committees.\n\nThis was the most interesting part of the evening's entertainments, and after a very varied discussion, a vote was taken on the matter, during which there was considerable of a \"debate\" indulged in, this committee adjourned until next Monday.\n\nTone the report of the Fire, Water and Light Committee be referred back for correction and that no more tenders be re-\nceived until the committee has had time to consider the same.\n\nThis recommendation was followed by the following motion:\n\nMoved by Coun. McPaul and seconded by Coun. Stewart that the appointment of Mr. McKeehan, made by the chair-\nman as Fire, Water and Light Com-\nmittee, be ratified and that his verbal re-\nport as to whether the new task will hold water under normal conditions be\nmade public. If not satisfactory, Coun. Hamilton be called on to decide.\n\nThe meeting then went into Commit-\ntee of the Whole and Mr. McKeehan said the tank would hold water or not, and was answered in the negative.\n\nBy this time it was growing late, the heat becoming oppressive, we had half an hour longer and put through the below re-\ngarding the cleaning of the sidewalks.\n\nThe committee then adjourned to meet again on Monday evening next.\n\nDUCK LAKE.\n\nMr. A. J. McNeil, clerk in the Indian Department here, left by stage for the east. He will be absent about two months.\n\nHarry Kelly sold most of his fine band of cattle to farmers from Battletown at good figures.\n\nThe weather and machinery for our past\nseason will be shipped from the east.\n\nTravis said he would be returning Indians for this district, on Saturday next.\n\nMr. Butchoff left on Wednesday last\nfor Port A, Come where he will re-\nmain until next fall.\n\nOn Tuesday last Miss Murray was mar-\nried to Mr. Pope, an ex-politician.\n\nSettlers say wolves were never so plen-\ntitous as present. Riots of necessity to\noccur. The Indians say that several farmers have killed their calves.\n\nSince the adoption of twelve inches fell\nlast week, and travelling since is\nmore than usual.\n\nMany of our farmers have lost their\nmeats out of the ground yet.\n\nMr. Bourgeois, D. L. S., is still here.\nHe is looking for the settlers who have", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888102601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5812, "total-output-tokens": 4006, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6121, 2], [6121, 12989, 3], [12989, 16674, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]