[{"id": "ce4c25e70eb9535950226f4b88464d2ecc093e27", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, OCTOBER 30, 1885.\n\nBANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.,\nTransact General Banking Business.\nInterest allowed on Deposits.\nNotes accepted at all points in the District.\nCollections undertaken and promptly answered.\nBANKERS—Merchant Bank of Canada\n\nWAR DECLARATION\nW. C. RAMSAY\n\nThere seems now to be no doubt that Red will suffer the extreme penalty of war. The Government has informed the Committee of the Privy Council of England has decided against him. His condemnation is certain, and there is no assurance that no further reprisal could be made.\n\nExcitement over the fate of Red continues to increase. The French government has issued an ultimatum demanding a consultation of statesmen, but Sir John has refused to meet them. The question on the execution taking place on the 11th.\n\nRed's counsel has received information that the French government, as well as additional officials are preparing for a formal commission to pronounce upon the matter.\n\nThe Queen has replied to the message of the French government, and the formulation of the death sentence passed by the French government, that Sir John is unable to meet them. The Queen has delegated the pardon to the French government, and Red's counsel is preparing to meet them.\n\nTENDERS\nMcGuire, Wells Block\n\nWill be received up to\nTuesday, November 10, 1885.\nFor the immediate occupation and completion of\nInstructor's House,\nStables and Storehouse,\nOn Beaver's Reserve, Duck Lake.\n\nJ. M. KAR, Indian Agent.\n\nNOTICE\n\nThe partnership heretofore existing, and known under the name of William Knox & Barker, has been dissolved by mutual consent, effective October 26th, 1885.\n\nAll debts owing to said partnership, and all claims against said partnership, are hereby discharged.\n\nThis notice is given to the former creditors of the firm, and to be paid to settle accounts, William Knox, who will continue the business under his own name.\n\nWILLIAM KNOX,\nWILLIAM J. BARKER,\nPrince Albert, Sask., N.W.T.\nOctober 23, 1885.\n\nCARD OF THANKS\n\nI feel much pleasure in taking this opportunity to express my thanks to those friends who rendered me able assistance in endeavoring to save my stock during the late fire, as also to express my appreciation of their kind sympathies extended since the occurrence.\n\nI shall be glad to welcome all old customers and as many new ones as possible at the building lately occupied as a post office, next door east of T. J. Agnew's, on my reopening there as soon as the alterations now in progress are completed.\n\nT. E. JACKSON.\n\nNOTICE\n\nOn account of my recent loss by fire, I must request all those indebted to me to call and settle their accounts immediately.\n\nI will be found for the present in A. L. Sifton's law offices, next door west of Sturges' store.\n\nT. E. JACKSON.\n\nROBERT THOMSON,\nSign & Ornamental Painter\nGilding and Powdering\nin short orders.\nDecorative Painting & Specialty\nCommissioning N. W. M. Fisher, Prince Albert.\n\nTENDERS\nFOR CHAIRMAN OF Saskatchewan Curling and Skating Rink\n\nWill be received up till\nSaturday, November 7, 1885.\nTenders to be handed in to\nANDREW DOGFELLOW,\nChairman of Committee.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters—\n\nMr. T. O. Davis returned to town by the last mail.\nMr. R. Armstrong, owner of Riot's opera house, is recovering in hospital from a successful display of Xmas Cards on Cass's location. Call and see them.\nMr. T. Swanton has gone to join the police force in the metropolis of Manitoba for a while in the metropolis of Manitoba.\nSergeant Keenan and party made Indian camp at Sand Branch, and returned on Friday.\n\nA party of twenty men in charge of Sergeant Parker are on the way from Battleford.\nWinter, apparently, has again set in. Mr. and Mrs. Smith have left the \"Beaver House\" for the fall of the \"Beaver House.\"\nMr. and Mrs. J. Courtney have gone to spend the winter in Ireland, and expect to return early next spring.\nSergeant Cathcart has arrived from Regina, and is posted to this Division.\nIndian Hostility expected.\nSergeant Douglas and party of twenty men have been with Indian Agent Rae to South Pass and distant an escort on behalf of the Government.\nThe post office has been removed east of Owen's residence, to a building belonging to Sergt. Keenan, and which has been handsomely fitted up for the purpose.\nChief Factor Belanger was summoned by Mr. Smith, who is recovering, who returned recently and entertained the members of the Band in the most hospitable manner.\n\nThe nominations for Mayor and Councilors will take place at Mr. Brewer's office in connection with the election, from 10 o'clock until 12 o'clock. If the weather permits, the election will be held at the same place, from 9 a.m. to 4 p.m., on Monday, Nov. 10th.\n\nThe candidates elected will meet at the same place on Monday, Nov. 10th, at 2 o'clock, when they will be sworn in by the returning officer and receive their certificates.\n\nThe annual meeting of the Prince Albert Curling Club will be held on Thursday evening, Nov. 1st, at 8 o'clock. There will be a good attendance of members present. The Vice-President, T. N. Campbell, will preside. The Hon. J. F. Brown, President, will make an address on the subject of Management. A Goodfellow Club Spont, R. Grayson, H. F. Montgomery and J. D. Hannafin, will make speeches. Mr. Donaldson, Esq., Hon. L. Clarke, Patrons and Patrons, and Messrs. Smith and Speer. A motion of condolence was passed by the club to Miss Winifred Elliott and the friends of Messrs. Napier and Elliott, who were killed at Duck Lake fight.\n\nLAND GRANTS\n\nTo the Editor of the Times:\n\nSir, Will you kindly inform me why the government has not allowed land grants to the Indians? The Police who are guarding the military during the rebellion, as it has to the militia? You will confer a favor by answering my query as I am much interested in this matter.\n\nINQUIRER.\n\nIN-BACKFUL CONDUITS.\n\nSir, Would you kindly inform me in your paper a warrant was sent to give to some persons living far from Prince Albert that they must appear and have any complaints they may have against the conduct of the school children, on Sunday, such as bell ringing, beating the Sunday school children, etc. If any person wishes to make complaint again, their names shall be published in the local paper, and in any other way to make examples of us we shall deem necessary.\n\nCHAS ADAMS,\nW. H. McLean,\nWarren.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nTHIS PAPER may be sent by\n\nThis paper may be sent by\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m. - Mr. Murray.\nThe Mission Chapel.\n11 a.m. - Rev. A. A. H. Wright.\n7 p.m. - Sunday School.\n7 p.m. - Rev. A. A. H. Wright.\n\nSt. Paul's.\n12.30 m. - Rev. R. Matheson.\n2 p.m. - Rev. R. Matheson.\n\nSt. Andrew's.\n12.30 m. - Rev. Canon Fleet, B.D.\nSt. John's.\n5 p.m. - Ven. Archdeacon McKay, B.D.\nSt. Anne's, R. Catholic.\n6 p.m. - Ven. Archdeacon McKay, B.D.\nSt. Paul's (Presbyterian).\n11.30 a.m. - Rev. Mr. McElwain.\n\nFRIDAY, OCT. 30, 1885.\n\nINCORPORATION.\n\nWe have at last become a corporate body, under the name of The Town of Prince Albert. The first election for Mayor and Councillors takes place on Thursday, the 12th of November. We believe there are several competent men in the field who will offer themselves for election. The citizens of Prince Albert, in this the first municipal election to be held in this District, should exercise their greatest care in their choice of representatives, electing them in the Council, and only elect those who by a long residence in the District have made themselves thoroughly acquainted with the wants and capabilities of the town. We have been told and greatly felt the want of several improvements that could only be made by united action on the part of the settlement, and it was for this purpose we became incorporated. We believe Prince Albert to be capable of great things, but the time has not yet come when we should embark in any great enterprise or allow any large expenditure of public money. In some future time it may be necessary for us to do in order to keep Prince Albert the leading town in the North West Territories. At present the wardrobes of the Council should be \"full,\" but how much the economy which is afraid to spend a dollar for fear it may be wasted, but the economy of the good business man who looks ahead and spends a little more than what he cannot lose to-day. One of the first things needed is a fire engine. We all felt the want of one last Saturday night when Jackson's drug store was on fire, and no effort could be made to save the building. The fire department now for a fire engine may save us thousands of dollars in the future, and the longer we remain without one the worse it will be for us. Let us hasten forth for the protection of timber were very small, only such men who have large ability for us must perform work to interests at stake in the town and the day when timber will be very scarce interests are the permanent same and we shall be obliged to purchase of Prince Albert, and not fall back on the old expedient of buying land in pioneer sections. It is better in these matters at any rate. Mr. White's talk of guarantee that the railway construction will be carried on in Prince Albert and the rest of the surrounding District. There are one or two points in Mr. White's speech that are well worthy of our attention, and we will briefly enumerate them. In the first place let us procure one or two by saying that the hon. gentleman did not confine himself to the broken track of most public men, who of course at the moment experience the advantages of a position as an outsider, but who delightfully with all his heart has done his best to do them honor, and having made the usual stereotyped reply, at once forget all about it and dismiss the affair from their minds. Mr. White not only expressed to us his satisfaction at the character of the reception accorded to him, but when he left for other parts of the country, referred more than once to what we had done toward the advancement of the town. Mr. White's visit is pleasant one to all of us for us to look back upon. And it is by these little remarks let fall unintentionally that we get all the impressions of the occasion. We finish this subject by saying that whatever was done was meant for the best, and after Mr. White's expressions of gratitude, the trouble expended is now looked upon as a great benefit. The effect of Parliamentary representation is too extensive a one for us to get into at the present time, and the several ideas on it have been already ventilated to such an extent as to make it unnecessary to enter into the fact of the census being taken may be considered as a promise that the matter will not rest here, and we are glad sure that from what we have heard Mr. White will be able to get out of the hands of the bosses. We are glad to see that the hon. gentleman fully recognises the great importance of Railways to this community, for that matter is of vital importance to the North West. In reference to the opening out of the Hudson's Bay route, we must consider it simply a question of time and open communication with shipping points in the Hudson's Bay. We believe that no other country in the world affords such grand facilities for the export of produce, as any railway running in the direction of the Hudson's Bay will be to a great extent assisted and rendered more valuable. There is no doubt that the opening out of the Hudson's Bay route is only a question of time and when this occurs the dependents of the town will be greatly benefited. The unusually heavy growth of land out to the Hudson's Bay Railway Company, and the great endeavours made to ascertain the nature of this mountain outlet, show that the Government is interested at home and fully realize that the railway deeply affects the interests of the country. We must admit that Mr. White's remarks in reference to the\n\nMR. WHITE'S REPLY.\n\nIn our last issue we gave at length the Hon. Thos. White's reply to the address presented to him by the citizens of Prince Albert and the people of the surrounding District. There are one or two points in Mr. White's speech that are well worthy of our attention, and we will briefly enumerate them. In the first place let us procure one or two by saying that the hon. gentleman did not confine himself to the broken track of most public men, who of course at the moment experience the advantages of a position as an outsider, but who delightfully with all his heart has done his best to do them honor, and having made the usual stereotyped reply, at once forget all about it and dismiss the affair from their minds. Mr. White not only expressed to us his satisfaction at the character of the reception accorded to him, but when he left for other parts of the country, referred more than once to what we had done toward the advancement of the town. Mr. White's visit is pleasant one to all of us for us to look back upon. And it is by these little remarks let fall unintentionally that we get all the impressions of the occasion. We finish this subject by saying that whatever was done was meant for the best, and after Mr. White's expressions of gratitude, the trouble expended is now looked upon as a great benefit. The effect of Parliamentary representation is too extensive a one for us to get into at the present time, and the several ideas on it have been already ventilated to such an extent as to make it unnecessary to enter into the fact of the census being taken may be considered as a promise that the matter will not rest here, and we are glad sure that from what we have heard Mr. White will be able to get out of the hands of the bosses. We are glad to see that the hon. gentleman fully recognises the great importance of Railways to this community, for that matter is of vital importance to the North West. In reference to the opening out of the Hudson's Bay route, we must consider it simply a question of time and open communication with shipping points in the Hudson's Bay. We believe that no other country in the world affords such grand facilities for the export of produce, as any railway running in the direction of the Hudson's Bay will be to a great extent assisted and rendered more valuable. There is no doubt that the opening out of the Hudson's Bay route is only a question of time and when this occurs the dependents of the town will be greatly benefited. The unusually heavy growth of land out to the Hudson's Bay Railway Company, and the great endeavours made to ascertain the nature of this mountain outlet, show that the Government is interested at home and fully realize that the railway deeply affects the interests of the country. We must admit that Mr. White's remarks in reference to the\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra.\n\nLath, 75 cts. per bundle.\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWART BROS.,\n\nTRADERS,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Pears.\n\nClearing out the balance\n\nCrockery AND Hardware,\n\nAT COST\n\nNOTICE.\n\nAll parties indebted to the old firm must settle before the 1st October next, owing to the change in the business.\n\nSTEWART BROS.\n\nPrince Albert, Sept. 16, 1885.\nN.W.M. POLICE\nTENDERS FOR BEEF\nTenders will be received by the undersigned up to 12 o'clock noon,\nNOVEMBER 1st, 1885.\nFor supply Beef to Prince Albert, N.W.M.\nPrince Albert, July 14th, 1886.\n\nThe contract required per day will be about 150 pounds.\nBeef to be delivered at the Barracks excepting in exceptional proportions of beef and hind quarters.\nThe Beef is to be of good quality, and subject to inspection by the officer commanding, who will purchase on the spot at the market price.\nSecurity of the fulfillment of the contract will be required.\nTenderers to state price per pound.\nDelivery to commence from the date of the acceptance of the tender.\n\nJAMES SINCLAIR\nMerchant Tailor,\nNo. 31 Main Street\n\nWe wish to inform our customer and the public in general, that we have just received our stock of Fall and Winter wear for Gents, Ladies & Children. The largest and most complete assortment to choose from ever brought into Prince Albert.\nShannon & McLeod.\n\nTHE PRINCE ALBERT TIMES\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\nOf all descriptions done neatly, quickly and cheaply\n\nJ.D. MAVEETY, PUBLISHER AND PROPRIETOR\n3RD ST., PRINCE ALBERT, SASK\nBANQUET\n\nTo the Hon. Thomas White,\nMinister of Interior.\n\nAddressing Addressed by Mr. White,\nand the various Representatives\nof the Provincial, Municipal, Nat-\nuralization, Educational and other\nInstitutes.\n\nThe meeting, in the name of the Hon. T.\nWhite took place Wednesday evening\nat the residence of the R. E. Hughes, Esq.,\nMr. White's friend at Athabasca, attended by\nrepresentatives. About one hundred sat\ndown to the table. The chair was oc-\ncupied by Mr. Hughes, Esq., who spoke\nfor the Hon. Mr. White. Then came\nthe reply by Messrs. J. Macdonald, T.\nMcKay and Col. Spence. To the right\nof the chairman there was seated Mr.\nWhite with Mr. Archibald on McKay's\nleft. Capt. Perry of the N.W.M.P.\nfollowed by Rev. Mr. McMillan and\nMr. Holmes.\n\nAfter the inner man had been fully\nsatisfied and the tables cleared off, the\nconversation turned upon the subject\nof \"Quebec,\" which was duly honored. The\nchairman gave the \"Prince of Wales\" and the Royalty Family, which was\nreceived with cheer. The next topic\nwas the \"Government General of Canada,\"\nand carried away the great majority way\nfor \"Particulars of Canada.\"\n\nThe next proposal, coupled with the name\nof Mr. John McKeefe, M.P.P., Manitoba,\nwho spoke for the same, stated that he\nhad never done more than he had, but\ncould not do more than he had done. He\nbelieved that the proposal of the Lord\nMayor would be beneficial to both the\ngovernment and the people of Prince\nAlbert. Mr. McKeefe thought that Mr.\nWhite could make a success of the very diffi-\ncult position he would now have to fill.\n\nThe proposal was too long for a single\ncolumn, so the following graphic will be\nsubject of so much importance as the\n\"Particulars of Canada.\"\n\nThe chairman gave the well chosen\nremarks, then proposed the toast of the\nevening, \"Our Honor.\"\n\nBefore Mr. White responded, Mr. E.\nHughes introduced the company with a\nsong, which was rendered in his usual\npleasing style.\n\nMr. White, on rising, was received\nwith prolonged cheering. He said he\nwould be more or less than human if he\ndid not feel highly honoured; greeted\nlong and hearty, and expressed upon him a deep sense at the\nimportance of his proposition. He\nhad been in the public affairs for about\nwars and thirty-five years, and knew how\ndifficult it was for any person, coming\nup, to overcome the prejudices which\nmuch less his opponents. He had re-\nceived kindly greetings from those he\nwas opposed to, and had the honour of\nbeing friends. He said he was not a milk\nand water politician, but was decided in\nhis opinions, and was backed by his friends\nto hit hard when necessary. He believed\nin party government, although sometimes there was no party agree-\nment; that there was more than neces-\nsary for a whole country. He believed\nin the spirit of good government existing\nin Canada, that the best, hardworking\ngovernment responsive to the people and a\nvigilant opposition to watch them at\ntimes, but that they were all working for\nthe liberation of the people. Since being\nsworn into office he had received the\nmost cordial greetings, and would be\npolitically successful, and was glad to\nsee around these tables some who were\nnot necessarily his party friends. He\nknew how difficult it was for any man\nto live up to all their expectations, but he hoped by\naccurate information, to maintain his\ndignity, so as to earn the warmest\naccolades. He believed that the\nDominion of Canada had a great future\nbefore it, and that the amalgamation of\nthe different provinces there would al-\nways be great difficulties for any Cana-\ndian Government. He said he would\nnot forget that the interests of the North\nWest were the interest of the Dominion,\nbut he did say that the future prosperity\nof Canada depended upon the development\nof these regions. He then pro-\nposed a hearty toast for the\nNorth West, characterising them as an\nenergetic, ambitious and progressive\npeople who did not have to wait for\nus to do with the building up of this great\ncountry, but had laid in his day of\nits soil, and was ready to help build\nupon these promises. He again\nthanked them for the kindness of their\ngreeting, and received his most aman-\nuently applauding.\n\nWhen questions had again been re-\nceived, Mr. Adam Maclean, for the\nchairman, rose and proposed the toast,\n\"The land we live in,\" coupled with the\nname of Mr. Thomas McKay, Esq., Mr.\nKay. It was found that he had left to\nmake preparations for his dinner in the\ncity of Ottawa, but Mr. McKay, who\nhadly called for, responded in his usual\nmasterly style. On rising, he paid a\ntribute to the kindliness and hospitality\nallotted to the great country in which\nwe lived, and said that it only needed to\nbe known what was done to get it.\nHe then referred at length to the great\nadvantages that Canada offered, partic-\nularly the new and exciting way of\nwayfaring. He also suggested the\nadvantages of the railway for the\ntraffic between the South Saskatchewan\nand used jointly by all the railways\nthat connected to Prince Albert. He\nthen complimented the representatives\nfrom the different parts of Canada who had so\npleasantly joined hands to help suppress\ntheir enemies, particularly the French,\nwhile giving high tribute to the Hon. Minister of the\nInterior upon his carryout to carry out\nhow important his future prosperity was\nintended to be with the medical profession.\n\nMr. Miller said he had lived in the\ncountry for a number of years, and could\nspeak from experience. He thought\nthat he had ten good crops out of eleven.\nHe believed that we had as good a climate\nas there was anywhere in the world, and\nwas confident that this country would not\nonly be a great stock raising country, but\nalso a great producer of grain in the\ncountry. He briefly referred to the bet-\nting on contracts, and believed in the\ngreat benefits that would come from\nand get the benefits, which under the\nlarge contract system they did not get.\n\nHe referred to the advantages of the\nHudson Bay railway, and made a few\nremarks on the timber dues, from which\nhe said he had one month's salary. He\nalso referred to the present government, as\nhe thought it was highly pleasant with the way\nthe matters were being handled.\n\nCapt. Howze said he believed agri-\nculture would prosper in this district, and\nthought that the climate was very fit\nright to the bitter end. He also referred\nto every confidence in the country.\n\nCapt. Craig made a neat and interest-\ning speech, referring to the advantages\nof the country, and had every\nconfidence in its great future. He\nbelieved the cost of producing grain\nwould prove a profit to everyone.\n\nThe next toast proposed was: \"The\nArmy, Navy and Volunteers of Canada,\"\ncoupled with the names of Capt. Perry,\nYoung and Hoey.\n\nEach of these gentlemen replied in a\nneat and appropriate speech.\n\nCapt. Perry then rose and made a\nfew remarks thanking the chairman and\nthe people of Prince Albert for always\nstanding by the fellow citizen.\n\nThe next proposal was: \"The\nProvince of Ontario and Canada\" was then\nproposed and responded to by R. E.\nHughes, Esq., the member elected by\nthe day. He addressed a short and polite\nspeech.\n\nMr. W. J. Barker then sang \"The\nUnion Jack of Old England,\" which was\nfollowed by a hearty applause.\n\nMr. John Stewart, in a few very ap-\npropriate remarks, then proposed\n\"Bachelors and Spinsters,\" coupled\nwith the names of Messrs. Maclean,\nBelanger and Betts. Each of these\ngentlemen replied with a speech to reply.\n\nMr. McCrory, who has recently moved\ntown, having considerable business\nwith the farmers and the business men\nof the town, complimented them upon\ntheir good financial standing and the\nprominence with which they had always\nmet their obligations.\n\nMr. Edward Johnson then sang a song,\nwhich was given in excellent style and\nwas loudly applauded.\n\nMr. Stewart then proposed the\n\"Clergy,\" coupled with the names of\nthe Rev. Mr. McMillan and Archdeacon\nMcKay.\n\nArchdeacon McKay also replied in\na very neat and appropriate speech.\n\nThe Legal Profession, was next\nproposed, coupled with the names\nof Messrs. Maclean, Gam, Newlands and\nSifton. These gentlemen each very ably\nresponded, each doing credit to his calling,\nwhich was reflected upon the ability of two representa-\ntives of Blackstone.\n\nThe next toast proposed was the\n\"Medical Profession,\" coupled with the\nname of Dr. Porter.\n\nDr. Porter, in his reply, made a very\nneat speech dwelling on the benefits\nwhich the country would certainly show\nitself in its future prosperity was\nintended to be with the medical profession.\n\nCol. Spence then proposed \"The\nNational Intercourse,\" coupled with the\nnames of Capt. Flett, Messrs. Stewart and\nMessrs. Maclean.\n\nMr. Stewart, in reply, referred to cir-\nculars that had been received by secreta-\nries of some of the school districts\nin the province. He stated that\nthere was nothing to fear, that owing to their not being well\nenough educated, half of the country, if not\nmore, would be without the means of\nbettering themselves. He thought that\nit was a great injustice, and hoped that\nit might be rectified by such\nmeasures as were mentioned. He referred\nto the opening of the old school, and\nshowed the great benefits that would be derived\ntherefrom.\n\nMr. Stewart referred to the phantom\ngift box to be presented on such an im-\nportant occasion, and said he was glad\nto see the members of the committee\nwho were one of the representatives of\nthe Dominion of Canada. He believed\nthis country from its great natural re-\nsources will ever be considered the\ndominant power of Canada. It was\nglad as a representative of the entire\nprovince, interested in identity interes-\nting them in the advancement of the\nnation and the advancement of our\ncountry, so as to make homes for ourselves.\nHe thought that the representatives\nof this country could or should be per-\nsuaded to give their attention to such\nan energetic and substantial as those who\nwere interested in the advancement of\nthis country from its greatest natural\nresources, and that the members of the\nprovince should be given the support\nof the teachers to fail by the payment\nof the fees and taxes of the\n\nThe next toast proposed was: \"The\nLawyers,\" coupled with the name of F. N.\nBaker. Mr. Baker replied in his usual\npleasing style.\n\nThe Mechanical Industry, was next\nproposed, coupled with the names\nof W. A. Carter and W. J. Barker.\n\nMr. Carter replied in a few very neat\nwords, and Mr. Baker sang \"Let me\nhave a glass of wine.\"\n\nCol. Spence then proposed the \"Press\nof Canada,\" to which Mr. J. D. Mavety\nof the P.A. Times replied.\n\nThe next toast proposed was: \"The\nDry Goods, Hats, Ready Made Clothing,\nBoots and Shoes, etc.\n\nMorton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar,\n\nOgilvie's Flour,\nWhich we will sell cheap for cash.\n\nO. E. HUGHES & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS.\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal, United States promptly attended.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885103001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6798, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6445, 1], [6445, 15803, 2], [15803, 17100, 3], [17100, 28075, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]