[{"id": "7e8b1d2d7a8ca4fcadc370f3a48a44274dde7585", "text": "The Prince Albert Times\n\nAnd Saskatchewan Review.\n\nPublished by\n\nJ. D. Mavec\n\nPrince Albert, N.B., Canada.\n\nThis Paper is printed in advance.\n\nSingle copies, 10 cents, each.\n\nWe advertise (if desired) for any person.\n\nAdvertisements inserted under instructions will be inserted until further notice.\n\nAll letters to be addressed to the Proprietor at\n\nJ. D. Mavec's Office.\n\nWe may be found at\n\nDawson & Co.'s Newspaper Advertising Agency, 28th Street.\n\nNEW YORK.\n\nSunday Church Services\n\nSt. Mary's Church and the Mission Chapel.\n\n11 a.m.—Services in both Churches and at the Mission Chapel. At St. Andrew's Church Mr. Wright is in charge; at St. John's Church Mr. Cunningham, Thesaurus Rector of the Diocese, is in charge.\n\nHis Lordship the Bishop will preach, as usual, at St. Mary's Church at eleven o'clock in the morning; and at the Chapel in the evening.\n\nAt 2 p.m.—Mrs. Casson Pickett, R.D.J.S., St. Paul's, Geo. G. F. Mackay, R.D.J.S., St. Andrew's,\nMr. Mactavish, St. John's, Mr. Macleay, Mrs. James,\n\n9 p.m.—Rev. Archdeacon McKay, R.D., St. Anne's Church, Catholic.\nRev. Mr. McCulloch, St. Paul's Presbyterian).\nMrs. Crozier, Mrs. Goldring, Miss McCulloch,\n\nMid-week Church Services.\n\nRed Deer Hill and Island Lake every Friday at six o'clock.\n\nMissouri, 7 p.m., Prayer meeting, Rev. Mr. McLean, B.C., Y.W.C.A.\nChurch, 7 p.m., Prayer meeting, Rev. Mr. McCulloch, Red Deer Hill and Island Lake, 7 p.m., Prayer meeting, Rev. Mr. McCulloch.\n\nFRIDAY, OCT. 15, 1886.\n\nA DISCOVERY.\n\nAt the last meeting of the Town Council the following motion was moved and carried:\n\n\"Moved and seconded by Mr. Brown and carried by the affirmative vote of the Council, that we tender to the Lieutenant Governor and Government our heartfelt sympathy and regret in the matter of the question concerning the incorporation of the town of North West. We believe this action to leave the town of North West in the hands of the Crown Council, and therefore we do hereby rescind all acts of incorporation, and that the town acceptance on the table be sent with the petition.\"\n\nTo the people of Prince Albert, who have never shown all along quite so much imagination that the town was founded on a legal basis, this motion came like a thunderbolt, and there were those among them who felt that everything was now rigged against them. It hardly seems possible that they should have been able to find out exactly what was going on at the town hall!\n\nOn referring, however, to the proceedings connected with incorporation, we find that everything was done in a legal way. The bill came before parliament in August, ordering the incorporation of the town, and the electors went to the polls in favour of carrying it through. There is nothing very much to be said against the bill.\n\nIn the North West Council this matter has been agitating ever since the incorporation of the town was ordered. There has been a great deal of discussion about it; but the Council and the electors have been unable to agree on anything. The Council and the electors have been unable to agree on anything, and there is no doubt that the Council will be forced very soon to draw a line somewhere.\n\nREPORTERS.\n\nThe Regina Leader is agitating for North Western merchants in the most unfair manner. They say the Hon. Mr. Story is an auctioneer for representation in the House of Commons as any man, but he does not consider himself as such, and he does not think it would be advisable to subject the North West to the influence of the merchant class. The members of the Legislature would make a double expense by raising two electors within such a short space of time; nor are they able to undertake and have the electors to keep the town in the hands of any other than themselves.\n\nEDITORIAL NOTES.\n\nMr. Coventry says it is more important for the electors of the North Western District to be represented in the House of Commons than any other line of business. He says that the electors have a right to protect their property and their families from all kinds of legislation which they cannot understand or control. He says that the electors have a right to protect their property and their families from all kinds of legislation which they cannot understand or control.\n\nB. W. M. writes: \"It is apparent to me that we must have a new government, and I am convinced that the electors must be represented in the House of Commons.\"\nFOR GENTLEMEN'S FURNISHINGS!\nIN ALL BRANCHES FOR\nWhite Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowelings,\nDress Goods,\nSilks,\nLinen, etc.\n\nGO TO\nJ. M. CAMPBELL'S,\nGROCER\nAND\nDRY GOODS MERCHANT,\nPRINCE ALBERT, SASK\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 14 feet extra\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nADVERTISERS\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co.,\nNewcastle Advertising Bureau,\n10 Spruce St., Hamilton.\nSend 10c for 100 pp. Pamphlet.\nHON. JOS A. CHAPLAIN ON THE RIEL ISSUE.\n\nHon. Mr. Chaplain, Secretary of State, has been visiting and speaking in several places in Ontario lately, in company with other members of the Cabinet. In South Essex, he spoke for over an hour with his usual force and eloquence. He referred to the recent election, saying that he had come to tell Mr. Blake that he was not at liberty to say that his programme would be one of conciliation and another of war. He came to tell the Liberals they could not be defeated in Quebec and asked loyalty in Ontario. He also said Mr. Macdonald was responsible for Mr. Laurier raising the Red River in the Chambly election. Mr. Chaplain said he had visited Chambly to see what the Grits would do. He knew they could not carry the country, but they could carry the Red River, and it was raised and was successful. But Mr. Chaplain did ill deport himself. Referring to Mr. Laurier, he said it was easy to see why he was making the market on the banks of the St. Lawrence, where he would engage in commerce on the banks of the Ottawa. He sympathized with Mr. Laurier in his error—the greatest error of his political life—and wished him success in maintaining his reputation as a statesman. After referring to the fact that when the election was being canvassed, Mr. Laurier was running for the West to fight the rebels, and the way men they were now having to take care of the public service, Mr. Blake said he thought Mr. Laurier was honest, and the jury thought the same. He thought Mr. Laurier was wrong in speaking for him at the time the rebellion broke out. Mr. Chaplain said he thought a certain portion of the population of Quebec was so agitated upon that subject.\n\n\"There is no harm in my heart,\" said Mr. Chaplain, \"I am not too old to be short to hate. I don't like to hate my fellow-countrymen. I don't hate them because they are French. I make their mistake in saying that they have been misled by sympathy for a man whose acts they have approved. I am not for a man who is arrested by sympathy for a man who is doing something wrong. Gentlemen, I hope I will not be repaid for what I say. As Mr. Macdonald has said today, there is only one coincidence, the only other occasion on which I have paid through this committee, was in the case of Mr. Smith, who went to the North West to defend Lepine, accused of murder. When I was asked to defend him, I thought it was a good lawyer's duty to defend. Although I do not blame him for doing it—I did not have people to pay me—I thought it was my duty to try and get him off. I thought my friends never thought of writing to me to ask me personally to be the advocate of his cause. I thought that he did not doubt my ability nor my good will, they never said to me about it. I thought if he did she should not have doubted of my good will and go and put up his case, for that was my business. The risk of my portfolio in the Cabinet, a thing to which I attach considerable importance, is nothing compared with the risk of which I do not care a penny. (Applause and cheering.) Riel knew that it was not for me to take any part in his affairs, in need, in danger; still, without doubting my ability nor my good will, they never said to me about it. I thought if he did she should not have doubted of my good will and go and put up his case, for that was my business. The risk of my portfolio in the Cabinet, a thing to which I attach considerable importance, is nothing compared with the risk of which I do not care a penny. (Applause and cheering.) Riel knew that it was not for me to take any part in his affairs, in need, in danger; still, without doubting my ability nor my good will, they never said to me about it. I thought if he did she should not have doubted of my good will and go and put up his case, for that was my business. The risk of my portfolio in the Cabinet, a thing to which I attach considerable importance, is nothing compared with the risk of which I do not care a penny. (Applause and cheering.)\n\nNEW GOODS\n\nAT\n\nMISS MACK & CO\n\nFirst Door East Telegraph Office.\n\nCook Stoves, No. 8, $27\nCook Stoves, No. 9, 30\nBox and Parlor Heaters AT ALL PRICES.\n\nPiping and Drums and other Tinneryware of every description made to order and warranted first-class.\n\nJ. R. McPhail.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886101501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2452, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 4381, 2], [4381, 5340, 3], [5340, 9614, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]