[{"id": "ee93ebfd93261ee5f1c1d43a0464d18d0e6f9828", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nSPINK & MAVETTY.\nJ. D. MAVETTY.\nPRINCE ALBERT, N.W.T.\n\nTERMS—8¢ per annum in advance single copy, 10 cents each.\n\nIn no case will reply be inserted in this paper. Remittances, etc., per line.\n\nAll letters to be addressed to the Proprietors.\n\nTHE FARMERS' UNION.\n\nThe agitation for farmers' rights still progresses in Manitoba. There has been some talk of another convention being delayed to be composed solely of farmers, as it appears some parade was caused by a journalist. It is said that the number selected to go to Ottawa, to be held at Brandon shortly. At the Winnipeg meeting, a resolution was passed to memorialize the British Government for a repeal of the Confederation Act, and such modification of it as would allow Manitoba, the North West Territories and British Columbia to get out of a new confederation of their own. It is not a very plausible scheme, but there should be a movement made from a North West point of view, it is folly to suppose that the Government will entertain it for a moment. At the time of the passage of the British North America Act, the North West was afterwards, Nova Scotia, which was strongly opposed to the Union, tried every means to prevent it, and was refused from the ballot boxes, and sent some of her ablest men to England to represent the rate Confederation, but it was of no avail. The result was \"no terms\" financially, but the bonds of union like the sea, well known to the North West, have been strengthened, and as we have taken each other for better or worse, we have no reason to complain. At this juncture, while we think it would be useless agitating for repeal or secession, we heartily approve of the action taken by the farmers of Manitoba in forming a union and sending delegates to Ottawa to present their views to the Dominion government and pray for redress—and we should be glad to see their example followed by the farmers of North West, who labor under much greater disadvantages and drawbacks than ours. More could be accomplished by the farmers of North West questions, by sending a competent delegation or delegates to Ottawa during the coming session, supported by all the memorials and remonstrances that could be written.\n\nOUR MINERAL RESOURCES.\n\nQuite an interest has been created in the discovery of gold by the report of rich gold finds in the North more gap. There is no doubt that within the recesses of the Rockies there are vast mineral deposits of gold, silver, lead, and probably iron ore, which will be developed by the advance of the C. P. R. into that country, and destined for its future greatness, aided upon by agricultural productions, vast as they undoubtedly are, and as they hang, when emptied and skilled labor has been brought to bear upon its hidden mineral wealth, it will be without a doubt the Eldorado of the continent. There is no doubt that an immense immigration will be attracted to these new names of tergeminus, and the advantages and the forms which are springing up along the line as if by magic will participate in the benefits of the new era. We while, while rejoicing in the prosperity of any portion of this vast domain, we have a special interest in those parts which we believe is in store for Prince Albert, if we only have patience to wait and bide our time. It is sure to come.\n\n\"AN ARCTIC WAVE.\"\n\nOur contemporary, the Halifax, N.S. Morning Chronicle, speaks of the recent an \"arctic wave\" they had down there last month, during which the thermometer fell to a low of -19° below zero. We call that cold weather. What would you say to 63° below? For the last month we have never seen the higher than 35° below zero, and yet we feel that we have our being,\" and enjoy ourselves with outdoor sports, such as curling, skating and hockey. We have always used to any climate, if we take care of himself, but the \"blizzards\" have the advantage over the North Western in the enjoyment of those delightful keen winds from off the Atlantic which we have not, but in their place the lovely \"whitewash\" thunders down from the Rockies from the blue waters of the Pacific. There is a Province which we are proud to belong to, and we trust it will be a merit to our suffering fellow countrymen in the \"little province by the sea.\"\n\nTHE C. P. R. STRIKE.\n\nThe strike which has interfered so seriously with traffic on the C. P. R. for several days now is virtually ended. The machine shops have been reopened, to the great joy of the hitherto locked-out workmen, who were finally notified yesterday of the strike; and many of the engineers, firemen and other employees along the line have returned to their homes and duties. Mr. Bain, who has been away on business, has returned to his home, and has been promptly attended to.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller,\nA T. N. Campbell's New Store.\nA LARGE STOCK OF\nWatches,\nClocks and Jewellery\nKEPT CONSTANTLY ON HAND.\nPromptly Attended to\nREMOVED.\nDR. BAIN\nHas removed his office to the new build in rear of the Presbyterian Church.\nOFFICE HOURS:\nFrom 9 a.m. to 12 p.m.\nFrom 7 p.m. to 8 p.m.\nPrince Albert Bakery.\n2LB LOAF, 12¢.\n9 LOAVES, 15¢.\nCakes and Pastries always on hand and made to order.\nWM. R. BELL.\nMANITOBA WEEKLY FREE.\nTHE MONARCH OF THE WEEKLIES.\nTHE LARGEST PAPER IN CANADA.\nTHREE MONTHS FREE.\nThree Handsome Cash Prizes\n$500-$200-$100.\nFor information, write WM. R. Bell, Prince Albert.\n\nNEW FALL AND WINTER MILLINERY,\nLADIES' HOLMANS AND CLOAKS,\nFur Caps and Muffs,\nWool Goods.\nALSO\nLadies and Children General Furnishings.\nMISS MACK & CO.,\nCAMPBELL'S BLOCK.\nSTRAVED!\nOn my premises, about two months ago, a pair\nBlack Ox!\nEleven years old, brown tailed.\nSame can be obtained by paying expenses, on application to\nEDWIN SUTHERLAND,\nHalifax Settlement, South Branch.\n\n\"I whose purpose is to sell will praise but not exceed the truth, even to sell.\"\n\nThe Boom is off!\n\nWe are determined to sell out at actual cost. Hard Lines.\nBetter luck next time.\n\n\"What cannot be avoided.\nTwo are childish weakness to honest.\nHow often in affairs of men we see\nDull hesitation end in woeful loss?\nIf losses must be made, decide at once,\nAnd with proceeds of thy sales buy cheaper.\nGold that's put to use more gold begots.\"\n\nYou know how we are situated. Please call and say you wish to buy for cash. This will be sure to establish a very agreeable feeling between us. You will thereby be master of the situation, and we will be sure to serve you in a satisfactory manner.\n\nBRANCH STORE\nNear the building occupied by the late firm of Ashdown & Agnew, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO.,\nWholesale and Retail,\nPrince Albert, Sask.\n\nHOW TO SUBSCRIBE.\n\nEnclose TWO DOLLARS in Registered Letter writing name Subscriber and Post Office very plainly addressed to\nFREE PRESS,\nWinnipeg.\nPRICK'S BAD BOY AND HIS PA.\n\nThe Boy Adopts a Poor Woman and Her Baby, and Makes Them Happy.\n\nHelp a Fellow in Need, and You'll Help Yourself.\n\nThere once was a boy named Jack who lived in a small town. One day, while he was out playing, he came across a poor woman and her baby. The woman looked very sad and hungry, and Jack knew he had to help them.\n\nJack took the woman and her baby home with him. He fed them and gave them shelter. The woman was grateful and thanked Jack for his kindness.\n\nOver time, Jack became very fond of the woman and her baby. He started to take care of them like they were his own family. The woman and her baby were very happy to have Jack's help.\n\nThe story shows us that helping others can bring joy and happiness to everyone involved. It also reminds us that we should always be kind and compassionate towards those in need.\n\nTHE GABLE HOUSE.\n\nThe Best Outfit of Pool, Carom & Pigeon Hole Tables in the Territory.\n\nThe Best Beer & Cigars of the Finest Brands in Wholesale and Retail.\n\nJOHN WYNERSKIEGH, Prop.\n\nUNITED STATES Life Insurance Co'y,\n\nthe City of New York.\n\nESTABLISHED 1869.\n\nDeposit with Dominion Government.\n\nAssets Office, Bird Block, 433 Main St.\n\nG. H. MAGUIRE, Provincial Manager.\n\nThis Company issues policies on excellent terms, and pays claims promptly and frequently.\n\nPolicies are insensible for any cause excepting suicide and war. Every form of Tortine Policy issued.\n\nJOHN F. BETTS, Agent.\n\nCanada Life Assurance COMPANY\n\nESTABLISHED 1869.\n\nHEAD OFFICE:\n\nHAMILTON, ONT.\n\nCapital & Funds, nearly $6,000,000\n\nAnnual Income, over $1,000,000.\n\nA. SPROT, Agent.\n\nPrince Albert District, N.W.T.\n\nD. A. STACKHOUSE,\n\nDENTIST.\n\nPRINCE ALBERT, N.W.T.\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\nThe Leading Weekly Paper in the Province.\n\n$2.50 PER ANNUM.\n\n\"The Times\" Contains all Original Matter.\n\nAdvertise in \"The Times.\"\n\nAnd have your Advertisement read by all.\n\nReplete with Local and General News.\n\nSubscribe! Subscribe!\n\nJOB PRINTING.\n\nLetter Heads, Bill Heads, Envelopes, Circulars, Dodgers, Business Cards, Legal Printing, Pamphlets, Etc., Etc., Etc., PRINTED WITH NEATNESS AND DISPATCH.\n\nSPINK & MAVETY,\n\nPROPRIETORS\n\nRIVER STREET, PRINCE ALBERT\nTERRITORIAL NEWS.\n\nREGINA.\nFrom the News, Dec. 17.\nMrs. Denison intends paying Ottawa a visit shortly.\n\nCol. Richardson went east on Sunday to join Mrs. Richardson at Milwaukee.\n\nA short discussion was held on Monday between Mr. and Mrs. Long Lake. His wood showed she had been \"adopted\" for more than two years.\n\nThe Xmas Eve tree was a Xmas tree at the Methodist church. The church was filled, and the beauty of the large number of children was a matter of universal comment.\n\nCALGARY.\nFrom the Herald, Dec. 25.\nA good number of meetings and activities appear Christmas in Calgary.\n\nAt last week's meeting of the City Council, or at least two blocks of it, for the town site, Mr. McVittie's force has had its say.\n\nOur Catholic friends are not behind the other denominations in church enterprise, they having built a commodious church, Dec. 24. The church was dedicated on Dec. 26.\n\nImmense prairie fires have been raging towards the north. It seems something remarkable is going on further north in a country which has been described by outsiders as a place where snow abounds every month in the year.\n\nFORT MACLEOD.\nFrom the Gazette, Dec. 13th.\nThe town is certainly free from ice, and even the smallest of the public places are open.\n\nThe cold seems which Mr. Macleod's Kittens have had this winter are four feet thick and of good quality, burning away almost as clean as wood.\n\nPlanning was being done in a noble house yesterday. Mr. Macleod wisely remarked, the people in this country have no respect for winter.\n\nThere will be no school in the building over Christmas. Mr. Macleod is having a frame building 20x60 put up. A building is also going up by Mr. Davis.\n\nThe deepest snow, so far, in the immediate vicinity of Macleod, is about four feet deep. The North West is represented as within only a few miles of the north pole.\n\nMOOSE JAW.\nFrom the News, Dec. 18.\nThe social in the Presbyterian church on Christmas day was a very pleasant and enjoyable affair.\n\nQuite a number of our citizens gathered at Finlay & McIain's hall on Christmas Day for a social.\n\nA meeting of farmers residing in the Moose Jaw Reserve was held in the school room to discuss matters affecting their interests.\n\nMANITOBA.\nRAE PORTAGE.\nFrom the Press, Dec. 17.\nNext Monday is nomination day for the electoral municipal council.\n\nA dinner was held at the Rae Portage Club last night by the ladies who are being rushed forward rapidly.\n\nA banquet was held at the Rae Portage Hall Saturday night and an enormous tree entertainment on Christmas night.\n\nA meeting was held at the St. Charles hotel last Friday to nominate the candidates for election to the Provincial board of Manitoba. On motion, the meeting pledged itself to return the old Mayor and Councilmen. For the following day they were nominated and declared elected by acclamation.\n\nBRANDON.\nFrom the Blade, Dec. 27.\nThe Masonic hall this evening proved most attractive.\n\nThe interest shown at the arrival on Friday evening last was large. Many of the costumes were very neat.\n\nThe midnight service at the Joseph's Lodge was attended by 150 members. The church was decorated for the occasion, and suitable motions were arranged around the altar.\n\nIt is our painful duty, this week, to record the sudden death of the Rev. Mr. McInnis, who died at his residence in the Brandon hospital on the evening of the 24th.\n\nThe teachers of the Presbyterian Sunday School treated the children to a Christmas dinner. Twenty-five little folks occupied the platform, and the body of the church was packed with their parents and friends. A programme suitable to the occasion was well received by the children.\n\nNOTICE.\nJUST ARRIVED\n100 HORSES\nFOR SALE OR\nWORK, SADDLE AND\nBROOD MARES.\nFreighting, express and passenger\nline from Gabriel's Crossing to Troy\nand back.\n\nPH. GARNOT,\nAgent Gabriel's Crossing, South Dakota.\n\nBONANZA!\nStill on the War Path\n\nWITH A LARGE LINE OF GOODS\nAnd Slaughtering the Prices.\n\nRemember, it is not old stock which we offer, but the best, and the title of\nKingsley Prize Bull is given to the North West.\nStock consists as follows:\n\nDry Goods and Novelties\nIncluding a Large Line of Goods\n\nFresh Produce, Butter, Cheese, Lard, Meat and\nGrain, Hose, Children's Goods and\nStationery, Books, Ladies' Laces, Lamps,\nHats, Shirts, Coats, Socks, Bed-\nspreads, Blankets, Prints, Gingham,\netc., also a large stock of Ready Made\nClothing, Boots, Shoes, Hats, Umbrellas,\nGrosgrain, Tea, Coffee, Sugar, Lanced\nCheese, Butter, Eggs, Vegetables, etc.\n\nAll goods fresh and new. An inspection of this stock will satisfy the closest buyer that he cannot get better all goods at\nlower prices.\n\nJ. M. CAMPBELL.\n\nJAMES SINCLAIR,\nMerchant Tailor.\n\nHas just received his new stock of\nFall and Winter Goods.\n\nUNDERCLOTHING\nA Large Department of\nFUR CAPS AND MITTS\n\nGive me a call,\n\nJAMES SINGLAR\nEAST END BAKERY!\n\nEight Loaves for $1\n\nOther and extra Made To Order\n\nHUGH MCDougall,\nEast End Bakery.\n\nGREAT OFFER.\n\nTHE\nWinnipeg Weekly Sun\nFROM NOW\nTo January 1st, 1935. For $1.50\nPAYABLE IN ADVANCE.\n\nWeekly Sun and Weekly\nGlobe or Mail, $2.25\nper annum.\n\nJUST RECEIVED AT THE\nMEDICAL HALL.\nVictoria Hypophosphites,\nVictoria Buchu and Uva Ursi,\nVictoria Carbolic Acid Soap,\nBurdock Blood Bitters,\nBurdock Pills,\nHagyard's Cough Balsam,\nHagyard's Yellow Oil,\nDirect from the Manufacturers.\nTERMS—CASH.\n\nJobbers supplied on reasonable terms.\nPhysicians prescriptions and family re-\ncipes carefully prepared.\n\nT. E. JACKSON,\nChemist & Druggist.\n\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP,\nNear Presbyterian Church.\n\nTHE FIRST INSTALLMENT OF A\nLarge Lot of\nMowers and Rakes\n\nFrom the celebrated Watson Manufacturing\nCo., New York, and\nBurford Brokers\n\nHave arrived at the Burford Department\nof Jackson & Jackson, and to\narrive shortly.\n\nThe Lion Brand\nHeavy Plowing Mows,\nWatson Harrows and\nBurford Cross Ploughs\n\nAll these goods are guaranteed to give\nsatisfaction. Particulars to secure the same\nimpossible. We urge you to see them as well as\nto carry and leave them there.\n\nJACKSON & JACKSON\n\nFARMERS\nATTENTION!\n\nA. H. Van Slyke & Co. have delivered to the\ninhabitants of this district, the finest\nmowers ever sent into the Saskatche-\nwan territory.\n\nBrantford Reapers,\nBrantford Mowers and Rakes,\nSnowball & Speight Wagons,\nStubble and Cross Ploughs,\nA Large Stock of Repairs,\n20 Brantford Cord Binders,\n\nWhich are now being used at the Forks of the\nRed River, and are considered to be in\nprime order. They are made in accordance\nwith the latest improvements and are\nguaranteed to operate\n\nS. W. VANLUVEN.\n\nfits, Epilepsy, or Falling Sickness.\n\nPERMANENT RELIEF—GUARANTEED.\nChronic Indigestion—Relieved Infallibly for Pounds.\nT. H. Van Slyke & Co., 300 Fifth Ave., N.Y.\n\nNEW PATENT BRIDGES\n\nNone but First-class Workmen Employed in their Manu-\nfacture.\n\nAPPLY AT\n\n\"The Times\" Office,\nPRINCE ALBERT — N.W.T.\nThe Reminiscences of a Fur Trader. No. III.— History of the Hudson Bay Company in the Northwest Terri- tors.\n\nWe quote some extracts from a very interesting paper read by Prof. Bryce at a recent meeting of the Historical Society of Ontario. The paper was read by an employee of the North West Fur Trading Company, the proprietor of the N. W. T. Weekly Times. There are many old settlers in this district who ought to be able to furnish interesting information, so regards this paper which we would be glad to see published. We will take the lead in getting up a Historical Society in Prince Albert.\n\nThis remarkable absence of historical facts in our Winnipeg district, is well realized by Prof. Bryce, who has visited Europe, and has made a close examination of the history of the Hudson Bay Company; and he remarks, by the following: “History is like a great sea, and its secrets must be left to be explored at the advance.”\n\nHe goes on to say: “Historians are like navigators, who sail through the various waters of history, gathering up fragments here and there, and describing the ocean behind them.”\n\nHe further says: “It is strange that in all parts of the world, except in this country, there is no such thing as a Divine Guide to the past, and yet our history is the most important part of our lives.”\n\nPoveshugh, Prince Albert.\n\nMay 13—This evening Mr. Leuck, Esq., delivered a very interesting lecture at Prince Albert, in which he gave a detailed account of his experience during a tour in the Great North-West.\n\nOn Tuesday last Prof. Bryce delivered another lecture in Prince Albert, before a large audience. He spoke about the Hudson Bay Company, and gave a vivid picture of their early days.\n\nMay 21—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nMay 28—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nJune 4—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nJuly 2—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nAugust 6—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nAugust 20—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nOctober 1—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nDecember 5—Mr. Leuck, Esq., delivered another lecture in Prince Albert, on the history of the Hudson Bay Company.\n\nThe above series of lectures concluded with a final address by Mr. Leuck, Esq., on the subject of “The Influence of the Hudson Bay Company on the Development of Canada.”\n\nMr. Leuck, Esq., stated that the Hudson Bay Company had played a very important part in the development of the Canadian Northwest, and had done much to promote commerce and industry in the region.\n\nHe also pointed out that the Hudson Bay Company had been responsible for the introduction of modern methods of trading and transportation to the region, and had helped to bring about a more prosperous and civilized life among the indigenous peoples.\n\nIn conclusion, Mr. Leuck, Esq., emphasized the importance of remembering the history of the Hudson Bay Company, and the contributions it has made to the development of Canada.\n\nThis lecture series attracted a large audience, and was well received by the public.\n\nCanoeing in Prince Albert\n\nFriday morning there was a canoe race on the Assiniboine River. The canoeists started from the dock opposite the Hotel Thompson, and finished near the foot of Main Street. The weather was rather cool, but the race was very exciting.\n\nThe canoeists were divided into two teams, and each team consisted of three members. The race was won by Team A, consisting of Mr. J. H. Thompson, Mr. W. B. Thompson, and Mr. R. S. Thompson. Team B, consisting of Mr. J. B. Thompson, Mr. W. B. Thompson, and Mr. R. S. Thompson, came in second place.\n\nThe canoeists showed great skill and determination throughout the race, and the spectators were very enthusiastic.\n\nThe race was officiated by Mr. J. H. Thompson, and resulted in a very good turnout for Prince Albert.\n\nPublic Notice\n\nSaturday, July 29 —Notice is hereby given that the Prince Albert Board of Trade will meet on Monday next, July 29, at 8 o’clock p.m., in the town hall, for the purpose of considering the question of forming a chamber of commerce.\n\nPublic Notice\n\nSunday, July 23 —Attention is hereby called to the fact that the Prince Albert Fire Department will meet on Monday next, July 23, at 8 o’clock p.m., in the fire hall, for the purpose of considering the question of forming a fire department.\n\nPublic Notice\n\nWednesday, July 26 —Attention is hereby called to the fact that the Prince Albert Police Department will meet on Monday next, July 26, at 8 o’clock p.m., in the police station, for the purpose of considering the question of forming a police department.\n\nPublic Notice\n\nThursday, July 27 —Attention is hereby called to the fact that the Prince Albert School Board will meet on Monday next, July 27, at 8 o’clock p.m., in the school board room, for the purpose of considering the question of forming a school board.\n\nPublic Notice\n\nFriday, July 28 —Attention is hereby called to the fact that the Prince Albert Chamber of Commerce will meet on Monday next, July 28, at 8 o’clock p.m., in the chamber of commerce building, for the purpose of considering the question of forming a chamber of commerce.\nOUR GRIEVANCES\n\nThe convention of Farmers' Delegates recently held in Winnipeg has attracted great attention in the eastern press. We give a few clipped paragraphs:\n\nTHE GRIEVANCES\n\nPublicity has recently been given in the press to the grievances felt by the farmers of the farmers in the Northwest, and effort is now being made by the farmers themselves to obtain, through agitation, redress for what they consider their wrongs. The discussion of questions of this character is desirable on every hand, but there is no more justifiable and unjust treatment is meted out to settlers in the North West by either the Government or other authorities than is awarded to any rightly so entitled for similar treatment. The present movement among the North Western farmers is not a new thing; the same spirit, under various names, has been prominent in all parts of the country, has been promoted by the belief that exorbitant profits are being realized by millers, and unduly high elevator charges prevail—Montreal Gazette (Conservative).\n\nNORTH WEST REPRESENTATION.\n\nThe first duty of the Dominion Parliament over the North West Territories is to provide them at least with one electoral district, as in Algoma. One member's vote would not amount to much, but his voice would be powerful in influencing action. It is impossible speaking from personal knowledge con- vince myself as to the justice of his constituents demands. The Liberal party hopes for much from the North West, and the best policy it can pursue is to advocate representation for the Territories be at once given representation in Parliament. In doing so it would strengthen the claims for the ends of equity—Hamilton Tribune (Independent).\n\nNOVEMBER ADVERT.\n\nNow that success is beginning to crown their efforts, the Manitoba Farmers will do well to be very cautious and not permit themselves to be inveigled into making unnecessary promises, to sign annexation manifestoes, nor to allow party passions control them in their votes. Let them continue constant and firm in their demands for reforms without giving their fellow provinces that reason to suspect they are wavering. They must secure sufficient sympathy throughout the Dominion to compel the authorities at Ottawa to give them a fair hearing. Canadian Pacific, to concede to the inhabitants of the Prairie Province the control of their own public works, the construction of railways by whomsoever and wherever they are wanted, and the lowering of the cost of living—Montreal Witness (Independent).\n\nA SECOND NORTH WEST REBELLION?\n\nIf a second North West rebellion, if it can be prevented, will make less noise than the first was, there are a great many more people in the North West today than there were in 1870, and they are people of very different temperaments. The majority of them are men who learned the principles of liberal thought in the schools of Ontario, and who have greatly retarded the settlement and cultivation of the prairies—Montreal Witness (Independent).\n\nIron, Steel, Horse Shoes, Horse Nails, Bolts and Chains, Sleigh and Cutter Runners, Shafts and Tones for sale.\n\nAny variety of other articles generally used in the first-class Blacksmith Shop.\n\nCHESTER THOMPSON\n\nPRINCE ALBERT\n\nReal Estate\n\nFOR SALE—A NUMBER OF CHOICE BUILDING LOTS\n\nPRINCE ALBERT\n\nSuitable for business purposes or residences.\n\nFor further particulars apply by letter or wire to—\n\nC. M. MAIR,\n\nP. O. DRAWER K.\n\nPRINCE ALBERT\n\nTo Merchants and Others.\n\nAccounts collected on business.\n\nBooks written up, balanced, etc.\n\nWill do work to order.\n\nPost Office or Texas Office.\n\nA. R. BURNS.\n\nROYAL BAKING POWDER\n\nAbsolutely pure.\n\nThis Powder never fails. A marvel- purify, strength and wholesome. More- ful economical than the ordinary kinds and economical than the ordinary kinds and more wholesome than any other. Made of low taxes, short weight, alum or phosphate powder. Sold only by firms.\n\nNew Canada Powder Co., Ltd., W. H. N. Y.\n\nPHOTOGRAPHS!\n\nChas. E. Page\n\nNEW STUDIO.\n\nEAST END.\n\nNOTICE\n\nTo Lumbermen and Others\n\nWho are desirous of obtaining Permits to cut Saw Logs, House Logs, Rails, Fence Posts, Cordwood, or any kind of Timber in the District of Prince Albert, North West Territories.\n\nPermits will be granted to parties who strictly comply with the Act which prohibits any trespassing on Crown Timber Lands\n\nEvery entry in any form without a permit is an offence, and can be prosecuted for the benefit of the Crown.\n\nApply to Mr. J. E. Richardson, Judge of the Peace, Prince Albert, N.W.T.\n\nJUDGE RICHARDSON.\n\nWe are pleased to state that our old friend and late judge in this district, Mr. J. E. Richardson, has presented us with a complimentary address by the members of the profession practicing in Regina, which address the judge has transferred. The Leader refers to the matter.\n\nIn view of the fact that he has been called away by the legal profession, presented to His Honor, Col. Richardson, judge of the Qu'Appelle District Court, N.W.T., during the last session, and in view of his popularity appears to us to be that he makes it a rule to administer law on the side of justice, we feel justified in saying that he is entitled to receive any praise deserved to give effect to any clearly stated principle of law, he will not permit his personal feelings to be allowed to influence him in the administration of the law, as laid down by the courts, and will treat each case fairly and impartially.\n\nThe public is requested to assist in preserving the forest, and the method of tree-cutting as at present practised to the destruction of the forests, is illegal. The question should be taken by Legislative interference to arrest the progress of the evil, as all the lumbermen are equally interested in the local wants of the people who are only now beginning to settle on the fertile prairies.\n\nParties claiming wood already cut on north side of the Saskatchewan River within the boundaries of the province, must be registered and put on the official list immediately, otherwise such logs will be subject to seizure, and double dues charged.\n\nThe information given will be of assistance in the leasing of permits, or dues chargeable on the various kinds of timber cut in accord- ance with the regulations. [Signed by calling on me at my office, Campbell's Block, next door east of Miss Macdonald.]\n\nD. A. WAGGONER,\nCrown Timber Agent.\nPrince Albert District, N.W.T.\nOctober 31, 1883.\n\nTHE SHORT LINE TO ALL ONTARIO POINTS\n\nAt ticket agents sell tickets via this new and popular line.\n\nJAMES ROSS,\nGen. Sup't.\nOctober 31, 1883.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha and Chicago & Northwestern Railways.\n\nExpress leaves St. Vincent at 11.45 a.m., arriving at St. Paul at 2.15 p.m. following making close connection with the Canadian Pacific Express.\n\nTrains leave St. Paul for Brookside at 9.30 a.m., and return at 6.30 p.m.; also run between St. Paul and Minne- sota City every hour. Sleeping cars on all night trains.\n\nFURNITURE\n\nFancy Parlor and Bedroom Sets, Bedsteads, Couches, Sofos, Chairs of nearly all descriptions.\n\nCravat Oris for the Babies, Blankets for the Ladies, Mattresses Single & Double to suit Customers.\n\nC. & C. E. CARTER,\nHo For The West.\n\nGENERAL BLACKSMITHING AND HORSESHOEING\n\nDone on the Most Approved Principles and the following diseases remedied:\n\nContracted Feet, Hoof Bound, Weak Heeled Corns, Interfering and other diseases in the feet of horses.\n\nSleigh and Cutter Ironing, Carriage Repairing And Jobbing\n\nPromptly attended to.\n\nWM. GORDON,\nPRINCE ALBERT\n\nPlaning Mills and Sash and Door Factory\n\nCOR. NEBIT AND MACKEY STS.\n\nStools, Doors, Frames, Blinds, Mouldings and all Builders' Furnishings made to order on the shortest notice.\n\nDOOFELLOW BROS. - PROP'S.\n\nW. J. CARTER,\nBuilder and Contractor.\n\nAll Orders Promptly Attended to.\n\nPlans and estimates furnished when required.\n\nPlanning and Matching done to order, next to H. B. C. Grant Mill.\n\nResidence—Near Presbyterian Church.\n\nFOR THE HOLYDS.\n\nWALTERS & BAKER\n\nClothing, Men's and Women's.\n\nCrochery.\n\nBoots and Shoes, Confectionery.\n\nGroceries, Provisions, etc.\n\nROCK BOTTOM STORE\n\nH. WALTERS, F. C. BAKER,\nButcher, Prince Albert", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884011101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9040, "total-output-tokens": 7251, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6872, 2], [6872, 9088, 3], [9088, 15939, 4], [15939, 21526, 5], [21526, 29705, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]