[{"id": "2601cc74b2a3e065b7e6d93bc94e383f59a3cca4", "text": "COAL OIL.\n\nAmerican Coal Oil,\n\nFOR ECONOMY AND LIGHT.\n\nWARRANTED THE BEST IN THE MARKET.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nSTILL IN A STATE OF DISORDER!\n\nThe Balance of our Stock will in consequence be SOLD AT COST FOR CASH, to make room for large Fall Importations now on the way.\n\nCall at once with MONEY or PRODUCE and get the BARGAINS.\n\nBETTS & Gwynne.\n\n$25 TO $50 PER DAY!\n\nCan easily be made using the OLD RELIABLE\n\nVictor Well Boring & Rock Drilling Machinery.\n\nWe mean it and are prepared to demonstrate the fact. The WELL-MERITED SUCCESS of our Machine is due to its past fifteen years, and with EXCELLENCE for our MOTTO, we are MARCHING ON ALL THE TIME.\n\nOur Machine is operated by either Man, Horse or Steam and works very easily and quickly.\n\n3 Inch to 4 Feet in Diameter\n\nand will bore and drill ANY REQUIRED DEPTH. They will bore successfully and satisfactorily in all kinds of Earth, Soft Sand and Limestone, Bituminous Stone Coal, Slate, Hard Pan, Gravel, Lava, Sandstone, Separation Coal, Conglomerate, Granite, Basalt, Gneiss, Marble, Limestone, etc., etc. Our Machine is light running, simple in construction, easily operated, durable and acknowledged by the best authorities as being the best constructed and operated by some of the highest State Officials. They are also extensively used in:\n\nProspecting for Coal, Gold, Silver, Coal Oil and all kinds of minerals.\n\nAnd for sinking Water Wells and Coal Shafts, they are unequalled. We also make Rock Drills, Boring Machines, Rock Breakers, Rock Pulverizers, Mine Chutes, Mining Tools, Portable Forges, Rock Drills and Machinery of all kinds.\n\nGood Active Joints wanted in every County in the World.\n\nAddress: VICTOR WELL AUGER & MACHINE CO.,\n\n511 Pine Street,\n\nST. LOUIS, MISSOURI, U.S.A.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\nLorne Agricultural Society.\n\nThe Annual Dinner.\n\nThe annual dinner of the Society took place in the Great Central Restaurant, on Thursday evening last, October 24th, presided over by Mr. T. Oram. There was upwards of seventy present. The chair was occupied by President of the Society, Mr. Angus Cameron. The speakers were Mr. Andrew Spencer, Vice-President; Mr. James Miller, Sr., 2nd Vice-President. The party at dinner included the following gentlemen: Capt. J. H. Macdonald, Capt. W. McCallum, Capt. Henry, J. Macdonald, P. Atkinson, R. Gwynne, J. Macdonald, J. Milner, J. Macdonald, T. Macdonald, W. Newton, C. Adams, Mr. Macdonald, Mr. Wm. Niven, G. C. Macdonald, Mr. Shipton, R. Fisher, Mr. Macdonald, Mr. Macdonald.\n\nAfter dinner the President proposed the toast of \"The Prince of Wales,\" which was duly honoured.\n\nThe Chairman then gave \"The Prince of Wales, Prince of Wales, and other members of the Royal Family,\" which met with loud and repeated cheers.\n\nThe toast next from the chair was that of the \"Government,\" which was received with the utmost enthusiasm.\n\nIn a few brief but eloquent remarks the Chairman said (addressing Capt. Macdonald), who had most cheerfully said—\n\nMr. Cameron, speakers and guests, your President has asked me not to give you my ideas on the financial state of the Lorne Agricultural Society, but knowing how little I am conversant with the subject, I am unprepared to go into the subject, but have no doubt all the information required will be given by the Secretary of the Society, Mr. Adams. The farmers are those whom we have to look to as the country grows, as prices advance, and they do all the work on the land of this district. I was very pleased to see the exhibits of house making and dairy products displayed at the exhibition, for it convinced me that bacon, cheese, and butter can be made here equal to, if not superior to, any produced in the territories. Butter, which was shown by many entries, will always command a market price, and if the prices of wheat were very fine, I could find a ready sale, and if cheese was sold here cheaper than it could be bought, there would be no doubt that money would remain with us. The corn was always great demand in the country and abroad. No wonder our farmers have been buying corn during the past in importing bacon, and thus have been able to keep it in the country, if not raising more, and turn more to pork than they had done, and we all look forward to day our machines take care of the work formerly done by hand. I have heard that an oatmeal mill is to be started here soon, although it is an expensive proposition to start such a large scale. Good oats can be grown here and the farmers could prove that wheat can be grown here, and if they could get elsewhere. From my own experience I have found wheat growing 68 and 69 bushels per acre, and I question if there is any place to compete with it in a wheat growing province. Three years ago I was through the large farms of Minnesota, and found the wheat raised by the Manitobans newspapers said some time ago that their wheat although former, very good for flour, but the farmers thought they have a loss in flour made, it is a partial loss, which was much better than losing the wheat crop. The wheat is a good one for feeding cattle, new stock are coming in, and I have no doubt that, bright days are in store for us. They have sent me some samples of wheat, but this was the Society's first show, and we have had a very bad year, these countries had a very hard winter, and being down, ours would have its day of coming up, and that at no distant date.\n\nNow that the question is an object to view, I will give next year four prizes for house making structures. Bacon, first prize $5; second prize $3; third prize $2; fourth prize $1. In conclusion the gentleman proposed the toast of \"The President and other leaders of the society.\"\n\nMr. Miller on behalf of the office bearers responded to the toast and said it was very late, and we must not delay, but on the whole he thought the show very good showing the best pastures conditions. The specimens of beef cattle were very fair for this place, and there was certainly a good display of sheep. The crops were generally put into consideration, were better than hear many others expected. The crop this year is likely to prove a total failure.\n\nCanada Pacific R'y. Co.\n\nWestern Division.\n\nTRAIN SERVICE.\n\nCHANGE OF TIME.\n\nOn and after Feb. 1st, 1884, trains will move as follows:\n\n| Going East | Going West |\n|------------|------------|\n| Winnipeg   | Winnipeg   |\n| 7:00 p.m.  | 7:00 p.m.  |\n| Portage    | Portage    |\n| 8:00 p.m.  | 8:00 p.m.  |\n| Regina     | Regina     |\n| 9:00 p.m.  | 9:00 p.m.  |\n| Swift Current | Swift Current |\n| 10:00 p.m. | 10:00 p.m. |\n| Medicine Hat | Medicine Hat |\n| 11:00 p.m. | 11:00 p.m. |\n\nOnly two trains a week will run west of Medicine Hat on Mondays, Wednesdays and Thursdays. Trains leaving Mondays and Wednesdays will arrive at Medicine Hat at 11:00 p.m.; returning trains will leave Medicine Hat at 11:00 p.m. and arrive at Medicine Hat at 11:00 p.m.\n\nReturning train will leave Calgary Thursday night, arriving at Winnipeg Saturday and Wednesday night.\n\nDaily trains will run between Winnipeg and Edmonton.\n\n| Going East | Going West |\n|------------|------------|\n| Winnipeg   | Winnipeg   |\n| 7:00 p.m.  | 7:00 p.m.  |\n| Edmonton   | Edmonton   |\n| 8:00 p.m.  | 8:00 p.m.  |\n| St. Vincent | St. Vincent |\n| 9:00 p.m.  | 9:00 p.m.  |\n| Edmonton   | Edmonton   |\n| 10:00 p.m. | 10:00 p.m. |\n| Medicine Hat | Medicine Hat |\n| 11:00 p.m. | 11:00 p.m. |\n\nTrain leaves Winnipeg for Edmonton Monday, Tuesday, Thursday and Saturday at 7:00 p.m.; Wednesday and Friday at 8:00 p.m.; Sunday at 9:00 p.m.; returning train leaves Edmonton Monday, Tuesday, Thursday and Saturday at 7:00 p.m.; Wednesday and Friday at 8:00 p.m.; Sunday at 9:00 p.m.; arriving at Winnipeg Monday, Tuesday, Thursday and Saturday at 7:00 p.m.; Wednesday and Friday at 8:00 p.m.; Sunday at 9:00 p.m.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction wade.\n\nMOORE & MACDOWALL\n\nThe Prince Albert Times\n\nAND SASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, - PROPS,\n\nRIVER ST., PRINCE ALBERT, SASK.\n\nPUMPS !! PHOTOGRAPHS !\n\nMade and always on hand at greatly reduced prices.\n\nWaggons, Backboards and Baggies repainted with neatness and dispatch.\n\nNEW STUDIO\n\nCHAS. E. PAGE.\n\nEAST END.\n\nCHESTER THOMPSON,\n\nGeneral Blacksmith.\n\nDecorative Painting & Specialty.\n\nRepairing Farm Machinery a Specialty.\nTHE AGRICULTURAL SHOW.\n\nThe Prize List.\n\nThe show which was held on the 23rd inst., may be claimed a decided success, for although the entries were not numerous, still the exhibits were very good in most of the classes. The hard-riding centre of gravity against the exhibition of the Society, still the directors, and especially the secretary, Mr. C. Adamson did their best gratuitously, and they collected many exhibitors who would not have been entered, and for the systematic and orderly proceedings of the day were conducted.\n\nAfter the formal opening of the show by the Hon. Mr. Angus Macdonald; His Excellency the Lieutenant-Governor, Mr. L. Clarke, and Mr. Macdonald. The judges afterwards visited each class of contest.\n\nAdmirers were shown by Capt. Adamson, Mr. J. Thomson, Mr. Wm. Plaxton, Mr. T. Scott, Mr. D. Brough, Mr. C. McKay, and Mr. T. Smith.\n\nThe thoroughbred, fat, working, and grade cattle were excellent examples and showed great merit. The district is to be congratulated.\n\nSheep were well represented, a special premium being awarded.\n\nThe show of pigs created great interest among the public during the day. The first prizes for Berkshire sows were won by Mr. A. Cameron, followed by Mr. E. Macdonald, who took second prize.\n\nMr. Dilworth carried off the two first prizes for horses, with his fine stallion and old mare. Mr. Spicer's stallion and mare also received first prize. The show was closed by Mr. C. McKay's showy team taking the place of first for native ponies. All together various classes of horses were well represented.\n\nIn the home manufacture the bacon found its shades of quality and style in between the first and third prizes were awarded to Mr. Cameron, who was placed the first prize for the same reasons. He took second prize for the quality of the bacon and the first. The whole ran very well with bacon of prime quality, and the judges thought it would be a good day for the judge's dinner.\n\nThere was no horse was badly handled, though there was a great deal of talent in the show. The animal won by Mr. J. Macdonald, will be well remembered by the many spectators who came to see him win.\n\nAgricultural productions were well presented potatoes originally being very fine, but not all equally used was shown by Mr. Dilworth.\n\nIn domestic manufacture Capt. Henry took the first prize in stockings and mitts, which he had given away. Captain Henry has won the last two years in solid profit, if he sticks in the knitting pa. Miss E. Fonda had shown some beautiful work, which she had won a special prize given by Mr. Duch.\n\nThe show was well attended, and the profits that would be left over after expenses made the day. The Hon. L. Clarke with his usual generosity contributed $5.00 on last year's contestant Mr. Roman Catholic Education to take stock, and Capt. Henry so generously granted a field holiday. The proceedings were brought together in a close and interesting manner, which will appear in another column. The following was the prize list.\n\n| Class | Description                              | Prize |\n|-------|------------------------------------------|-------|\n| 1st   | W. Macdonald                             | Cow, steers aged and up                             |\n| 2nd   | H. Robertson                            | 2 cows, 2 calves                                    |\n| 3rd   | R. Macdonald                            | 3 cows                                          |\n| 4th   | L. Clarke                                | 2 cows                                           |\n| 5th   | A. Cameron                               | 2 cows                                           |\n| 6th   | T. Scott                                 | 2 cows                                           |\n| 7th   | D.B. Brough                              | 2 cows                                           |\n| 8th   | R. Adamson                               | 2 cows                                           |\n| 9th   | J. Thomson                               | 2 cows                                           |\n| 10th  | Wm. Plaxton                             | 2 cows                                           |\n| 11th  | J. M. Campbell                           | 2 cows                                           |\n| 12th  | J. M. Campbell                           | 1 cow                                            |\n| 13th  | J. Thomson                               | 1 cow                                            |\n| 14th  | Wm. Plaxton                             | 1 cow                                            |\n| 15th  | J. Thomson                               | 1 cow                                            |\n\n| Class | Description      | Prize |\n|-------|------------------|-------|\n| 1st   | P. Robertson     | 2 calves                                   |\n| 2nd   | J. Thomson       | 1 calf                                    |\n| 3rd   | J. Thomson       | 1 calf                                    |\n| 4th   | Wm. Plaxton      | 2 calves                                   |\n| 5th   | J. Thomson       | 2 calves                                   |\n| 6th   | Wm. Plaxton      | 1 calf                                    |\n| 7th   | J. Thomson       | 1 calf                                    |\n| 8th   | Wm. Plaxton      | 1 calf                                    |\n| 9th   | J. Thomson       | 1 calf                                    |\n| 10th  | Wm. Plaxton      | 1 calf                                    |\n| 11th  | J. Thomson       | 1 calf                                    |\n\n| Class | Description      | Prize |\n|-------|------------------|-------|\n| 1st   | W. Macdonald     | Cow, calves aged and up                   |\n| 2nd   | R. Macdonald     | Cow, calves aged and up                   |\n| 3rd   | T. Scott         | Cow, calves aged and up                   |\n| 4th   | D.B. Brough      | Cow, calves aged and up                   |\n| 5th   | R. Adamson       | Cow, calves aged and up                   |\n| 6th   | J. Thomson       | Cow, calves aged and up                   |\n| 7th   | Wm. Plaxton      | Cow, calves aged and up                   |\n| 8th   | J. Thomson       | Cow, calves aged and up                   |\n| 9th   | Wm. Plaxton      | Cow, calves aged and up                   |\n| 10th  | J. Thomson       | Cow, calves aged and up                   |\n\n| Class | Description      | Prize |\n|-------|------------------|-------|\n| 1st   | W. Macdonald     | Pig, sows aged and up                     |\n| 2nd   | Wm. Plaxton      | Pig, sows aged and up                     |\n| 3rd   | R. Macdonald     | Pig, sows aged and up                     |\n| 4th   | J. Thomson       | Pig, sows aged and up                     |\n| 5th   | Wm. Plaxton      | Pig, sows aged and up                     |\n| 6th   | J. Thomson       | Pig, sows aged and up                     |\n| 7th   | Wm. Plaxton      | Pig, sows aged and up                     |\n| 8th   | J. Thomson       | Pig, sows aged and up                     |\n| 9th   | Wm. Plaxton      | Pig, sows aged and up                     |\n| 10th  | J. Thomson       | Pig, sows aged and up                     |\n\n| Class | Description      | Prize |\n|-------|------------------|-------|\n| 1st   | W. Macdonald     | Piglets, aged                              |\n| 2nd   | Wm. Plaxton      | Piglets, aged                              |\n| 3rd   | R. Macdonald     | Piglets, aged                              |\n| 4th   | J. Thomson       | Piglets, aged                              |\n| 5th   | Wm. Plaxton      | Piglets, aged                              |\n| 6th   | J. Thomson       | Piglets, aged                              |\n| 7th   | Wm. Plaxton      | Piglets, aged                              |\n| 8th   | J. Thomson       | Piglets, aged                              |\n| 9th   | Wm. Plaxton      | Piglets, aged                              |\n| 10th  | J. Thomson       | Piglets, aged                              |\n\n| Class | Description      | Prize |\n|-------|------------------|-------|\n| 1st   | W. Macdonald     | Pair of native ponies                      |\n| 2nd   | Wm. Plaxton      | Pair of native ponies                      |\n| 3rd   | R. Macdonald     | Pair of native ponies                      |\n| 4th   | J. Thomson       | Pair of native ponies                      |\n| 5th   | Wm. Plaxton      | Pair of native ponies                      |\n| 6th   | J. Thomson       | Pair of native ponies                      |\n| 7th   | Wm. Plaxton      | Pair of native ponies                      |\n| 8th   | J. Thomson       | Pair of native ponies                      |\n| 9th   | Wm. Plaxton      | Pair of native ponies                      |\n| 10th  | J. Thomson       | Pair of native ponies                      |\n\nTENDERS WANTED\n\nFOR\n\nSTOCK AND BOOK-DEBTS,\n\nESTATE OF J. O. DAVIS & CO.\n\nThe Stock amount to about $8,000\n\nThe Book Debts amounts to about $2,300\n\nTenders in writing will be received by the undersigned up till the 31st inst. for the above.\n\nParties making other than a CASH offer will please state security.\n\nThe highest or any tender not necessarily accepted.\n\nPHILIP THOMAS,\nAGENT FOR Robert Dunn, Trustee.\n\nPrince Albert, Oct. 13th, 1888.\n\nA.W.R. MARKLEY,\nGeneral Agent and Auctioneer.\n\nNEW GOODS AT MEDICAL HALL\n\nBurdock Bled Bitters.\nBurdock Healing Ointment.\nBurdock Pills.\nVictoria Hypophosphites.\nVi to ia Bucha and Uva Uvr.\nFreeman's Form Powders.\nYellow Oil.\n\nPRICES TO SUIT THE TIMES.\n\nJ. M. CAMPBELL,\nLUMBER, SHINGLES,\nDOORS, SASH,\nMOULDINGS,\nAND ALL KINDS OF BUILDING MATERIAL,\n\nfor sale at lowest prices. We are now selling two Bankrupt Stocks for CASH.\nSend prices. No trouble sending prices. Parties making large purchases by mail will receive prompt replies received.\n\nDAVIS AND CO.\nWholesale Leather Dealers.\n\nAsh & Robbins,\n35 Hilton St., Brooklyn, N.Y.\n\nR. J. O'LEARY\nFIRE! FIRE! FIRE!\nPUMP ON WATER\nWalls Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co. will be promptly attended to.\n\nNATHANIEL ACORN\nPrince Albert.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884103101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6180, "total-output-tokens": 4826, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2023, 2], [2023, 8957, 3], [8957, 19022, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]