[{"id": "5e65baf7c93874b1419022a8a562e0c09c697118", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 26, 1884.\n\nBANKING HOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\n\nAGRICULTURAL SOCIETY\n\nA meeting of the Executive Committee of the Local Agricultural Society will be held at the office of Mr. Smith, Baker, Prince Albert, on Wednesday, the 1st inst.\n\nWednesday and Thursday, The 3rd and 4th of October, will be the dates for the annual fair, which will be held at the grounds of Mr. Smith, Baker, Prince Albert.\n\nThe fair will be open from 9 A.M. until 5 P.M., and will feature exhibits of livestock, vegetables, and other agricultural products.\n\nEXHIBITION\n\nPrice List\n\nHORSES\n\nClass I - Carriage horses, no pedigree\nSec. 1 - Pair, 3 years old and up\nSec. 2 - Pair in harness; 1st, 2nd, 3rd\n\nClass II - Mares or gelding in harness\nSec. 1 - Pair, 3 years old and up\nSec. 2 - Pair in harness; 1st, 2nd, 3rd\n\nClass III - Agricultural and general purpose horses\nSec. 1 - Pair, 3 years old and up\nSec. 2 - Pair in harness; 1st, 2nd, 3rd\n\nClass IV - Native horses, mixed blood\nSec. 1 - Pair, 3 years old and up\nSec. 2 - Pair in harness; 1st, 2nd, 3rd\n\nClass V - Native ponies, under 14 hands high\nSec. 1 - Pair matched team, special prize from Mr. Macleod; 1st, 2nd, 3rd\n\nCATTLE\n\nCertified pedigree must accompany entry papers for thoroughbred cattle.\nClass I - Bulls, 3 years old and up, must be giving milk or show signs of being in calf, except for heifers.\nClass II - Thoroughbred cattle\nSec. 1 - Bull, 3 years old and up; 1st $10, 2nd $8\nSec. 2 - Bull, 2 years old and up; 1st $8, 2nd $6\nSec. 3 - Bull, 1 year old and up; 1st $6, 2nd $4\nSec. 4 - Cow, 3 years old and up; 1st $8, 2nd $6\nSec. 5 - Heifer, 2 years old and up; 1st $6, 2nd $4\nSec. 6 - Heifer, 1 year old and up; 1st $4, 2nd $2\n\nClass VII - Grade cattle\nSec. 1 - Bull, 3 years old and up; 1st $8, 2nd $6\nSec. 2 - Bull, 2 years old and up; 1st $6, 2nd $4\nSec. 3 - Bull, 1 year old and up; 1st $4, 2nd $2\nSec. 4 - Heifer, not less than 5 cwt.; 1st $10, 2nd $8\n\nClass VIII - Fat and working cattle\nSec. 1 - Fat cow; 1st $8, 2nd $6\nSec. 2 - Fat cow; 1st $6, 2nd $4\nSec. 3 - Young working oxen; 1st $6, 2nd $4\n\nIn judging cattle, judges will test by moving the head backwards and forwards and strength alone to determine award.\n\nSHEEP\n\nClass IX - Any variety\nSec. 1 - Ram, aged; 1st $2, 2nd $1\nSec. 2 - Ram, sheepling; 1st $2, 2nd $1\nSec. 3 - Ewe, lamb; 1st $2, 2nd $1\nSec. 4 - Two ewes, aged; 1st $2, 2nd $1\nSec. 5 - Two ewes, lambing; 1st $2, 2nd $1\nSec. 6 - Two ewes, lamb; 1st $2, 2nd $1\n\nIn judging under 1 year the presence of the animal must be stated on entry papers.\n\nDOMESTIC MANUFACTURES\n\nMade in the District of Saskatchewan.\n\nClass XIX - Domestic manufacturers\nSec. 1 - Stockings, woollen, pair; 1st $1\nSec. 2 - Stockings, woollen, pair; 1st $1\nSec. 3 - Mitts, woollen, pair; 1st $1\nSec. 4 - Yarn, woollen, skein; 1st $1\nSec. 5 - Yarn, double twisted, skein; 1st $1\n\nClass XX - Leather goods\nSec. 1 - Boots, leather; 1st $1\nSec. 2 - Moccasins, leather; 1st $1\nSec. 3 - Moccasins, fancy; 1st $1\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nT. G. JACKSON'S LETTER.\n\nOur attention has been directed to a letter in the weekly Globe issue of the 11th inst., dated from Prince Albert, on the 16th, and signed by T. G. Jackson, whose efforts have been so manifestly aimed at the suppression of opinions intended as an expression of the writer's feelings angry towards our editor. Discarding as we do the unprofitable attempt that he before composing his epistle the writer had been more than a Tea getting Jackson, we can only say that when an old gentleman, who has been detected publicly declaring himself an unrestrained lover of nothing exhibiting any more strongly marked characteristic than that of an amiable stupidity, suddenly takes a fresh departure and rushing into print sets up as a full blown opponent of all calls of duty from him by such name naughty names as liar, his mental condition is clearly such as to afford ground for the gravest apprehensions as to his friendly attitude towards the best interests of the community, but we are well aware that the truth utterances of superannuated cranks and loud-mouthed ranters run the risk of sympathy from those who lack the power to help us, and who are doing so fast as can be expected under the circumstances. A few such letters as this of Mr. Jackson's would serve to bring Mr. Rich into possible further discredit than anything we can write.\n\nTHE EXHIBITION.\n\nIn our columns we have noticed the advertisements of an agricultural show to be held next month by the Local Agricultural Society in this town. This show will have one peculiarity which is not common with such shows as it will be the first of its kind ever held in this district, and we earnestly call upon the members of the community that it deserves to be held for the purpose of affording a beginning, in some respects, the annual weather during the spring and summer season at the exhibition of such splendid specimens of the productions of the soil as we can generally produce hereabouts, also showing means the best the country can do the samples will compare favorably with any in regions less generally favored. As a result of a postal ballot petition the arrangements have been entrusted to able and experienced men who have included in the prize list everything for competition which serves to be indicative of the prosperity of the agricultural development of the country. It is peculiarly necessary in the present condition of the country that the improvement of stock, both sheep and cattle, should be a subject of much attention, and the introduction of improvements beyond the power of any but a few individual efforts, and we trust that this society will make every reasonable effort possible to bring forward the best specimens of both from every part of the district, but will soon be in a position to claim substantial and from the Government.\n\nThe Prince Albert Times, a weekly paper, will be published every Thursday at Prince Albert, N.W.T. The Times will be edited by Mr. J. W. Jackson, and will contain news, views, and opinions on various subjects. The Times will also publish advertisements and classifieds. The Times will be delivered to subscribers at $2 per year.\nLorne Agricultural Society\n\nDistrict of Saskatchewan\n\nPatrons:\nHon. L. Clarke, and F. Swanson, Esq., members of the society.\n\nOfficers of the Society:\nAugustus Cooper, President.\nAndrew Spencer, Jr., Vice-President.\nWilliam Miller, Jr., 2nd Vice-President.\nCharles Adams, Secretary-Treasurer.\nThomas Scott, Auditor.\nWilliam Macdonald, Auditor.\n\nThe board is composed of twenty-six directors.\n\nRules and regulations:\n\n1. Any person desiring to correspond with the Secretary-Treasurer will address their communications to Charles Adams, Prince Albert.\n\n2. Entries must be in the hands of the Sec. Treas., not later than Oct. 25th.\n\n3. Fifty cents entry fee must accompany each entry paper for stock, and twenty-five cents for each article.\n\n4. Entries must be made on written forms.\n\n5. Any one may enter who will be allowed an exhibition in any section of any class other than live stock. No animal or article will be allowed to compete in more than two classes, unless the kinds of cattle which are shown separately, and with young and foals, which may be shown separately with their dams.\n\n6. On the receipt of entries each card will be prepared for each animal or article, specifying the class, division, and number of entry, which card must remain attached to the animal or its pen or stall at all times during the course of the period of the exhibition. When postal facilities permit, these cards will be mailed to interested exhibitors. Those who do not receive them may call upon the Sec. Treas.'s office in Prince Albert up to the day of opening.\n\n7. The grounds and buildings will be opened on Thursday the 25th of October. All exhibits, other than live stock, etc., must be brought to the grounds by 12 o'clock noon on Wednesday, Oct. 24th. Live stock must be on the ground and in pens by 8 o'clock a.m. on Tuesday, Oct. 25th. No animals or articles which are live stock shall be removed from the grounds until 6 p.m., Friday, Oct. 26th.\n\nThe grounds will be closed at 6 p.m., Oct. 26th, to facilitate the removal of exhibits. Exhibitors living in distant parts will be informed of prices awarded them.\n\n8. No exhibitors, or racks, or other conveyances containing them, will be admitted without a ticket, excepting those who have paid the entrance fee.\n\n9. Articles on exhibition cannot be handled except by the officers of the department to which they belong.\n\n10. Each exhibitor on being admitted with his entry tickets, will be given an admission ticket. The entry tickets on each animal or article will be signed by persons taking them to the grounds for examination, along with the animals or articles, without the use of any other tickets.\n\n11. Necessary attendants upon stock, and animals requiring accommodation, to be furnished with proper accommodations, for each day of the exhibition, with their names written upon them; such tickets will be issued only to persons who bring their teams at the gate only. The Sec. Treas. will be the person to whom to apply for such tickets, which, however, he must furnish by the close of the exhibition.\n\n12. Complementary tickets of admission or badges will be issued to the judges, secretaries, and others required to be present during the exhibition. Any one not having received their tickets prior to the opening of the exhibition, will be refused admittance at the Sec. Treas. on the exhibition grounds.\n\n13. The price of admission will be twenty-five cents each during the show, and no tickets will be issued unless the money is paid. No tickets will be issued unless the money is paid.\n\n14. In all classes of blood horses and pure bred cattle, full pedigrees, properly certified, must accompany the entry. No animals or articles will be accepted as pure breed unless they possess regular stud book pedigree or certificates of registration, and are correctly descended from such stock.\n\n15. Live stock must be in the hands of property of the exhibitor.\n\n16. The age of any animal shall be reckoned from the first day of January in the year of birth.\n\n17. No exhibit shall be awarded a prize unless it has been examined by a select committee of the society, or other qualified persons, and certified by him as being free from disease.\n\n18. Blood must be with the feet at least, or must give evidence of sickness, and must be found during the current year.\n\n19. Bulls must have a ring in their noses or otherwise properly secured to the administration of the live stock superintendent.\n\n20. Grain, roots, seeds, dairy produce, and all other agricultural produce, will be judged by the Agricultural Committee.\n\n21. The prizes will be awarded by the Executive personnel of the exhibition, and will consist of a card informing them of the fact of the award.\n\n22. In the absence of a question in any section, or if the stock or articles exhibited be of inferior quality, the Executive personnel will decide the matter, and will make their decision final.\n\n23. No person will be allowed to interfere with the judges while on the discharge of their duties. Any such interference will forfeit their right to competition, and the prizes which they may have won.\n\n24. Money prizes will be paid by cheque, which will be sent by mail to the winners from the date of the exhibition.\n\n25. Prizes will be awarded to the best of the entire class, and will be charged from that given on the entry tickets, and will be paid by the Sec. Treas.\n\n26. No exhibitor, or rack, or other conveyance, may be withdrawn by withdrawing prizes, except from the grounds, or under instructions as the Executive may direct.\n\n27. The management will take every possible precaution under the circumstances, to prevent the loss of property belonging to the exhibitors, and will not be responsible for the loss of any article, excepting the animals or articles which are live stock, and any property which, although in the charge of the officers, shall be liable to be removed by the officers or committees according to circumstances.\n\nHow to Make Candy:\n\nThis book gives full directions for making all kinds of plain and fancy candy. The recipes for making caramel, butterscotch, sugar, and all the other kinds of candies contained in this book are the same as used by the leading candy manufacturers, and will make them caramel at home, at least ten cents per pound extra.\n\nPostage paid by the author.\n\nCredit Valley Railway\n\nWhen going East:\n\nCanada Southern and Credit Valley Railways.\n\nThe Short Line to All Ontario Points.\n\nAll ticket agents will tickets on this new and popular line.\n\nJames Ross, Gen. Pass. Agent.\n\nThe Royal Route.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & North Western Railways.\n\nPassengers using the Royal Route have all accommodations of the Chicago, St. Paul, Minneapolis & Omaha and Chicago & North Western Railways.\n\nROYAL BAKING POWDER Absolutely Pure.\n\nThis Powder contains a most pure, pure, white and wholesome flour. Made from the finest flour, with the addition of a little salt, sugar, and cream of tartar.\n\nDecorative Painting & Specialty.\n\nChas. E. Page.\n\nNEW STUDIO!\n\nWm. Gordon\n\nEAST END NOTICE.\n\nI hereby inform you that all my accounts are now closed, and all parties interested in my business are requested to settle the same immediately, if not costs will be added.\n\nN.B.—On and after this date I will keep no book accounts. Terms strictly cash.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nOver 75 feet extra.\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nSPINK & MAVETTY, - PROPS\n\nRIVER ST., PRINCE ALBERT, SASK.\n\nPUMPS !! PHOTOSHOP\n\nMade and always on hand at greatly reduced prices.\n\nWaggons, Northboards and Rangiers repaired with moustaches and dispensed.\n\nWILLIAM CROSS,\n\nSign & Ornamental Painter.\n\nROBERT THOMSON,\n\nCalaminating and Paperhanging on short notice.\n\nWM. GORDON\n\nApril 1st, 1884.\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nFor green apples go to T. O. Davis, See T. O. Davis' new advertisement on this page.\n\nA party arrived yesterday for the Rev. Mr. McMillan.\n\nNovember 6th has been appointed a Thanksgiving Day.\n\nThis fall, the trees begin to feel it approaching winter.\n\nMr. Tom Taylor and family have gone on a visit to Duck Lake.\n\nMr. A. J. Davis, who only day arrived back from Butteville last week.\n\nA train of carts arrive at goods for T. O. Davis yesterday morning.\n\nMr. Wm. Brown left here Tuesday with six passengers for Toronto.\n\nBusiness is a little dull in town just now, the farmers being all busy at their harvest.\n\nMr. J. L. Johnson returned from his trip to the East, by mail on Monday evening.\n\nMr. Jac. Macintosh, accompanied by Mr. J. L. Davis, left for Saskatoon on Monday last.\n\nSportsmen ought to have a thrilling experience, but the prairie sodden is unusually so plentiful as they might be.\n\nMrs. Swanson, with some lady friends, has gone across the river to gather berries which we hear are very plentiful there.\n\nThe Sunday School, the first organiza-\n\ntion of the Western Industrial Soci-\n\nety, was formally opened by His Hon-\n\nour the Lieutenant Governor of Ontario.\n\nOn Saturday evening Mr. and Mrs. R. B. Way returned from their trip with her two children, and we are pleased to learn that the visit to the East has proved of much benefit to them both.\n\nMr. Thos. Stanhope accompanied by Messrs. Barker and Pratt, have gone out on a hunting excursion, and we pre-\n\nsume from their letters that they must expect to stay away some time and to bring back a lot of game.\n\nAs will be seen by the advertisement to this issue, the Winnipeg weekly Free Press offers special inducements to sub-\n\nscribers to keep up their subscription.\n\nEvery reader is asked to show appear-\n\nance, and the liberal offer of the publishers will no doubt be fully appreciated by the satisfied old Free Press readers.\n\nOur town is to build up to the propor-\n\ntions which it is to be urged in some cir-\n\ncumstances, must be directed in all directions by those who direct it.\n\nIt is always remembered that every effort made by the town council to beautify and make attractive this town is not going far to make the town attractive to set-\n\ntlers, as a great deal is to be done there.\n\nIn the meantime, however, while it must be remembered that only the election of the ablest men to overlook the operations of the town council can be met by promptly paid up taxes can ensure success, and that every citizen interested in the welfare of the town is most profitably invested.\n\nThe money in a house should be saved before it is spent, and the citizens should be taught to save money, and not to waste it.\n\nIt may be remembered that we have more than once expressed the hope that by the erection of parks and buildings of some kind, the citizens would be able to meet the wants of the community in a manner that would be most profitable.\n\nThe money in a house should be saved before it is spent, and the citizens should be taught to save money, and not to waste it.\n\nIn anticipation of the tax which has been promised us by the enterprising citizens, Mr. Thomas Stanhope has built a house for being the first to put a practical example to our settlers in this direction.\n\nNow, as we have said before, in the case, that tax would prove a good tax, and we fail to see how our motorists can re-\n\ntain their benefits to themselves and the public by buying a tax which cannot be imported, which they can buy and sell at far greater reasonable prices.\n\nThe ad-\n\nvantages to the town would be immense, if circulation here is strong, and Mr. Stanhope, who only came back names to work, will be able to make a good crop of all that goes to form the produce of pigs will enable farmers here and elsewhere to charge a higher price for them, but when the market is thus, that, in fact, pigs so cheaply as to defy outside competition.\n\nLOST IN THE BUSH.\n\nBillie Shingles' Troubles.\n\nAs our reporter was taking a stroll on Monday evening, he noticed a gentleman walking along the road toward the town.\n\nHe called him to himself. On a nearer approach, he found it was Billie Shingles.\n\n\"I beg to notify my customers and the public generally that I have REMOVED my stock to \"TRESTON HOUSE,\" and have now on hand a full line of Hardware, Stoves, and Stovepipes, at greatly reduced prices. All overdue accounts are now closed.\n\nT. J. AGNEW.\n\nESTATE\n\nJ. O. DAVIS & CO.,\n\nASSIGNED.\n\nI beg to call especial attention to the Stock of Linen, etc., which is being offered at great advantage, and ensure a quick and immediate sale.\n\nACCOUNTS.\n\nAll overdue not paid by October 14th, will be placed in the hands of an attorney.\n\nFOR SALE\n\nMARE AND COLT,\n\nP. THOMAS,\n\nAgent for Trustee,\n\nO. E. HUGHES\n\n& CO.,\n\nHAVE JUST RECEIVED A LARGE CONSIGNMENT OF Groceries, Gents and Youths Clothing.\n\nALSO A LARGE SUPPLY OF BABY CLOTHING ON HAND.\n\nKNOX & BARKER,\n\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\n\nNear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWells Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co's. will be promptly attended to.\n\nNATHANIEL ACORN\n\nPrince Albert\n\n$25 TO $50 PER DAY!\n\nVictor Well Boring & Rock Drilling Machinery.\n\nCan easily be made using the OLD RELIABLE.\n\nWe mean it and are prepared to demonstrate the fact. The WELL REPUTED SUCCESS which has been gained over others during the past fifteen years, and with the aid of the NEW VICTOR BITES, will be realized in every country in the world.\n\nOur Machinery is operated by either Man, Horse or Steam, and works very rapidly. Tiny range in size from\n\n3 Inch to 4½ Feet in Diameter\n\nand will bore and drill ANY REQUIRED DEPTH. They will bore successfully through any rock, gravel, clay, sand, etc., and will also dig wells for Water, Coal, Salt, Hard Pan Gravel, Lava, Bedding, Serpentine and Conglomerate Sandstone.\n\nThey are portable, light, easy to handle, requiring but little labor, light running, simple in construction, easily operated, durable and acknowledged as the best and most practical Machine extant. They are endorsed by tens of thousands of satisfied users throughout the world.\n\nPropagating for Coal, Gold, Silver, Coal Oil and all kinds of Minerals.\n\nAnd for sinking Artesian Wells and Coal Shafts, etc., they are unequalled. We also furnish Engines, Boilers, Windmills, Hydraulic Rams, Electric Power, Brick Ma-\n\nchines, Saw Mills, Flour Mills, Forge Mills, Dredge Machinery, etc.\n\nGood Active Agents wanted in every Country in the World.\n\nAddress,\n\nVIC. OR. WELL AUGER & MACHINE CO.,\n\n511 Pine Street,\n\nST. LOUIS, MISSOURI, U.S.A.\n\nBuffalo Hall!\n\nHosiery, Geves and Dress Linings, Ready-made Clothing and Table Oil Cloths Evaporated Peaches, Evaporated Apples, Prime Tomatoes, Choice Oat Meal, And Canadian Cheese.\n\nTOBACCO.\n\nPrince of Wales and Gold Flake Chewing, Myrtle Navy, Golden Rule and Big Bonanza Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nBUY YOUR HARVEST TOOLS\n\nAT\n\nJ. L. JOHNSON & CO.\n\nA FULL STOCK OF Hay, Manure, and Barley Forks, Scythes, Snaths, and Grain Cradles.\n\nAlso the best Machinery Oil for Mowers and Reapers now in the market.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\n\nBookseller and Stationer\n\nJUST RECEIVED\n\nA LARGE ASSORTMENT OF\n\nROOM AND PICTURE MOULDINGS.\n\nPICTURES\n\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884092601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 5689, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3059, 1], [3059, 6301, 2], [6301, 14884, 3], [14884, 22366, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]