[{"id": "f69f8386eb0b3685d5336bcca66c66e52a4fba3f", "text": "STOP!\nWM. SHANNON'S\nPrince Albert, N.W.T.\n\nWINTER GOODS\nAT COST FOR SALE, consisting of:\nMitts, Mo-casins,\nOverseas of all sizes,\nHosiery and winter-skins.\nGloves of all sizes.\n\nApplications will be received by the undersigned until March 1st for the position of Town Clerk for the Municipality of the Town of Prince Albert.\n\nJ. F. A. ST. CLAIR, Clerk.\n\nFebruary 18th, 1889.\n\nWILLIAM SHANNON.\nPRINCE ALBERT PHARMACY\n\nLadies! The composition of our cough syrup and honey is taking the best amongst the ladies. We have found that it is not only safe but also very effective.\n\nP. L. LAFOND\nDruggist and Chemist\n\nMILLINERY!\nNEW Winter Goods\nJUST RECEIVED AT\nMRS. A. S. STEWART'S\nDress & Mantle Making Specialty\nAnother Nice Lot of Watches, Rings, Sleeves Buttons, etc.\n\nSTRAVED!\nCambridge City, in possession of the Clerk, on the 26th day of January, 1889.\n\nThe owner, Mr. Davis, who was present, was unable to recover his lost property. After considerable searching, Mr. Davis recovered his lost property.\n\nThe clerk was instructed to advertise for applications to a treasurer.\n\nThe council then adjourned until Monday evening next at 7 o'clock.\n\nTHE NEW TREATY.\n\nThe special Indian commissioners, Mr. Irvine and Mr. Goulet, met Mr. McNeil, agent for the Government, and Mr. McNeil, agent for the Government, under command of Capt. Alexander Macdonald, who had been sent from Montreal Lake after the Indians had been removed from their homes in the Red River District to Fort Carlton in 1876. On their arrival at Montreal Lake some two hundred Indians were there, and they were given a hearty welcome in Indian fashion—firing off guns and band shaking. The Indians were anxious to see the new Territorial government, and the opening of June 1st was eagerly anticipated.\n\nThe balance of our winter goods will be sold at cost. We are offering a Grey Flannel Suit, $25; Blue Cap for Ladies, $3; White Cap for Men, $2; Woolen Overalls, $2; All other winter goods will be sold at cost.\n\nQUICK TIME.\n\nSold, hauled, and paid with, these goods. They are in good condition. And in quick time you'll get them.\n\nA half barrel of seeds and plants on sale. Seeds, both native and foreign. (N.Y.)\n\nWe have received a handsome catalogue from Steere Bros., Co., of Toronto. It is a list of 122 pages, profusely illustrated, containing seeds, flowers, and garden seeds. The Steele Bros. Co. are the oldest and most reliable seedsmen in Canada. See their advertisement in another column.\n\nNews has been received this week of the outbreak of an epidemic of typhoid fever in Prince Albert. In addition to the usual symptoms, there is a high fever, accompanied by nausea and vomiting. The disease is said to be caused by the consumption of contaminated water. The death rate is high, and many cases have been reported. The authorities are taking every precaution to prevent the spread of the disease.\nFRIDAY, FEBRUARY 22, 1869.\n\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAYEET\nAT PRINCE ALBERT N.W.T.\nTERMS—Per month, 50¢.\nSingle copies 5¢ each.\nBusiness Books 10¢ per line.\nTruckers—Please send us your notices for first insertion, and be sure for all subsequent ones.\nNo contracts made under three months.\nAll notices must be paid in advance.\nAdvertisements will be inserted until further notice.\nAdvertisements to be made for NEW YORK.\n\nFRIDAY, FEB. 22, 1889.\n\nAlthough we have for a long time been aware of the light in which this paper is held by a certain class of our citizens, we have refrained from taking any action for the express purpose. One reason for this was that we did not consider the opinion of those referred to as meriting attention, and another reason was that we expected to make such fundamental arrangements as would enable us to improve our facilities for publishing a larger and generally improved journal. In the latter we have been, so far, disappointed. We would ask those who are so ready to find fault and to require that it should be possible to carry on a newspaper or any other enterprise, without a certain amount of capital. Unfortunately, like most business men in Prince Albert, we have conducted our affairs too much on the credit system, and now when we want money we find it an utter impossibility to collect a cent. It is painful to reflect, too, that none of those gentlemen, who are so anxious to build up the finances of the Territorial government, stand on their books with large sums on the debit side of their accounts. If those parties were half as honest as they would wish to appear they would come forward and settle up, until they do so we will expect them to be in common decency to reserve their abuse. They should bear in mind that in order to secure the services of a good journalist we require money; it is a requirement that cannot be met by telegraphic news. If our delinquent patrons will kindly come forward and settle up, we will endeavor to make this paper the best in the Territories. If they do not, we shall have no alternative but to cease our depleted resources which may not be of the most pleasant kind.\n\nWhile the Town Council is engaged in legislating for the good of the ratepayers, and endeavoring to bring order out of the chaos of the past three years, we are sorry to see that there are a certain number of shrewd and sagacious leaders in town who lack of better judgment on account of a preference for idleness, would fail to realize the best efforts of the Council, by holding the members up to ridicule and endeavoring to create a feeling against them. To the individuals referred to we would say, mind your own business, or if you have none, then do not interfere with others. We do not say that the actions of the Council should not be criticized, or that they are not deserving of criticism, but there is a great difference between intelligent criticism and malicious slander; the latter appears to be freely meted out, and so far has been effective in its results. We will not hesitate to condemn the actions of the Council where we believe they merit condemnation, and we reserve to every ratepayer the same right. A great deal of harm has been already done by the idle talk which has been going on of late, and we regret that at times councils appear to be influenced thereby, mistaking such rubbish for public opinion. It is not public opinion. It is simply the vaporing of a set of individuals who have nothing else to do. To the members of the Council we say, do not give any heed to store or street politics, be guided by your own judgments and a healthy public opinion and do what you consider best for the municipality, and a discerning electorate will not be slow to approve of your motives and actions. A great deal of censure is heaped on the Council on account of its action with regard to the reduction of the salary. We hold that the Council acted rightly in the matter, first in reducing the salary, and second in making the appointment when they did. The Council, to all intents and purposes, had refused many late applications for positions, and it seems that it would not accept the office at the reduced salary. His friends, or would be friends, are entirely to blame if he was not appointed. We have heard it said that men who have more sense, and a higher self respect, that they would do all in their power to stir up strife in the Council and make it unpleasant for his Worship the Mayor as possible. Such feelings are the result of mischievous and nothing else. We hope that we will not be compelled to allude to this subject again, and that those who are prompted by the green eyed monster to create mischief will in future desist.\n\nEvery Night I Scratch'd\n\nUntil the skin was raw, body covered with spots like spots of matter.\n\nBy Cultural Remedies.\n\nI am going to tell you of the complete formula which I used for my cure. I applied it over my body, but thought nothing of it at first. After a few days I began to notice spots of matter spotted me, and who could have thought that they would grow? I would scratch every night until I could hardly move. I thought I was going off again. In vain did I consult all the doctors, and in vain did I try every remedy, giving up all hopes of recovery. I came near losing my life, but I finally chanced upon my drug, and obtained complete relief. I am now well and free of all disquietude by one, and am convinced that others will benefit by my experience before I begin to take the CULTURAL remedies. My case was extremely varied. My disease was uncommon, and I thought that I was going off again. I am now convinced that others will benefit by my experience before I begin to take the CULTURAL remedies. My case was extremely varied. My disease was uncommon, and I thought that I was going off again. I am now convinced that others will benefit by my experience before I begin to take the CULTURAL remedies.\n\nDUNN'S BAKING POWDER\nThe Cook's Best Friend\n\nCampbell's Tonic Elixir\n\nR. C. WIGMORE & CO.\nMen's and Boys' Clothing\nMen's Cardigan Jackets\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\n\nR. C. WIGMORE & CO.\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nImported Tweed Suitings,\nTrowsering and Overcoating\nWORSTEDS,\nIn English and American Lines,\nCANADIAN TWEEDS\nSUMMER SUITINGS\nIn all grades\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\nTERRITORIAL NEWS\n\nFORT MACLEOD.\n\nFrom the Gazette, Feb. 7.\n\nNo fire in the office and doors wide open since Monday morning.\n\nBlacktail has made its appearance among some of the birds in Montana.\n\nSome of the boys were playing baseball on the square yesterday afternoon.\n\nDr. McVean was out shooting today, shot 35 pairs of chickens, most of which he generously distributed among his friends.\n\nLord's discovery Royal was warmly welcomed throughout the west, and we understand, greatly pleased with his trip.\n\nCattle are in splendid condition. The pasture this winter is to keep young stock poor enough to prevent them from getting too fat.\n\nOn Monday morning the large and finely equipped stables of the Frank Strong estate were burned to the ground. There were about 120 horses on the property, including the fine stable at the MacLeod. The main stable was 120 feet long and contained 16 stalls. The well equiped privy stables in the territory. The loss is estimated at about $8,000 and the insurance about $2,000.\n\nEDMONTON.\n\nFrom the Bulletin, Jan. 29.\n\nThis lumberman gave his three hives of bees an airing on Wednesday, January 22nd, they flew away. As we have mentioned, the hives have been few days been, an abundant supply of honey and very little trash in the hives, except as far as the bees were not boarded. There was every prospect of the bees coming through the winter safely.\n\nSupt. Graham has arranged to distribute blankets and other articles of half-sacks at St. Albert. The conditions are that all who are able must work or make a contribution toward the expenses. The number of those to want is much smaller than last year and is confined entirely to such as were for months exposed to the intense weather, and who are weak, infirm people and children.\n\nThere is very little demand for barley at present, but there is plenty of supply. Buyers do not care to invest and farmers do not want to sell at present prices. The market is quoted at 40 cents for 50 and 40 cents for barley in trade. Wheat is in good demand for cash at $1.40 to $1.50 per hundred. The market for eggs was quoted at $1.10 to $1.15 per quarter. Fresh eggs, owing to the mild weather, are plentiful at 40¢ and fresh hens' eggs at 30¢ to 35¢ per pound.\n\nBATTLEFORD.\n\nFrom the Herald, Feb. 6.\n\nA man named Moses was arrested on Monday night for digging his wife with a shovel.\n\nA prairie fire was visible to the east of the Battle River reservoir on Tuesday night last week. It is a thing almost unknown in this part of the country.\n\nThe dressing camp that closed Saturday and Sunday fires on the ground and made a good foundation for the snow that fell on the place and got everything dry.\n\nDr. Ayton has just left on a tour amongst the Indians, vaccinating them. They are more than ordinarily keen about the matter, and Mr. Campbell will be able to take advantage of the opportunity when he returns.\n\nWe take pleasure in announcing that Mr. Campbell has requested an appointment for the summer season to be held over the Battle River. This will be the last season that this stream will have to be taken into account, because the permanent site will be completed in time to carry the surplus of next year.\n\nCALGARY.\n\nFrom the Tribune, Feb. 6.\n\nThe telegraph says that he was somewhat surprised at Montana's offer to lend us a plow for our use, as other grangers coming up quite green. Our experience in Kansas was one of the best things we ever had, and we are working hard now at gardening.\n\nDuring the last few days some of our farm hands have taken out their first load of hay. We are now getting ready for the spring planting, by which we mean to get our crops in early. We have got our seed in, and the land is now being prepared for the crops that are going to be raised.\n\nVICTORIA\n\nLivery and Boarding Stables.\n\nBetween Johnson's and Campbell's Store.\n\nHaving enlarged our premises to double their size, we would respectfully invite the patronage of the travelling public to their convenient location.\n\nWell and river water almost at the door.\n\nEASY TO USE.\n\nDrops three feet from the throat to the throat air passages, causing no irritation.\n\nSuch reductions for First Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE.\n\nCall and Examine Our Stock\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER-TIMS,\n\nFort Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nDuck Lake.\n\nOn Wednesday last at the residence of the bride's father, Mr. Andre Batoche, at Batoche, Mr. St. Jean Gervais was married to Miss Mary Louise Batoche. The ceremony was performed by the Rev. Pere Moulin.\n\nOver 150 cords of wood have been gathered here this winter.\n\nOn Tuesday last, the wife of Isadore McKay, of Carlton, died of fever. The deceased had only been ill for a few days.\n\nMr. Gordon, of Prince Albert, is thrashing in his district. Many of our farmers are talking about buying a new machine.\n\nJack McKenzie expects to have the new machinery in our grainmill running next week.\n\nOwing to the extremely cold weather the hail has fallen twice within a short time.\n\nWm. Stebbins, of S. C., is putting up a dwelling house for the Government telegraph operator here.\n\nOur postmaster agent, Mr. McFaul, has been indisposed for several days. The trouble is lameness. We hope he will soon be all right again as it goes well with him.\n\nJohn Todd, of Battleford, is visiting friends here. He reports times very dull up there.\n\nWm. Everett will finish his contracts here in a week or so when he will return to Prince Albert.\n\nFresh eggs begin to come in and are sold at 2½¢ each.\n\nA. H. Mitchell, of \"The Ranch,\" lost ten of his fine thoroughbred Plymouth rock hens, this week, by wolves. These animals were very plentiful this year, and very bold.\n\nThe weather for the past few days has been very cold, temperatures registering as low as 30° below zero in the night, and from 30° to 25° during the day.\n\nA Roman Catholic school district has been formed at Mart's Crossing and a meeting held where the directors decided to engage a teacher.\n\nTom Truax has not come to hand this week. He is said to be at Mr. Eliot's, the post office assistant.\n\nThis should be seen after as your numerous subscribers have been doing paper every week. We hear that Tom Truax was here on Tuesday evening last and is about reached Duck Lake on Wednesday evening—Ed.\n\nNews Notes.\n\nThe large stockoutake of the Electric Works at Brandon came down with a crash last week, while Smith & Sharlow were executing it.\n\nLatombeville is the ten-mile skating race at which the best time for survival cup. His time was 36 minutes and 32 seconds.\n\nMcGrath, who murdered Wm. Holley with a razor, was caught by Detective Capron and brought back to a house at La Chine and brought to Montreal.\n\nAn officer of the N. W. M. Police is to be stationed at Toronto to engage recruits for the force.\n\nA young man, named Johnson, living near Allan, Craig, attempted suicide by cutting his throat with a razor. His recovery is doubtful.\n\nPreston & Lee's general store at Bathurst burned. Loss heavy; little insurance.\n\nThe government of the Australian co- nstituted a commission sending two delegates to Australia to investigate the question of closer cable communication, including the question of Australia sending delegates to Ottawa.\n\nA monster railroad delegation, backed up by the city council of Toronto and Hamilton, visited the Government at Ottawa seeking aid for the Nipissing and James Bay and other projected rail- ways. The Government promised to take the matter into consideration.\n\nPetitions for the release of Wm. Kyr, at one time a wholesale grocer, were presented to the Government at Ottawa, serving five years in Kingston penitentiary for forgery, a crime in circulation in Toronto.\n\nA fire in the women's hospital at Ma drid caused a panic among the pa- tients, 43 of whom were undergoing treatment. One patient died, but others and nurses worked gladly to put out the fire, and succeeded in removing all the inmates safely.\n\nA three-year-old child of Mr. Gaucher, of Montreal, was burned to death by his dress catching fire from a stove dur ing the absence of his mother.\n\nThe Express Car—A very interesting trip was made by Mr. and Mrs. J. R. Murray in the Express Car, they can be secured at reasonable rates. Apply to Mr. Murray, 80, St. John Street, Brandon.\n\nRoyal Baking Powder\n\nAbsolutely Pure.\n\nThis is what Johnson's Fluid Beef claims to be.\n\nAnd its claims are fully authenticated by the highest medical and veterinary authorities in England and America.\n\nJohnson's Fluid Beef is the only beef fluid in existence containing the nutritive elements of beef, and is therefore a valuable addition to the diet of invalids and convalescents.\n\nThe J. A. Converse Co., Ltd., proprietors, Montreal.\n\nBRAND OF MANILA BINDER TWINE\n\nProminently by practical con- sumers, superior to anything in the Canadian market.\n\nWrite for information.\n\nCordwood, jute and cotton bags calcined and land plaster.\n\nAgents—Merrick, Anderson & Co., Winnipeg, Man.\n\nGrand Union Livery Stable.\n\nOpposition is the Life of Trade\n\nA First-class livery, Feed and Sale Station.\n\nWe would like to invite the public when visiting Prince Albert to give us a call. Our stable is located opposite the Prince Albert Hotel.\n\nWe have in our stable the finest and best Livery and harness horses in Prince Albert.\n\nWe have in all our horses and rigs—so- called—of the best quality and are prepared to make reasonable terms.\n\nWe find good, reliable and accommodating men night and day at our stable. We are always willing to lend a hand and always have done a good business. It is our policy to treat everyone fairly and equally, courteously obtained. This is something we stand by and will continue to do.\n\nApply to\n\nD. Pollock, Prop.\n\nCorner King and River Streets.\n\nFor Sale or Rent\n\nThe Leland House\n\nPrince Albert.\n\nFOR THE Best Assorted Stock of Confectionery\n\nGO TO H. McDougall's Bakery.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall Russell & Davis Wholesale and Retail Butchers\n\nBeef, Pork, Mutton, Sausage, Bacon, Ham and Game in Season.\n\nRussell & Davis River Street.\n\nT.J. Agnew\n\nHorse Shoe Store.\n\nGrand Clearing Sale of Winter Goods!\n\nNo Reserve. All must go. No matter what price, we must have room for Spring Stock.\n\nCall and get bargains.\n\nTHOS. O. DAVIS.\n\nDominion Illustrated\n\nThe only high class illustrated Canadian Weekly, gives its readers the best of literature, accompanied by engravings of the highest order. The Press throughout the Dominion has declared it to be worthy of Canada and deserving universal support; and its success and popularity lies in its steadily encroaching circulation.\n\nSubscription $4 a year. To clubs a number.\n\nSpecial arrangements made with Messrs. G. E. Desbarats & Son, Publishers, enable us to offer the Dominions Illustrated with the Prince Albert Times at $6 a year.\n\nSend your order (with cash) to The Times Office.\n\nFor Sale or Rent\n\nThe Leland House\n\nPrince Albert.\n\nFOR THE Best Assorted Stock of Confectionery\n\nGO TO H. McDougall's Bakery.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall Russell & Davis Wholesale and Retail Butchers\n\nBeef, Pork, Mutton, Sausage, Bacon, Ham and Game in Season.\n\nRussell & Davis River Street.\n\nT.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889022201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 5063, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2877, 1], [2877, 9701, 2], [9701, 14374, 3], [14374, 21280, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]