[{"id": "75075c7af09526980ecd4865e196a4f8af580c27", "text": "TERRITORIAL NEWS\n\nEDMONTON.\n\nFrom the Bulletin, August 6.\n\nImp. Carty of Edmonton has been granted a justice of the peace for the Territorial.\n\nWm. Anderson, Indian agent, is very ill and fears are entertained as to his recovery.\n\nGeo. Macnutt recently purchased 60 acres of H. Fraser's claim on Rat Creek, adjoining the town, for $1,000.\n\nTupper's telegraph poles for the line between Edmonton and Battleford have nearly all arrived at Battleford at last. It is feared the contract will be a losing one.\n\nHalf a million of new logs have arrived for Fraser & Co., up to date. The remainder of a million feet will be brought down and sawed this season.\n\nK. A. McLeod has a contract for carrying the Fort Saskatchewan from Edmonton to Fort Saskatchewan. He is building a raft on which to transport the material.\n\nThe new telegraph line has been completed from Pitt to Stoddle lake. When the line is completed from Stoddle lake to Victoria the line will be completed from Edmonton to Battleford.\n\nThe live cattle required for the next year's market in Edmonton, Peace River, and Victoria have all been purchased in the district. They comprise six cows, six oxen and two bulls.\n\nBATTLEFORD.\n\nFrom the Herald, August 18.\n\nImp. Brookes and constable Gibson got in from Regina to Battleford. They came over by way of Saskatoon.\n\nJohn Craig got a contract for supplying thirty-five tons of hay required by the telegraph service here at eighteen dollars a ton.\n\nThe Messrs. Prine have bought all the timber Mr. Lamontagne had here and a thousand additional feet yet to come down the river.\n\nThe area covered by the hailstorm last week was one mile in width by eight in length. It severely touched three or four farms in its course.\n\nMr. Lamontagne has all but bought the Gulf Company's steamer Minnow, as well as the steamer Minnie, from Mr. and Mrs. Edington and hopes to have her at Edmonton this season. He will go to Medicine Hat to make some repairs to her, and if she fails will bring her over to the south branch.\n\nA Mounted Police party is making a tour of the Indian reserves.\n\nQU'APPELLE.\n\nFrom the Progress, August 18.\n\nQu'Appelle Council of Royal Temples of England. There were five members present.\n\nFarmers who were disheartened by last fall's crop are now looking forward to a good harvest this year. They have been buying more than usual quantities of seed.\n\nMr. P. J. Williams, in charge of the post office, has been very busy during the past few weeks.\n\nBRITISH COLUMBIA.\n\nFrom the British Columbian, August 18.\n\nWhen the steamer Empire returned from all out by the end of last month.\n\nCorporations have been formed under the new act, and many are doing business.\n\nPRINCE ALBERT\n\nBREWERY!\n\nPure and Sparkling\n\nAMBER—(Hop)—ALE,\n\nDelivered to all Parts of the Town.\n\nMcINTOSH & GERROND\n\nRUSSELL & DAVIS,\n\nWHOLESALE & RETAIL\n\nButchers.\n\nBeef, Pork, Mutton, Sausages,\nBacon, Ham and\n\nGAME IN SEASON.\n\nBranch Stalls—Qu Appelle Station,\nFort Qu'Appelle, and Prince Albert.\n\nRUSSELL & DAVIS,\nBROWNS BRICK STORE\n\n\"BELL\" ORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Rowell & Co., Newspaper Advertising Bureau, 10 Murray St., New York.\n\nThe Morning Call\n\nOnly Conservative Morning Newspaper in Manitoba or N.W.T.\n\nFull cable and telegraphic reports of current European, Canadian and United States News.\n\nSpecial news reports supplied by resident correspondents throughout Manitoba, the North-West Territories and the United States.\n\nComplete reports of Parliamentary proceedings.\n\nThe Morning Call also receives the night dispatches of the United Press and Associated Press, and has a news service unequalled west of the great lakes.\n\nSubscription rates: One year $5; six months $3; three months $2. Strictly守信守约，免费提供任何地址信息。\n\nSubscribe now. Address\n\nThe Call Printing Co., Winnipeg.\n\nACTION BURROWS,\n\nPresident and Director-General.\n\nJOE PRINTING\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETY,\n\nPublisher and Proprietor.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nNish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Lath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nDEATH OF MR. A. MACARTHUR.\n\nIn speaking of the late Mr. MacArthur of Winnipeg, brother of Mayor MacArthur of this town, the Morning Call says:\n\n\"It was with feelings of profoundest regret that the news of his death received on Sunday of the death, early that morning, of Mr. Alex. MacArthur.\n\n\"To the balance of his life he gave an institution of inestimable scientific and historical benefit, not only to this city but to the whole Dominion of Northwestern Canada, and well may he be regarded the father of scientific research in this country. Possessed of a retentive memory, great abilities and vast powers of research and minute observation, his vigorous and checkered life, every day of which may almost be said to have contributed from his earliest youth to the extension of knowledge, all of which he devoted to promoting the best interests of the institutions with which he was connected. Possessed also of a singular energetic temperament, in its closest detail his life contained more than thirty years of age, and came to Winnipeg in 1869, where he engaged in the business here until 1875, when he assumed the management of the Manitoba Farmers' Association. The latter firm he sold until last year. Before coming to this country he was employed in the Hudson's Bay Company's service at Montreal, and was engaged in several trips between that city and Winnipeg by dog train. He was a great student of natural history, and had collected large amounts of M.R.S., relative to events connected with the Hudson's Day Company's operations. He wrote a book called \"Birds in Manitoba,\" which appeared in the Manitoba in the spring. In the earlier part of his life he was very well informed on all topics relating to the present and past of this country as well as the habits of the Indians and culture. Last winter he made a trip north for the purpose of studying the habits of the bear, moose, and other animals inhabiting the extreme north of the continent, but had to return owing to the failure of his travelling arrangements. He took a prominent part in the Red River relations, on both sides. At one time he was very wealthy, having lost a great deal of money in the boom. He appeared at the time of Union that he was a bachelor of the Commercial Bank of Manitoba.\n\nPUBLIC NOTICE.\n\nLarge meetings of Irishmen were held Sunday in Liverpool to protest against proposals to reduce the Irish vote.\n\nA Socialist mass meeting held in New York on Sunday night denounced the United Labor party.\n\nA man who had written in behalf of Prince Victor Bonaparte by Clement de Royer was read at all Bonaparte meetings. The man said that he knew that Prince Victor intends in future to be the spokesman of all Imperialist committees in France. He continued: \"By my friend Prince Victor, I am to go back to communicate with the committee in Paris and the deputies under his personal direction. We shall see if the centrist movement is successful. The policy of Prince Victor is destined to restore the Empire.\"\n\nThe Gazette of India states that King Humbert, through his chaplain, is bound to send a reply to the king, which will accept a liberal peace from the King. If the Pope consents, the King's brothers, Prince Umberto, and others will also sign the offer. The Duke of Portugal and Princess Clotilde, and send their reply.\n\nReplying to a question by Sir Robert N. Fowler, member for London City, in the House of Commons, William L. Jackson, the minister of Lewis, the secretary to the treasury, stated that the sum included in the supplemental estimates for the current year for expenses connected with the Newfoundland fisheries dispute did not embrace any claim for the late Government had refused to sanction.\n\nThe special committee appointed by the war office to examine and report upon the small arms in the country has decided that the calibers of military rifles should be reduced, and the decision will take effect of decreasing 100,000 new Martini-Henry rifles, of which there are not yet been issued from the arsenals.\n\nLOCAL NEWS.\n\nMr. George Mills returned home from Winnipeg this week.\n\nMr. J. B. Smith, who was away on Town Council work, returned yesterday. A street opened across river lot 72, but not yet the sidewalks in abeyance. Whose fault is that?\n\nWe desire to apologize to Mr. P. C. Baker for inadvertently omitting his name in our last issue from among the citizens who took part in the team match at the Rifle Association meet.\n\nMr. R. J. O'Day, who took part in the meet, was obliged to leave the jurisdiction, left on Wednesday by mail stage for Baillif, where he hopes to be relieved of trouble by the hot springs of that place.\n\nThose interested in the formation of a large and great million dollar company are requested to attend a meeting to be held Saturday evening, 3rd inst., at 7 p.m., in the Council Chamber, for the purpose of discussing the project.\n\nAt various exhibitions held in eastern Canada, some of the most attractive features were the displays of the Northwest. It was thought that something might be done in that way to encourage and instil enthusiasm among the people of the Northwest.\n\nAs our agricultural societies are not yet able to offer sufficient inducements to the farmers, the North West Council might appropriate two or three hundred dollars for that purpose, so that a fair might take place at Regina some time this fall.\n\nThe Northern Pacific has made arrangements for a fast ocean service to connect with the Canadian Pacific.\n\nRoberts, the Bishop, $100,000 debt, is in Montreal with a return of detectives, and likely an attempt will be made to extradite him for bringing stolen money into Canada.\n\nPUBLIC NOTICE.\n\nBy the Trustees of Collation School District No. 9 of the North West.\n\nWhereas it is deemed expedient by the Trustees of Collation School District No. 9 of the North West, that the security of the said school District, and the safety of the children attending the same, for the following purposes, namely: To provide a teacher for the said District, to give a week and paying the cost of the same, and to provide a teacher for the said District, that the Trustees of Collation School District No. 9 of the North West, do hereby declare that they are willing to make an assessment of the said District, that I am not an unenfranchised Indian, that I have not recorded any warrant, either direct or indirect, that I have not paid any tax, and that I am willing to pay the taxes assessed on me.\n\nW. MAXTON, Chairman.\n\nN. H. ROBERTSON, Trustee.\n\nDated at Collation, Prince Albert, in the Province of Saskatchewan, this 2nd day of August, 1887.\n\nGRAND UNION LIVERY STABLE.\n\nOpposition is the Life of Trade\n\nA First-class Livery, Feeds and Stable Stables\n\nFor hire at reasonable rates.\n\nWe have a number of horses for sale in Prince Albert to give us a trial. Our prices are very low, and we are prepared to deal to Queen's Hotel and Ford stable in town.\n\nWe have a number of horses and rigs, suitable for hire west of Winnipeg—to hire on any terms.\n\nYou will always find good reliable horses and wagons for hire at reasonable rates.\n\nAll our horses are first-class livery horses, and we are prepared to give them the best turnout in town at the lowest prices.\n\nJ. R. McPhail's\n\nMachine Oils,\n\nAmerican Coal Oil\n\nLow Prices. Good Value. Prompt Attention\n\nAT\n\nJ. R. McPhail.\n\nRobertson & Robertson,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF\n\nImported Tweed Suitings,\n\nTrowsering and Overcoating\n\nWORSTEDS,\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS\n\nIn all grades.\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1887090201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 2954, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 4641, 3], [4641, 12339, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]