[{"id": "bc473518d6ff561f361c3e10512d1e34d5988dc9", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, DECEMBER 21, 1886\n\nBANKINGHOUSE OF\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nXMAS COMING AGAIN.\nFancy Groceries for Xmas\nFancy Goods for Xmas\nPresents for Your Girl\nPresents for Your Fellow\nAt R.T. GOODFELLOW'S\nCONFECTIONERY STORE\n\nTOWN COUNCIL\n\nNOTICE.\n\nThe council held an adjourned meeting and which is likely to be their last meeting on Monday evening last. Coun. Stewart gave notice that he had received no communication from any member of the council regarding his position paper. Aged Mr. Davis, John Knowles, and McPhail.\n\nThe following by-laws were granted:\nLicensees: R. Stanley, P. Robertson, and W. W. Clark.\nAssessment and Assessment Committee recommend the following accounts be paid:\nDonation and Provident Fund, $50.\nJ. J. D. Smith, $70.\nH. Buckley, $50.\nJ. D. N. Smith, $100.\nJ. C. McNiven, Lindsey.\n\nNEW BAKERY\n\nI beg to inform the public that I have opened a new bakery at Prince Albert, N.W.T. I am now prepared to supply all classes of customers with the best quality of bread and fancy cakes.\n\nBread and Fancy Cakes, Xmas and Wedding Cakes\n\nPRINCE ALBERT PHARMACY\n\nWINTER SUPPLY OF DRUGS, COMPOUNDS, AND PATENT MEDICINES\n\nJUST RECEIVED.\n\nShould you be suffering from a bad cold or cough, please call in and see Mr. Smith, who will prescribe a compound syrup to soothe your throat.\n\nStill Selling at Cost.\n\nP.L. LAFOND\nDruggist and Chemist\n\nMILLINERY\n\nNEW Winter Goods\n\nJUST RECEIVED AT\nMRS. A. S. STEWART'S\nDress & Mantle Making a Specialty\n\nAnother Nice Lot of Watches, Rings, Sleeves, Buttons, etc.\n\nTHE EXCELSIOR LAUNDRY\n\nGIVEN & STAPFORTH\n\nBoots and Shoes\n\nYour goods are noted for their faultless workmanship.\n\nOur boots are made of the finest leather and are sold at moderate prices.\n\nAPPLICATION TO THE PARLIAMENTARY OFFICE\n\nApplication will be made to the Parliament for the purpose of obtaining the necessary Acts extending the time for completing the Canadian Pacific Railway between Portage la Prairie and Edmonton, and also for the extension of the railway westward from Edmonton to the Pacific Ocean.\n\nThe Government has been asked to consider the interests of Canada and to ensure the completion of this great national enterprise.\n\nThe Government has been asked to consider the interests of Canada and to ensure the completion of this great national enterprise.\n\nTHE ISLAND HOUSE\n\nPRINCE ALBERT\n\nFOR SALE OR RENT\n\nThe partnership house of MCINTOSH & GERMOND has been dissolved. All debts owing to said partnership are to be paid to James Germond, who will settle all claims presented to him against the property.\n\nDATED 30TH NOVEMBER, 1886.\n\nMcINTOSH & GERMOND.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporter.\n\nA MERRY, MERRY CHRISTMAS TO ALL.\n\nT T T. Try again 40t. Waltons & Burrows.\n\nPacket and Office Orders for 1887 at Capt. Hackett's.\n\nIndian Agent McKenzie and son, of Duke Lake, are here.\n\nFarmers' Festival of Boncher, in town after Christmas supplies.\n\nMiss Hughes, of Louis Lake, just in, is touring the district with Mr. H.W. Indian Agent and Miss Finlayson, of Metamora's Festival, are in town.\n\nCapt. Hackett, of L.A. Lake, returned from Regina this week.\n\nMr. Paxton, M.L.A., arrived home from Regina this week.\n\nThe Band of Boncher is engaged in the celebration of Christmas this year.\n\nThe members of St. Alban's Church are busy engaged decorating the church for Christmas.\n\nThe band of Boncher have decided to postpone their annual festival until next summer at least.\n\nThe Band of Boncher will be held in St. Albans's Church on Christmas morning will be full crowd. An annual event.\n\nThe Band of Boncher, the popular pub-\n\nlisher of Boncher, are able to resume their duties after a short illness.\n\nThe Rev. Mr. Howard has returned to his parish of Boncher, which has just been built beside the church.\n\nJudge Maclean arrived home from Regina this week, having been attending the Supreme Court to hear the case of the Governor and Turkey before Judge Duff, who have just heard a hearing in the case.\n\nJ. Leckie, M.D., is leaving and returning to the East, where he will attend to his practice.\n\nThe nomination for mayor and councilmen, for the ensuing year, takes place this week.\n\nSgt. Duffield, of Regina, arrived in town by stage, this week and will be engaged in the election of the new tropics here as sergeant-major of the police force.\n\nAll kinds of goods at Wholesale prices.\n\nThe new post office building is now complete.\n\nS. M'CLEOD & CO.\n\nFor Sale\n\nTHE ISLAND HOUSE\n\nPRINCE ALBERT\n\nFOR SALE OR RENT\n\nThe partnership house of MCINTOSH & GERMOND has been dissolved. All debts owing to said partnership are to be paid to James Germond, who will settle all claims presented to him against the property.\n\nDATED 30TH NOVEMBER, 1886.\n\nMcINTOSH & GERMOND.\n\nADVICE TO MOTHERS.\n\nIf you want your children to be healthy and happy, give them plenty of fresh air and exercise. Make sure they get enough sleep and eat a balanced diet. Encourage them to read and write, and help them develop their talents and interests. Remember, a happy child is a healthy child.\nCHRISTMAS\n\nThe Times wishes its readers and the public generally a happy and merry Christmas. It trusts that for those dear ones who have been deprived of a time of enjoyment, match may happen unalloyed with any pain or sorrow.\n\nThe Christmas season is emblematic of happiness, and while there are many who are blessed in that respect, many others may be others who are not so fortunate. There is no apparent poverty in our midst, but it may exist, and at this season of the year especially it is the privilege, nay, the duty of those who are circumstantially able to minister to the wants of the needy and help to make their Christmas as happy as possible.\n\nChristmas is celebrated by all branches of the Christian Church as the birthday of the Saviour. Various names have been given to this festival. Our own \"Christmas,\" comes nearest to the German \"Christfest.\" The Romance language contains the word which the French designate as \"Noël,\" a word which was used as a cry of joy and was sung during the eight days preceding Christmas.\n\nThe Welsh name is \"Nôl-gwyl,\" which is from the words \"noel\" in Irish Christmas. We collect \"Nol-liga\" from Natalie, and we have to search \"Yule\" and the modern \"Jind\" from Jules, to be merry.\n\nAs commemorating the birth of Christ it is a religious festival. But in the popular application, its religious character has given place to one of a social and charitable nature. It is the feast of good fellowship, with a religious sanction. Nowadays, although the form of Christianity, it has become practically the feast of Santa Claus—the patron of children. Christmas has been kept from the earliest times as a period of rejoicing. In the first three centuries of our common era, the feast of the Saturnalia, prior to the later days of the Roman Empire that fest developed into a low debauch, and in order to counteract the evil tendencies of the Saturnalia, religious observances were sought to rise of heathen festivals and to render them subservient to the cause of religion. In Britain there were other modifications; to the reformed Saturnalia were added first some of the Druidical rites and later some of the ceremonies of the ancient Germans and Scandinavians. Of these were the turning of the yule log and the superstitions of the mistletoe bough, both of which have survived in England.\n\nOur able contemporary the Regina Journal, in its issue of the 6th inst., has an excellent article on non-denominational education, which will certainly not fail. The separate school system is an unspeakable injustice and should be wiped out; there is no good reason why Protestant and Roman Catholic children should not attend the same schools. Religious instruction should be kept out of our common public schools and only secular branches of knowledge taught. In such a case there could not possibly be any excuse for the existence of separate schools and the home circle should be sufficient means of imparting religious instruction. The Bible might very properly be kept out of the public schools, let it be taught by the church and the family. This is more difficult, and at the same time important question than this to grapple with, but we feel that it should be taken hold of and solved if a solution can be found, and we believe with the feeling that the secularists, instead of wasting time on such less important questions, shall devote a portion of their time to a consideration of this vital question. As we cannot settle it here, our attention may have been called at Ottawa.\n\nGO TO AGNEW'S FOR Stoves Stoves Heating Drums Stovepipe Coal Oil T.J. AGNEW W.STOBART & CO Indian Traders AND General Merchants\n\nFOR THE Best Assorted Stock on CONFECTIONERY GO TO H. M'Dougall's BAKERY.\n\nH. MACDUGALL\nTHE BAZAAR.\n\nThe bazaar held last night in aid of the funds of the St. Albans Band was one of the most successful affair of the kind ever held in Prince Albert. Mr. J. A. Jackson kindly placed his residence at the disposal of the band, and no better place could have been found for the purpose; the store, although not quite finished, was nearly filled up with articles of all kinds and the walls decorated, while the rooms in rear of the store served admirably as a kitchen and refreshment-room.\n\nA very large and varied number of musical and fancy articles—the result of the labors of the St. Albans Ladies Aid Association—were offered for sale at very reasonable prices, and to our ready purchasers in the good people of Prince Albert, who came in considerable numbers throughout the afternoon and evening in large numbers. The bazaar was opened at one o'clock by Mr. Jackson, who made a short speech appropriate to the occasion.\n\nThe ladies of the Association acted as stewards and judges from the results of their labors, and although some of which their work disappeared, they were in every respect a success as such. Refreshments were served throughout the evening from which a good sum was realized. The P. A. C. Band attended at the evening and played some selections in a very creditable manner.\n\nWe understand that the net proceeds of the bazaar will be about $170.\n\nAfter dinner the ladies of the band and of the young people took advantage of the presence of the band and the fine music and indulged in much social dancing.\n\nPeople are very highly pleased with the bazaar on the ground that they are helping charity, but that the charge cannot hardly be called high. The bazaar was held in this town; in every case where it was held it was to buyers and very often more than twice what was charged at the door of St. Albans Church on the occasions which attracted their effects and which we well deserved.\n\nDUCK LAKE.\n\nThe settlers of this district will meet Mr. Mitchell, our member of the District Assembly, next week, and it is expected he will be given a dinner here. He is expected here on Sunday week.\n\nLast week while Anderson was bringing in the new mill machinery one of the axes broke under the boiler. Mr. Anderson had to return to Troy for a new one.\n\nA very successful school examination took place here yesterday.\n\nA meeting of the Board of Mr. O. Nolin, was held on Tuesday last. The object being to appoint Mr. Buteche a delegate to Ottawa in the interests of the Metis. Only five members present.\n\nAmong those interested at the Duck Lake house this week were: Messrs. J. Clark, W. H. Smith, Mr. J. W. Cox, well of Chief's Committee, Richey, Mr. Lacombe; J. Lovell and J. McIntosh, of Fish Creek; Mr. Qu'Appelle; Louie, Peterman, Lovell, Mr. J. M. Causeur, Mr. Willsburgh and Rev. Monsignor Buteche.\n\nOn the Wednesday Mr. W. P. Taylor, son of J. Pools of the Ridge, near Prince Albert, was accidentally shot at Rosser's settlement by Mr. Buteche. It appears that two guns were discharged in attempt to kill a steer. Peter Taylor loaded one with blank and the other with live. On the following day Walter Taylor, aged fourteen years, and young Pools, on returning from some work, went to where the animals were kept. When Peter Taylor picked up the shorter one, cracked it when it went off killing young Pools in the face. He tried to save his life and died within a short time. At the instant no evidence could be elicited as to who loaded the gun. It is said that young Pools did it himself. The body was taken to Rafflewood where it was interred in the English Church cemetery.\n\nWeather fine and cold. No snow yet.\n\nGair's Comic Almanac.—This well-known almanac continues to be in the bookstores. For ten cents a year, and only \"Comic Almanac has delighted her people, and the number is in reality the only thing she has. These pages are unique and ingenious; the double page covers, \"Impossible Tag of War,\" are amusing; there are several full-page cartoons of no mean merit and any number of joke-splitting illustrations. The latest number is eagerly read. It will soon appear that any number of—modest tax for so enjoyable a magazine, surely.\n\nHORSE SHOE STORE.\n\nStatistics state that there are nearly one-third more women than men in the world; if the feminine increase keeps up at its present rate, a man child will soon outnumber the females. In this case, if the present rate continues, I have the best dress-room, and better still, the near approach of Xmas, I have decided to sell my stock of\n\nBOYS' OVERCOATS AT COST.\n\nGive us a call and convince yourselves that we have\n\nThe Only First-class Stock in All Line; in the Saskatchewan, so please remember that if you fail to find your requirements elsewhere, come to the Horse Shoe.\n\nTHOS. O. DAVIS.\n\nTHE GLOBE CHRIST NUMB\n\nREADY FIRST WEEK IN DECEMBER.\n\nGREAT HOLIDAY PAPER\n\nType, New Press, Fine Paper, Five Handsome Lithographic Plates, First-Class Illustrations, Original Matter and Superior Workmanship.\n\nTHE BEST XMAS PAPER EVER ISSUED IN CANADA\n\nThe literary matter in the CHRISTIAN GLOBE will be entirely original and will contain stories from the ablest pens in Canada. The subjects treated will be wholly Canadian.\n\nFIVE HANDSOME LITHOGRAPHED PLATES accompany the paper, the principal being a scene from Vancouver Park, B.C., from a painting by Mr. R. O'Brien, and others from the same source.\n\nMECHANICALLY THE XMAS GLOBE will be in every way first-class and to be had at every news-dealer having it supersede anything of the kind hitherto published in this country.\n\nAS THE DEMAND will be very great, we would advise our subscribers to be sure to order early, either by mail or direct to this office, as there will be less than the end of the present month, as the supply will necessarily be limited and the price will undoubtedly be raised.\n\nThe price will be placed at ONLY SIX CENTS PER COPY.\n\nIt is intended to have the edition ready the first week in December in order to allow plenty of time for mailing copies long distances as to our distant subscribers.\n\nTHE WEEKLY GLOBE, the best family paper in Canada, and THE MUNAL CANADIAN, the best agricultural paper in Canada. Both from now to end of 1889 only 6½¢.\n\nRUSSELL & DAVIS\n\nWHALES-AND-DEAL\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nPork, Ham and\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\n\nRIVER STREET.\n\nVICTORIA\n\nLivery and\n\nBoarding Stables\n\nBetween Johnson's and Campbell's Stores.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of the travelling public to our commodious stables.\n\nWell and river water almost at the door.\n\nWe have also added some fresh horses to our stable, and assure the public can expect getting an old horse in the shape of a well-bred animal, at reasonable prices.\n\nBoarders taken at reasonable prices.\n\nN.B.—Our rigs are new, and not liable to breakdowns.\n\nNEILSON & McBEATH\n\nBOOK STORE.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888122101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5858, "total-output-tokens": 3814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5095, 1], [5095, 8837, 2], [8837, 8837, 3], [8837, 15758, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]