[{"id": "8dfe12368273461b79bafe61cef5e8831b190274", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, NOVEMBER 27, 1856.\n\n$2.50 A YEAR.\n\nDRESS MAKING\n\nMiss McGuire wishes to inform the public of Prince Albert and the surrounding country that she has opened out a Millinery, Dress Making and Millinery Factory in Campbell's Block, where she is prepared to undertake all kinds of work connected with the business, and guarantee satisfaction.\n\nMiss McGuire,\n\nCAMPBELL'S BLOCK.\n\nJUST OPENED.\n\nPOST OFFICE BOOKSTORE\n\nThe Finest and Most Complete Stock of Books and Stationery\n\nin the Territories\n\nA Call is respectfully solicited\n\nE. J. CANN.\n\nMSS MACK & CO\n\nJUST RECEIVED:\n\nA large assortment of Ladies' and Children's\n\nTrimmings, Velvets, Felt, Velvet and Satin Hairs, Hat and Bonnet Shapes, Feathers, Flowers, Ribbons, Jet Lace, Ribbons, Satins, Velvets, Pins, Caps, Ruffles, Ruffs, Cloaks and Umbrellas, Curves, Wraps, Glaces, Hosiery, Buttons, Lining, etc.\n\nAt lowest prices possible. Come and see.\n\nFURNITURE!\n\nCHEAPER THAN EVER.\n\nGILBERT E. CARTER\n\nCITY BILLIARDSALOON\n\nCorner Church and Nesbit Streets\n\nChoice Beer and Cigars always on hand\n\nA. W. R. MAKEY\n\nGun Agent and Auctioneer.\n\nAGENCY:\n\nCalif. Firestone Life Association, Toronto.\n\nManufacturing Co. of New York.\n\nLicenses of Marriage and Billiard Table Licences.\n\nOffice - In Mr. Brearley's Office.\n\nNOTICE!\n\nOn account of my recent loss by fire, I must request all those indebted to me to call and settle their accounts immediately.\n\nI will be found for the present in A. L. Hilton's law office, next door west of Stewart's store.\n\nT. E. JACKSON.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter\n\nPainting and Paperhanging on short notice.\n\nDecorative Painting a Specialty\n\nA. GOODFELLOW,\n\nPrince Albert, M.W.T.\n\nWAR DECLARATION\n\nW. C. RAMSAY\n\nWould respectfully inform his friends and the public generally that he has been called to the bar of the Provincial Court of Saskatchewan, and has removed his residence to River Street, near J. L. Johnson's hardware store, where he will continue to practice his profession, charged for breakfasting and general blacksmithing. A trial is specially arranged.\n\nEAST END BAKERY\n\nBREAD UNTOUCHED BY ANY HAND\n\nHugh McDougall,\n\nEast End Bakery.\n\nALEX. LANG\n\nGENERAL BLACKSMITH\n\nHandyman in the most direct and satisfactory manner. All kinds of Farm Machinery Repaired and put in order.\n\nPRINCE ALBERT\n\nPlaning Mills and Saw and Door Factory\n\nNestor and Mackay Co.\n\nManufacturers of Planing Mills, Barn Doors, Windows, Shutters, and Builders' Furnishings under the name of Nestor and Mackay Co.\n\nA. GOODFELLOW,\n\nPrince Albert, M.W.T.\n\nTHE EXECUTION\n\nIndians Hung at Battleford\n\nThey sang their last death song and are now dead to die.\n\nSpecial Telegram from The Times, Battleford, Nov. 30.—The morning was dark and gloomy.\n\nSeveral hundred spectators were gathered around to hear the Indians sing their last death song.\n\nFather Riggs and Father Cuthbert were present, and received last wishes of the Indians.\n\nAll were willing to die, and had no anxiety but for their families, who were assured would be cared for.\n\nLarge crowds gathered from the neighboring reserve, and remained with seats in front of the gallows.\n\nOne hundred and fifty police were present.\n\nMany of the Indians sought to see the condemned in their cells.\n\nChief Thunder Cloud, who was one of the leaders, was allowed to see and talk to all the Indians, by which he may have been induced to come to terms.\n\nOn arriving at the scaffold, each of the condemned sang a song to show he was prepared to die.\n\nThe other prisoners were allowed to bid farewell to the condemned, when the latter showed more feeling than the former.\n\nAt half past seven a procession was formed at the goal, each prisoner having a black cap, which was placed on his head, and which he wore until he reached the scaffold, and then placed on the top.\n\nThe prisoners walked down the street, and were escorted through town by a crowd of people.\n\nAfter hanging fifteen minutes, the bodies were cut down and placed in a cart, which was drawn by two horses, and the heads were severed by the coroner and jury, who assisted to prepare them.\n\nThe bodies were put in separate coffins and buried in the yard of the hill over the South Saskatchewan River.\n\nAmongst the last words of prisoners during the preparations were thanks to the police and officers, and new farewells to friends and relatives, and from hence their imprisonment.\n\nThe gallows stood the strain without a crack.\n\nThe arrangements were all made to depart shortly after Forget, and Robert Hoskin, executioner, well known as a sergeant major in the militia, and who was engaged throughout the battle.\n\nThe bodies being cut down, the guard fired off a volley. Indians returned to the scene of battle, having attesting a war or chiding any feeling.\n\nThe prisoners all died natural deaths.\n\nUp to the time of Riot's execution they paid attention to the priests, as they felt convinced they were going to get killed, and they thought they had heard of cases of Indians hanging so confusedly.\n\nMiserable Man wanted to know what kind of hell it was that provided about three meals a day, and clothes, while here and did not provide any for white men who killed Indians.\n\nTHE CHIT-CHAT LOCALS\n\nGathered by our Reporters.\n\nBirthday Cards in Bookseller.\n\nFirst Method is creating a school district.\n\nFull line of School Books at Cassie's Bookstore.\n\nSpecial offer eight thousand books of grade are being sold at reduced prices.\n\nThe people of Q Appelle have started a school, and one of their children has been appointed director.\n\nBirthday Cards in Bookseller.\n\nR. St. Louis says he expects the school for teaching the French language.\n\nThe members of St. Andrew's Society met at the hall and gave a supper on Monday evening last. Very pleasant time was enjoyed.\n\nThe White Rock reception was addressed at the schoolhouse Saturday, December 25th, at 2 p.m. A full attendance is requested.\n\nPortage in Prince Albert has a mock Parliament.\n\nThe Tribune-Banner says \"In mock parliament they succeed well enough, though they are not sure when the real parliament is to hold.\"\n\nMr. Swanston and W. H. Barker have returned from Manitoba and are doing very well there.\n\nThere is now a large stock of goods, and in a short time expect to open out in the back rooms of the building.\n\nWe have just received the first number of the Q Appelle Progress.\n\nIt is neat and spicy, printed and ready.\n\nMr. W. H. Barker, who is full of energy and enterprise. We wish him success in his new venture.\n\nMr. W. H. Barker has once again proved that the best rate of cost was regular passenger and freight train to Regina, the last station on the line, from Portage to Prince and 2½ cents.\n\nWe would draw the attention of our readers to the advertisement of the North-West Mounted Police, who publishers have had a fine scheme in which everybody should participate.\n\nThis scheme can afford to be without the North-West Mounted Police.\n\nThanksgiving was generally observed, nearly all the business places closed for the day.\n\nPrayer meetings, church, which addresses were very appropriate for such an occasion were held at the Rev. Alex. Campbell's.\n\nMr. McLeod has been invited by one of the most prominent citizens in the community to address a dinner in his honor.\n\nIt was rumored that the election of the Grand was supposed to have been taken up by Mr. McLeod, but the matter was never brought to a vote.\n\nWe are pleased to see Mr. Baldwin has been appointed to the position of Inspector of the North-West Mounted Police Division.\n\nMr. Baldwin, grandson of the late Hon. R. Baldwin, has been appointed to the position of Inspector of the North-West Mounted Police Division.\n\nMr. Baldwin has succeeded in getting the best wardenship from the Hon. Mr. Galt, who has held a series of charming entertainments and concerts in all through the coming season.\n\nThe police force has been doing excellent work amongst matters, and the first programme may be looked for about the first of December.\n\nIt is understood that the police have taken up the matter of providing amusement, as we are pleased to see Mr. Baldwin has been able to collect the men, and with all the talent they have now at the Harmony Hall, we may consider it look forward to another successful season.\n\nWe hope our old familiar favorite O'Leary and Nixen, in the big again, will give us another good show.\n\nMr. Baldwin doing his best to help his men towards getting them entertainments.\nTHE PRINCE ALBERT TIMES\n\nJ. D. MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—Rev. Mr. Macdonald.\nThe Mission Chapel.\n11 a.m.—Rev. Mr. H. Wright.\n3 p.m.—Rev. Mr. A. H. Wright.\n5 p.m.—Rev. Mr. A. H. Wright.\n\nSt. Catharines.\n12 noon.—Rev. Mr. Matheson.\n\nSt. Paul's.\n1 p.m.—Rev. Mr. Flett, B.D.\nSt. Andrew's.\n11 a.m.—Rev. Canon Flett, B.D.\nSt. John's.\n12 noon.—Rev. Mr. Flett, B.D.\nSt. James'.\n6 p.m.—Rev. Archdeacon McKay, B.D.\nSt. Anne's.\n12 noon.—Rev. Mr. Flett, B.D.\nSt. Paul's (Presbyterian).\n11 a.m., and 7 p.m.—Rev. Mr. McMillan.\n\nFRIDAY, NOV. 27, 1885.\n\nTHE ALBERT.\n\nA great deal of interest has been centred in the Albert's trip to relieve the exploring parties sent out last year to Hudson's Straits by the Dominion Government, and her return has created for her a great deal of anxiety. She arrived at Halifax on the 18th of last month, and in the results of her voyage all our doubts have been set at rest and our most sanguine expectations more than realized. Six parties were placed at different points so situated as to overlook the whole straits, and the information acquired by them will be of a double value—navigability of the straits—a period sufficient to ensure the success of the much doubted Hudson Bay route. Lieut. Gordon, the commissioner of the expedition, in his report to the Government, from what he has stated at different interviews we feel sure that it will be a very valuable document, and one that will have a very direct effect upon the future prosperity of Canada, and especially upon this part of it where we are endeavoring to build up homes for ourselves. In an interview Lieut. Gordon said:\n\n\"The strait was examined several times a day with a telescope from the selected points of observation, which in each case was at a considerable height above the sea. The sum total of the observations is 140. The ice took at the western end of the strait in the latter end of October, and from that date throughout the winter I don't think the strait could have been navigated.\"\n\nI am confirmed in the opinion I expressed last year that the strait and bay are navigable to properly equipped steamers for four months of the year. The feasibility of the route for traffic is a question for commercial men who understand the cost of building and handling such ships as are required for such a trade and such a short season of navigation. In other words, there is no doubt in my mind as to the practicability of navigating the strait season named; it is a question whether the cost would be such as to compete with existing routes. The weather temperature was not so low as we anticipated. At none of the stations was the minimum temperature as low as we frequently have recorded at similar points on the North coast. Notwithstanding the severity of the weather along the Hudson Straits have never been tested by properly equipped seamen ships. Neither of these vessels were built for such navigation, both being built for carrying small cargoes with auxiliary steam power. To steam half especially for no navigation, we believe the straits would be navigable for a much longer period than the steamer Gordon. But against four months of safe navigation is sufficient to ensure the opening of the route and the building of the Hudson Bay railway line. If the building of the steamer Gordon is more than the cost of ordinary steamship work, the cost of building the line will not nearly so much less. We are convinced that the steamer Gordon will be able to navigate the strait during the winter months after the steamer Gordon has paid her dues, and during the winter months when the straits are closed she would find plenty to do among the open water on the Atlantic and Pacific coasts. Besides demonstrating the feasibility of this route, the expedition has done much towards opening a large section of country to the shipping of Hudson Bay trade thought to be only fit for Esquimaux, but which abounds in mineral wealth compared to which the mineral wealth of Nova Scotia seems insignificant, and has a climate less severe than our own, which will before long be the happy homes of thousands of new Canadian citizens, who will bring wealth and prosperity to the Canadian soil, and justify the policy that a greater Canada would eventually spring up west of the great lakes.\n\nThe Canadian Pacific Railway is now completed. The last spike was driven by the Hon. Donald A. Smith, and the first trip was made from end to end by Mr. Van Horne. The greatest transportation road in the world is a reality. In about five years nearly three thousand miles of road have been completed, and it reflects great credit upon Canadian energy and enterprise. We regard the success capacity of the men who took hold of the road and to whom we owe its completion at this early date. We congratulate the shareholders who grasped with such a sagacious understanding this great through line from ocean to ocean will be the settlement of an immense population in the North West, the opening up of development of the country, and also the great tide of traffic will flow into Canada. Now since the C. P. R. has been completed, it is to be hoped that the building of branch lines will be proceeded with, and that the same energy and sagacity that has characterized the building of the main line may be put forward in building branch lines.\n\nAfter several months, the archduke had escaped his crimes upon the gallows. He had committed great deeds, but had his sentence commuted, but all without avail. He was pardoned for the part he took in the reaction in 1879, and after a course of study returned to his country, and was not justified in coming to the North-West to stir up sedition and occasion bloodshed. Kid was a cold-blooded murderer, and more justly punished the fate he had brought upon him.\n\nWe are now engaged in our exchanges, the MacLeod Guard, that a town detachment of the N. W. M. P. has been stationed in that town as well as in Prince Albert, and that it has been very peaceful during the past few weeks. At first we were not inclined to view the placing of a police station in our midst with much favor, not knowing exactly what manner of activities such a detachment would affect ourselves as citizens. We are very glad, however, to be able to state that the fact of the Police being stationed in the MacLeod is done in much honor to the administration of order in Prince Albert as our contemporary states has been done here at MacLeod. This has been remarked to us by more than one of our peace-loving citizens, and who have willingly given their heart, and Capt. Perry is to be congratulated on the quiet, thorough and efficient manner in which these duties have been performed. We are very glad to be able to quote the before mentioned sentiments expressed that the placing of a town detachment in Prince Albert was a great triumph, and that it has insured more order in the town than we thought was possible, and we are much congratulated ourselves in having a town as orderly as it is peaceable.\n\nWe are glad to see by the recent advertisements that the town is applying for small tenders for supplies, as shown by the different notices lately issued by the N. W. M. P., that they have determined to give as much as possible to the town, and to the best of our knowledge of competing for these same supplies, and so procuring work and remuneration for themselves. This is only as it should be, and we are glad to see that the wants of the community of Prince Albert and the surrounding district have not been quite forgotten by those in power where duty is being such, and we thank the Government. And we trust that the matter of providing our farmers with grain for sowing purposes will also not be overlooked, as it will be to their advantage to have a store of grain—both in superior quality and adequate quantities—that we may look forward to the success of our coming crop.\n\nTHUS, POWERS,\n\nCONTRACTS\n\nBrick, Plastering and Stone Work.\n\nAll orders promptly attended to. Est. under guarantee.\n\nBrick and Lime always on hand.\n\nWilliam Knox,\n\nCarpenter, Etc.\n\nOffice and Workshop,\n\nNear Presbyterian Church.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nSTEWART BROS.,\n\nTRADERS,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Pears.\n\nClearing out the balance\n\nHORSE SHOE STORE\n\nThe Best, the Only Place\n\nTO BUY YOUR\n\nGOODS CHEAP.\n\nDry Goods\n\nClothing\n\nAT COST\n\nNOTICE.\n\nAll parties indebted to the old firm must settle before the 1st October next owing to the change in the business.\n\nSTEWART BROS. T. O. DAVIS\nTHE MANITOBA WEEKLY FREE PRESS.\nTHE MONARCH OF THE WEEKLIES.\n14th YEAR OF PUBLICATION 14th.\nCAMPAIGN 1855-1856.\nMagnificent Premiums and Grand Prize Scheme.\nOver $1,400 worth of handsome prizes to be given away\n100 Splendid Prizes.\nBalance of 1855 FREE. Only $2 to 1857.\nTHE GREATEST OFFER YET MADE.\n\nAt no former period in the history of the Manitoban Weekly Free Press have our publications been so abundant or so valuable as they now are. The present number contains a report of the proceedings of the Executive Council, the Members of Parliament, the Lieutenant Governor, the Minister of Justice, and the Members of the Legislative Council, together with a full set of the various newspapers published in Manitoba. These publications are now being sent out in quantities never before attempted, and will form a valuable addition to your library.\n\nThis Manny Free Press is now coming up to its fortieth year of publication and at no other time has it been more desirable than at this juncture. Our subscribers are entitled to a copy of each of these newspapers, and we are confident that they will find them very interesting and instructive.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have always endeavored to meet the demands of our subscribers, and we are convinced that this year will be no exception. We believe that our subscribers will find this year's edition of our newspapers very valuable and interesting.\n\nWe have had many requests for additional copies of our newspapers during the past year, and we are glad to have been able to accommodate our subscribers. We believe that this year will be no exception, and we are confident that our subscribers will find this year's edition of our newspapers very valuable and interesting.\nTOWN COUNCIL.\n\nThe first meeting of the first Council of the town of Prince Albert was held in Mr. Brown's office on the 15th inst. The attendance was very small, there being but three present, Messrs. J. Sinclair, A. H. Clark, and J. D. MacLeod.\n\nPresent: Councilman Bettis, Brown, Bradenham, and Tail.\n\nThe council being duly sworn in, Coun. Brown was voted in the chair in the absence of the mayor.\n\nCoun. Tail moved, seconded by Coun. Bradenham, that Mr. Macleay be appointed a regular councillor. Carried.\n\nCoun. Bettis moved, seconded by Coun. Tail, that owing to a report made by Mr. Macleay, he had not taken out his naturalization papers, that he be requested to lay the same on the table. Carried.\n\nCoun. Bradenham granted the request, and upon examination of the papers they were found to be correct.\n\nCoun. Bettis moved, seconded by Coun. Bradenham, that applications for clerk be received at next meeting. Carried.\n\nMoved by Coun. Bettis, seconded by Coun. Brown, that the application from A. L. Sifton to be appointed town solicitor be laid over for one week. Carried.\n\nCoun. Bettis gave notice that he would introduce a by law at next meeting for the purpose of appointing a treasurer, assessor, etc.\n\nCoun. Tail moved, seconded by Coun. Bettis, that the town offices be closed now and from today, except at the chair's hall from the hour of 2 p.m. Carried.\n\nPursuant to adjournment, the Council met in Mr. Brown's office on Tuesday, 26th inst.\n\nPresent: Councilmen Bettis, Brown, Bradenham, and Tail.\n\nCoun. Brown occupied the chair.\n\nThe minutes of last meeting were read and approved.\n\nApplications for town clerk were received from Messrs. J. F. A. Nall and A. W. R. Macleay, and for town solicitor from Messrs. W. R. Ginn and Wm. V. Maclean.\n\nA petition from R. Goodfellow and 45 taxpayers against the slough river vote by 27 to 10 was received.\n\nCoun. Bettis then introduced a by law for the appointment of officers.\n\nCoun. Bettis moved, seconded by Coun. Bradenham, that Councilmen Brown, Tail and Bradenham be a standing committee on Finance and Assessment, and Councilmen Bradenham, Tail and Bettis be a standing committee on Health and Work. Carried.\n\nMoved by Coun. Bettis, seconded by Coun. Tail, that Mr. Nall's application for clerk of this Council be accepted. Carried.\n\nCoun. Bettis moved, seconded by Coun. Bradenham, that Mr. Maclean's application for town solicitor be accepted.\n\nMoved by Coun. Tail, seconded by Coun. Bettis, that Mr. Maclean's application for town solicitor be accepted.\n\nMotion carried.\n\nCoun. Bettis moved, seconded by Coun. Tail, that the petition from the taxpayers be referred to the Board of Works. Carried.\n\nCoun. Bettis moved, seconded by Coun. Tail, that Couns. Brown, Bradenham, and Bettis be a committee to investigate the matter about details of office. Carried.\n\nCoun. Bettis gave notice that at next meeting he would introduce a by law for governing and regulating proceedings of committees.\n\nMoved by Coun. Bettis, seconded by Coun. Tail, that whereas trouble may arise at any time from the Indians residing in this part of Prince Albert, an indication of trouble being given early, and whereas the detachment of N.W.M. Police, numbering only 50 men under arms, are stationed at the head of Prince Albert, being quartered at the extreme eastern portion of the said town, the latter being some distance from barracks and from each other—the houses and barracks containing the same to be used in case of emergency, the centre and western portion of the town, especially the latter, and the settlement extending westward, from whence the danger is to be most likely anticipated, may be very easily approached by the N.W.M.P. probably sooner than it can be reached by the Indians. It is therefore recommended that the detachment of N.W.M.P. be ordered to be humbly asked to increase the detachment of Mounted Police in this district. It is also respectfully requested that the full complement to at least 200 men, and that they be so arranged between the centres and western portions of the town as to enable them to be brought to the aid of those who may be threatened by the said enemy, that they may afford protection to such and at the same time be able to meet the enemy in battle array. The Council cannot help expressing the regret that the Government should have been obliged to send the detachment of Mounted Police to Regina or Fort Qu'Appelle, adjacent to the line of the Canadian Pacific Railway, where, in consequence of the difficulties experienced by troops sent over the railway, which are now 230 miles to the north-west, 180 miles distant, the Council has been obliged to transmit a message to the Hon. Secretary of State for Canada, Coun. Stewart, in regard to the matter. Coun. Bettis moved, seconded by Coun. Bradenham, that a vote of thanks be tendered Mr. Macleay for his services and use of office. Carried.\n\nCoun. Bettis moved, seconded by Coun. Bradenham, that Couns. Brown and Tail be a committee to draft a petition to the Hon. Secretary respecting the Council House. Carried.\n\nCoun. Bettis moved, seconded by Coun. Bettis, that the Council adjourn, to meet again on Monday, 30th inst., at 7:30 p.m. Carried.\n\nST. ANDREW'S SOCIETY.\n\nThe annual meeting of St. Andrew's Society was held on Friday evening, the 6th inst., in the store of Mr. J. Stewart. There was a large attendance of most prominent citizens, a pleasant and enthusiastic air pervading the room. Coun. J. Macleay, President, occupied the chair.\n\nMr. John Stewart, Secretary, read the annual report and balance statement for the year, which showed a surplus of $100, showing a balance on hand of over $100.\n\nThe election of officers was then proceeded with, and the following officers elected:\n\nPresident, Mr. J. Stewart; Vice-President, T. N. Campbell; Secretary, J. F. A. Nall; Treasurer, H. E. Maclean; Assistant Secretary, Rev. Dr. Maclean; Chaplain, Rev. W. McWilliams; Trustees, Thomas Bart, A. H. Clark, J. C. Maclean, W. Gordon, G. Brown, W. M. Maclean, J. A. Alexander, W. S. Maclean, and A. Thomas.\n\nLadies—Auditors, T. N. Campbell and A. H. Clark.\n\nA vote of thanks was tendered the presiding officer for the efficient manner in which he conducted and discharged his duties.\n\nMr. J. Clark, Mr. J. Sinclair, Mr. MacNab, H. F. Montgomery and J. F. A. Nall were appointed a special committee to make arrangements for the celebration of St. Andrew's day.\n\nRED DEER HILL.\n\nThreshing in this neighborhood is now over, and although the small quantity of red deer is not as abundant as formerly, the farmers have fallen back on the greater part of their ground, are preparing to put a little acreage in the coming spring, that they may have a good crop of oats and canola.\n\nA large lynx, measuring four feet nine inches from tip to tip was recently killed by two of our young apprentices, threat numbers of rabbits are being slaughtered, and the farmers are again glad their old pursuers are gone.\n\nThe public examination of Red Deer Hill will take place on Saturday, the 30th inst., at 10 o'clock A.M., under the charge of Mr. J. C. Maclean. The holidays, and the way in which the school has been conducted, and the excellent credit gained by the teacher, is very encouraging not only to the children, but also to the children, to go on.\n\nDANIEL CAMERON.\n\nBUFFALO HALL!\n\nOur Stock for WINTER WEAR\n\nNow Complete.\n\nAn inspection of Goods and Prices will convince you that we mean Business BETTS & Gwynne.\n\nHARDWARE!\n\nNails, Tar Paper, Glass (all sizes), Putty, White Lead, Paint Oil, Machine Oil, Turpentine, Plastering Hair, steam refined, Powder, Shot, Caps, Shells, Etc., Etc.\n\nWe keep none but first-class Goods. Prices to suit customers.\n\nJ. L. JOHNSON & CO.\n\nO. E. HUGHES & CO., General Merchants and Indian Traders.\n\nWe have just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nOur stock of groceries now on hand is the most complete ever received, comprising Morton's Celebrated Jams, Jellies, Pickles, Confectionery, Teas and Sugar, which defy competition. Also one car load Ogilvie's Flour, which we will sell cheap for cash.\n\nO. E. HUGHES & CO.\n\nT. N. CAMPBELL, Bookseller and Stationer\n\nJUST RECEIVED A LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal or United States promptly attended to.\n\nPrince Albert - N.W.T.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885112701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 8605, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 8487, 1], [8487, 17652, 2], [17652, 29997, 3], [29997, 38417, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]