[{"id": "37ed5f7396e0dc4eb1eb44dfdb09b18341f31c31", "text": "Notice to Creditors.\nThe creditors of William Stewart, late of Maclean, in the North West Territory, will be paid by the heirs of R. W. Smith, who was killed by disease on Dec. 8th, 1864.\n\nHigh School\nST. ANN'S CONVENT.\nStudies will commence on 1ST SEPTEMBER.\nTwo silver medals promised by the Hon. Mr. Clarks will be offered for competition during the scholastic year.\n\nNotice\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 16, of the Special Survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nCaledonia Brewery\nEAST END.\nThe proprietors of the above concern is prepared to supply families and all with its best liquor at reasonable prices, each Quart $1 per dozen; Quart Numbers $1 per dozen.\n\nWANTED\nBy the trustees of Prince Albert East Protestant Public School District No. 10.\n\nnotice concerning a bill providing for the disposal of persons convicted of vagrancy.\n\nNotice\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 16, of the Special Survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nILLUSTRATIONS.\nNew Illustrations.\nNew Illustrations.\n\nCITY BILLIARDSALOON\nCorner Church and Neat Streets.\nChoice Beer and Cigars always on hand.\n\nREV. ALEX. CAMPBELL, B.A.\nHas been appointed to the School, and may be expected at an early date.\n\nNotice\nThe proprietors of the above concern is prepared to supply families and all with its best liquor at reasonable prices, each Quart $1 per dozen; Quart Numbers $1 per dozen.\n\nNotice\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 16, of the Special Survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nNotice\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 16, of the Special Survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\n\nNotice\nNotice is hereby given that any person or persons found cutting hay on the Spencer Estate, River Lot No. 16, of the Special Survey of Prince Albert, will be prosecuted by law, and the hay confiscated.\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW\n\nJ. D. MAVEETY\nPRINCE ALBERT, N.W.T.\n\nTerms—$2.50 per month in advance (cash or stamps). Subscribers who fail to renew will forfeit their interest in this paper. Remittances, etc., per line.\n\nNo advertisements will be accepted until further notice.\n\nAll letters to be addressed to the Proprietor.\n\nTHIS PAPER may be found in the following cities:\n\nNEW YORK.\n\nSUNDAY CHURCH SERVICES\n\nSt. Mary's.\n11 a.m.—His Lordship the Bishop of Saskatchewan.\n\nThe Holy Chapel.\n11 a.m.—Rev. A. H. Wright.\n\n2 p.m.—Sunday School.\n\n7 p.m.—His Lordship the Bishop of Saskatchewan.\n\nSt. Cuthbert's.\n10:30 a.m.—Rev. Mr. Macdonald.\n\n1 p.m.—Rev. Mr. Matheson.\n\nSt. Paul's.\n11 a.m.—Rev. Canon Prichard.\n\n1 p.m.—Rev. Mr. Matheson.\n\nSt. Andrew's.\n10:30 a.m.—Rev. J. F. Prichard.\n\n2 p.m.—Rev. J. F. Prichard.\n\nSt. James'.\n4 p.m.—Rev. J. F. Prichard.\n\nSt. Anne's, St. Paul's.\n3:30 p.m.—Rev. Mr. Prichard.\n\nSt. Paul's (Presbyterian).\n11 a.m.—Rev. Mr. Macdonald.\n\nFRIDAY, AUG. 14, 1885.\n\nREFERENCE.\n\nPresent indications point to a rather lively competition for the forthcoming election for the North West Council, and we must confess to a feeling of surprise that this should be the case. We believe, in our opinion there can be found more to object to than to count in the position. In the first place while the work which has to be done by the Council is of the most necessary in itself just alike as well be undertaken without the presence of the electoral element at all, nor is any sane man deceived into the opinion that in going to the Council they are not sent a member that is in any way enjoying representative government. While the whole body of the Council has no power to initiate anything of considerable benefit to the people it is no less necessary to make sure that the bulk of the constituency recognize this fact, and it is very questionable as to whether any man having political aspirations will not seriously damage his eventual prospects by occupying a seat at the Council board-to-day. Any good that a member is likely to do his district under present circumstances is apt to be far proportional to the amount of influence he may be able to bring to bear personally upon the Government, and as that sort of influence entails frequent visits to Ottawa, it may be furthermore laid down that the amount of benefit he can hope to confer upon his constituents will bear a distinct relation to the length of his purse. It seems, however, that the experience of those gentlemen who have been members and have been out of pocket by the occupation of this position is not such as to prompt them to desire to resume it, nor can it be denied that it has a very strong tendency to be a very thankless task. Nevertheless, so far as what has been done for the district by the retiring members is such as to prevent its being generally recognized, and it is a poor lookout for the next candidate to find Mr. Macdonald granting his objections to assuming such a task a commonplace thing, and the fact of finding the utmost unwillingness in him to greater expense than he feels justified in incurring. Under these circumstances it becomes a matter of vital necessity that the councils of the district be consulted with all possible dispatch, and then there really is no just reason why any expense should be incurred. What we wish to draw the attention of the people to is the fact that if they vote to put a good man to represent them and aid us as possible to advocate their interests, it is their business to put him there; for a candidate must feel that he is open to the suspicion that he is interested in the interest involved if he can be expected to spend time and money and beg votes as a favor in order to secure the position. Of the number of names mentioned in connection with the various seats there are several men quite equal to undertaking all the legitimate duties attaching to the position, but it is high time that steps were taken to reduce that number to such a point that every probability that unless there is every possibility to concentrate their energies, the upshot of the business will be that some one of those in every way the least desirable may find himself elected. We protest that no one of the gentlemen who are likely to do us credit will accept a nomination without knowing pretty exactly the amount of support he can depend upon, nor is there any reason why such information should not be forthcoming with tolerable accuracy when required.\n\nThe recently appointed Governor of the Hudson Bay Company, who has been making a tour of inspection through the Territory, gave a banquet on Saturday night to an assemblage of about forty-five, composed of members of the district and a number of others who happen to be here on Government business of various sorts. This entertainment turned out a complete success, and Mr. H. B. Co. Wingfield made a most happy impression upon those who had the honor of making his acquaintance for the first time. An interesting feature of the occasion was the appearance of Messrs. Munro and Quinn, the Government Commissioners who have come to inquire into the claims of those who have suffered loss in consequence of the late rebellion. We regretted not having known of this before making some remarks which appear in our last issue. However, we have much pleasure in using our opportunity to express the hope of Commissioners made by the Government is certain to insure a completely satisfactory settlement of the claims in question. Mr. Munro has been a lawyer by trade, and the sending of a man of that stamp is evidence of the desire of the Government to do what is fair in the matter. Mr. Munro has had a great deal of experience of this sort of work, and assures us that he will approach the matter in a liberal spirit, and that the Government wishes to settle up the losses of the people at once, intending to let the H. B. Co. and others who can better afford to do so wait until such people have been paid. Mr. Quinn represents Lower Canada upon this Commission, and a very few words with him impresses one with the idea that his ability for the work is such that in which he is engaged alone it has never been desired. We were delighted with the way in which he explained the public sentiment of Quebec with regard to the unfortunate rebellion.\n\nWe learn from reliable sources that the distress at Dartmouth has been considerably exaggerated when reported, and that all cases of real necessity have been attended to by direction of the Government. If we have not been giving the Government credit for such discretion as it has already been making it is only because we have been kept in the dark with regard to their proceedings.\n\nCOMMUNICATIONS.\n\nWHAT WAS IT?\n\nTo the Editor of The Times,\n\nSir,—Last Friday night about eleven o'clock there was seen a bright light rising up from the summit of the hill. You will remember there was a very bright moon—but from the flight of the lamp on its arriving we judge it was hill, could be seen to be traversing the summit of the hill, which step was broken at intervals by a sudden halt. Some hours after this, the light was seen again, and was once again visible on the top of the hill. Now what could this mean? Was there anyone there that night, and if so, were his friends still residing along in search of him? Or, were these two, who visited the scene of the photograph taken lately, and on seeing the \"just like life,\" were so pleased, that the town became too small to hold them? PATROL.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra.\"\n\nLath, 75 cts. per bundle.\n\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nTHOS. POWERS, STEWART BROS., TRADERS,\n\nGENERAL MERCHANTS\n\nHave just received a large stock\n\nDRY GOODS AND GENERAL GROCERIES\n\nTeas,\nTobaccos,\nCoffee,\nOatmeal,\nSugars,\nCanned Goods,\nCal. Pearls.\n\nClearing out the balance\n\nCrockery and Hardware, AT COST\n\nNOTICE.\n\nAll parties indebted to us must be settled before the 1st August next, owing to an intended change in the business.\n\nSTEWART BROS.\n\nJAMES SINCLAIR\nMerchan Tailor,\nand Draper in\nGENTS' FURNISHINGS.\n\nT. E. JACKSON.\nChemist & Druggist,\nMedical Hall.\n\nSTRAYED!\n\nStrayed on to my premises on Saturday, the 4th inst.\n\nTwo Sows and One Barrow Pig\n\nThe owner requested to pay damages and take them away, or they will be sold.\n\nWILLIAM SHIPMAN.\n\nRepairing Promptly Attended to\n**CANADIAN.**\n\n**THE CAPITAL.**\n\n*Ottawa, Aug. 2.* There is no truth in the rumor that Gen. Middleton has recommended the presentation of a medal to the North-West Mounted Police who took part in the recent engagements.\n\nAt an interview today the Minister of Agriculture said that the recommenda-\ntion of the committee appointed by the Cana-\ndian Government in aid of the Arts and\nagricultural Associations, that it was not\nworth while to expend more than $2,000 of the money in making a Mani-\ntoba and Maritime Provinces display at\nthe coming Exhibition in London.\n\nThe minister promised orders any volun-\nteers who have been under arms in con-\nnection with the rebellion are to be\ncalled out for special drill this year,\nin order to keep the expenditure within the appropriation.\n\n**TORONTO.**\n\n*Toronto, Aug. 1.* At a game of base-\nball here to-day the London's made 5 runs to the Toronto's 0.\n\nThe second day charges will still being pres-\nented by the Central Prison Commit-\ntee.\n\nFive prisoners were examined today, and the count adjourned until\nTuesday next, when there are seven\ncharges altogether to be investigated.\n\n**GENERAL NEWS.**\n\n**NEW YORK.**\n\n*New York, Aug. 1.* Stanley Hunt-\nley, a popular writer for the press, and\nauthor of the \"Spookscapes papers,\" died last night at his residence on West\nForty-fifth street.\n\n**DETROIT.**\n\n*Detroit, Mich., Aug. 1.* The well-\nknown sporting man, Mr. Gilliam, has\nbecome a citizen of the United States, and\nwill be officially received into the army\nof volunteers.\n\nMr. Gilliam will put $500 or\n$1,000 forfeit with any reliable news-\npaper in the United States, and will pay\nup the whole if the United States have\nAustralia, if necessary.\n\n**EGYPT.**\n\n*Cairo, Aug. 1.* It is reported that\nOsman Dignan was killed in the Kassa-\nh battle. El Mahdi's followers are very\ndemoralized.\n\n**GERMANY.**\n\n*Berlin, Aug. 1.* It is now generally be-\nlieved in diplomatic circles that a\npeaceful solution of the Anglo-Russian\nquarrel is now almost certain.\n\n**CHICAGO.**\n\n*Chicago, Aug. 2.* Commencing short-\nly after daylight this morning, the fire\nbegan below the street level.\n\nEarly in the day the rain poured down in tor-\nrents, and hardly shocked up to what\ncould be called ordinary weather late in the\nafternoon.\n\nAt 10 p.m. the fire became heavier, filling the people with\napprehensions of a deluge, and the indi-\ncations were that the flames would rage all night.\n\nTwelve hours from the com-\nmencement of the alarm, the signal ser-\nvice officer reported twenty inches.\n\nAt this hour the amount must\nbe quite six inches.\n\nThe damage to the\nproperty and lives of the inhab-\nitants is very great.\n\nSince early this evening the department of police\nhas been engaged in the most strenuous attempt\nof reports of damage of this nature.\n\nAt six o'clock the elevators in the new\nopera house were set on fire.\n\nClark and Washington streets began to burn.\n\nThe water in the basement had\ngot out the fire under the boilers.\n\nThere are several complaints from many sources.\n\nA full assortment of diamond eyes\nat Clark's drug store.\n\nJust received at Clark's Drug Store,\nR. H. Bitter's Vegetarian Grocery, Scott\n& Lynn's Drug Store and Library.\n\nAt the last meeting of the Council of\nthe Saskatchewan Rifle Association the\ndifferent matches were discussed and\nsatisfactory reports, showing that the\narrangements for the different matches\nwere about completed and that we\nexpect a first-class affair in the month of\nSeptember.\n\nA team match is being ar-\nranged for between the Police, R. Butten\nand residents of the town.\n\n**THE MEMORIAL.**\n\nAt a meeting of the residents of Prince\nAlbert and the surrounding districts, to\ntake steps towards erecting a suitable\nmemorial to the brave soldiers and\nmen who fell fighting in honor of their\nQueen and country, Mr. T. N. Camp-\nbell was called to the chair, with Mr. S.\nB. Spratt as secretary.\n\nMoved by Col. Spratt and seconded by\nGen. Brown that in view of the sad and\nterrible loss which has been incurred in\nthe death of nine of our brave citizen\nsoldiers, and three of the equally brave\nmembers of the volunteer force, stationed\nat Bear Lake, we do hereby express\nour heartfelt appreciation of their ser-\nvices and regret for their loss by an\nappropriation of suitable amounts which\nwill stand forth in years to come as a memo-\nrial of their worth to generations here-\nafter.\n\nResolved that a committee be appointed\nwith full powers to collect funds for\nsuch purpose.\n\nMoved by Mr. M. McWillie-\nson seconded by Mr. Macdonald, that\nthe committee, after having collected the\nnecessary funds, do call a meeting of the\ncommittee and decide upon the site and\ndesign of the monument.\n\nMoved by Mr. T. Agnew and seconded\nby Mr. J. Murray that the monument\nbe open for two months, and that\nin the meantime a suitable fence be\nerected around the grounds St. Mary's\nchurchyard, where the Monument will be\nerected to be admired by the Monctonians\nand to be asked to remove the bodies of\nthe three Mounties. Polkton buried at\nCypress Point, together with those of\nthose of the volunteers.\n\nIt was unanimously resolved that the\ncommittee report in the subdivision of\nThursday evening and make all the ne-\ncessary arrangements for a general can-\nvas of the country.\n\n**A TORONTO FIRE.**\n\n*Toronto, Aug. 1.* One of the most\ndestructive fires that has ever taken\nplace in Toronto commenced about 12.30\nthis morning in the large brick building\noccupied by the English Sugar Refining\nCompany, the English Sugar Company\nbeing the largest fire in the city.\n\nThe fire spread to the lumber yards\nand warehouses on Yonge street and\nall the intervening buildings and\nwarehouses have been burned to the ground.\n\nThe fire brigade are hard at work\nputting out the fire and the firemen\nare working day and night.\n\n**PUBLIC NOTICE.**\n\nPublic notice is hereby given that pro-\nceedings have been taken against the\nerection of a signboard Municipality\nof \"The Town of Prince Albert,\"\ncomprised of the following towns of land:\n\nPart of lots number seventy-eight, ninety-\nseven, seventy-one, eighty-two, and of that lot known\nand described as the Reserve of \"The\nEnglish Sugar Company,\" and the Reserve\nof \"H. B. Co. Reserve,\" all laid\nout in the special survey of Prince\nAlbert, as shown on a plan of Prince Albert Settlement, dated\n16th February, 1884, signed by Edward\nJ. Layton, Esq., Deputy Surveyor General,\nand record in the Department of the Inte-\nrior, land being situated on the bound-\nary line following, that is to say, commencing\nat a point where the western boundary\nline of said lot sixty-eight meets the\neastern boundary line of the north side\nof the North Saskatchewan River, thence\nsouth along said western boundary line\neighty-three chains to a point due\nsouth of the present line of the Prince Al-\nbert District in the said Territory;\n\nthence along said western boundary line\nsouth forty-three chains; thence south-\nwest forty-three chains; thence due\nsouth along the western edge, on said west-\nern boundary line of the North Saskatchewan\nRiver, thence due south against the\nwater's edge, on the northern shore of\nthe said North Saskatchewan River, to the\npoint of beginning, containing by measurement\none thousand eight hundred and thirty\nacres of land.\n\nThis land is under and by virtue of the\nprovisions of the One hundred and seven-\nty-second Section of Ordinance No. 4 of\nthe Government of the North West Terri-\ntory Municipalities, I hereby order\nthat an election shall be held in accord-\nance with the provisions of said ordi-\nnance in four weeks from the date of\nthe first publication of this notice in the\nPrince Albert Times and San\nSaskatchewan Review.\n\nE. DEWNEY,\nLt. Governor of the North West Terri-\ntory Government House, Regina.\n\n**NOTICE.**\n\nAs no person has put in a claim for\nthe pigs advertised by me, I will sell at\nmy farm on the\n\n5th Sept. Next, at noon\n\nWILLIAM SHIPMAN.\n\n**THE PRINCE ALBERT TIMES**\n\nAND\n\n**SASKATCHEWAN REVIEW.**\n\n$2.50 PER ANNUM.\n\nThe Times is the best medium in the Territory to\nadvertise your business.\n\nSubscribe for The Times and get the latest news and\nhappenings around town.\n\n**JOB PRINTING**\n\nOf all descriptions done neatly, quickly and cheaply\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\nTHE REBELLION.\n\nContrary to expectations (see last No.), by the end of March there were very few of the loyalist settlers who had not found their way into the town; although some of the people of St. Catharines and the Portage district had been able to find shelter in the woods or in the river for some time longer. On the two last days of March and the early days of April there was no doubt but that the call of the rifle companies was answered in and formed into separate companies, the intention being to supply the place of the regulars, who had deserted. In order to do this the members of these companies were stationed not at angles armed with all the arms that could be spared, but to be ready to defend the town from the expected attack. The number of companies congregated in and about the town for protection became so large that the police and the citizens became convinced of the intention of the enemy to make an attempt to enter the town. It would have been easy to maintain the strength of the garrison at night, but the enemy had greatly increased the strength of the force which was to be used against them.\n\nIn order to do this the members of the companies were stationed at all angles armed with all the arms that could be spared, but to be ready to defend the town from the expected attack. The number of companies congregated in and about the town for protection became so large that the police and the citizens became convinced of the intention of the enemy to make an attempt to enter the town. It would have been easy to maintain the strength of the force which was to be used against them.\n\nGREAT CANADA\n\nWe take the following from the Senate Debates, Hon. Dr. SCHULZELL—Besides, to consider whether the Government intends that greater Canada, comprising the two Provinces of Ontario and Quebec, together with the Lakes of the Woods and the Pacific Ocean, which contain our greatest natural resources, shall be represented in the Imperial Parliament by a single member, or whether it will be represented by two members, one for each Province.\n\nThe question is one of great importance, and I trust that the House will give it its attention.\n\nSASKATCHEWAN RIFLE ASSOCIATION.\n\nThe first meeting of the Association will take place on its rifle grounds, Prince Albert, on Tuesday, September 1st, when a series of matches will take place.\n\nFurther particulars will be advertised as the matches are arranged.\n\nMembership fees must be paid on or before Tuesday, August 25th.\n\nAll information may be had from S. BREWSTER, Sec.-Treas.\n\nO. E. HUGHES & CO., General Merchants and Indian Traders.\n\nHave just received a Large and Complete Stock of Dry Goods, Hats, Ready Made Clothing, Boots and Shoes, etc.\n\nMorton's Celebrated Jams, Jellies, Pickles, Confectionery Teas and Sugar.\n\nWhich defy competition. Also one ear bad Ogilvie's Flour, Which we will sell cheap for cash.\n\nO. E. HUGHES & CO.\n\nT. N. CAMPBELL, Bookseller and Stationer\n\nJUST RECEIVED A LARGE ASSORTMENT OF ROOM AND PICTURE MOULDINGS.\n\nPICTURES Mounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert — N.W.T.\n\nJUST RECEIVED J. M. CAMPBELL At the Horse Shoe Store A LARGE STOCK OF READYMADe CLOTHING Hats, Summer Suits, Prints and Dress Goods ALSO A SUPPLY OF FRESH GROCERIES T. O. DAVIS J. M. CAMPBELL", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885081401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6042, "total-output-tokens": 5396, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2216, 1], [2216, 10852, 2], [10852, 19091, 3], [19091, 22451, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]