[{"id": "1d7fa46e99d48ad0d3373e71abc66686447417c8", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nPRINCE ALBERT, SASK., FRIDAY, APRIL 18, 1886.\n\n$2.50 A YEAR.\n\nBANKINGHOUSE\nMacarthur & Knowles,\nPrince Albert, N.W.T.\n\nMACLURE & MACGILLIVRAY\nBankers, Solicitors, etc.\n\nSTEPHEN BILLETTER\nNotary Public\n\nFORUMS & NEWLANDS\nBankers, Solicitors, etc.\n\nPRINCE ALBERT\nN.W.T.\n\nA. W. R. MARKLEY\nBook Agent and Auctioneer.\n\nE. J. CANN.\n\nFOR SALE\nLAND WARRANTS\nFor 250 Acres each of Dominion Homestead and Preemption Lands.\nApply to A. H. CLARK.\n\nCITY BILLIARD HALL.\nChrom and Pool Tables.\n\nGEO. A. BENTLEY.\nPost Office Jewellery Store.\n\nPRINCE ALBERT\nPlaing Mills and\nSash and Door Factory.\n\nCOMMISSION ROYALE.\nNorth West Rebellion\nLOSSES CLAIMS.\n\nCOMMISSIONERS:\nJ. ALPHONSE GUIRET, Esq.,\nHENRY MUMA, Esq.,\nTHOMAS MCKAY, Esq.\n\nSTILL SELLING!\nBalance of Winter Stock at Cost.\n\nMISS MAGUIRE,\nCAMPBELL'S BLOCK.\n\nPOST OFFICE BOOK STORE\nBooks, Stationery, Fancy Goods, Accordeons, Violins, Violin fittings.\n\nCHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nBuilding operations have commenced.\nThe Stone for sale at Jackson's Drug Store.\n\nThe N.W.M. Police here are preparing to go under canvass.\n\nMr. Macdonald is at present in Winifred.\n\nThe roads are drying up, and the farmers are now busy seeding.\n\nMr. McGinn arrived back from Winnipeg on Wednesday.\n\nMr. Tomkins, of the Indian Department, was in town on Tuesday.\n\nThe full list did not arrive until Wednesday, owing to the bad state of the ice on the South Branch.\n\nHis Lordship the Bishop of Saskatchewan was here yesterday morning, visiting the police barracks.\n\nT. O. Davis has moved into the J. O. Smith building, where he has had trouble lately with his bed and fitting.\n\nMr. J. B. Gauvin, Dominion Inspector of public buildings, is here, and will remain until the completion of the Court house and barracks.\n\nConstable Lesondes and Interpreter arrived from Fort Saskatchewan Sunday evening, bringing with them a prisoner charged with felony.\n\nJust received by T. E. Jackson, a choice selection of Fresh Vegetables and other Seeds. For sale at reasonable prices.\n\nWe have telegraphed that it has been arranged that the Government will not change the route of the railway to Prince Albert.\n\nMr. Chad, chief of this tribe, who has been touring Canada for the last three years, is expected shortly in this district.\n\nDucks and geese are not very plentiful.\n\nSome of our sportsmen are fully prepared, and going southward, securing for their appearance.\n\nMr. Waddell, chief of the Indians of Battleford, has arrived by mail stage this week.\n\nHe was accompanied by Mr. McLeod, who was appointed in the office of the Department late.\n\nB. Division, N.W.M. Police, have arrived at Battleford from Regina, making three divisions of men each, now stationed there.\n\nAs will be seen by advertisement, all claims for horses should be laid before the Commissioner immediately, in order that they may be entered into before the first of May.\n\nThe heavy sound of the wheels at the gate of the barracks was heard. Workmen are busy engaged preparing the road, and the \"home\" of the late Chief of the Cypress River Indians is now completed.\n\nWe notice quite a number of magpie and other birds brought into town for planting, among which should be mentioned the crow, which will materially improve the appearance of the place.\n\nSergeant Miller of the N.W.M. Police, has returned from Battleford, enroute for Fort McLeod, having been transferred to it. He will be very welcome to the town, and will be missed among those who were a general favorite.\n\nOn Saturday last the Hon. L. and Mrs. Clarke arrived home after a lengthy absence. They were very well received and feeling much the better of his extended trip. We noticed several signs of spring during the day, and continued in the evening.\n\nConstables H. D. McKenzie, J. H. Smith, L. F. Taylor, and J. Milliner, returned from the N.W.M. Police on the 23rd, having been captured by Mr. George Macdonald and party of the police. The prisoners were brought to the barracks on Sunday evening. On Monday morning Serg. Fergy commenced his proceedings against the prisoners each, with hard labor.\nThe Postmaster General has ordered that parcels coming over the Canadian Pacific Railroad to Manitoba shall be charged according to the same weight as those sent by rail, namely five pounds. Therefore the maximum allowed has been two pounds, three ounces.\n\nScotland has always given Mr. Gladstone and the Liberal Government a majority. But the Liberal administration has adopted some hostile tactics toward the Conservative party. This is due to the home rule for Ireland matter, among Scotch members not being expected to follow Mr. Gladstone in the matter.\n\nNonwithstanding the Mets and Browns earlier this year had commenced during the month of March, just in time to check the tide of immigration, and which had the effect of seriously diminishing the number of homes and pre-emption entries over the various territories, the sales for the past year have been larger, showing that the Northwest is rising up, if not as rapidly as might be wished, still with considerable promise. In the year 1884 the number of homestead entries was 233,289 acres; sales (pre-emption), 365,000 acres; sales (pre-emption), 215,172 acres. In the year 1885, the number of homestead entries was 179,352 acres; sales (pre-emption), 264,314 acres; sales, 126,291 acres. There is a decrease last year, but the general business of the department has been good, the work connected with the homestead entries and the grants of scrip and land to members of the active militia engaged in the rebellion having given the department a vast amount of work.\n\nThe movement of population into the Northwest this season promises to be large, not alone from Great Britain, but also from the eastern provinces. Small farmers of all countries have generally moved west, and Winnipeg, on their way to take up land, many of them in Southern Manitoba. The largest single exodus came however from the provinces of Ontario, Quebec, New Brunswick, Nova Scotia, Prince Edward Island, and Newfoundland. All these provinces have large areas of land suitable for settlement, and the people who have moved west are doing so because they can get land at reasonable prices.\n\nThere was some talk about a parcel of oats from Clark's Crossing, which apparently did not meet with the views of some members of the Seed Growers' Association. At the same time, we understand that a lot of this grain has been taken out by the farmers around, and therefore we suppose there could not have been much harm in the quality of this particular lot.\n\nAfter all is said and done, and now that we and our readers can look back over the negotiations and details of the last few months, we have great pleasure in saying that every Government official concerned—the Dominion Lands Commissioner in particular—and Messrs. Rogers and Macdonald, under his instructions have done everything in their power to meet the views and convenience of all concerned, and we can only now express the hope that every recipient of the seed will soon return, reap such a crop as will fully recompense him for all his labor and for all his anxiety.\n\nFrom the Record.\n\nMr. E. R. Abel, Steamboat Inspector, returned from Edmonton two weeks ago, and while there he visited the lakeshore townships, where he has been inspecting the boats intended for use on that river.\n\nMr. Drummond, of the N.W.T. Transportation Co., was in Town this week, and says that 6,000 miles have already been purchased for the Hudson's Bay Railroad. This is a hopeful sign that work on the road will be commenced at an early date.\n\nFrom the Subscribers.\n\nWe have heard that Mr. Smith is in town, and we hope he will be able to see us again soon. We are glad to hear that he is recovering from his recent illness.\n\nWe are pleased to inform the public that we have on hand and for sale a half million feet of dry lumber, consisting of matched, dressed and undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 42\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to contract for buildings as cheaply as any firm in Town.\n\nBuilders paying cash or giving good security for large orders, will have a reduction made.\n\nMOORE & MACDOWALL\nGENERAL NEWS.\n\nThe Ottawa Journal says Mr. W. C. Wells, of Edmonton, has been in conversation with Mr. V. E. Borden of Fort Macleod, who has just purchased the Mount Royal ranch near Calgary, and who is engaged in the business of raising cattle.\n\nThe government has approved carrying on sheep-raising on a very extensive scale, and the government is selling their ranches with three or four thousand sheep. Mr. Wells will have a large number of sheep.\n\nThe Canadian Gazette says recent cable messages warrant the belief that no matter spring if not a mild winter is brought on by the weather in the North-West, the Old Country. For while agricultural operations are all retarded here by frost and snow, the wheat crop in England is excellent, and only slight losses. These facts will enable the farmers and businessmen in Manitoba and the adjacent territories to look forward to a better season next year.\n\nProfessor Bell, who made a photographic tour of this country from Lake Superior to the Rockies, promises to come back again next summer and visit the Northwest. He has been in the city for several months past preparing his views, and will after a brief stay in Toronto, where he expects to return in the fall, go to the Pacific Coast. Then he will make a trip to Europe, where he has been invited to address a large audience at all the principal towns and cities in England, Ireland and Scotland. The Professor has received a message from former General Sir M. Van Horne expressing his thanks for the collection made.\n\nImmigration continues on the increase. Small parties arriving almost daily from all parts of Eastern Canada and the British Isles. A large party of about seventy-five persons passed through the city and will soon be on their way to the Prairies and the Northwest. They were principally English people, and are a very desirable addition to settlers. Most of them came out per transatlantic steamer, but by rail over the C. P. R. to Winnipeg, they only remained a few hours in the city.\n\nIt is rumored that Charles Maier, author of \"Teachmouth,\" contemplates uprooting himself from Prince Albert, N.W.T., whether he goes or not. His immediate successor another drifter, the subject of which is to be the subject of the Queen's Birthday Honours list. The subject of Maier as revealed in \"Teachmouth\" would be singularly well fitted. We trust that if such a thing should happen before the public heretofore there will be more frequent and numerous such a person as he should be encouraged to remain speaking for Ontario—regret to say, will take up a permanent abode in the North-West, where he possesses much valuable property.—Toronto Globe.\n\nThe Duke of Connaught has been appointed Major General of the Bengal army. He is succeeded by the Right Hon. Edward G. Brougham, Bishop of Nottingham, whose recent appointment as President of the Primrose League excited much comment, has been summoned to Rome.\n\nFoster is not even yet permitted to try the effect of the new treatment for hydrophobia without the paws. The new claimant for the reprieve of the condemned man is a physician of Patagonia in South America, Dr. Patos. The assertions made by the Sicilian is that the new method is so efficacious in the treatment, he has been able to cure in his practice nine years ago. His system consists of raising for rabbits to be inoculated with that form of disease, and then feeding them with red wine, vino, and in the habit of drinking it. The treatment by rabid dogs, always with favourable results when the conditions were at all similar. It is said that the doctor generally claims that the claimant must have been absent so long if the alleged previous discovery was to be true.\n\nThe race on the river breaks up today, and is going out rapidly. The water is very low.\n\nA TOUGH YARN.\n\nAn allegory drawn from Miles City, Mont., to the St. Paul Globe, reads as follows: Gabriel Dumont who was consulted with regard to the question last spring in the North-West, is now in Montana, and is feared is inducing tribes of Indians to join him in order to prevent the advance of the Canadian Government. He has been visiting each Indian camp making friends of the chiefs of the Crees, Blackfeet, and other tribes. It is understood that he has been visited by Chiefs of Canadian tribes, and every two months ago the Dominion Government despatched a French half-breed to Montana to spy Dumont's movements. The two men met at Fort Benton. Friend in a short time, and another detective in the employ of the Dominion Government has joined Dumont has made a considerable advance among the Indians. Dumont was in this district last fall, and had conferences with the Indians. From there he went to Fort Benton, where he was visited by a French half-breed who said that Crowfoot of Canada was ready and willing to put 3,000 warriors in the field against the Government. Dumont was distant when he would be invited to get out his forces. Things have a very warlike appearance, and should Dumont succeed in recruiting his followers, distances in the Regina district any way from 2,000 to 4,000 Indians leaves will cross the border to assist him.\n\nTHE ESTIMATES.\n\nFor the Fiscal Year as laid before Parliament.\n\nThe estimates of expenditure of the Crown for the fiscal year ending June 30, 1887, are given in the table below:\n\n| Item                          | Estimate |\n|-------------------------------|----------|\n| Total                         | $5,121,250 |\n| Estimated expenditure         | $2,690,000 |\n| Estimated expenditure         | $2,431,250 |\n\nFrom this document it appears that the total estimated expenditure under the Estimates for the fiscal year ending June 30, 1887, is $2,431,250.\n\nThe Estimates of expenditure of the previous year show an increase of expenditure for each of the items included under the head of capital expenditure. In the Estimates for the current year there is a reduction of over four millions consequent on the completion of the C. P. R. line between Edmonton and Prince Albert.\n\nPUBLIC NOTICE.\n\nLethbridge.\n\nFrom the Lethbridge Times.\n\nLarge flocks of wild geese can be seen every day going north.\n\nThe flooding of the river is good at present.\n\nSeveral horse races took place on the square on Wednesday last.\n\nMr. J. Smith returned from Montreal yesterday.\n\nCpl. Irvine and Master Evans came up from Regina on Sunday's train and went to Prince Albert.\n\nMr. Henry arrived with a carload of cattle on Sunday last, and it was reported that he had bought a lot of cattle.\n\nBaker & Co. will be held by that firm for sale as seed.\n\nA new contract has been entered into for putting up the implements and machinery for the new flour mill at the Red River Reserve, left on Monday morning for that place. Mr. H. H. Foster, the owner, has ordered the building completed by the beginning of May.\n\nWe are informed that the medal, is used by the Imperial Government for services during the late rebellion in the North-West, will be presented to the officers, non-commissioned officers, and men of the Northwest Mounted Police, who distinguished themselves. Amongst the following officers will be recipients:\n\n- Lieut. L. F. Crozier, Adjutant.\n- Lieut. J. W. Macdonald, Adjutant.\n- Lieut. W. Brooks, for engagement at Duck Lake.\n- Lieut. W. M. Herchmer, for engagement at Fish Lake.\n- Lieut. W. E. Scott, for engagement at Knife Hill.\n- Capt. S. B. Steele, for engagement at Long Lake and Frenchman Butte.\n\nThere are no stations in this district.\n\nMason & Hamlin\n\nORGAN AND PIANO CO.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly, quickly and cheaply.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK\n\nSEEDS\n\nIf you want selected Garden Seeds, Flower Seeds, Grass Seeds, or any other Seeds, you will find them here.\n\nROBERT EVANS & CO., Seed Merchants and Growers, HAMILTON, ONT.\n\nJ. SINCLAIR & CO.\n\nMerchant Tailors.\n\nKEPT CONSTANTLY ON HAND\n\nA FAIR WARNING.\n\nAll Parties indebted to T. E. JACKSON who fail to settle before the Fifteenth of FEBRUARY will be sued at the next Court without any further notice;\n\nT. E. JACKSON\n\nNew Stand, in the building lately occupied as a Post Office.\n\nNOTICE.\n\nAll parties indebted to the Hudson's Bay Company are requested to call and settle their accounts before the first day of May 1888. After that date all accounts unpaid will be placed in the hands of our Solicitors for collection.\n\nGeo. S. Davison.\nFALSE SYMPATHY.\n\nA Family Judgment Letter on the Riot Case.\n\nIf a country in Canada, ignorant of the facts, were to hear the speeches of the Opposition in the House of Commons, his conclusion would be that the entire population from coast to coast was against Mr. Reid. Reid had not been fairly dealt with. All true, the country has suffered, all the misery which the late Rebellion brought upon it, which he has brought to many a parent by the death of a beloved child at the hands of the insurgents. But, sir, in the estimation of the Opposition unworthy even of mention in comparison with the sufferings of the North.\n\nSome of the Opposition speakers put up their resort to arms, and nearly all of them have been willing to use force to palliate his peace-pledges. To such an extent as to take from them every element of moderation, and to render impossible the speech made by Mr. Casson of Huron, if it is not intended to become the rebellion? He impugned misconduct to the Government, and denounced the Northern. Now what possible bearing can the impugned misconduct have on the question of whether or not Mr. Reid was proper, unless by way of protestation for himself? So far as we know, he has never been connected with any organization, whether, assuming the negligence or misconduct of the Government to have been the cause of the insurrection, or that the resort to arms by Reid was justifiable. Those people who were among the insurgents, and who little knew the stability of executive authority, or the security of life and property, the freedom of the press, and the liberty of English manner they suffer from wrongs as acute as the half-dozen, ever so much to complain of. So do the people of England, and they should be in a deplorable state of things were these people to be regarded as justified in their course. The acts of Reid are not to be excused, and merging the constituted authorities, I cannot believe that the persons who committed the acts of Reid, anything which the Government has done has justified it. It was at best but a partial or sectional remedy, and in no case was there ever more than the least prospect of monopolizing the best land in the district.\n\nBut what I want to come at this. Do these people who are seeking to exonerate Reid prove that they are disinterested? If they do, then those who died for Canada were wrong. Was Cochrane demanded that Capt. Crozier should be killed? Was Crozier ordered to assist the regular force at his command? The call was responded to, and with enthusiasm. Would the young men be it understood, who were not bound to go under arms, but who were bound to defend their homes and the race from which they sprang, hesitate but to confront the rebels? Oh! how different was the result. They fell on the field at Duck Lake dead or wounded, and those that were wounded died of their wounds. They were helpless. Is there a word said in favour of those brave men who, at their country's call, gave their lives? Is there a word? Is there a word for the brave men who subsequently marched with their regiments and suffered hardships, loss of property, and death? Suspect a word. Surely a word, I say, in comparison with the few words that have been used in connection with Louis Riel.\n\nIt is positively astounding to hear some of the speeches of a party, especially reminding the execution of this man as an act of cruelty, and yet passing over the most horrible crimes, and the acts of sympathy of condemnation. Reid was no murderer; he invited the Indians to peace and to harmony, he caused them to understand that he was the friend of the Northwest, but, forthwith, rendering false objection weakens, he is entitled to our deepest sympathy! Strange sympathy, indeed! He never hesitated to make when it suited his purpose, and he thought he was in the right when he thought he was in the right. His conduct was always consistent with his views. The act of murder of party warfare prevented Reid's pardon at this time, and it seems to be thought that Reid ought to be pardoned. But why? Because he was a man of honour? It is usual to refer to their past career in order to discover what they are now doing. But why should we regard the act of Scott was not to be ignored. Oh! but we are fond this unfortunate man. We are fond of him because he obtains the ascension of President Garfield, with far more reasons for the supposition than Reid. But, sir, the people maintain that all the acts of Reid, Mr. Reid's madness was full of method. He proposed to have the government for his own purposes. After that there is nothing further to say. This was not even the conduct of a merely religious enthusiast, but of a maniac.\n\nIt is surprising that Frenchmen, who draw their inspirations from the historic literature of their race, should be so pathos with such a man as Reid. These same have many a dark stain, but they are not so disposed as to cast suspicion on the possibility of soul. This disposition to sympathize with this man can only be explained by the fact that there is no race on this continent, which cannot exert overpowering domination on the part of the French element to cling to their race with particular tenacity.\n\nBut what shall we say of those who have not even this pretence of being Frenchmen? They are with this criminal, and who dishonor the shade by endeavoring to make it appear that he was not insane? Papers for what? No papers, even a ship load of them, can make the crime less. What has been inflicted? A ship load of papers cannot make people that have any sense of justice forget that Louis Riel was accountable for his acts. Not the excesses are hateful. Those who utter them are not the worst. The real criminals are those who have been so long keeping with impudence in hand that Riel's sentence was commuted. Oh! but the French element, which is divided, which should ring from the mouth of the Dominion to the other. But the confusion came out. Then the tactics of the French element were well defined, union with the French, and the overthrow of the Government. Reid was the leader of the French element. They would make loud, dismal speeches, and if they could not wholly justify his actions, they would make it appear that the Government upon the ground that the condition of his mind was such that he could not be held responsible. But they would secure the sympathy of Reid's countrymen, and pave the way to success.\n\nThere are some men who, like the sun will ever wachsen in the north. It is there where they are needed, there where no noble or good can ever be expected. But what is family anticipated, that we hail? That the French element will be able to come out party, blameless to the wind, forever blameless in their enthusiasm, rather than distance the memory of those who fell and wished with their blood to secure the peace and prosperity in the State of sympathy for Louis Riel.\n\nThere are some men who, like the sun will ever wachsen in the north. It is there where they are needed, there where no noble or good can ever be expected. But what is family anticipated, that we hail? That the French element will be able to come out party, blameless to the wind, forever blameless in their enthusiasm, rather than distance the memory of those who fell and wished with their blood to secure the peace and prosperity in the State of sympathy for Louis Riel.\n\nWM. STOBART & CO.,\n\n1879.\n\nBuffalo Hall!\n\nSTILL LEADING.\n\nDomestic and Imported Cigars\n\nEVER OPENED IN PRINCE ALBERT.\n\nFlor de Benitos,\nCreme de la Creme,\nBelle Cuba,\nHenry Olays and Wagrets.\n\nALL CHOICE GOODS AND SEASONED.\n\nBETTS & Gwynne.\n\nExamine Our Stock of Novas Confectionery and Biscuits.\n\nIMPORTANT NOTICE.\n\nOUR MOTTO.\n\nSmall Profits, Quick Sales and No Credits.\n\nJust received, all kinds of Men's, Women's, Misses and Children's Boots and Shoes, Rubbers, etc., etc., OF ALL STYLES AND SIZES.\n\nWe grant the time to do more than announce that every piece of every description in the store is in stock. We are obliged to inform our customers that customers who have already purchased us are daily testifying to the fact, by returning to purchase again and again, that they are highly satisfied and gratified with their purchase.\n\nRemember the fact, that our prices are fixed, and that our terms will be strictly cash.\n\nCustom work a specialty.\n\nBeginning next week with another new article.\n\nSHANNON & McLEOD.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886041601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 5851, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4116, 1], [4116, 8329, 2], [8329, 16903, 3], [16903, 25293, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]