[{"id": "99a30b5e683a8ce24f7f80acc0e3c51d3a5bbaea", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nVOL. NO 6. PRINCE ALBERT, SASK., FRIDAY, JANUARY II, 1869. $250 A YEAR.\n\nBANKING HOUSE\nof Macarthur & Knowles,\nPrince Albert, N.W.T.\nPrinces Albert Bank of Canada.\nBranches at Prince Albert and Saskatoon.\nBanking House established in 1867.\nBanking House established in 1867.\nBanking House established in 1867.\nBanking House established in 1867.\n\nXMAS COMING AGAIN.\nFancy Groceries for Xmas\nFancy Goods for Xmas\nToys for Xmas\nPresents for Your Girl\nPresents for Your Fellow\nAT R.T. GOODFELLOW'S\nCONFECTIONERY STORE\n\nW. SHANNON & CO.\nWinter Goods\nConsisting of Books, Ladies and Children's\nBoots, Socks, and Slippers\nOf all descriptions and sizes.\nMits, Moccasins, Hosey, German Books,\nGum Hubs, Trunks and Valises\nTo be disposed of at the lowest prices\nWM. SHANNON & CO.,\nPRINCE ALBERT\n\nP.L. FABER\nBread and Cheese\n\nJ. LESTOCK REID\nDominion Land Surveyor.\n\nPRINCE ALBERT SASK\nA. C. PATTERSON\nForwarding Agent.\n\nROBERT THOMSON,\nSign and Ornamental Painter.\nCalmoning and Paperhanging on Short Notice.\n\nROYAL MAIL STATION\nWeekly\nBetween St. Appelle Station and Prince Albert.\nPost Office open from 10 o'clock until 3 o'clock Wednesday morning and at Appelle Station from 10 o'clock until 4 o'clock Wednesday afternoon.\nExpresses at lower rates.\n\nLESLIE & SCOTT.\n\nROBT BUCKLEY,\nAuctioneer, Accountant, Estate and General Agent.\nHas on hand a number of Town Lots\nWhich will be sold again on easy terms.\nAlso some\nIMPROVED FARMS.\n\nQUEEN'S HOTEL\nLeading Hotel in Saskatchewan.\nBoard by the day or week.\nThe Bar is supplied with the finest brands of Cigars, Wine, Cider and Blackwood Brew.\nRooms both Double and Single.\nEvery attention paid to the traveller public.\n\nCHIT-CHAT LOCALS.\nGathered by our Reporters.\n\nT T T. Try for Mr. T. Walters & Co.\nPocket and Office Diaries for 1869 at Cassin's Bookstore.\nJ. M. R. Neely, school teacher at the School House, Steves for his field of labor today.\nThe Privy Council have granted permission to the R. V. Y. K. to cross the C. F. R.\nThe police boys are getting up a grand exhibition of skating on the lake in the course of a week's work.\nThe public school opened after the Christmas holidays, on Monday last.\nThere are now 160 names on the roll.\nMrs. McKay, wife of the Rev. John McKay, of Almonte mission, has returned from her visit with Mr. Head.\nThe town council met in the council chamber for the transaction of business.\nThe Rev. Canon Fleet, public school inspector, got back from Snake Plain this evening, where he had been visiting the natives.\nMr. J. F. A. Still, school teacher, arrived back from Duck Lake last Saturday.\nHe had been away during the Christmas holidays with his daughter.\nThe annual meeting of the Sask. Rifle Association was held in the Council chamber on Wednesday next, 16th inst., for the purpose of electing officers and transacting other general business.\nA full attendance was present.\nThe bell for the Nasket Academy arrived yesterday and placed in position in the school house tomorrow evening by Mr. A. Goodfellow.\nIt is to be hoped that the correct time will be kept at the Academy and that the bell will be rung regularly.\nTravelers coming from Green Lake say that the snow was very light and nothing to be complained of.\nThe New Year's day was so warm up at Mistassini that the roads were all clear and both sides of woods were seen in several places.\nThe balance of the snow was gone.\nWe are offered a store Flannel at 25c per yard, Lamb Caps for 8s, Lambs Cap 8s, Tweed Overcoats 8s, Lambs Cap 8s, 7s, 6s, 5s, 4s.\nAll others appear to be cut in same proportion.\nWater and milk are still scarce.\nTickets are out now for the complimentary dinner to be given to Lord Ed. Irvin at the Queen Hotel on Tuesday evening.\nWe are also offered a large number of tickets next, and all those who wish to do honor to the gallant colonel will find better value than at once from this source.\nThe thermometer indicated colder weather last night than they had ever known, but there was no indication that it would be zero.\nFor the last month or so we have had beautiful weather, the thermometer has been above zero during the day and below zero during the night, and during the days there would only be a few degrees difference.\nFever on the increase and is now in half-a-dozen homes.\nA meeting of the town council was called to consider the advisability of having the streets made under quarantine.\nThe foregoing paragraph appeared in the telegraph of December 25th, the Herald, and a malicious falsehood has been sent about the whole.\nFever was certainly in town but there are three families that it, and the doctor have visited, and yet the medals are alone able to be around.\nWill G. Clark, baggage-master, W. & A. Railway, Amosaple, N.S., writes—Please send me another bottle of Nauvoo Pills, my first bottle of Nauvoo Pills I have used it according to instructions it would have cured me if it had not been for that another person.\nAre you concerned with the welfare of your family?\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nAT\nPRINCE ALBERT N.W.T.\nTerms—50¢ per annum in advance.\nSubscribers, please note.\nI have been informed that this paper, issue No. 10, is for sale at first-class rates, and I am advised to pay for all copies sold.\nPlease be assured that I am not interested in any way.\nA certain number of copies have been issued at a low rate.\nI am obliged to make this statement to the proprietors.\nJ. D. MAVEETY, Proprietor\n\nSUNDAY CHURCH SERVICES\nSt. Albert's Church—Services, 11 a.m., Rev. Mr. Smith, St. Albert, Alta.\nSt. James' Church—Services, 10 a.m., Rev. Mr. Brown, St. James, Alta.\nSt. Patrick's Church—Services, 11 a.m., Rev. Mr. O'Brien, St. Patrick, Alta.\nSt. Andrew's Church—Services, 10 a.m., Rev. Mr. Taylor, St. Andrew, Alta.\n\nTHIS PAPER MAY BE FOUND IN THE FOLLOWING PLACES:\nRogers' Bookstore, Prince Albert; Royal Hotel, Prince Albert; Bromley & Co., Prince Albert; Robertson & Robertson, Prince Albert; and the offices of the Prince Albert Times.\n\nFRIDAY, JAN. 11, 1889.\nWe hope that our citizens will take advantage of Tuesday night's banquet to express the esteem in which we feel sure Col. Irvine is held by them.\n\nThe list of buildings purchased in another column erected in this town in the year just closed is a most creditable one; but there is yet no building of any kind erected so far, at a cost of nearly $3,000; there has been a considerable amount of money spent in finishing buildings put up under former years and we have doubtless omitted one or two of late years erected. When we consider that there is no migration to the place the increase in building is something remarkable, and the substantial and costly nature of most of the buildings erected speaks very highly of the taste of the citizens and the increasing number of citizens in that time.\n\nNow that the municipal elections are over and the excitement occasioned thereby has subsided, we extend our congratulations to the successful candidates, and express the hope that they will drop all private and petty jealousies and direct their energies to the welfare and prosperity of the best interest of the town. We do not agree with those who say that we have the poorest council that it was possible to get on the other hand we believe that it would be difficult to find a more honourable or more practical or watch closer over interests. In Mr. Knowles we have a mayor who is in every way fitted for that position; we feel confident that our interests are safe in his keeping and that he will see that the public money will be wisely expended in the different wards of the town than have hitherto been. We have full confidence that the policy of the new council will be one of economy and that at the end of the year they will go out of office with a clean record.\n\nSome time ago we took the liberty of bringing to the notice of the Dominion Government at the first it is the expense of the late Assembly elections in the districts of Prince Albert and Kinistino had not been paid. We regret that, so far as known by the returning officers for those districts, they have not yet been paid, and those who acted as district returning officers and in other capacities are still anxiously waiting for their money. In some cases those officers have had to travel over 600 miles at a very large personal outlay and it is a gross injustice to keep them waiting so long as they have. The same now holds good and suffered over six months and should move in order for the Government to send up some officials from Ottawa to investigate the case. If there was anything irregular in the matter it should have been brought into the hands of the authorities sooner and settled one way or another; anything would have been more satisfactory than the treatment than that has been meted out to the returning officers and their deputies in the districts mentioned.\n\nWe have for some time felt that steps should be taken towards the formation of a society here having for its object the collection and preservation of information relative to the past and present history of the country; in other words a Scientific and Historical Society, and it ought to include a literary institute as well. We have considered several men who ought to be most likely to take an interest in such a society and all whom we have seen favor the project. We do not anticipate that its expense would be very great, with the result for the benefit of the town it would be invaluable. The country has a past history that should be preserved, and now is the time that it should be done. Many interesting facts, which at present are unknown except to a few natives, are buried in the memory of the Indians. Such a society would hang as its objects the collection of natural history specimens and other scientific works. The formation of a literary society would be of the utmost value and the residents of the town more in need of it today. We see no reason why the scheme could not be successfully carried out, and trust that some one will take the initiative and bring a number of our interested. No harm will be done by discussing the matter and until good may result.\n\nSILK RIBBONS!\nOne of our best dealers who were to have an elegant large package extra fine Assorted Ribbons (by mail) in different widths and at the latest prices. They will make lovely neckties, neckwear, scarfs, trimming to hats and dresses, bows, fancy waist bands, etc., etc. They are made from the finest silk and are very cheap. We have nothing like 25 cents to the inches save.\n\nAs a special offer, this house will give double the amount of any other firm in Canada for any Assorted Silk Ribbons. P.O. addressed to newly married ladies. Send us your ribbons and we will send you a large assortment of the best quality at a very reasonable price. Satisfaction guaranteed. (Price $1.00 per yard.) For 60 cents, Address, Leslie & Co., Prince Albert.\n\nTHE TORONTO WORLD.\nIs absolutely the best Daily Paper in Canada.\nThe latest and best Political and General News served up fresh and crisp and free.\nTry it for a month and you will want to continue to receive it.\nSubscription 50¢ annually, or 25 cents per month.\nAddress: THE WORLD, Toronto.\nThe Toronto World, elected best by the Prince Albert Times for 40 years.\nSend 6 dimes with cash enclosed.\nTIMES OFFICE\nPrince Albert\nTHE ELECTIONS.\n\nMonday last being the first of the new year it was the sign laid down in the Constitution ordinance for holding the election. Only two—Knowles and Knowles of the same name—were nominated for mayor, and the poll was closed Knowles had a majority of twenty-three votes. Of the 123 electors who voted only 120 cast their ballot for mayor, which shows that there were several who did not take part in the majority contest. For councillor in Ward No. 1 the electors were equally divided in their choice between Knowles and Donaldson, the former being declared Knowles elected. In Ward No. 2 a split of about equal strength was shown between Donaldson and Knowles, the latter being elected. In Ward No. 3 Knowles was returned by a majority of twenty-eight votes, while Donaldson received thirty-two votes. In Ward No. 4 Knowles received twenty-eight votes, while Donaldson received thirty-two votes.\n\nWARD NO. 1\n\nKnowles 12\nDonaldson 12\n\nTotal number of votes cast 24\n\nWARD NO. 2\n\nKnowles 27\nDonaldson 27\n\nTotal number of votes cast 54\n\nWARD NO. 3\n\nKnowles 38\nDonaldson 38\n\nTotal number of votes cast 76\n\nWARD NO. 4\n\nKnowles 56\nDonaldson 56\n\nTotal number of votes cast 112\n\nNOTICE.\n\nApplication will be made to the Provincial Court for an order declaring Knowles elected mayor. The electors of Ward No. 1 have been asked to meet at the residence of Mr. Knowles at 7 o'clock this evening to consider the matter.\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing\n\nMAGNIFICENT STOCK NEW GOODS\n\nFar surpassing any previous seasons, both for richness of design and quality. The Variety of New Goods in Every Department is immense\n\nCall and Examine Our Stock\n\nNo trouble to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\nEdmonton, Alta.\n\nJ. FRASER TIMS,\nFort Saskatchewan Alta.\n\nMahaffey & Clinkskill,\nBattleford, Sask.\nBuilding Operations\n\nIN 1888.\n\nThe following list, as nearly as we can ascertain, is a correct statement of the buildings erected in this town last year. In each case we give the name of the contractor and the cost of the building. It will be seen that there were twenty-five new buildings erected, at an aggregate cost of $45,910.\n\nThe first in importance in the Niedert, Kondorberg, is the log hill near the court house. It is a two-story brick building, 37x20 feet, with a bell-tower at the front of the roof and a porch over the front door, and is quite an ornament to the town. Through the courtesy of the contractors who built it, we have been able to see inside, and we must say that no better workmanship has ever been displayed in the North. The log hill contains five class rooms (20x35) fitted up for public instructions, but also used as present at a music room; hall, 30x60 feet; chapel, 20x30 feet; library, 12x12 feet; and 12x12 feet. On the second floor there are two class rooms 21x25 feet, reception rooms 12x12 feet, and a large room 12x12 feet, half 10x12 feet, the same being a fine piece of workmanship. The building is well lighted, and everything about it appears to be perfect. There are five class rooms now furnished with desks, to the number of thirty, the gift of Mr. J. M. McLeod. Mr. J. M. McLeod did a fine chair-case piece of work on the brick, stone and plaster work for $2,500, and A. & W. H. Goodfellow did all the carpenter work for $1,500. Mr. J. M. McLeod did all the carpenter work, etc., for $5,000. Total cost, with extras, about $8,500.\n\nThe log hill was built, and also factory work to the value of $2,000.\n\nT. J. Agnew, frame dwelling house, 23x27 feet, $3,000; log stable, 20x30 feet, $600; barn, 20x30 feet, $600.\n\nRossall & Davis, frame butcher shop, 18x28 feet, $800; log storehouse, 16x20 feet, $800; Hard & Baker, contractors.\n\nT. E. Jackson, frame storehouse, 20x48 feet, $1,000; Hard & Baker.\n\nJ. D. Macveety, stable, 18x24 feet, $600; Hard & Baker.\n\nTransport House, Hard & Baker, frame, 16x10 feet, $600; Hard & Baker.\n\nOther work by Hard & Baker, $200.\n\nS. McLeod, frame dwelling house, two stories, brick knocker, $1,400; H. Nelson, contractor, $1,000; Hard & Baker, plasterers.\n\nFitch & Day, frame storehouse, 19x36 feet, $600; A. Nelson, contractor.\n\nE. J. Cann, frame dwelling house, one story, $300; Green & Starfelt, contractors.\n\nO. E. Hughes, two story log dwelling house, 18x24 feet, $400. D. McGregor, builder.\n\nD. McGregor, two story frame dwelling house, 21x24 feet, $1,000. D. McGregor, builder.\n\nR. Conlogue, frame dwelling house, 24x16 feet, $750; D. McGregor, $750.\n\nE. Gayeau, brick veneer dwelling house, 28x27 feet; kitchen 14x18 feet; two stories 12x16 feet; one story 12x16 feet; brick veneer, $2,000; Hard & Baker, contractor.\n\nBrick work by Powell & Brown. Plastering by G. Sutherland.\n\nR. C. Wigmore, two story frame store, 24x16 feet, $1,000; T. Carter, contractor.\n\nDr. F. Foster, dwelling house, 20x20 feet, with kitchens 16x20 feet, one and a half stories; surgery 12x16 feet, one story; all brick veneer, $2,000; Hard & Baker, contractor.\n\nBrick work by Powell & Brown.\n\nT. O. Davis, two story house, 18x18, $500; driving shed, $200; fence, $200; Carter, contractor.\n\nRossall & Davis, log stable, 18x24 feet, $325; slaughter house, 16x22 feet, $175; Carter, contractor.\n\nMasterson & Partridge, frame, 24x28 feet; kitchen 18x12 feet, one and a half stories high, $2,000; Log stable, 20x26 feet, $300; Carter, contractor.\n\nBette & Co., frame building for photographic gallery, 18x25 feet, $800; Carter, contractor.\n\nCharles Newitt, one story and a half frame residence, $1,400; Garven & Holmes, contractors.\n\nJames White, two story frame cottage, 22x28 feet, $1,800; Carter, contractor.\n\nChester Thompson, frame stable, 14x30, $800; Garven & Holmes.\n\nH. R. Garven, hexagon frame cottage, $1,700; log stable, 14x18, $350; Garven & Holmes.\n\nJ. K. Sinclair, log house, two stories, 18x20 feet, $600; J. DeGroot, contractor.\n\nJ. Chamberlain, log house, $800.\n\nH. Poole, log house, $300.\n\nJ. Miller, log dwelling; two stories, 20x16 feet, $600.\n\nCoast Riggs, log cottage, $200.\n\nF. J. Thorpe, frame dwelling, $800.\n\nR. T. Goodfellow, addition to store, $200.\n\nCourt house, log stable, $500.\n\nH. J. Montgomery, log stable, $200.\n\nJudge McReaie, driving shed, $200.\n\nJ. Macdonald, frame stable, $200.\n\nWm. Fawcett, frame stable, $200.\n\nJ. Milgrew, log house, $200.\n\nConvent, log dwelling, $800.\n\nBesides the above, a large amount of money was spent on the school and Court house, which would bring the total improvements up to about $800,000 for the year.\n\nMoney raised by Board manufacturers disposed of $300,000 brick.\n\nDuring last year there was over $1,000 expended by the town on streets and other improvements.\n\nCURLIANA.\n\nOn Saturday last our wrestling games were played between two rinks chosen from the prominent and vice-president. The day was very fine for curling and some good play was made. At the close of the day the vice-president was 12 points ahead. The following is the score and rinks:\n\nPresident: Rink No. 1\nVice-President: Rink No. 2\n\nGayeau: Baker:\nMcVeety: Johnson:\nRossall: McTaggart:\nDavis: McTaggart:\nMcLeod: McTaggart:\nNelson: McTaggart:\nCarter: McTaggart:\nGarven: McTaggart:\nHolmes: McTaggart:\nPowell: McTaggart:\nBrown: McTaggart:\nSutherland: McTaggart:\nWigmore: McTaggart:\nWhite: McTaggart:\nThompson: McTaggart:\nGarven: McTaggart:\nSinclair: McTaggart:\nChamberlain: McTaggart:\nPoole: McTaggart:\nThorpe: McTaggart:\nMontgomery: McTaggart:\nMcReaie: McTaggart:\nMacdonald: McTaggart:\nMilgrew: McTaggart:\nFawcett: McTaggart:\nMilgrew: McTaggart:\nConvent: McTaggart:\nCourt House: McTaggart:\nSchool: McTaggart:\nStreet: McTaggart:\nTotal: McTaggart:\n\nPronounced, by practical consumers, superior to anything in the Canadian Market.\n\nWRITE FOR INFORMATION\n\nManufacturers Also of the celebrated \"RED CAP\" BRAND OF Manilla Binder Twine\n\nAgents—MERRICK, ANDERSON & Co.\nWinnipeg, Man.\n\nGAME IN SEASON.\n\nRUSSELL & DAVIS\nRIVER STREET.\n\nPRINCE ALBERT BREWERY!\n\nPure and Sparkling!\n\nAMBER--Hop--ALE,\n\nDelivered to all Parts of the Town.\n\nGERROND BROS.\n\n\"BELL\" ORGANS\n\nUnexcelled for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nVICTORIA Livery and Boarding Stables,\n\nBetween Johnson's Campbell's Store.\n\nHaving enlarged our premises to double their original size, we would respectfully call the attention of the travelling public to their convenience.\n\nWell and river water almost at the door.\n\nWe have also added some horses to our stable, and a list of prices remains, and the public can depend upon getting a turn-out as can be had west of Winnipeg, at reasonable rates.\n\nBoarders taken at reasonable prices.\n\nNEILSON & M'BEATH\n\nT.J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889011101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5720, "total-output-tokens": 5542, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5002, 1], [5002, 11366, 2], [11366, 13345, 3], [13345, 20091, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]