[{"id": "f3051ffa13ef5b9449e63efe53b9bea8ed32aa2e", "text": "CHIT-CHAT LOCALS.\n\nGathered by our Reporters.\n\nSee Markley & Co.'s change of address.\n\nThe Rev. John McKay was in town this week.\n\nMr. J. E. Carter leaves for the East next week.\n\nLots of rain and splendid crop growing weather.\n\nMr. M. McKay returned back from his extended trip last week.\n\nMr. Wm. Stewart arrived back from the East last Sunday.\n\nMr. J. M. Campbell left for Winnipeg.\n\nThe East End School will be reopened on Monday, Aug. 4th.\n\nThe quarterly meeting of St. Andrew's Society took place last evening at the Work House. The foundation of McKay's grist mill will be begun next week.\n\nA ploughing bee takes place today on Mr. J. M. Campbell's farm.\n\nRichardson has been removed to Battleford, and left for there yesterday.\n\nApplications is about to be made for a license to establish a brewery at Battleford.\n\nSince our last issue the river has risen considerably, and is in good navigable condition.\n\nMr. Wm. Miller & Woodman's saloons for a drink of good cider, just imported from the East.\n\nMr. D. H. Macdonald left on Wednesday for Troy to bring up Wm. Cheyney's shingle mill.\n\nSergt. Brooks arrived here on Monday from Battleford to take charge of the constabulary force of police here.\n\nThe constitution and by-laws of the St. Andrew's Society of Prince Albert were approved at their last meeting.\n\nThe steamer North West arrived back from Battleford last Tuesday, and left for Grand Rapids yesterday.\n\nMr. Wm. Campbell has been engaged to carry a ploughing bee to the mill on Macdonald's property, for two weeks or two months.\n\nMr. Wm. Miller and Wm. Cheyney, who have been away for some time, returned last week.\n\nCrops in this vicinity are looking splendidly, and the present prospect promises abundant harvests in store for us.\n\nConstable Hatchard who deserted from the detachment of Mounted Police and returned home has not been heard from since.\n\nThe steamer of the H.B.C. mail is rapidly gaining completion, and a large staff of men are engaged in getting her ready for the season.\n\nThe steamer North West left for Swift Current yesterday, where she will remain till next season, so as to be ready for the spring trade.\n\nThe steamer Marquis is expected to arrive here in a few days. On her return she will make the Manitoba down to Battleford run, and will be here until next spring.\n\nA Brandon farmer who had lost forty-three head of cattle has been able to sell them at reasonable terms, either for cash or in trade for cattle. Further information will be had at this office.\n\nMr. David Macdonald has moved back about six weeks ago to secure machines for McKay's grain mill, returned home last week. His residence at the railway station will be at Troy about the 15th next month.\n\nThe telegraph office has been located on the east side of town on Macdonald's property, and the contract for the erection of the office has been awarded to Mr. Campbell for $250. Work will commence immediately.\n\nA large amount of work has been done on the road between here and the town of Swift Current, but probably owing to the fact that the road has been closed for the past few weeks, no further progress can be made.\n\nMr. Wm. H. Harris, Nookie Plate Co., has returned from a trip to Regina on the 28th inst.\n\nThe steamer Marquis will be able to leave from Battleford next Monday. Her passengers were Indians Agent Ross and his predecessor, besides the party of Indians and government men who were on a pleasure trip to Battleford.\nTHE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW\n\nSPINK & MAVEETY\n\nPRINCE ALBERT, N.W.T.\n\nFRIDAY, AUGUST 1, 1884.\n\nNORTH WEST COUNCIL\n\nWe are glad to see that the dignity of the North West Council has been materially increased by the addition of two representative members, since its last session, and we believe that the point will be reached at which by the North West Territory Act, the Council will give place to a Legislative Assembly and it is certainly a matter for congratulation that the Governor and his electors may now be equally balanced so as to make the casting vote of the Lieutenant Governor insure the former having everything their own way. We do not mean to speak disrespectfully of the gentlemen who at present constitute the N.W. Council. They comprise as good men in every respect as are to be found in the Territories, and have no doubt been quite equal to deal with such matters as concern them, but when we consider what really constitutes the momentum questions of the day for the people of the Territories, the proceedings of our Councils unmixed with part that we read in the Lieut-Governor's speech and the reply thereto. We notice from the latter that it is intended during the next session to send representatives to the Federal authorities, but beyond urging some modification of the present liquor laws, and the granting of money bonuses to local or branch railways, we have no hint as to the measures to be entered upon. As to the brevity question and the present system of liquor permits, it is not long since we sufficiently clearly explained our views, and it is unnecessary for us to add anything to what we have repeatedly urged directly and indirectly with regard to encouragement of railways. But what strikes us, if we may make a statement standing on its own feet, is entirely omitted wants and grievances that is of representation in the Dominion Parliament. We say this not only because we all feel that we are being governed in a manner utterly unsuited to our requirements, but because we know that such representation could not fail to speedily bring about the redress of all our other grievances. We urge this will be peculiarly true and most necessary when the extension of the franchise to some two millions of British subjects is the all absorbing topic of interest in the Domestic policy of the Government, and when the voices of three Fathers have been solemnly warned that by endeavoring to frustrate this it is most seriously endangering its very existence. Now we are of opinion that the North West Council will be a great gain for any project of representation to the Federal authorities of more importance to the people whose interests they represent than this, nor do we see how such a course on their part could fail to produce serious attention. We have already expressed our want of faith in petitioning matters to Ottawa, unless presented in such a way as to render the perusal and consideration of them absolutely certain, and it occurs to us with regard to these being prepared, that the District that they might have a better chance of success if presented through the Council, which we are sure would not refuse to forward and endorse them.\n\nTHE INDIANS.\n\nIt would undoubtedly be very gratifying to us all to receive the assurance of His Honor, Lieut-Governor Dewdney, who is also Indian Commissioner, to the effect that \"despite the exaggerated reports which have been circulated to the prejudice of the country,\" there is no attempt to prevent amongst the Indians of the Territories, were it possible we are in a position to assure them that we are doing our utmost to prevent the truth from being known. The reports circulated must be most prejudicial to our interests we are only too well aware, and that is one of our reasons for having on several occasions raised our voice in demonstration against the treatment calculated to keep the Indians in an unsettled and disoriented frame of mind. With regard to the reports alluded to by His Honor, we have received information from those who have been in the midst of the disturbances, for saying that the reports were in the main in no wise exaggerated, nor was the true interest of the country be in any way endangered by them. Those best qualified to judge express the opinion that nothing but the determined pluck, coolness and resolution of Major Crozier, added to the excellent discipline of the police under his command (upon which we heartily congratulate the officers and men) prevented an outbreak, the horrible results of which are impossible to more than one. Before this outbreak, it was contended generally that the Indians were very indifferently provided with arms and ammunition, and it is a painfully significant indication of what must have been for long past the state of mind of these savages, to find them on the first symptom of a row springing up to a man better armed than the police themselves. Were there any imperable difficulty in obtaining arms, we should quiet, we could only deplore the present state of things, but when we consider how easily all this might be prevented we can not restrain our righteous indignation. Neither the cattle nor the crops are far to seek. The settlers of the district by the white man has driven away the herds of buffalo which formed the main support of the Indians. To compensate for this they are put by the Government on starvation rations, starved themselves by farming; but considering the utter unreasonableness of asking an Ehu to change his skin, common sense would lead us to conclude that the actual necessities of life to even such Indians as can be only induced to do a very little towards their own support instead of the present scale of almost starva- tion. Again it is a matter of strong import that the abode of settlers, who include numbers of women and children, should be exposed to the horrible possibilities of an Indian outbreak, by the Govern- ment allowing the Indians to roam at large, as many of the towns in the districts have proved themselves to be, some of whom in the event of an outbreak, should they by any chance escape the savages, would probably as the case of the white man be lynched by the white settlers.\n\nJAMES SINCLAIR\nMerchant Tailor.\n\nGENTS' FURNISHINGS.\n\nCONSUMPTION\n\nFits, Epilepsy, or Falling Sickness.\n\nPERMANENT REMEDY—GUARANTEED INFALLIBLE FIT PREPARATION.\n\nThis preparation is guaranteed to remove all fits and convulsions, and to prevent their recurrence. It is a simple, safe and efficacious remedy, and will be found to be of great benefit to those suffering from fits or convulsions. It is recommended by physicians and surgeons throughout the country, and is now being used with great success by thousands of patients.\n\nASH & ROBBINS,\n65 Fulton St., Brooklyn, N.Y.\n\nTHE WEEK\n\nJ. O. DAVIS & CO.,\nGeneral Merchants,\n\nPrince Albert, Sask.\n\nC. D. NORTHGRAVES,\nWatchmaker and Jeweller.\n\nA LARGE STOCK OF\nWatches,\nClocks and\nJewellery.\n\nKEEP CONSTANTLY ON HAND\n\nR. J. O'LEARY\nProprietor\n\nEAST END BAKERY\n\nBREAD unsurpassed by any west of Winnipeg.\n\nNINE Loaves for $1\n\nHUGH McNEILL\nEast End Bakery.\n\nPUBLIC NOTICE\n\nAll persons are hereby required to take immediate steps for setting up the public lands within the limits of the District of the Interior or the East aspect of the District of the Interior, as prohibited by law, and all timber on our own lands, and to deal with the Minister of the Interior.\n\nEach settler on a homestead quarter-section must make application to the Local Agent of the Dominion Lands Act, and must be over twenty acres in extent, at $5 per acre.\n\nAny person other than a homestead settler desiring permission to cut timber must make application to the Local Agent of the Interior, who will deal with him according to the terms of the Act.\n\nPersons who have not been timbered within the limits of the District of the Interior, must make application to the Crown Timber Agent as his office is on the 1st May, 1884, and must be over twenty acres in extent, at $5 per acre.\n\nAsh & Robbins, 65 Fulton St., Brooklyn, N.Y.\n\nFURNITURE\n\nFancy Parlor Bedroom Sets, Sideboards, Bureaus, Bedsteads, Couches, Sofas, Chairs of nearly all descriptions.\n\nCradles & Cribs for the Babies, Rocking Chairs for the Ladies, Mattresses Single & Double to suit Customers.\n\nC. & G. E. CARTER,\nKNOX & BARKER,\nCARPENTERS, ETC.\n\nOFFICE AND WORKSHOP.\nYear Presbyterian Church.\n\nFIRE! FIRE! FIRE!\n\nPUMP ON WATER\n\nWalls Sunk and Pumps Made and Repaired.\n\nOrders left at J. L. Johnson & Co., will be promptly attended to.\n\nNATHANIEL ACORN\nPrince Albert.\nNORTH WEST COUNCIL.\n\nWayne County, July 9.\n\nThe Council met at 2 p.m. His Honor the Lieutenant-Governor presiding.\n\nThe minutes of the proceedings of the last day were read and approved.\n\nMr. Oliver moved an ordinance to amend the existing ordinance respecting marriages and sale of property.\n\nOn motion of Mr. Jackson, the ordinance was referred to Committee on municipal affairs.\n\nThe Lieut. Governor read a copy of resolutions forwarded by the Regina Town Council, requesting the government to give municipal corporations power to tax billboards and other objects placed thereon.\n\nThe resolution was referred back to Committee on municipal affairs.\n\nMr. Oliver moved an ordinance to amend the existing ordinance respecting mortgages and sale of property.\n\nMr. Jackson moved a resolution to provide compensation for the families of persons killed by accident.\n\nMr. Oliver moved an ordinance for the protection of crops and other animals.\n\nMr. Jackson moved an ordinance to amend the existing ordinance respecting fences.\n\nMr. Oliver moved an ordinance to amend the existing ordinance respecting auctioneers, hawkers and peddlers.\n\nTHE NEW ORDINANCE.\n\nOrdinance agreed to in Committee and referred to the Council for approval.\n\nMr. Macdonald moved a resolution to amend the existing ordinance respecting fences.\n\nMr. Jackson seconded.\n\nMr. Macdonald moved an ordinance to amend the existing ordinance respecting auctioneers, hawkers and peddlers.\n\nMr. Jackson seconded.\n\nTHE EDITOR.\n\nAn exchange, whose editor has been doing business through the mail, has been received containing the following statement:\n\n\"The editor of a newspaper is liable to grammatical blunders, technical, typographical errors and lapses of memory.\"\n\nThe editor of a newspaper is liable to grammatical blunders, technical, typographical errors and lapses of memory.\n\nTHE ROYAL ROUTE.\n\nChicago, St. Paul, Minneapolis & Omaha, and Chicago & Northwestern Railroads.\n\nROYAL ROUTE.\n\nJ. H. HIGHLAND, Gen'l Traffic Manager.\n\nT. W. TEASDALE, Gen'l Passenger Agent.\n\nPassengers over the Royal Route enjoy the luxuries of Modern Railway Travel, including Inviting Dining Rooms, Sleeping Cars, and Special Day and Night Coaches for Passengers who do not desire to travel during daylight hours. The Royal Route connects all our passengers between Minnesota, St. Paul and Council Bluffs, Iowa, with Chicago, Minneapolis, Omaha, and Kansas City.\n\nIf you have any questions about accommodations, always buy tickets over the Royal Route.\n\nDEATH OF CAPT. DUTTON.\n\nCommander of the Allen Fleet.\n\nAlmost every Canadian whose business takes him across the ocean had heard of Capt. Dutton, Commander of the Allen Fleet. He was a man of great ability, kind and generous, and strongly religious. His death was very sudden, from Bright's disease, and will be felt as a personal loss throughout the fleet. The cause of death was due to a fall from his boat while engaged in his usual occupation.\n\nThe Bishop of Assiniboia.\n\nThere was quite an amusing occurrence at Land's End on Tuesday, when Bishop Assiniboia was present. Bishop Assiniboia was present at the opening of the new church building, and the Bishop of Assiniboia was present at the opening of the new church building.\n\nNEW SPRING & SUMMER MILLINERY, AND FANCY GOODS.\n\nMISS MACK & CO,\n\nCAMERON'S BLOCK,\n\nROBERT THOMSON,\n\nSIGN & ORNAMENTAL PAINTER,\n\nDecorative Painting & Specialty.\n\nPRINCE ALBERT\n\nPlating Mills and Sash and Door Factory\n\nDecorative Painting & Specialty.\n\nGOODFELLOW BROS., PROP.\n\nPrince Albert, A.W.T.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 42\n\nLath, 75 cts. per bundle.\n\nShingles, $6.50 per M.\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\n\nPHOTOGRAPHS!\n\nCanada Pacific R'y. Co.\n\nWestern Division.\n\nNEW STUDIO!\n\nEAST END.\n\nNOTICE.\n\nI hereby intimate that all my accounts are now closed, and all parties indebted to me are requested to settle the same immediately; if not paid by July 1st, I shall be obliged to take legal proceedings.\n\nWM. GORDON.\n\nApril 18th, 1884.\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT\n\nPlating Mills and Sash and Door Factory\n\nDecorative Painting & Specialty.\n\nGOODFELLOW BROS., PROP.\n\nPrince Albert, A.W.T.\nNOTICE.\n\nBuffalo Hall!\n\nHosiery, Gloves and Dress Linings.\nReady-made Clothing and Table Oil Cloths\nEvaporated Peaches, Evaporated Apples,\nPrime Tomatoes, Choice Cat Meal,\nAnd Canadian Cheese.\n\nTOBACCOES.\nPrince of Wales and Gold Flake Oh-wine, Mistletoe Navy, Golden Rule\nand Big Banana Smoking Tobacco.\n\nPure Lime Juice and Fruit Syrups.\n\nBETTS & Gwynne.\n\nNOTICE!\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that after June 30th their terms will be net cash to all who do not make satisfactory settlement of their accounts to that date.\n\nN.B. -- A good supply of American Coal Oil now on hand.\n\nJ. L. JOHNSON & CO.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\nStationery, Fancy Goods,\nMusical Instruments,\nToys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nThe Prince Albert Times\n\nAND\n\nSaskatchewan Review.\n\n$2.50 per annum.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nAdvertise in The Times and you are certain to succeed in your business.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJOB PRINTING\n\nOf all descriptions done neatly quickly and cheaply.\n\nSPINK & MAVETY, - PROPS\n\nRiver St., Prince Albert, Sask.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884080101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5996, "total-output-tokens": 4155, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3446, 1], [3446, 12032, 2], [12032, 16590, 3], [16590, 17902, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]