[{"id": "4c83652024fd8d5ca65cfcd676bf48d7fb0bd2d8", "text": "A LOVER STORY\n\n(From The Times)\n\nOnce upon a time—there was once—a beautiful boy wandered away from his home in the woods. And wild flowers bloomed in glorious gay. He knew not where he was going, but his heart was filled with thoughts of love. To see the flowers there and there and polish a sword.\n\nAnd so he came to an old child who did. Having no fear, he came near to see. The beautiful flowers sent each year. When, perchance, he came face to face with a little girl of a sweet grace. And as bright as the morning rose. And as soft as the evening dew. Unmoved by solemn alarms— Their eyes telling, as no tongue could, their hearts' secrets, and their souls' charms. Thus fate made him little sweetheart. And have from that day each been known. Through life's many years they have kept A pledge of faith unmarred by doubt.\n\nH. T. McPhillips\n\nTHE FLAG OF CANADA.\n\nOh! how the flag was born at our side. Over the deep to earth's furthest bound. It takes a nation's life then begins With its first breath, as the eagle soars Upward to flight, as the flight unfolds Unto its native breeze. Let it flutter and curl On every wind, and let it wave And overshadow us with its majesty Till the last star fades from the blue. When earthly glory shall pass away.\n\nH. T. McPhillips\n\nSTEEL'S SCOUTS.\n\nPRESENTATION OF MEDAL—SPEECH BY GEN STRANGE—ADDRESS, PERSONATION AND REPLY.\n\n(Portage la Cloche, Ont.)\n\nOn Saturday evening, September 4th, Steele's Scouts were presented with the medal awarded for service during the last war. General Strange was present; his appearance was greeted with hearty cheers. He made a few remarks congratulating the men on the occasion, and asked Mr. Beaton to make the presentations. One by one the men were called up, and each signed the roll. General Strange gave them hearty shake of the hand, and expressed a wish that the recruits might long live to see the knowledge which he had so well earned. The ceremony was manifestly most impressive, and when the General, at the conclusion, asked them to dress them he received unanimous applause.\n\nHe said: \"My comrades—on account of age you may not be able to serve as soldiers during the next few years, and I have never commanded a corps that I admired more than this. I am glad to see that the enthusiasm which has been shown by Steele's Scouts is bravery and the chivalry of Alberta (applause). It is impossible that any man who has seen you may pass you in the streets and perhaps be unable to recognize your individual features, nor will you forget that gallant troop of men, nor will you ever have been enabled to render the country you love more illustrious, but you may (Cheers). I may say that I am glad all here to night. Some of you have come a long distance, and you are satisfied and others are not. But wherever you may be, I trust and believe there will ever be a bond of sympathy and affection between you and those who have served in the same. Without your assistance in the foreground would have been more impossible to move such large forces of infantry, cavalry, artillery with train and wagons, through that country and you know that a country was infested by Indians. You have been the gallant 65th—(cheers)—but with little military experience. But in moving in the rear of the column, you have been well served by your thin line of scouts under the gallant Steele. (Cheers) The Indians were very savage when engaged, and in my report I stated that you were the eyes, ears and feelings of the force. You have had little experience, but you have been a source of comfort. (Cheers) I assure you had I found fault with any of the men of your corps or greatly questioned your conduct, that would be the end of the campaign, and I will always feel proud to have commanded you. (Applause) I have nothing to say about anything in the papers about part of the reports not having been published. Gen. Middleton is not here to night and I do not intend to say anything of the matter in dispute, only this that Major Steele's report regarding the Indians, me, was entirely forwarded to Gen. Middleton and it has not been published. But it is necessary for me to know that we did our duty and did our best. (Applause) Some of you are American citizens, but this campaign shows that Canada is thicker than water. (Cheers) Yet fell into line to help the citizens of Canada in their own borders. It was a feeling, worthy of note. I hope I will not live too late to see the fruits of our labours, and the occasion remembered, for it is worthy of being remembered. (Cheers) I know that you may be wanting to see me again, but I am sure that the campaign, for these purposes, are still fresh, and will long remain fresh in your memories. (Applause) You have been, after that long march to Pitt, with all its attendant hardships and dangers, but while making the perilous passage you did not need to be reminded of the incidents. But while making it Steele's Scouts were always ready to respond to the call. When I looked forward I could always see the country dotted over in a scene such with Indians like that of the last campaign. If the Indians did not want to get inside that ring fence (Laughter and applause.) After the speech was ended, General Strange turned toward me and said: \"I am glad to see that you have made that decision, and that they will now wear their uniforms like the real thing.\" (Applause.) Continuing General Strange had served with the cavalry corps of different provinces, Sikhs, Plains and Mounted, but he thought that Alberta had a better corps than that of Alberta. He believed that Alberta would yet be a great province. He said: \"I am very sorrowful that Major Steele, Capt. Owen, and Lunt, Corryell were not present, but I could not carry a vote in my favour to have them here, but the public media, I felt that I could not wear medal that was not given to all the men who served in the campaign. Sir John Macdonald has made that decision, and that they will now wear their uniforms like the real thing.\" (Applause.) Continuing General Strange had served with the cavalry corps of different provinces, Sikhs, Plains and Mounted, but he thought that Alberta had a better corps than that of Alberta. He believed that Alberta would yet be a great province. He said: \"I am very sorrowful that Major Steele, Capt. Owen, and Lunt, Corryell were not present, but I could not carry a vote in my favour to have them here, but the public media, I felt that I could not wear medal that was not given to all the men who served in the campaign. Sir John Macdonald has made that decision, and that they will now wear their uniforms like the real thing.\" (Applause.)\n\nFOR GENTLEMEN'S FURNISHINGS!\n\nIN ALL BRANCHES\n\nFOR White Cotton,\nFactory Cotton,\nFlannels,\nSheetings,\nTowellings,\nDress Goods,\nSilks,\nLinen, etc.,\nGO TO J. M. CAMPBELL'S,\nGROCER\nAND DRY GOODS MERCHANT,\nPRINCE ALBERT, SASK\nDRY LUMBER.\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowall & Co., Newspaper Advertising Bureau, Toronto, Canada. Send 10s. for 100-pp. Pamphlet.\n\nWe are prepared to Contract for Buildings at a low rate by any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\nTELEGRAPHIC.\n\nTHE VERY LATEST NEWS BY TELEGRAPH.\n\n(By Special Telegraph.)\n\nWednesday, Sept. 13.—The C. P. R. telegraph system is open for general business to all points in the North-West and to Winnipeg. From Edmonton to Manitoba to the provinces of Ontario and Quebec the rate is 25 cents per word, while the rate from the provinces to Manitoba and west thereof will be $1.00 for ten words, a reduction of 50 and 60 cents respectively from the rates in British Columbia. The rate will be $1.00, a reduction of 50 cents all round.\n\nCapt. Macdonald, N. S., who accompanied the last Hudson's Bay expedition, has returned over land from Fort Factory. He learned that the steamer \"C. W.\" which left Arctic Bay passed through the straits without being impeded by ice. Capt. Macdonald says that the steamer are capable of being navigated certainly for four months in the year, and possibly longer, if the weather permits.\n\nThe loss of a whale having gone through a portion of the straits with some ice packs, the steamer was obliged to turn back, but the straits are open to navigation during the month of June, and that the ice so encountered was probably that which had drifted down from Fox Island.\n\nCapt. Macdonald left York Factory on the 8th inst., and proceeded by canoe to Arctic Bay, and in company with Capt. Macdonald, a party of Indians and canoes left Arctic Bay and proceeded to the northward with their canoe boat and provisions, and returned several weeks ago.\n\nHe started for England on Wednesday, and will return to England at the end of three or four months.\n\nWilliam Thomson, a Whig newspaperman, has been arrested at Charlton, England, over the unexpected receipt of urgent orders from the Admiralty to explain the conduct of the government in regard to the conduct of the war, and will be employed by day and night, if necessary. This matter is regarded as involving possible criminal implications.\n\nThe Post Office Department say that Austria has formally notified the United States that Austria will oppose any attempt by Russia to encroach upon the Blickezelenkamp. A special agent has been sent out to investigate the important despatches for Emperor William.\n\nThe Englishmen defeated Montreal at cricket.\n\nThe Mayflower defeated the Galatea in the final contest for the American cup.\n\nThe Methodist Conference is considering the question of extending the personal tax five years.\n\nJohn Carling will probably visit Montreal next week.\n\nConsiderable excitement was caused at Bathford by the announcement that suspicious Indians had deserted from Fort Saskatchewan.\n\nThe steamer struck out in the direction of Edmonton, and so far the object of our search has not been found.\n\nA party of mounted police has gone after them.\n\nLondon, Sept. 11.—There are a number of Indians moving from the Blood reserve, and it is understood that they are implicated in troubles across the border.\n\nWinnipeg, Sept. 13.—Sheriff Chaplin will return to Regina next day. He has been summoned to complete his organization of a similar company which will operate in Alberta and on the frontier.\n\nLord White expects the construction of the Police barracks at Lethbridge will be commenced this fall. Fourteen acres are set aside for the purpose.\n\nSir Charles Tupper is still confined to his apartments at Ottawa. Calls are not admitted.\n\nThe Liberal (Progressive) Conference has demanded of the Ottawa Government the enactment of a prohibitory liquor law at next session of Parliament. It has also demanded an inquiry into clergy reserves tenders and appoints a Missionary Superintendant in the North-West. In this connection the name of Rev. John Mc. Duggan, of Moosie, is mentioned.\n\nGovernment officials were present yesterday at the unveiling of the monument to private Watson of the 90th and associated in the City Cathedral.\n\nOfficial information from Department of Justice stated that the act relating to the Administration of Justice in the North-West would be presented after the session of the North-West Council. The number of applicants for the position of Judge is now 4.\n\nThe Powers have agreed that peace shall be in military occupation, but peace will be restored.\n\nThe Queen has decided to refer arrangements of programme for national celebration to public to a joint meeting of the Privy Council, presided over by the Prince of Wales.\n\nThe Montebello Expedition delayed by the appearance of Indians in the district.\n\nAn interesting topic of conversation among the officers is the wording of the toast to the Czar, proposed by Lieutenant Francis. Is it the army banquet attending at camp to do the Czar a good turn and do him a kindness to the health of his majesty the Czar?\n\nIn former years he always used to say a few words about the Czar, my friend and august ally the Czar.\n\nThe difference in phraseology is taken to mean that an alliance is ended. In diplomatic circles it is understood that the relations between Austria and Russia have been broken off.\n\nWinnipeg, Sept. 13.—Deputations from Edmonton state that nothing is known of the movement of Indians in that direction as reported from Battleford.\n\nThe new grain rates have gone into effect, and the C. P. R. resolution of the present year.\n\nThe North-West Council met today.\n\nYesterday cable advices were received from Hugo Sanderson, President of the Hudson's Bay Company, that he has accepted the position of Superintendent for immediate commencement of the con- struction of the Hudson's Bay Railway, and that the company will make every effort to see it in progress, and that he will sail for Canada on Sunday, accompanied by the railroad engineers of the road, Mr. Sinclair.\n\nThis is said to mean—by those in a position to know—that the actual work will begin at once, and will be carried on with all possible vigor to the utmost of its resources. This news has been received with great satisfaction at Winnipeg.\n\nHOW TO BUILD UP YOUR TOWN.\n\nDon't fret.\nTalk about it.\nThink about it.\nBeautify the streets.\nEnliven the markets.\nAdvertise in newspapers.\nElect good men to all offices.\nKeep your schools in good repair.\nAvoid gossip about your neighbors.\nDo your trading only where your house near.\nSell all you can and buy all you can.\nIf you are rich, invest something; employ somebody, be a \"trustee.\"\nIf you don't think of any good work you may do, you are not doing anything.\nRemember that every dollar invested in permanent improvement is worth more than any other investment.\nBe courteous to strangers that come among you, so that they may go away pleased.\nAlways be on the men who go in for improvements, your portion of the town will be nothing other what is just, the best kind of property, and therefore because it is not at your own door, nor fear that your taxes will be raised fifty cents.\n\nDon't use rubber stamps on your letter heads; that is a dead gage away on your business. Get your letter heads printed in it, put your letter heads, envelopes, business cards, etc., printed by a local office.\n\nNever condemn the local paper until it has fairly missed you. It has dealt with you promptly written to it or gone into the office for a copy of the paper. In case it is wrong he will lose no time in telling the public about it.\n\nRemember that the local paper is as much for your town as the local newspaper. Every paper sent out as an advertisement should be sent to the local paper at prices of the place, and people get a better idea of what the local papers thus from any other source.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nThis Powder never loses its purity, and is more than the ordinary brands and cannot be compared with any other brand of this description.\n\nJ. L. JOHNSON & CO.\n\nBuffalo Hall!\n\nRECEIVED PER STEAMER MARQ IS\n\nDry Goods,\nClothing,\nGroceries,\nProvisions\n\nEvery Department fully stocked—Special Bargains in\nTextiles, Goods, Embroideries, Prints, Sheetings and Plain Cottons.\nSpiced Roll Bacon, Maple Sugar and Maple Syrup\nThe Largest Stock of Clothing in town.\n\nBETTS & Gwynne.\n\nFURNITURE.\n\nCheaper than Ever.\n\nam now prepared to sell Furniture cheaper than ever before offered in Prince Albert. My stock consists of all\n\nThe Latest Designs!\n\nwhich I am selling at reasonable rates to make room for a large stock coming up by boat.\n\nCall and inspect my stock and get prices.\n\nWM. STOBART & CO.\n\nNEW GOODS\n\nAT\n\nM.SS MACK & CO\n\nFirst Door East Telegraph Office.\n\nWM. STOBART & CO.\n\nIndian Traders.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1886091701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6272, "total-output-tokens": 3726, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 7634, 3], [7634, 16043, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]