[{"id": "2d31c2a6aa7f97091d48b1221a707d39e7077ef9", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\n\nVOL. 6 - NO 43\nPRINCE ALBERT, SASK., FRIDAY, SEPTEMBER 28, 1888. $2.50 A YEAR.\n\nLOCAL ITEMS.\n\nMiss McKay, school teacher at Armadale Mission, who has been visiting her sisters in town, Mrs. Hard and Mrs. W. R. Goodfellow, for the last two months, returned home yesterday afternoon.\n\nSettlers ought now to be very careful about prairie fires. We notice large fires are burning in various parts of the river country to the south of the town. The fire guards should be on the lookout for parties letting go fires.\n\nNotice of Sale of Furniture, etc.\n\nMr. L. D. Dion, a prominent official of the above department, Ottawa, writes: \"I am very glad to give you the following news: Mr. H. J. Smith, from my district, from which I suffered for nearly three years.\"\n\nThe Rev. Mr. Campbell will sell by public auction all his household furniture and other effects on Saturday next.\n\nAs will be seen by an advertisement of his in this paper, the Indian Department are calling for tenders for 1750 sacks of flour to be delivered at different points in the district. We hope that our local millers will secure the contract.\n\nIt is rumored that our bandmaster has ordered from Qu'Appelle to take charge of the band here. It is no bad if our band is to lose its head as we cannot not receive proper support from the government. We would like to find one hundred or so residents who would contribute $4 or $5 annually and thus enable us to purchase a good bandmaster. Get a move on now and help make out a subscription list.\n\nThe latest news is that newspapers have been ordered by the government to take a paper and refuse to take another. Under the law, the person who allows his name to be used for the purpose of obtaining time unpaid or taking up papers from the post office, and then orders the same paper again, is liable to be fined, and may be called upon to arrest and punish anyone named as the thief.\n\nThe Allan's Sunday School held their fifth annual exhibition in Mr. J. M. Campbell's barn, east of the Mechanics' Institute. Every child was made to make the show more attractive and a great success than formerly, and the information that there were more numbers and of a much finer quality than on previous occasions. We hope that the parents will attend Mr. Allan's next year's fair. The band will be in attendance all afternoon.\n\nThe St. Alban's Sunday School held their annual exhibition last week. There were two large vans loaded with children and another congregation with the Rev. Mr. McLean. After the exhibition of the Van Archibalds, McKay left the church for the grave grounds, where they met Mr. and Mrs. Emmanuel, who were there when they arrived at five o'clock. After sporting around for a while the children were regular as clockwork, and then Mr. McKay left for home about dark after spending a very enjoyable afternoon.\n\nWigmore's Great Clearing Sale is still going on. Bargains are to be had every day.\n\nFor ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's\n\nADVICE TO NOTHERS.\n\nIf you are interested in getting your feet into a nice chunky leather shoe, you should try the new line of boots and shoes now on display at Wigmore's Shoe Store. They are well worth seeing.\n\nFor Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's\n\nADVICE TO NOTHERS.\n\nIf you are interested in getting your feet into a nice chunky leather shoe, you should try the new line of boots and shoes now on display at Wigmore's Shoe Store. They are well worth seeing.\n\nFor Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's For Ladies' Jackets and Jerseys, men's\nTHE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nAT PRINCE ALBERT N. W. T.\nTerms—Two per centum in advance\nfor each copy, 15 cents each.\nIt is now time to pay in advance\nfor the balance of the year.\nTripartite advertising rates will be\noffered at first insertion, and for five lines for all subsequent insertions.\nNo contracts made under three months.\nNo advertisements inserted for less than $1.00.\nAll letters to be addressed to the Proprietor.\nJ. D. MAVEETY, Proprietor.\n\nFRIDAY, SEPT. 24, 1888.\n\nNORTHWEST ASSEMBLY\n\nIt is now three months since the election of members for the Legislative Assembly took place and there does not appear to be a probability that the result of the election will be declared, or the validity of the elections in general will be questioned in the courts elsewhere, and we may therefore assume that all parties are satisfied with the result. As far as the selection made by the electors can be construed, we must not fail to admit the wisdom of their choice; but other important considerations arise and none more important than the question: Was the election legal? It may seem strange to some people to learn that this question is vital as to whether we have a Legislative Assembly or not; we are not legal experts and therefore do not pretend that our present contentions that the election was invalid are based upon a great deal of work, but will call the attention of those in authority and endeavor generally to one or two points in connection with the election, which are worth looking into. The legislature was elected by an act of the Dominion Parliament passed on the 2nd day of May, 1883; this act provides the constitution of the assembly, defines its powers and also makes provision for holding the first election. Section 6 of this act provides that the Governor-in-Chief may appoint a clerk of the assembly, and it is enacted by section 6 that \"The Lieutenant-Governor shall, when occasion requires, cause a clerk to be elected by the clerk of the assembly, as he thinks fit.\"\n\nIn June last the occasion arose for holding an election, and under the power vested in him by said section the Lieutenant-Governor caused writs to be issued by Mr. Laird, who was then clerk of the assembly, as that office does not appear to have been appointed until after the elections were over; the writs were issued by Mr. A. E. Foggan, who was then clerk of the North-West Council. Mr. Laird, as governor designate, acted under section 19 of the North-West Territories Act, S. R. C. chap. 9, but that section was repealed by Sec. one of the 54 V.R.C., 1887. Our contention is that Mr. Foggan had no authority lawfully conferred, to issue the writs, and that in consequence they were invalid and all proceedings taken in pursuance of them are void or voidable. According to the provisions of the last cited Act, invalid that the legislative Assembly of the North-West Territories provides, as it may do, the law in force therein at the time of the passing of this act relating to the election of members of the Council of the North-West Territories shall, subject to the provisions of this Act, apply to the election of members of the Legislative Assembly.\" What was the law then in force? Up to May 1888, the law in force relating to elections for the N.W. Council was contained in the N.W.T. Act, S. R. C. chap. 9 sections 18 to 25 inclusive and in a proclamation issued by the Lieutenant-Governor on May 28th, 1888; Mr. Laird issued that proclamation under powers vested in him as Lieutenant-Governor by sec. 19 of said Act. But by the act of 1888 sections 18 to 25 of chap. 9 N.W. C. were repealed, thus taking away any powers Mr. Laird might have had to make regulations.\n\nMr. Dewdney however took upon himself to repeal Mr. Laird's proclamation by a new one of his own, dated May 28th, 1888, in which he stated that he was acting for the Lieutenant-Governor and proceeded therewith. The position we take is that Mr. Dewdney had no authority to issue the proclamation above referred to, and that the only authority he had was that of a Statute of Quebec, nothing the repeal of a Statute did nullify what has been done under it while it was in force, and therefore we believe that Mr. Laird's proclamation still remains in force as the only law, it appears to us that Mr. Dewdney exceeded his authority, not wilfully we suppose, but without having given sufficient consideration to Acts of Parliament. It would not be material to mention whether the election was conducted under a proclamation made by Mr. Laird or by Mr. Dewdney, had the existing state of the law been preserved, but as Mr. Dewdney made certain changes, according to the law it existed, he seems to have been obliged to change between the nomination and polling days, this has narrowed down, in one week and we know that that change alone deprived the electors of the right to vote. We further assert that the North-West Council, by reason of the non-existence of their franchise at the recent election, and had the two weeks remained the result would have been different. Mr. Dewdney's proclamation differs very materially in one respect from Mr. Laird's, and we have said enough for the present.\n\nThen if the elections were illegally held, what must be the result? Would Acts passed by such a Legislature have force of Law? We believe that thereafter no act so legally elected would be binding on the settlers returned cannot be lawfully take their seats in the Assembly and that they will meet at Regina simply as any other like number of persons might meet together, and that the settlement will not proceed to legalize it. If such be the case of the territory it should at once be remedied; it will be a waste of time to call the members together, if when they meet, it may only be to learn that they have no authority to do anything, or to do anything. It will be remem- bered that in 1881 the North-West Council was met by Mr. Richardson's opinion that owing to the repeal of certain Acts, any Ordinances passed by it would be nullified. A reference to page 1881, will show Mr. Richardson's opinion as given by him to the council—if there exists any illegality in the late elections the time should be lost in correcting matters so that it can be done either by holding a new election or by legislation at Ottawa; the former would entail a heavy expense on the country and it is very doubtful if the Dominion Parliament can do the latter. This question will sooner or later come before our legal tribunals; cases will arise in which the validity of Acts of Assembly will be questioned and it would be most unfortunate and might be very disastrous should the courts decide against their legality.\n\nHORSE SHOE STORE\n\nJust arrived.—A Large Consignment of Choice Groceries, Canned Goods, Pickles, Sauces, etc.\n\nFifty Chests Choice Congo Tea\n\nWhich we will sell until further notice at the price.\n\nFresh Impostations in\n\nFaney Dry Goods, Millinery,\n\nRibbons, Hosiery, etc., etc.\n\nFull Lines of Windowcurtains\n\nIn Lace, Tapestry and Japanese, Fancy Blinds and Shade Rollers.\n\nJust arrived.—Large Stock of\n\nPATENT MEDICINES, STATIONERY, ETC., ETC.\n\nBOOTS AND SHOES ARRIVING WEEKLY\n\n10,000 CHOICE CIGARS!\n\nAt Manufacturers' Prices. Also a Full Line of MEN'S AND BOYS' LIGHT SUMMER SUITS\n\nIN SERGE, LINEN, ETC.\n\nTHOS. O. DAVIS\n\nFresh Dairy Butter and Fresh Eggs always on hand.\n\nROBERTSON & ROBERTSON\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Uttings, Trowsering and Overcoating WORSTEDS.\n\nIN ENGLISH AND AMERICAN LINES.\n\nCANADIAN TWEEDS\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery.\n\nPublic and High School Text Books.\n\nSchool Requisites of every description.\n\nStephens' Blue Black INK,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.,\nTERRITORIAL NEWS\n\nEDMONTON.\n\nFrom the Bulletin, Sept. 8.\n\nHorse feed is now 28 cts. a pound.\n\nWild black currants are plentiful at 10 cents per pound.\n\nHay markets are drying up rapidly and hay is consequently becoming more plentiful than usual.\n\nR. Ross has the contract for supplying all cords of wood to the police at Fort Saskatchewan at $2 per cord, and P. McCauley (3 cords) at Edmonton at $2.50 per cord.\n\nAn East Edmonton farmer has conducted experiments in growing alfalfa in a manner that: \"In order to clean our own doors, fields and pasture lands the time must be shortened to the month of May. To be farmed and used as a substitute for the grasses of Alberta prairie fires are an absolute necessity.\"\n\nThe farmers in this district who raised black or bulling barley this year are highly pleased with the experiment. It ripens in from five to six weeks and provides for the harvest, yields more bushels to the acre and is superior for feeding purposes.\n\nFORT MACLEOD.\n\nFrom the Gazette, Sept. 13.\n\nThe H Division, N.W.M.P., detachments are to be ordered as to barracks for the winter quarter. Men from D Division will take charge during that time.\n\nThere is no indication that the Indians will attend the fall hunt meeting here, also that there will be a fine turn out in horses. Several of the latter have been already.\n\nYesterday morning a familiar old time shooch came howling down from the mountains, bringing a miscellaneous collection of pack animals, dogs, blankets, rope, paper, hay, stacks, flour and D soup tins. All but nine were thrown down. No damage was done in town.\n\nOn the 7th ult. troop D, N.W.M.P., left Edmonton (Major Steel in command) for Battleford, via Fort Macleod. The trip was made successfully to the point where the river flows into Lake of the Woods, where an outfit of wagons was purchased and the party proceeded to Lake of the Woods. The trip was very successful one, and proves that the past can be utilized for carrying a large military outfit. The outfit consisted of about eighty pack animals, and was composed of the mounted police and the detachment of the Mounted Police. Major Steel deserves credit for the successful and satisfactory manner in which he accomplished what was a very difficult undertaking viz. the Indian trouble. The people of Edmonton regret the departure of the troop and the loss of a valued officer who has won the respect and esteem of all.\n\nBATTLEFORD.\n\nFrom the Herald, Sept. 13.\n\nMrs. Finlayson's bear made another raid on the house last night and was captured and made such havoc with the milk and butter that Mrs. Finlayson had to put some of her customers on short allowance for the week.\n\nSt. George's Church has lately been provided with a very handsome lectern. A new window has recently been placed out the whole aisle of the church. The improvements were very much needed.\n\nA warrant was issued by Judge Gray, Nov. 1st, on Monday last charged with stealing a valuable bull belonging to C. Thomas. He admitted the charge and promised that he did not steal the fellow. He gave bail for his appearance at the next sitting of the Supreme Court.\n\nThe day after the inspection of the court of law, Mr. Fred Mitchell met after an adjournment from the 7th May Court. An analysis of the stomach had been made by Dr. Smith, who stated that the stomach contained no traces of poison, yet its appearance was such as if death should result from an irritation of the stomach.\n\nAfter reading the following verdict: \"That Mitchell died of natural causes, effects of mental irritant poison, but from the manner of his death cannot determine cause by which death ensued.\" The day in question, request was made for the absence of one of the jurors.\n\nA Dead Drop!\n\nPRICES\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nFar surpassing any previous seasons, both for richness, design and quality. The Variety of New Goods in Every Department is immense\n\nCall and Examine Our Stock\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan, Alta.\n\nMcNally & Chinkskill,\n\nBattleford, Sask.\nWEDDING BELLS.\n\nThe marriage of Mr. A. H. Stewart, manager for J. M. Campbell, and Miss Acid, of this town, by the Rev. Dr. Jarlton, took place at the residence of Mr. Campbell, on Wednesday last. The ceremony was performed in the presence of a large number of friends. Miss Clark performed the duties of bridemaid, and Mr. Campbell assisted in carrying the groom through the trying ordeal. After the ceremony, the newly married couple sat down to a hearty dinner, prepared by the hostess, Mrs. Campbell. The wedding presents were handsome and numerous, and included the following: a set of plates; Mr. and Mrs. Stewart, gold watch and chain; Mr. and Mrs. Campbell, basket, plumb photo frame and lady's work set; Mr. and Mrs. Clark, painted瓢; Mr. and Mrs. Donaldson, silver dinner dish; Mr. and Mrs. Searston, silver plumb dressing case, collar and cuff box; Mr. and Mrs. Miller, glass dinner and tea set; Mr. and Mrs. John- son, dome dessert knishes; Mr. and Mrs. Davis, bone china dinner set; Mr. and Mrs. G. Miller, silver cruet stand; Mr. and Mrs. Macgillivray, silver butter dish; Dr. and Mrs. Poveshell, sugar bowl; Mr. and Mrs. Knowles, carving knife and fork; Rev. Mr. and Mrs. Campbell, syrup pitcher; Mr. and Mrs. Hamilton, half dozen silver teaspoons; Miss Nichol, oil painting; Mr. and Mrs. Donaldson, silver dinner set; Mr. and Mrs. Macdonald, album; Mr. and Mrs. W. B. Goodfellow, half dozen knives and forks; Mr. and Mrs. McKeown, silver fruit set; Mr. and Mrs. Macdonald, silver fruit dish; Rev. Mr. Wright, fancy pen; Miss Hamilton, pair Northampton, banjo watch holders; Mr. and Mrs. Winship, silver pickle dish and spoon holders; Mr. and Mrs. Hamilton, pair silver handled spoons; Mr. D. Hamilton, pair ring stage; Mr. C. McKay, table mate; Miss C. B. McKay, silver vase; Mrs. and Miss Hamilton, silver creamer and sugar bowl; Mr. and Mrs. Sutherland, silver butter dish; Ms. N. McKeown, silver syrup pitcher; Mr. E. M. Smith, half dozen spoons; Mr. G. C. McLeod, silver lamp; Mr. W. V. Maclean, plumb portrait cabinet; Mr. B. Spence, silver creamer; Mr. C. W. Wigmore, pair vases; Mr. T. C. Baker, silver teaspoons; Mr. and Mrs. James Stewart, Winship, silver creem, silver knife and clock; Mr. T. Thomson, silver cruet.\n\nCALGARY.\n\nFrom the Tribune, Sept. 12.\n\nThere was quite a while from this morning, the first for this season, but fortunately what grain is still uncut is too far advanced for the harvesters. The wheat and garden seed will likely be blackened but everything taken into consideration we cannot grumble.\n\nOn Saturday Mr. J. F. Brady, of the Kootenay district, and Mr. Barwell, of the Park, were driving, the rigging of which was badly broken. The wire, which was broken, and the horse took flight and ran away throwing Mr. Brady overboard. Mr. Barwell was not much hurt by his thigh. Mr. Barwell was not much hurt by his thigh, a shaking up, but he incurred the glaze of medicine all the same.\n\nThe cow was badly dally dallied so long with the loud noise on the street that an action for damages is looming up for injuries sustained by two horses that were badly frightened by the noise. The owner of one of the animals has offered to put on a team and man to clean up the streets for the next six months for twenty-five cents per day. He says the injury to horses and buggies cannot be avoided, but still the council will not take a step.\n\nFrom the Herald, Sept. 12.\n\nAt the police court on Friday afternoon Joe Culbertson was brought before (Judge) Mr. J. P. Bowes, charged with the information laid by Joe Botting for assault in connection with a little fracas which occurred near the Royal Hotel opposite the Royal Hotel about an o'clock on Thursday evening. Mr. Culbertson was not arrested, as he had bail at once for his appearance, and was ordered £5 costs. This case is said to have originated when Culbertson had a fight with Mr. Botting when Mr. Culbertson interfered in Mr. Botting's behalf. Botting was also booked £3 and costs for disturbing the peace by the police on information laid by the chief of police.\n\nA stiff race for the championship of the province, between the Grey and Kemp, will be run along the Paterson river in Australia to morrow afternoon.\n\nW. STOBART & CO.\n\nIndian Traders\n\nGeneral Merchants\n\nPrince Albert and Duck Lake\n\nSASK.\n\nRUSSELL & DAVIS\n\nW.HOLESALOE AND RETAIL\n\nButchers\n\nBeef, Pork, Mutton, Sausage,\n\nBacon, Ham and\n\nGAME IN SEASON.\n\nPRINCE ALBERT\n\nBREWERY\n\nPure and Sparkling\n\nAMBER—Hop—ALE,\n\nDelivered to all Parts of the Town.\n\nM'INTOSH & CERRDOW\n\nGet Your\n\nSCHOOL\n\nSUPPLIES\n\nAT\n\nCANN'S\n\nBOOK STORE\n\nKEPT CONSTANTLY ON HAND.\n\nREPAIRING PROMPTLY ATTENDED TO\n\n\"BELI.\"\n\nORGANS\n\nUnapproached for Tone and Quality.\n\nCATALOGUES FREE.\n\nBELL & CO., Guelph, Ont.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. P. Bowell & Co., Newspapers Advertising Company, 10 South Main Street, Toronto.\n\nDonaldson & Pembroke.\n\nBUFFALO HALL!\n\nMaking Room for Winter Stock now on the road from Montreal, Toronto and Winnipeg.\n\nIn order to make room for Fall Goods the balance of our Dry Goods and Clothing\n\nNow in stock will be sold\n\nFOR TWO WEEKS ONLY\n\nAT COST FOR CASH.\n\nThe Public are invited to examine the Bargains.\n\nRemember—For Two Weeks only, and for Cash, you can supply your wants in the above Goods.\n\nBETTS & GWINNE\n\nR. C. W. & CO.\n\nAll parties indebted to R. C. WIGMORE & CO. are requested to make an immediate settlement.\n\nInterest charged on all overdue accounts.\n\nONE MORE\n\nFOR THE\n\nGreat Clearing Sale\n\nBest Assorted Stock\n\nof\n\nCONFECTIONERY\n\nGO TO\n\nH. M'DOUGALL'S\n\nBAKERY.\n\nW. R. FISH'S\n\nCENTRAL STORE\n\nH. MACDOUGALL\n\nGO TO\n\nAGNEW'S\n\nFOR\n\nStoves\n\nStoves\n\nStoves\n\nHeating Drums\n\nStovepipe\n\nCoal Oil\n\nT.J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888092801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 5384, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3864, 1], [3864, 11828, 2], [11828, 16041, 3], [16041, 21794, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]