[{"id": "46392cec013d9f74405d9eaf65c231a13f9f12e8", "text": "INCONSISTENCY\n\nSomeone, somewhere or other, has remarked that consistency is a \"feast,\" we agree with him; we would like to know where he became acquainted with that abstract quality.\n\nCertainly not in our town council.\n\nAt the first meeting of the present council the appointment of auditors was put up for discussion. Mr. Smith, a certain citizen of well known ability was suggested, but was immediately objected to on the ground that he was a government official; the councillors who objected, in the breath, appeared to forget the fact that they had one for tax collector. Such conduct is dishonest, contemptible and deserving of censure, and we will not withhold ours.\n\nWe believe the true reason why the proposal was rejected was that some appointed, was, that the councillor, or some of them, were afraid to submit the books and accounts of the municipality to the audit of a competitor, lest the result might not be something satisfactory to some parties. The auditors, we believe, may be good enough men and will, we have no doubt, perform their duties honestly. We trust that they will make a thorough investigation of the town's finances and that their report will be made public so that the ratepayers may know what taxes have been taxed for during the past three years.\n\nThe by-election held in Peterborough, Ontario, yesterday, to fill the vacancy caused by the resignation of Hon. J. Royal, resulted in the return of the Hon. A. A. C. La Riviere, Conservative, by over 100 majority. His opponent was Mr. Richards, a Liberal North star, a former and an avowed grit and Kost. Notwithstanding the railway scandal and disallowance the policy of the government has been sustained at the first by-election in Manitoba. The last election was close, I am a little bit of regret that Province could not get a representative a man with a cleaner public record, but we think there was very little chance between the two candidates except from a party point of view.\n\nA large sum of money was spent some time ago by the Town Council in procuring a hook and ladder truck so necessarily was it constructed to fit when it was suddenly required to use as a fire engine. It was bought for $250 and the town authorities provided for its use by our own men.\n\nWe call the attention of the ratepayers of the town of Prince Albert and our readers generally to a judgment by Chief Justice Taylor of Mani- toba, published in another column, this judgment is worth perusing as it is important bearing on taxation and interest on taxes.\n\nNow that it is occupied, we think that the building formerly used as a school should be removed. It stands on one of our most used streets, and the town authorities should see that the street is opened up once.\n\nBIRTH.\n\nPRINCE ALBERT—On the 23rd instant, at the barracks, Prince Albert, the wife of Staff-sergeant Baverley, on the 23rd December, gave birth to a daughter.\n\nSUNDAY CHURCH SERVICES\n\nSt. Albans—9 a.m., Sunday School; 10 a.m., Communion in charge of Rev. Canon Field; 11 a.m., Sermon—Rev. Canon Field.\n\nSt. Paul’s—10 a.m.—Rev. Canon Field.\n\nSt. James’—10 a.m.—Rev. Dr. Mc- Donald.\n\nSt. John’s—10 a.m.—Rev. Mr. Mackay.\n\nSt. Matthew’s—10 a.m.—Rev. Mr. Wright.\n\nSt. Paul’s Presbyterian—11 a.m., and 7 p.m., Sunday School.\n\nMethodists—10 a.m., Sunday School; 11 a.m., Service—Rev. Mr. Smith.\n\nEpiscopalian—10 a.m., Service—Rev. Mr. Smith.\n\nThis paper may be found on the following routes:\n\nNew York—Route No. 1.\n\nBoston—Route No. 2.\n\nPhiladelphia—Route No. 3.\n\nBaltimore—Route No. 4.\n\nWashington—Route No. 5.\n\nMontreal—Route No. 6.\n\nToronto—Route No. 7.\n\nHamilton—Route No. 8.\n\nLondon—Route No. 9.\n\nFRIDAY, JAN. 25, 1889.\n\nRESPONSIBLE GOVERNMENT\n\nThe topic now appears to be attracting considerable attention and is more likely to be discussed at the approaching session of the Federal Parliament. We were in hopes that the matter would have been allowed to remain in abeyance until the end of the present local Legislature, but there appears to be a small number of men in the Territories, who, from motives of personal ambition, would like to see the com- pany purchased by the expenditure of a Territorial Cabinet. We have no hesitancy in saying that this District, almost to a man, is satisfied with the existing system of govern- ment, and we believe that a large majority of the ratepayers of the district are also satisfied; but there are a few political politicians who are not; they are ambitious; they would like to have \"H.M.\" prefixed to their names as ministers of the Crown, and in order to gain this end they are willing to make the country suffer.\n\nWe believe in giving the present system a fair trial, and if it proves a failure it will be in order to make a change.\n\nThe management of Terri- torial affairs by the Lieutenant-Governor and W.C. Council is working out the present mode of administration of those affairs, so far, great satis- faction, and we believe will continue to do so.\n\nWe urge upon our mem- bers to oppose any measure that may be submitted to the Council tending to create a territorial system of Govern- ment similar to that of the Provinces, or if it must be, then we claim for this District the privilege of being left out. We expect that the Govern- ment of Western Canada will try harder to get a fuller measure of responsible Government, as he has been directing his energies in that direction for a long time, but we hope and expect to see him stand alone, and make himself thoroughly obnoxious and ridiculous of late that he will resemble a bladder tossed about by the wind than a representative of the people, and will not be able to carry any weight in any of his schemes.\n\nLet the present system be given a fair trial, say three years, as was originally intended, or let the different districts be erected into provinces. If the system proves a failure and the latter is done, we will be satisfied to accept a change, but not before.\n\nBUY YOUR REMNANTS AT BUFFALO HALL.\n\nBuy your Dress Goods and Ladies' Furnishings at Buffalo Hall.\n\nBuy your Cottons, Cambrics, Muslins, Laces and Fancy Woollens at Buffalo Hall.\n\nBuy your Fancy and Staple Groceries at Buffalo Hall.\n\nBuy your Ready Made Clothing at Buffalo Hall.\n\nBuy your Underclothing at Buffalo Hall.\n\nAnd get the advantage of the heavy discounts they are now giving.\n\nBETTS & Gwynne\n\nR. C. Wigmore & Co.\n\nMen's and Boys' Underclothing\n\nMen's Cardigan Jackets\n\nMen's Pea Jackets\n\n1,000 Remnants of Carpets, cheap\n\nA Full Line of Dress Goods\n\nChoice Selection of Ladies' Hosiery\n\nMen's Overshoes at cost for cash\n\nMitts and Moccasins\n\nA Paying Investment. Examine Our Stock.\n\nR. C. Wigmore & Co.\n\nT. N. Campbell\n\nSchool Books and Stationery, etc.\n\nPublic and High School Textbooks,\n\nSchool Requisites of every description,\n\nStephens' Blue Black Ink,\n\nALL SIZES—WRITING AND COPYING\n\nOffice Stationery, etc., etc.\n\nRobertson & Robertson\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed Suitings, Trowsering and Overcoating WORSTEDS.\n\nIn all varieties, from the best manufacturers in the Dominion.\n\nSUMMER SUITINGS IN ALL GRADES\n\nSatisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\nAN IMPORTANT DECISION\n\nAffecting Affairs of Taxes.\n\nHis Lordship Chief Justice Taylor of Winnipeg, has rendered the following decision in the case of Mr. J. Stewart Tupper against Mr. H. Phillips, who was assessed taxes on certain lands. The defendant claimed he had paid the taxes but the plaintiff disputed it. The judge found in favor of the plaintiff and ordered the defendant to pay the taxes.\n\nThe case involved the interpretation of the Municipal Act of 1885 regarding the assessment of taxes. The defendant argued that the taxes were assessed under the old Act of 1878, while the plaintiff claimed they should be assessed under the new Act of 1885.\n\nThe judge ruled in favor of the plaintiff, ordering the defendant to pay the taxes assessed under the new Act of 1885.\n\nA Dead Drop!\n\nPrices at J. M. Campbell's.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nFar surpassing any previous season, both for richness of design and quality. The variety of new goods in every department is immense.\n\nCall and Examine Our Stock\n\nNo trouble to show goods.\n\nJ. M. Campbell\n\nLumber\n\nMoore & Macdowall Limited\n\nHave a Large Stock of Lumber!\n\nFor Sale.\n\nAlex. Loudoun, Sec.-Treas.\n\nAgents:\n\nP. G. Gray, Edmonton, Alta.\nJ. Fraser Timms, Fort Saskatchewan Alta.\nMahaffey & Clinkskill, Battleford, Sask.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of advertising in American papers by addressing Geo. P. Bowell & Co., Advertising Advertising Bureau, 329 Broadway, New York.\n\nG. H. Campbell\n\nGeneral\n\nRailroad & Steamship Ticket Agent,\n\n471 Main Street, Winnipeg, Man.\n\nHandbills all lines, as under:\n\nIntercolonial\nDominion\nWhite Star, Great Western Line\nGreat Western\nGreat Western\nDirect Hamburg Line\nGreat Western\nItalian Line\nAnchor and other foreign lines, the Pacific Ocean.\n\nPublisher of \"Campbell's Shipping Guide.\"\n\nThis guide contains full information with time tables and sailing dates. Send for sample copy.\n\nAgent for Thor, Cook & Sons, the leading shipping agents in Europe.\n\nPrepaid tickets, to bring your family to Canada at lowest rates.\n\nMoney orders and drafts on all ships, agents and the Canadian Government.\n\nBAGGAGE checked through, and loaded for the ship by arrangement.\n\nWrite for particulars. Correspondence addressed to G. H. Campbell, 471 Main St. and C.P.R. Depot, Winnipeg, Man.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889012501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 3, "total-input-tokens": 4290, "total-output-tokens": 2337, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7150, 2], [7150, 9470, 3]], "primary_language": ["en", "en", "en"], "is_rotation_valid": [true, true, true], "rotation_correction": [0, 0, 0], "is_table": [false, false, false], "is_diagram": [false, false, false]}}]