[{"id": "6ad8a4ffc3a678a6a5380ebb33c1dce0f19eab0e", "text": "THE PRINCE ALBERT TIMES\nAND SASKATCHEWAN REVIEW.\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N.W.T.\nSUNDAY CHURCH SERVICES\nSt. Alban's Church—Services, 11 a.m., and\nTrinity Sunday School—Services, 12 noon.\nSt. John's Church—Services, 9 a.m., and\nSunday School—Services, 10 a.m.\nSt. Paul's Church—Services, 11 a.m., and\nSunday School—Services, 12 noon.\nTHE CROPS OF 1888.\nReports have by some means reached the east to the effect that the grain crops on the Saskatchewan were very much injured by frost about the 21st of August. The report could only have been given currency to by some one who is unacquainted with the welfare of the country, because nothing can be more certain than we can state that there is no foundation for it. We have made enquiries from farmers, and have been unable to find any evidence of frozen grain. The Hamilton Inspector for this district has visited nearly every portion of the district in the past two weeks, and he states that there has not been an acre of grain injured by frost; that in one or two localities there was a slight frost light enough to suffice to freeze the wheat tops very slightly. From the same source we ascertain that nearly all the grain is harvested, and that wheat will averge thirty cents per bushel, barley about forty, and oats from fifty to sixty. This season's operations have demonstrated that Saxonia, Ladoga, and Katomba wheats from ten to fifteen days earlier than Red Fife, and, if these varieties are equally good for milling purposes, they are the most suitable for the climate. We have also shown that, under favorable conditions, the Saskatchewan can produce the best wheat that can be raised here, as in any part of Canada or the United States. Give us a railway, and we will prosper.\n\n\"Moosemin is far ahead of any Northwest town, even Regina, in its educational aspect. A spacious, handsome building, which is an eye opener to the town, was erected last year at a total cost of $1,000. The average attendance at the school is about 150.\" Moosemin correspondence Regina Leader. We beg to call the attention of citizens of Moosemin to the fact that the school of Prince Albert, in the Northwest Territories, last year erected one brick schoolhouse at a cost of $6,000 and another at a cost of $4,500. There is Roman Catholic schoolhouse which cost about $3,000, a Roman Catholic convent for the ladies which cost about $10,000, and this summer the Nesher Academy is being built by the Presbyterian Church at a cost of $5,000. Thus, Emmaus College, although outside the town limits, properly belongs to the town. The buildings connected with the College cost nearly $20,000. The attendance at all these institutions of learning is over 200. So that in this town there are educated people who pay taxes at a total cost of nearly $50,000, and we have never boasted of it either. But of course for a small railway station a $1,000 schoolhouse is something in which it may take a considerable amount of pride. Independent of the Leader may also be pardoned for allowing his imagination to carry him into the belief that $1,000 takes the cake.\n\nIndications this week are to the effect that work will shortly be commenced on the Regina and Long Lake road, and that a considerable portion of it will be built this fall.\n\nFrom the outset, Mr. Fisher's speech indicated that the Fisheries Treaty has been defeated in the United States Senate owing to this being the Presidential election year, and that it was so defeated for party purposes.\n\nThe Fisheries Treaty has been rejected by the United States Senate—a vote of no confidence for and three against. The people of the neighboring Republic have by that vote held that their interests were—by the Treaty—being sacrificed for the benefit of Canada. A short time ago was loud in its denunciation of the Treaty, on the score that Canada was conceding everything to the United States and was not going to stand for it. What is the present form of the new kindly rate and explain? What the result of the action of the United States Senate will be we cannot foresee, but we express the hope that future diplomatic negotiations will solve the question.\n\nThe Winnipeg Free Press, true to its ancient traditions, still continues to advocate the Treaty. We do not know what object the Free Press expects to achieve, but we suppose that it has been in the past so addicted to slandering that now in its maturity it seems to be seeking a better subject to slander, called treaty. Mr. Dewdney has it the past done yeoman service for the Northwest as well as for the rest of Canada, and we believe he will be Minister of the Interior—an act as to win the admiration, and esteem of every true Canadian. He will long be remembered in these Territories as the moving spirit in the foundation of our greatness.\n\nROBERTSON & ROBERTSON,\nMerchant Tailors\nAND\nGENTS' FURNISHINGS\nA LARGE STOCK OF Imported Tweed Suitings,\nTrowsering and Overcoating WORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS IN ALL GRADES\nSatisfaction and a Good Fit Guaranteed.\nRobertson & Robertson.\n\nT. N. CAMPBELL\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZE—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nCOMMUNICATIONS.\n\nThe ladies' aid social.\n\nOn Wednesday evening last the St. Albans Ladies' Aid Church held their second social in the Town Hall. The object of the evening was to raise funds for the maintenance of the church building. The society was organized on the 30th of last month, and a meeting was held at the hall where the ladies discussed the various plans which they wished to carry out. As will be seen by the handsome sum of $100 presented at their first social held in June last, the ladies have already made further endeavors, on Wednesday evening, by $80. The latter sum though insignificant, was most generously given from Chief Factor Fortescue and one of $5 from Mr. R. C. Wigness. The great portion of the evening was spent in eating and enjoying the refreshments provided in the open air, in their usual fine style. There was an irregular programme prepared for the evening by Mr. J. Perry, who acted as chairman, succeeded in getting up a first class impromptu song. Miss McLean sang a solo, accompanied with a couple of songs during the evening, which were rendered in a very fine manner. Mrs. McLean and Miss Fortescue contributed no small share to the evening's entertainment by her fine exertions on the piano. Mrs. Sprout and Miss Fanny Mar also contributed to the evening's entertainment. Mrs. Sprout showed a book of Harlequin, and her work splendidly executed, which were given by Messrs. Jones, Dorey and St. John and Miss. Begin, of the N.W.M.P., and it is safe to say that the ladies and gentlemen acquitted themselves well. Mr. W. R. Fish kindly loaned the piano, while Mr. J. Perry kindly lent his tea. Tea and coffee were served throughout the evening and cakes given, all of which were enjoyed by the ladies. Quite a large business was done in the sale of goods, the charge of the ice cream stand, and from that alone many a stray tea-costume was given from the proceeds of the sale of the church. Mrs. McLean and the other ladies of the congregation were immediately called upon to make the evening's entertainment a success and provide for the enjoyment of all present and we are glad to say that their efforts were amply successful, and we wish the best thanks of the church. The ladies wish to tender their cordial thanks to Chief Factor Fortescue, Mr. McLean and Mr. W. R. Fish, more for their very liberal donations; to the cooks for the free use of the hall; to Chief Factor Fortescue for his kind manner in which he assisted in the chair to Mr. Ouellet for the use of his rooms; to Mr. Fish for his kindness also to the ladies and gentlemen who contributed to the evening's success and last but not least to the members of the Ladies' Aid. We hope that the long winter evenings are approaching, the ladies will provide more such entertainments.\n\nA Dead Drop!\n\nPRICES\n\nJ. M. Campbell's.\n\nFirst Class Goods\n\nMagnificent Stock New Goods\n\nFar surpassing any previous seasons, both for richness and quality. The Variety of New Goods in Every Department is immense.\n\nCall and Examine Our Stock.\n\nNo trouble to show Goods.\n\nJ. M. Campbell\n\nLumber.\n\nMoore & Macdowall Limited\n\nHave a Large Stock of Lumber.\n\nFOR SALE.\n\nAlex. Loudoun, Sec.-Treas.\n\nAGENTS:\n\nP. G. Gray, Edmonton, Alta.\n\nJ. Fraser Timms, Fort Saskatchewan Alt.\n\nMahaffey & Clinkskill, Battleford, Sask.\n\nCLAIMS TO BE...\n\nAnd the claims are fully authenticated by the Highest Medical and Scientific Authorities.\n\nJohnson's Fluid Beef\n\nThis is what Johnson's Fluid Beef does.\n\nP. G. Gray, Edmonton, Alta.\n\nJ. Fraser Timms, Fort Saskatchewan Alt.\n\nMahaffey & Clinkskill, Battleford, Sask.\n\nSTRENGTHENING AND INVIGORATING POWEL\nTERRITORIAL NEWS\n\nBATTLEFORD.\n\nFrom the Herald, Aug. 18.\nMajor McGibbon, Inspector of Indian Agencies, arrived by stage on Monday, and went to Onion Lake.\n\nThe children of the Industrial School were treated to a little excursion on the steamer Minnow on Tuesday.\n\nA bear and two cubs were seen at the bridge over the Frobisher river a few weeks ago. A few days earlier a similar group was seen at Baker's Frogman's place, a few miles up the river.\n\nThe Mounted Police are preparing for a holiday run to Saskatoon, and will probably leave for their camp on Monday week, 27th inst.\n\nQU'APPELLE.\n\nFrom the Progress, August 23.\nOne of the Ontario farmers examining who, while visiting the district, took the trouble to remark that he had seen growing in the farmer's gardens very much larger vegetables than those grown in the district. It was noticed particularly that the people of the N.W.M.P. were doing nothing in any way to encourage the consumption of vegetables.\n\nOn Tuesday the Hon. E. Dewdney, Minister of the Interior, accompanied by his party, visited Qu'Appelle. He was here to meet such of his constituents as would be attending the C.P.R. picnic. He left on Monday morning for Moose Jaw, where plans have been made to take a tour through the Moose Mountain country.\n\nEDMONTON.\n\nFrom the Bulletin, Aug. 18.\nThe town is still dull and the farmers are busy at hay.\n\nBarley cutting will commence next week.\n\nSplendid ripening weather has set in, hot, cloudless and breezy.\n\nThe police station is now completed. Fort Saskatchewan is now being erected at Edmonton at $9 per acre of land which amounts to about $1 per acre.\n\nThe beaver were noticed to be dying very generally this spring in the Saddle Lake district. The death was not caused by starvation but was due to lack of fat when found. Some unknown disease is doing the work.\n\nCALLARY.\n\nFrom the Herald, August 22.\nAbout one o'clock yesterday morning it was noticed by the police on duty that two of the most active thieves had been out. On examination they found that some band had been pulling out the keys. What the object could be it is hard to decide.\n\nConst. Morgan, of the N.W.M.P., who received his honorable discharge from the force a few days ago, has been appointed to the position of constable in the Indian police, Burnham. He left on this morning's train for a far-off empire.\n\nA notorious thief who was out committing a few days ago in the hills near the mouth of High river was shot by his own hand. The offender of the theft was followed by an awful vengeance and paid the penalty. Some sportmen are of the opinion that the thief had deliberately shot a \"fugitive\" down and felt sorry for the act at the ungentlemanly act that he shot himself.\n\nFriday, the 24th of August, will be a red-letter day in the history of the Herald. That day will be the fifth anniversary of the establishment of the paper, and there will be a celebration of that event. It is intended to issue a special number. This paper will contain some interesting particulars of Alberta and a brief sketch of Calgary and the career of the Herald.\n\nFrom the Times, August 22.\nMr. McCormack is reported to have purchased the surplus steers on the Conkran ranch, numbering about 200 head, and drive them to the market at Medicine Hat.\n\nMr. Scott, of Galt, has gone to Stimson's ranch to inspect his steers. Commissioner Harmer arrived in town Thursday night. He is investigating the circumstances of the late disaster.\n\nThe guard on account of being a raw recruit was not able to keep up. Sergeant Daniels was still at the scene when the guard went in pursuit, from this point, having all returned. It is thought that most likely by this time he is nearer his line.\n\nFORT MACLEOD.\n\nFrom the Gazette, August 23.\nThere is but one opinion, among those who were fortunate enough to hear the high old string music which was on the programme of the evening's entertainment. The unanimous verdict is that it was the finest thing in the way of string performance ever heard in MacLeod. The chief attraction was the violin playing of Miss Beale and Master Conrad.\n\nSgt. Duff, of the Mounted Police Command of Fort MacLeod, arrived from British Columbia on Friday, having come through in eleven days, sixty strong, fine specimens of men and men arriving the Crow's Nest. Insp. Hunt and Dr. Powell are with the troop. They are now under canvas at Sample's bottom.\n\nREGINA.\n\nFrom the Journal, August 25.\nConst. Williams, who deserted from the force at Calgary last fall, was captured by Sergt. Richards at Qu'Appelle and brought into barracks on Saturday night.\n\nA wholesale spill of 2,500 bottles of Canada Dry ginger ale was committed Saturday night. That the police are doing their duty notwithstanding the fact that the liquor is being sold openly is shown by the fact that in the last few days some 4,000 bottles containing illicit spirits have been confiscated by them.\n\nOn Friday evening last a most handsomely and costly wedding present was given by Isaac Connerman Reed, by the citizens of the department store, who had been assisted by contributions from the agents and clerks on reserve there. The wedding present consisted of a piano, and was accompanied by an address. Mr. Reed made a suitable reply. After the presentation a complimentary evening was spent at Mr. Reed's residence.\n\nFrom the Leader, August 28.\nPink eye was broken out among the cattle at the barracks.\n\nThe contract for the Dewdney banquet has been awarded. Mr. Doig, of the firm of Doig & Co., will hold about 1,000 lbs. of flour.\n\nA cargo of 2,500 bottles of Canada Dry was spilled at Qu'Appelle Station, was yesterday forwarded for sentence, mitigating circumstances having been brought before Mr. Justice Murray, at which the verdict had no time to look.\n\nThe enquiry into Judge Logan's claim of $12,000 against the U.S. government, for the seizure of Sitting Bull, is now closed. The evidence showed our looking tuck. Judge Logan made out a statement, and we are sure that the American Government will do justice in the promise.\n\nLETHBRIDGE.\n\nFrom the News, August 22.\nJ. G. Baker's bull train came in from MacLeod on Friday and landed with merchandise in place. This is their first trip this summer.\n\nThe prairie on the north side of the track about two miles east of here was set on fire several nights ago. The fire was started by a locomotive. A number of passengers went out about 2½ clocks to put it out.\n\nThe Mormons, who are hauling Colping's hay to the police, came in with a load on Saturday last. They have ten teams on the road and are heading back to twenty tons on the trip.\n\nThe concert in aid of St. Augustine's Church came off on Thursday evening. The orchestra was excellent and the kind ever given in town. The large main room of the N.W.M.P. barracks was crowded, even standing room only filling the place. The concert to-night goes towards raising the last note on the church building.\n\nMEDICINE HAT.\n\nFrom the Times, August 24.\nNumerous bands of assassins are seen between Calgary and Lethbridge.\n\nThough the delay has expired Major Happe, the Montana murderer, held at Lethbridge, will not be handed over unless certain circumstances are realized.\n\nComptroller White, of the Mounted Police, reports having examined the boundary line of the park, as a result of the patrol service carried along the boundary line from MacLeod to the border.\n\nADVERTISERS\n\nCan learn the exact cost of any proposed line of Advertising in American Papers by addressing Geo. F. Powell & Co., Newspaper Advertising Bureau, 10 Spruce St., New York. Send 10c for 100-pp. Pamphlet.\n\nROYAL BAKING POWDER\n\nAbsolutely Pure.\n\nT. J. Agnew & Co.\n\nR. C. W. & Co.\n\nAll parties indebted to R. C. Wigmore & Co. are requested to make an immediate settlement.\n\nInterest charged on all overdue accounts.\n\nR. C. Wigmore & Co.\n\nFOR THE Best Assorted Stock of CONFECTIONERY GO TO H. McDougall's BAKERY.\n\nW. R. Fish's Bakery.\n\nCentral Store.\n\nGoods delivered to all parts of the town free of charge.\n\nH. MacDougall\n\nGO TO AGNEW'S FOR Stoves Heating Drums Stovepipe Coal Oil T.J. Agnew", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888090701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 4054, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5359, 2], [5359, 8984, 3], [8984, 17067, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]