[{"id": "4ed4c465da5b56a54ebd4ae328380052ab4aedb5", "text": "The Prince Albert Times\n\nWednesday, January 24, 1853\n\nOur Country.\n\nThe fertile plains of the North-West Territories are destined at no distant day to be the greatest wheat producing region in the world. The richness of the soil and the rapidity with which the virgin prairies may be converted into \"rolling fields of golden grain,\" render this the most suitable quarter of the globe to which the industrious people of the overcrowded countries of the Old World can come in order to better their circumstances and reap for themselves and their children that measure of prosperity which is due to those who honestly and perseveringly endeavor to help themselves. To all those who desire, or whom necessity compels to come to a new country, we would say that, while we believe that our soil is the most productive of the known world, we also believe that the actual settlers can obtain it from the Dominion Government and from the C.P.R. Syndicate at rates lower than are charged in any other colonies of the United Kingdom or the United States; and hence, those desirable lands are within the reach of all.\n\nThe climate, though cold in winter and very warm in summer, is a most healthy one; and we are fully satisfied that it compares favorably with that of the older provinces of the Dominion, and the extraordinary expressions of praise which emigrants from the United Kingdom bestow on our clear atmosphere and its invigorating qualities, convince us that the clouds, rains and fogs of the British Isles are more objectionable climatic features than our periods of extreme heat and cold.\n\nWhile much more could be said in favor of our country, we do not wish it to be understood that this is a terrestrial paradise, where fortunes are acquired without labor or hardships of any kind, but we do intend it to be understood that it presents to the industrious and frugal better opportunities to acquire a competence than they can expect to meet elsewhere.\n\nA certain amount of labor must be done, and hardships more or less severe must be undergone in opening up all new countries, but in the North-West Territories the minimum of outlay seems to be demanded with the maximum of income.\n\nIn consequence of these facts becoming more widely known, our country is being rapidly settled up, and to those people who are struggling against adverse circumstances in other lands, we say come and receive while you may, as a gift, your share of our prairies, and out of the fruits of your toil provide a rich inheritance for your children in a country where their relief can be subjects them to no hardships; where law and order reign, and happiness and prosperity are the conditions of its peace.\n\nSubscribe for the Times, only $2.50 a year.\n\nSTEWART AND WOOTTON,\n\nGENERAL MERCHANTS.\n\nPRINCE ALBERT, N.W.T.\n\nThe New A.B.C\n\nALWAYS BUY FOR CASH,\n\nAND GET FULL VALUE FOR YOUR MONEY.\n\nFresh Groceries,\n\nTexas,\n\nSugar,\n\nO'Malley's Hungarian Patent Process Flour,\n\nPrince Albert XXXX Flour,\n\nEvaporated Peaches,\n\nEvaporated Apples,\n\nDried Apples,\n\nNew Raisins,\n\nNew Raisins,\n\nCalifornia Fruits,\n\nGray's Celebrated Scotch Jams,\n\nMarmalades,\n\nSyrup in tins and tins,\n\nCanned Meats,\n\nCanned Fish,\n\nCanned Soups,\n\nSugar-Cured Hams,\n\nSugar Cured Bacon,\n\nCross & Blackwell Pickles,\n\nWorcestershire Sauce,\n\nYorkshire Relish,\n\nSpices, etc., etc.\n\nBiscuits,\n\nCandies,\n\nDry Goods,\n\nClothing,\n\nBoots, Shoes,\n\nFURS:\n\nSets Blk. Wolf,\n\nRobes, Lined and Trimmed\n\nSets Grey Wolf,\n\nRobes, Lined and Trimmed\n\nBuffalo Robes,\n\nBuffalo Coats,\n\nGrey Wolf do.\n\nSTEWART & WOOTTON,\n\nPRINCE ALBERT, N.W.T.\n\n1879.\n\nBuffalo Hall CLEARING SALE\n\nSTILL STANDS WITHOUT A RIVAL\n\nTo make room for our heavy spring stocks, we are obliged to clear every department.\n\nFollow the crowd, and you will find yourself buying\n\nREADY-MADE CLOTHING,\n\nCAPS, MITTS AND MOCCASINS.\n\nReduced 25 per cent.\n\nLADIES' MANTLES,\n\nReduced 25 per cent.\n\nBOOTS AND SHOES,\n\nAt less than Winnipeg prices.\n\nAll goods reduced in proportion for cash.\n\nEvery article marked in plain figures.\n\nBETTS & Gwynne.\n\nG. B. B.\n\nWHAT DOES IT MEAN?\n\nGreat Big Bargains AT THE ROCK BOTTOM STORE\n\nSome of our leading lines are:\n\nGrey and Fancy Flannels,\n\nWhite and Grey Blankets,\n\nFancy Comforters and Quilts,\n\nShawls, Nubias, Scarfs,\n\nIn Boots, Shirts, Harnesses, Millinery, Clothing, Groceries, Provisions, Canned Goods, Tobacco, Tobacco, etc., we won't be undersold.\n\nA call is solicited.\n\nStore formerly occupied by J. O. Davis & Co.\n\nWALTERS & BAKER HUDSON'S BAY COY.\n\nFARMING LANDS!\n\nFOR SALE IN\n\nManitoba & North-west\n\nThe Hudson's Bay Company own 7,000,000 acres in the Great Fertile Belt, and now offer for sale 500,000 acres, already surveyed by the Government of Canada.\n\nALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Gochen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment.\n\nFull information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC. J. Brydges, Land Commissioner.\n\nT. N. Campbell,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books,\n\nStationery, Fancy Goods,\n\nToys, Etc., Etc.\n\nJust arrived, a Large Assortment of English Books, Price Exhibition Cards.\n\nCall early and make your selections.\n\nA LARGE STOCK OF\n\nMusical Instruments, Fancy Goods, Toys, etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\nGOOD WORDS.\n\nThe following letter was received by\ngentlemen in Prince Albert, from Mr.\nMontreal, Canada, 1877:\n\nMy Dear Friend,\n\nI lately received two letters, which\nwere posted to me, and I have no\nopportunity of answering them, they are\nwritten in such a high state of excitement,\nthat you would be doing me a favor to\nread them. I am obliged to say that\nthe contents of both letters are very\ninteresting, and I shall be glad to\nreceive your reply.\n\nYours ever,\n\n[Signature]\n\nTHE TORONTO GLOBE.\n\nThe Globe, a weekly newspaper, was\nfounded in Toronto, Ontario, Canada, in\n1836. It has been published continuously\nsince then, making it one of the oldest\nnewspapers in North America.\n\nMISS MACK & CO.,\nCAMPBELL'S BLOCK,\nRIVER STREET,\nPRINCE ALBERT, S.W.T.\n\nTHE ECHO HOUSE,\nQUAPPILLE.\n\nTHE CABLE HOUSE.\n\nTHE BEST\nBEER AND CIGARS\n\nOF THE FINEST BRANDS ALWAYS ON HAND.\n\nWHOLESALE AND RETAIL.\n\nJOHN WYNERSBERGH, BROP.\n\nFURNITURE STORE\n\nG. CARTER & SON\n\nWould inform the people of Prince\nAlbert, that they have just opened\ntheir new furniture store, and have\nmany fine pieces of furniture, and\nare prepared to take orders for\nBEDSTEADS, CUPBOARDS, LOUNGES, TABLES,\nand other heavy furniture.\n\nRED BRICK STORE\n\nG. CARTER & SON\n\nPRINCE ALBERT\n\nSPINK & MAVEETY,\nPROPRIETORS.\n\nJOB PRINTING.\n\nWe have duplicated the order for stationery, which\nunfortunately, was left at Cumberland, and will shortly\nbe able to supply our numerous patrons with all kinds of\nJob Printing.\nMINING MATTERS.\n\nThe mining interests of the Lake of the Woods are assuming such proportions that agencies for the purchase and sale of claims are being established. Messrs. D. K. Brown & Co., who have opened what is termed a Mining Bureau, in the Dundas block, in the office under discussion, are well known in mining circles. Mr. Brown is a well-known mining man and the latter an expert in mining matters, and should be approached before they have purchased any. Operations will begin by offering to the public a subdivision of 5000 acres of land in the Wingham Consolidated Gold Mining Company, of which the incorporators are Messrs. A. W. Fink, P. M. N. Rattray, P. J. Burt, and others. The claims, which have a par value of $30, will be floated at $1. To secure registration and guaranteeing of claims, a deposit of two per cent of the selling price, equivalent to $1 per share, has to be paid down, and the remainder paid off in four installments, which will make a few weeks hence. There is considerable inquiry for land for sale. In the last five years, mining interests have been very active, certainly not more than $20,000 will be placed on the market, and at such prices of mining since the discovery by the progress of development the present is the most favorable opportunity of any for securing land. The location of location F 22, gives $1000 per milligram; location F 22 gives $60 per ton, and location F 22 gives $40 per ton. The Consolidated is wholly under Canadian control, and under the able supervision of Mr. H. B. Brown, who has considerable experience as a miner. The Wingham consolidated company has ore on the dump already valued at $100,000 worth, working up to date six times over. The prospect must be brilliant, for the Consolidated mines are only three miles from those of the Kawartha Consolidated, which have been of almost incredible richness. The shares of the Kawartha are quoted today at $100, and the Consolidated at $150 figures, so those of the Consolidated are bound to rise in sympathy, independent of their own merits.\n\nThe Bureau is also representative of the Wingham Consolidated in the floating of this new company, and the men buying at the Bureau can alliumtly be guaranteed. Specimens of gold and other precious minerals, from different mining locations referred to, are on display, and those interested in mining are cordially invited to inspect them. The mining interest surrounding these mines in this city has our best wishes for success, Winnipeg Free Press.\n\nTHE RETURN OF OUR WIFE.\n\nIt was a keen day. She had been away for several days, and the children had gone to the depot to meet her. They chatted away merrily, while she patted their little heads and smiled affectionately.\n\n\"How was Mary?\" she enquired; when they both looked up breathlessly.\n\n\"Yes, she's well,\" she said, \"she has missed us right enough.\"\n\n\"And Harry?\"\n\n\"He's going to school. Started last week.\"\n\n\"And you?\"\n\n\"I'm well, too. He's having a busy time. He said he didn't care if you didn't come back for a year.\"\n\nThe young woman laughed.\n\nGrabbing the children with both hands she rushed for the door with I'll get even with you written on her face. Heaven help him!\n\nThe Rev. Mr. J. S. Savage, of Bowden, preached a sermon on newspapers. People have been saying, \"This world is wider than ever before.\" An explanation of this, I believe, will be found in the fact that no man who is utterly alone is ever far away that what he does and says can not be regarded as news in safe to day in the community. If he does not do it, or say it, then very soon he will see his name in a newspaper telling all about him, and this, I believe, is it. It is a fact, and this is why the average man fears more than he fears time, more than he hopes for heaven, more than he fears death. But, on the other hand, Mr. Savage blames the newspapers because he thinks they are generous in their praise, and this is why the average man fears more than he fears time, more than he hopes for heaven, more than he fears death.\n\nAPPLY AT\n\n\"The Times\" Office.\nTHE OLD FARM GATE.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nPATRICIA KEMBALL.\n\nA NOVEL.\n\nBy E. Lynn Linton, author of \"Eliza Hartley,\" \"The True History of Joshua Davidson,\" &c.\n\nCHAPTER VI.—CONCLUDED.\n\nAnd so, in one thing, however, she was sure—her husband would be faithful. Mr. Hanley thought it ridiculous to think he could ever want to go down before her, or to make any attempt to get back his former position; but he knew that she would never quite forgive him. For the matter of that following, however, and the village went on as usual, and Pritchard and all; so that her absence would have been remarked not by any advantage. But when the news came that Mr. Hanley was gratified Mr. Hanley, it pleased him to see that his brother had been very good, and that his wife had been very good, too; and that he could afford the rivalry on the principle of the death line and the live dog.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nTHE OLD FARM GATE.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nPATRICIA KEMBALL.\n\nA NOVEL.\n\nBy E. Lynn Linton, author of \"Eliza Hartley,\" \"The True History of Joshua Davidson,\" &c.\n\nCHAPTER VI.—CONCLUDED.\n\nAnd so, in one thing, however, she was sure—her husband would be faithful. Mr. Hanley thought it ridiculous to think he could ever want to go down before her, or to make any attempt to get back his former position; but he knew that she would never quite forgive him. For the matter of that following, however, and the village went on as usual, and Pritchard and all; so that her absence would have been remarked not by any advantage. But when the news came that Mr. Hanley was gratified Mr. Hanley, it pleased him to see that his brother had been very good, and that his wife had been very good, too; and that he could afford the rivalry on the principle of the death line and the live dog.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nTHE OLD FARM GATE.\n\nThe old farm gate hangswinging down,\nAnd all the trees around it stand,\nAnd all the birds that sing so loud,\nAnd all the flowers that grow in the land.\n\nPATRICIA KEMBALL.\n\nA NOVEL.\n\nBy E. Lynn Linton, author of \"Eliza Hartley,\" \"The True History of Joshua Davidson,\" &c.\n\nCHAPTER VI.—CONCLUDED.\n\nAnd so, in one thing, however, she was sure—her husband would be faithful. Mr. Hanley thought it ridiculous to think he could ever want to go down before her, or to make any attempt to get back his former position; but he knew that she would never quite forgive him. For the matter of that following, however, and the village went on as usual, and Pritchard and all; so that her absence would have been remarked not by any advantage. But when the news came that Mr. Hanley was gratified Mr. Hanley, it pleased him to see that his brother had been very good, and that his wife had been very good, too; and that he could afford the rivalry on the principle of the death line and the live dog.\nJ. O. DAVIS & CO.,\nPrince Albert, N.W.T.\n\nIMPORTANT NOTICE\n\nEvery man in Prince Albert will consult his own interest by purchasing one of our $7 Overcoats.\n\nJ. O. DAVIS & COY.\n\nTO THE LADIES:\n\nAll the Latest Novelties in Fancy Dry Goods, Ties, Bows, Cigarettes, Laces, Fichus, Antimacassars, etc., are to be found at\n\nJ. O. DAVIS & COY.\n\nFor the best assortment of Fancy Goods, Stationery, Watches, Clocks and Jewellery, Gallery, Musical Instruments, etc., call on\n\nJ. O. DAVIS & COY.\n\nNOTICE.\n\nKERR AND HAMILTON\n\nMARCH 1ST\n\nJ. O. DAVIS & COY.\n\nNOTICE.\n\nJOHN MACDONALD\n\nJ. O. DAVIS & COY.\n\nALARGESTOCK ARRIVED A FEW DAYS AGO AT THE MEDICAL HALL, CONSISTING OF Drugs, Chemicals, Dye Stuffs, Spices, Druggists' Sundries, Perfumery, Sponges, Toilet Soaps, etc., etc., AND ARE NOW OPENED OUT. ALSO ON HAND A GOOD SUPPLY OF Patent Medicines, INCLUDING Fellows' Syrup, St. Jacob's Oil, Electric Oil, Pain Destroyer, Black Oil, Burdock Blood Bitters, Vegetable Discovery, Cod Liver Oil Emulsion Medical Discovery, August Flower, Etc., Etc.\n\nTERMS—CASH.\n\nT. E. JACKSON,\n\nIn our New Premises, next door east of Farmers' Home and north of Old Presbyterian Church.\n\nHORSE SHOE STORE.\n\nJ. O. DAVIS & COY.\n\nFor the most complete stock of Clothing and Men's Furnishings west of Winnipeg, call on\n\nJ. O. DAVIS & COY.\n\nImmensely low prices in every department for cash. All goods marked down to hardpan prices.\n\nJ. O. DAVIS & COY.\n\nFor the best assortment of Fancy Goods, Stationery, Watches, Clocks and Jewellery, Gallery, Musical Instruments, etc., call on\n\nJ. O. DAVIS & COY.\n\nNOTICE.\n\nTHOMAS O. DAVIS.\n\nGRAND UNION\n\nLivery & Sale Stables.\n\nWoodbine Restaurant\n\nRIVER STREET\n\nTOM DAVIS.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1883012401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9132, "total-output-tokens": 4183, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 5441, 2], [5441, 6901, 3], [6901, 10967, 4], [10967, 14449, 5], [14449, 16122, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]