[{"id": "fd0438a305c60b1ab5b93081004b1ef0796011b0", "text": "FRIDAY, MARCH 6, 1885.\n\nNEW DEPARTURE\n\nTHE WEEKLY GLOBE\nSPECIAL TRIAL TRIP—TWO MONTHS\nONLY 15 CENTS\n\nCommencing Feb. 26th, the following editions of The Weekly Globe will be mailed to subscribers throughout Canada, the United States, and other countries:\n\nDaily Globe—Tuesday Edition\nDaily Globe—Wednesday Edition\nDaily Globe—Thursday Edition\nDaily Globe—Friday Edition\nDaily Globe—Saturday Morning Edition\n\nTHE GLOBE has special arrangements by which it possesses the sole right in Canada, as well as in the United States, of the publication of the following series of newspapers:\n\nThe Globe, under special arrangement for the Dominion of Canada, Toronto, Ont., and the United States, New York, N.Y.\n\nIn addition to the above-mentioned newspapers, there are always running in the 3rd and 4th sections of THE GLOBE, and in THE WEEKLY GLOBE, one or more additional newspapers by authority of the Government of Canada, the Dominion of Canada, and the United States.\n\nAn agricultural newspaper, THE WEEKLY GLOBE is unsurpassed.\n\nSPURGEON'S SERMON\n\nAddress, THE GLOBE PRINTING CO., TORONTO.\n\nPRINCE ALBERT\n\nJAMES SINCLAIR\nMerchant Tailor,\nand\nCash and Door Factory\nCorner Market and Main Streets\nPrince Albert, N.W.T.\n\nCHESTER THOMPSON,\nGeneral Blacksmith,\n\nJames Sinclair\nMerchant Tailor,\nand\nCash and Door Factory\nCorner Market and Main Streets\nPrince Albert, N.W.T.\n\nNEW GOODS!\nMEDICAL HALL\nBurdock Blood Bitters,\nBurdock Healing Ointment,\nBurdock Pills,\nVictoria Hypophosphites,\nVictor's Bucha and Uva Ursi,\nFenugreek and Worm Powders,\nYellow O.L.\n\nA large variety of fresh Seeds just received at Clark's Drug Store.\n\nTHE BEST RIFLE\nBALLARD\nMarlin Fire Arms Co., New Haven, Ct.\n\nOUR FAMILY KNITTING MACHINES.\nDedicated to the best family knitting machine based on the latest patents.\nA complete line of machines for knitting socks, mittens, caps, sweaters, etc.\nOur machines make the only perfect family knitting machines.\n\nCREELMAN BROS.,\nGEORGETOWN, ONT.\nThe Dominion Organ and Piano Co.\nPRINCE ALBERT HIGH SCHOOL\n\nUnder the auspices of the\nPRESBYTERIAN CHURCH OF CANADA.\n\nThis School will be opened on\nTUESDAY, 10TH MARCH,\n\nWhen Classes will be formed in\nEnglish, Latin, Greek, French, Mathematics, and the other Subjects taught in Public and High Schools.\n\nUntil other arrangements can be made, the School will be conducted by\nRev. W. McWILLIAM, M.A., LL.B.,\nAnd Rev. R. G. SINCLAIR.\n\n1879. 1885\n\nBuffalo Hall!\n\nStill continues to be a source of amusements to general business men.\n\nFRESH GOODS THIS WEEK:\nTeas, Tobaccos, Sugars, Oatmeal, Canned Goods,\n\nOur prices for the past three months have given the greatest satisfaction. In a new attempt to clear out the bulk of our stock remaining at still greater reductions.\n\nThe public will do a wise thing if they examine fully our lines in Dry Goods, Clothing, Mitts, Moccasins, Furs, Groceries and Provisions before purchasing.\n\nThe largest stock of Ready Made Garbages.\n\nThe largest stock of Furs, Mitts and Moccasins.\n\nThe largest stock of Groceries and Provisions.\n\nAnd the largest reductions from 1 time prices will be found at Buffalo Hall.\n\nBETTS & GWYNNE.\n\nNOTICE.\n\nJ. L. JOHNSON & CO.\n\nBeg to announce to their customers that their terms are net cash to those who do not make satisfactory settlement of their accounts to Jan. 1st, 1885.\n\nJ. L. JOHNSON & CO.\n\nT. N. CAMPBELL,\nBookseller and Stationer\n\nJUST RECEIVED\nA LARGE ASSORTMENT OF\nROOM AND PICTURE MOULDINGS,\nPICTURES\nMounted and Framed.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T\nDominion Parliament.\n\nThe Hon. Mr. Pope, Minister of Agriculture, has appointed a commission to review the status of the provinces. The commission will be appointed by the Governor General and will consist of three members. The commission will report its findings to the Governor General within six months.\n\nThe commission will consider the following issues:\n\n1. The distribution of federal funds among the provinces.\n2. The implementation of the federal-provincial agreement on environmental protection.\n3. The impact of federal policies on the economy of each province.\n\nThe commission will present its report to the Governor General in June 1986.\n\nSTEWART J. C. MACKENZIE\n\nBoots and Shoes\n\nTHIS WEEK.\n\nA LARGE VARIETY IN\n\nCHILDREN'S BOOTS.\n\nALSO A FINE LINE IN\n\nLADIES' FINE WALKING KID SHOES\n\nSold Cheaper than ever. Call and see them.\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWish to inform the Public that they have on hand and for sale a Half Million Feet of Dry Lumber, consisting of Matched, Dressed and Undressed.\n\nDressed Flooring, $48\nUndressed do., 42\nDressed Siding, 48\nUndressed do., 42\nSheeting, 30\nCommon Lumber, 35\nDimension do., 40\n\n\"Over 13 feet extra.\"\n\nLath, 75 cts. per bundle.\nShingles, $6 50 per M.\n\nWe are prepared to Contract for Buildings as cheap as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL\n\nTHE PRINCE ALBERT TIMES\n\nAND\n\nSASKATCHEWAN REVIEW.\n\n$2 50 PER ANNUM.\n\nThe Times is the best medium in the Territory to advertise your business in.\n\nSubscribe for The Times and get the latest news and happenings around town.\n\nJ. D. MAVETY, PUBLISHER AND PROPRIETOR\n\n3RD ST., PRINCE ALBERT, SASK", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1885030601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5950, "total-output-tokens": 1503, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1990, 2], [1990, 3574, 3], [3574, 5268, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]