[{"id": "99b0662710cd5ab17bd1b096e4e4f09ecf4cbb17", "text": "FRIDAY, JUNE 22, 1883.\n\nTHE PRINCE ALBERT TIMES.\n\nSUNDAY CHURCH SERVICES\n\nPRINCE ALBERT N.W.T.\n\nFRIDAY, JUNE 22, 1883.\n\nTHE NISBET ACADEMY.\n\nADDRESS.\n\nELECTION NOTICE!\n\nTHOS. O. DAVIS\n\nROBERTSON & ROBERTSON,\n\nMerchant Tailors\n\nGENTS FURNISHINGS\n\nA LARGE STOCK OF Imported Tweed suitings, Trowering and Overcoating WORSTEDS, IN ENGLISH AND AMERICAN LINES, CANADIAN TWEEDS In all varieties, from the best manufacturers in the Dominion SUMMER SUITINGS IN ALL GRADES Satisfaction and a Good Fit Guaranteed.\n\nRobertson & Robertson.\n\nT. N. CAMPBELL\n\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING Office Stationery, etc., etc.,\nNISBET ACADEMY.\n\nLaying of the Corner Stone by the Masonic Fraternity.\n\nThe Freemasons, speaking at the time, practically at the close of the proceedings of the N. M. Masonic Fraternity, took occasion to congratulate the Masonic Party, appeared upon the Church Square, and, discovering from their charges, walked for the purpose of seeing the scene. The Masons appeared in the Town Band, the masonic fraternity in their acoustics regalia, the Rev. Andrew's Society, the Masonic Band, the Masonic Band, Emmanuel College, the Town choir, government officials, Hudson's Bay staff, members of the Board of Trade, the teachers and pupils of the public schools and a large number of ladies and citizens walked for the purpose of seeing the scene. The Masonic Band, under the direction of Mr. J. H. Smith, performed the music associated therewith in a most efficient manner, and his name will be remembered in connection with each affair. The appearance of the procession as it marched to the corner stone was most impressive, and the enthusiasm of the crowd was evident. The Rev. Dr. Polson, was, to say the least, very effective; and everybody agreed that Prince Albert was the best thing that ever happened before. On arriving at the building site, the Rev. Dr. Jardine, on behalf of the trustees, asked the Grand Master of Manitoba Grand Lodge, A.F. & A.M., D.C. O., acting for the Grand Master of Manitoba Grand Lodge, A.F. & A.M., to proceed to the ceremony of laying the stone.\n\nThe Rev. Dayton Fleet's Address.\n\nMen, women and children here assembled to build this cornerstone, we are reminded here by the words of the Apostle Peter as Free Masons, and from time immemorial it has been customary on occasions like this to address briefly to give expression to the sentiments and principles of our time honored fraternity. Know all ye Gentlemen, that we are lawful Masons, bound to the laws of our country, professing to fear God, loyal to our Sovereign and the constitution of the United States, faithful citizens of the British Empire, and faithful citizens of the Great Dominion of Canada. We believe in the principles of our own definition, a benevolent system of morality with allegory and illustration tied to the Bible. Its chief object is to promote the moral and religious welfare of its members, and to practice universal benevolence toward all mankind. We have amongst us many concealed from the eyes of other men, secrets which may not be revealed except to those who have an excuse but that they are of good character, honorable and placed in the custody of Masons who alone have the knowledge of them. If these secrets, unless our craft was good and our order honorable our order would not have existed. We believe in the education of our youth, and in the advancement of the best interests of the human family. Though not promising to be a great power, we shall gradually assume publicly our true position as the headmost of religion and in laying the foundation of Masonic homes in the history of the Territories, we gladly recognize the fact that the Masonic Order is the only institution connected with a church that has done much for its followers, and that has done much for its followers, and for the welfare of the community. It is the duty of every Mason to be a good citizen, and to do his part in the advancement of the cause of liberty and prosperity. In assembling here to-day in compliance with your request to lay the cornerstone of the new Masonic Temple according to the ancient traditions and ceremonies of our fraternity, we do so in accordance with the belief that the Masonic Order has ever linked Freemasonry with social welfare and the advancement of the best interests of the human family. Though not promising to be a great power, we shall gradually assume publicly our true position as the headmost of religion and in laying the foundation of Masonic homes in the history of the Territories, we gladly recognize the fact that the Masonic Order is the only institution connected with a church that has done much for its followers, and that has done much for its followers, and for the welfare of the community. It is the duty of every Mason to be a good citizen, and to do his part in the advancement of the cause of liberty and prosperity.\n\nNOTICE\n\nThe Trustees of St. Paul's Protestant Episcopal Church, being desirous of having the said Church completed, do hereby notify the parishioners thereof, that the sum of $1500.00 has been subscribed by the parishioners of said Church, towards the completion of the same. All persons interested in the affairs of said Church are requested to meet at the Church on the 1st day of July next, at 7 o'clock P.M., for the purpose of considering the matters hereinbefore mentioned.\n\nJ. M. CAMPBELL\n\nDRY LUMBER.\n\nMOORE & MACDOWALL\n\nWe are prepared to Contract for Buildings as cheaply as any firm in Town.\n\nBuilders paying Cash or giving good security for LARGE Orders, will have a reduction made.\n\nMOORE & MACDOWALL.\nADDRESS.\nTo the Electors of the Electoral District of Prince Albert.\n\nGENTLEMEN,\n\nAt the request of numerous electors of all political parties, I beg again to offer myself as a Candidate in the forthcoming election. Among other matters, I have been requested to forward to the Returning Officer by the late Council, in which I had the honour to serve, a statement covering the subject of the proposal for the erection of a monument to the late Sir John A. Macdonald.\n\n1st.-That the prosperity of the newly completed settlement, by being removed from the North-Western part of the C.P.R., and the construction of the Hudson's Bay Company's headquarters at Prince Albert, will be improved.\n\n2nd.-That the establishment of any Railway line to connect Prince Albert with the rest of the Province will be the votes of the people before allowing it to commence operations.\n\n3rd.-That, in the half breed children, lies the future of the Dominion.\n\n4th.-That by the advice of the N.W. Mounted Police to purchase, plant, and cultivate in the most suitable manner, the lands now occupied by the settlers.\n\n5th.-The reconditioning of many claims of the old settlers, who are still living in the district.\n\n6th.-The improvement of the navigation of both the north and south branches of the Saskatchewan.\n\n7th.-The construction of the old trails, and their transfer to the Territorial authorities.\n\n8th.-The reduction of duties on agricultural implements imported into the Dominion.\n\n9th.-That the amount of stock kept on a homestead should be sufficient for its support, as well as cultivation.\n\n10th.-That the wood made for sale or wood used for fuel purposes by bona fide farmers and not cut for profit, and that each farmer be allowed 100 acres of building timber on free permit.\n\n11th.-That the officers of the Royal Mounted Police and Indians be placed under the Territorial Government so that the letting of contracts, and that beef be purchased for the Indians.\n\nAmong new matters I shall call the attention of the electors to the following:\n\n1st.-The necessity of providing funds for the maintenance of High and Normal Schools, without infringing on the liberal allowance made for the Teachers.\n\n2nd.-That at all events a portion, if not all, of the money raised in the townships and villages according to municipal by-laws be refunded to the municipality for local purposes.\n\n3rd.-That the presiding officer of municipalities be subject to the orders of the magistrate.\n\n4th.-That the Ordinances of the Territorial government be continued.\n\n5th.-That all elections, both Dominion and Territorial, be held at the same time.\n\n6th.-That the Ordinances against profanity and the use of poison be more strictly enforced.\n\n7th.-That increased and every possible aid be given to the poor, the sick, the aged, and invalids and without having recourse to direct taxation.\n\nAs your representative in the late Council, I labour under many disadvantages, being situated in the most isolated part of the Saskatchewan. Still, probably had it not been for my endeavours and the co-operation of the Territorials would have been carried out, but for the fact that the Government was opposed by the majority of the electors, leaving you with four members of your choice, whereas we have now five in twenty-two. I am convinced that the Territorial Government will shortly come into the scheme on the same basis as the other districts, and that the electors of this district will go to any such arrangement with the utmost satisfaction, as they will be by wealth and population on par (as far as possible) with the best of the other districts.\n\nThese gentlemen, are the principal persons I am about to bring before you as an addition of this district, and I think you will agree that the past warrants a continuance of your support and that my experience has been of great value to the Legislative - which will be most imper- tant, and that you will not hesitate to remember the old adage, \"That it does not pay to keep house when crossing a stream.\"\n\nI have much to be, gentlemen,\n\nYours very truly,\n\nO. E. HUGHES,\nPrince Albert, June 21, 1888.\n\nCaptain Hoey of Bomber, path-finding Prince Albert last Tuesday. He is here with the intention of resuming his course.\n\nThe river rose above fine foot during Sabbath and Monday last, and large quantities of driftwood and logs were floating down in consequence. Several enterprising lumbermen embraced the opportunity of making a good haul of rafts by catching the logs as they went by.\n\nThe Family Educator.—Webster's Unabridged Dictionary is the great family educator, and if family of children ought to be brought up without hearing ready access to the dictionary, they must answer hundreds of questions to the wide awake child. It is an ever present and reliable schoolmaster to the whole family.\n\nMr. Betts will be a strong advocate for railway communication and will urge on the Government the importance of getting at once all claims for scrip.\n\nA. SPROAT,\nReturning Officer.\n\n[Signature]\n\nDated at Prince Albert, in the North-West Territories, June 23, 1888.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1888062201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6088, "total-output-tokens": 2500, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 735, 2], [735, 5731, 3], [5731, 10820, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]