[{"id": "a5a8733f3c8b347a8081aed53f80e6774f806654", "text": "THE PRINCE ALBERT TIMES\nAND SASKATOON REVIEW.\n\nPUBLIC NOTICE.\n\nTo all whom it may concern:\nNotice is hereby given that after the South West public inspection held at Prince Albert on Friday last a report will be sent to the Public Works Commissioner, Mr. Hillier, Prince Albert, and a copy thereof will be sent to the Minister of the Interior, Mr. James Macdonald, Ottawa, by the undersigned.\n\nW. NAPIER\nPrince Albert, Feb. 15th.\n\nPRINCE ALBERT\n\nA public meeting of the electors of Prince Albert was held at the town hall on Tuesday Evening, 19th Inst.\nPublic or any interested citizens are invited to attend and participate in the discussion of the matters at hand.\n\nPUBLIC MEETING TO THE HON. L. CLAKE.\n\nMr. Clarke delivered an address at length, explaining his position in regard to the proposed changes in the District of Loreau. He had been elected a member for this District in the North West Legislative Assembly.\n\nMr. Clarke then called on Dr. Macdonald, the medical officer of Prince Albert, to make a statement regarding the condition of the town.\n\nMr. Clarke concluded his remarks by thanking the audience for their attention and expressing his appreciation of their support.\n\nCOMPLIMENTARY DINNER TO THE HON. L. CLAKE.\n\nA public dinner was held in honour of the Hon. L. Clake, Member of Parliament for Prince Albert, on Thursday, February 15th.\nThe dinner was attended by a large number of prominent citizens, who extended warm congratulations to their distinguished guest.\n\nTELEGRAPIHIC.\n\nCustom House Collector Suspended—Deficit $3,000.\n\nThe Government refuses any concessions to North West Farmers.\n\nUnion Bay Railroad order withdrawn—Politi-\ncians united.\n\nSecession openly advocated on streets of Ottawa.\n\nNarrows take firm stand—and threatens to resign if Government refuses concessions.\n\nMeeting of convention on Hud-\nson's Bay Navigation—Royal, Chairman.\n\nBig Fire in Toronto.\n\nSugar Loaf Government denounced.\n\nFrance willing to cooperate with England.\n\nThe Gerryares in Germany.\n\nAssassination of Pope, King Chris-\ntian X, King Edward VII.\n\nWarner at Calgary.\n\nBy Special Telegram to The Times.\n\nWINNIPEG, Feb. 14—The Collectors of Customs at Emerson have been suspended.\nIt is reported that there is a deficiency of $3,000.\n\nA daughter of Dr. Larivo died here yesterday.\n\nThe Secretary of the Farmers' Union received a telegram from Ottawa stating that the Government have refused any concessions to the North West Farmers.\n\nThe Hudson Bay Railroad is the only line. The people are not allowed to go east. Great discontent is felt here at the thought from the eastern people in regard to this important question.\n\nGovernment is openly advocating the streets of Ottawa.\n\nDIGGA, Feb. 14—Premier Narrows has stood aside the question of Manitoba's demands. Yesterday he threatened to resign if the Government should grant Manitoba her requirements.\n\nThe first meeting of the Committee of the Hudson's Bay Company representative at Winnipeg today morning.\n\nHon. Mr. Royale was elected chair-\n\nPUBLIC NOTICE.\n\nTo all persons living within the Town of Prince Albert and vicinity:\nNotice is hereby given that the Town of Prince Albert will hold its annual town council meeting on Tuesday evening, February 15th, at 8 o'clock P.M., in the Town Hall located at the corner of Main Street and Second Avenue.\n\nAll citizens are invited and encouraged to attend this meeting to participate in the decision-making process of our town.\n\nPUBLIC MEETING.\n\nThe Town Council of Prince Albert invites all citizens to attend a public meeting to be held on Tuesday evening, February 15th, at 8 o'clock P.M., in the Town Hall.\n\nThis meeting will provide an opportunity for citizens to express their opinions and concerns regarding various matters affecting the Town of Prince Albert.\n\nAll citizens are encouraged to attend and contribute to the discussion.\nTHE PRINCE ALBERT REVIEW\n\nSPINK & MAVETTY\n\nPRINCE ALBERT, N.W.T.\n\nTHE SCHOOL LAW.\n\nTo the Manitoba School Act of 1873 provides for a Board of Education, consisting of two sections, one section having the care of Roman Catholics, and the other of the Protestant schools of the Province. It is the duty of each section to:\n\n- To have under its control and supervise the schools of the section, and make from time to time such regulations as may be deemed necessary for their government and discipline, and for the carrying out of the provisions of the Act.\n- To arrange for the proper examination of teachers, the recognition of certificates obtained elsewhere, and for the withdrawal of teachers who fail to come up to the standard required by law.\n- To select all the books, maps, and globes to be used in the schools under its jurisdiction, to approve or reject the work of school boards, provided however that in the case of books, maps, and globes religious and moral teaching is emphasized by the Board of Education.\n- Each section of the Board has an Executive officer or superintendent of schools, who acts also as secretary of the Board of Education, has the general supervision of the schools of his section, and also as a public visitor in the schools. In order to form school districts, a \"proposed ordinance\" requires a petition to the Lieutenant Governor in the manner provided. The petition must be published for two weeks in the local press, if opposed by five heads of families returning officers is appointed by the Lieutenant Governor and a vote taken in the district. The Lieutenant Governor may not receive any such report (a legally attested report of the returns of the vote) shall be proclaimed by proclamation direct the district or otherwise as may be the ordinance. If the wishes of the majority of the legally qualified voters of the polling division as expressed at the Poll. The expenses of taking the vote is defrayed out of the money granted to the holder of the Lieutenant Governor by those demanding the vote, the same required to such as the Lieutenant Governor may deem sufficient to cover the expense.\n\nIn Manitoba, in forming school districts where municipalities are unorganized, a petition of at least five rate payers of the district is sent to the Board of Education, such petition having been for two weeks posted at the office of the district. The districting Board may decide finality on question in dispute and objections brought forward. The Board of Education also decides all questions between the Councils of Municipalities in the formation of school districts within such municipalities. The formation and limits of districts are announced in the officials gazette.\n\nIn Ontario in unorganized districts on petition of five heads of families a district is formed by the Superintendent Magistrate or District Inspector of Schools.\n\nWith regard to trustees and other officers of the District School Boards the North-West proposed Ordinance, the Manitoba and the Ontario School Acts are very similar. Our new Ordinance, however, requires the trustees to act as inspectors of the schools, and to report to the same to the Lieut. Governor. This does not seem to be right, and when the Ordinance comes up again before the Council, we trust that a clause will be introduced providing for the appointment of at least two general superintendents of education for the Territory, one to take charge of the Roman Catholic and the other of the Protestant schools, with distinct inspection under them.\n\nIn regard to the provisions for the Board of Education Act is very complete, but in many respects they cannot be adapted to our present situation at this early stage of development. The Manitoba law though not so complete, gives us the greatest satisfaction.\n\nThe control of teachers and all arrangements concerning their duties, qualifications, the books to be used by them, examinations for promotion, etc., are left to the Board of Education. The teachers and schools are supervised by the superintendents, who report to the Lieutenant Governor on all the schools within their jurisdiction. In our province the Ordinance is a most justifiable indication of the profession of school teachers. There are a few specified duties for them to perform, but there is no provision for testing their qualifications, for making a profession, or guarding against incompetence or inefficiency, for so important a work. The whole success of the Ordinance, the character and efficiency of the schools, entirely depend upon the qualifications and character of the teachers. We call Mr. Oliver's attention to this defect in the Ordinance and trust that it will be remedied. With regard to aid to schools our proposed Ordinance provides a grant of assistance to schools having an average attendance of ten at least. According to the Manitoba Act, the Government grant is divided between the Roman Catholic and Protestant sections of the Board of Education, in proportion to the number of children between the ages of five and fifteen inclusive, residing in the various Protestant and Roman Catholic school divisions.\n\nIf the schools are in a satisfactory condition, the Board then makes to every school in its district an annual grant according to a scale of seven cents per pupil annually. The residue of the Provincial Government appropriation remaining is again divided among all the schools upon the basis of average attendance of pupils as shown in the reports of the superintendents from non-attending returned by the teachers.\n\nOur Ordinance proposes to refuse Government assistance to any teacher whose salary shall amount to less than $500 per annum, notwithstanding whether this is a wise course. The effect would simply be to deter men of first class ability from devoting themselves to teaching as a profession.\n\nWe shall return to this subject in another issue.\n\nROBERT THOMSON,\n\nSign & Ornamental Painter.\n\nDecorative Painting a Specialty.\n\nJUST RECEIVED AT THE MEDICAL HALL.\n\nVictoria Hypophosphites,\nVictoria Buchu and Uva Ursi,\nVictoria Carbolic Acid Soap,\nBurdock Blood Bitters,\nBurdock Pills,\nHagyard's Cough Balsam,\nHagyard's Yellow Oil,\nDirect from the Manufacturer.\n\nTERM CARD\n\nJ. O. DAVIS & CO.\n\nDon't talk unless you have something to say.\n\nI whose purpose is to sell will praise but not exceed the truth, even to sell.\n\nThe Boom is off!\n\nWe are determined to sell out at actual cost. Hard Lines. Better luck next time.\n\n\"What cannot be avoided Twere childish weakness to lament. How often in affairs of men we see Hall hesitation end in useless loss! If losses must be made, decide at once, And with proceeds of thy sales buy cheaper. Gold that's put to use more gold begets.\"\n\nYou know how we are situated. Please call and say you wish to buy for me. This will be sure to establish a very agreeable feeling between us. You will thereby be master of the situation, and we will be sure to serve you in a satisfactory manner.\n\nBRANCH STORE\n\nNear the building occupied by the late firm of Ashdown & Agnew, in the west end.\n\nMr. W. C. Ramsay is in charge, and the public may depend on courteous treatment.\n\nJ. O. DAVIS & CO., Wholesale and Retail.\n\nPRINCE ALBERT, SASK.\nTERRITORIAL NEWS.\n\nREGINA\n\nFrom the Leader, Jan. 31.\n\nThere was no Council meeting this week.\n\nRegina is memorialising the Government, amongst other matters, for representation for the North West Territories.\n\nFrom Regina next week, probably sail up to Cranbrook and Lethbridge. Since the 4th of this month a mail has been running to Caribou.\n\nBATTLEFORD\n\nFrom the Herald, Jan. 18.\n\nMr. B. F. Forget has been appointed deputy sheriff for this district.\n\nThe question of establishing a mill at Battleford may not be said to be settled.\n\nThe instruments for a band have been ordered by Mr. Macdonald & Co., who are fitting up one of their large warehouses as a hall in which to hold concerts, balls and other public entertainments.\n\nPORT McLEOD.\n\nFrom the Gazette, Jan. 26.\n\nCapt. Smith has brought out Mr. Leighton in the mail contract.\n\nCapt. Cotton, who assumed command of this post when Major Crofter left, expresses himself as delighted to get to McLeod.\n\nThe wind blew very hard all day Wednesday and most of the night. Although scarcely a moonlight, it has taken away all the color.\n\nThe publication of the Sunday Ordinance in the Gazette last week had its effect, as several stores were closed.\n\nThe N.W. Gazette has just published the proclamation concerning the incorporation of the town of McLeod.\n\nThe proclamation for the election of mayor and four councillors. Nomination on February 4th.\n\nMANITOBA.\n\nRAT PORTAGE.\n\nFrom the Progress, Feb. 1.\n\nA delegation has arrived in Toronto against F.J. Aplin, returning officer in the late Algoma election, for $1000 for revoking votes.\n\nA number of charges have been issued this week in payment of amounts connected with the small post outbreak last winter.\n\nThe Winnipeg papers call the Olson case \"the Rat Portage Horror.\"\n\nConsidering the fact that the crime—if crime it was—was perpetrated 125 miles east of Rat Portage, the indictment is somewhat vague.\n\nFARMERS' GRIEVANCES.\n\nOur excellent contemporary the Winnipeg Commercial commented very well on his article on this subject with the following remarks:—\"Out of the bundle of complaints which have been sent in, it is pleasing to note that some good practical results are likely to come. Men of shades of opinion in this city are anxious that wheat products of the North West have to reach a sea port by rail route of 2000 miles, against a route of only 1000 miles, and it is not at all unlikely, that the present agitation will lead to the construction of a rail route from Edmonton via Fort Macleod and Lethbridge, which will be not more than one third of what it is to an Atlantic port. With such a route, the North West territory would no longer be bound, and it would become the interests of the Canadian Pacific Railway Company to have as many connecting links with the south as possible, not as outlets for our produce, but as inlet for the products of the North-western States which would find their way to market via the Hudson's Bay route. All other grievances which farmers now complain of, would then be found to rest very lightly upon the North West.\"\n\nHANLAN'S LITTLE JOKE.\n\nMr. Hanlan took advantage of the absence of Mr. Maclean to put our machine forward for a mill.\n\nA. P. Forget has been appointed deputy sheriff for this district.\n\nThe question of establishing a mill at Battleford may not be said to be settled.\n\nThe instruments for a band have been ordered by Mr. Macdonald & Co., who are fitting up one of their large warehouses as a hall in which to hold concerts, balls and other public entertainments.\n\nLATEST YANKEE NOTION.\n\nA Bridgewater (N.S.) professor has invented a new thing in the way of a steam boiler to cook about on the land. It is called the \"Poveshell Body Steam Heater.\" The apparatus is a small affair consisting of a copper boiler under which is placed a stove. The boiler is fitted in a nickel box, and balanced something like a compass, so that, no matter what position the stove may be in, the boiler and lamp will always remain in their proper vertical position. The entire apparatus is so small that it can be carried in a pocket. When the stove is lighted, the water in the boiler is heated and circled around rubber tubes which run around the body of the stove, and around the back and below the boiler. The circulation of the warm water keeps the body warm over a considerable distance. A safety valve and escape for a higher pressure of steam than the affair is designed to carry is provided. If the house the lady's maid can light the lamp, which, by the way, is gauged to show the pressure of five or ten hours, \"my lady\" walks outside in the presence of strangers and warranted to be kept warm during the promenade.\n\nThis would be a very convenient appliance for the North West this cool weather. Which of our merchants will enter into the manufacture? We are surprised there is not much danger of getting up too much steam of any kind in this country, so the safety valve is hardly necessary, although an explosion would be caused in the badly indicated. Ed.\n\nPHOTOGRAPHS!\n\nChas. E. Page.\n\nNEW STUDIO.\n\nEAST END.\n\nG. D. NORTHGRAVES,\n\nWatchmaker and Jeweller,\n\nA T. N. Campbell's New Store.\n\nA LARGE STOCK OF\n\nWatches,\n\nClocks and\n\nJewellery\n\nKEEP CONSTANTLY ON HAND.\n\nRepairing Promptly Attended to.\n\nJAMES SINCLAIR,\n\nMerchant Tailor,\n\nHas just received his new stock of\n\nFall and Winter Goods,\n\nAnd is prepared to supply his numerous customers with\n\nSuites to please the fancy of all.\n\nAlso a large stock of\n\nUNDERCLOTHING\n\nA Large Assortment of\n\nFUR CAPS AND MITTS\n\nGive me a call.\n\nJAMES SINCLAIR,\n\nEAST END BAKERY,\n\nEight Leaves for $1\n\nPublic Notice\n\nNotice is hereby given that until Feb. 15th the undersigned may be found at the Dominion Lands Office, Prince Albert, for the purpose of receiving evidence etc., concerning claims to land in this district.\n\nOn application an appointment will be made for the examination of any particular claim or class of claims preferred.\n\nBlank forms, on which evidence in the majority of cases is to be formulated, will be furnished.\n\nBy authority,\n\nW. PEARCE,\n\nInspector.\n\nJanuary 23, 1884.\n\nPhotographs\n\nFurniture\n\nJust arrived. In addition to our former large stock we have received some\n\nFancy Parlor\n\nSideboards,\n\nBureaus,\n\nBedsteads,\n\nCouches,\n\nSofos,\n\nChairs of nearly all descriptions,\n\nCradles & Cribs for the Babies\n\nRocking Chairs for the Ladies\n\nMattresses Single & Double to suit Customers.\n\nG. & C. E. CARTER,\n\nHu For THE WEST.\n\nGENERAL BLACKSMITHING\n\nAND\n\nHORSESHOEING\n\nDone on the Most Approved Principles and the following diseases remedied.\n\nContracted Feet, Head Board Wounds, Hoof Corns, Interfering and other diseases of the feet of horses.\n\nSleigh and Cutter Ironing,\n\nCarriage Repairing\n\nAnd Jobbing\n\nPromptly attended to.\n\nWM. GORDON.\n\nPRINCE ALBERT\n\nPlaning Mills and\n\nSash and Door Factory\n\nJ. M. CAMPBELL.\n\nStill on the War Path\n\nWITH A LARGE LINK OF GOODS\n\nAnd Slaughtering the Prices.\n\nRemember, it is not old stock which we are advertising, as we claim, nor the title of the lowest prices, but the best quality, the best selected stock in the North West, and the best prices.\n\nBonanza!\n\nDry Goods and Novelties!\n\nIncluding a large line of\n\nBracelets, Ladies' Watches, Belts and Suspender Chains, Buttons, Bands and Jerseys, Handkerchiefs, Lace, Ribbons, Umbrellas, Umbrella Stands, Spreads, Blankets, Private Clothing, Shawls, White and Colored Flannel, etc., etc., etc.\n\nAll goods fresh and new. An inspection will convince you that we have the best selection of goods, boots, shoes, merchandise, etc., etc., etc.\n\nAll goods at below market prices.\n\nHugh McDougall,\n\nEast End Bakery.\n\nPrince Albert Bakery.\n\n2LB LOAF, 12C.\n\n9 LOAVES, 1S.\n\nLakes and Pastry always on hand and made to order.\n\nWM. R. BELL,\n\nFarmers' Restaurant.\n\nMeals at all Hours.\n\nGood Beer and Cigars always on hand.\n\nGood Boarding Stable in connection.\n\nR. J. O'LEARY,\n\nProprietor.\n\nROCK BOTTOM STORE\n\nE. Walters, F.G. Baker.\n\nBankers.\n\nTrimmer Libby.\nHudson Bay Route\n\nThere is now very little doubt left that a railway will be built before very long to the Hudson Bay, by one or other of two routes, either by constructing a new line from Winnipeg, or by improving an existing route which is now being attempted. The question of the route has been discussed extensively, and an important feature in the undertaking is whether the railway should be constructed on the east side of Lake Winnipeg, where the land through which the work would be done would be more adapted for rail road building, but also when opened up would be more suitable for agriculture.\n\nWe refer to the route via Wabigoon, Fort Frances, better known as the \"Pine Route,\" from a correspondent Mr. Nelson of Selkirk, who has visited the country with the surveyor and whose testimony is strong in favor of the western route.\n\nAllow me to draw your attention to some important factors which may be considered in the selection of the route. The easternmost part of Lake Winnipeg appears to be York Factory, Churchill or their vicinity. In the first place, the route via Wabigoon is the shortest. Supposing no natural obstacles existed, it is shorter than the route via Fort Frances by thirty miles, increased by transportation costs. Natural obstacles such as the east coast of Lake Winnipeg may be seen existing at Lake Winnipeg. The country is one mass of granite and basaltic rocks, often intersected by streams running in all directions, with muskeg in the intervening spaces. There is but little agricultural land along the eastern banks of the river, and this can only extend back a quarter or half a mile from the banks. The soil is poor, the land is not productive, and of poor quality, while giving a greater yield than eighteen inches of soil to the thousand feet of land. The route goes to the Thompson River, the Hayes River, and the St. Mary's River, and the Hayes River over all the rivers flows away from the line of railroad, so that the lands are not available for settlement, and cannot be utilized for distant markets at a reasonable cost. In fact the route is very similar to the old Portage Route, and the route for the east side of Lake Winnipeg is a railway route to the Hudson's Bay via York Factory. But the main objection to it is that it might be eighty miles shorter, assuming all other natural obstacles can be overcome without touching the route by curves and tunnels.\n\nThe west side of Lake Winnipeg is altogether different. In the first place, the country is good land, by far the largest portion of the country being good land similar to that in the Red River Valley, or Lake Manitoba. It is capable of supporting large agricultural settlements, and the soil is productive; there is good farming land throughout, although wet from want of drainage. It also contains huge tracts of timber, situated at a low level, and therefore stumps have very little rock formation. Besides that there is a river running through the whole country, two rivers to cross which are of any magnitude. All the rivers crossing the route, within the limits of land included in the contract would be in a position to feed the railway, and especially in this case the little Red River, the Hayes River, and the Thompson River.\n\nThe fact of tapping these two rivers above Winnipeg, in itself, an immense inducement for running the railway across Lake Winnipeg, and for utilizing them the whole Saskatchewan country and that of Lake Manitoba. The railway will allow connection by water with the rail road. Perhaps you are not aware that Lake Winnipeg is connected by a river which will permit a steamer drawing three feet of water to travel its length and up to Edmonton. I have said nothing of Lake Winnipeg, but it must be appreciated by anyone on looking at a map, that the effect of water would be useless, either as a feeder to the line or as a side line, and therefore the river would be useless for the construction. The latter fact would make the construction of the railway easier, and therefore the cost of navigation, and Norway House and Seine Falls at the foot of navigation, would be saved. The railway would be laid across a portion of the line quickly and cheaply, so that construction could proceed at a much faster rate than the river would allow.\n\nWhat then becomes of the northern route?\n\nIf the Hudson Bay route was only practicable, there was nothing of English origin ready to be used in the construction, and there are hundreds of miles of main line enterprise. It is perfectly astonishing the amount of money that has been spent by the people of the Old Country. Every Englishman who can get hold of a map of Canada, and who has heard of the work of the Hudson Bay navigators are being interested in all sides. It is felt in London that the possibility of the route is a great opportunity for our own people a great opportunity in which those English capitalists speak about this country, and the great things in store for us. All we want to do is to take advantage of it, and to take the most of our opportunities, we will come out all right.\n\nThe C.P.R.\n\nThe Work That Must Be Done in the West.\n\nMajor Rogers has submitted his official report concerning the work of the C.P.R., from the junction of the Canadian Pacific Railway with the Rockies to the second crossing of the Columbia. The route adopted provides for the continuation of the railway from the junction of the Canadian Pacific Railway with the Rockies to the second crossing of the Columbia. The route adopted provides for the continuation of the railway from the junction of the Canadian Pacific Railway with the Rockies to the second crossing of the Columbia. The route adopted provides for the continuation of the railway from the junction of the Canadian Pacific Railway with the Rockies to the second crossing of the Columbia.\n\nR.B.WAY.\n\nNEW FALL AND WINTER MILLINERY.\n\nLADIES' COLMANS AND CLOAKS, FUR CAPS AND MUFFS, WOOL GOODS.\n\nAND Ladies and Children General Furnishings.\n\nMISS MACK & CO,\n\nCAMPBELL'S BLOCK.\n\nJUST RECEIVED.\n\nIron Steel, Horse Shoes, Horse Nails, Bolts and Chain Sleigh and Butter Runners Shafts and Tools for sale.\n\nAnd a variety of other articles generally wanted in a first-class Riding and Shooting Store.\n\nCHESTER THOMPSON,\n\nPRINCE ALBERT.\n\nPUBLIC NOTICE IS HEREBY GIVEN that all persons desiring to purchase land in the Hudson's Bay Company's District of Rupert's Land, between the 52nd and 61st parallel of north latitude, are requested to apply to the office of the Department of the Interior, Ottawa, for information regarding the same.\n\nE DEVILLE,\n\nChief Inspector of Government Survey.\n\nBuffalo Hall!\n\nGreat Clearing Sale of FURS, MITTS AND MOCASSINS\n\nOwing to the above choice stock of goods reaching here so late, we have decided to offer Ladies' Astrachan Sacsques, Ladies' and Men's S.S. Seal Persian Lam.' Otter, Beaver, As'trachan and Cloth Caps, Kid Mitts, Buck Mitts, and an immense stock of Ladies', Men's and Youths' Mocassins, at cost for cash.\n\nBETTS & Gwynne.\n\nHARDWARE!\n\nJ.L. JOHNSON & Co.\n\nDEALERS IN General, Shelf and Heavy Hardware, Glass, Paints, Oils, Etc.\n\nMain St., Prince Albert.\n\nT.N. CAMPBELL,\n\nBookseller and Stationer\n\nSchool and Miscellaneous Books, Stationery, Fancy Goods, Musical Instruments, Toys, Etc., Etc.\n\nOrders for Books from Great Britain, Toronto, Montreal and United States promptly attended to.\n\nPrince Albert - N.W.T.\n\nHUDSON'S BAY CO'Y\n\nFARMING LANDS!\n\nFOR SALE IN Manitoba & North-west\n\nThe Hudson's Bay Company owns 7,000,000 acres in the Great Terrebonne Belt, and now offers for sale 500,000 acres, already surveyed by the Government of Canada.\n\nIALSO\n\nTOWN LOTS FOR SALE\n\nIn Winnipeg, West Lynne, Rat Portage, Portage la Prairie and Bochen, N.W.T.\n\nThe above will be disposed of at reasonable prices and on easy terms of payment. Full information in regard to these lands will be given at the offices of the Company in Winnipeg and Montreal.\n\nC.J. BRYCEES, Land Commissioner.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1884021501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 6134, "total-output-tokens": 6016, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3855, 1], [3855, 11068, 2], [11068, 19029, 3], [19029, 27001, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]