[{"id": "a5eaa6d85e258e091788d3cf6a21693eb70403c7", "text": "THE PRINCE ALBERT TIMES\nAND\nSASKATCHEWAN REVIEW,\nPUBLISHED BY\nJ. D. MAVEETY\nPRINCE ALBERT N. W. T.\nTERMS—$1.50 per annum in advance.\nIn case this will not be inserted in this issue, please notify the Proprietor.\nTransient advertisements will be for the\nsame rate as above.\nAdvertisements without instructions will be charged at $2.00 per month.\nAll letters to be addressed to the Proprietor.\n\nSUNDAY CHURCH SERVICES\nSt. Albert's Church—Sunday Morning—10 a.m.\nSt. Patrick's—Sunday Morning—10 a.m.—Rev. Canon Fitzpatrick.\nSt. Patrick's—3 p.m.—Rev. Dr. McReynolds.\nSt. Patrick's—6 p.m.—Rev. Mr. Macdonald.\nSt. James'—3 p.m.—Rev. Dr. Macdonald.\nSt. James'—6 p.m.—Rev. Mr. Macdonald.\nSt. Patrick's—7 p.m.—Rev. Mr. Macdonald.\nSt. Patrick's—8 p.m.—Rev. Mr. Macdonald.\n\nThis Paper may be found at:\nRossell & Co., 109 Main St.; Mr. G. E. Rossell.\nBurton, 15 Spruce Street; where additional copies may be purchased.\nAll correspondence should be addressed to:\nR. C. Wigmore & Co., 109 Main St., Prince Albert.\n\nTHE MAYORALTY.\nAlthough five candidates were nominated for the position of Chief Magistrate of this town, some of them we understand without any consent have already stated they shall have something to say in another paragraph, it appears to be pretty well settled as polling day approaches that the contest for this honorable position will be narrowed down to two candidates—Mr. Knowles and Mr. Smith. These gentlemen are so well known to the community that it would be useless for us to expatiate on their relative merits.\n\nThe one an old pioneer and a leading member of the town, while the other a leading banker and authority on finance and will calculated to bring this important branch of our municipal system upon a sound basis.\n\nWith two such men before our citizens, we do not feel called upon to express any definite preference, but prefer to let the language of one of our writers—\"best of both\"—stand by and see fair play, and leave them both in the hands of our intelligent electorate, who will doubtless select the best man.\n\nMeanwhile we congratulate the town on its good feeling and absence of the usual mud slinging that has so far characterized these elections.\n\nContrary to expectation the opinion of the Supreme Court at Ottawa on the Manitoba's crossing case has been unanimously against the C. P. R. The point in dispute was as to whether the Manitoba Legislature had power to enact legislation authorizing the Red River Valley railway to enter the province. The decision of the C. P. R., that railway having been declared a work for the general advantage of Canada. The judges of the Supreme Court have decided that the legislature of Manitoba had no power, and that the crown can be made after the Railway Committee of the Privy Council has approved of the mode and place. The general opinion of the Press of Eastern Canada is that the decision is unsatisfactory, as no grounds are given why it should be so. An appeal will most probably be heard by the C. P. R. to the Imperial Privy Council, which will take up some more valuable time. In the meantime the R. R. V. railway will be at a standstill, unless the courts in Manitoba refuse to grant any more injunctions, in which case the road will doubtless be completed as a private enterprise pending their appearance to the Privy Council, use force to prevent a crossing; but such action would, we believe, lead to serious trouble.\n\nThere is something wrong in our Municipal Ordinance. Candidates for Mayor or Councillor should be compelled to make a deposit at their nomination. The candidate should be required to give his name to the nominating committee in writing or his backers should make a declaration that he has or will consent to the nomination, then we would not be liable to have so many men nominated who have no intention of running, as was the case at the last election. Against this proposal an elector in a ward should be allowed to nominate candidates for that ward. Here we have every year men nominated without their knowledge or consent by parties who, with a reckless disregard for the welfare of the town, put themselves through the trouble and annoyance, they put others to, doing it for fun.\" When the interests at stake of the town are at stake strict conduct should be severely condemned and provision made in the law whereby it would be guarded against.\n\nThe Regina Leader makes serious charges against the Committee of the N. W. M. P. I sympathize with the Regina members in the cantent matter, and hope that they will take such action as will result in the breaking up of what is apparently a job on a large scale and which may be extended to other parts of the Territories.\n\nCOMMUNICATIONS.\nIt must be distinctly understood that we do not agree with the opinions expressed by correspondents in our columns, nor do we agree in full, nor necessarily for publication in any form, with the views expressed by any contributor.\n\nQUEBEC'S SPEECH.\nTo the Editor of the Times.\nSir,—With regard to your report of the speech delivered by Hon. Sir George-Étienne Cartier at the opening of the National Academy, while I agree with that affection is repugnant to Northerners, allow me to state that there is nothing in his speech that is repugnant, and that is an unmitigated reflection on the nationality and religion of a considerable portion of our population. I trust that your paper will not be unkind or hurt the feelings of anybody in your paper, will be carried out in alleged semi-religious entertainments.\n\nYours truly,\n\nONE WHO KNOWS.\n\nThe Manitoba Daily Free Press of this morning is the largest, we have ever seen in our times, it is a large newspaper and is replete with a historical sketch of the foundation and growth of the city of Winnipeg; a sketch of different ethnological organizations; a chronology of 1889; several Christmas stories and poems together with the usual supplement of various local news. The Free Press is a fine journal.\n\nTHE TORONTO WORLD is absolutely the best daily paper in Canada. The Toronto World is the oldest and greatest newspaper in Canada. It serves up fresh, crisp and free news for a month and you will want to continue reading it. Price 25 cents annually, or 15 cents per month. Address: THE WORLD, Toronto.\n\nThe Toronto World, started by the Prince Albert Times for 20 years. Send 6 dimes with cash direct to the TIMES OFFICE.\n\nR. C. Wigmore & Co.\nMen's and Boys' Underclothing\nMen's Collar Jackets\nMen's Pea Jackets\n1,000 Remnants of Carpets, cheap\nA Full Line of Dress Goods\nChoice Selection of Ladies' Hosiery\nMen's Overshoes at cost for cash\nMitts and Moccasins\nA Paying Investment. Examine Our Stock.\n\nR. C. Wigmore & Co.\nXMAS.\nBuffalo Hall!\nFor Dry Goods, Clothing, Gent's Furnishings and Groceries\nWe are showing the Largest and Cheapest Stock in town. Prices Very Low\nDrives in Dress Goods\nDrives in Hosiery and Gloves\nDrives in Shirts and Drawers\nDrives in Shawls and Wraps\nJersey Jackets\nCaps and Tomahawkers\nWe can certainly say to any one in want of Dry Goods, Furs, Carpets, Clothing and Gent's Furnishings, Groceries, etc., that Our Stock is unequalled for Quality and Price. Call and Inspect Our Stock.\n\nBETTS & GWYNNE\nT. N. Campbell\nSchool Books and Stationery,\nPublic and High School Text Books,\nSchool Requisites of every description,\nStephens' Blue Black INK,\nALL SIZES—WRITING AND COPYING\nOffice Stationery, etc., etc.,\nROBERTSON & ROBERTSON,\nMerchant Tailors\nGENTS FURNISHINGS\nImported Tweed Uitings,\nTrowsering and Overcoating\nWORSTEDS,\nIN ENGLISH AND AMERICAN LINES,\nCANADIAN TWEEEDS\nIn all varieties, from the best manufacturers in the Dominion\nSUMMER SUITINGS\nIN ALL GRADES\nRobertson & Robertson\nTERRITORIAL NEWS\n\nLETHBRIDGE.\n\nFrom the News, Dec. 18.\n\nHis Lordship the Bishop of Lethbridge has been obliged to arrive here on Wednesday morning in order to attend the services in the church. He will be present at the morning service this morning, and on behalf of the congregation, present his wishes for the prosperity of the city.\n\nTo the Right Rev. His Lordship of Saint John's and Calgary—The petition of the undersigned residents attending the Anglican Church, Lethbridge, respectfully asks:\n\nThat the Rev. J.F. Prichard, who has been the parish priest for six months, be given the opportunity to continue his duties in such a manner as to secure for himself the confidence and favour of the congregation.\n\nThat as the result of his labours the congregation has grown in numbers and increased in regularity of worship, he be encouraged to continue his labours in the diocese, whereby the position of the church has been greatly improved.\n\nThat in view of the above, they pray that Your Lordship may please be so good as to recommend the Rev. Mr. Prichard to the permanent incumbency of St. Andrew's Church, Calgary, and that your petitioners will ever pray.\n\nHis Lordship in reply said it gave him great pleasure to hear the prayers of his flock, and he would be pleased to grant the request of the congregation, and would, during the year, indeed the Rev. Mr. Prichard into the incumbency.\n\nBATTLEFORD.\n\nFrom the Herald, Dec. 15.\n\nEggs scarce at 60c. to 75c. per dozen.\n\nThe ladies of Battleford have issued invitations to a leap year ball, to be given on New Year's Eve.\n\nThe public will be very highly pleased to learn that Battleford Post Office has at last been made a money order office.\n\nThe new post office will go into operation about the new year.\n\nNeither snow nor cold weather have prevented more than two weeks' rain in Battleford.\n\nOne day's work was done by the men going out without hindrance, and cattle that are on the range were come back under care being brought in, partly as a natural result, partly to the credit of the season of 1879 and 1877 were in every respect similar to the present.\n\nCALGARY.\n\nFrom the Tribune, Dec. 19.\n\nYesterday evening Bishop Hughson visited Wainwright, who has been employed on Simson's ranches for the last three years, was brought to town on account of being ill.\n\nA small snow slide occurred about four miles on this side of Field yesterday. The slide was about seventy-five feet long and from thirty-five to forty feet wide. Two teams were sent out from Lagass, Field and the track cleared in a short time. The train from Field was being delayed by the couple of hours.\n\nOn Saturday Capt. Jackson, who lives about two miles out, drove into town with a couple of pigs in his wagon, an extraordinary sight in this part of the country. They consisted of a couple of young boars, one cinnamon and the other black, that were purchased at the last sale of cattle.\n\nThe cinnamon one is a lusty chap, weighing about 200 pounds, while the black one is only 125 pounds. Capt. Jackson had the animals down to have them photographed. They are quite tame and gentle and playful about their owner's presence.\n\nQU'APPELLE.\n\nFrom the Tribune, Dec. 20.\n\nA great excitement prevailed yesterday, which played havoc hence with the snow.\n\nThe Lieutenant-Governor closed the proceedings of the Legislative Assembly in his address to the members. When a waste of time and talent, to any nothing of the meritorious precedent established.\n\nThe portable engine which had been taken to the Qu'Appelle River to mill there has been abandoned on the Salt Plains owing to its inability to stand the rocks of the river bed, and our readers' pains have been previously to this effect.\n\nThis has generally been considered to be a prohibition country; but from the evidence laid before the Assembly it would appear that this is all a mistake. According to the documents adduced to us, there are 35,000 gallons of beer, 40 per cent and 6,000 gallons of liquor into ending June 31st, which is not so bad for a population of about 30,000 white people.\n\nEDMONTON.\n\nFrom the Bulletin, Dec. 8.\n\nThere will be a parlor concert at St. Mark's Church Friday evening.\n\nH. S. Cassie started from Edmonton on Sunday night, after delivering God's word at Calgary.\n\nThe skating operations are nearly over at St. Albert's neighborhood and the people are busy preparing for winter.\n\nSt. Andrew's Day was the 29th annual celebration of the Episcopalian Church, and a celebration in the Episcopalian Church was held at the St. Albert Mission.\n\nNOTICE.\n\nApplication will be made to the Parliament of Canada, at the next session, for an Act extending the time for completing a railway line between Edmonton and the Rocky Mountains. Company and authorizing the company to purchase land, erecting its rights, properties and franchises to the Canadian Pacific Railway Company, enabling the latter company to complete the line between Edmonton and the Canadian Pacific Railway, and for other purposes.\n\nR. T. HENKIN, Solicitor.\n\nJ. M. CAMPBELL'S.\n\nFirst Class Goods\n\nNever before heard of in Prince Albert. We are showing MAGNIFICENT STOCK NEW GOODS Far surpassing any previous season, both for richness of design and quality. The Variety of New Goods in Every Department IS IMMENSE\n\nCall and Examine Our Stock\n\nNo one like to show Goods.\n\nJ. M. CAMPBELL\n\nLUMBER.\n\nMOORE & MACDOWALL\n\nLIMITED\n\nHave a Large Stock of LUMBER!\n\nFOR SALE.\n\nALEX. LOUDOUN,\n\nSec.-Treas.\n\nAGENTS:\n\nP. G. GRAY,\n\nEdmonton, Alta.\n\nJ. FRASER TIMS,\n\nFort Saskatchewan Alta.\n\nMahaffey & Clinkskill,\n\nBattleford, Sask.\nChristmas Tree at St Andrew's\n\nA very successful Christmas Tree entertainment was given by St. Andrew's school at their annual Christmas tree. The proceedings commenced with recitations and singing by the children, who performed in a manner extremely well conducted. Santa Claus then appeared on the scene, in the person of Mr. Andrew Spencer, who was well liked, and distributed his gifts of presents to the delighted children, and to others also, among whom the widows of the parish were included. After the close, Mr. Macdonald J. McKay gave a short address, and then proceeded on the platform, where he addressed the platform and the young folks spent the rest of the evening in their favorite occupation.\n\nA substantial supper was also provided to which the large number of guests and people present were invited. Several visitors shared the pleasure of a very enjoyable evening, and left behind many delightful memories of a few hours that will be cherished by all.\n\nThe proceedings were most successfully carried out, and credit is due to the promoters and managers of the entertainment. The people of St. Andrew's have, from the first, shown, under the guidance of a few public-spirited individuals, a praiseworthy and enlightened interest in the education of the young. Ever before the advent of the present principal, the school entertainments were within their reach, they had ignored the services of an educated teacher, Mr. Bernard, under whose management the school has reached a high state of efficiency.\n\nTHE NOMINATIONS\n\nOn Monday last the nominations for candidates to fill the seven municipal chairs, were held in the Town Hall between Mr. T. N. Campbell, the returning officer, and Mr. J. Agnew, the chairman. Before about sixteen interested electors, they have no interest the same practice was continued this year. Wards No. 4 and No. 5 were contested for, but Mr. R. Macdonald was returned by acclamation. For Ward No. 2, no candidate was nominated, but there were all with one exception soliciting the suffrages of the voters of that ward.\n\nIn Wards No. 1, No. 3, No. 6, and No. 7, ward were all before the electors but from latest reports they have all with- drawn or are intending to withdraw, but two.\n\nOf the five nominees for the mayoralty three have dropped out leaving the con- test between Messrs. T. J. Agnew and K. Macdonald.\n\nThe following are the nominations as taken by the returning officer:\n\nWard No. 1.\nChairman Woodhouse, proposed by J. D. Snell and Chas. Byrne.\nJ. R. McPhail, Wm. Miller, and Mr. Macdonald.\n\nWard No. 2.\nR. Deans, A. Goodfellow, and R. C. Wigmore.\n\nWard No. 3.\nW. B. Goodfellow, Geo. T. Brown and T. E. Baker.\n\nSam. McLeod, T. J. Agnew and T. E. Baker.\n\nR. J. Prichard, T. E. Baker and T. J. Agnew.\n\nS. J. Macdonald, W. B. Goodfellow and C. Hamilton.\n\nC. Hamilton, T. O. Davis and T. E. Baker.\n\nThos. Owen, R. C. Wigmore and T. O. Davis.\n\nWard No. 4.\nJames Sanderson, R. C. Wigmore and T. O. Davis, proposed by Dr. A. E. Porter and T. E. Baker.\n\nT. E. Baker, T. E. Baker and W. B. Goodfellow.\n\nJ. D. Mavety, T. E. Baker and H. E. Ross.\n\nT. E. Jackson, R. C. Wigmore and H. E. Ross.\n\nT. E. Baker, T. E. Baker and J. Agnew.\n\nJohn Stewart, R. C. Wigmore and W. B. Goodfellow.\n\nWard No. 5.\nR. Macdonald, T. J. Agnew and J. Agnew.\n\nWard No. 6.\nT. J. Agnew, proposed by Dr. Porter and seconded by Mr. Macdonald.\n\nJ. Agnew, R. J. Prichard and J. M. Campbell.\n\nR. Deans, proposed by J. Agnew and A. Goodfellow.\n\nJohn Stewart, H. E. Ross and T. O. Davis.\n\nJ. L. Johnson, James Sinclair and John McTaggart.\n\nWard No. 7.\nR. Macdonald, T. J. Agnew and J. Agnew.\n\nVOTE! VOTE! VOTE!\n\nYou are requested to cast your vote for\n\nLOW PRICES!\n\nWhich you can do by calling\n\nAT THE\n\nHorse Shoe Store.\n\nTHOS. O. DAVIS.\n\nRUSSELL & DAVIS\n\nFOR THE\n\nBest Assorted Stock of\n\nCONFECTIONERY\n\nGO TO\n\nH. MACDOUGALL'S\n\nBAKERY.\n\nGoods delivered to all parts of the town free of charge.\n\nGet Your\n\nSCHOOL\n\nSUPPLIES\n\nAT\n\nCANN'S\n\nBOOK STORE.\n\nGO TO\n\nAGNEW'S\n\nFOR\n\nStoves\n\nStoves\n\nStoves\n\nHeating\n\nDrums\n\nStovepipe\n\nCoal Oil\n\nT. J. AGNEW", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/PTR_1889010401.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 4, "total-input-tokens": 5766, "total-output-tokens": 4373, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 7668, 2], [7668, 13259, 3], [13259, 17317, 4]], "primary_language": ["en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true], "rotation_correction": [0, 0, 0, 0], "is_table": [false, false, false, false], "is_diagram": [false, false, false, false]}}]