[{"id": "2a83397677c0128ef17ebcc3fe5e8424efd25a8c", "text": "Publisher's Notice.\n\nSubscription price: 50 cents per annum, by mail in advance; single copies one cent.\n\nThe rates for our advertising space by columns are as follows:\n\nOne Column: $1.00 per month.\nHalf Column: $0.50 per month.\nQuarter-column: $0.25 per month.\nTwo-Column: $1.50 per month.\nBusiness card size: $0.10 per month.\n\nThe above rates do not apply to display advertisements, entertainments, tender meetings, or any other special announcements. Rates may be increased at any time without additional notice. Yearly advertisements will be charged at the rate of $1.00 per month.\n\nBusiness cards, 50 cents for first twenty, 40 cents for each additional twenty.\n\nThe publishers reserve the right to reject any advertisements of questionable or objectionable character.\n\nAddress: James WEIDMAN, Editor, Qu'Appelle Progress, Assiniboia, S.W.T.\n\nE. J. WEIDMAN, Proprietor.\n\nLegal.\n\nESLIE GORDON, Notary Public, Commissioner for Manitoba, &c., Agent for the Royal Western Land Co. and the Royal Western Land Co. Fire & Life Insurance, Money to Land, QU'APPELLE STATION, N.W.T.\n\nTenders.\n\nSEALED TENDERS addressed to the City Chamberlain Wesley Municipality and enclosed in sealed envelopes for Tender Box No. 1, will be received up till Friday, Feb. 26th.\n\nBuilding a Bridge on the Qu'Appelle.\n\nNear W.P.O. Order's farm, Post Office and road crossing can be seen at Honesty Creek's, who has kindly offered his land. Tenders to be opened on Saturday, 27th.\n\nBy the Board of HUNTLEY-CAMPBELL, Post Office Bridge Committee.\n\nMail Contract.\n\nSEALED TENDERS addressed to the Postmaster General will be received at the Post Office, Qu'Appelle, until Tuesday, February 26th, 1886.\n\nFriday, Feb. 26th.\n\nAuction Sale of Valuable Freehold Property.\n\nTo Messrs. Smith & Co., in the Northeast Territories and in Manitoba West of the First Principal Meridian.\n\nUnder and by virtue of a power of sale contained in a certain mortgage which was executed by Mr. Smith & Co., there will be sold by Public Auction, by Fred. J. Suther, Auctioneer, at the Post Office, Qu'Appelle Station, on the 27th day of February, 1886, all the North West Territories of Canada, on the 27th day of February, 1886.\n\nNotice.\n\nThe meeting advertised to take place on the 9th instant, was duly held and proceedings were passed on the following resolutions:\n\nResolved, That the Agricultural Society of the Town of Qu'Appelle, be called \"The South Qu'Appelle Agricultural Association.\" The fee for members shall be one dollar, payable in advance.\n\nThe meeting will be held at the present year, President, W. A. Holbrook; 1st Vice-President, T. Wrigley; 2nd Vice-President, H. F. Smith; Secretary, L. M. Smith; Treasurer, L. N. Fisher; Directors, J. C. Taylor, J. G. Craig, J. K. Bates, R. B. Brown and R. Skinner.\n\nThe officers will be elected at the annual meeting on Saturday the 15th inst., at 1 o'clock p.m.\n\nRapid City Ripples.\n\nMr. D. A. Hopper has returned from Rapid City.\n\nPublic Notice.\n\nEllisboro Post Office.\n\nAt Ellisboro post office some beautiful hyacinths in full bloom may be seen, brought there by Mr. E. Johnson, a highly skilled gardener as some people imagine.\n\nEllisboro.\n\nQu'Appelle Progress.\nHoly Catholic Church.\n\nIts Continuity in England\n\nA Lecture Delivered by the Bishop of Tybetty, Jan. 24.\n\nThe subject upon which I am about to speak today is “The continuity of the Church in England.” I purposely say ‘the church’, because, speaking generally, if we desire to make known our church we must go back to a time long before they were strictly speaking ‘English or Anglicans’, but rather by that word we mean the state of what we now know as Denmark. Our mother country had been in our native land for a whole century before Hogiest landed at Bristol in 679 A.D., and about 949. The Christian church had been in the country at the very last three centuries before Edwin, King of Mercia, became its first bishop. The bishops of the British church were consecrated at the Council of Arles in 313 A.D., showing that even then existed the church in Britain in a distinctly organized form. But it would be impossible in the mere space of an hour to give even by name the earliest names in the history of the church extending over more than fifteen centuries, if we were free from the necessity of taking in all those whose beliefs have been very varied subjects of interest in connection with it. In these few centuries of English church history there may be traced not only the decay of the Romanized state, but also the growth of national influences; and, indeed, though there was no such thing as a nationality, yet as a race there was definitely an English character in the formation of the church, and their common consciousness of belonging to the same people was seen in the unity of their opinions. It must be remembered that at first there was a great deal of misunderstanding between their Mercian and Saxon families of the most ancient lingoistic varieties which have been preserved from the primitive stage of our civilization. This is my body, this is my blood. The cardinal error of the primitive Christians of Spain had been accurately to define doctrines, that he early church in times will not see the lingoistic variations which exist in the primitive churches.\n\nWe may go back farther still in the history of the church and see that its continuity was maintained throughout the centuries of Roman occupation. The Romano-British church continued after the fall of Rome. This is made plain by the preservation of many inscriptions, coins, and other relics connected with the primitive Christians of that period. These primitive Christians of the seventh and eighth centuries are not merely the ancestors of the later Anglo-Saxon church, but are quite different in their religious ideas and traditions. The Anglo-Saxons were a warrior race, and their religious ideas were influenced by their military life. They were also a kind of savage people, and their religious ideas were influenced by the customs and superstitions of the savage. The Roman influence was weak and fading, and the Anglo-Saxon church was able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence.\n\nWe must not forget that the Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence. The Roman influence was strong, but the Anglo-Saxon church was not able to maintain its own independence.\n\nWe see an entirely new order of service was adopted by the later imitators, for which there can be no excuse whatever. No one who speaks foreign languages can be made to believe that that which has ever been considered the highest act of prayer among the primitive Christians of the East, would have been considered simply as a change from the primitive, when made by the prayers of men of good intention. Now let us turn our attention to the particular matters of doctrine. For we must note that, while the faith of the church remains unaltered, the form of its church order is far from uniform throughout all its generations. We must therefore examine the various orders of service that have been current in the church. It is impossible to enumerate them all, but we may mention the following:—\n\n1. The Reformation Liturgy.\n\n2. The Church's Liturgy.\n\n3. The Liturgy of the Primitive Church.\n\n4. The Liturgy of the Anglo-Saxon Church.\n\n5. The Liturgy of the Roman Church.\n\nAs these orders of service are very frequently mistaken for matters of faith, and often the wars of the church are merely struggles between different parties, so the church order is frequently the subject of controversy. The church order should be regarded as a part of the doctrine of the church. It is impossible to say how much importance should be attached to it, but we must remember that it is the substance of our faith that is concerned. We must also keep in mind the fact that the church order is not the same in all countries, although the substance of our faith is the same everywhere.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of enforcing advance payment. We can make no profit by publishing a paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting accounts at a higher figure. Besides we thus at once secure a large circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLivery.\n\nDOOLITTLE'S LIVERY\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingle and Double Rigs for Hire.\nFREIGHTING A SPECIALTY\nALL KINDS OF COAL\nKept Constantly on Hand at the Lowest Prices.\nCash Paid for Hides & Skins\nQU'APPELLE.\n\nL.W. MULHOLLAND\nLIVERY,\nFeed and Sale Stable\nFor First Class Rigs.\nDaily Mail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has assembled the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bells, Blankets, Cingales, Glands and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\nAgent for Carriage & Buggy Tops\nREMEMBER THE PLACE.\nPioneer Harness Shop\nQU'APPELLE.\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nThomson & Nelson\nFORWARDERS.\nAND DEALERS IN\nLumber, Lath, Shingles\nDOORS, SASH\nBuilding Paper, etc.\nOffice West of C.P.R. Station.\nQU'APPELLE.\nBRANCH AT FORT QU'APPELLE.\n\nA. S. EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\nSUITS FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE TOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\nPROPRIETORS\n\nFURNITURE. FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSix Pages, Thirty Columns.\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\nA large proportion of this Company's Lands are in thickly settled Districts.\nFor information, Prices and Maps apply at the offices of the Company, Winnipeg, Edmonton, Red Deer, Calgary, Fort Macleod, Red Deer, Calgary, Fort Macleod, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary\nAGENT IN QU'APPELLE FOR LANDS AND BUILDINGS\nLESLEY ORDON,\n\nTHE BOOK & JOB PRINTING\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nA. HOLLINGSHEAD,\nPAINTER.\nHOUSE SIGN AND CARRIAGE PAINTING, GRANNING,\nGlazing, Paper hanging, Kalamazoo, &c.\nAll work neatly and promptly executed.\nOffice, Walsh St., Qu'Appelle.\n\nGRAND COLONIAL EXHIBITION\nIn London, England, 1858.\nFOURTY-FOUR THOUSAND FEET RESERVED FOR CANADA.\nFirst Royal Exhibition Commission—Sir W. Ewart.\nThe Colonial and Indian Exhibition to be held in London, England, commencing May 1st, 1858, is intended to be a great national event, and will be an object to mark an epoch in the relations of Great Britain and her Colonies, and of each other.\nIt will give becoming significance to the great Royal Commission as formed by Her Majesty Queen Victoria, and will be the first time since 1857, and the Royal Highnesses will attend it. Mr. Joseph Molyneux, President of His Majesty's Government, has promised 5,000 square feet which will be devoted to the Dominion of Canada. The Exhibition is to be purely Colonial and Indian, and no competition from the outside world will be permitted, the object being to exhibit the best productions of the Colonies.\nThe greatest opportunity ever offered to Canada is thus afforded to show the fine products of her soil and her resources. The progress she has made in manufactures, in literature, and the arts, is now being appreciated throughout the world. The manufacturers, artists, and inventors in Canada are anxious to display their vast resources in this great exhibition, and are doing so with much zeal, and also in Europe.\nThe members of the various classes are invited to come forward and visit the exhibition, as it will be a great source of pride and honour to Canada in her true place as a nation. We should not fail to see it, and establish her proper position before the world. Every farmer, every producer, and every citizen should visit it, as it is evident that Canada is having already demonstrated that she can produce anything she chooses to offer.\nBy order,\nJOHN LOWE,\nSec'y. of the Dept. of Agriculture.\nOntario, Sept. 18th, 1858.\n\nTHE MAIL.\nToronto, Ontario, Canada\n\nSPECIAL OFFER.\nTo all subscribers to THE QU'APPELLE PROGRESS who desire it we will furnish THE WEEKLY MAIL for one year for $2.00, or two years for $3.75; three years for $5.25 per year. An arrangement with the publishers enables us to do this. Take advantage of this chance.\n\nEVERY DESCRIPTION OF BOOK AND JOB PRINTING.\nExecuted at the office of\nThe Qu'Appelle Progress.\n\nTHIS IS YOUR OPPORTUNITY!\n\nDo you want a book? Do you want something to read? Do you want a book? You may have heard about the chance out of the blue. These books are published by the publishers of the Toronto Star. They are sold at a low price, and the publishers are willing to sell them at a low price. If you want a book, you can get one at a low price.\n\nTHE NOR-WEST FARMER AND MANITOBA MILLER.\nIs devoted to the interest and advancement of the farmers of the Northwest. It is a weekly publication, and contains all the news of the week, both home and foreign, and is delivered free to every subscriber. It is published by the Nor-West Farmer Printing Company, Ltd., Qu'Appelle, Saskatchewan.\n\nHELP ALONG OUR GOOD WORK\nBy sending in Your Subscription.\nOnly $1.00 Per Year\n\nFor every subscriber who subscribes before Feb. 1st, we will give free a copy of the latest number of THE WEEKLY MAIL, containing a book of 400 pages, filled full of useful information for the reader.\n\nWe invite the publication of all advertisements, and are willing to pay a reasonable rate for such advertisements.\n\nThe Nor-West Farmer Printing Co., Ltd.,\nQu'Appelle, Saskatchewan.\n\nTHE WEEKLY MAIL.\nPublished by the Nor-West Farmer Printing Co., Ltd., Qu'Appelle, Saskatchewan.\nCONSUMPTION CURED.\nAn old physician, retired from practice,\nhaving had placed in his hands by an East Indian missionary the formula which had\nworked so well in India, and prevent-\ning cure of Consumption, Bronchitis, Ca-\nstanea, rheumatism, consumed limbs,\ntoothache, also a positive and radical cure for\nNervous debility and all Servant Complaints,\nalso for the consumption of children and\nwidows in thorns of cases, has felt it his\nduty to bring it kindness in his suffering fol-\nlowers. As every case cannot be handled to\nrelieve human suffering I will send free\nof charge, a booklet on the subject, my\nname in German, French and English, the ful-\nfilling our preparations for sending and using. Sent by\nmail by adding 5 cents postage, running this paper.\nW. A. STEINER (Poveshelle, Ont.).\n\nEngagements in England.\nEnglish girls marry before many have\nthe opportunity to visit that country at\nthe age of thirty. A marriage in England is\nnot considered marriage; \"a young man of\nabout twenty-five who becomes engaged to a lady of say 18, and the lady remain\nthus engaged for three or even five\nyears. During the engagement the\ngirl lives with the girl's parents, she has\none life without any of its troubles, and she is under the constant control of\nher best to make the engagement last\nas long as possible. The parents may\nmanufacture more love for her to habitual\nuse and make the months of delay seem\nno worse. The cultivated cottage where the\nprostitute sojourns is cool and homely\nand cool. On the day she leaves she\ndoes not expect to be there again. So\nthere is nothing but work and\nbusiness that keeps the poor woman\nin England for years. She does not\npretend to be lonely because she\nknows business keeps her occupied.\nHer husband's business is done for her. She\ndoes nothing for herself except work.\nWhen her husband dies an English\nwoman loses her husband and becomes a\nwidow. If she is unfortunate she\nbecomes a governess, housekeeper, or a\nmaid servant. When she is good\nshe gets a nice position as a governess\nor a housekeeper, but when she is\nglutton, she gets her husband's place\nwith the same wages and the same\njob. When she becomes a\nwidow she gets no pension but her hus-\nband's estate goes to others than the\nwidow. She must take care of\nherself and her child. If she chooses\nto send them away she must choose\nthe best school for the child.\n\nNOTICE.\nNotice is hereby given that an application will be made before\nthe North West Central Rail-\nway Company, the Canadian Pacific\nRailway Company, the Ottawa\nLachine Railroad Company, the\nGovernment of Canada, for an Act to incorporate the \"North West Central Railway Co., Ltd.,\" having such\npower and authority as a private railway\ncompany, to build a railroad in the\nProvince of Ontario and the Province\nof Quebec, and to sell and dispose of\nall property in case of insolvency,\nfor such purpose.\nT. J. McLELLAN, Esq.,\nPresident of the N.W.C.R.G.,\nToronto, Oct. 26th, 1883.\n\nNOTICE.\nThe following applications for Liquor Licenses are on file:\n1. To Mr. R. A. Tinney, of Coldwater, Ontario, for a License to dispense liquor at his residence.\n2. To Mr. J. M. Richardson, of Smithville, Ontario, for a License to dispense liquor at his residence.\n3. To Mr. T. F. Smith, of Oro-Medonte, Ontario, for a License to dispense liquor at his residence.\n\nC. COTTINGHAM\nHarness,\nBoots and Shoes,\nRapid City.\n\nHow to Make a Cup of Coffee.\nExcellent Coffee\nAt a Moment's Notice Anywhere.\nLyman's Concentrated\nExtract of Coffee.\nPrepared by a New Patent Process.\nfrom\nCHOICE SELECTED COFFEE\nFreshly roasted and ground expressly\nfor the use of this patent process.\nSIGNIFICANT FLAVOR AND BODY.\nFOR SALE BY GROCERS & DRUGGISTS.\nFull directions with each bottle.\n\nWYANDOTTE COUNTY, KANSAS.\n\nNotice to Contractors.\nStalled tenders addressed to the\nBoard of Supervisors of Wyandotte\nCounty, Kansas, will be accepted until\nMonday, May 29th, 1884. All matters\nshould be delivered by mail at the\nCity Hall. No additional entries will\nbe accepted after Monday, May 29th.\n**Home & Gossip**\n\n**Qu'Appelle**\n\n- Sunday is St. Valentine's day.\n- See McMillan Bros. advertisement.\n- Council met Saturday last; minutes next week.\n\nAdvertisement at Tur Jackson's office is the printing business.\n\n- Bring your No. 1 hard wheat to Qu'Appelle and get 75 cents per bushel for it.\n\n- The weather past week has been very mild. The snow is nearly all gone and the sledding is bad.\n\nIn His Honor, the Lieutenant-Governor, has appointed Mr. W S Redpath an inspector of marriage licences for the North-West provinces.\n\n- Messrs. McMillan Bros. are determined to beat Qu'Appelle in their \"No. 2 Hard Tobacco\" stakes set up for the best wheel maker in the Northwest. They are even giving better than Winningham made \"good old tobacco\".\n\n- Winnifred Watson, Mfg. Co., A. Holiday, Inc., Rogers, Winnipeg, H. L. Elliott, Inc., Jas. J. Hurd, Jap. Gibbon. Bud Appleyard advertised at the Elahad House this week.\n\n- On Saturday last Pastors Van duft and Pierre Vachal, two well known French Preachers from France, came here by way of Edmonton. They had been under a long sentence at a montain air, but were paroled and released.\n\n- The Carnaval\n\nMasters Johnson, Mrs. Garrett, Place, Henry, Braden and several others attended Carnaval this season last Saturday evening and had made the most of the occasion. Everybody enjoyed themselves. A new feature was the appearance among the fiddlers, notably among those following:\n\n- Masters, Snowshoe,\n- Mrs. Boadie, Snowshoe.\n- Mr. R. S. Alexander, King of the event.\n- Mr. S. Alexander, Queen of lovers.\n- Masters, Edwap, 2nd, The Queen of cunning.\n- Mr. V. Lucas, Danny Jim, The King of residence.\n- Mrs. Less, La Princesse de Reguneet, The Queen of residence.\n- Messrs. Duclos, Olimick, Minervin & Co., The Riders.\n- Messrs. Bob Brown, cowboy or Rossoro, Shine.\n\nIn Our Honor, William, Wilson, the delegation appeared by the afternoon train and on their way back to Ottawa had visited the sites of the former polemicists of the Ottawa district.\n\n- We this week gives the first half of the lecture before members of the Englic Church. Tuesday at 4 p.m. at the Bishop of Qu'Appelle, he will start the second half of his lecture on the Catholic Church.\n\nOn Saturday morning last the Institutes of Faith and Charity signs of being too wet fell, and when passing the Puooshiosk office were greeted by rain again which seemed to be comfortable for the passengers. The town hall on Saturday near the Methodist church, a sleigh was speaking out loud on the sidewalks and lounging. The horses ran into a blind spot by the and their run was prematurely ended vice. No damage was done.\n\n**Mr. Lewis G. Irvine gave the following for publication. — Wednesday Mr. Irvine having experienced a loss by having smothered what the last season park find the fir trees a Montgomery goddess. Any who may be there used again lose and indelible 11b. of sulphate of copper to each bushel of grain, and dip your seed grain in the pickle the night before sowing. One pound of the solution is sufficient for four bushels of wheat.\n\nAt Qu'Appelle, morning, a Council of the Royal Temple of Holy Wisdom was organized by the following members: Mr. T. Lucas, Mrs. Lewis, Mrs. G. Nimזמ, Vice-President Mrs. Oliver, M. H. Bantam, Secretary Mrs. Oliver, Mr. Lamar. All members are requested to attend and meet this week another meeting at the Royal Temple of Holy Wisdom.\n\nIt is now considered essential for every student of theology to make the acquaintance of the Catholic Church, by reading the book of its Mysteries, and learning the name of its Founder, the Holy Roman Catholic Church.\n\nTHE CRADLE.\n\nOn Sep. 19, Tp. 18, R. 16, on the 28th inst. Mrs. John Ewing, of this village, gave birth to a child.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886021201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8810, "total-output-tokens": 6048, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3177, 1], [3177, 8698, 2], [8698, 12612, 3], [12612, 16295, 4], [16295, 20312, 5], [20312, 24033, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]