[{"id": "54a10ee62c9348695ffb8d25521414425a0764ba", "text": "School District of Westfield,\nProtestant Public School District,\nNo. 35, of the N.W. Territories.\n\nNOTICE is hereby given, that a sale will be held of all lands of the said school district at the store of the Farmers' Store, No. 37, Townships Range 9 on\n\nWednesday March 21st, 1886.\nFor the purpose of raising funds for the proposed action of the school district, the said lands in said district will be sold under the old system, with a per acre purchase price of five hundred and fifty cents cash, or seven and three quarters cents per acre mortgage. The purchaser pays to each owner, twenty-five cents per acre mortgage, which becomes due at the end of thirty days from the date of sale. All purchases must be made in whole acres only, each purchaser may pay by money or notes from ten to one hundred dollars, in such cases only, may the purchasers take credit at the rate of five per cent. interest per annum, subject to the same conditions as established in other conveyances.\n\nTeachers wanted,\n\nFor Mount Pleasant School, Elder Division, commencing April 1st next. Salary to commence April 1st payable in full before the commencement of duty.\n\nTeacher Wanted,\n\nFor Southfield School, Elders Division, commencing April 1st. Salary to commence April 1st payable in full before the commencement of duty.\n\nNotice,\n\nA meeting of the改良よう会 will be held at the改良よう会 parlor.\nOn the 16th day of the改良よう会, at the改良よう会 parlor, will be stated the改良よう会 examination Schedule.\n\npoplar grove,\n\nProtestant Public School District No. 34, of the N.W. Territories.\n\nNOTICE,\n\nTo all who desire to vote in the N.W. Territories the following election will take place:\n\nElections to be held in the townships of Pymont and Robson on Saturday, April 3rd, 1886.\n\nTenders,\n\nTo builders and others in the N.W. Territories, for contract work, tenders will be received until Thursday, April 2nd, 1886.\n\nPerfilant's Progress,\n\nQu'Appelle Station, March 19th, 1886.\n\nTHE C.P.R. AS A MILITARY ROUTE.\n\nMr. T. J. Layne, Sir William Harcourt's deputy in the Whetzel Proclamation of International Law as applied to Canal Construction has stated that \"in a recent edition of his essays on Suez Disputed Questions and Modern Importance of the Suez Canal we find a chapter devoted to the Suez Canal where the advantages over the Suez Canal that the C.P.R. would have to offer are very clearly set forth.\" It is these advantages which will result from the completion of the C.P.R., being far superior to those offered by the Suez Canal itself.\n\nEight special meetings of the Legislative Assembly will be held in the following manner:\n\nSATURDAY, APRIL 3RD, 1886.\n\nFor the purpose of taking a vote on the new Constitution of the Board of Trustees of the Poplar Grove College, and also for the purpose of adopting a new System of Education for the township of Poplar Grove, if the votes cast prove the majority of the members present in favor of a motion made by the Hon. Mr. Fisher.\n\nThe votes will be counted and the result announced at the next meeting of the Board of Trustees to be held on Tuesday, April 6, 1886.\n\nNo person shall be permitted to vote unless they are of legal voting age.\n\nEach voter must, in addition to the signature of the proper elector, be signed by two or more of their neighbors.\n\nIf the McKeown Agreement is approved, then no changes shall be made to the existing school law.\n\nIf the Fisher Agreement is approved, then the existing school law shall remain unchanged.\n\nThe new school law shall become effective immediately upon adoption.\n\nBATTLEFORD.\n\nThe term \"Battleford\" refers to the Battle of Fish Creek, which took place on January 25th, 1885, between the Red River Métis and the Canadian government.\n\nGeneral Georges Viger led the Canadian troops against the Métis leader Louis Riel. The battle resulted in a Canadian victory.\n\nArtillery General Gagur has been appointed by military commandant Leslie Fielding to lead the Canadian forces.\nNOTES AND COMMENTS.\n\nThe Winnipeg daily Sun is shortly to be revived by a combination of the leading citizens of the city who will be a member, and will contribute to the columns of the paper. Mr. T. H. Preston, the former manager of the Sun, will be the manager of the new paper, and will be assisted by Mr. Clarke Wallace, who has been the owner of the paper for many years. The new Sun is as honest and straightforward as it was, though our opinions differ from it, we wish it success.\n\nThe Violette (whom we notice in our further) \"Oh! We have asked Violette to notice us further.\" We have not asked Violette to notice us further. As to its calling upon us to disprove the charges made by Mr. Jackson, that is a very singular mode of procedure. Violette does not know what the good old British law is for the accused to prove the charges he makes. Both Mr. Jackson and the Violette have failed to do so. It is admitted that the Government will be sustained in its action against Mr. Jackson from 20 to 80, being largely dependent on Mr. Blake's courage. The Minister of Justice, Mr. Blake, has stated that the total revenue for the past fiscal year, $6,439,683, spirits and malt combined, $17,450,000.\n\nSir George Stephen and others have been appointed members of the Board of Invention for the St. Lawrence and Atlantic Junction Railway, Sir George Stephen being here at present.\n\nIt is now expected the discussion on the question will be confined to the French members, and afterwards the matter will be reconsidered by the Liberals in another shape.\n\nThe number of land warrants issued to volunteers is 5,000. There are about 100 members of the committee.\n\nMr. Macdonald, Mr. P.A., with C.S. Drummond and Mr. McCallum, interviewed Hon. Thomas White, who informed them that the Canadian Government of Montana, the lowest tenure for the land in the province, is the possibility of securing it looking for premises here for a big preliminary settlement.\n\nMr. Beatty, of the Northwest Central claims to have made all the necessary arrangements for the work so soon as the necessary legislation is obtained.\n\nMr. Surtees introduced a bill to amend the Dominion Elections Act so as to extend the hours of polling so far as cities are concerned.\n\nMr. Hector Langevin said that he had heard a letter from French Canada stating that the government was making enquiries for the fullest particulars of the enterprise, stating that if the proposal were approved they would supply all necessary capital. Mr. Surtees has the letter and will take it to Paris to-day and will visit Paris before he returns.\n\nMr. Hector Langevin said there is any truth whatever in his rumoured resignation, the report of which has been published in the newspapers on his part some time ago to retire from the House. At that time he wished to sever his connection with the police, but shortly afterwards he wished to remain connected with the police and could not retire then, and since that time matters had not reached that state that he could with honour withdraw from the force.\n\nAdvice from Quebec state that before Equinunk Point to Blanc Sablon the people are starving. They killed in January 500,000 fish, but have not been able to save lives. Late last November a ship was sent from Newfoundland with provisions, but when it arrived a great storm was had and never heard of. The Bishop of Edmundston has written saying that the people are starving. He says that provisions have been sent him as soon as navigation opens, as there is nothing to starvation there. As a result, many families are begging for food, and there are no signs of giving them. Mr. Edmundston's message more than likely to be had. The people are in a starving condition.\n\nMontreal, March 11—The largest fire in Montreal for a long time destroyed a large portion of the business district following the burning of the following firms: Sams & Loring, E. Lee Chesterfield, Park Bros Co., J. W. Smith & Sons, Westmoreland, manufacturers agents of New York, Rockland State Co., the Chateau, J. A. Smith & Co., J. A. Smith & Co., P. M. Gordon's store, Compagnie Centrale de Nouvelle-Orléans, wholesale dealers in liquors and groceries, and E. R. Co. & Co. (wholesale grocers). The aggregate loss was $20,000. One fireman is missing.\n\nIf you want a Sewing Machine, Organ or Piano, consult\n\nJames Weidman, Agent.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every dollar paid out is paid for, than if we took the risk of collecting accounts at a higher figure. Besides we will thus speedily secure a larger circulation, which will enable us to give more space to advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLiberties,\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable, QU'APPELLE ST.\n\nSingle and Double Horses for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\n\nat all times on hand at the lowest prices.\n\nCash Paid for Hides & Skins QU'APPELLE.\n\nL. W. MULHOLLAND\n\nLIVERY,\n\nFeed and Sale Stable For First Class Rigs.\n\nDaily Mail Stage to Fort Qu'Appelle.\n\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has now in stock the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bells, Blankets, Cringles, Combs and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\n\nAgent for Carriage & Baggy Tops.\n\nREMEMBER THE PLACE\n\nPioneer Harness Shop QU'APPELLE.\n\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON\n\nFORWARDERS,\n\nAND DEALERS IN Lumber, Lath, Shingles DOORS, ASH Building Paper, etc.\n\nOffice West of C.P.R. Station.\n\nQU'APPELLE.\n\nBRANCH AT FORT QU'APPELLE.\n\nA. S EMPEY,\n\nDEALER IN GENERAL MERCHANDISE,\n\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\n\nAND DEALER IN Flour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\n\nSPECIAL PRICES ON WHOLESALE LOTS.\n\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION.\n\nLove & Raymond,\n\nPROPRIETORS.\n\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout.\n\nSUITES FOR FAMILIES.\n\nTERMS MODERATE.\n\nS. H. CASWELL,\n\nGENERAL STORE,\n\nBANK,\n\nPOST OFFICE,\n\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n\n(LIMITED)\n\nOffer for Sale\n\nSELECTED FARM LANDS\n\nIn Manitoba and the North-West Territories,\n\nNear the Canadian Pacific Railway Main Line\n\nA large proportion of the Company's Lands is in thickly settled Districts.\n\nFor information, Prices and Maps apply at the offices of the Company, 14 Castle Street, Edinburgh, Scotland; 75 Lombard Street, London, England; 132 Main Street, Winnipeg, Manitoba.\n\nW. B. SCARTH\n\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nTHE PACIFIC TRUSTEES OFFER FOR SALE\n\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\n\nLESLEY GORDON.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\n\nGents', Furnishings, Boots & Shoes,\n\nFURS OF ALL KINDS\n\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\n\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nOF THE TOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON\n\nPROPRIETORS\n\nFURNITURE, FURNITURE,\n\nHAVING LATELY SECURED\n\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\n\nAT PRICES THAT DEFY COMPETITION.\n\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\n\nIS PUBLISHED\n\nEvery Friday Morning,\n\nAT THE OFFICE QU'APPELLE STATION.\n\nSIX PAGES. THIRTY COLUMNS\n\nSubscription $1.00 a Year Invariably in Advance.\n\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing DEPARTMENT\n\nEXECUTES Every Description of Printing\n\nNEATLY, CHEAPLY & QUICKLY.\nTHE INTERIOR.\n\nSynopsis of Annual report.\n\nOttawa, March 8.—The Minister of Interior has laid before the Department on the table this afternoon. It consists of five parts. The first part relates to land surveys; the second to boundary land surveys; the third to the geological survey; the fourth to the census; and the fifth to the report of the Northwest Half-Breed Commission.\n\n\"STAKED CLAMS.\"\n\nThe first part of the Land Commissioner's report deals with the subject of staked claims. The staked claims are claims for land which stand in need of interpretation under the half-breed settlement Manitoba Act of 1870. A very large number of such half-breed claims have been staked along the Red, Salle and Seine rivers in July 1870 by planting two posts on the bank of each river at intervals of about 200 feet along the river, one post for each limit. These became known as \"staked claims,\" and were first formally mentioned in the existence of these claims, which are on file in the Department, was the meeting of the Council of Assiniboia at St. Norbert in February, 1873. At that meeting a delegation was appointed to go to Ottawa. They then went to Governor-General, Sir James Macdonald, to learn from him the intentions of the Government regarding them. He said he would hold out no encouragement that the Government would make any arrangement to settle the claims under the provisions of the Manitoba Act, but would write to the Department. His Excellency referred to the Hon. Mr. Denison, who had been appointed Minister of Justice, and said that such claims could not be settled.\n\nIn March, 1874, Mr. Denison had been referred to Mr. Frobisher, as Minister of Finance, advising the Government that the Interior not to initiate any legislation with regard to staked claims, but that they should be dealt with case by case on its merits. Another delegation was sent away, and in April, 1875, another delegation was sent to see Mr. Denison, who had been appointed Minister of Justice, and said that such claims could not be considered as claims under the Manitoba Act. Mr. Denison surveyed or occupied, being merely marked up by posts, prior to the 15th July, 1876, were not entitled to be treated as claims under the Act.\n\nOn the 24th October, 1877, the Minister of the Interior sent a letter to the agent of Dominion Lands, stating the instructions for his guidance in dealing with those staked claims. In December, 1877, Mr. Frobisher wrote to Hon. Mr. Pollock, strongly urging that these claims should be dealt with under the provisions of the Manitoba Act. In April, 1878, the agent of Dominion Lands wrote to Mr. Frobisher regarding these claims and in reply he was informed on the 7th June, 1878, that the claims had been surveyed and set aside to look into them. The subject engaged the attention of the new minister, Mr. Frobisher, and cases have been disposed of but a few months ago. Great interest is now shown in settling the Manitoba half-breed supplementary claims, so much so that there have been issued only partly publishing claims all that no further claims of this kind will be entertained after the 1st May next.\n\nCANCELLATION OF HOMESTEADS.\n\nAs regards cancellations of homesteads, there are 190 applications, which good work has been done. The Deputy Minister says: \"No entry has been cancelled by the Land Board until after a full examination of the report by an officer of the department. To the honorable settler the cancellation of his claim is a great loss, and is invariably extended. It is of course impossible for the department to do anything less than the complete fulfillment of the duties prescribed by law. If the claimant does not patent, although it seems to be difficult to get settlers to understand that the patent is not a right, but is a condition to offer them the necessary means of support. Referring to the general condition of the country the Land Commissioner says:\n\n\"The depression which commenced four years ago, and continued in a most injurious way, which was rendered more painful by the failure of crops in certain districts during the same three years, is rapidly disappearing.\n\n\"The condition of the settler is better today than it was last year, and the cause of the disappointment which followed the collapse of the excitement attending the opening of the Canadian Pacific Railway has given place to an improved feeling and a greater confidence in the future. The outlook is promising for the economical and energetic operations of agriculture.\n\n\"The present state of the country is such that the production of cereals has been abandoned, and throughout the country is observable a tendency toward the raising of cattle. Further attention paid to horses, sheep, swine, and poultry will be required, in the case of many farms, to meet the requirements of the market, and the circumstances carefully attended to.\n\n\"The railway traffic developed over the Canadian Pacific Railway, the effect will be to compel the farmers to produce for the market in the vicinity of the railway stations, where their position was one of comparative security. They will need to be prepared immediately upon the opening of the great highways of commerce.\n\nThe advantages resulting to them from discharged patent obligations, and the increased value of the condition of the settlers—at least so far as the province is concerned—will be realized when the extension of the Manitoba Southwestern and Manitoba Northwestern Railways is completed.\n\nThe generally improved condition of the whole country strengthens me in the opinion that a new era of prosperity is before us.\n\nSURVEY.\n\nThe survey of the north-west was continued this year though on a limited scale compared with previous years, only 291,680 acres being surveyed. The large number of entries covered by the present time would give 418,847 families the opportunity of owning homes for as many families, which at five persons to a family would be 2,094,235 persons.\n\nFANCY GOODS, TOYS, JEWELRY, AND BEAD WORK.\n\nThe receipts on account of these during the year amounted to $841,358, of which $21,614,325 feet; $46,446,041, and $8,285,253. The latter two items were made possible by selling lands other than patented. Hard and soft coal were sold, amounting to $120,012, a decrease of $12,000 from the previous year. The falling off is marked, but the Deputy Minister says: \"The past six months of the present year show a decided tendency to improve.\"\n\nTHE PROGRESS Book and Stationery Store now open.\n\nLyman's Fluid Coffee\n\nNO COFFEE POT NEEDED.\n\nCan be made in Ten Seconds, in a China cup, or in a teapot, or anything that will hold hot water.\n\nEconomical! Convenient!\n\nNourishing!\n\nFor sale by Grocer and Drug Stores.\n\nPaulm Bette (make 100 cups) $1.00.\n\nHalf-pint Bette (make 50 cups) 50 cents.\n\nQuarter-pound bette (make 25 cups) 25 cents.\n\nOnly $1.00 for Ten Pounds for one year. Six pounds thirty cents.\n\nMore reading for less money than any other paper in the Northwest.\n\nA. HOLLINGSHEAD,\n\nPAINTER.\n\nHOUSE SIGN AND CARRIAGE PAINTING, GRAVITING.\n\nGlazing, Paper Hanging, Kiln Cleaning, etc.\n\nAll work neatly and promptly executed.\n\nOffices, Walsh St., Qu'Appelle.\n\nRussell & Davis,\n\nWholesale and Retail Dealers in\n\nBEEF, POEK, MUTTON, SAUSAGE, HAMS, BACON, ETC.\n\nBeef Cattle & Hogs\n\nALWAYS ON HAND.\n\nTerms Strictly Cash\n\nQU'APPELLE STATION.\n\nBRANCH—PT. QU'APPELLE.\n\nStove and Tin Depot.\n\nE. WISMER\n\nWhile purchasing tinware the customer should be sure to get a large size of Stoves and Tinware.\n\nMy Stoves are from the best manufacturers, and were selected to meet the requirements of the customer.\n\nQU'APPELLE STATION.\n\nLansdowne Hall\n\nQU'APPELLE\n\nBillard & Pool Tables.\n\nH. J. EDWARDS\n\nCarpenter.\n\nJ. B. ROBINSON\n\nContractor, Builder, ETC., ETC.\n\nQU'APPELLE.\n\nAll week in my Line will Receive Carroll Allerton.\n\nThe Nor-West Farmer\n\nWants Manitoba\n\nTo Field a Greater Return to the Farmer.\n\nWe are doing our best to bring about the prosperity of the farmer, and we urge every man to help in this great movement.\n\nThe Nor-West Farmer\n\nAND MANITOBA MILLER.\n\nIn seeking the interest and advancement of agriculturists on the prairies of Canada, we have found that the best means of information, facts and practical experiences are obtained through the medium of farming in all its branches. It is for this reason that we have endeavored to secure men of the country, while his Household and Family are well provided for, and his farm, makes it a most interesting occupation for him.\n\nHELP ALONG OUR GOOD WORK\n\nBy sending in Your Subscription.\n\nOnly $1.00 per Year\n\nTo everyone who subscribes before Feb. 1st, we will give free a copy of the great book entitled, \"Home and Health,\" containing valuable information, practical advice and interesting illustrations.\n\nWe are indebted to the publishers of the above great periodical for the privilege of using their name and title, makes it a most interesting occupation for him.\n\nHELP ALONG OUR GOOD WORK\n\nBy sending in Your Subscription.\n\nOnly $1.00 per Year\nHOME & GOSSIP.\n\nQUAPPILLE.\n\nAUDITOR'S SCHOOL REPORT.\n\n—Below we give the auditors report of the financial affairs of the Qu'Appelle School.\n\n—Mr. J. M. White, the Bishop of Qu'Appelle has decided to hold his annual school at the Fort. He will, however, probably start a Girls' School here.\n\n—On Wednesday evening last (St. Patrick's day) Father Thomas O'Connell conducted an excellent entertainment to a crowded house. The program was long and varied, and was performed with much credit to the Club. Time and space forbid further reference.\n\n—The building of the church of St. Peter's Roman Catholic, recently commenced in the spring if sufficient funds can be collected. About one third of the required sum has already subscribed and it is hoped friends will come forward and complete the list so as to cause no delay.\n\n—The episcopal chair (a present from the king in England), which has been made by Mr. Thos. Miller, has been placed in the new church. It requires a few finishing touches in the way of painting the shield, etc., but Mr. Miller says he does him very great credit and when completed the chair will be a very fine specimen of Northwest work.\n\n—In the immigrant building this (Thursday evening, Messrs. Dahn and Millar will give a grand entertainment consisting of songs, dances, and instrumental music. Messrs. Dahn and Millar have given an exhibition of their skill on Wednesday evening at Mr. Parrott's entertainment, and made a very favorable impression which augurs well for their success this evening.\n\nTo the Editor:\n\nSir,—Permit me to remark with regret that the parishioners have lost some of the best services by the thanks of B Battery to the congregation of St. Peter's church for a supply of money which was given by members of the St. Peter's congregation in the town, for the purchase of a horse and cart, etc., for the use of the troop which were late sent over last spring.\n\nYours sincerely,\n\nA Batterman.\n\nTO THE EDITOR:\n\nSir,—In reference to a paragraph which appeared in your last issue, about the purchase of a horse and cart on behalf of a number of my fellow men with whom I am connected, I am unable to say anything above the above, which we never received. As we are well able to purchase our own necessities.\n\nYours sincerely,\n\nA Batterman.\n\nPRINCE ALBERT'S GRAIN.\n\nFor the last five days the streets in town have had a lively appearance owing to the number of teams and wagons arriving from Prince Albert. The grain is being delivered to the Government seed grain for distribution in the settlement in that district. The grain is being charged of the distribution of freight here. Messrs. Oder, of this place, and E. McMillan & Co., of Regina, are doing everything in working order and as fast as the teams came each one was loaded and started back to Prince Albert. It is generally said that the work was smoothly and promptly matters were managed when it is stated that the work was not as smooth as it could have been. Messrs. Oder, of this place, and Mr. McMillan started for Prince Albert on Tuesday, returning on Thursday.\n\nEDMONTON.\n\nFrom the Bulletin.\n\n—Seed oats are selling at 70 cents to $1.\n\n—The assessment of the Edmonton Co. amounts to about $125,000.\n\n—The police prisoners committed in Edmonton on Wednesday morning with five teams and an escort under inspector Snyder. The team and escort were shortly joined by Miss May, who overtook them near the house over the prisoners to an outfit from Calgary. She returned with 25 men who have been sent from Regina to reinforce this post.\n\nWHY SOME FARMERS DO NOT SUCCEED.\n\nThey are not active and industrious. They are slothful in everything. They do not keep up with improvements. They are wedded to old methods. They are too conservative. They think small things not important. They take no pleasure in the work they regard labor as a drudgery. They neglect their crops. They are wasteful and improvident. They let their gates sag and fall down. They will not make compost. They fail to lay grass or straw around their fences. They turn up the soil in most cases, cheese and butter and increasing prices. They have no stock for stock. They have no sheep or swine. They hang their harness in the dust. They put off greasing the wares. They starve the calf and milk the cow. They don't know the value of the land. They breed to and from scrub. They have no method or system. They have no organization or enterprise. They are not good in a new thing. They never use paint on the farm. They keep the barnyard with a rod. They have no time to do things worth while. They do not read the best books and newspapers. They have no time to attend to whisky and tobacco than in a subscription for a good weekly paper. They think the buyer of a successful neighbour's stock at good prices is buying a \"cheap\" lot very \"likely\" Canadian Breeder.\n\nQu'Appelle Roller Mills.\n\nWe beg to announce that our Roller Mills at Qu'Appelle Station, are now in operation, and that we are prepared to supply the Farmers of the Municipality of Qu'Appelle, with Flour, Bran and Shorts, in exchange for Wheat on the most liberal terms.\n\nWe are also prepared to Crop Barley and Oats for Feed.\n\nWe will pay the following prices when delivered at Mill: No. 1 Hard 75 cents, No. 2 Hard 70 cents, No. 1 Northern 70 cents, No. 2 Northern 65 cents. These prices are higher than the prices paid on any other market in Manitoba or the North West Territories.\n\nTHE PROGRESS Book and Stationery Store now open.\n\nIf U want a Sewing Machine, Organ or Piano, consult\n\nJAMES WEIDMAN, Agent.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886031901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 6543, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3935, 1], [3935, 8293, 2], [8293, 12221, 3], [12221, 21230, 4], [21230, 21230, 5], [21230, 26782, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]