[{"id": "6bd369994239927e61e0551ccc70fdd907f0fe68", "text": "Qu’Appelle Progress.\n\n**School District of Westfield**\n\n### TENDERS\n\nTo lodgers and others in the Northern Ter-\n\n### NOTICE\n\n**School District of Poplar Grove**\n\nSaturday, April 13th\n\n### MR. PERLEY’S SPEECH\n\nADRPHAN Recruiting Committee\n\n### LIME\n\n**South Quappelle Agricultural Society**\n\nSpring Stock Show\n\n### NOTICE\n\n**Mount Pleasant School District No. 30**\n\n### NOTICE\n\nPublic Notice\n\n**School District of Westfield**\nTHE MAILS NORTH\n\nWe referred last week to the question of the change proposed by the Reginal Mail route by taking a view therefrom of the C. P. R., i. e., Prince Albert. We compared the distances between Regina and Prince Albert and Qu'Appelle and Prince Albert, and found the cost of carrying mail by other routes.\n\nWe showed that the difference in distance was only four miles at most, and that the cost would be greater from Regina than from Qu'Appelle. Would there not then be a change proposed at present? It seems very clear, except that the people of Regina are desirous of bringing grist to their own mill. The circumstances are not so powerful in this regard as they are in the trans-missouri route. There are settlements along the present route for at least one hundred miles that would require an independent mail service of its proper character-are affected thereby far past the point that post office beyond. The leader is now in its fourth year and I defy any one to find a single sensation conjuring up more mail business for any one along any of the branches of which have been brought in, particularly with the telegraph route. They could not have more vuolence. They would naturally infer from your article that you are assaill ague, latterly, as to duplicate service over this route.\n\nI express some doubt whether Mr. Davis expressed the opinions advanced in his letter, as he wrote previously to the date of publication of our paper. If he wrote to it in order to get something for his service, or the great importance of the matter, for which he got nothing. Mr. Davis expressed himself very clearly when he asked for the magazine.\n\nThe Leader states that the Levisa Service is the mail boxes being handled by the people of Qu'Appelle that can have no complaints about handling the mails. Everything was done promptly and in proper order; the accommodation hoped for is sufficient for both ends without any reference at all doing the same thing being dealt with. The Prince Albert business men are exposed to many charges, and like their Council members who are badly handled.\n\nPrince Albert March 25th.\n\n\"Somebody\" said saying that \"services\" given by farmers and towns should be better attended for these purposes.\n\nPrince Albert March 26th.\n\nI have seen reports of this\n\n---\n\nOttawa, March 18.—Yesterday Mr. Blake objected to proceeding thus. He objected to proceed with the Land sale motion on the grounds that the motion showed the Secretary of the Government with approval on the Ministry of Governmental affairs moving discussing matters with the French members? \n\nI believe that the fact that a newspaper school doing free Government printing might meet needs as the government itself does not exist. Also, this it is intended to think it, as for nothing straightforward or honest can be expected from it. From this account, though this has been heard of no major amount of new bills, they have been resisted by such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome. At each meeting, it has been heard, that it is intended to increase. It is also stated that the company's claims have been increased to meet the situation. It is believed that the Canadian Company will be unable to overcome such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome such opportunity of illustrating their real value, that it is believed that the Canadian Company will be unable to overcome\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of encouraging advance payment. We can much better afford to pay a paper at this price when we know that every paper going out is paid for than if we took the chances of collecting accounts at a higher figure. Besides we will thus specify secure a larger circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nA. S. EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\n\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout\nSuits for Families. Terms Moderate.\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\nA large proportion of this Company's Lands is in thickly settled Districts.\nFor information, Prices and Maps, apply at the offices of the Company, 10 Castle Street,\nEdinburgh, Scotland; 75 Lombard Street, London, England; 101 Main Street, Winnipeg,\nManitoba.\n\nW. B. SCARTH\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway\nBetween Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPELLE FOR LANDS AND HOUSES.\nLESLIE GORDON.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON\nPROPRIETORS\n\nFURNITURE, FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSIX PAGES, THIRTY COLUMNS\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nRapid City Ripples.\n\nPRESENTATION.\n\nOn the evening of the 3rd inst., the trustees of Rapid City Mission presented Mr. Pinard, methodist minister and parishioner, with a beautiful silver pectoral accompanied with a very encouraging address, which was replied to in suitable words by Mr. Pinard's host and thankfulness. A very pleasant evening was spent in music, address, joking, etc., preceded by the guardianship of Mr. Geo. Huston, steward of the apportionment and recording steward of the circuit.\n\nCONSUMPTION CURED.\n\nAn old physician, retired from practice, having been placed in his hands by a friend, made several experiments on powders. A vegetable remedy for the speedy and certain cure of Consumption was found. A leaf was used to make a decoction, which cured many cases. It may be used as a substitute for the French or English cure, with advantage. The use of the leaves has already been tried, but the results have been good. It is recommended with advantage at this juncture.\n\nSATTLEFORD.\n\nMr. Easie, formerly Indian Agent at Fort Macleod, went to the agency at Biggar, Manitoba. His numerous friends will regret his departure from this place.\n\nA day patrol of police examines the animals of all straggling Indians and squaws found about town, and gives them their passes without the necessary document of option of returning to the reserve or leaving the back-pan. They always prefer to go together.\n\nTOUCHWOOD.\n\nTO THE EDITOR:\n\nSir)—In a paragraph which appeared this morning in the paper you expressed yourself freely on the improvement in Touchwood. We thought this was a very unnecessary step for you to take, as you are right in calling on the day school at our signal on Moderator's recommendation is canonical and the establishment of a Sunday school pleasing to all who are interested in the education and proper upbringing of the children. We think also that you are mistaken in your statement that this gentleman and other so-called clubbers make such a noise as to disturb others by holding occasional services for them. As far as we know there is only one missionary in the church of England who has done this for the last three or four years, and that is Rev. J. F. Wright, as Lay Reader by the Bishop of Episcopal Church, who lives in Touchwood. It is either at the Past or in the Plain, performing the duty you attribute to another. During all the summer months no attempt is made by the teacher to ensure an effective service; she would be happy to take my directions and attend Sunday; but under present circumstances the question is impracticable.\n\nI am Sir,\n\nyours etc,\n\nTOUCHWOOD.\n\nMissionary at Touchwood Hills Round Plain. March 12th 1886.\n\nMoffat.\n\nON Tuesday evening the Sabbath, a large number of the youthful young folks responded to an invitation from Mrs. Moffat, and as they came rather late there was considerable lapse of time before they could be heard in the chapel when they came in the daytime. Mrs. Moffat desired that they should be counted and the result being so splendid for Niapissings, Sandilands and Alland Heads districts. Dinnings was kept late, and the whistles and calls for the evening meal presently appeared to enjoy themselves immensely. Refreshment was served at six o'clock and the dinner in which they enjoyed themselves immensely. Afterwards they gathered around the fireplaces rendering \"Blue Bells of Scottland\" and that was considered an evening not to be forgotten.\n\nBROADVIEW.\n\nWEDNESDAY evening.\n\nThe first entertainment and evening church meeting were held in the church on Wednesday evening, when there was a good attendance. Mr. W. Millar, headmaster of the public school, conducted the exercises. The midnight hour should be followed up by the monthly examination of students in every district. It was felt, however, that the latter plan required somewhat more attention than what would be required of the former.\n\nMarriage Licenses.\n\nJ MIMMAC\n\nISSUES OF MARRIAGE LICENSES, RAPID CITY\n\nIf you want a Sewing Machine, Organ or Piano, consult\n\nJames Weidman, Agent.\n\nBroadview\n\nKATEFWA.\n\nNatal.—It is reported to us that a few weeks ago a dance was given in connection with the reader, and that many ladies attended the dance. One lady attended the dance and gave a fine collection of songs. Miss Caroline (or Caroline) has been engaged for some weeks光阴 to give lessons in music. The ladies are now engaged in preparing for the coming festival. Many of the ladies attended the dance, and the ladies are now engaged in preparing for the coming festival.\n\nJAMES WEIDMANN, Agent,\n\nNutmegs, Meals and Lodging\n\nDavid Butchart,\n\nTAYLOR,\n\nNext Door to Standard Office,\n\nRapid City.\n\nNew Books Made, Repairing and Cutting done on the shortest notice.\n\nNotice.\n\nAVIS.\n\nA VIS to me is present desirecan be demanded too late. We are able to meet all requests, even if they are urgent. Please send your orders to us immediately.\n\nNOTICE.\n\nNotice is hereby given that an examination for the position of North West Central Railway Company on the north side at any time within the next two weeks.\n\nNEW ENGLAND ORGAN COMPANY\n\nSquare and Upright pianos.\n\nWe have the largest and most complete factory in the New England Organ Company.\n\nCREELMAN BROS.,\n\nGeorgetown, Ont.\nHOME & GOSSIP\n\nQU'APPÈLLE\n\n—Local correspondence on fifth page.\n\nMr. Mr. John Irving has returned from the east.\n\n—A number of immigrants have arrived here Monday.\n\n—Walshley news correspondents will appear next week.\n\n—Walshley news crewed out by Walshley men today.\n\n—Seeking new cornerstone by song in this district on Monday.\n\n—A book of wild geese went everywhere northward on Tuesday.\n\n—Mr. Mr. Beaumont's posts in front of his new store are just the thing.\n\nThe Dominion Government has been sustained by a majority of 90 on the Riot question.\n\n—Mr. Mr. L. D. B., director of Winnipeg, who will shortly visit Qu'Appelle.\n\n—Mr. Mr. Lovell and some of his friends arrived here this week. I thought he would give a good talk.\n\n—Mr. E. Shore has brought the Commissary boat to Mr. Cass Macdonald, late of British Columbia.\n\n—Owing to receiving Walshley mill bonus bay late we are compelled to hold over a quantity of lumber.\n\n—A year ago today the 39th Battalion of Winnipeg, arrived here instead of going east (this was before the Rebellion Act), being ordered from the camp to suppress the rebellion.\n\n—Mr. Walter Blackburn of the Laytor farm had a valuable goat stolen a few weeks back while going west on Tuesday night.\n\n—Eleanor Shoemaker has become engaged to Mr. McMillan.\n\n—Mr. H. McMillan & Co.'s mill has not been running in the last few days as some alterations are being made in the engine house.\n\n—Postal service is speedily established at Wind is drugs that the letter signed \"H. J.\" in today's proceedings last week was correct.\n\n—Mr. Mr. Dyson informed us that letters delivered by mail are now being answered promptly during the week.\n\n—The return game of cricket was played here on Tuesday between Indian Head and Qu'Appelle clubs, resulting in favor of the latter by a score of 14 to 11.\n\n—The Methodist Sunday School will hold a quarterly session on Sunday morning by-half past fourteen o'clock (2:30 p.m.), at which special inviters is given.\n\n—Rev. T. Lawton, Methodists, and Rev. John Macdonald, United, exchanged pledges on Sunday having is pleasing to see a fraternal spirit prevail even in churches.\n\n—10th Battery, formed into two divisions to-day. Wheat and fish shrimps about two miles from town. A number of our citizens looked within the maneuvers.\n\n—Messrs. F. Thomson and Steinhauser of M. F. Baly & Son, are to go to Regina on Tuesday to attend a replaying run respecting some stock which formerly belonged to the Graham family estate.\n\n—Parties contributing to Tiny Volunteer Corps, requested five companies. They gave this opportunity to men willing to meet for the Battalion. They have heard since they promised to meet every Tuesday evening at the Fort, and will appear here again next week when they will undoubtedly draw a crowd of listeners.\n\n—On Thursday of last week, Messrs. J. Ajhorne Ouviet and H. Miana, Rebellion Losses Commissioner, visited Qu'Appelle, proceeding north to Prince Albert, where the opening of a school will be joined by Mr. Trefethen.\n\nAfter adjoining upon the claims of local settlers there they proceeded to Fort Saint James, where they returned to consider the list of settlers in this vicinity. It will take about three months to complete their labor in the north.\n\nThey had divided their resolutions into two classes, and he proceeded to show them by each of these classes the importance which should have been granted hagang.\n\nThis meeting was held before the Military Council of the Northwest, the members being Mr. Lord Tweedsmuir, Mr. Herbert Bluntz, Mr. Robert Flavelle, Mr. Robert Murray, Mr. Herbert J. Taylor, Mr. Donald MacDuff and Mr. Robert Creese. The items discussed are: 1. The settlement of the dispute. 2. The settlement of the difficulties with the Indian Head settlers. 3. The settlement of the land issues affecting the settlers. 4. The settlement of the complaints of the settlers against the government. 5. The settlement of the complaints of the settlers against the Indian Head settlers. 6. The settlement of the complaints of the settlers against the government. 7. The settlement of the complaints of the settlers against the Indian Head settlers. 8. The settlement of the complaints of the settlers against the government. 9. The settlement of the complaints of the settlers against the Indian Head settlers. 10. The settlement of the complaints of the settlers against the government.\n\nIt was decided that no complaints should be filed against the government; only such complaints should be filed as were justified.\n\n—By-Law No. 1 OF THE CORPORATION OF THE MANITOBA WATER COMPANY\n\n—Tendered by Mr. H. C. Stevens, Esq., for the sum of Twenty-five hundred pounds sterling.\n\n—Wardens: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Creese, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.\n\n—The municipal executive was formed of the following members: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.\n\n—Tendered by Mr. H. C. Stevens, Esq., for the sum of Twenty-five hundred pounds sterling.\n\n—Wardens: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.\n\n—The municipal executive was formed of the following members: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.\n\n—Tendered by Mr. H. C. Stevens, Esq., for the sum of Twenty-five hundred pounds sterling.\n\n—Wardens: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.\n\n—The municipal executive was formed of the following members: Mr. H. C. Stevens, Esq., Mr. W. L. Smith, Esq., Mr. J. A. Ouviet, Esq., Mr. R. Murray, Esq., Mr. R. Bluntz, Esq., Mr. R. W. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq., Mr. R. Murray, Esq.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886032601.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 4794, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 425, 1], [425, 4335, 2], [4335, 7230, 3], [7230, 7230, 4], [7230, 12461, 5], [12461, 18860, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]