[{"id": "fccf6032c6e8e3c6b0579def15c5a500ccf56e20", "text": "MR. JACKSON’S SPEECH.\n\nThe Winnipeg papers have been discussing very fairly the speech delivered by Mr. T. W. Jackson, M. W. C., at a complimentary banquet given him by Mr. Constable at Fector’s Apprize, Jan. 23rd. He has asked us to refer to the speech hereafter for the very reason that it is printed in the newspapers of the city that he believed it to be important that the people of the city should know what he had said. He was asked why he did not make any statement before the interview, but he said that he thought it would be best to wait until after the publication of his second volume before making any such statement as he had made. He also said that he thought it would be best to wait until after the publication of his second volume before making any such statement as he had made.\n\nNOTES AND COMMENTS.\n\nThe Manitoba Legislature will meet on Tuesday, May 10th.\n\nIt is expected that all the rebellious prisoners still undergoing sentence will be liberated before the meetings of the Dominion Parliament.\n\nMR. JACKSON’S SPEECH.\n\nThe Winnipeg papers have been discussing very fairly the speech delivered by Mr. T. W. Jackson, M. W. C., at a complimentary banquet given him by Mr. Constable at Fector’s Apprize, Jan. 23rd. He has asked us to refer to the speech hereafter for the very reason that it is printed in the newspapers of the city that he believed it to be important that the people of the city should know what he had said. He was asked why he did not make any statement before the interview, but he said that he thought it would be best to wait until after the publication of his second volume before making any such statement as he had made. He also said that he thought it would be best to wait until after the publication of his second volume before making any such statement as he had made.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing such a rate. We can much better afford to publish a paper at that price when we know that every paper going out is paid for, than if we took the chances of collecting accounts at a higher figure. Besides we will be able to secure a large circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLiberties.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\n\nQU'APPELLE ST.\n\nSingle and Double Horse for Hire.\n\nFreighting a Specialty\n\nAll Kinds of Coal\n\nKept Constantly on Hand at the Lowest Prices.\n\nCash Paid for Horses & Skins\n\nQU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\n\nFor First Class Rigs.\n\nDaily Mail Stage to Fort Qu'Appelle.\n\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has now on hand the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Bells, Blankets, Circles, Combs and Brushes.\n\nAll Kinds & Sizes of Trunks and Valises.\n\nAgent for Carriage & Buggy Tops.\n\nRemember the Place\n\nPioneer Harness Shop\n\nQU'APPELLE.\n\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nThomson & Nelson FORWARDERS,\n\nAND DEALERS IN\n\nLumber, Lath, Shingles\n\nDoors, Sash\n\nBuilding Paper, etc.\n\nOffice West of C.P.R. Station.\n\nQU'APPELLE.\n\nBranch at Fort Qu'Appelle.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\n\nGents' Furnishings, Boots & Shoes,\n\nFURS OF ALL KINDS\n\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\n\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nOF THE\n\nTOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\n\nPROPRIETORS\n\nFURNITURE. FURNITURE.\n\nHAVING LATELY SECURED\n\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\n\nAT PRICES THAT DEFY COMPETITION.\n\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE\n\nQu'Appelle Progress\n\nIS PUBLISHED\n\nEvery Friday Morning.\n\nAT THE OFFICE, QU'APPELLE STATION.\n\nSix Pages. Thirty Columns.\n\nSubscription $1.00 a Year Invariably in Advance\n\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE\n\nBoot & Job Printing\n\nDEPARTMENT\n\nEXECUTES\n\nEvery Description of Printing\n\nNEATLY, CHEAPLY & QUICKLY.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\n\nAND DEALER IN\n\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\n\nSPECIAL PRICES ON WHOLESALE LOTS.\n\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION.\n\nLove & Raymond,\n\nPROPRIETORS.\n\nRebuilt, Enlarged, Renovated, Everything New and First-Class Throughout\n\nSuits for Families.\n\nTerms Moderate.\n\nS. H. CASWELL,\n\nGENERAL STORE,\n\nBANK,\n\nPOST OFFICE,\n\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n\n(LIMITED)\n\nOffer for Sale\n\nSELECTED FARM LANDS\n\nin Manitoba and the North-West Territories,\n\nNear the Canadian Pacific Railway Main Line\n\nA large proportion of this Company's Lands is in thickly settled districts.\n\nFor information, Prices and Maps, apply at the offices of the company, 14 Castle Street, Edinburgh, Scotland; 75 Lombard Street, London, England; 19 Main Street, Winnipeg, Manitoba.\n\nW. B. SCARTH\n\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nThe Town Site Trustees offer for Sale\n\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAgent in Qu'Appelle for Land and Town Lots.\n\nLeslie Gordon.\nThe Qu'Appelle Skating Rink\n\nA. HOLLINGSHEAD,\nPAINTER.\n\nHOUSE SIGN AND CARRIAGE PAINTING, GRANING,\n\nGlazing, Paper hanging, Kalsomining, &c.\n\nAll work neatly and promptly executed.\n\nOffice, Walsh St., Qu'Appelle.\n\nRussell & Davis\nWholesale and Retail Dealers in\nBEEF, POULTRY, MUTTON, SAUSAGE, HAMS, BACON, ETC.\n\nBeef Cattle & Hogs\nALWAYS ON HAND.\n\nTerms Strictly Cash\n\nQU'APPELLE STATION\nBRANCH—FT. QU'APPELLE\n\nQU'APPELLE\nStove and Tin Depot.\n\nE. WISMER\nWhile respectfully thanking for patronage, would desire to inform the public that he has added to his stock of Stoves and Tinware.\n\nMy Stoves are from the best manufacturers, and were selected to meet the requirements of the most particular trade.\n\nQU'APPELLE STATION.\n\nLansdowne Hall\nQU'APPELLE\n\nBillard & Pool Tables.\n\nH. J. EDWARDS\nLester.\n\nJ. B. ROBINSON\nContractor, Builder, ETC.\n\nQU'APPELLE.\n\nAll Work in my Line will Receive\nCareful Attention.\n\nThe Nor-West Farmer\nWants Manitoba\nAnd the North West\nTO YIELD A GREATER RETURN TO THE LABOURER.\n\nWe are doing our best to bring about this happy state of affairs, and want the labourer to understand that we are working for him.\n\nThe Nor-West Farmer\nSUSTAINED MILLER.\n\nIt is devoted to the interest and advancement of the farmers of the North-West. It is filled each issue coming in contact with the farmer, and is the only paper containing the best methods of pasture raising, the latest developments in the science of farming applicable to the farmers, and stock raising. It is the only paper containing a children's department presented once by a lady, and contains the best advice given by the best authorities on the subject.\n\nHELP ALONG OR GOOD WORK\nis secured in your Subscription.\n\nOnly $1.00 per Year\n\nTo everyone who subscribes before Feb. 28th, 1903, we will give free of charge a copy of the best house-cleaning book ever written, full of useful directions and information.\n\nWrite to the office of publication at once.\n\nTen Nor-West Farmers Printing and Publishing Co., Ltd.\n\nWM. CLARK, C. B. BLENDEYMAN.\n\nWe have made arrangements with the publishers of the \"Farmers' Almanac\" to sell it at cost price, and will be glad to send it to any subscriber for $2.00, but for the subscription price of $1.00, which includes the almanac.\n\nThis is your opportunity.\n\nEvery description of\nBOOK AND JOB PRINTING.\n\nExercised at the office of\nThe Qu'Appelle Progress.\n\nThis is your opportunity.\n\nIf U want a Sewing Machine, Organ or Piano, consult\nJames Weidman, Agent.\n\nLYMAN'S UNIVERSAL PAIN RELIEVER\nFOR Frost Bites, Cramps, Rheumatism, Neuralgic Affections, Tie Doloureux.\n\nSafe\nMild\nStrong\nPure\n\n25 Cents a Bottle. Full directions in\n\nTHE PROGRESS\nBook and Stationery Store will open shortly.\n\nMartin Enriquez Tupper is not only very well known in the province, but is also highly respected. He is a man of great integrity and honesty, and is deeply esteemed by his fellow citizens. He is the author of the \"Provincial Philosopher.\"\n\nW. H. Smith, of the Royal Academy, has been appointed to fill the \"Professor's\" place as Sir Joseph Porter with the Royal College of Physicians. His name is to be raised to the peerage.\n\nOver 100 men are at work tunnelling the tunnel under the river at the Rock of Gatineau. It is expected that the work will be completed in three months, and the tunnel will be opened to traffic in October next.\n\nLondon has been visited by a fire which is being used to considerable extent in Europe. The fire is caused by the use of fine cotton waste. It is also used to some extent in America, where it is sometimes mistaken for muley.\n\nTwenty years has not been sufficient to destroy the explosive qualities of these woods. The forest fires have recently laid bare the old trees, and many of them are still in good condition. Many old stumps have been found.\n\nAt the annual sheep shearing in Victoria, a sheep was shorn of twenty-eight pounds, thirteen ounces, and another sheep's fleece, twenty-one pounds, nine ounces. This claim, if true, exceeds the record at any public shearing.\n\nA plan has been devised and is now being carried out in France and London by pneumatic tubes. Through these tubes, packages up to eleven pounds in weight may be transported without delay. The guarantee is guaranteed not to exceed one hour.\n\nIn Teheran, Persia, the two horses named \"Goliath\" and \"Goliath II,\" which are owned by the Persian government, have been given the title of \"General.\"\nCONSUMPTION CURED.\n\nAn old physician, after long practice, having found in his hands an East Indian missionary the formula of a simple vegetable remedy for the spleen and pernicious consumption, gave him the recipe. But the missionary could not read, and so the cure was lost. After many failures, he heard of a man named James Weidman, who had been educated by the missionary. James Weidman, however, had never seen the recipe written down. He knew it by heart, but could not read it. So he asked the missionary to write it out for him. The missionary did so, and then James Weidman went home and wrote it out again. It was then discovered that the recipe was the same as the one that had been lost. This discovery led to the discovery of the cure for consumption.\n\nIf U want a Sewing Machine, Organ or Piano, consult\n\nJAMES WEIDMAN,\nAgent.\n\nNOTICE.\n\nNOTICE IS HEREBY GIVEN THAT AN ACT TO PROVIDE FOR THE CONSTRUCTION OF THE NORTH WEST CENTRAL RAILWAY FROM WINNIPEG TO RED RIVER IN THE PARLIAMENT OF CANADA, FOR THE CONSTRUCTION OF THE NORTH WEST CENTRAL RAILWAY COMPANY, LTD., AND FOR OTHER PURPOSES, WAS READ THE FIRST TIME IN BOTH HOUSES OF THE PARLIAMENT ON AUGUST 25, 1884, AND WAS READ THE SECOND TIME ON SEPTEMBER 19, 1884, AND WAS READ THE THIRD TIME ON OCTOBER 6, 1884, AND WAS PASSED INTO LAW ON OCTOBER 7, 1884.\n\nJ. MIMMACK,\nISSUER OF MARRIAGE LICENSES,\nRAPID CITY.\n\nNotice\n\nIn addition to the Acts mentioned in the Notice above, the following Acts have been passed into law:\n\nThe Liquor License Act.\n\nThe following applications for Licenses have been approved:\n\nMRS. THOMPSON, LADY. MORGAN,\nLEMON COOK, OAK STREET.\nMR. G. LA TOUCHE, TIFFINER.\n\nSecretary to Board,\n\nW. C. COTTINGHAM,\nHarness, Boots and Shoes,\nRapid City.\n\nHOW TO MAKE A CUP OF EXCELLENT COFFEE\n\nAt a Woman's Notice Anywhere.\n\nUSE\n\nLyman's Concentrated Extract of Coffee.\n\nPREPARED BY A NEW AND SUPERIOR PROCESS.\n\nCHOICE SELECTED COFFEE.\n\nFRESHLY ROASTED AND GRINDING.\n\nQUALITY AND FLAVOR, AND INCOMPARABLE.\n\nFOR SALE BY GRADERS & BRIGGLES.\n\nIN 1 LB., 2 LB., 3 LB., and 5 LB. BOTTLES.\n\nTRIAL SIZE: 5 CENTS A BOTTLE.\n\nFULL DIRECTIONS WITH EACH BOTTLE.\n\nCorinthian Lodge No. 15\n\nA.F.A.M.O.M.\n\nThe new Constitution of this Lodge takes effect on the first Tuesday of each month.\n\nC. J. SALLIER,\nChaplain of the Legislative Assembly of Manitoba.\n\nDavid Butchart,\nTAILOR,\nNext Door to Standard Office,\nRapid City.\n\nQUEEN'S HOTEL,\nRAPID CITY.\nGOOD BOARD AND BOARDING.\n\nTHOS. HURDLE Prop.\n\nMIN. D. BUTCHART\nWill soon be occupying the new building with Meals and Lodging.\n\nAND STANLEY,\nSecond Avenue, Rapid City.\n\nTHE NEW RAYMOND SEWING-MACHINE.\n\nFOR FAMILY USE.\n\nHIGH SPEED, HIGH STITCH.\n\nEasy Grip, Smooth.\n\nAutomatic Bobbin Winder.\n\nOHIO RAYMOND,\nGuelph, Ontario.\n\nSPECIAL OFFERS\n\nFor full information apply to\nJ. S. HURDLE, B.A.,\nRapid City, Aug., 1885.\n\nPublic Notice.\n\nLEGISLATURE OF MANITOBA.\nEXTRAORDINARY SESSION.\n\nON Friday, Nov. 20th, 1885.\n\nEvery person interested is respectfully requested to appear at the meeting place at 10 o'clock A.M., at the present seat of government, in order to hear the proceedings of the Extraordinary Session of the Legislature.\n\nCREELMAN BROS.,\nGEORGETOWN, ONT.\n\nEVERY DESCRIPTION OF BOOK AND JOB PRINTING.\n\nExceeded all the offices.\n\nThe Qu'Appelle Progress.\n\nThe Dominion Cigar and Piano Co.\n\nRapid City.\n\nTHE PROGRESS\n\nBook and Stationery Store will open shortly.\n\nFancy Goods,\n\nToys, Jewelry, Wedding Rings, Xmas Gifts, Albums, Prayer Books, Bible, Story Books, Povels, Guild and Insignia Plates, Postage Stamps, Books and Stationery, Xmas Cards, Brigg's Stamping patterns and Butter Printing stand.\n\nMillinery, needle and dress making in connection.\n\nMrs Stone & Murdock\nHOME & GOSSIP: QU'APPHELLE.\n\n—Full parade and artillery manoeuvres at Barrack yesterday.\n\n—Rev. O. Darwin, of the Fort who was on the Maxim duel, will play Sunday evening.\n\n—Two sides chosen from the Qu'Appelle Curling Club will shortly play upon the new squad cup which will be given by the club.\n\n—On the 23rd inst., at Clinton, Ont., there will be a gathering of proprietors of lands belonging to the North-West Territories. Many of them propose to settle in this vicinity.\n\n—J, W. Vimpeiro, P. Horne, Regin Caesar, J. ostralegou, L. Goodridge, L. J. Murray, W. L. (Alvier, Rev. I. Loeb, Fort Qu'Appelle reportered at Hotel Carlos this week.\n\n—The employees of the C. P. O. have voted to adopt a motion selecting themselves families to be carried by the system, as it will be adopted in Ontario next time when it will be issued by it to work alongside.\n\n—Mr. Peter Hoeffler, Indian interpreter to the Lieut.-Governor, passed through town on his way by way of Prince Albert, where he will see his family, and attend to some business matters.\n\n—The Qu'Appelle Agricultural Society has voted in favor of adopting a monthly fair for sale of horses, cattle, etc., all kinds of farm produce. The first sale will take place on Saturday, March 4th. Let your neighbors know.\n\n—A public meeting will be held in Hotel Carlos on Saturday evening, the 27th inst., at 10 o'clock (2 p.m.), for the purpose of considering the erection of a school building near the Hotel. The booth of the Qu'Appelle school board.\n\n—Messrs. Burke & Son, Messrs. J. Johnson, A. Hammond and E. Whyte went to Wolseley, Tuesday evening last to attend to their business given up to Mr. Hinds. They say it was a grand affair, they enjoyed themselves very much. Everything turned out capital, especially when the ball and supper was first class.\n\n—Last evening Messrs. D. McCullough & Co. engaged a large number of people of the municipality at the queen's hotel. Everybody had the opening of the new opera. The Ladies Band has been honoured by the municipality in the extent of $100.00. As the sum of money is quite large, we press, we are unable to refer to it further this week.\n\n—J. H. Dickinson, Banbury, Agent and Solicitor Donald Macdonald, Commissioner.\n\n—Princess Alcide, Jas. Chènas, Mennonites George Taylor, Liverpool England, J. F. Taylor, Liverpool England, R. Butler, Liverpool England, R. E. Strang, Oudenhou, Germany, Montreal, Rev. Scrub Kelly, Ottawa, Ottawa Senor Chief Asby, Miss Rhein, Moscow; Rev. Frank Meiklejohn, Winnipeg, are agents for the Lebanon.\n\n—Mr. E. L. Odger, Sergeant Major, Intelligence Officer, commanded at Mathias House, coupland Headquarries, Colonel, ndas, Intelligence offlcal of Milittary Regiment Prince Albert, Jas. Chènas, Mennonites Esau, Y, Est Mennonites, Wiley Everswe, Glasgow England, Mr. A. S. Brewster, Mennonite of Milittary Regiment Prince Albert, Jas. Chènas, Mennonites Esau, Y, Est Mennonites, Wiley Everswe, Glasgow England, few defendants. They are all now interested in the case. The major is interested in the case.\n\n—Saskatoon.\n\n—Two hundred loaves of oats will be supplied the Prince Albert settlers from here.\n\n—Green staggered extended purchased by the settlers from the military authorities last summer, but, whether it will be adopted in the east, the authorities do not indicate. They may be demanded by the electors if they will be forced to adopt it yet.\n\n—Samson interviewed by Royal Edmondton.\n\n—Final fastelling taken in Bastiste at the time of the rebellion, and sent to Saskatoon for the use of the settlers, residents living on land.\n\n—Edmonton. Oct. 26th.—Borainsberg won by outstanding success in the police force here since Mr. Timely last week, the same-speed plans for the district non-commissioned officers. Yesterday, April 1st, a special exercise was conducted on the range at Castleford, near Edmonton, for the second discipline of the present season. The men showed a commendable spirit of patriotism and bravery during the demonstration. Every man played his part until failure, indicating that they were better prepared than before.\n\n—Edward Pollock, Agent.\n\n—As qu'aptsone is now probably over.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886021901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8856, "total-output-tokens": 4787, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1820, 2], [1820, 5692, 3], [5692, 10104, 4], [10104, 13792, 5], [13792, 17942, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]