[{"id": "319c908376726d1542096368cebca7edd3e2cc4a", "text": "RIEL EXECUTED.\n\nThe news has been received by Deputy Sheriff Gibson, according to which Mr. Riel was executed at noon today. The body was found in the river near the scene of the execution. The body was identified by Mr. Gibson, who had been present at the scene of the execution. The body was then removed from the river and placed in a coffin. The coffin was then taken to the church where the funeral service was held. The body was then buried in the cemetery.\n\nNORTHWEST COUNCIL.\n\nRegina, Monday, Nov. 2.—The Northwest Council met today to discuss the current situation in the region. The council members discussed the need for increased funding for education and healthcare. They also discussed the need for increased investment in infrastructure projects. The council members agreed to work together to address these issues.\n\nGRAND COLONIAL EXHIBITION.\n\nIn London, England, 1859.\n\nForty-four thousand feet reserved for Canada.\n\nFirst Royal Exhibition Committee since 1862.\n\nThe Royal Exhibition Committee has announced plans to hold an exhibition in London, England, in 1859. The exhibition will feature exhibits from all over the world, including Canada. The exhibition will be held in the Royal Exhibition Building, which was completed in 1862. The building was designed by Sir Charles Barry and was built to house the first Royal Exhibition Committee. The exhibition will run from May 1st to July 31st.\n\nREGULAR MEETING OF THE CITY COUNCIL.\n\nRegina, Tuesday, Nov. 10.—The regular meeting of the City Council was held today. The council members discussed the need for increased funding for infrastructure projects. They also discussed the need for increased investment in education and healthcare. The council members agreed to work together to address these issues.\n\nTHE NEWSPAPER.\n\nThe Qu'Appelle Progress is a weekly newspaper published in Regina, Saskatchewan. It covers local news, politics, and community events. The newspaper is owned by James Wedeman.\nThe Qu'Appelle Progress\n\nPublished by JAMES WEIDMAN\n\nEvery Friday.\n\nAt the Post Office Printing Office, in the Town of Qu'Appelle, near Regina, Canada.\n\nThe Progress is a Weekly Journal of Local, Territorial, Canadian, and Foreign News, History, Literature, Politics, and Personal Items.\n\nSubscription price: $1.00 per annum, inclusive of all postage.\n\nThe rate for our advertising space by contract are as follows:\n\nOne column per week, monthly issue...$3.00\nTwo columns per week, monthly issue...$6.00\nQuarterly rate...$12.00\nThree issues...$5.00\nTwo issues...$4.00\nOne issue...$2.00\n\nBusiness cards $1 per month, payable quarterly.\n\nThis rate does not apply to notices, advertisements, letters, meetings, legal notices, or anything of a business nature.\n\nQu'Appelle Progress is printed on 10 tons per line press. The paper for each issue is delivered to the office, and is delivered to the subscriber at no additional cost.\n\nThis rate does not apply to notices, advertisements, letters, meetings, legal notices, or anything of a business nature.\n\nOur chief aim will be to advocate the best interests of the settlers in these Territories, and impress upon the Government their advantages as well as any matters which may arise from time to time. The recent visit of the newly appointed Minister of the Interior and the pains he has taken to ascertain the wants of the people, has led to the hope that the affairs of the North-West will be administered more satisfactorily than heretofore. We shall watch closely the result, and if occasion requires, we will not hesitate to criticise and condemn the course he may take, but we will meet the requirements of the pioneers who have carried the Star of Empire so far westward. We will ever contend for those principles which make up the sure foundation of British institutions; we will also be diligent and enthusiastic in allay all sectarian and religious differences, but at the same time we will strenuously oppose any religious conglomeration that may endeavor to postpone govern- ment until the will of the people is nullified. As our name indicates, we will give our hearty support to every movement that has for its object the social, moral and political Progress of the Dominion at large and the North-West in particular.\n\nOn account of the difficulties attending the issue of a new paper, this number is not as complete as The Progresses will be in future, still it indicates to a certain extent the style and purpose of the publication. In a word, The Qu'Appelle Progress will be a live newspaper for the benefit of everyone.\n\nOur advertising space indicate a generous support on the part of the leading business men of the place, though there are still a few whose announcements do not appear, but will probably come in later.\n\nIn our efforts to furnish a live local journal, we ask for and expect a liberal patronage from all classes of the community.\n\nNOTES AND COMMENTS.\n\nThe Eiff has found its rope.\n\nTake The Progresses only and often.\n\nTHE QU'APPHELLE PROGRESS FROM NOVEMBER 1887 TO JANUARY 1888.\n\nLouis Riel had met the penalty of his crimes. His trial was fairly tried, and appeal was had to the highest court in the realm, and the verdict of \"guilty\" sustained. But before the carrying out of the sentence, strong pressure was brought to bear on the Governor General, who was obliged to exercise executive clemency in favor of the rebel. As demanded for sparing his life grew in strength among his French sympathizers, so the proclamations were issued, and the demand was made that he should ever been hanged because of the demands of his French-Canadian friends. By alienation Riel had turned foreigner; he came to the Northwest to raise the standard of insurrection, to incite the Indians to rapine and murder; by his lawless acts, he was the cause of the shedding of much Canadian blood and treasure. Being convicted a traitor, yet every privilege of appeal was only what the law and justice demanded. It is to be regretted that there are so many French Canadians who so far forget their nationality that they would rather be in British territory, than serve as soldiers for the French speaking population; or that a guilty criminal of one nationality is not as amenable to our laws as one of another nationality. Such do not need to be taught that any attempt to stop the wheels of British justice will but result to their own injury. The majority of that nation are good citizens, but there are still manifestations in matters of government, when but any considerable portion of them attempt to coerce the Administration into a position of resisting to shield one of themselves, such demonstrations must be quelled at once.\n\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we receive our money promptly than when paid for, when we took the burden of collecting accounts at a higher figure.\n\nBesides we will thus promptly secure a larger circulation, which will enable us to increase our advertising space, and also allow us to pay your name and dollar, and mail your neighbour's to subscribe, and you will obtain full value for your money.\n\nThe editor is anxious to hear from any interested reading from now till January 1st.\n\nEarthquake Shocks.\n\nThe eastern coast of the United States, Virginia to Maine, was threatened during the past week with an earthquake. The city of Alexandria, Va., had an intense excitement in the province of Quebec, and demonstrations have taken place, but it is to be hoped wise counsels will prevail, and that the excitement will calm down, without causing loss of life or property.\n\nRELIGION AND PARTY POLITICS.\n\nThe English press of the Dominion generally were agreed that Riel should suffer the full penalty of his crimes, but the Irish portion was very content he would not die. It was said that Riel was the Quebec liberal, that the Dominion Government, and that it does not concern the rebel. It was sought in particular to fasten the whole responsibility upon Sir John Macdonald and Mr. Riel. But as matters stand, however, and the most satisfactory verdict established itself, it appeared, mostly in the hearts of the people, it was an important crisis for the party, as well as the country, and must be, if possible, congratulated.\n\nHaving an Adjoining Paper as well as our own, The Qu'Appelle Progress Press, Mr. Riel has beaten her own time, and been her own gallant guide. The old hawk has shown his keen eyes—sharp Currier's eagle. The old hawk has shown his keen eyes—sharp Currier's eagle. The old hawk has shown his keen eyes—sharp Currier's eagle. The old hawk has shown his keen eyes—sharp Currier's eagle. The old hawk has shown his keen eyes—sharp Currier's eagle.\n\nHAYDN.\n\nSome Preliminary Notes on the Music of Haydn.\n\nHaydn was a man who was not the least of his time; his works are not the least of their kind; and where else may reach a higher ideal? He once said I will only hear those compositions which are played without accompaniment, and that I do understand then I must leave the room. He once said that he thought he could work more quickly, but such was not the case. He once said he could not make himself heard in the hall, and afterward he would work there. He once said that he thought genius was a gift from God which he had received, and that he thought God had given him talent, he said, and I think that Haydn, I think I have done my duty for the world.\nDOOLITTLE'S LIVERY\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingle and Double Runs for Hire.\nFreighting a Specialty\nAll Kinds of Coal\nKept Constantly on Hand at the Lowest Prices.\nCash Paid for Hides & Skins\nQU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\nFeed and Sale Stable\nFor First Class Rigs.\nDaily Mail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\nHarnessmaker.\n\nHarness & Saddlery\nThe undersigned wishes to inform the public of the Appelle and vicinity that he has now on hand the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips, Belts, Blankets, Cinglings, Combs and Brushes.\nAll Kinds & Sizes of Trunks and Valises.\nAgent for Carriage & Buggy Tops.\nREMEMBER THE PLACE\nPioneer Harness Shop\nQU'APPELLE.\nJOHN B. MILLIKEN.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAnd Dealer in\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station,\n\nNEW GOODS - NEW GOODS\nAT GOLDSTINE & BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nBoots & Shoes, Gents' Furnishings,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nGoldstine & Beauchamp.\n\nQUEEN'S HOTEL\nIN THE\nTOWN OF QU'APPELLE.\nThe Leading House in the West.\nJOHNSTON & DAVIDSON,\nPROPRIETORS\n\nSPICY! PITHY! NEWSY!\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE.\nSix Pages. Thirty Columns.\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing\nDEPARTMENT\nExecutes\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nHOME AND GOSSIP.\n\n—Keeps fine.\n\n—Go to the lecture to-night.\n\n—D. B. Macdonald of Weyburn, has been engaged.\n\n—Mr. Ogilvie has placed a grain buyer at Weyburn.\n\n—Quadrille party to-night at the emigrant building.\n\n—The contract has been let for the erection of the new mill.\n\n—A number of citizens have secured large contracts for lumber for the new mill.\n\n—More hogs are wanted to rent. Some of our entrepeneur citizens should build a fence.\n\n—Mr. W. Gibson has moved to his homestead. Mr. Scott of Edgley, will occupy his house for the winter.\n\n—Misses Rufus Stevenson and Frank I. Clarke, of Winnipeg, passed through here on a western tour yesterday morning. Rufus looks as tall as ever.\n\n—We have received an advertisement from the \"Nor-West Farmer,\" an excellent weekly paper, published at Winnipeg. It will appear in our next issue.\n\n—Mr. Thomson, of the firm of Thomson and Nelson, is in Winnipeg forwarding lumber to supply the unexpected demand at this season of the year.\n\n—It is Battery is now in comfortable quarters they are occupying the whole of the immigrant buildings and are arranging for Mr. Baker's two teams which we understand has been granted.\n\n—St. Chad's church, p. 17, 13, northeast of here, will be dedicated on Sunday, Nov. 25th, by the Lord Bishop of Qu'Appelle.\n\n—It is very little noticed, and the sound of its bells has not been provided for in the settlement in the neighborhood, so that it will be opened free of debt.\n\n—Case of Harvey vs. Fraser was on when the court was changed with starting a line on the prairie without sufficient homestead, by Mr. S. N. Smith.\n\n—McLean, Esq., after hearing the evidence found the defendant guilty, but as the circumstances were such that the defendant, although breaking the law with no wrong intent whatever, he was only fined $10.00.\n\n—Mr. David R. Buttenbach, well known here, writes from Colorado to Mr. S. H. Cassell, our own postmaster, as follows: \"Unhappily the country has been very dull since coming out of the town. Everything now is terribly dull. Things are worse than they were in North Dakota or even compared with the same here. There is also more enterprise or better practice. So there is neither one nor the other across the lines is belied to the skies.\"\n\n—Mr. Nicholas Floyd Davis, of the Regina Leader, will lecture this evening in the Presbyterian church, on the subject of Home Government. A treat may be expected. See the following opinion of the talented lecturer:\n\n\"Mr. Davis's style is characterized by the warmth, influence and humor of his nationality. He has rich, full voice and a pleasant manner. His lectures are distinctly instructive. They convey even a lengthy lecture bearing upon any wide theme. He delivered a very interesting lecture before an audience of unusual culture and intelligence.\"\n\n—The National, Nov. 19, 1874.\n\n—We are already crowded with job work.\n\n—The Methodist church at the Fort will be dedicated next Sunday.\n\n—Rev. T. Lawton goes north Monday night to attend meetings of the Appropriation Committee of the Manitoba Methodist Conference to be held at Portage la Prairie next week.\n\n—We are still working under difficulties in issuing The Progress, owing to having no exchange to be had, and not being able to come fully acquainted with all the sources for obtaining the local news. But within weeks we will get into better working order. In the meantime we ask our friends not to criticize us too severely.\n\n—The most serious drawback of the settlement is the want of educational advantages for the young people.\n\n—Mr. Thor, Gorrell assistant to reeve, has returned from one of the surveys with Mr. Johnson, of Qu'Appelle, stating that:\n\n—Mr. Wm. Dunlop has secured a residence in Qu'Appelle and will shortly commence business.\n\n—Indian Head council meets Dec. 1st.\n\n—Mr. R. Bullen starts on his tax collecting tour in a few days.\n\n—The newspapers would like the municipal council proceedings published in The Progress.\n\n—There is a watch some money recently from Mr. J. H. Lee, of No. 20, 18, it is said to have been captured in Toronto.\n\n—INDIAN HEAD.\n\n—Indian Head council meets Dec. 1st.\n\n—Mr. R. Bullen starts on his tax collecting tour in a few days.\n\n—The newspapers would like the municipal council proceedings published in The Progress.\n\n—There is a watch some money recently from Mr. J. H. Lee, of No. 20, 18, it is said to have been captured in Toronto.\n\n—T. WELSH,\n\nGeneral Blacksmith,\n\nQU'APPELLE.\n\nFrom the very liberal patronage he has received, starting his business last fall, and now having a good trade, he respectfully solicits a continuance of the same.\n\nThe attention paid to his hosts by the citizens of Qu'Appelle is appreciated, as in the case of James Welsh, who was formerly engaged in repairing machinery previously attended by.\n\nJ. McEWAN,\n\nGeneral Blacksmith,\n\nCarriage and Wagon Shop\n\nQU'APPELLE.\n\nHorse Shoeing a Specialty\n\nEquipping done to either Wood or Iron Work.\n\nWORK DONE CHEAP FOR CASH\n\nCarpenter.\n\nJ. B. ROBINSON\n\nContractor, Builder,\n\netc., etc.\n\nQU'APPELLE.\n\nAll Work in my Line will Receive Careful Attention.\n\nShoemaker.\n\nFor Boots & Shoes\n\nGO TO\n\nS. H. COLLINS\n\nQU'APPELLE.\n\nWhere you can get the best quality and very much used.\n\nGent's and Ladies' Boots Made to Order.\n\nOrders from a distance attended to.\n\nOverhose, Rubber, Moccasins Now on Hand.\n\nRussel & Davis,\n\nBUTCHERS.\n\nOccupy this space next week.\n\nThe Nor'-West Farmer\n\nAND MANITOBA MILLER.\n\n(With Chart, Editor.)\n\nAn Illustrated Journal, devoted to the interests of the North-Western Provinces, and General Interests of the Northwest.\n\nPublished Monthly at Winnipeg, Man.\n\nSubscription, 60¢ per year in advance. Annual special numbers in every issue. Advertisements and other communications will be given.\n\nAddress, THE NOR-WEST FARMER, Box 106, Qu'Appelle, Man.\n\nWe make regular trips with the mail to Qu'Appelle, and will be glad to send any letters or packages in care of the office. We will be pleased to make arrangements with anyone who wishes to send their letters or packages by mail.\n\nSTRAYED\n\nF. E. Strayed, of the Express Station, has lost a horse, about 10 years old, black and white, with a white star on forehead, and white mane and tail. Will be glad to hear from owner.\n\nGeorge Smith, Qu'Appelle Station.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1885112001.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8902, "total-output-tokens": 4293, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1968, 1], [1968, 1968, 2], [1968, 1968, 3], [1968, 9511, 4], [9511, 11380, 5], [11380, 17642, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]