[{"id": "12a84864360f0a072894062d6655d9ca6d9cbddb", "text": "PUBLIC NOTICE\n\nSPRING COLLEGE SCHOOL.\n\nAll parents are hereby notified that the Inspector of Public Schools has appointed Mr. H. B. Murray as the Inspector of Public Schools for the district of Spring College School. The school will open on the first day of January, 1888.\n\nNOTICE TO CONTRACTORS.\n\nNOTICE IS HEREBY GIVEN that an invitation is extended to all contractors interested in the building of the North-West Central Railway Station at Lloydminster to tender for the erection of the station building. The tenders will be received by the Engineer-in-Chief of the North-West Central Railway Company, at the office of the company, located at 1225 Main Street, Lloydminster, on Wednesday, January 16th, at 12 noon.\n\nRICHARD D. BRADLEY,\nActing Engineer-In-Chief.\n\nWELLAND CANAL ENLARGEMENT.\n\nNOTICE TO CONTRACTORS.\n\nNOTICE IS HEREBY GIVEN that an invitation is extended to all contractors interested in the building of the Welland Canal Enlargement to tender for the work. The tenders will be received by the Engineer-in-Chief of the North-West Central Railway Company, at the office of the company, located at 1225 Main Street, Lloydminster, on Wednesday, January 16th, at 12 noon.\n\nRICHARD D. BRADLEY,\nActing Engineer-In-Chief.\n\nAVIS.\n\nA VIS is hereunto published that the members of the Board of Trade of the North-West Central Railway Company have approved the appointment of Mr. A. E. Bradbury as General Manager of the company. The members of the Board of Trade will meet on Monday, January 14th, at 3 p.m., at the offices of the company, located at 1225 Main Street, Lloydminster.\n\nJAMES BEATTY,\nPresident of the N.W.C.R.C.\nToronto, November 1st, 1887.\n\nFancy Goods,\n\nToys, Jewelry, Wedding Rings, Xmas Gifts, Albums, Prayer Books, Bibles, Story Books, poems, plush and lace, Needlework, Postcards, Books and Stationery, Xmas Cards, Bingo, Stampeding patterns and Bingle blanks always in stock.\nMidwinter, name-its-own making in connection with Mrs. Stone & Murdock.\n\nRussell & Davis,\n\nWholesale and Retail Dealers in\n\nBEF. POOK.\nMUTTON, SAUSAGE,\nHAMS, BACON, ETC.,\nBeef Cattle & Hogs,\nALWAYS ON HAND.\nTerms Strictly Cash.\n\nQU'APPELLE STATION.\nBRANCH - IT, QU'APPELLE.\n\nJ. B. ROBINSON\nContractor, Builder,\nEtc., Etc.\nQU'APPELLE.\n\nAll Work in my Line will Receive\nCareful Attention.\n\nTender For a Licence to cut Timber on Dominion lands in the North West Territories.\n\nSouth Qu'Appelle, December 15th, 1887.\n\nThe following resolutions were adopted by the Council of the Municipality of South Qu'Appelle:\n\nResolved, That the Council recommend the Hon. Mr. Justice Murray to take the necessary steps to obtain a charter for the Municipality of South Qu'Appelle.\n\nResolved, That the Council recommend the Hon. Mr. Justice Murray to take the necessary steps to obtain a charter for the Municipality of South Qu'Appelle.\n\nResolved, That the Council recommend the Hon. Mr. Justice Murray to take the necessary steps to obtain a charter for the Municipality of South Qu'Appelle.\n\nChristmas in Qu'Appelle,\n\nTREE ENTERTAINMENT.\n\nThe Christmas tree entertainment, held on Christmas evening in the Methodist Church, was a decided success. The tree was beautifully decorated with various ornaments and lights, and was always a favorite attraction. The children were delighted with the gifts they received from Santa Claus.\n\nThe Nomination,\n\nOn Monday there was a very large and representative gathering assembled in A. M. McLane's hall, quizzing and nominating candidates for the offices of councillor for the municipality of South Qu'Appelle. Mr. A. C. Peterson, the clerk, read the names of the officers to be nominated.\n\nRichard D. Bradley, A. M. McLane by W. S. David and J. Milliken, F. Kildy, J. D. Davis and G. Gordon, T. H. Thompson, G. H. Raynor and Leslie Gordon, F. O. Marwood, F. Whittington and D. Redden, John Carroll, N. Fallis and T. Dunn, R. Ross, A. Webster and N. F. Farnham, Joseph Craig, J. Blair and N. F. Farnham, Hector Melvin, W. Henry and G. Gordon, Thomas Craig, by John Milliken and Dr. Carton, S. G. Parson, by G. Willis and W. Dunlop, F. E. Byrd, F. G. Marwood and F. Gordon, W. C. Marwood, by F. Whittington and J. Scott.\n\nThe meeting having arrived at its conclusion, the motion being adjourned for the ensuing year, Mr. McLane, who had been elected chairman, called upon Mr. McLane to make the following remarks:\n\nMr. McLane thanked the citizens of South Qu'Appelle for their support and encouragement in nominating him as one of their councillors for the coming year. He would not attempt to outline the future for the year 1888, but the substance of what he said was in his last address. He had always felt that he could do more for the town than he could do for himself, and he would try to do as much as possible to benefit the town.\n\nHe also explained the fact of their being the first council and having to make many decisions, which caused much difficulty, but he thought they had done well under the circumstances.\n\nThe meeting adjourned without further ado.\nHAPPY NEW YEAR:\n\nThis morning we usher in the new year, 1886. May it be a happy one, indeed! The Farmers' Advocate Pioneers for all its readers. In the ending of the old year and the advent of the new, a notch is marked in the ever revolving wheel of time. By it we should realize the fleeting nature of our days, and they are rapidly passing through a period of account. This thought will not be a sad one, if we have endeavored to spend rightly the year that is now drawing to a close. Nevertheless, we may feel that we have not done as well as we might, but the good resolve and the right determination for the new year, will send a glow of real happiness through every part of our hearts, and give a joy that will not be lessened by the thought of regret. Whatever the past may have been, the new year before us will be just what we make it. The Progress is determined to help on the most beneficial and harmonious prosperity of its readers, and its hearty wish again is that all may have\n\nA HAPPY NEW YEAR.\n\nTHE FARMERS UNION AND THE C.P.R.\n\nThe Farmers Union of Manitoba has become a remarkably dependent institution. At its inception it was looked upon as a good movement, and the best men of the country gave it their support. The publication of this paper was at one time on the point of establishing a newspaper in its interests, but being entirely committed himself, saw that there was no advantage in doing so, and therefore abandoned the plan. Mr. J.W. Astley has written a letter to the Toronto Mail which goes to show that Riel was not exactly a disinterested patriot, Mr. Astley says: \"What made me sit down and write this letter to you, sir, you will shortly discover why 'who is a splendid critic.' How could he direct his attention to the action of the Subd. Board, or put his shoulder to the plough, when he could see that the Union had become a mere tool of the government? And again, when he thought about striking my life for his especial benefit in carrying out his message to God and Mankind, during the Battle of Red River, he told me not to mention the matter to anyone, and said he would do what I could for him about the same thing. If I mentioned the people's claims it might weaken anything I might do for him.\" This, with the $25,000 demand, would pretty well remove all further pretense over the hanging of Louis Riel.\n\nMedicine Hat Times Judge Travis' course is commendable by the respectable portion (by no means the smaller portion) of the community. He was sent to Calgary for the purpose of maintaining the dignity and giving effect to the law of the Territories. In every instance his action will bear the closest scrutiny and reveal that he has not been swayed by personal feelings or the public attractions of such persons as Bleeker, Davis, and men of that ilk, to harm. We are sanguine the beneficent effects of Judge Travis' residence in Calgary will be felt throughout the district, and those who persist in acting as \"barbarous savages\" will be forced to take themselves beyond his ken. Success attend you, Judge Travis, in the wish of the Medicine Hat Times.\n\nCorrespondence,\n\nATTAINED ITS MAJORITY\n\nTo our readers who use agriculture as an art to be followed by the light of intelligence rather than superstition, we say, for their encouragement, that the Farmers' Advocate and Western Home Magazine. This journal, which was first edited in 1879, is now in its seventh year of publication, and is the organ of the Farmers' Advocate, which is the leading agricultural journal in Canada. It is published weekly, and contains a large amount of valuable and entertaining reading matter. The annual subscription is free to applicants.\n\nCONSUMPTION CURED\n\nAs all physicians, resident in Canada, are aware, there is a great demand for a remedy for consumption. The following recipe is given by Dr. J.M. Macdonald, of Montreal, and is said to have been used successfully by him in many cases. It is as follows:\n\nTake two cups of milk, half a cup of sugar, and a pinch of salt. Boil the milk until it is thick, then add the sugar and salt, and boil for five minutes longer. Take off the fire and let it cool. Drink this mixture three times a day, and soon you will find yourself recovering from consumption.\n\nA BUFFALO HUNT\n\nA Great Hunt Chased Hundred Miles into Montana by Buffalo Hunters.\n\nPeople (Montana X.Y.S. No. 6)\n\nMontana, Dec. 31, 1885.—Buffalo hunters, who were surprised the other day when they heard a herd of buffalo running, rushed out to see what was going on. They discovered a herd of buffalo running away from them, and the animals appeared to be well run. The hunters chased the buffalo, and finally cornered them near the banks of the Missouri River. The hunters then loaded their guns and started for home, having killed several hundred buffalo.\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPHELLE.\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\nPROPRIETORS\n\nFURNITURE, FURNITURE\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\nTHE\nQu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSIX PAGES, THIRTY COLUMNS.\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE\nBook & Job Printing\nDEPARTMENT\nELECTIC\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY\nNORTHWEST COUNCIL\n\nRegina, Dec. 16.—His Honor took the chair at 2 o'clock p.m.\n\nMr. Jelly presented a bill to amend ordinance No. F. 1883, intitulated “An ordinance relating to persons suffering from certain physical defects.”\n\nThe special committee appointed to consider this bill recommended the payment of $50 to Mr. James Hart, Regina, as compensation for exhibiting, for destroying five animals under the ordinance of 1884. Mr. Jelly stated that he could not collect the money from the owners of the animals destroyed.\n\nOne day Mr. Jelly did not take the collected compensation. Mr. Jelly.—He didn’t say.\n\nMr. Hooper wished for legal remedies, but Mr. Jelly contended that he would not expect a cent from the people whose animals were destroyed.\n\nHis Honor.—The ordinance requires to be read.\n\nAt this point Mr. Hooper wished for an immediate vote by every surgeon present in the council.\n\nThe committee resolved that resolutions for amendments to resolutions Nos. 1879 and 1877 be sent to Ottawa through Mr. Justice Eburne. The judge preferred a resolution for the late publication of Justice Eburne regarding the election results.\n\nThe House then adjourned until Tuesday morning.\n\nJUDGEMENT\n\nJudge Moore delivered his opinion on Mr. Markland’s charge against him. Mr. Markland was charged with assault and battery of Mr. Moore. Mr. Markland was found guilty and fined $5.\n\nThe House then adjourned until Tuesday morning.\nRapid City Ripples.\n\nD. McNaughton, V.S., who has heretofore acted as district veterinarian for the counties of Rapid City, Red River, Birtle, St. Vital, Souris Lake and Russell will in future act for the counties of Morden and Hilda.\n\nTo get the best hot coffee for the holidays everybody should use Lyman's Extract of Coffee which is the finest coffee extract ever made. It is the easiest to use and can be served up piping hot, in a moment. We wonder why more than the Great Medal Favorite Essences are unrivaled for purity and strength.\n\nThe sequel to the shooting accident that occurred on the Red River a short time since at the hands of the victim, Mr. Alex. Boich, who was well known for winning as a contractor and builder, about three months since he married a Miss McNaughton, daughter of Mr. McNaughton, the little matchstick maker, Rev. Mr. Best performing the ceremony. It appears that he was killed by a gun from the hands of his wife. It exploded the charge entering his arm. Not having an opportunity to have it properly attended to, his whole system soon became affected with the foregoing result.\n\nSafe From Intrusion.\n\nJames: \"Has Ever been here again?\"\n\nSmith: \"Yes, he made a great noise when he came back and I thought he was going to break something.\"\n\nJones: \"I'm sure he would be able to do so if he had any chance.\"\n\nSmith: \"Well, of course it would be hard for him to have a shot at his own square which nobody ever thinks of doing. But he has dropped in here twice now.\"\n\nJames: \"He wants play do you think?\"\n\nSmith: \"That's what I thought. He had a lot to say.\"\n\nJones: \"A story might be told by his remarks.\"\n\nSmith: \"I'm sure he would be able to do so if he had any chance.\"\n\nOne day recently Henry Bishop, a young man of thirty, lost a watch while playing cards at a gaming table. He immediately gave chase and found the other part but it also contained the watch.\n\nThe cause of all these cases is carried out through the streets of the city.\n\nGRAND COLONIAL EXHIBITION\n\nIn London, England, 1886.\n\nFORTY-FOUR THOUSAND FEET RESERVED FOR CANADA.\n\nFirst Royal Visit to Canada.\n\nThe COLONIAL EXHIBITION will be held in LONDON, England, commencing on the 23rd July next, and will continue for six months. It will consist of a great exhibition of manufactures, having for its object the advancement of commerce and industry throughout all parts of the British Empire.\n\nIn order to give greater significance to the event, His Royal Highness the Prince of Wales has been appointed President of the Exhibition Committee.\n\nThe very large number of 34,000 square feet has been set aside for Canada, under the personal direction of His Excellency the Governor General.\n\nThe Exhibition is to be purely Colonial, and will be a great opportunity for the United Kingdom or from delegations will be received from every part of the Empire.\n\nThe grandest opportunity ever offered to Canada will be given to show the world what Canada can do.\n\nAll candidates of all nations and classes may enter their goods and compete with each other in exhibiting them on this great occasion. The Exhibition will be the greatest ever held in the British Empire, and will establish Canada's position as a great manufacturing nation.\n\nQUEEN'S HOTEL\n\nRapid City.\n\nGOOD BOARD AND STYLING.\n\nTHOS. HUDELL Prop.\n\nMRS. D. BUTCHART\n\nWishes to announce she is prepared to accommodate the traveling public with Meals and Lodging\n\nAND STYLING.\n\nSpecial offers\n\nWebster's Practical Tailor\n\nNext Door to Standard Office,\n\nRapid City.\n\nDavid Butchart\n\nTailor\n\nNew Style Made, Repairing and Cutting done on the above model.\n\nHow to Make a Cup of Excellent Coffee\n\nAt a Moment's Notice Anywhere.\n\nUse Lyman's Concentrated Extract of Coffee.\n\nPrepared by a Novel and Scientific Process.\n\nCHOICE SELECTED COFFEE\n\nFreshly roasted and ground expressly for this purpose, and thoroughly UNSWEETENED in every case, and FLAVORED to be the BEST wherever used.\n\nFor Sale by Grocers & Druggists\n\nIn 1 lb., 4 lb. and 1 lb. bottles.\n\nTrial Size 5 cents a Bottle\n\nFull directions with each bottle.\n\nTHE NEW RAYMOND SEWING MACHINE\n\nFOR FAMILY USE.\n\nHIGH ARM HIGH FINISH.\n\nGentle, Quick, Luxurious.\n\nAutomatic Bobbin Winder.\n\nCHAS. RAYMOND,\n\nGuelph, Ontario.\n\nCREELMAN BROS.,\n\nGeorgetown, Ont.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14th YEAR OF PUBLICATION 14th.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Premiums and Grand Prize Scheme.\n\nOver $1,400 worth of Handsome Prizes to be given away.\n\n100 Splendid Prizes.\n\nBalance of 1885 PRIZE. Only $2 to $207.\n\nTHE GREATEST OFFER YET MADE.\n\nHOW TO SUBSCRIBE.\n\nEnclose a stamped registered letter writing name and postage very plainly and address to:\n\nFREE PRESS, WINNIPEG, MAN.\nWOLFESEYE.\n\n—Mr. W. D. Peeler, N. W., C., and Mrs. Peeler visited Regina City this week.\n\nA very successful social was held last Friday night at Mrs. O'Connell's residence, on Molefield Street. The ladies' division was a joyful one, and the children had a picnic in the afternoon.\n\n—The gentlemen will call on their lady friends today.\n\n—A choral society is in process of being formed here.\n\n—Who will not make mistakes in drafting their letters for the next week.\n\n—Eight pairs of evening shoes have just shipped from Toronto for the children.\n\n—Private Pacer of B Battery has brought out his discharge and has taken his leave.\n\nThe machinery of D. H. McMillan & Co.'s mill is now nearly all in place and in running order, and foundlings will commence next week.\n\n—Mr. H. Francis, of Grenville, should get his receipt of trust gift from the Christmas tree, but if he will call at this office he can get it.\n\n—Yr. H. R. Cassell has engaged a first class tailor to carry on a tailoring department in connection with his business, thus supplying a long felt want here.\n\nA public meeting will be held in Mr. Mcmillan's hall on Tuesday next, for the purpose of considering this section the accounts and reports of the public school for 1885.\n\n—The skating rink will be open throughout Friday 2 till 6 p.m. and in the evening from 7 to 10 o'clock. The rink will also be open every afternoon after school hours and learns an opportunity for recreation.\n\n—Mr. J. B. Davidson, R. A., recently principal of the Galt Institute of Art, will give a drawing class in the morning at Brighton School, where he will enter the mission work in the interest of the Presbyterian church.\n\n—Two discs of MAGIC MIRROR AND MESSAGE—Prof. Wyman will appear at the Oriental Building next Monday evening. The entertainment given by the Professor is highly recommendable on account of its novelty. We hope for a most hearty reception.\n\nMRS. MIKANSON, a native of Russia, who is recovering from an attack of appendicitis, has just received a letter from the writer of one of the finest newspapers of Europe, expressing herself in decided eulogies of her personal appearance. Mrs. Mikanson immediately sent her a supply of food.\n\nTEA AND ENTERTAINMENT.\n\nThe tea goes under the auspices of Mrs. F. E. Hickey. For some time past we have never had the pleasure of attending. The oysters were delicious and the bread and the tables were loaded down with everything the most fastidious could desire. The ladies who assisted us in the preparations deserve great credit for the very excellent entertainments which they furnished, and we say \"well done\" in behalf of the tea, when we say that upwards of one hundred and fifty sat down to taste. The ladies who presided in the Hudson's Bay store, and all who had partaken, they are missed.\n\nBuilding, where the following good program was remarkably well run—directed by Mr. Hamilton, along nicely filled by Rev. Mr. Hamilton,\n\n1. Choir—Wed. Apologetics (Ges.)\n\n2. Band—Miss Jennie S. Smith, Miss Hamilton, Miss Smith, Miss Tyler, Miss Smith, Miss Hamilton, Miss Smith,\n\n3. Song—Miss Smith, Miss Smith,\n\n4. Band—Miss Smith, Miss Smith,\n\n5. Sing—Miss Smith, Miss Smith,\n\n6. Address by Rev. Mr. Hamilton—Miss Smith,\n\n7. Recitation Address by Rev. Mr. Hamilton—Miss Smith,\n\n8. Essay by Rev. Mr. Hamilton—Miss Smith,\n\n9. Sermon by Rev. Mr. Hamilton—Miss Smith,\n\n10. Essay by Rev. Mr. Hamilton—Miss Smith,\n\n11. Band—Miss Smith, Miss Smith,\n\n12. Recitation—Miss Smith,\n\n13. Essay by Rev. Mr. Hamilton—Miss Smith,\n\n*STAFF.*—Presiding Officer—Rev. Mr. Hamilton; Musicians—Miss Smith, Miss Smith, Miss Smith, Miss Smith; Organ—Miss Smith, Miss Smith; Drums—Miss Smith, Miss Smith; Hymns—Miss Smith, Miss Smith; Gospel—Miss Smith, Miss Smith.\n\n13. Band—Miss Smith, Miss Smith;\n\n14. Sermon by Rev. Mr. Hamilton—Miss Smith,\n\nS. MUSY.—Miss Smith, Miss Smith, Miss Smith, Miss Smith;\n\n15. Song—Miss Smith, Miss Smith,\n\nAt the close of the以上内容没有结束", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886010101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 5293, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4996, 1], [4996, 9804, 2], [9804, 10879, 3], [10879, 12307, 4], [12307, 17016, 5], [17016, 20957, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]