[{"id": "159968db39c7f066fa0f9e4f396e02d91aed0a1f", "text": "With Your Advertisement Space\n\nOur Rates:\n\nSubscription Rates:\n- $1 per year for 4 months\n- $2 per year for 8 months\n\nDisplay Rates:\n- Half Page: $5\n- Quarter Page: $3\n- Third Page: $6\n- Full Page: $10\n\nThis offer is available to everyone.\n\nThe Northwest Council\n\nThe session of the Northwest Council just closed, has been of such importance that it deserves close attention in every district. The purpose of this report is to present an overview of what is going on and to address how we can all contribute to making this organization successful.\n\nScience, invention, and capital have come together in the advancement of human life, especially as it pertains to illumination. The lesson has been learned that the union of science and industry is essential. The electric light is now being used in an innovative way to improve our lives. This new form of power offers endless possibilities for progress.\n\nThere is no question that the Indians and their rights should be protected. They have not hesitated in their duty to their constituents, and have very continually represented the almost unanimous views of the people of the territories. In most instances, they have done so successfully, and their views have been given the necessary attention.\n\nThere are those who believe that the responsible head of state may be termed an irresponsible Government, if it can indeed be properly called a Government at all.\n\nThe small nation taken by the English lawless instigators to the south, it is believed by the friends members of the Council in its direct opposition to that paper's previously boasted championship of the settlers' rights. It is enough to make the reader think that in the hearts of the members there is nothing but misguided zeal.\n\nOne of the lowest types of the race when it comes to action as far as Europeans is concerned, Mr. Baldwin has never been known to make any compensation whatever to the public or the community at large.\n\nPoveshell Springs\n\nOne of the oldest depots of the nation is the Poveshell Springs Station, near Poveshell, Va., and is known to be a comparatively serene means of illumination that has been employed to great advantage. This spring system is highly regarded as effective.\n\nIn conclusion, the speaker urges the audience to reflect on the importance of supporting the efforts of those who work tirelessly to ensure the well-being of our communities.\nOUR TERMS.\n\nWe have placed our yearly subscription at $1.00 per year, in lieu of our dollar, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every paper goes out is paid for, than if we took the risk of collecting nothing but at a higher figure. Besides we will thus speedily secure a larger circulation, which will enhance the value of our advertising columns. So don't forget to send your name and dollar, and get your number to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingles and Double Rigs for Hire.\nFreighting a Specialty\nAll Kinds of Coal\nKeep Constantly on Hand at the Lowest Prices.\nOats Sold for Horses & Stables\nQU'APPELLE.\n\nL.W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\nFor First Class Pigs.\nDaily Rail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\n\nHarnessmaker.\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public that he has been engaged for many years as Agent for the Largest & Best Assorted Stock West of Brandon.\nConsisting of Harnesses, Saddles, Whips, Bells, Blankets, Cribbings, Combs and Brushes.\nAll Kinds & Sizes of Trunks and Valises.\nAgent for Carriage & Duggy Tops.\nRemember the Flag.\nPioneer Harness Shop\nQU'APPELLE.\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON FORWARDERS.\n\nAnd Dealers in Lumber, Lath, Shingles\nTack, Sash\nBuilding Paper, etc.\nOffice West of P.R. Station.\nQU'APPELLE.\n\nA. S. EMPEY,\n\nDealer in General Merchandise.\n\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\nAnd Dealer in Flour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSpecial Prices on Wholesale Lots.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION:\nLove & Raymond,\nProprietors.\nRebuilt, Enlarged, Renovated. Everything New and First-Class Throughout.\nSuits for Families.\nTerms Moderate.\n\nS. H. CASWELL,\n\nGeneral Store.\n\nBANK,\n\nPOST OFFICE,\n\nTROY, N.W.T.\n\nThe Canada North-West Land Co. (Limited)\n\nOffer for Sale\n\nSELECTED FARM LANDS\n\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line.\n\nA large proportion of this Company's Lands lie in sections entitled Districts.\nFor Information, Prices and Maps, apply at the offices of the Company, 14 Castle Street, Edinburgh, Scotland; 12 London Street, London, England; or at the offices of the Company, Winnipeg, Manitoba.\n\nW. B. SCARTH,\nManaging Director, Fort Qu'Appelle.\n\nCanadian Pacific Railway Town Lots.\n\nThe 1000 City Tractees Offer for Sale\nBuilding Sites at all Stations on Main Line of above Railway between Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESLEY GORDON.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\nBoots & Shoes, Gents' Furnishings,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nIN THE TOWN OF QU'APPELLE:\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\n\nProprietors\n\nFURNITURE, FURNITURE.\n\nHAVING LATELY SECURED Two Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\n\nIS PUBLISHED Every Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\n\nSIX PAGES. THIRTY COLUMNS:\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Boot & Job Printing Department\n\nEXECUTES Every Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nNORTHWEST COUNCIL.\n\nBegining Dec. 8—His Honor took the chair at 2 p.m.\n\nMoved by Mr. Judge seconded by Dr. Wilcox and carried: That the order for the expressing of the bill respecting the medical Profession be discharged; that the same be referred to a committee of the whole council for the purpose of striking out Clause (a) so soon as it is deemed proper, and in lieu thereof the following: \"All persons at the age of the passing the medical examination in the Northwest Territories, and who have for the period of one year prior to such passing been engaged in medical practice, surgery, midwifery, etc., and who possess a medical degree conferred by or received from any University or College in the United States of America, whose curricula demands at least two years of medical study, including surgical lectures, provided such University or College authorized by law to grant such degree, diploma be allowed to enter under the present Ordinance.\"\n\nMr. Perley said there was an excellent man in this place (Nashville), who held a diploma from New York City. This would prevent him from entering under his clause, he considered it a hardship. (Hear, hear.)\n\nJudge Richardson asked was Mr. Perley's friend a naturalized British subject. The reason he asked the question was because the naturalized British subjects were required to become naturalized American citizens before they were allowed to practice medicine. Mr. Perley thought it was right that they should pass a similar clause. (Hear, hear.)\n\nMr. Jackson moved to strike out the Dominion commissioner, asked to be allowed to reply to Mr. Jackson's false accusations. Mr. Jackson replied Mr. Reed's accusations were based on mere rumor, and his speech was not fair. Mr. Jackson clearly showed he was unaware of the part of the bill proposed by Mr. Appelton against the Dominion Department. Mr. Jackson said he was present. What were called rumors on Friday evening were thereafter withdrawn. He had no idea they were termed \"facts.\" He denied that Mr. Reed had used the alleged facts to harm Mr. Jackson in his attacks on Carlton physicians, and laughed at the idea of Indiana doctors doing their designing. Mr. Jackson then spoke of how little Mr. Jackson knew of Indian matters. The Crooked Lake Indians, he said, were not Indians, but were an alien breed of outsiders under \"Yellow Chief,\" who, instead of working for themselves, depended on others for their living. When Col. Hartshorne took the ring-leader prisoners, he found 320 on one stockade. Mr. Jackson said Colf had twenty legs of flour at the mill. These were Mr. Jackson's \"starches.\" Mr. Jackson read the report of Mr. A. Macdonald, Inspector General, showing that the flour supplied by Colf was adulterated. Mr. Reed said \"No suspicion\" is not the \"man fleum\" spoken of in the summer, and the petition of Mr. Jackson was of the best quality. Mr. Jackson was alluded to by Mr. Jackson. If rumors were true, he could give a rumor not very creditable to the hon. member for Qu'Appelle. (Hear, hear.) Tell it.\n\nMr. Reed: I say it is that you are trying to turn the Lieutenant-Governor out of his post of Indian Commissioner in order to get it yourself. (Laughter.)\n\nMr. Jackson: I deny the rumor. I want to appeal to the Governor of the Northwest Territories, much less that of Indian Commissioner.\n\nMr. Reed denied that he had during his recent visit north cut down the influence of the Indians. He admitted that he had not done so on occasion.\n\nMr. Jackson: What have you done to the Indians who were massacred in the late rebellion?\n\nMr. Reed: We are on our own reservations, and the Indians are.\n\nThe subject was then dropped.\n\nThe house went into committee of the whole on the civil judge's ordinance. Judge Richardson in the chair.\n\nSome amendments were passed and Col. McLeod rose to report progress and report the bill amended.\n\nJudge Richardson called for the amendments to come to the floor for consideration. He also moved that the bill be engrossed. Carried.\n\nCarried. The committee of the whole on the bill relating to the medical profession, Mr. Scovell moved that the bill be referred to a committee of the whole council for the purpose of striking out Clause (b) so soon as it is deemed proper, and in lieu thereof the following: \"All persons at the age of the passing the medical examination in the Northwest Territories, and who have for the period of one year prior to such passing been engaged in medical practice, surgery, midwifery, etc., and who possess a medical degree conferred by or received from any University or College in the United States of America, whose curricula demands at least two years of medical study, including surgical lectures, provided such University or College authorized by law to grant such degree, diploma be allowed to enter under the present Ordinance.\"\n\nMr. Perley said there was an excellent man in this place (Nashville), who held a diploma from New York City. This would prevent him from entering under his clause, he considered it a hardship. (Hear, hear.)\n\nJudge Richardson asked was Mr. Perley's friend a naturalized British subject. The reason he asked the question was because the naturalized British subjects were required to become naturalized American citizens before they were allowed to practice medicine. Mr. Perley thought it was right that they should pass a similar clause. (Hear, hear.)\n\nMr. Jackson moved to strike out the Dominion commissioner, asked to be allowed to reply to Mr. Jackson's false accusations. Mr. Jackson replied Mr. Reed's accusations were based on mere rumor, and his speech was not fair. Mr. Jackson clearly showed he was unaware of the part of the bill proposed by Mr. Appelton against the Dominion Department. Mr. Jackson said he was present. What were called rumors on Friday evening were thereafter withdrawn. He had no idea they were termed \"facts.\" He denied that Mr. Reed had used the alleged facts to harm Mr. Jackson in his attacks on Carlton physicians, and laughed at the idea of Indiana doctors doing their designing. Mr. Jackson then spoke of how little Mr. Jackson knew of Indian matters. The Crooked Lake Indians, he said, were not Indians, but were an alien breed of outsiders under \"Yellow Chief,\" who, instead of working for themselves, depended on others for their living. When Col. Hartshorne took the ring-leader prisoners, he found 320 on one stockade. Mr. Jackson said Colf had twenty legs of flour at the mill. These were Mr. Jackson's \"starches.\" Mr. Jackson read the report of Mr. A. Macdonald, Inspector General, showing that the flour supplied by Colf was adulterated. Mr. Reed said \"No suspicion\" is not the \"man fleum\" spoken of in the summer, and the petition of Mr. Jackson was of the best quality. Mr. Jackson was alluded to by Mr. Jackson. If rumors were true, he could give a rumor not very creditable to the hon. member for Qu'Appelle. (Hear, hear.)\n\nMr. Reed: I say it is that you are trying to turn the Lieutenant-Governor out of his post of Indian Commissioner in order to get it yourself. (Laughter.)\n\nMr. Jackson: I deny the rumor. I want to appeal to the Governor of the Northwest Territories, much less that of Indian Commissioner.\n\nMr. Reed denied that he had during his recent visit north cut down the influence of the Indians. He admitted that he had not done so on occasion.\n\nMr. Jackson: What have you done to the Indians who were massacred in the late rebellion?\n\nMr. Reed: We are on our own reservations, and the Indians are.\n\nThe subject was then dropped.\n\nThe house went into committee of the whole on the civil judge's ordinance. Judge Richardson in the chair.\n\nSome amendments were passed and Col. McLeod rose to report\nRapid City Ripples.\n\n—A big blaze took place here on the 16th inst. The block consisting of Hewitt's livery stable and D. Maxwell's implement works, were totally consumed by fire. All the horses and everything stored in the building was saved. Loss $1,400. The fire was caused by the explosion of the fireman's pipe from the stove or pipe of the office of the stable, which had been left burning when it started. The lot being full of hay the buildings of frame, and the wind from the east, carried a large amount of combustible fuel done for years, went up into smoke with remarkable rapidity.\n\n—Hon. Mr. Norquay returned last week from his trip West. During his absence he visited New York, Washington, and other American cities, and made an satisfactory arrangement on behalf of the Government in connection with the proposed telegraph line from Manitoba Southern and Manitoba Northwestern railway companies. Mr. Norquay visited Toronto last week, and the North-west Central railway, Mr. Beatty, the president of the company, has been here for some days. He met a New York capitalist, with a view of getting the work started at once. It appears that Mr. Beatty expects to have Mr. Norquay meet this capitalist and explain to him the nature of the work to be done where the road is to pass in addition to the character of the land grant to be given in return for the same until the road is laid. His opinion is that the old adroide of obstruction Mr. Norquay met the capitalist, who states that he has never been able to get anything done, and who says that he will not be able to build the road and will use it for that purpose if negotiations can be arranged to his satisfaction.\n\nWhat he desires is that the land grant be located, or at least the locality where it will be located, so that the line may be built without any further delay. Mr. Norquay also wants an assurance that the line on his side of the Red River will be completed by the old Southern and Northern railway companies, should be removed by the present company. Mr. Norquay says the capitalist is willing to make a promise with their condition, if possible by including them in connection with the line being built. He says that the capitalist who holds the first 50 miles under a new organization, will be willing to take the line, and if so that the line will be pushed as far as graded should come in. The New York capitalist will agree to do this, but Mr. Norquay says he was led by the press to understand that negotiations had already been taken place with a view to doing this.\n\nMr. Norquay says Mr. Norquay thinks the capitalist will not only willing, but anxious to build the road if a satisfactory contract can be made.\n\nRevival in Bathurst Town.\n\n—The following statement illustrates the manner in which persons suffering from nervous disorders are cured during a religious revival. A man was struck in the head with an axe while working in a sawmill, causing the loss of sight in one eye. He was in an extremely nervous state, and the nearest town was sixty miles distant, and there were no doctors within forty miles in any direction. His time was divided between sleepless nights and stages. The man by this time was very weak, and his nerves showed very little chance of recovery. The doctor said an operation would be necessary to save his life. He waited several hours, thinking that the man would die, but he did not. Things did not turn out as he expected, but the man recovered. The doctor then told him the trouble of eyes was nothing compared to what he had been suffering. The man started home.\n\nThe next day a revival was held in the town, and the man took into his house and got well and his sight came back entirely. The miraculous healing of the man was attributed to the prayers of the minister, who claimed that the prayers of the man cured him. The man was convinced that he was really dead and was brought back to life by the prayers of the minister.\nHOME & GOSSIP.\n\nQU'APPPELLE.\n\n—Mild.\n—Thawed yesterday.\n—Qu'Appelle party tonight.\n—The nomination of councillors will take place this afternoon.\n—Mayor Johnson & Gorrell's ice rink will be opened tomorrow night free to all.\n\nMr. E. W. Warner has purchased an estate from Mr. Alf Pughley, Qu'Appelle.\n\nIt is understood the Qu'Appelle Curling Club will receive an invitation to the St. Paul winter carnival.\n\nRevd. Mr. McTavish, former rector of St. John's Church, of this place, has received and accepted a call to Chateau, Sask.\n\nIt is reported that the Qu'Appelle District Court will meet here on the 14th of January and sit at Fort Qu'Appelle as heretofore.\n\nMr. T. T. Thompson, of this town, at the request of the electors, has nominated himself a candidate for the office of councillor of this municipality.\n\nMr. and Mrs. F. L. Oiler have been away for a trip to Tarataria, Miss Kilman, who has been spending the winter here, accompanied them.\n\nMr. F. L. Oiler reports to us that the Rev. Mr. F. L. Oiler's homestead half 32, 18, 14a, for $1800, a pretty good figure for a half section of farm land in this country.\n\nG. B. Murphy has gone east to Portage du Fort Out. As usual when single or handsome gentlemen make such trips they fear they will not return as they went.\n\nMr. Robt. Kersten, who went from here back to Ontario a few weeks ago, returned from the east; he says times are dull there, if anything worse than he left them three years ago.\n\nWe regret to learn the death of the Rev. Mr. Livingston, Presbyterian Missionary at Broadview. He died at his home in Broadview on Tuesday, from an attack of chloroform. He leaves a wife and two children.\n\n—J. V. Andrews, who figured conspicuously all through the North-West rebellion, and who was present at the battle of Red River as a spiritual adviser, was killed there the other day. He was about to start for Red River with Prince Albert.\n\n—A big crowd came out to see the tree entertainment to be held Saturday night at the Methodist church in connection with the Sunday School Exhibition. The committee requested all to take advantage of the opportunity afforded for exchanging presents. It was arranged that each person or office will be placed on the tree for delivery to the intended recipient.\n\n—Last Friday morning at 9 o'clock the North Qu'Appelle Municipality, and $700 to the Rev. Mr. Qu'Appelle. This is the worth of the comparison between the two will be greatly enhanced.\n\nWe have taken instances near the line between the two municipalities, and find on the north side of the line a half section paying $250 to $300, a half section with no less value than a quarter section of land paying only $74.25. How is that accounted for between an extravagant and a conservative?\n\nEleven File Hill bears were up before Judge Richard's last week amongst with four stolen last May. They were sentenced to one month's imprisonment.\n\nThe eleven named Tipps-couched. Are they going to be punished? This Indian had shayed the name and tail of his stolen horse. Judge Richard's decision is against the prisoners. The reason for the light sentence was because the time was one day late. If the owner all the property was recovered a fine would be imposed.\n\nCorrespondence.\n\nTo the Editor:\n\nSir: As this neighborhood grows increasing it is time that the inhabitants should be on the alert and see how they can bring themselves forward sympathizing with their neighbors. For Qu'Appelle to take part in the promotion of an annual fair or cultural show. To do this I imagine in a though way it would be a good thing surely to all sections of the inhabitants interested in the subject (and we all ought to be) to take the present Indian Head and send in the present Indian Head and Qu'Appelle Agricultural Society, which is becoming important, attend the next meeting of the society when a motion will be brought forward by me to make the fair an annual event to be held triennially. First, the land at Houlton is Qu'Appelle Station. Such a fair would be better to have been large and well attended and was in alternate years than three small shows each year. The price paid at the fair would certainly convince that people would find it worth while to attend from near and far. The Indians and the inhabitants of each town would in turn have an opportunity of seeing their neighbors and perhaps bartering and trading freely amongst each other. I shall be glad if any of your readers would bring this suggestion up at the next meeting or some such thing could be done to carry it into effect.\n\nW. S. BURRIT,\nQu'Appelle, Dec. 17th, 1885.\n\nPUBLIC MEETING\n\nTo the Editor:\n\nSir: Allow me to give you a short account of the proceedings which took place at a large and interesting meeting held at \"Paul Bunyan\" on Tuesday evening last. At 7:30 p.m., Mr. John Lawton delivered an address followed by musical greetings on each occasion. Being a man of high moral standing, Mr. Lawton elevated the standard of society and whose influence is a power in the minds of those who are devoted to the cause, kind and helpful.\n\nI then thanked them for their attention and asked for a brief but hearty speech. Each of the object of the meeting, the importance of the cause, the manner in which we should help one another, and the manner in which we should treat our neighbors. It was suggested that a resolution be adopted that every member of our church be invited to participate in the services of the church and that prayers be offered for the success of the cause. We adjourned to meet again at 8:30 p.m., the music being continued until the close of the meeting.\n\nIndian Head.\n\nMcMillan Bros. are very active in the wheat market. They have already sold 30,000 bushel and still buying.\n\nThe English Church people of St. Charles are talking of holding an entertainment in connection with the church which was recently dedicated by the Bishop.\n\nIndian Head can boast of one of the most enterprising men in the district. Mr. J. F. McCann, unlike the ordinary genius of his distinguished calling, keeps on hand a large stock of goods for the delectation of the poor.\n\nIt would seem as though he anticipated the loss incurred by the sale of a few weeks ago, as he has now formed the number of tenants paying.\n\nOne thing badly needed here is a school. No interest can be found among the young people for education.\n\nAs for our scholastic advancement, however, our boys are doing fairly well. Our Indians possess which abound throughout our country. Some say it is the result of their own doing, others that they are the product of a peculiar characteristic of our community, but a more probable cause is the presence of the Roman Catholic priests, the Bell Farm.\n\nCorrespondence.\n\nThe columns are open to all persons interested in the affairs of the district. Letters should be addressed to the Editor.\n\nTo the Editor:\n\nSir: As this neighborhood grows increasing it is time that the inhabitants should be on the alert and see how they can bring themselves forward sympathizing with their neighbors. For Qu'Appelle to take part in the promotion of an annual fair or cultural show. To do this I imagine in a though way it would be a good thing surely to all sections of the inhabitants interested in the subject (and we all ought to be) to take the present Indian Head and send in the present Indian Head and Qu'Appelle Agricultural Society, which is becoming important, attend the next meeting of the society when a motion will be brought forward by me to make the fair an annual event to be held triennially. First, the land at Houlton is Qu'Appelle Station. Such a fair would be better to have been large and well attended and was in alternate years than three small shows each year. The prize paid at the fair would certainly convince that people would find it worth while to attend from near and far. The Indians and the inhabitants of each town would in turn have an opportunity of seeing their neighbors and perhaps bartering and trading freely amongst each other. I shall be glad if any of your readers would bring this suggestion up at the next meeting or some such thing could be done to carry it into effect.\n\nW. S. BURRIT,\nQu'Appelle, Dec. 17th, 1885.\n\nPUBLIC MEETING\n\nTo the Editor:\n\nSir: Allow me to give you a short account of the proceedings which took place at a large and interesting meeting held at \"Paul Bunyan\" on Tuesday evening last. At 7:30 p.m., Mr. John Lawton delivered an address followed by musical greetings on each occasion. Being a man of high moral standing, Mr. Lawton elevated the standard of society and whose influence is a power in the minds of those who are devoted to the cause, kind and helpful.\n\nI then thanked them for their attention and asked for a brief but hearty speech. Each of the object of the meeting, the importance of the cause, the manner in which we should help one another, and the manner in which we should treat our neighbors. It was suggested that a resolution be adopted that every member of our church be invited to participate in the services of the church and that prayers be offered for the success of the cause. We adjourned to meet again at 8:30 p.m., the music being continued until the close of the meeting.\n\nIndian Head.\n\nMcMillan Bros. are very active in the wheat market. They have already sold 30,000 bushel and still buying.\n\nThe English Church people of St. Charles are talking of holding an entertainment in connection with the church which was recently dedicated by the Bishop.\n\nIndian Head can boast of one of the most enterprising men in the district. Mr. J. F. McCann, unlike the ordinary genius of his distinguished calling, keeps on hand a large stock of goods for the delectation of the poor.\n\nIt would seem as though he anticipated the loss incurred by the sale of a few weeks ago, as he has now formed the number of tenants paying.\n\nOne thing badly needed here is a school. No interest can be found among the young people for education.\n\nAs for our scholastic advancement, however, our boys are doing fairly well. Our Indians possess which abound throughout our country. Some say it is the result of their own doing, others that they are the product of a peculiar characteristic of our community, but a more probable cause is the presence of the Roman Catholic priests, the Bell Farm.\n\nCorrespondence.\n\nThe columns are open to all persons interested in the affairs of the district. Letters should be addressed to the Editor.\n\nTo the Editor:\n\nSir: As this neighborhood grows increasing it is time that the inhabitants should be on the alert and see how they can bring themselves forward sympathizing with their neighbors. For Qu'Appelle to take part in the promotion of an annual fair or cultural show. To do this I imagine in a though way it would be a good thing surely to all sections of the inhabitants interested in the subject (and we all ought to be) to take the present Indian Head and send in the present Indian Head and Qu'Appelle Agricultural Society, which is becoming important, attend the next meeting of the society when a motion will be brought forward by me to make the fair an annual event to be held triennially. First, the land at Houlton is Qu'Appelle Station. Such a fair would be better to have been large and well attended and was in alternate years than three small shows each year. The prize paid at the fair would certainly convince that people would find it worth while to attend from near and far. The Indians and the inhabitants of each town would in turn have an opportunity of seeing their neighbors and perhaps bartering and trading freely amongst each other. I shall be glad if any of your readers would bring this suggestion up at the next meeting or some such thing could be done to carry it into effect.\n\nW. S. BURRIT,\nQu'Appelle, Dec. 17th, 1885.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1885121801.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 6881, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2398, 2], [2398, 6277, 3], [6277, 13972, 4], [13972, 17927, 5], [17927, 29728, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]