[{"id": "31d492a126a5ff250e6c275ca611a159fc295dff", "text": "The Western War Works.\n\n\"The lack of proper means that is usually brought upon working men by the failure to provide them with sufficient food, clothing, shelter, and medical care, is a constant source of worry and concern. It is difficult to imagine how much more difficult it would be without these basic necessities. The women who have been forced to work in these conditions have faced many challenges, but they have also found ways to overcome them. Their resilience and determination have inspired others to stand up for their rights and demand better working conditions.\"\n\nThe Poor Road.\n\n\"To help improve the lives of those who are struggling, it is important to provide them with access to resources that will enable them to improve their living conditions. This can include access to education, healthcare, and employment opportunities. By providing these resources, we can help ensure that everyone has the opportunity to live a better life.\"\n\nUnlikely Alliance.\n\n\"Even though there are differences between the French and English speaking communities, there is still an opportunity for cooperation and understanding. By working together, we can create a stronger society that is more resilient and better able to address the challenges we face.\"\n\nOUR REPRESENTATIVES.\n\n\"It is important for us to be aware of the representatives who are elected to represent our interests. By staying informed about the issues that affect us, we can ensure that our voices are heard and that our needs are met.\"\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of ONE DOLLAR, with the object of enforcing advance payment. We can much better afford to publish a paper at that price when we know that every dollar given is paid for, than if we run the chances of collecting accounts at a higher figure. Besides we will thus specially secure a larger circulation, which will enhance the value of our advertising columns, and thus render easier your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLivery.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\n\nQU'APPELLE ST.\n\nSingle and Double Rigs for Hire.\n\nFREIGHTING A SPECIALTY\n\nALL KINDS OF COAL\n\nKept Constantly on Hand at the Lowest Prices.\n\nCash Paid for Hides & Skins\n\nQU'APPELLE.\n\nL. W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\n\nFor First Class Rigs.\n\nDaily Mail stage to Fort Qu'Appelle.\n\nQU'APPELLE STATION.\n\nHarnessmaker\n\nHarness & Saddlery\n\nThe undersigned wishes to inform the public of Qu'Appelle and vicinity that he has now on hand the Largest & Best Assorted Stock West of Brandon consisting of Harness, Saddles, Whips Bells, Blankets, Cicologies, Combs and Brushes.\n\nALL KINDS & SIZES OF Trunks and Valises.\n\nAgent for Carriage & Buggy Tops\n\nREMEMBER THE PLACE\n\nPioneer Harness Shop\n\nQU'APPELLE.\n\nJOHN B. MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON FORWARDERS.\n\nAND DEALERS IN\n\nLumber, Lath, Shingles\n\nDOORS, SASH\n\nBuilding Paper, etc.\n\nOffice West of C.P.R. Station.\n\nQU'APPELLE.\n\nBRANCH AT FORT QU'APPELLE.\n\nNEW GOODS - NEW GOODS\n\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\n\nDRY GOODS, CLOTHING,\n\nBoots & Shoes, Gents' Furnishings,\n\nFURS OF ALL KINDS\n\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\n\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\n\nIN THE TOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\n\nPROPRIETORS\n\nFURNITURE, FURNITURE.\n\nHAVING LATELY SECURED\n\nTwo Cars of First Class Furniture!\n\nI am prepared to meet the wants of all my customers in this line\n\nAT PRICES THAT DEFY COMPETITION.\n\nGIVE ME A CALL.\n\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\n\nIS PUBLISHED\n\nEvery Friday Morning.\n\nAT THE OFFICE, QU'APPELLE STATION.\n\nSix Pages. Thirty Columns.\n\nSubscription $1.00 a Year Invariably in Advance\n\nMore Reading for Less Money than any other Paper in the North West.\n\nTHE Book & Job Printing DEPARTMENT\n\nEvery Description of Printing\n\nNEATLY, CHEAPLY & QUICKLY.\n\nGEORGE H. V. BULYEA,\n\nInsurance & General Agent,\n\nAND DEALER IN\n\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\n\nSPECIAL PRICES ON WHOLESALE LOTS.\n\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\n\nQU'APPELLE STATION.\n\nLove & Raymond,\n\nPROPRIETORS.\n\nRebuilt, Enlarged, Renovated. Everything New and First-Class Throughout.\n\nSUITS FOR FAMILIES.\n\nTERMS MODERATE.\n\nS. H. CASWELL,\n\nGENERAL STORE\n\nBANK,\n\nPOST OFFICE,\n\nTROY, N.W.T.\n\nThe Canada North-West Land Co.\n\n(LIMITED)\n\nOffer for Sale\n\nSELECTED FARM LANDS\n\nin Manitoba and the North-West Territories,\n\nNear the Canadian Pacific Railway Main Line\n\nA large proportion of this Company's Lands is in thickly settled Districts.\n\nFor Information, Letters and Maps apply at the offices of the Company, 4 Castle Street, Edinburgh, Scotland; 25 Lombard Street, London, England; 181 Main Street, Winnipeg, Manitoba.\n\nW. B. SCARTH\n\nMANAGING DIRECTOR FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\n\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\n\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary.\n\nW. B. SCARTH, Trustee.\n\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\n\nLESLIE ORDON.\nRapid City Ripples.\n\n—25th before noon on Monday morning at eight o'clock.\n\n—We received the particulars of the magistrate's court Monday too late for this issue, but will appear next week.\n\n—Councillor Head is now perambulating the Counties of Wellington and York and other districts in the North West. So far he has visited the several hundreds of towns and villages, and if successful will replace them amongst farmers and others.\n\n—Mr. Stone has arrived from his farm near Fort Elizab, stated his intention of returning to Rapid City if the tide of events so moved him; there is little doubt of its coming as the various documents coming in frequently shows us to believe.\n\nPublic Notice.\n\nLEGISLATURE OF MANITOBA.\n\nBILLS RELATING TO SERVICES ON PARLIAMENT DAYS.\n\n48. No public funds for Finance Bill introduced by the House into the first four days of the session.\n\nAll applications for Finance Bills, or any other Bills which are expected to be introduced during the session, should be made to the Secretary of the Legislative Assembly of Manitoba, in accordance with the provisions of Section 13 of the Act, 1876, which for the purposes of a longer period of time, shall be deemed to be in force until the date of the next session. Any such application must be made at least one day in advance of the date on which the Bill is to be introduced.\n\nGRAND COLONIAL EXHIBITION\n\nIn London, England, 1883.\n\nFORTY-FOUR THOUSAND FEET RESERVED FOR CANADA.\n\nFirst Royal Fish billion. Commis-\n\nsioners appointed.\n\nThe Colonial and Indian Exhibition to be held in London, England, commencing Nov. 1st, 1883, is now being organised under the direction of the Commissioners appointed by the Government of Canada. The Secretary of State for India has appointed a Commissioner for Canada, and the Board of Commissioners is being selected by the Governor-General in Council.\n\nTHE NEW RAYMOND\n\nSEWING MACHINE\n\nFOR FAMILY USE.\n\nHIGH ARM WITH STITCHES.\n\nAUTOMATIC NEEDLE WINDER.\n\nCARRIE FORDHAM,\n\nONTARIO.\n\nCREELMAN BROS.,\n\nGEOEGTON, ONT.\n\nTHE MANITOBA WEEKLY FREE PRESS.\n\nTHE MONARCH OF THE WEEKLIES.\n\n14TH YEAR OF PUBLICATION.\n\nCAMPAIGN 1885-1886.\n\nMagnificent Prizes and Grand Prize Scheme.\n\nOver $1,000 worth of Handsome Prizes to be given away.\n\n100 Splendid Prizes.\n\nBalance of 1885 FREE. Only $2 in 1887.\n\nTHE GREATEST OFFER YET MADE.\n\nHOW TO SUBSCRIBE.\n\nEnclose Two Dollars to registered letter writing name and postal address very plainly and address to\n\nFREE PRESS, WINNIPEG, MAN.\nHOME & GOSSIP\n\nQU'APPELLE.\n\nBeautiful weather.\nVery little cold as yet.\nJob printing is crowding us.\nLots of matter crowded out.\n\"Who is who\" will again air his views next week.\n\nSt. John's College Farm received a large lot and larger proof oats this fall day.\n\nThe Methodists are preparing an elaborate program for their Christmas celebration and dinner which will be held Christmas night.\n\nMr. Geo. H. V. Bolyea of this town, but a registered letter by the burglar of the C. P. R. postal card office at Winkler, was stolen.\n\nMr. W. S. Redpath, manager of St. John's College Farm, has hung out his signboard as a barrister. He occupies part of Mr. F. L. Osborn's residence.\n\nThe School Board and has rented a building that heretofore stood vacant, from Mr. A. J. McMillan in order to accommodate largely increasing attendance of children.\n\nAn entertainment, by friends of the English Church, will be given Thursday evening the 13th inst., the program will be varied. All should attend and enjoy a good evening amongst themselves.\n\nThe skating rink of Messrs. Johnston and Gorrell will be opened Friday evening next.\n\nThe County Court House will be kept open in the Qu'Appelle district during the late harvest season only when the Indians were present. Mr. Jackson would not be able to keep his promise if he had no doubt the Northwest grizzlies would descend.\n\nMr. Jackson said that Mr. Jackson had met at least one of his promises. Mr. Jackson said that it was not necessary to deal with the half breed and Indian question and concluded by saying that it was not possible to say that there was nothing to do before the council but because he knew what the Indians wanted and to meet their wishes he always did so.\n\nAt the time of the meeting, he could say from his personal knowledge that the Indians knew that he was not an advocate of the half breed and Indian question and concluded by saying that it was not possible to say that there was nothing to do before the council but because he knew what the Indians wanted and to meet their wishes he always did so.\n\nThe debate was adjourned till 2 o'clock the next day.\n\nIn the debate—His Honor took the chair at 2:15 p.m.\n\nOn resuming the debate on the address in reply to his Honorable speech, Mr. Jackson said that Mr. Jackson said that he would occupy the time of the House for moments in his honor. Mr. Jackson said that he brought against him by the Lieutenant-Governor on Friday evening. The Lieutenant-Governor thereupon brought Mr. Jackson's remarks to Mr. Jackson's attention and asked him if he knew, unless it was to throw a glamour over the charges in his report, that Mr. Jackson said \"I have not been convinced that Mr. Jackson\" did not refer to \"degradation,\" at which the Governor had been silent. Mr. Jackson said that Mr. Jackson was acting in accordance with his duties, because as Indian Commissioner he was charged with the care of the half breed and Indian rising and did not take the proper steps to bring the matter prominently before the Dominion Government. If the Lieutenant-Governor's representations were not attended to, then he could do the same thing. His Mr. Land—He could resign.\n\nHis House—Mr. Land did not return to resign.\n\nMr. Jackson said that he prepared an answer to prove he did resign. He referred to the attempt of Mr. Dewdney to prevent the publication of his (Mr. Jackson's) statement in the (Governor's) speech, and inserted an extract from Mr. Dewdney's letter to Mr. Land about the death Indians five of them died of starvation. The Indians were not able to maintain life and were forced to give up their lives by the Indian Agents.\n\nHis Honor—False! False! False!\n\nMr. Jackson—I can prove the matter on oath. He then stated that Mr. Dewdney had committed frauds and misappropriated provisions by the Indian Department in the delivery of provisions, etc. The Governor said the Indians and the people of this town that matter should not be pushed up.\n\nHis Honor—It was not smothered.\n\nMr. Jackson—Isn't it? Then how were the parties punished? That year passed by and by and by.\n\nMr. Jackson mentioned his honesty and that he had never before been accused of any impropriety or misconduct. He could assure his honor if Mr. Dewdney went for election again, he would vote very few votes for Mr. Dewdney.\n\nFew would regret his honest departure from the territories. In fact he had no doubt the Northwest grizzlies would descend.\n\nMr. Jackson said that Mr. Jackson had met at least one of his promises. Mr. Jackson said that it was not necessary to deal with the half breed and Indian question and concluded by saying that it was not possible to say that there was nothing to do before the council but because he knew what the Indians wanted and to meet their wishes he always did so.\n\nThe debate was adjourned till 2 o'clock the next day.\n\nIn the debate—His Honor took the chair at 2:15 p.m.\n\nOn resuming the debate on the address in reply to his Honorable speech, Mr. Jackson said that Mr. Jackson said that he would occupy the time of the House for moments in his honor. Mr. Jackson said that he brought against him by the Lieutenant-Governor on Friday evening. The Lieutenant-Governor thereupon brought Mr. Jackson's remarks to Mr. Jackson's attention and asked him if he knew, unless it was to throw a glamour over the charges in his report, that Mr. Jackson said \"I have not been convinced that Mr. Jackson\" did not refer to \"degradation,\" at which the Governor had been silent. Mr. Jackson said that Mr. Jackson was acting in accordance with his duties, because as Indian Commissioner he was charged with the care of the half breed and Indian rising and did not take the proper steps to bring the matter prominently before the Dominion Government. If the Lieutenant-Governor's representations were not attended to, then he could do the same thing. His Mr.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1885121101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8994, "total-output-tokens": 3434, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1505, 2], [1505, 5356, 3], [5356, 5356, 4], [5356, 7833, 5], [7833, 13689, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]