[{"id": "54cb203ea55eb22f8a3b10c54e4860987cc495ff", "text": "Notice.\n\nIn addition to the Acts mentioned in the Schedule to \"The North West Territories Act, 1876,\" there will be added, under the North West Territories, the following Acts of Parliament. Crown Rangeland Act, U. S. population Act, Salmon Act, and Euphoria, C.C. 1860, \nto be read (2nd June), \nAct relating to Railways and other matters relating to the Public Works, \nAct relating to Railways and other marks relating to Railways, \nAct relating to Railways and other matters relating to Railways, \nAct relating to Railways and other matters relating to Railways, \nAct relating to Railways and other matters relating to Railways, \n\nQu'Appelle Progress.\n\nPublisher's Notice.\n\nOUR RATES.\n\nSubscription price $1.00 per annum, \nin advance. \n\nNotices.\n\nCommissioner for Manitoba, \nAgent for Canada North West, & Co. \nPost Office Qu'Appelle, six Ave., \nPost Office Branch, North Qu'Appelle, \nAdd. James Weidman. \n\nNotice. \n\nNotice.\n\nNOTICE.\n\nMUNICIPALITY OF South Qu'Appelle.\n\nNOTICE.\n\nApplications for the office of Assessor for the Municipality of South Qu'Appelle for the year ending Jan. 31st, 1888.\n\nDue Date Feb. 5th, 1888. \nSalaries five per cent. \n\nBy Order.\n\nA. F. PATRICK, \nClk. \nQu'Appelle. Jan. 19, 1888.\nSome people have made doubts be started at the title I have given to these lectures, \"The Holy Catholic Church.\" I have used this title on purpose, and in the title we claim for our church as may be fully seen in the formulas and creeds contained in our liturgy. Every time we go to church, we say we believe the Holy Catholic church, and to such an extent that we claim possession of another body as is erroneously done in ordinary use, is a very serious position to take or display a great amount of ignorance. The word Catholic means universal, and the title which has been used for the church of Christ from the earliest times to the present is from other hands. We believe that it belongs to one branch of that church, as man do who speak the name of the church of Rome, the Catholic church, in utterly wrong and misleading language. A good friend contending for the truth clearly says this but in our hurry, has said, speaking of the members of the church of Rome, \"I believe that they address the God of Truth either in solemn worship or private devotion, and I believe that they turn to them, to repent. I believe in the Catholic church,\" and if yet I am of the church of Rome, \"are you a Catholic?\" I am sure to answer, \"No, I am a Protestant.\" Was there ever a more glaring instance of insincerity and of gross misrepresentation than this? In our hurry, has said, speaking of the members of the church of Rome, \"I believe that they address the God of Truth either in solemn worship or private devotion, and I believe that they turn to them, to repent. I believe in the Catholic church,\" and if yet I am of the church of Rome, \"are you a Catholic?\" I am sure to answer, \"No, I am a Protestant.\" Was there ever a more glaring instance of insincerity and of gross misrepresentation than this?\n\nThe church is indeed protestant in the protest against certain errors of the church of Rome, but she is Catholic as she maintains and upholds the doctrine of the church that she has inherited from the time when the church was yet one, the doctrine of the Lord's Supper. And so to uphold truth in our cause is in no unimportant work to present to the world the true meaning of the word Catholic is only, however, one instance of that ignorance that is so generally prevalent even amongst fairly educated people concerning the history of the church of Christ. That ignorance is indeed extraordinary, and profanity is sometimes revealed in conversations and in newspaper columns. It is not only extraordinary, still more extraordinary than most people should care to think of this ignorance, but it causes much trouble to make any investigation, or to read any book that might enlighten us upon this subject. Yet surely it is a subject of the very greatest and deepest interest. We are dealing with something at least of the history of our country, and the more we do know of the history of the church the more our patriotism grows. Our hearts are kindled by the thought of the glorious deeds of its heroes, and its sufferings and its martyrdoms, and of the fame of its men, of leaders, of heroes, and of saints. Herein lies the importance of the noble ambition of being useful to those generations by learning what others have done in things we have done before them. But it is not only for the stirring up of enthusiasm that this subject is worth while; it is profitable. It gives the key to the solution of many a problem in the present day. How can we know the value of the past? If it does not actually solve the difficulties of the present, it affords a definite help that can be used to help us to understand those difficulties and so to master them. There is no education in the history of the church of Christ. Its pages are full of illustrious names of conduct, of martyrs, and of defenders of faith. Those who stand whose learning will stand comparison with all that the world has produced in the past. While here far more even than in the history of nations we may uncover the difficulties by the light of the past. He said it dealt with a subject of most vital interest to every one of us. In the Gospels we have the record of His life. Luke and Acts tell us of all His actions, both public and private, in the acts of the Holy Apostles, and in the subsequent history of the church we have the record of those things which through the Holy Spirit have been continued down to the present day throughout the world. One would have thought therefore that to anyone who professed to be interested in the subject he looked for salvation, one of the most important questions that could arise in the discussion would be clear and definite knowledge on the subject had been reached, would be able to carry on his work through future generations, and how as a matter of fact, the church is in a state of confusion and in the possession of another body as is erroneously done in ordinary use, is a very serious position to take or display a great amount of ignorance. The word Catholic means universal, and the title which has been used for the church of Christ from the earliest times to the present is from other hands. We believe that it belongs to one branch of that church, as man do who speak the name of the church of Rome, the Catholic church, in utterly wrong and misleading language. A good friend contending for the truth clearly says this but in our hurry, has said, speaking of the members of the church of Rome, \"I believe that they address the God of Truth either in solemn worship or private devotion, and I believe that they turn to them, to repent. I believe in the Catholic church,\" and if yet I am of the church of Rome, \"are you a Catholic?\" I am sure to answer, \"No, I am a Protestant.\" Was there ever a more glaring instance of insincerity and of gross misrepresentation than this?\n\nThe church is indeed protestant in the protest against certain errors of the church of Rome, but she is Catholic as she maintains and upholds the doctrine of the church that she has inherited from the time when the church was yet one, the doctrine of the Lord's Supper. And so to uphold truth in our cause is in no unimportant work to present to the world the true meaning of the word Catholic is only, however, one instance of that ignorance that is so generally prevalent even amongst fairly educated people concerning the history of the church of Christ. That ignorance is indeed extraordinary, and profanity is sometimes revealed in conversations and in newspaper columns. It is not only extraordinary, still more extraordinary than most people should care to think of this ignorance, but it causes much trouble to make any investigation, or to read any book that might enlighten us upon this subject. Yet surely it is a subject of the very greatest and deepest interest. We are dealing with something at least of the history of our country, and the more we do know of the history of the church the more our patriotism grows. Our hearts are kindled by the thought of the glorious deeds of its heroes, and its sufferings and its martyrdoms, and of the fame of its men, of leaders, of heroes, and of saints. Herein lies the importance of the noble ambition of being useful to those generations by learning what others have done in things we have done before them. But it is not only for the stirring up of enthusiasm that this subject is worth while; it is profitable. It gives the key to the solution of many a problem in the present day. How can we know the value of the past? If it does not actually solve the difficulties of the present, it affords a definite help that can be used to help us to understand those difficulties and so to master them. There is no education in the history of the church of Christ. Its pages are full of illustrious names of conduct, of martyrs, and of defenders of faith. Those who stand whose learning will stand comparison with all that the world has produced in the past. While here far more even than in the history of nations we may uncover the difficulties by the light of the past. He said it dealt with a subject of most\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of getting as many readers as possible. We can much better afford to publish a paper at that price when we know that every paper going out is paid for, than if we took the chance of collecting money at a higher rate. Besides, we will very shortly come to a larger circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbors to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nLiberties.\n\nDOOLITTLE'S LIVERY\n\nFeed and Sale Stable,\nQU'APPELLE ST.\nSingle and Double Rates for Men.\nFreighting a Specialty\nALL KINDS OF COAL\nKept Constantly on Hand at the Lowest Prices.\nCash Paid for Hides & Skins\nQU'APPELLE.\n\nL.W. MULHOLLAND LIVERY,\n\nFeed and Sale Stable\nFor First Class Rigs.\nDaily Mail Stage to Fort Qu'Appelle.\nQU'APPELLE STATION.\n\nHarnessmaker.\nHarness & Saddlery\nThe undersigned wishes to inform the public of the quality and variety that he has now on hand, viz:\nLarge & Best Assorted Stock\nWest of Brandon\nConsisting of\nHarness, Saddles, Whips\nBELLS, BLANKETS, Circlettes, Combs and Brushes.\nAll Kinds & Sizes of\nTrunks and Valises.\nAgent for Carriage & Buggy Tops\nRemember the Place\nPioneer Harness Shop\nQU'APPELLE.\nJOHN B MILLIKEN.\n\nMiscellaneous.\n\nTHOMSON & NELSON FORWARDERS.\n\nAND DEALERS IN\nLumber, Lath, Shingles\nDOORS, SASH\nBuilding Paper, etc.\nOffice West of C.P.R. Station.\nQU'APPELLE.\nBRANCH AT FORT QU'APPELLE.\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\n\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\n\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\n\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE TOWN OF QU'APPELLE.\n\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON,\nPROPRIETORS\n\nFURNITURE, FURNITURE.\n\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of all my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning.\nAT THE OFFICE, QU'APPELLE STATION.\nSix Pages. Thirty Columns.\nSubscription $1.00 a Year Invariably in Advance\nMore Reading for Less Money than any other Paper in the North-West.\n\nTHE Book & Job Printing DEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent.\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T.\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\n\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated, everything New and First-Class Throughout\nSUITS FOR FAMILIES.\nTERMS MODERATE.\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories.\nNear the Canadian Pacific Railway Main Line\nA large proportion of this Company's Lands is in thickly settled Districts.\nFor Information, Prices and Maps apply at the offices of the Company, 14 Castle Street, Edinburgh, Scotland; 75 Lombard Street, London, England; 324 Main Street, Winnipeg, Manitoba.\n\nW. B. SCARTH\nMANAGER, GENERAL FOR CANADA.\n\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway Between Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESLEY GORDON.\nHow to Live Cheaply.\n\nOne of the supreme talents and virtues is to get along on very little. It is a great virtue, but also a great danger. Here are some answers. Farthings are worth pennies; halfpennies are worth shillings; sixpennyworths often make pounds. Remember how to make shoes by buying cheap leather, save away carpets in boxes, wear cheap boots, fix clocks out of wood shavings instead of ivory filigree. Never be afraid of being honest.\n\nA Poil of Gold.\n\nA correspondent in North Carolina says:\n\nThere was nothing strange when a man of about seventy found a pot of gold while plowing his field. The pot had been placed there in 1823 by the Gentry family, who lived on the same farm at that time. The pot contained more than $100,000 in gold coins, silver bars, and other valuables. Since then, there has been a succession of claims made in the same area, but each time they have been found wanting. Nevertheless, the discovery makes headlines all over the country.\n\nPERSONAL AND LITERARY\n\n-York House has been torn down, and the cars are being auctioned off. -Lawrence Barrett carries $125,000 from the Bay Street treasury. -Dr. W. D. Watt Talmage, saved by insurance. -The widow of the late President Grant resides in New York. -It is estimated that the estate of Mr. Henry, of New York, will be worth $10,000,000. -The King of Greece has conferred upon Mr. David M. Henry, of New York, the honor of knighthood for his services to Russia. -Mr. E. C. Carpenter, the English poet, whose last book is an announcement of his intention to retire. -Colonel Macdonald, of Canada, has died of cancer. -Mr. E. C. Carpenter, the English poet, whose latest book is an announcement of his intention to retire. -Colonel Macdonald, of Canada, has died of cancer.\n\nPublisher's Notice.\n\nOUR RATES.\n\nSubscription price: $2.00 per annum, or $0.16 per month.\n\nRates for advertising space by contract are as follows:\n\nOne One One\n\nCanada United States Canada United States Canada United States\n\nOne column $0.25 $0.20 $0.50 $0.40 $1.00 $0.80\n\nTwo columns $0.50 $0.40 $1.00 $0.80 $2.00 $1.60\n\nFour inches $1.00 $0.80 $2.00 $1.60 $4.00 $3.20\n\nPublisher's Note to the Readers.\n\nThe Nor'West Farmer Wants Ma nitoba\n\nAnd the North West.\n\nTo Field and Farmers Return to the Table.\n\nWe are doing our best to keep pace with the demand of the farmers throughout the northwest. We have every reason to believe that the wheat crop in Manitoba will be good this year, and we hope to be able to offer a high grade product at competitive prices.\n\nThe Nor'-West Farmer\n\nAND MAITONNA MILLER.\n\nHumorous.\n\nA man in New Mexico came across a horseboat loaded with elk horns. He bought them and took them back to his wife. But she thought he had been fooling her, so she took the horns to a jeweler, who said they weren't valuable. She brought them back to her husband, who then went to a doctor, who told him the horns were worth nothing. So he took them to a lawyer, who said they were no good. Finally, he went to a judge, who said they were not legal tender.\n\nTo Field and Farmers We Return to the Table.\n\nWe are doing our best to keep pace with the demand of the farmers throughout the northwest. We have every reason to believe that the wheat crop in Manitoba will be good this year, and we hope to be able to offer a high grade product at competitive prices.\n\nHumorous.\n\nA man in New Mexico came across a horseboat loaded with elk horns. He bought them and took them back to his wife. But she thought he had been fooling her, so she took the horns to a jeweler, who said they weren't valuable. She brought them back to her husband, who then went to a doctor, who told him the horns were worth nothing. So he took them to a lawyer, who said they were not legal tender.\n\nGovernment Art Contract.\n\nThe Government has awarded a contract to Mr. J. B. Farnaby for the delivery of one hundred copies of \"The Story of the Potato.\"\nRapid City Ripples.\n\nA very successful social was held in the Methodist Church on the 3rd.\n\nMr. Dr. Harrison, M. P. P., passed through here last week on his way to Winnipeg.\n\nMr. A. J. Hackett convened the Liberals of the Little Saskatchewan here on the 5th inst.\n\nThe Staked Plains.\n\nThe Sacred Precincts of New Mexico and Northern Arizona have been but little visited by civilised man until recent years. They have been regarded as barren wastes, worthless to all mankind and peculiarly inhospitable to the white race. The civilization crowds its way or takes it existence where it can find a foothold. In the case of the sacred precincts of the southwest, more than any other part of the continent, the plains begin in New Mexico and extend far into the interior of Texas, and are bounded on the north by the Missouri River and on the south by Red River, and are of the most desolate aspect. They have crept the entire year with a thick coat of snow, which has been followed by a succession of storms, affording excellent pastureage for the herds. The plains have been opened up for settlement, and the great herds of cattle have been sent across them with satisfactory results. The country is rich in minerals, John Pope twenty-eight years ago expended two million dollars in the exploration of the region, and has found valuable veins of silver, lead, copper, and other minerals. The region is also rich in timber, and the forests are being cleared away to make room for the plow.\n\nMarriage Licenses.\n\nJ. McMACK\n\nREGISTER OF MARRIAGE LICENSES,\n\nRAPID CITY.\n\nProvincial Statute of Manitoba.\n\nLiquor License Act.\n\nThe following application for Liquor Licence has been received:\n\nJohn Thomas Luke, Morley.\n\nLiquor License Act.\n\nW. C. COTTINGHAM\n\nHarness, Boots and Shoes,\n\nRapid City.\n\nHOW TO MAKE A CUP OF\n\nExcellent Coffee\n\nAt a Moment's Notice Anywhere.\n\nUSE\n\nLyman's Concentrated Extract of Coffee.\n\nCHOICE SELECTED COFFEE\n\nPrepared by a New and Scientific Process.\n\nCorinthian Lodge No. 15\n\nF.A.M. & C.O.\n\nThe regular communication of the above lodge takes place on the first Tuesday of every month.\n\nCARRIS & NELLES,\n\nAttorneys, Solicitors, Notaries.\n\nSecond Avenue, Rapid City.\n\nMONEY TO LOAN\n\nAPRIL CASES.\n\nDavid Butchart,\n\nTAILOR,\n\nNext Door to Standard Office, Rapid City.\n\nTHE NEW\n\nRAYMOND\n\nSEWING MACHINE\n\nFOR FAMILY USE.\n\nHIGH ARM-HIGH FINISH.\n\nAutomatic Bobbin Winder\n\nCHAS. RAYMOND,\n\nMANUFACTURER,\n\nGuelph, Ontario.\n\nQUEEN'S HOTEL\n\nRAPID CITY.\n\nGOOD BOARD AND STabling.\n\nTHOS. HUXELL Prop.\n\nMR. D. BUTCHART\n\nWishes to announce that he is prepared to accommodate those desiring rooms with Meals and Lodging.\n\nSecond Avenue, Rapid City.\n\nWEBSTER'S PRACTICAL DICTIONARY\n\nSpecial Offers.\n\nWEBSTER'S Practical Dictionary will be supplied at a reduced price to any person who will subscribe for one year's subscription to THE RAPID CITY STANDARD for one dollar.\n\nWe will give the STANDARD one year and the Dictionary for $1.75.\nHOME & GOSSIP\n\nQUAPPELLE.\n\nAnother carnival is on the tap.\n\nFull bands of B Battery yesterday.\n\nThe racing game has become very popular.\n\nW. A. Coder, of Regina, filled the Methodist pulpit on Sunday evening last.\n\nWe understand that Mr. S. H. Cavell intends erecting a commodious Methodist warehouse in the spring.\n\nAnother Carnival will be held here this week. It will be held in McLane's hall, Qu'Appelle street is not protected in any way.\n\nW. H. Lyon, J. Collins, Jno. Dowler, W. Gowan, Winnipeg, and H. Jackson, Regina, were among those registered at the Queen's hotel this week.\n\nMr. W. D. Perley, M. N. C., was here this week. He went to Regina on Tuesday, and returned Wednesday, going to Regina on evening.\n\nMessrs. J. F. E. Dodds have bought out the coal business from Mr. J. R. Macdonald, who has sold or furnished hard or soft coal at bottom prices for cash.\n\nW. W. Williams, instructor at the Holy Hill, and family, spent a few days with Mr. A. J. Baker, of this place. They left for their home in Regina Monday.\n\nAlthough wheat is reported in the east, Messrs. D. H. McMillan & Co. are still paying the highest price for wheat here, the drop not having made any difference with them.\n\nIn connection with the pastoral visitations of the services at St. Paul's Anglican church, it has been arranged to hold a choir practice in the church on Friday evenings, at 8 o'clock p.m. All persons interested are invited to attend.\n\nThis week past, one-half of the members of the choir of the parish church of St. Luke, under the Bishop of Qu'Appelle, attended a service which was held at the church on Friday evening.\n\nThe Episcopal Church displayed considerable enterprise last week in the publication of Mr. J. W. Perley's speech at the banquet given him at the bandstand.\n\nIn addition to its regular size, it acquired a six-column supplement to contain it.\n\nSchool opened on Monday with Mr. J. W. Perley as our new teacher, although the attendance is from 35 to 40, and we are longing to see better school room accommodations. Why not issue orders for a new building and a suitable place at once?\n\nMessrs. D. H. & W. W. McMillan are expected to finish their new store building next month, and then will running day-to-day, every thing being now in readiness. The dates of the opening will be announced by the failure of the Great Manufacturing Co., so complete it without the time agreed.\n\nMr. H. B. Gordon, Thomas Simpson, H. R. Gordon, Thos. T. Hosie, Winnipeg, H. W. Wilkinson, John H. Gordon, Dr. Perley, Wm. J. W. H. Hicks, Mrs. G. Morrison, File Hills, L. Marron, Dock Lake, Mr. McKay, Wm. M. McMillan, Dr. Balm, Mr. J. B. Marron, and Geo. Dock, Prince Albert, are registered at the hotel.\n\nAn interesting outdoor match was played between the teams of Qu'Appelle and Regina on Monday last. The sides were Maple Shore, Nelson, Vernon, Cassville, and Hamilton, Regina; and Wards, Dr. Freeman, Morris, Scott, and Thomson, skip. The match was for an important cup, the result in a victory for the latter with a score of 14 to 12. The support took place at the Queen's on Tuesday evening.\n\nWho is who? is greeted and again.\n\nA large quantity of goods for Prince Albert and other northern posts left here this week by freighters.\n\nMr. W. C. McKay of Prince Albert, was in town this week. He is taking 11,000 lbs. of freight and 150 bales of cloth back with him.\n\nThe Methodist Club will give a dramatic and musical entertainment in the prominent building on Friday, the 5th inst., performance to commence at 7:30 o'clock.\n\nAn examination for the degree in preparation and the admission fee has been fixed at $25 cents, and children are admitted free.\n\nActing on the suggestion of the Trustees, a meeting will be held in McLane's hall, Qu'Appelle street, for the purpose of forming an agricultural society in this place.\n\nAll persons interested are particularly requested to attend, so that a thoroughly representative committee may be appointed.\n\nA correspondent writes: Will the Proprietors tell me why the Board of Trade has been unable to get any information regarding the sale of some acres of land? I have no complaint against the present getting sold, still, Tar Products is not a good name, and people say selling it is a better paper than the Leader.\n\nOn Wednesday last Sergeant Henry, of the Royal North-West Mounted Police, spotted a trunk and on opening it found that it contained four gallons of whisky. The trunk was marked and the name named. Mason was found to have the duplicate of the check on the trunk, and was arrested and brought before Mr. S. M. Davidson, J. P., who requested Messrs. J. M. McLure and W. S. McLure to assist him in arresting him with him. Mason was fined $5 and cost thirty days in Regina Jail. Mason was committed to Regina Jail until he could be tried.\n\nIt will be well for whichever peddlers to have the duplicating of checks on their side, as it is a principle of only honesty that they should be able to trace the trunk and sell it amongst honest people, and not be compelled to sell it amongst thieves.\n\nThere are at least seven of them, some of whom are very well known and many alike to those who have seen the pictures of them shown to the public.\n\nThere is a man in this town who has been engaged in selling whisky for years. There are at least seven of them, some of whom are very well known and many alike to those who have seen the pictures of them shown to the public.\n\nThere is a man in this town who has been engaged in selling whisky for years.\n\nJ. McEwan, General Blacksmith, Carriage and Wagon Shop, Qu'Appelle.\n\nFor Boots & Shoes go to S. H. Collins.\n\nWhere you will not receive Dealing and every man used alike.\n\nGentleman's Ladies' Boots Made to Order.\n\nOrders from all places shipped by Express.\n\nOverhoses, Rubbers, Moccasins Now on Hand.\n\nLYMAN'S UNIVERSAL PAIN RELIEVER FOR Frost Bites, Cramps, Rheumatism, Neuralgic Affections, Tic Douloureux.\n\nSafe Mild Strong Pure\n\nRoller Mills, QUAPPELLE STATION.\n\nThe Highest CASH PRICE! PAID FOR WHEAT At the Above Mills.\n\nD. H. McMillan & Co.\n\nBlacksmith,\n\nT. WELSH,\n\nGeneral Blacksmith,\n\nQUAPPELLE.\n\nFrom the very liberal patronage he has received since starting business here, feels justified in announcing his intention of respectfully soliciting a continuance of the same.\n\nParticular attention paid to horse shoes. No charge for shoeing is required, as in the case of horses.\n\nCommencing next week, repairing ruptured tendons certainly attended to.\n\nLansdowne Hall QUAPPELLE\n\nBilliard & Pool Tables.\n\nMusic Every Evening.\n\nGive us a call.\n\nH. J. EDWARDS.\n\nCarpenter.\n\nJ. B. ROBINSON\n\nContractor, Builder.\n\nGUAPPELLE.\n\nAll work in my line will Receive Careful Attention.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886012901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8810, "total-output-tokens": 6618, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1212, 1], [1212, 9283, 2], [9283, 13088, 3], [13088, 16990, 4], [16990, 19929, 5], [19929, 26616, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]