[{"id": "f2d18a85c22d90da8905151ef2343adf43e07676", "text": "The MAIL ROUTE.\n\nThe Regional Leader has stepped up the advocacy of the North mail route to the throne. We do, no doubt, see that the present route to Prince Albert is best, for it says that it “would like to use the best suitable route, whichever it is,” adopted; but a correspondent signing himself as “Saskatoon” (or perhaps “Saskato?”) writes to the Leader and it publishes the letter. The correspondent gives evidence by which he endeavors to make it appear that the Toronto-Prince Albert-Saskatoon route is shortest, but the figures he gives will not bear investigation. They are false in nearly every particular. He compares first distances with air lines, and that is impossible, while his figures are impracticable. It is easy to make such comparisons on paper, but is another thing to make them practicable. Also could it be argued that these mail roads cannot start with advantage from Fort Qu’Appelle. In fact this would be much more sensible; but this is not what has been proposed. The new route would run from Regina to Saskatoon then to Prince Albert by one line and to Battleford by another. Now the only place that would be better served than at present would be Saskatoon, but with the Battleford route the new route would not be so well served as the present one. The question therefore arises, are the Prince Albert and Battleford mail contracts worth keeping? Col. Irvine has returned his petition of commission of the Mounted Police and Mr. Lawrence, W. H. Breton, has returned his petition. Department answered him as commissioner, Col. Irvine asked to re-examine some time ago but owing to circumstances did not press his resignation until now. He has been sworn in years in the force.\n\nThe vote on the Lamont motion was composed as follows: Against the motion, 122 Conservatives and 24 Liberals; in favor, 25 Conservative members, 3 former French, 3 former Holter, 17 former Liberals, giving a majority against the motion of 94. This will show the feeling of Conservatives upon this matter.\n\nDINNER TO THE DELEGATES.\n\nA most successful and enjoyable dinner was given last Friday evening at the Lansdowne Hotel, Regina, to Messrs. Percy and Ross, of the London Central Council, recently a delegate to the Federal convention by invitation of the Regina council. The dinner was attended by Mr. Ross, Mr. Percy, the Mayor, several prominent citizens, and the Mayor, the President. The dinner was almost an informal affair, as many of those present were guests. The dinner was served promptly, and too much credit cannot be given to Messrs. Percy & Co., who have done a splendid job, providing food at less than twenty-four hours notice.\n\nThe usual royal toast having been drunk, the Mayor proposed the health of the guests, followed by Mr. Percy and Mr. Ross, who replied lengthily, giving a very favorable account of their reception here and what had been accomplished.\n\nIn response to the toast the N.W.M.P. Band, under the direction of J. R. Hamill, presented a short program. The N.W.M.P. Band, under the direction of J. R. Hamill, presented a short program. After the music, Mr. Baldwin gave a talk on the proper use of firearms. The band played again, and the evening having been spent, the company broke up considerably early midnight.\n\nKATEFWA.\n\n—Where are we to have a church here?\n\n—Sturgeon Bay is still good north of the river but the valley is bare.\n\n—The Miss Gibsons’ company will be a great acquisition in this town. The ladies are so much appreciated.\n\n—On Monday last Mr. Gibbons, originally from Pembroke, Ont., having made the long journey in five days, bringing with him a cart of stock and other effects. Mr. Gibbons is a charming young English lady who has joined her husband who is engaged in trading at the Red River. Mr. Gibbons is of Fort Qu’Appelle.\n\n—The strength of Mr. Harold Brown’s resolution to attend the tent on Friday evening March 16th, was shown on Sunday morning when he appeared in a condition which can only be described as deplorable. His appearance was such as to call forth the greatest sympathy. He was seen standing on the corner of Main Street and 1st Avenue, looking pale and listless. He was immediately recognized by friends and acquaintances, who came to his aid. He was carried home by a friend, and there he remained until late into the night.\n\nCol. Irvine has returned his petition of commission of the Mounted Police and Mr. Lawrence, W. H. Breton, has returned his petition. Department answered him as commissioner, Col. Irvine asked to re-examine some time ago but owing to circumstances did not press his resignation until now. He has been sworn in years in the force.\n\nThe vote on the Lamont motion was composed as follows: Against the motion, 122 Conservatives and 24 Liberals; in favor, 25 Conservative members, 3 former French, 3 former Holters, 17 former Liberals, giving a majority against the motion of 94. This will show the feeling of Conservatives upon this matter.\n\nFinding Our Way on the Prairies.\n\nTo find the way for yourself is a difficult task, and to drive anywhere after dark is almost impossible without the aid of a lantern. Even during the daytime, it is often necessary to rely on landmarks or signs.\n\nThe Great Divide is the name given to the highest point between Canada and the United States. From this point, the divide runs westward through Montana, Idaho, Oregon, Washington, and finally ends at the Pacific Ocean.\n\nThe divide is marked by a line of trees, rocks, and other natural features. It is also known as the Continental Divide because it separates the watersheds of the two oceans.\n\nThe divide is an important landmark for travelers, as it marks the boundary between the two countries. It is also a popular destination for hikers and campers, who come to enjoy the stunning views and the opportunity to explore the wilderness.\n\nThe divide is located in the Rocky Mountains, and is considered one of the most beautiful places in the world. It is a place of great natural beauty, and is a reminder of the incredible power of nature.\nOUR TERMS.\n\nWe have placed our yearly subscription at the low rate of One Dollar, with the object of ensuring advance payment. We can hardly afford to publish a paper at that price when we know that every paper going out is paid for; then if we took the chances of collecting accounts at a higher figure. Besides we will thus specially secure a larger circulation, which will enhance the value of our advertising columns. So dear reader send us your name and a dollar, and get your neighbor to subscribe, and you will obtain full value for your money in interesting reading from now till January 1st, 1887.\n\nA. S. EMPEY,\nDEALER IN\nGENERAL MERCHANDISE,\nQU'APPELLE.\n\nGEORGE H. V. BULYEA,\nInsurance & General Agent,\nAND DEALER IN\nFlour, Oats, Bran, Shorts, Oatmeal, Cracked Wheat, Graham Flour, etc., etc.\nSPECIAL PRICES ON WHOLESALE LOTS.\nQU'APPELLE, N.W.T\n\nTHE LELAND HOUSE.\nQU'APPELLE STATION.\nLove & Raymond,\nPROPRIETORS.\nRebuilt, Enlarged, Renovated. Everything New and First-Class Throughout\nSUITES FOR FAMILIES.\nTERMS MODERATE\n\nS. H. CASWELL,\nGENERAL STORE,\nBANK,\nPOST OFFICE,\nQu'Appelle Station.\n\nThe Canada North-West Land Co.\n(LIMITED)\nOffer for Sale\nSELECTED FARM LANDS\nin Manitoba and the North-West Territories,\nNear the Canadian Pacific Railway Main Line\n& large proportion of this Company's Lands is in thinly settled Districts.\nFor information, Fees and Maps, apply at the offices of the Company, 14 Carlton street,\nEdmonton, Edmonton, 11 Edward street, Winnipeg, Winnipeg, Winnipeg, Winnipeg, Winnipeg.\n\nW. B. SCARTH\nMANAGING TRUSTEE FOR CANADA\n\nCanadian Pacific Railway Town Lots.\nTHE TOWN SITE TRUSTEES OFFER FOR SALE\nBuilding Sites at all Stations on Main Line of above Railway\nBetween Brandon and Calgary\nW. B. SCARTH, Trustee.\nAGENT IN QU'APPELLE FOR LANDS AND TOWN LOTS.\nLESLIE GORDON,\n\nNEW GOODS - NEW GOODS\nAT J. P. BEAUCHAMP'S.\nCall and Examine our Stock consisting of\nDRY GOODS, CLOTHING,\nGents' Furnishings, Boots & Shoes,\nFURS OF ALL KINDS\nHardware, Groceries, Crockery, Glassware, etc.\nOur Stock is now complete in the above Lines, and our Prices will compare favorably with any other house in the North-West.\nGive us a Call and see for yourself.\nJ. P. BEAUCHAMP.\n\nQUEEN'S HOTEL\nOF THE\nTOWN OF QU'APPELLE.\nThe Leading House in the West.\n\nJOHNSTON & DAVIDSON\nPROPRIETORS\nFURNITURE, FURNITURE.\nHAVING LATELY SECURED\nTwo Cars of First Class Furniture!\nI am prepared to meet the wants of my customers in this line\nAT PRICES THAT DEFY COMPETITION.\nGIVE ME A CALL.\nGEO. H. V. BULYEA, Qu'Appelle.\n\nSPICY! PITHY! NEWSY!\n\nTHE Qu'Appelle Progress\nIS PUBLISHED\nEvery Friday Morning,\nAT THE OFFICE, QU'APPELLE STATION.\nSix Pages, Thirty Columns\nSubscription $1.00 a Year invariably in Advance\nMore Reading for Less Money than any other Paper in the North-West.\n\nTHE Book & Job Printing\nDEPARTMENT\nEXECUTES\nEvery Description of Printing\nNEATLY, CHEAPLY & QUICKLY.\nPoetry.\n\nTHE COMING OF THE KING.\n\n'They shall see the King in his beauty.'\nAll day long we watched and waited,\nWhile his feet back slowly drifted\nOut into the blue of the west.\nWe had swept up bitter anguish,\nAnd the tears came down our cheeks,\nWhile our hearts drew back adored.\nLonging for the coming of the King.\nAll in vain are tears and pleading,\nFor the King has come at last.\nWe could only watch and listen\nFor the sound of his coming.\nOh, the terror of the coming!\nOf the grim and ghastly face.\nOn the brow of the path way\nWhere our darling's feet must stand.\nOh, the horror of the coming!\nBending slow and low and clear,\nAnd the birds sang for our sake,\nAnd the trees bowed their heads low.\nAnd the birds sang for our sake,\nAnd the trees bowed their heads low.\nAll the joy they could bring,\nAnd all the comfort they could bring,\nAt the coming of the King.\n\nMR. E. SYKES' ESTATE IN IOWA.\n\nWe have received a copy of the Stockport (England) Advertiser, and we find in it the following reference to Mr. E. Sykes' fine Eddy farm near this place. Written by the agricultural correspondent of the contemporary press. The first consignment of fish was landed at Liverpool for Landwood Town, the American estate of Mr. Sykes, of Stockport, this week. Mr. Sykes is a native of Nisman. They comprise twelve three-year-old pedigree heifers, and a ten-year-old bull purchased at \"Black Deer\" the first in his class at Preston Royal Show, 1885. All have been selected with great care and attention to breed and type, and the result of the selection is the proof of Colonel Platt's, Gambling Island, and the agent, Mr. William Williams, Mahalya, Iowa. Colonel Platt's name is well known throughout the Principality as a prominent breeder of thoroughbred and excellent breeds of Welsh cattle, and as the possessor of the largest and best herd in Wales. His stock is based on the black and white breed, and the Welsh farmers are under a great obligation to him for introducing him into the Principality in the welfare and opening a market of such promise and extent. The herd which he now possesses in America is certainly one of great merit. The heifers are handsome to look at, and the cows are large, and has a straight back, good shoulder, strong neck, well filled thighs to the hocks, and legs well set. The head projecting well forward, fine short head, broad forehead, and is altogether a notable herd.\n\nHOT COFFEE.\n\nThe Easiest Way TO GET A CUP OF The Best Coffee IS BY USING Lyman's Fluid Coffee\n\nNO COFFEE POT NEEDED.\n\nCan be made in Two Seconds, in a china cup, a glass tumbler, a pitcher, or anything that will hold hot water.\n\nEconomical Convenient Nourishing!\n\nFor sale by Grocers and Drugists Everywhere.\n\nPound Bottles (makes 10 cups) $1.00. Half-pound bottles (makes 5 cups) 50 cents. Quarter-pound bottles (makes 2½ cups) 25 cents.\n\nHELP ALONG OR GOOD WORK\n\nBy sending in Your Subscription.\n\nOnly $1.00 per Year\n\nTo everyone who subscribes before February 1st, we will give free of charge a copy of the latest number of THE WEEKLY MANITOBA, containing 36 pages, full of useful information, and containing the latest news from the West.\n\nThe Weekly Manitoban\n\nOne of the Best Family Newspapers in the Dominion, for one year\n\nLatest Cable Intelligence,\n\nCanadian News in Detail,\n\nAnd the most complete record to be found anywhere of the News of Manitoba and the Northwest.\n\nThis last department has been made a strong feature of the paper, in addition.\n\nThe Family Department\n\nEmbraces an interesting serial, general reading for leisure moments, chat chat, and valuable household recipes. New subscribers will also receive a copy of the latest number.\n\nMedical, Veterinary & Legal Departments\n\nCompliments to all subscribers who renew their subscription for another year.\n\nAddress:\n\nThe Business Manager,\n\nManitoban Office,\n\nWinnipeg, Man.\nRapid City Ripples.\n\nCHEESE FACTORY.\n\nA meeting of the patrons of the cheese factory was held here on the 20th inst., Mr. J. McNaught, presi-\ndent, Mr. G. Grant, vice-president, and Mr. D. Naught, secretary-treasurer. Managing com-\nmissioner, Mr. D. Naught; R. Morrison, J. Parker, Geo. Grant, and Mr. Findlay.\n\nAll present seemed convinced that the factory should be carried on. It had proved successful last year and was likely to be more so this year. Patrons signed the list for it.\n\nIt was moved by D. Naught, seconded by Geo. Grant, that a cheese be made at each fair, for exhibi-\ntion at the local and provincial fairs; also to be sent to the Colonial Exhi-\nbition in England.\n\nMr. A. Petersen, cheesemaker, addressed the meeting, giving an excellent talk on the man-\nagement of cows and the handling of milk. It may be said of the cheese manufactured at the factory, that the managers felt bound to bear of one complaint from purchasers of an inferior article having been sold them.\n\nDr. Harrison, M. P. H., has in-\ntroduced a bill in the Legislative Assembly for the incorporation of railways. It incorporates Senator Sutherland, K. McKenzie, D. H. Macdonald, J. B. Macdonald, and Mr. Archibald of Winnipeg, as the Saskatchewan and Western Rail-\nway Company. The company is to be the first directors. The company is to have power to build a railway from Edmonton on the North-Western Route to Northwestern Railway near Minnedosa and Rapid City, thence westerly to the Assini-\nboine River, and thence northerly of said line. The Consolidated Act of 1879 is to apply to the company, excepting the particular-\nties. The capital is placed at one million dollars, with power of in-\ncrease, the shares being $100 each.\n\nEDMONTON.\n\nFrom the Edmonton Bulletin—\n\nJoe A. Longhead of Calgary, al-\nleges an application for a charter for the Macdonald, Edmonton and Cal-\ngary Railway.\n\nA prospecting party will start for Smoky river in a few weeks, or as soon as the snow has gone sufficient-\nly to allow travel.\n\nA son of G. Donald, south side accordionist also himself in the arm who has been away for several days\nweek. He must lose his arm before the elbow.\n\nSam Jones, the evangelist says:\n\n\"When I began preaching, I was afraid I should hurt somebody's feelings. I found that I asked the\nNewspaper men generally to go through some exercises. The\nfirst time a man raised his weapon,\nhe tries to please everybody and\npleases nobody. Nobody at about five\nwhile hunting for a few weeks ago\nto suit himself, and finds that it\ngives better satisfaction generally.\"\n\nThe C. P. R., grateful to their credit, has offered a reward of $500\nfor losses incurred in connection\nwith the wreck of the Algoma. A\nmember of the Board of Directors\nhas received a letter offering the full\nvalue of freight owned by them\nwhich went down with the ill-fated vessel.\n\nOnly $100 for The Progress for\none year, six pages thirty columns.\nMore reading for less money than\nany other paper in the Northwest.\n\nANXIETY CURED.\n\nAn old woman, retired from active\nbusiness, had been suffering for years\nfrom rheumatism. She came to a local\nIndian missionary the formula of a simple\nremedy recommended for the speedy and\npermanent cure of rheumatism. She took\nit faithfully, and in a few weeks was able\nto move about without pain. She recom-\nmended the remedy to others, and they\nwere cured. The secret of the cure is\nnow known throughout the country.\n\nGRAND COLONIAL EXHIBITION\n\nIn London, England, 1883.\n\nFORTY-FOUR THOUSAND FLEET RESERVED FOR CANADA.\n\nFirst Royal Exhibition Commissioned here since 1862.\n\nTHE PROGRESS Book and Stationery Store now open.\n\nOUR FAMILY WRITING MACHINES.\n\nThe best writing machines in the world.\n\nMAIL CONTRACT.\n\nThe Toronto Weekly Mail.\n\nTHE MAIL.\n\nToronto, Ontario, Canada.\n\nSPECIAL OFFER.\n\nTo all subscribers of THE QU'APPPELLE PROGRESS who desire to continue to receive the WEEKLY MAIL for one year for 50 cents, making the price of both papers 25 cents per week, we offer the following special offer: The publishers reserve the right to do this. Take advantage of this chance.\n\nWEBSTER'S PRACTICAL DICTIONARY.\n\nSQUARE AND UPRIGHT PIANOS.\n\nCorrespondence and Illustrated Catalogue.\n\nCOLLECTIONS OF EVERY DESCRIPTION COMPLETE.\n\nLYMAN'S UNIVERSAL PAIN RELIEVER.\n\nFOR Frost Bites, Cramps, Rheumatism, Neuralgic Affections, Tic Doloureux.\n\nSafe Mild Pure\n\nEvery description of BICK AND JEB PRINTING.\n\nEnclosed in the office of The Qu'Appelle Progress.\n\n25 cents a bottle.\nHOME & GOSSIP.\n\nQU’APPELLE.\n\n—Yesterday was All Frosh Day.\n\n—Mr. A. McLeod has moved out to his farm.\n\n—A new hardware store will be erected here shortly.\n\n—Mr. Fred Hodgson has returned from the east.\n\n—A marriage at: the tips at Spearham settlement.\n\n—Teachers are asked for the digging and care of a town well.\n\n—Mr. H. A. Askrod, of the Fort sponsor, several days in town this week.\n\n—Mr. A. T. Patterson returned on Wednesdayfrom a trip to Prince Albert.\n\n—Mr. Max and bride of Q’Appelle arrived here from the east on Tuesday morning.\n\n—The snow on the open prairie following spring seeding has been done.\n\n—The plant for feeding the C. P. R. herd will soon arrive and will be got on the road as soon as possible.\n\n—Mr. Holt, Kenneth Macdonald, who left here last fall for Ontario, are thinking of returning to the Northwest.\n\n—On the election of his office as Chairman of the Town Committee, Mr. E. Daniels is entitled to the distinction of this honour.\n\n—Mr. Gilbert McConnell left yesterday for his farm. He intends to suppy the town with lettuce and radishes and invites everyone to visit the newly built dwelling lot.\n\n—It no longer necessary to go to Regina to make applications for permits for building work to be done there through Mr. F. L’Allier, Dominion Lands Intelligence Officer.\n\n—Messrs. Russell and David, brother-in-law partners, have raised by Mr. T. Welch, of this place. It was only twenty-one months since they moved in when raised 500 pounds of meat.\n\n—The trustees of the Qu’Appelle school have decided to build a new brick schoolhouse. The furnishing of text-books and everything else is included.\n\n—Advertising is being placed for the sale of flour, eraser sets, etc. etc. etc.\n\nEDGELY.\n\n—Mr. Cameron, manager of Edgely farm, ordered Wednesday to push forward the spading work.\n\n—Mr. David Thompson has returned from Wisconsin where he was spending the winter.\n\n—Mr. Bell has arrived with a carload of stock.\n\n—Mr. Fallis, nephew of N. Fallis, has come here to settle.\n\n—Mr. Hillis Wright has sold a number of horses to a gentleman in Regina.\n\nINDIAN HEAD.\n\n—School has been commenced on Tuesday in the old Fort Hall. There are now two thousand children attending school in the district after Spalding’s school started out twenty-three pupils.\n\n—Mr. Riggs has recently returned from Ontario but not alone. He is now taking his first lessons in merchandising and domestic life. We hope so for the best.\n\n—Last Sunday Rev. Thos. Lang, of Qu’Appelle, occupied with much zeal, the pulpit in the Bannock, Idaho mission Station.\n\n—The Royal Toasty of Temperance was called Monday evening, most debates the question, “Is the consumption of the Lord of England, if abominable?” The Council is gradually growing stronger in their adherence to all programs under the heading of “Good of the Order.” Each evening sees more members arrive. It is a pleasure to watch an excellent organisation and we confidently expect more and more members will be added to it.\n\n—On Saturday evening last a public meeting was held in the school house which was largely attended. The wise men discussed the proposed change in the northern mails route. Mr. A. M. MacLary was chairman of the meeting. Mr. Murray presided at temporary of the meeting. Mr. Lester Gordon succeeded Mr. Murray and moved a resolution setting forth the facts in connection with the present situation of the Post Office. A substance of which has already appeared in our editorial columns. Mr. Murray also moved that the Postmaster General be nominated the Papers of the meeting. Telegrams were sent to Prime Minister Borden and Prince Albert on the subject asking these figures to protest against the proposed cuts.\n\nTOWN COMMITTEE.\n\nThe Committee appointed under the Municipal Ordinance to act for the Town Council, has made recommendations to the Council at their Municipality in regard to town improvements at the Commercial Street. Messrs. M. E. Shore, J. McPherson, E. Daniels and Mr. Traprock.\n\nApplications for the position as School Committeeman are received by Mr. Shaw to extend Daniels as chairman of this Committee. Mr. Eldred Shore was appointed Secretary.\n\nMoved by Mr. Elder, seconded by J. McLellan, that the committee shall consider the letters and requests received by the committee for such a time as may be deemed fit until the same shall be decided what action should be taken regarding the complaints mentioned above.\n\nMoved by Mr. Elder, seconded by J. McLellan, that the committee go into the matters of the town council and see to what extent those matters shall be brought to the notice of the municipal authorities.\n\nMoved by Mr. Elder, seconded by J. McLellan, that the committee be instructed to enter into correspondence with their authority regarding the matter of complaint.\n\nAny motion regarding the matters mentioned in the above report may be submitted to Mr. Elder.\n\nPUBLIC SCHOOL REPORT.\n\nThe following are the marks obtained by the students of the town as mentioned below for the fortnight ending 13th March, 1896.\n\nFIRST CLASS.\nH. W. Hamilton: 24; Lloyd MacLean: 25; R. T. Taylor: 26; L. Lee: 27; Burnet Scott: 22; Thomas Scott: 23.\n\nSECOND CLASS.\nT. Olney: 11; E. Brown: 12; M. J. Davis: 10; J. G. Ross: 9; A. W. Spicer: 8.\n\nTHIRD CLASS.\nT. R. Jackson: 7; J. Scott: 6; J. H. Wilson: 5; J. Bishop: 4; F. L. Milne: 3; A. W. Groom: 2; J. Robins: 1.\n\nQu’ Appelle Roller Mills,\n\nWe beg to announce that our Roller Mills at Qu’Appelle Station are now in operation, and that we are prepared to supply the Farmers of the Municipality of Qu’Appelle, with Flour, Bran and Shocks in exchange for Wheat via the most liberal terms.\n\nWe are also prepared to buy Barley and oats for Feed.\n\nWe will pay the following prices to wheat delivered at Mill: No. 1 Hard 70 cents per bushel; No. 2 Hard 67 cents per bushel; No. 2 Southern 60 cents per bushel.\n\nThese prices are higher than the prices paid on any other market in Manitoba or the North West Territories.\n\n—D. H. McMillan & Co.\n\nSYMPATHY.\n\nWe regret to announce the death of Mr. C. M. Smith, for many years connected with the railway business, whose death occurred on Thursday night last.\n\nIN MEMORY.\n\nJames Weill, deceased Sep. 25, 1896. Born in Manchester, England, Dec. 2, 1834; died at Qu’Appelle Station, Mar. 26, 1896. Long resident in this country.\n\nMiss Caroline Williams, late wife of Mr. John Williams, formerly of Hamilton, England, died May 25, 1896. Born in England, July 5, 1832; died at Qu’Appelle Station, May 23, 1896.\n\nANGLICAN CHURCH.\n\nSunday Services—at 9 and 11 o’clock (prayer services at 8:30 a.m., on Wednesdays, five Sundays in July).\n\nHoly Communion—Sundays at 10:30 a.m., every other Sunday, except the fourth Sunday in August.\n\nRev. F. H. Moore, Rector; Mrs. F. H. Moore, Junior Warden.\n\nTHE PEYTON ST. PEYTON’S COMMUNION SERVICE—Sundays at 10:30 a.m., and Holy Communion—Sundays at 11:30 a.m., Saturdays at 11 a.m.; Sundays at 10 a.m., Holy Communion, except second Sunday in each month.\n\nMETROPOLITAN CHURCH.\n\nServices every day at 9 o’clock, except Mondays and Fridays.\n\nRev. J. B. Glennie, Rector; Rev. Charles B. Burt, Assistant.\n\nROMAN CATHOLIC CHURCH.\n\nDaily Mass—at 7 o’clock.\n\nRev. Father Liam Geary, S. J., Pastor.\n\nWASHINGTON COUNTY.\n\nUPSTATE NEWS.\n\n—Miss Cauman has returned from a visit to friends in Manitoba.\n\n—Parties wishing to purchase horses may call and visit this locality.\n\n—A three-year-old mare named Miss Freda waiting for two foals at Christmas time; also, a thoroughbred mare named Yankee Doodle.\n\n—For sale: Two yearling thoroughbreds named William and Robert. In addition, we have a pair of thoroughbred mares named Polly and Maggie.\n\nBALDREES.\n\n—Miss Cauman has returned from a visit to friends in Manitoba.\n\n—A thoroughbred mare named Miss Freda, waiting to breed, named Yankee Doodle; also, a thoroughbred mare named Polly and Maggie.\n\n—We hope to sell horses as stated.\n\n—We have also sold horses as stated.\n\nBEAUTIFUL STOCK OF HORSES TO BE SOLD.\n\nHorses & Stock for Sale.\n\nWe have an extensive selection of mares and geldings in our stable. With good care, these animals will make excellent breeding stock, and will produce stallions of great merit.\n\nWe have also sold harnessed teams, and can offer horses of every quality at reasonable prices.\n\nWe have also sold thoroughbred mares by the yearling.\n\nWe have also sold thoroughbred mares and stallions.\n\nPublic Notice.\n\nNOTICE.\n\nCall of the Agricultural Society.\n\nSPRING SHOW DAY.\n\nSaturday, May 1st, 1896.\n\nFirst prizes in each class will be awarded to the exhibitor submitting the best entry of each kind.\n\nExhibitors are requested to bring their entries on the day of the show.\n\nPublic Notice.\n\nCall of the Agricultural Society.\n\nSPRING SHOW DAY.\n\nSaturday, May 1st, 1896.\n\nFirst prizes in each class will be awarded to the exhibitor submitting the best entry of each kind.\n\nExhibitors are requested to bring their entries on the day of the show.\n\nPublic Notice.\n\nCall of the Agricultural Society.\n\nSPRING SHOW DAY.\n\nSaturday, May 1st, 1896.\n\nFirst prizes in each class will be awarded to the exhibitor submitting the best entry of each kind.\n\nExhibitors are requested to bring their entries on the day of the show.\n\nPublic Notice.\n\nCall of the Agricultural Society.\n\nSPRING SHOW DAY.\n\nSaturday, May 1st, 1896.\n\nFirst prizes in each class will be awarded to the exhibitor submitting the best entry of each kind.\n\nExhibitors are requested to bring their entries on the day of the show.\n\nPublic Notice.\n\nCall of the Agricultural Society.\n\nSPRING SHOW DAY.\n\nSaturday, May 1st, 1896.\n\nFirst prizes in each class will be awarded to the exhibitor submitting the best entry of each kind.\n\nExhibitors are requested to bring their entries on the day of the show.", "source": "olmocr", "added": "2025-10-06", "created": "2025-10-06", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_sask_test/QPP_1886040201.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 8948, "total-output-tokens": 6742, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 6048, 2], [6048, 8926, 3], [8926, 12775, 4], [12775, 17245, 5], [17245, 26969, 6]], "primary_language": ["en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]