[{"id": "50979468d8f4544d7974a0c6d7c2b0c92f4a43ea", "text": "God's word the safest guide.\n\ncannot hate them, but him is hated; the reason followeth, not for injury but for innocence, not for falsehood but for truth: he testified that the works thereof were evil.\n\nWhat is the cause that true pietie and grounded sincerity is of so small account, but because the world of the unregenerate lieth in wickedness, and faith to carnal affections bringeth little contentment? How can it be that oppressors, extortioners, usurers, these idolatrous worldlings, together with thousands of delicious prodigals, should entertaine the Gospel: since Zacharias must divide his goods, Matthew must bid farewell to his place of customary receipt; yea the people of God must use this world as if they used it not? How hard therefore will it be for such as trust in uncertain riches, to subject themselves to this life of faith? May not Gods Ministers take up a lamentation, What happy tidings from the word of faith which we preach! how is the way to everlasting bliss plainly beaten forth, yet how few delight to walke in it? How sluggish are our common professors, that cannot watch one hour?\n\nGod's word the safest guide.\n\nhouse? and how faithlesse are those backsliding hypocrites, as if the unchangeable possession of heaven and earth were unfaithfull, or unable to recompence and fully reward his faithfull people?\n\nThus we see, that straight is the way, and small is the number that go it. Ephraim is an untruly heifer that will not be tamed. Ever have Gods Saints been like the shaking of an olive after the vintage. Wicked men are mad men; they will not be ordered; they are deaf men, they will not hear, charme the Charmer never so wisely. If that be faith which is not done of faith, how wofull will it be with the greatest number, who neither know nor believe, being blinded and dissolute: having from their monage to their old age wandred from the waies of God, being seven fold more the children of hell then they were in their mothers wombes? If all actions that want faith be sins, how many are the sins of those who were never enlightened with the knowledge of God? My text hath driven me into such a narrow strait, & so paled me in, that I cannot get liberty, either to licence the novelties of the Athenians,", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Worthington - 1620 - The ground of a Christians life Deliuered in a sermon at Harwood in Lancashire, the first day of Dec_page_22.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1890, "total-output-tokens": 542, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2248, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]