[{"id": "76ad976e9c2e57feeacac71b274e4a95f03e0d27", "text": "All sorts of\n\nthem with your knife, and season them with Salt, Nutmeg, Mace and Pepper, and having first wash'd your Pork on the inside with yolks of Eggs, wash the outside of your Veal therewith, and lay it within your Pork; lastly, throw on your remaining seasoning, and rowl it up hard, binding it with Tape: when it is boil'd, sauce it in some of the same liquor, with a little Vinegar, beaten Pepper and Ginger; when you serve it up, stick your Pork with Bay-leaves or Rosemary and Flowers, garnishing your Dish with Flowers and Sage.\n\nRams head souced.\n\nCut the head off, with a good part of the neck adjoining to it, and boil it with the skin on a good while; when it is thoroughly boiled, (which will require considerable time) take it up and pluck off the skin, then take Broth you have boiled some fresh meat in, and boil it over again, with Vinegar, Salt, a good handful of sweet Herbs, Ginger, Pepper, a good piece of Horse-raddish root scraped, and a quarter of a pound of French-barkly; being boiled, strain them through a bag, and sauce the head in it; you may serve it up either in slices, or whole with the horns on.\n\nSides of Lamb souced.\n\nBone your side of Lamb, soak it and squeeze it well from the blood, wipe it dry, and season the inside with beaten Nutmeg, Ginger, some sweet Herbs minced small, whole Coriander-seed, minced Lemon-pill and Salt; lastly, some slices of broad Lard over all: then rowl it up in a Coller, and tye it up in a clean cloth, put it into your liquor when it boils, and scum it very well, and then put in sliced Ginger, sliced Nutmeg, Salt, Fennel and Parsley roots; being almost boiled, put in a quart of White wine, when it is enough take it off, and put in slices of Lemon, with the Pill of two whole Lemons; boil it close covered, to make the Veal look white.\n\nThus you may order a breast of Veal, or any joyn't of Mutton, Kid, Fawn or Venison.\n\nSwan coller'd.\n\nBone your Swan, and part the two sides, season it according to the foregoing directions in the soucing of Geese, season it with", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1690 - The compleat English and French cook describing the best and newest ways of ordering and dressing al_page_122.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2120, "total-output-tokens": 547, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2041, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]