[{"id": "9e745771be4e6f1919cc874808a7be2db86bdd75", "text": "settled with their Wives and Families on the Island; much less to 1500, as there actually were, before the English had the Affiento?\n\nWhen the Company purchased their Negroes in Jamaica, great Numbers were brought to that Market, which indeed occasion'd a Circulation of Money for a little time; but since they have fallen into the Method of sending to Africa to purchase Slaves, they have drove several private Merchants out of the Trade; and if they pursue the same Measures, will, in a little time, engross it to themselves; this will be the same Thing in its Consequences, as if they obtained an exclusive Charter, which has been so much dreaded and opposed by the Merchants of Bristol, and other trading Towns as well as London.\n\nAs to the Advantages, which the Island is said to receive by the Shipping which import Negroes into Jamaica for the South-Sea Company, are they any new Acquisitions, or equal to what they formerly had even in that Respect; were not Ships employ'd, before the South-Sea Company obtained the Affiento Contract, to transport Negroes for the Spanish Trade, as well as for the Use of the Island? It is evident, that not only those Ships, but their Cargoes belong'd to private Merchants in London, Bristol, and Liverpool, who employ'd Factors settled in Jamaica, and the supplying the private Traders with Negroes was very beneficial to them, as well as to the Inhabitants; and those Factors not only employ'd a great Number of People under them, but purchased the Produce of the Island to load their Ships; and the Money laid out by those Means, as well as for Stores and Necessaries, circulated in the Island, and occasioned a Life and Spirit amongst them.\n\nFourthly, THAT there had been a greater private Trade carried on from Jamaica, since the Year 1723, than in eighteen Years which he had known the Island.\n\nHere I am at a Loss how to take that Gentleman's Meaning; if he would be understood a Trade carried on by the Merchants who reside in Jamaica, it is contrary", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1728 - Some observations on the Assiento Trade_page_22.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 471, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2001, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]