[{"id": "7a0a59f28a928c82ffbc066953966b2344748f2a", "text": "The Gentlewoman's\n\nYolks of two Eggs 1/2, one Yolk of\nDissagot, and 1/4 more yolks according\nto the quantity of your Ale: beat them\nvery well, and take away the skin of the\nyolks, and then the Ale boils put them\nin, and keep them boiling continuously:\nand when it has cooked a while, sweeten it\nwith Sugar; and if it be to eat, cut two\nor three loaves of White bread, take them\ndry, and put them to the Candle, but if it\nbe to distill put in sons.\n\nTo Stew Beef.\n\nTake a good Rump of Beef cut from\nthe bones, shred Turnips and Carrots\nsmall, with Spinach and Lettuce, put\nall in a Pan and let it stew four hours\nwith so much Water, and a quart of\nWhite-wine as will cover it, some\nPepper and Salt: when it is stewed\nthen put in a wine-glass full of good El-\nder Vinegar, and serve it with Sip-\npits.\n\nTo Boyl a Gammon of Bacon.\n\nWater your Gammon of Bacon\ntwenty-four hours, then put it into a\ndeep Kettle with Sweet Hay, let it boil\nsoftly six or seven hours, and then take\nit up with a Scummer and a Piats, and\ntake off the Skin whole, then stick your\nGam-\n\nCabin'et Unlocked.\n\nGammon full of Cloves, and strew on\nsome grols Pepper, then cut your skin\nlike sippits to garnish your Gammon:\nand when you serve it, stick it with\nBay-leaves.\n\nTo Boyl Brawn.\n\nWater your Brawn twenty-four\nhours, wash and scrape it four or five\ntimes, then take it out of the water and\nlay it on a clean Table, and throw an\nhandful of Salt on every Collar, then\nbind them up as fast as you can with\nHemp or Hals, and put them in your\nKettle, when the Water boils, and\nthe scum arises, take it away: Let it\nboil so tender that you may thrust a straw\nthrough it, then let it cool till the next\nmorning, and serve.\n\nTo make a White-pot.\n\nTake the milk and sweet Cream,\nand boil it with good Rose of Sugar and\nCinnamon, a little Rose-water: then\ntake it from the fire and put into it clean\npicked Rice, but not so much as to make\nit thick, and let it steep therein till it\nbe cold: then put in the Yolks of six\nEggs and two whites, Currants, Nut-\nmeg and Salt: then put it into the Pan\nor Pot, as thin as if it were a Custard,", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1675 - The gentlewomans cabinet unlocked wherein is contained many excellent receipts for neat dressing of_page_8.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 643, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2102, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]