[{"id": "64bc94b9ea4efbed45b668c802b165c0dd383b7e", "text": "and suddenly to abolish the existence of the commerce would not be productive of real disadvantages, in place of effecting the end desired by those who are eager for such strong and speedy measures? For solving this important question, we must take into view, not only the situation of the slaves in Africa, but of those already in the West Indies.\n\nIn the first place, It is false reasoning to suppose that Britain, withdrawing her share from the general demand, will effect a decrease of the quantity brought to the market; for although in other kinds of commerce the supply is generally regulated by the demand, yet in this instance the rule will not hold. When two African states are at war, the captives are dealt with in proportion to their strength and appearance. The old and infirm are massacred on the spot; such as are able to travel a long journey are led to the sea-coast, and of these all who are rejected are immediately put to death. From this it appears, that were Britain to withdraw her demand, there would be left a superabundance of about 38,000 every year; who, unless bought up by other nations, must inevitably be sacrificed to the disappointed avarice of the black trader. Instances, indeed, of this barbarous practice are so numerous, that they have been frequently perpetrated in sight of our own shipping; so that in this case the remedy becomes abundantly more horrible than the disease.\n\nSecondly, Let an unprejudiced mind reflect upon the situation of the remaining negroes, in the West Indies.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Edwards - 1798 - The history, civil and commercial, of the British colonies in the West Indies_page_211.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 347, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1525, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]