[{"id": "9c8e36ea4e7fbd3bc9de86696e7746db736def74", "text": "WHEREAS the QUEEN has been pleased to direct, that a Monthly Correspondence be Established between this Kingdom, and Her Majesties Dominions on the Continent of America; Packet-Boats will be sent from Bristol to New-York, between which last Place, and the several Provinces, Colonies, and Settlements of New-England, East and West-Jersey, Pennsylvania and Rhode-Island, Regular Inland-Boats are already fitted, and others are about to be fitted, through Maryland, Virginia, North and South-Carolina, for the more Easy and Expeditious Conveyance of all Letters and Packets, which shall be Conveyed by means of the said Packet-Boats.\n\nII. THAT the following Notice is hereby given, and that shortly a prefix'd Time will be published, when Letters and Packets will be taken in at the General Post-Office, and at the several Post-Offices throughout Great-Britain, and Ireland, and a Day be appointed every Month, when the Mail will be dispatched from the General Post-Office for Bristol, from whence the Packet-Boats are to take their Departure.\n\nTHE Rates for the Portage of Letters and Packets, to, and from the General Post-Office in London and New-York, being as follows.\n\nFor every Single Letter, not exceeding 3½ d.\none Sheet of Paper,\n\nFor every Double Letter, not exceeding 2½ d.\ntwo Sheets of Paper,\n\nAnd in Proportion to the same Rates for every Packet of Letters.\n\nAnd for Packets of any kind of greater Weight, for every Ounce\n\nTHE PACKET-BOATS are to be of the Burthen of about Eighty Tons, built on purpose for Sailing, of Strength to resist the Sea, well Mann'd, and Commodiously Contrived for Entertaining Passengers, who will be kindly Received, and Entertained on Board, on Easy Terms.\n\nTHE said PACKET-BOATS are permitted to carry out upon Freight, the Quantity of Five Tons in Goods, and bring Home Ten Tons, whereby all People may send small Parcels to New-York, or any other Place thence by Land-Carriage, and be accommodated therein at Reasonable Rates. As they may be more Particularly Informed by William Warren, Undertaker of the said Packet-Boats, in Crown-Court, in Gracious Street, London.\n\nPrinted by J. Sewle, in White-hart-Court in Gracious-Street.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1710 - Whereas the Queen has been pleased to direct_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 553, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2176, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]