[{"id": "009f50d3f1fed3c53f760c35f66e720987bea03d", "text": "Concerning Aliens\n\nSir Peter Killigrew's; I stayed but few hours at Penryn (the Wind being at North-west, which was fair to set Sail for Holland,) but went that night for Falmouth; where I found that my Information was true, and it being Sunday the next day, I intended only to have an Eye upon the Ship, and on Monday to examine into the Truth of the whole. But on Sunday morning, to my surprize, I was invited to Dinner by Sir Peter; accordingly I waited on him, and after Dinner he took me aside, and told me divers things relating to that Ship, which made me very much admire, for that I knew Sir Peter was not bred a Merchant, and that this Ship in particular was dispatch'd by Mr. Bryan Rogers a great Merchant in that place: But I soon found out the meaning of his being so Earnest, and it was this, Sir Peter Killigrew had a little before Built a Key at the Rump end of the Town of Falmouth, and Houses thereon; which Key he got by Friendship to be declared the only publick Key for Shipping and Unloading of Goods and Merchandize, according to the Act of Frauds 14 Car. 2. which did belong to that Town and other Ports adjacent, (though to that very place it is no more proper, than for all the Goods that come into London to be Landed at Ratcliffe.) And a Merchant dwelling in the Body of the Town, near the Marketplace, protested that the Charges of Landing his Goods at that Key, and bringing them to his House, cost him as much as the Freight thereof from Plymouth did, (which is about 20 Leagues distant;) also the Custom-house &c. was newly settled there, and this was the first Ship of any great concern that ever had Unloaded at that Key, which had acted to ill, that he doubted it might administer new matter of debate, &c. In fine, I promised Sir Peter not to act anything till morning, and then would be as moderate as the Case would possibly bear, and Sir Peter promised the Ship, (being called the Experiment of London, Henry Sutton Master,) should not stir; and so we parted, with intention to meet again next morning: On which I went towards my Lodging and in the way met Mr. Daniel Shewell the Surveyor, with whom I had some Discourse, and then went into my Lodging, being the Sign of the Fece, kept by Mr. Dennis Rustel, Notary publick, and then Mayor of the Town; I had not been there long before Mr. Mayor came accidentally into our Company, and said, He thought the Quaker was mad, (meaning Sutton the Master of the Ship) for that he was hunting about for his men to get them onboard, in order to set Sail immediately for Amsterdam: Then 'twas high time for me to stir, and accordingly I did, getting on board as soon as possibly I could, where I laid a stop on the Ship, put Wayters on board, &c. to secure her; and because I knew all the Officers in Falmouth had some hand in her Illegal dispatches, &c. And that I could depend on the Friendship of none there but Mr. George Webbill Deputy Customier, and Mr. Peter Hill Land-wayter; I sent to Mr. Thomas Enys Collector of Penryn for assistance, which I readily had, and so the Ship was stopt: The next morning early, I had notice that the Mr. endeavoured to force his way, on which I applied to Major Collins Deputy Governour of Pendennis Castle, under the Right Honourable my Lord Arundel of Trerice, for assistance in Case of necessity; who frankly complied with my Request, and assured me the Ship should not go out without my Order; Then I returned to meet Sir Peter Killigrew at Custom-house, where I found both Him and Mr. Rogers; I told them on what grounds I had stopt the Ship, that the Goods were Forfeited by the Acts of Tonnage and Poundage the 12 Article to the Book of Rates and by other Statutes, they being Jews Goods, which ought to pay Alien Custom, and contrary to Law had been all Entered in the Name of Henry Sutton an Englishman: They both seemed concerned at the Discovery, and used many Arguments to persuade me to let the Ship pass; and particularly, for my doing, I should have 50 Guineys, and the best Horse Sir Peter had: But all their Arguments prevail'd no farther with me, than that I would give them a Meeting again next morning, by which time I had got the following Information from five Sea-men belonging to the same Ship on Oath, viz.\n\nWe Thomas Bummer, Richard Randall, Nicholas Downing, Thomas Dawson, and Robert Adamson Mariners, lately belonging to the good Ship, the Experiment of London, Henry Sutton Master, of the Burthen of three hundred Tuns or there abouts, Laden with Sugars and other Commodities, bound from the Island of Barbadoes to some Port of England, and from thence to Amsterdam: And upon the Holy Evangelist do freely and voluntarily Swear, that they arrived in the Port of Falmouth in the Kingdom of England, on or about the 27th day of September last past from the said Island of Barbadoes. And these Deponents farther say, that the greatest quantity of the Sugars and Merchandizes loaded on board the said Ship, do really belong to Jews, and particularly to Aaron Barfoe, Abraham Barralle, one Redhigo and Lewis", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Hayne - 1685 - An abstract of all the statutes made concerning aliens trading in England from the first-year of K._page_12.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 1208, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5052, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]