[{"id": "b9d7c056a252b28540fff52ed39c2b97b81d34bb", "text": "Complaint, no Publick Right their Claim, or Good their demand; in all which, the least breach of Privilege is usually branded with Sacrilege: And though there lies no Appeal to the dispersed Body of the People, (a Decision manifestly impracticable in Government, and fitter indeed for Tribunes to move, than Nations to admit) yet (Elections being so popular, and Conventions frequent) the same end is attained with much more safety and convenience. As to the Executive Part of the Prince's Power, he exercises it by Ministers and Officers, not only sworn, but severely accountable: And though both He and the Lords have their Negative in passing of Bills, and it be the King only, that by his Royal Pint, makes our Laws; yet no Tax being imposed but by the consent of the Commons, nor any Law (without it) of such validity, that the Ministers of Justice will enforce it, there is a wise and sweet necessity for the King, and likewise for the Lords, to pass all such Bills as are convenient for the People, and not greatly hurtful to the Prince. And those that duly weigh the Reason of things, do find a Negative in the King to be a most safe preservative of Peace to the People, who have as much comfort under the protection of his Prerogative, as they have Benefit by their own Privileges; For in truth, this Bug-bear Negative (as our Republicans labour to represent it) is an impenetrable Target, to shelter and secure the Government from being alter'd at the Will of the Commons, if at any time they should again prove factious. This (being in reason manifest) has also been confirm'd by great Experience; our Kings having rarely obstructed any Bill which they might safely grant; but on the other side, pass'd many High Acts of new Grace; circumscribing their Prerogative, and clipping its Wings; nay better had it been for us, if they had not pierc'd its very Bowels.\n\nThis is that Triple-Cord that could never yet be broken, though it has been Cut asunder; This is our Gold (eventimes Refin'd); for every Bill, being thrice Read, Debated, and Agreed in Either House, is at last brought to the King for his Royal Assent; (which is the Mint of our Laws;) a Tryal so exact, that surely no Drofs can escape it; since all Interests must thereto concur; as truly it is but fit they should, in the Establishment of That which must Bind all. This is that Temperament, which purges our Humors, and (at once) endues us with Health, Vigour, and Beauty: No Vote is here precipitated; no Act huddled up; as by sad Events, you saw they formerly us'd to be, when the Power was engrossed by a pretended House of Commons, purg'd and moulded to the Interests of a Faction; a Consequence but Natural to such Premises! Nothing was (there) weigh'd, but as in a Ballance consisting of one Scale; our Laws were Mandrakes of a Night's Growth; and our Times as Fickle as the Weather of the Multitude.\n\nThe King has the Power of making War, but then he cannot well be said to have the Means; so that it does not amount to extraordinary much more, than a Liberty to Fly if he can get Wings. He has a Sword also; but Himself alone, very rarely draws it: And though he has the sole right in the Militia, yet is he pleased to wear it only as a decent Weapon; Vouchsafing to the Nation, in a large Degree, the Use and Benefit of it. He chuses his Ministers; (as who doth not his Servants?) but then they pass through such a Test, as none but the soundest Integrity can abide. He can hinder the stroke of Justice with his Pardon, (tho' still, the Faws not being muzzled, it will Bite terribly;) but then (on the Other side) the means of Relieving his Wants rests in the Commons, to Ballance his Will, and induce him to a Correspondence with Parliaments.\n\nThat his Person should be Sacred, is most Needful, to avoid Circulation of Accounts; Reasonable, since it carries with it the Consent of Nations; So, that he become not the meer Butt of Faction, and Malice, and be in a worse Condition than the Basst of Vassals; Honourable, that the Nakedness of Government be not daily Uncover'd; Wise,", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1680 - The Interest of the three kingdoms, with respect to the business of the black box, and all the other_page_10.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 995, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4065, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]