[{"id": "9c7bc6b2dab85850b1e91f61d0dbd00b839ec13e", "text": "usual Rates, to land such Goods at, or carry them from any publick Wharf, Barkadier, or Landing-place; and that the Persons belonging to such Wharfs, Barkadiers, or Landing-places, shall be, and are hereby required to permit the same: And whoever shall offend contrary to the true Intent and Meaning of this Act, shall, for every such Offence, forfeit the Sum of Forty Shillings; to be recovered before any Magistrate of the Parish or Precinct where such Offence is committed.\n\nV. And be it further enacted by the Authority aforesaid, That within one Month after the Day of passing this Act, the Fare and Hire of a Wherry with two Oars, between Port Royal and Kingston, shall be four Ryalls; and between Port Royal aforesaid and Paffe Fort, the like Sum of four Ryalls; and between Kingston aforesaid and Paffe Fort, the Sum of six Ryalls; and from Port Royal or Kingston to the several Places following, the Hire and Fare of such Wherries with two Oars shall be as follows, viz.: To St. James's Fort, five Shillings; to Bull Bay, ten Shillings; to Yallows, twenty Shillings; to Morant, or Port Morant, forty Shillings; to Old Harbour, Pig Bay, the Bogue, or Salt River, one Pound, and so in Proportion, that is to say, one Half more than the Prices respectively, as aforesaid, for Wherries with four Oars.\n\nVI. And be it further enacted by the Authority aforesaid, That such Wherrymen, as aforesaid, shall be, and are hereby obliged to ply from Break of Day to Eight o'Clock at Night, under the Penalty (if he be a white Man) that he shall forfeit ten Shillings; and if he be a Negro, he shall suffer thirty one Lashes, to be ordered respectively by any Magistrate, before whom Complaint shall be made.\n\nVII. And be it further enacted by the Authority aforesaid, That Weights and Scales shall be kept by all Owners or Persons employed for the keeping of publick Wharfs, Barkadiers, Bays, and Landing-places in this Island, to weigh, if required, all Sugar, Indigo, Pimento, Cotton, and other Plantation Goods, which shall come to such Wharf, Bay, Barkadier, or Landing-place, and the Weight thereof respectively shall be entered into a Book at each Place to be kept for that Purpose; and for such weighing and entering into such Books, as aforesaid, they shall be paid fifteen Pence for every Hoghead, and seven Pence Halfpenny for every Draught, be it more or less, of other Goods of all Sorts which shall be so weighed and entered, as aforesaid: And all Wharfingers and other Persons which shall receive any Benefit at any such Wharf, Barkadier, or Landing-place, shall give, or take Care that Receipts be given for all Goods which shall be delivered to them by any Person demanding the same, such Goods having been first weighed, as aforesaid: And whoever shall offend, either by neglecting to procure such Scales and Weights, or in not weighing the Goods delivered to them, and entering the same in a Book, as aforesaid, or not giving such Receipts, as aforesaid, upon Demand; every Person so offending, shall, for every such Offence, forfeit the Sum of Twenty Pounds; to be recovered in the Supreme Court of Judicature of this Island, wherein no Effein, Protection, or Wager of Law shall be allowed, or Non culti ulterius proequi be entered; any Law, Custom, or Usage to the contrary notwithstanding.\n\nVIII. And be it further enacted by the Authority aforesaid, That the Owners or Proprietors of any Hackney Coach or Coaches, Chariots, and four Wheel Chaîles, which shall ply upon the Road for Hire, shall have one white Man for each such Hackney Coach or Coaches, Chariot, or Chaîle which shall go ply for Hire; and the Hire and Fare shall be as follows, viz.: For each Coach to and from Paffe Fort to Spanish Town and back again, that carries four Passengers, thirty Shillings; for each Coach that carries three Passengers, five and twenty Shillings; and for two Passengers, or for one Passenger in any such Hackney Coach, Chariot, or Chaîle, twenty Shillings, and no more.\n\nIX. And be it further enacted by the Authority aforesaid, That the Owners of all Carts or Waines that shall carry Goods for Hire, shall be obliged to keep one white Man for the First Cart or Waine, and one white Man more for every two such Carts or Waines; and that the Fare and Hire for such Cart and Waine shall be as follows, viz.: For each Hoghead of Sugar, five Shillings; for each Barrel of Beef, Flour, Herrings, or Mackerel, the Sum of one Shilling and three Pence, and so in Proportion for Carriage of other Goods from Spanish Town to Paffe Fort, and no more.\n\nX. And the Owner of each such Hackney Coach, Chariot, or Chaîle, as aforesaid, and of each Cart and Waine, or some Person for him or her, shall give in an Account upon Oath at each Section of the Number of Hackney Coaches, Chariots, Chaîles, Carts, and Waines which they keep respectively, and of the Names of the white Man or Men particularly kept for each Hackney Coach, Chariot, Chaîle, Cart or Wains, Waine or Waines; which Oath the Justices at each Section are hereby impowered to administer and receive: And whoever shall offend contrary to the Intent of this Act, either in not keeping such white Man for each such Coach or Coaches, Chariot, Chaîles, Cart or Waine, or in not making such Oath, for every such Offence shall forfeit the Sum of Ten", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1743 - Acts of Assembly passed in the Island of Jamaica from 1681, to 1737, inclusive_page_118.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 1360, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5305, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]