[{"id": "57939f41d5395f2ecf3688550216da933420f5b7", "text": "Hell: For if they kiss in the Morning, being Friends, yet ere Noon they are ready to throw the House out at Window. The Papists affirm, *That Heaven is won by Purgatory*; but in my Mind, a Man shall never come into a worse Purgatory, than to be matched with a froward Widow. He that matcheth himself to a Widow and three Children, matcheth himself to four Thieves. One having Married with a Widow, it was his Luck to bury her, but not before he was sore vexed with her; for afterwards he lying on his Death-Bed, his Friends exhorted him to pray unto God, that his Soul might rest in Heaven; and he asked them this Question, *Whither (faith he) do you think my Wife is gone?* And they said unto him, No doubt, but that your Wife is gone to Heaven before you: He replied, *I care not whither I go, so I go not where my Wife is,* for fear I meet with her, and be vexed with her as I have been heretofore.\n\nAnother having Married with a Widow, being one Day at a Sermon, heard the Preacher say, *Whosoever will be saved, let him take up his Cross,* and follow me: This Mad Fellow, after Sermon was ended, took his Wife upon his Back, and came to the Preacher, and said, *Here is my Cross, I am ready to follow thee whither thou wilt.*\n\nAnother having Married with a Widow, which shewed herself like a Saint Abroad, but a Devil at Home; a Friend of her Husband's told him, that he had gotten him a good, still, and quiet Wife; *Yea marry,* quoth the Married Man,", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1704 - Female Policy Detected_page_73.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 403, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1457, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]