[{"id": "0b3fd71591d82ddf394a1313f176882858b309fc", "text": "Some Considerations Humbly Offered, against Granting the Sole Trade to Guiny from Cape Blanco to Cape Lopez, to a Company with a Joint Stock, exclusive of others.\n\nA Company with a Joint Stock Exclusive, is a Monopoly; which has always been esteemed a great Grievance in matters of Small Moment, and will be much more so in a Trade of so large Extent, and such vast Importance to this Nation, in the Export of its Woollen, and other Manufactures; and to the Plantations, in furnishing them with Negroes, by whose Strength and Labour all their Commodities which come from thence, as Sugar, Indigo, Cotton, Ginger, Tobacco, &c. are produced, and whereby the Navigation and Revenue of this Kingdom is so greatly Increased.\n\nAnd such a Company so established will have all the Mischiefs of a Monopoly.\n\nI. They will buy the Woollen, and other English Manufactures, proper for Guiny, at their own Rates, having no Competitors, and will sell all the Commodities they import from thence into England, at what Prices they please.\n\nII. In such Case they alone can carry such Negroes to the West-Indies as are fit for the English Plantations, which are only to be purchased between Cape Blanco and Cape Lopez, and so will make their own Prizes for them, and Impose what Terms they please on the Planters, as heretofore the African Company have done: and by buying Negroes dear, let of the West-India Commodities have been, and will be produced, and at greater Charge; whereby other Nations have already had an Opportunity, and have too well made use of it, to Vye with us in those Commodities; to the great Abatement of the Advantage of this Kingdom; and it may prove the Ruine of our Colonies: For if the Company have produced such Mischiefs by the Authority of a Charter only, What may be expected from them, if they should be established by a Law?\n\nIII. Such a Company having no Competitors, will buy as Cheap, and sell as Dear as they please; and so will get as much by One Thousand Pounds, as would be good Profit to Private Persons trading with Three times as much; and therefore it is not their Interest to enlarge the Trade, but to get as much as they can by the Small Stock they employ; whereas many Buyers would Enhance the Price of English Manufactures at home, and occasion a great Exportation of them, and lower the Price of Foreign Goods in England, and bring Negroes much cheaper to the Plantations, and thereby the Trade would greatly Increase.\n\nAnd though the Company now offer to content themselves to be limited from Cape Blanco to Cape Lopez, and to leave out Angola, yet that does not at all help the matter, for these Reasons:\n\n1. It is humbly conceived, That all the Subjects of England have an Equal Right to all parts of the Guiny Trade.\n\n2. The Extent of the Coast between Cape Blanco and Cape Lopez, is about 3000 Miles, besides up the Rivers in the Inland Country; and includes the whole Trade for Gold, Teeth, Dying Wood, and for such Negroes as are fit for, and desired at the English Plantations: For although there are Negroes to be had at Angola, and such as the Spaniards like, yet the English will not buy them, unless a few for their House Service; they being a lazy sort of Negro, and very rebellious: And the safety of the Plantations depends upon having Negroes from all parts of Guiny, who not understanding each other's languages and Customs, do not, and cannot agree to Rebel, as they would do, and has by sad Experience been found, when there are too many Negroes from one Country.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1712 - Some considerations humbly offered, against Granting the Sole TRade to Guiny from cape blanco to cape lopez_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 824, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3514, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]