[{"id": "6ee51cd429003b7000ade7e465fab0a24a4624ac", "text": "But the Bill says, Factors shall no longer be traded to, than whilst under the Protection of the Ambassador or Consul: To this it is answered, That they must continue so for their own Security; otherwise they must immediately fall into the State of Subjects of the Sultan, and must pay the Poll Tax; and as to the Regulations of the Company, they will be under small Difficulty of submitting to them; for in a little time their Nation must have the forming them. But this does not separate them from their own Nation, or exempt them from its Jurisdiction, to which they are, by the strongest Motives, bound.\n\nIt has been urged, that these English Jews are in no Connexion with those of Turkey, but will live separate as Englishmen: But it is known they are the very same People, as well Thoese as Thes, are generally Refugees from Italy or Spain. And thoese very Persons, who have thought themselves most interested in the Event of this Bill, are no more Englishmen, than any Constantinople Jew may be at any Time by Denization.\n\nIt is known to all who have lived at Aleppo, that the Leghorn Jews, who live there under French Protection, wear their Beards, and live and converse altogether with the Jews of the Place, with whom they intermarry. The chief Partner of the Jew at Smyrna, who has been, cited in a late Case, does the same at Smyrna; and it is known, that they all contribute, in some Form or other, either by a Rate or free Gift, to the Maintenance of the national Poor; which is a heavy Charge, and many of them have been heard to complain of it as such.\n\nSeveral of the Jews now living at Constantinople, and elsewhere, are descended from such as came from Italy under some foreign Protection; but, mixing there with their own People, the next Generation of them became Subjects of the Sultan: The same thing will no doubt happen with the English Jews; and as to such of them as may not marry, there are not wanting Inducements to their considering themselves as at Home in Turkey.\n\nThe Protection given to Stranger Jews, by the Christian Ambassadors in Turkey, is very different from what the English Jews are to have from this Bill; for those Stranger Jews are not considered as the Subjects of any one of the States by whom they are protected, but as Subjects of States not in Amity with the Porte; and who are allowed to resort to Turkey, under the Protection of some one of the Nations established there: But they are not received into the Community of any of the Nations they are under, or have a Place at their national Assemblies; nor can those who are protected by France, who are the greater Number, trade to or from France; and, in case of any Difficulties, they are to be helped out at their own particular Expense; they pay their Conflagration, and are exempted from being treated as Subjects of the Country; and even in this, their Pretensions are to be treated with great Moderation.\n\nThe Turks allow the Protection of their own Subjects by foreign Ambassadors, with the Commission of an Honorary Druggeman in the same Manner; and a Vizier, or other great Minister, will often ask this as a Favour, in Behalf of a Jew or Christian they may be disposed to favour.\n\nThe other Reason against admitting the Jews into the Levant Company, is, that they will in time get all the Trade into their own Hands; but this is the least Inconvenience that can happen by this proposed Regulation: This Apprehension is founded solely on the Preference they will have from their Brethren in Turkey: The large Communities of Jews there, have a great Influence, which will be employed in favour of their Brethren against the King's Christian Subjects; and it must and will bear them down in the End. They are not afraid of the Skill or Industry of the Jews; those are in every Man, as God has given him Talents, and he has employed them: Nor are they apprehensive the Jews, by their Economy, can go cheaper to Market than they; for they have seen as many Instances of Vanity and Excess in Turkey, amongst them, as amongst any other Set of People; and their national Expences there must be great. There have, indeed, been Suggestions that they could do Business for less Commission: But this is an Abuse; and there was lately a very flagrant Infractance at Constantinople, of a Jew House, which had pretended to mighty Matters of this kind; and a great Circulation was carried on for some time, but all ended in a scandalous Failure; the two Partners disappeared; some of the Creditors upon the Place got somewhat in a sort of Scramble, but for the foreign Correspondents, who were chiefly at Venice and Holland, there was not any thing left. What, therefore, the King's Christian Subjects hope for, is, that they shall not, by this Bill, be put within the Reach of a most undue Influence and Preference; which must be the Case, if the Jews come at all into this Trade.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1744 - Reasons against the bill now depending in parliament intitled a bill for inlarging and regulating the trade to the levant seas_page_6.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 1091, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4878, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]