[{"id": "37de75aa73cbabaf77ca775031f4041b20516ae8", "text": "of the Island of Barbadoes.\n\na galion, the people drink much of it; indeed too much; for it often lays them asleep on the ground, and that is accounted a very unwholesome lodging.\n\nThe eighth sort of drink is Beveridge, made of spring water, white sugar, and juice of Oranges, and this is not only pleasant but wholesome.\n\nThe last and best sort of drinke that this Island or the world affords, is the incomparable wine of Pines; And is certainly the Nectar which the Gods drunke; for on earth there is none like it; and that's made of the pure juice of the fruit itself, without commixture of water, or any other creature, having in it selfe, a naturall compound of all tastes excellent, that the world can yield. This drink is too pure to keep long; in three or four dayes it will be fine; 'tis made by pressing the fruite and straining the liquor, and it is kept in bottles.\n\nHaving given you a taste of the Bread, and Drinke this Island affords, which will serve any mans palate, that is not over curious; I could tell you what we have of both sorts that is brought to us from other parts of the worlds, as Biskets, Both fine and coorse, Barrels of meale clofe put up, which comes to us very sweet from England, and Holland; of which we make Bread, Pye-crust, and Puddings. And for drink good English Beer, French and Spanish Wines, with others, some from the Materas, some from Fiall, one of the Islands of Acores; So we cannot justly complaine of wants, either of bread or drink, and from England, spirits, some of Annifeeds, some of Mint, some of Wormwood, &c. And from France, Brandy, which is extreme strong, but accounted very wholesome.\n\nHaving given you a just account, as neere as my memory will serve of the bread and drinke of this Island: The next thing is the severall sortes of meat we have there; and because Hogges flesh is the most generall meat, and indeed the best the Island affords, I will begin with that, which is (without question) as good, as any can be of that kind: for their feeding being as good, as can grow anywhere, the flesh must needs be answerable; fruit, the nuts of Locust, Pomians of a rare kind, almost as sweet as Milions, the bodies of the Plantines, and Bonanoes, Sugar-canies, and Mayes, being their dayly food.\n\nWhen we came first upon the Island, I perceiv'd the sties they made to hold them, were trees, with the ends lying crosse upon one another, and the inclosure they made, was not large enough to hold the numbers of Hogges were in them, with convenient distance to play and stirre themselves for their health, and pleasure; so that they were in a manner pestered, and choak't up, with their own stinke, which is sure the most noysome of any other beast, and by reason of the Suns heat much worse; I have smelt the stinke of one of those sties downe the wind, near a mile, through all the wood: and the crowding and thrusting them so close together, was certainly the cause of their want of health, which much hindred their growth; So that they were neither so large, nor their flesh so sweet, as when they were wild, and at their own liberty, and choyce of feeding.\n\nFor I have heard Major Hilliard say: that at their first comming there, they found Hogges; that one of them weighed (the intrals being taken out, and the head off) 400 weight. And now at the time of", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Ligon - 1657 - A True and Exact history of the island of barbados_page_47.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 848, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3321, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]