[{"id": "9a0fab337700f8411060cd05ee4c96a0184a06a1", "text": "Know all men by these Presents, That we\n\nare holden and firmly bounden unto Captain Abraham Roberts of London; Mariner; Commander of the good Ship Resolution now bound for the East-Indies, in the sum of one hundred pounds of good and lawful Money of England, to be paid into the said Captain Abraham Roberts his Executors, Administrators, or Assigns, to the which payment well and truly to be made, we bind us, and either of us by himself, in the whole, and for the whole, our and either of our Heirs, Executors and Administrators, firmly by these Presents. Sealed with our Seals. Dated the day of in the Year of our Lord God, One thousand six hundred ninety.\n\nWhereas the above-mentioned Captain Abraham Roberts hath entertained the above-bounden to go and serve as a\n\nout and home in the said Ship in the now intended Voyage to the East-Indies, according to an Agreement of Charter-Party, between the Governour and Company of Merchants of London Trading to East-Indies, of the one Part, and the Owners and Commander of the said Ship on the other Part, and from thence to return back again into the Port of London, at and for the Salary of\n\nby the Month, accounting the twelfth part of a whole year\n\nto the Month: Of which Salary or Wages the said\n\nhath already received Impreit before-hand, the sum of\n\nand the rest he the said\n\nhis Executors, or Administrators, is to have\n\nand receive at such time as the said Ship doth come out of the East-Indies, and be discharged of her Goods and Merchandizes within the Port of London, into the East-India Companies Warehouses, and the whole Freight received for the same and nor before, any Rule or Custom to the contrary notwithstanding.\n\nNow therefore the Condition of this Obligation is such, That if the said\n\nshall and do at all times, from henceforth, and from time to time, during the said\n\nVoyage duly and honestly, to the best of his power and skill, perform his Service and Duty in the said\n\nShip, according to his said place and Office, or such other Place or Office as he is or shall be assigned to\n\nin the said Ship, and do not absent himself from the said Service in his said Employment, as he is or shall\n\nbe assigned unto, until his Voyage shall be ended; Namely, that the Merchandize of the Governour\n\nand Company aforesaid, shall be discharged in the said Port of London, out of the said Ship into the said\n\nCompanies Warehouses. And further, if the said\n\nduring his Employment aforesaid, honestly, civilly and courageously behave and demean himself towards\n\nthe said Commander, and to those impowered by him, and likewise from time to time, give and render\n\nto the Commander of the said Ship, or those intrusted by him, a full and true Account of all such Goods,\n\nMoneys, Stores and Provisions as are or shall be committed into his Charge and Custody, and shall during\n\nhis said Employment, observe all such Rules as the said Commander and his Owners are obliged to in\n\ntheir Charter-party aforesaid, viz. shall not during his said Employment, by himself, or any other for\n\nhis use, or for the use of himself or any others of the Company only, bring, transport, carry or load,\n\nor cause to be brought, transported, carried or laden upon, or in the said Ship, either Outward bound\n\nto the Indies, or in the Indiaman Homeward, any Treasure, Goods or Merchandize, of the Quality\n\nhereundermentioned, viz. Gold or Silver in Coin or Bullion, Brazils, Copper, or Iron Ordnance, Musters,\n\nor small Fire-Arms, Iron Shot, Gun Powder, or Granado-Balls; any sorts of Iron wrought or unwrought,\n\nor in Bars, or other Stuffs, any Woollen Cloth, Cloak-Rafers, woollen or worsted Stuffs, Bays, Lead wrought\n\nor unwrought, white or red Lead, Quick-silver, Vermilion, Coral, Amber, Coral Beads, large branch'd\n\npollish'd Cork, Crystal and Flint-Glasses; Cochineal, Elephants' Teeth, Brimstone, Alum, Copper, Pewter,\n\nTin wrought or unwrought. And Homewards, or in the East-Indies, any sorts of Goods or Merchan-\n\ndizes made of Cotton or Silk, or mixt with Cotton or Silk, of what denomination forever; or any Indigo,\n\nCloves, Cinnamon, Cardamons, Cotton-yarn, Benjamin, Nutmegs, Salt-petre, Pepper black or white, Long\n\nPepper, Cassia Lignum, or Cinnamon de Matt, Tymboon Cinnamon, Mace, Lacki of any sort, Coriander,\n\nGreen-Ginger, Turmeric, Coloured Ginghams, or Raw Silk of Bengal, or any sort of Raw Silk, Aloes,\n\nSuccatina, Camphire, Myrhe, Tincal, Red-wool, or Carmania Wool, Coho-felts, China Rice, Musk in\n\nCod or out of Cod, Diamond, Diamond Boats or Sinal, any sorts of Sight, Leather, or Hide, or Hides, draft or\n\nundrunk, Sugar of any sort, Sandal or Sappan wood, Red Earth, Tumeric, Betel-leaves, or any of them,\n\nbut such as shall be laden for Account of the Governour and Company, shall also observe and keep all\n\nsuch other Rules as in the said Charter-party are Express'd. And if the said\n\nshall in every thing be Obedient to the said Commander, and do nothing to the Prejudice of Damage of the said Owners and Commander, Then this Obligation to be void and of none Effect, or else to stand and remain in full Force and Vertue. And if it shall appear\n\nthat the said\n\nhath entered himself, or that he is already or should be preft into their Majesties Service, it shall in no wise hinder the Captain aforesaid, from recovering the Damages he sustained by the Non performance of this Obligation.\n\nSealed and Delivered\n\nin the presence of", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1693 - [A bond given to the captain of every ship by the seamen]_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 1369, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5397, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]