[{"id": "f8fe306f0fa168a2185833145257f9af6bae8084", "text": "The whole complex of Ingredients is known to consist only of vulgar Aqua fortis (abstracted from two parts of Vitriol, and one of Salt-peter) and Quick-silver, and a small quantity of Silver, far less than you may reap in a small time from those Silver-sprigs; yet gain there is none, there being more expenses blown away into smoak by continuance of fire in one month, than can be recover'd from this Silver-harvest in a longer time. And though this seem but a toy, yet 'tis very Philosophical, much informing the understanding, however it enrich not the purse. For here we see crude Mercury manifestly turn'd into Silver, notwithstanding 'tis deny'd by so many.\n\nSo far this generous Observer for this time; with the last part of whose relations may be compared Numb. 39. p.779, 780. 'Tis hop'd, that hereafter more particulars of this Curious Traveller, concerning both the Subject, he hath here begun to discourse of, and others of a Philosophical nature, will be further communicated by him.\n\nAn Account\n\nOf some particulars, referring to those of Jamaica, Numb. 27. and 36, Communicated by Mr. Norwood the younger, an Eyewitness.\n\n1. Alligators are ship'd like Lizards, being four footed they walk with their Belly at distance from the ground, like Lizards. Those of a full growth, have Teeth like a Mastiff, and a Mouth of 1½ foot wide. They are of so strong a scent, that you may smell them at a pretty distance, when they lie on the land. They may be master'd and kill'd by any, dextrous and skill'd in the way of doing it, which is, that a Man be arm'd with a good long Tronchion, and fall upon them side-ways; for doing it front-ways, they are too nimble for the assailant, and may, by leaping upon him, (which they can do the length of their whole Body) spoil him: but if he lay his Club on them against their shoulder, and behind their fore-feet, and tame them there, the beast being thereby rendred unable to move, is easily subdued.\n\n2. Tortoises, if their blood be heated, they dye, and if they shall live, their blood must not be hotter, than the Element, they live in.\n\n3. The Chigo's, described by Ligon, are not felt to have got into the body, till a week after. They will breed in great numbers, and shut themselves", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Norwood - 1753 - An account of some particulars_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 586, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2236, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]