[{"id": "17e0b0d2141e27bbd1900ab72cccb0dafeff0382", "text": "In this plot of ground, there was (in that yeere) more than 10000 persons buried, as I have read in the Charters of Edward the third.\n\nAlso I have seene and read an Inscription fixed on a stone Crolle, sometime standing in the same Church-yard and having these words:\n\nAnno Domini, 1349. Regnatte magna pestilentia, consuetum fuit hoc Camice-\nrium, in quo & infra ipsa praefatis Mo-\nnasterii, sepulta fuerunt mortuorum cor-\npora, plagaque quinquaginta milia, pra-\nter alia multa abhinc usque ad praesens,\nquorum animulae propitiantur Deum, A-\nmen.\n\nIn consideration of the number of Christian people here buried, the said Sir Walter Manny caused first a Chapel to be builded, where (for the space of twenty three yeares) offerings were made; and it is to be noted, that above 10000 bodies of Christian people had in that Church-yard beene buried, for the said Knight had purchased that place for the buriall of poore people, Travellers, and other that were disca-\nfed, to remaine for ever, whereupon, an order was taken, for the avoyding of contention betweene the Parsons of Churches and that house, to wit, that the bodies shoule bee had unto the Church where they were Paritioners, or dyed, and after the funerall service done, had to the place where they should be buried.\n\nAnd the yeere 1371, he caused there to bee founded an house of Cartusian Monkes, which he willed to be called the Salvation, and that one of the Monkes should be called Prior, and he gave them the sayd place of 12 Acres and a Rod of land, with the Chappel, and houses there builded for their habitation, He also gave them the three Acres of land, lying without the walls on the North part, betwixt the lands of the Abbot of Westminster, and the lands of the Prior of Saint John; which three Acres being purchased, inclosed, and dedicated by Ralph Stratford, Bishop of London, as is before shewed, re-\nmained till our time, by the name of Pardon Church-yard, and served for burying of such as desperately ended their lives, or were executed for Felonies, who were fetched thither usually in a close cart, bailed over and covered with blacke, having a plaine white cross thwarting, and at the fore-end a S. Johns Croffe without; and within a Bell ringing by shaking of the Cart; whereby the fame might be heard when it passed, & this was called the Fryery Cart, which belonged to S. Johns, and had the privilege of Sanctuary.\n\nIn this Charter-house were the Monu-\nments of the said Sir Walter Manny, and Margaret his wife, Marmaiduke Lumley, Laurence Bromley, Knight, Sir Edward Hedefer, Knight, Sir William Manny, Knight, Dame Johan Borough, John Dore, Want Water, Knight, Robert Olney, El-\nquire, Katherine, daughter Sir William Babington, Knight, Blanche, daughter to Hugh Waterston, Katherine, wife to John Poor, daughter and heire to Richard Lacie, William Rawlin, Sir John Len-\nshane, and Dame Margarets his wife, daughter to John Fryer, John Peake El-\nquire, William Baron, and William Baron, Esquires, Sir Thomas Thamites Knight, Philip Morgan, Bishop of Ely, 1434.\n\nIn the Cloyster, Bartholomew Rede, Knight, Maior of London, buried 1505, Sir John Popham, &c.\n\nThis Monastery, at the suppression in the 29. of Henry the 8. was valued at 642l. 4s. halfe penny yeerely.\n\nHere now I find fit time to commend to all succeeding posterity, the duly de-\nserved praises of that truely worthy (& never to be forgotten) Gentleman, Ma-\nster Thomas Sutton, the right Phanxie of Charity in our times. This late diffo-\nved Charter-house, by West Smithfield, belonging then to the Right Honorable Thomas Earle of Suffolke, after Lord Treasurer of England, is sufficiently knowne to bee a very large and goodly Manion, beautified with spacious Gar-\ndens, Walkes, Orchards and other pleasures, enriched with divers dependencies of Lands and Tenements thereto belonging, and very aptly feared for wholesome ayre, and many other commodities, All which commodious-\nnese of situation, and largeness of cir-\ncuit, gave occasion to this well-minded Gentleman Master Sutton, to affect that house, as the onely place, whereon to build the foundation of his Religious purpoe. For, among other his Chris-\ntian determinations, hee had formerly intended to build an house at Hall-\ningbury Bouchers in Essex, to be an Hos-\npitall for such poore men and Children as he himselfe (in his life time, or fu-\nture Governors for the same to bee de-\nputed) should thinke fit to bee lodged and relieved there: Also, for a Schoole-\nmaster and Vther, to teach Children to read and write, and instruct them in the Latine and Greeke Grammar, with a Learned Divine likewise to preach the Word of God to them all, and a Matter beside, to governe all those people belonging to that house.\n\nTo this blest end and purpoe, hee had procured (by earnest suit) power by an Act of Parliament, to build such an Hospitall in the Towne of Halling-\nbury Bouchers, and that the same should be named, The Hospitall of King James, founded in Halingbury in the Coun-\nty of Essex, at the humble Petition, and at the onely costs and charges of Thomas Sutton, Esquire; Appointing also such Honourable, Reverend and Worthy persons, as by the said Act of Parliament were nominated and ap-\npointed, to bee the first and instant Go-\nvernors of the Lands, Possessions, Revenues and goods of the foresaid Hospitall, and continual maintenance thereof in forme following.\n\nAll his Mannors and Lordships of Southminster Norton, Little Halingbury, alias Halingbury Bouchers, and Much-\nsteadbridge, in the County of Essex.\n\nAll those his Mannors and Lord-\nships of Badingthorpe, alias Badingthorpe and Danneshy in the County of Lin-\ncoln.\n\nAll those his Mannors and Lord-\nships of Saltshrop, alias Saltrep, alias Halrep, Chleton and Blackgrove, in the County of wilts. And also all those his Lands & pasture-grounds, called Black-\ngrove, containing by estimation 200 Acres of pasture, with the appurte-\nnances in Blackgrove and Wrington, in the said County of wilts. And also in that his Mannon of Missenden otherwise called the Mannon of Missenden, in the Parishes of Wrington, Tyldesley and\n\nThe lands made over to Master Sutton for the main-\ntenance of the said Hospitall in Essex, in the County of Essex, in the County of Lincoln. In the County of Wilts. Lands & pasture-grounds in Wilts. In the Counties of Cambridge, Essex and Middlesex.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Stow - 1633 - The survey of London containing the original, increase, modern estate and government of that city, m_page_250.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1982, "total-output-tokens": 1645, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 6353, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]