[{"id": "92e17564ec12b322f0747fda7dc51f3a6d534490", "text": "As the Æthiope cannot change his skin, nor the Leopard alter his hew; & as it is not possible to gather Grapes of Thornes, or Figges of Thistles: so it is to no purpose to force anything to strive against Nature.\n\nAs in tilling of the ground and husbandrie, there is first chosen a fertile soile, then a cunning sower, then good seed: even so we must compare Nature to the fat earth, the expert husbandman to the Schoolemaster, the faculties and sciences to the pure seeds.\n\nAs the fertill soile if it be never tilled doth wax barren: so that which is most noble by nature, is made most vile by negligence.\n\nAs the Torch turned downward is extinguished with the selfe same waxe, which was the cause of his light: so Nature turned to vnkindnesse is quenched by those meanes it should bee kindled, leaving no branch of loue, where is found no roote of humanitie.\n\nNews.\n\nAs Cookes wish for a plentifull breed of cattell, and fishers of fishes: so busie-brained innovaters doe hunt after newes, and innovation in states. Plut.\n\nAs wee set vp meate from cats and dogges: so we must take heed, what we speake before newes mongers, and insinuating intelligencers. idem.\n\nAs our bodies are more indangered by the Spring, & in Autume, by reason of change: so all noveltie doth offend and hurt the common-wealth.\n\nAs change of meate, drinke and aire doth offend, albeit it be into like, or into better: so it is better still to retaine our old Princes and Magistrates, than to gape for new, because all insuation is full of danger and disturbance.\n\nAs Ajax called Homer from the dead, for some other cause, but to know from what parentage he was descended: so many take great pains, and bestow much cost, onely to heare newes, and knownovelties. Plin.lib.30.cap.2.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/F. M. - 1634 - Wits Common Wealth The Second Part_page_198.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2166, "total-output-tokens": 480, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1755, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]