[{"id": "bea2ace7004eeeba3443b629ea6937aa0b6305a0", "text": "VI. Pulvis Antifebriticus Noster:\nOr, our General Febrifuge.\n\n1. An admirable powder against Fevers of all sorts: A few Doses thereof (with the use of the other Medicines) takes off the Fever beyond Expectation. 2. It is something Sudorific, but for the most part works downwards first, and afterwards provokes Sweat; it is a prevalent remedy against putrid Fevers, Measles, Small-pox, Calenture, Spotted-fever, and other venomous Diseases. 3. It is good against the Green-sickness, Dropsy, Melancholy, Scurvy, Jaundice, and its profitable in Heick Fevers. 4. It resists Putrefaction, fortifies the Stomach, corrects Crudities, purifies the Blood, cleanses the Bowels of filth and viscous Humours, by a gentle Purging way.\n\nThe Dose and manner of Using it.\n\nLet the Patient drink plentifully of our Aq. Vita Mag. according to the directions in its place: give a Dose of powder in the Morning, and at Evening for 8, 12, or 16 days as you see occasion, more or less; you may give it in form of a Bolus in a little Marmalade of Quinces, or pulp of Prunus, Jelly of Harts-horn; or it may be exhibited in a Glass of Canary, or a spoonful of Syr. of Saffron, or Clove-Gillyflowers.\n\nVII. Aqua Ruba Mineralis.\n\nIs an excellent Medicine of a preservative Nature, of great benefit in the plague, and other contagious distempers; particularly against the burning thirst in Fevers: Good against Coughs, Shortness of Breath, Ptyisk, the diseases of Throat and Mouth; as Anginas, Strumas, Inflammations of the Pallate, or Uvula of the Mouth, Thrush in Children, Quinsies, and such like Inflammations; as also for an unsavory Breath.\n\nIts Use and Dose.\n\nFor Thrushes or sore Mouths in sucking Children, or any foulness of the Tongue, or Throat, 2, 3, or 4 drops dropped into a little White-wine, or Plantain-water, sweetened with a little Honey of Roses, and so drink it, and wash their Mouthes with the same; for People of riper Years, they must Gargle their Mouths with it; it being compoed to a Gargarism with White-wine, or Plantain-water, and dulcified with Syrup of Mulberries, or Honey of Roses; often taking from 6 drops to 40, or 50, in Beer, White-wine, or Plantain-water. For the burning Thirst in Fevers, give from 6 drops to 40 or 50, or half a Spoonful in so much Beer, or Ale, that it may tast sharpish of the Medicine; if the Fever be violent, it may be given 3 or 4 times in 5 or 6 hours space; but in continual Fevers it may be given as often as the party desires to drink, observing in such cases to take often to procure Sweat, of my Elix. Magnum Cordialis, and at Night to take", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Spire - 1698 - The natures, uses, & doses of several approved and experienced medicines, faithfully prepared by Joh_page_7.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 746, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2584, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]