[{"id": "ea245078cb3ad4a15c633760ab92e833e469629e", "text": "Directions for Health.\n\nsture, and hastneth on old age and death. Sperme or seede of generation is the onely comforter of nature, which wilfully shed or lost, harmeth a man more, then if hee should bleed forty times as much.\n\nTeach me how winelesse batchelors, and husbandlesse maides, should drive away their uncleane dreaming of venery at nights.\n\nFirst, they must refraine from wine, and venrous imaginations, and not vse to lyse in soft down beds. Secondly, they must addicte them selues to read the Bible and morall Philo- phy. Thirdly, they must exercise often their bodies. Lastly, if none of these preuaile, let them vse the seed of Agnus castus, in English Parke seed, and they shall seele a strange effect to follow.\n\nOf Bathes. CHAP. 5.\n\nWhat is the vse of Bathes?\n\nCold and naturall bathes are greatly expedient for men subject to rheumes, drop-sies and gouts. Neither can I easily expresse in words how much good cold bathes doe bring vnto them that vse them: howbeit with this cauteat I commend bathes, to wit, that no man dis tempered through Venery, Gluttony, watching, fasting, or through violent exercise, presume to enter into them.\n\nIs bathing of the head wholesome?\n\nYou shall finde it wonderfull expedient, if you bath your head foure times in the yeare, and that with hot lee made of ashes. After which, you must cause one presently to poure two or three gallons of cold fountaine water vpon your head. Then let your head be dried with cold towels. Which sodaine pouring downe of cold water, although it doth mightily terrifie you, yet neuertheles, it is very good, for therby the naturall heat is stirred within the body, baldnesse is kept backe, and the memory is quickned. In like manner, washing of hands often, doth much availe the eyefight.\n\nHow shall a man bathe himselfe in Winter time when waters be frozen?\n\nIn Winter time this kinde of artifciall bathing is very expedient and wholesome: Take two pound of Turpentine, foure ounces of the juice of Wormwood and wild mallowes, one ounce...", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Vaughan - 1612 - Approved directions for health, both naturall and artificiall deriued from the best physitians as we_page_41.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 546, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2021, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]