[{"id": "e6d96e7b16f08a89d4b202a8686723af64428b11", "text": "But that this has been for many Years past not ever been questioned or denied. For the Boats of these Exports, and rather than the Carriers have had any share in the Sugar-Colonies with Provisions, and the French have been obliged to make great Quantities of Rum, which they have never made before, and great Quantities of Rum, which they have never made before, and great Quantities of Rum, which they have never made before, and great Quantities of Rum, which they have never made before, and great Quantities of Rum, which they have never made before.\n\nAnd they take all these great Quantities of Rum, which they have never made before, and they take all these great Quantities of Rum, which they have never made before, and they take all these great Quantities of Rum, which they have never made before, and they take all these great Quantities of Rum, which they have never made before.\n\nAnd such French Rum and Molasses is often bought by them with Money received in our Sugar-Colonies, from their Carriages sold there.\n\nThe Merchants from this Commerce are very many and varied, and will exceed those who trade in the West Indies, and no Frenchman can be put to it.\n\nBy this means the French have extended their Colonies, and made new Colonies, and thus supply themselves with Provisions, and the Mediterranean, and thus supply themselves with Provisions, and the Mediterranean, and thus supply themselves with Provisions, and the Mediterranean, and thus supply themselves with Provisions, and the Mediterranean.\n\nThe British Sugar-Colonies can't find their way to their Sugar abroad, which they did formerly, but chiefly depend upon our own Sugar Colonies.\n\nMen of the Inhabitants and Planters are reduced, that they are moving to the West Indies, where the War with France, is at Possibility, will occasion the entire Loss of the Sugar-Colonies, and thus bring in Men, who are more than a Thousand well-affected Men.\n\nThe French Sugar-Colonies are now in a most flourishing State, and the French Colonies are now in a most flourishing State, and the French Colonies are now in a most flourishing State, and the French Colonies are now in a most flourishing State.\n\nThat by this Intercourse, they have an Opportunity of taking off great Quantities of Foreign Burdens, Manufactures, and Indigo Goods, in a Gian-\n\ndine Manner, from the French Colonies.\n\nAnd what is worse of great Consequences is, that the Northern Colonies may be Gotten upon the whole by this Trade, so that the French Colonies may be Gotten upon the whole by this Trade, so that the French Colonies may be Gotten upon the whole by this Trade, so that the French Colonies may be Gotten upon the whole by this Trade, so that the French Colonies may be Gotten upon the whole by this Trade.\n\nBesides the great Benefit the French Colonies receive from this Trade, which is said above must also destroy the French Sugar-Colonies, and the other Carriages must be sold, and make the French Sugar-Colonies decline, and enable the French to supply foreign Markets with Sugar.\n\nThe French Sugar-Colonies receive the greatest Encouragement from their Mother-Country, and their Daim are far better than ours.\n\nWhat is the British Sugar-Colonies pay in the Plantations Day of Four and a half per Cent., for their Sugar before they can ship them to Great Britain, which is now drawn back on the English market, and the English must purchase them at a higher Price, and the French must purchase them at a lower Price. And if these Sugar are carried to the Northern Colonies they must pay the Plantation Days of Eighteen Per Cent., and the French must pay the same, and thus the French must pay their Sugar over and above the Four and a half per Cent., Day.\n\nUpon the whole, if this Trade in the Foreign Sugar Colonies be not prevented, the French Colonies will be greatly assisted, and the Danger of being ruined. The Consequence of which in Great Britain will be, that the north Colonies will be greatly assisted, and the Danger of being ruined.\n\nOur Navigation and Seamen must necessarily fall off and diminish.\n\nThe African Trade, as chiefly depending on the Sugar-Colonies, must decay.\n\nAway our Sugar Works, and other Plannium Stocks and Unsalt, will be of no Use, and thereby the much Wealth will be greatly lost and left in this Nation.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1731 - The Case of the British Sugar-Colonies_page_2.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 4303, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]