[{"id": "ccc3729475635c03b13f4b42adb74a16f739f88f", "text": "The State of the Island of Jamaica.\n\n...erful Prince Charles, King of Great Britain, &c. in order to the restoring and regulating the same for the future; to send into Spain his Envoy extraordinary, Sir William Godolphin, Knight; with full Authority and Power to make any Treaty convenient and proper for that End. And likewise the most serene and powerful Charles, King of Spain, &c. and the Queen Regent Maria Anna, &c. for the carrying on a Work of so much Piety and publick Good, deputed on their Part, the Earl of Penaranda, Counsellor of State, and President of the Indies, to confer, treat, and conclude thereupon, with the said Sir William Godolphin. At length they mutually resolved and agreed upon the Articles of the following Treaty in Virtue of their several Commissions.\n\nI.\n\nFIRST, It is agreed between the above mentioned Plenipotentiaries Sir William Godolphin, and the Earl of Penaranda, in the Names of the most serene Kings respectively, their Masters, that the Articles of Peace and Alliance, made between the Crowns of Great Britain and Spain, in Madrid, on the 13th of May, 1667, or any Clause thereof, shall in no Manner be deemed, or understood to be taken away, or abrogated by this present Treaty; but that the same shall remain perpetually in their ancient Force, Stability, and Vigour, so far forth as they are not contrary, or repugnant to this present Convention and Articles, or to any Thing therein contained.\n\nII.\n\nTHAT there be an universal Peace, true and sincere Amity in America, as in the other", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1726 - The State of the Island of Jamaica_page_41.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 387, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1533, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]