[{"id": "2c4083ffbff2665c3509c1549896606cf9e018b0", "text": "yet he hath given us hearts to overlooke them all, as if we were carried upon eagles wings.\n\nAnd thirdly, see God making roome for us by some lawfull meanes.\n\nBut how shall I know whether God hath appointed me such a place, if I be well where I am, what may warrant my removeall?\n\nThere be foure or five good things, for procurement of any of which I may remove. Secondly, there be some evill things, for avoiding of any of which wee may transplant our selves. Thirdly, if withall we finde some speciall providence of God concurring in either of both concerning our selves, and applying general grounds of removall to our personall estate.\n\nFirst, wee may remove for the gaining of knowledge. Our Saviour commends it in the Queene of the South, that she came from the utmost parts of the earth to heare the wisdome of Solomon: Matth. 12. 42. And surely with him she might have continued for the same end, if her personall calling had not recalled her home.\n\nSecondly, some remove and travaile for merchandize and gaine-sake; Daily bread may be sought from farre, Prov. 3 i. 14. Yea our Saviour approveth travaile for Merchants, Matth. 13. 45, 46. when hee compareth a Christian to a Merchantman seeking pearles: For hee never fetcheth a comparison from any unlawfull thing to illustrate a thing lawfull. The comparison from the unjust Steward, and from the Theefe in the night, is not taken from the injustice of the one, or the theft", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Cotton - 1614 - Gods promise to his plantation_page_14.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 389, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1434, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]