[{"id": "bb240ac6a99ffaf6ecba94e1c34d2d2eeb47dc00", "text": "is clear that laying on of hands was visibly done, outwardly apparent, Simon saw it, surely then prayer was vocal and apparent, they both did pray; and not as some would have it, one did pray vocally, and the other mentally. But some may question further, did they lay on hands both at a time, viz. Peter and John? truly the text is not clear in that particular, only the text saith thus much, they laid on their hands on the Samaritans, they, in the plural number. I shall say no more as to these circumstances, I hope those which are judicious will not stand upon such niceties as these are, but rather will mind substantial; and so I shall desire the Reader to make his progress unto the next particular, and leave this unto consideration.\n\n---\n\nChap. III,\nIs concerning the ends wherefore laying on of hands it is to be administered upon baptized believers.\n\nI am not ignorant that the whole weight of the controversy lies in the clearing up of this point, and why? because there hath been a great deal of difference amongst the people of God; and that as to the ends wherefore hands are to be laid upon baptized believers; and also the ends wherefore they were laid upon baptized believers in former times; the contention about this point hath been so much the stronger, because of some contrarie ends which have been proposed by some in opposition unto those right ends which I shall here lay down. And because we may observe a right order and method for the profit of all, I shall therefore first lay down those ends which I judge to be of most strength and life for the maintenance of what is formerly laid down; And then I shall come in the next place to overthrow those supposed ends which are brought in by others.\n\nIn the first place I shall affirm, that one end wherefore persons are to have hands laid on them, is, that so they may be put into a further capacitie of going on to perfection. I would not here be mistaken, I do not say others who have not subjected unto this principle are no waies in a capacitie of going on to perfection; But this is that I do affirm, namely, that those baptized believers who have subjected unto this truth, are put into a further way of capacitie of going on to perfection, and therefore this is one end wherefore it is to be", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Morley - 1653 - A Vindication of that righteous principle of the doctrine of Christ, called laying on of hands upon_page_26.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 516, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2275, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]