[{"id": "b7fcb16e8dd5e494ce1383adde9dc7c757fbccde", "text": "Preservatives against the Plague.\n\nPerficial parts, and there to apply the rumps of Chickens, as before is taught you, and so apply to the place some strong maturative, and attractive plaster, or Cataplasm, as hereafter shall be shewed you. If the grief be in the head or throat, then apply Ventoses to the neck; if it be in the emunctuaries of the heart, then apply them to the shoulders; if in the emunctuaries of the liver, then apply them to the buttocks or thighs, now when this is done, either by Phlebotomy, or Ventoses, then within an hour or two at the most after it, you must give the sick some good Cordiall Medicine, which hath power to comfort the heart, rest the venomous matter, and also procure sweat, whereof out of the following you may make choice as you list.\n\nAn excellent good Powder to expell the Plague, which also provoketh sweat.\n\nR. Roots of Gentian, Bittanie, Petasitis, ana, 3 i. Roots of Tormentill, Dittander, ana, 3 iii. Red Sanders 3 ii. Fine Pearle of both sorts, ana, 3 i. Fine Bolarmoniack prepared, fine Terra sigillata, ana, 3 vi. Rindes of Citrons, red Corral, Roots of Zedoiar, shaving of Ebony, bone of a Stags heart, ana, fifteen grains; Fragments of the five pretious stones, ana, 3 ii. Shaving of a Unicorns horn, Succin, ana, 3 ii. Leaves of Gold and Silver, ana, one and half in number.\n\nMake all these in fine powder, every one severall by himself, and then mix them all together, and give thereof 3 i. or 3 iii. more or lesse as occasion requireth, either in Sorrell, Scabios, or Carduus benedictus water two or three ounces, whereunto you must adde a little Sirrup of Lemons, or four Citrons, and give it warm, the Bolarmoniack must be pounded small, then washed in Scabios water, and so dried.\n\nAnother good Powder.\n\nR. Leaves of Dittander, called Dittami cretici, Roots of Tormentil, Bittanie, Pimpernell, Gentian, Zedoiar, ana, 3 i. Terra lemmia, Alloes Cicatrina, fine Myrrh, Rinds of four Citrons, ana,\n\nPreservatives against the Plague.\n\nana 3 i. Mastick, Saffron, ana, half a drachm. Bolarmoniack prepared as before said, 3 ii.\n\nAll these must be made in fine powder, and so mixt together, you may give two scruples, or one drachm thereof with any of the aforeaid waters.\n\nA good Opiat to expell venome, and provoke sweat.\n\nConserve of the flowers of Turrage, Buglos, Violets, Bittanie, ana, 3 ii. Venus Triacle 3 ii. Red Terra sigillata, Terra lemmia, Mithridate, ana 3 i. Shaving of Ebony, And Harts-horn, Orient Pearls, Roots of Tormentill, ana 3 i. Shaving of Unicorns horn, Root of Angelica, ana half a drachm. Sirrup of the Juice of small Sorrell and Buglos, ana, so much as shall suffice.\n\nMix all these together in the form of an Opiat, then take of the same Opiat, one drachm and half. Scabios water, Balm water, ana 3 ii.\n\nDissolve the Opiat in the waters, and drink it warm, then walk a little upon it, and then goe to bed and sweat.\n\nAnother excellent good means to expell the venom, and procure sweat.\n\nTake a great white Onyon, and pick out the coar or middle of him, then fill the hole with good Venus Triacle, or Andromachus Triacle, and Aqua vitae, then stop or cover the hole of the Onyon again, and rost him in the hot ashes until he be soft, then strein it strongly through a cloth, and give it the sick to drinke, and the rest that remains, pound it small, and apply it to the sore, and sweat upon it.\n\nNow when he hath taken any of the aforeaid Cordials, if he chance to vomit it up again, then wash his mouth with Rofewater and Vinegar, and then give him more of the same again, which must be proportioned according to the same again, which must be proportioned according to the quantity vomited, for if all were vomited, then give so much more: (if lesse) then according to the quantity vomited, and if he vomit that also, then give him more, and so continue it.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1675 - Every woman her own midwife, or, A Compleat cabinet opened for child-bearing women furnished with di_page_53.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1614, "total-output-tokens": 1105, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3842, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]