[{"id": "be14b10352907a28ec94ca648ea95b5a443448b4", "text": "A LETTER from JAMAICA, to a Friend in LONDON, concerning Kid-Napping.\n\nSIR,\n\nYours found me a little Indispos'd; but yet I made the best Enquiry my Health and Opportunity would give me leave to Anfwer your Defires.\n\nThe Relation you have fent me of the great Abufes in the Spiriting away of Children, makes a very fad Story; and muft needs be a Lamentable Grief to their Parents that have loft them. You fhould have done well to have fent me the Names of thofe that are miffing; or if you think fit to have me look any further into this bufiness, pray let me receive your further Directions at your beft leifure. We are not without Apprehensions here in this Place for the Divifions in England; I wish we may yet live to meet again in Comfort and Peace.\n\nThe Paper which I fend you here enclofed, is all I was able to do in fo short a time; but upon the Truth of it you may depend. I do not know but you may find in this Lift fome unhappy People that you look for; and it would be well if you made a Publication of it in one of the common News Papers: Mr. Janeway, or Mr. Curtis, I make no doubt will do it for you, and it may be fo Notified, as that any of thofe good People that have loft their Children, may understand whither to Repair for fatisfaction.\n\nIf you know no better a way, you might do well to apply your felf to Mr. John Wilmore in Jewen-Street, who is a Planter himfelf, and knows all the Tricks of thofe Raftals. Besides that, he is a Man of Bufeiefs in the City, a large Acquaintance, a True Protestant, and (if I am not mistaken) a Common-Council-Man. He is very Industrious and Charitable befide; and if there fhould be occasion, he is as likely to affift you as any Man I know: th'o it were to go as far as the Hope upon the Errand, to fave a Poor Child from Want, and Slavery. I need fay no more to you, than that if you have his Friendship, he can tell you all the ways of the Tra-pan: how they take up Children, Invigle them away, and the conceivances they have for the concealing of them. Thefe Kid-Nappers will tell you perhaps that a Child was ready to be eaten up with Vermin, and they took him in Compaffion; that they could not get quit of him, or perfiade him to come back it may be, th'o he were ready to leap into the Sea: wherefore you muft get a different Juftice to examine the matter; fo the refi I leave to your difcretion.\n\nLittle Will takes to his bufiness very well; and I hope his Friends will have Comfort of him. Pray Commend me to all my good Friends and Acquaintance in your Neighbourhood, and pardon all Faults; for I muft immediately take my leave of you, and Subscribe my felf your Affectionate Kinffman and Servant,\n\nT. M.\n\nIf any Perfon Named in the following Lift, fhall be found to have been Spirited away: Notice may be left with Mr. Walter Davis, in Amen-Corner, who will give Directions how to make a further Enquiry.\n\n| The Number of Whites. | The Number of Whites that Dyed in my time. |\n|-----------------------|---------------------------------------------|\n| 1. Joseph Ruffel.     | Thomas Hugh.                                |\n| 2. William Burne.     | Peter Peterjon.                             |\n| 3. George Shallice.   | John Gwartwrite.                            |\n| 4. Urban Roy.         | Thomas Davies.                              |\n| 5. Andrew Reddal.     | Samuel Hodgley.                             |\n| 6. William Pollard.   | Sold in my time.                            |\n| 7. John Brown.        | Thomas Martin.                              |\n| 8. Richard Sevior.    | Thomas Barber.                              |\n| 9. James Durham.      | Free.                                       |\n| 10. George French.    | William Ward.                               |\n| 11. Thomas Woodcock.  | Rickard Barret.                             |\n\nTotal of the Whites — 11.\n\nJamaica, Decemb.\n30. 1681.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1682 - A letter from Jamaica to a friend in London concerning kid-napping_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 1004, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3865, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]