[{"id": "f6909407f2dc08aa9f2cbb01b950b4b82c57a98b", "text": "This was the Case of Doctor Dwyer and of several others.\n\nBefore we point out a Method of Cure drawn from the Nature and Symptoms of this Disease; agreeable to the Precepts of the best antient and modern Physicians in similar Fevers; and what is more confirmed by experience; it may not be amiss to examine these Gentlemen's Reasons who are so fond of giving Alexipharmics and Sudorifics in the very beginning of this Fever.\n\nThese Gentlemen argue, That from some occult Venom, Contagion, Miasma, or Je ne sais quoi, the Texture of the Blood is broke, whence it is turned into a vapid and putrid Mass, no longer fit for the Uses of the animal Economy runs off through the Glands, strainers destined to excern a much thinner Liquor; therefore imagine the Blood to be in the same State as in pestilential Fevers and give Sudorifics and what are called Alexipharmics as in the Pestis; insisting the most likely Means to save the Patient is to keep open the Skin.\n\nThe yellowness they apprehend proceeds only from the broken texture of the Blood; for say they, take the red globules of Blood, break them in a Mortar with the addition of a little Water and they will break into a yellow Fluid. This Theory seems to be built upon the supposition that a subtle elastic Air fills the Spherulae of Blood; which Spherulae or globules when broke, and their elastic Air exhausted the Blood remains a vapid and putrid Mass no longer fit for the Secretions.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Williams - 1750 - An essay on the bilious, or yellow fever of jamaica_page_28.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 363, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1443, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]