[{"id": "c8dfc5d1ea3cdd61438a0de375d4627e2e1b3e7e", "text": "DIRECTIONS for the SUGAR PLUMS.\n\nWHENEVER than a Child is out of Order, LET IT IMMEDIATELY, and OUT OF HAND, EAT ONE only of these PLUMS. And if but Eaten 3 Times will Save a Deal of Charges in Physick, & Recover More Children from Illness than Loads of other Physick.\n\nCOUNTRY SHOP KEEPERS through out the whole Kingdom sell a Deal of these GUM OPENING Remedies and Plums which Proves so very Quick a Return that they Still send to TEMPLEBAR for More & More of them. And what is not Sold, are Returned at any Time.\n\nAND any Order shall be Immediately Delivered To any Carrier, Stage Coach, Waterman, Or Correspondents, You shall Please to Order, To Any part of the Kingdom These Sugar Plums presently Cure an AGUE, and intermitting Fever, the HEAD ACH, CHOLICK, Gripes Rhumatism, Thickness of Hearing, Sickness and Pain at Stomach Dropsy, Green Sickness, Want of appetite, COUGHS, And Short Breath, Giving Immediate Ease and Easy Breath.\n\nONE only of these Little Plums (of a Penny) Is Enough to Bring these Worms with Foul & Gross Humours Away from a Child of 2 or 3 Years Old -- And Half a Plum for Younger Children.\n\nTWO Plums Given to a Child of 4, 5, or 6 Years old, to Bring Worms away, Three Plums, to one of 8, 9, or 10 Years old; for a fine safe Purge. And Manor Woman, may take 4, 5, or 6 of them when they want to be finely Purged, and to have Foul Humours out of their Body. And after every working, by which You free a Load of FOUL HUMOURS, As Green as Grass, Drink a Deal of warm Broth, Water Gruel, ALE or Tea, the More you Drink the better they will Work If not Given Stools enough add a Plum next Time the only harm of a Plum more for a Dose would only be a Stool or two the More.\n\nMISSING a Day or two Between Each, these PLUMS Should be taken 3 Times because once only Taking does not Purge out of the Body all the WORMS, and Foul Humours, And may be taken any Weather Heat or Frost.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1700 - Directions for Sugar Plums_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1798, "total-output-tokens": 545, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1903, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]