[{"id": "111859df92286a367d00e8083bb36bb4e041b54c", "text": "pickaninny; — husband and wife, — broder and sister,\n— ah! me no bear tink; it break my heart.\n\nE. I thought you blacks had no such fine feelings.\nC. Me beg your pardon, Massa, dat be de whites;\n— de blacks all feel.\n\nE. And they have a difficulty to part you sometimes I reckon?\nC. De curst wip do dat, Massa.\n\nE. You had the luck to meet with a good master, however.\nC. Dey say, my Massa good Massa.\n\nE. And what did he set you to do?\nC. De Overseer, after he mark us wid red hot iron,\nsend me and good many more to de gang to de seasoning.\n\nE. Seasoning! What's that?\nC. O dey call de two first years de seasoning, den\nif we live, dey call us good slave.\n\nE. Does it kill any of you then?\nC. Great many, Massa.\n\nE. What sort of work did they set you to?\nC. Me field-slave; me work in de field a-day, and\nsometimes tend de mills at night.\n\nE. Is your work very hard?\nC. Very hard, Massa, and work great many hours;\nbut Negro no mind dat, so use well and feedè well.\n\nE. What do you live on?\nC. Rice, horsebeans, and sometimes stinking fish;\nwhat white no eat, he give blackè.\n\nE. Well; with all you hardships, your must acknowledge\nyou are better off than in your own barbarous\ncountry, full of lions and tygers.\n\nC. But there be no Negro driver, Massa!\n\nE. Keep in bounds, Cushoo; you know in your own\ncountry you live under barbarous and petty tyrants, in\na wild uncivilized state; but in the West Indies you\nare brought to a civilized state, and live under the pro-\ntection of our gracious sovereign King George.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1800 - Cushoo A dialogue between a negro and an english gentleman_page_7.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1338, "total-output-tokens": 451, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1517, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]