[{"id": "2a5607abc563826f241bb21017d38b67fb3aacc6", "text": "House Ladle, and another putting in a Quart at a Time. Let the Heat of the Liquor be now raised to 140 Degrees of the Common Pocket Thermometer, let this Heat be continued one Hour. Skim it carefully. To five Gallons of Water put ten Ounces of white Marle, Tobacco Pipe Clay, or other white Bollar Earth: if you have not any of these, ten Ounces of Fuller's Earth. Let it be previously powdered, and well mixed with the Water. Stir this in as the Lime and Water were directed to be; increase the Heat to 160. Continue it half an Hour.—Skim. —Increase your Heat to 190. Continue it half an Hour.—Skim. Increase the Fire to 200, and shut the Door of your Fire place, which puts it out. Let your Liquor remain four Hours undisturbed, and then draw it off into the Receiver: if your Process succeeds your Liquor will be as bright as Madeira Wine.\n\nI should observe that when you have done filling one Clarifier you go on to the next, repeating the same Process. From the Receiver your Liquor is to be conducted into the first Copper. For fear of burning, you may throw a Gallon into each Copper hung to the same Fire, but after let your Liquor run into the first Copper: when full, by means of the Groove it will fill the second; and so on to the last Copper; when all are full let a small stream run into the first Copper just sufficient to equal the Evaporation and keep them all full. By this Management as the first Copper receives the fresh Liquor, its Contents will be constantly diluted; the Contents of the second will be more dilute than those of the third; and so on to the last Copper; where the Liquor will", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Baker - 1775 - An essay on the art of making Moscavado sugar wherein a new process is proposed_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 416, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1614, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]