[{"id": "66f099f91c55218421175efb7f852bdfd247ab4a", "text": "Natures Explication,\n\nEuforbiun must do what Cochipils will not: Opium must do what Lettice posset will not; but first it must be mixed up into a ridiculous Laudanum; Colocynthis &c. Scammony must effect what Manna, Sene & Rhubarb will not: O brave Doctors! O capitae Helleboro digna! yet you are the men that cry out against poisons.\n\nAs though Scammony, Colocynthis, Glaterium, Esula, Euphorbium, Valerium, Bryony, Asarum, Aaron, Hellebore, and such like, as Cambogia, &c., were not absolute Poisons. O but they are tempered by the Art of the skilful Doctor. Good words cost no money, I wish it prove so. But I pray Mr. Doctor if it be so, what means the bleating of the sheep? I mean, what is the reason your Medicaments retain their vomiting quality with convulsions of the stomack which have Hellebore mixed; and their purging quality with gripings and\n\nand Helmont's Vindication.\n\nand such symptoms that have Scammony mixed; thus you use to correct poisons, thus you intend to cure diseases. Minervae crassifemina!\n\nBut as a Jugler when his feats are discovered, so you by this means become ridiculous; you know the serious check the Frog in Aesop received; who as you do, would pretend to be a Doctor, Cur tibi ipsi labra timida non turba?\n\nCoughs, Colds, Murrays, Hoarsenesses, Head-aches, Tooth-aches, and the like; nay oft-times the simple Itch and Scab, doth reproach you at home, and outdare you abroad, and what is your excuse? they are trivial cases.\n\nBy which it appears, that if other diseases should become as common as these, they would all be too mean for the Doctors reverence; and good reason, because they are above his abilities.\n\nThough you name Mountebanks with", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Starkey - 1658 - Natures explication and Helmont's vindication. Or A short and sure way to a long and sound life bei_page_101.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1890, "total-output-tokens": 484, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1686, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]