[{"id": "4f8169ef2c48d757a947a2806d7d02e19829af11", "text": "our duty to contribute our share; and to act from conscience, as we should in similar cases from feeling and inclination.\n\nFor instance: Let us suppose the Algerines to establish sugar plantations, and resort to the banks of the Thames for slaves. Suppose our wives, our husbands, our children, our parents, our brethren, swept away, and the fruit of their labour, produced with agonizing hearts and trembling limbs, landed at the port of London. What would be our conduct? Should we say, \"Sugar is a necessary of life: I cannot do without it. Besides the quantity I use is but small: and though it be very criminal in the Algerines to enslave others, I am not bound to look to the nature or consequence of the transaction. Paying for the sugar, I have a right to consume it, however it may have been obtained.\" If such would be our language in that case, be it so on the present occasion. For let us recollect that in both cases the enslaved are our brethren.\n\nAnd let us only suppose an Englishman were to receive injuries, that bore but the slightest resemblance to those daily committed in our islands, the nation would be inflamed with resentment, and clamorous to avenge the injury. And can our pride suggest, that the rights of men are limited to any nation, or to any colour? Were anyone to treat a fellow creature in this country as we do the unhappy Africans in the West-Indies; struck with horror, we should be zealous to deliver the oppressed, and punish the oppressor. Are then the offices of humanity and functions of justice to be circumscribed by geographical boundaries? Can reason, can conscience justify this contrast in our conduct, between our promptitude, in the one case, and our torpor in the other?—Mr. Addison justly observes, that \"humanity to become estimable must be combined with justice.\" But we seem to act as if we thought, that the relief of our fellow creatures, and protection from injuries, were works of supererogation; to be granted or withheld, as caprice, or inclination may suggest.\n\nAfter the important considerations adduced, it might be reckoned a degradation of the subject to mention the national dignity; or even that might induce us to counteract a powerful body of men, who are trampling under foot, the dictates of humanity, and the interest of the nation: men, who have received for sugar alone, above a million per ann., more than it would have cost at other markets. From Mr. Botham's evidence it appears, that in Batavia, where labour is as high as in England, sugar equal to the best West-India, is sold at 1d½ per pound. These are the men who are calling on us to aid the operation of their whips by the terrors of our bayonets; and to misapply the public treasure to support individuals in violating every principle of law and justice, and to defend them in the most dreadful tyranny over half a million of persons, born in islands, which, when it serves their purpose they pretend to be ours; but of which they have virtually usurped the sovereignty: and have the audacity to tell the British legislature, \"That they cannot abolish the slave trade; for that if England refuses to furnish them with slaves,", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Fox - 1800 - An address to the people of Great Britain on the propriety of abstaining from West India Sugar and Rum_page_5.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 713, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3164, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]