[{"id": "d301cebac8f0d05dd5ed6d14fcadf43739e01f38", "text": "The dose is one or two spoonfuls morning and evening.\n\nThe Virtue of Aqua Marix.\n\nIt is good for all infirmities of the Spleen and to open the obstructions thereof; it comforteth the vital parts, and is good against all passions of the heart; it preserveth the meat in the stomach from putrefaction; it helpeth digestion, and expelleth wind.\n\nThe dose is one spoonful at one time.\n\nThe Virtues of Flowers of Rosemary.\n\nIt is good against all infirmities of the stomach, and to suppress all offensive fumes rising up from thence to the head, keeping them down, and helpeth memory; it openeth all stoppings of the Liver and Milt, it preventeth Vertigo, Scotomia, Palsies, Apoplexies, distastes of that kind arising from cold Humours, it breaketh wind, and easeth the Cholick.\n\nThe dose is 1 spoonful at 1 time.\n\nRare Secrets in Physick.\n\nThe Virtues of Spirit of Mint.\n\nIt is good for the stomach, and strengthens the retentive faculty, good against vomiting, and all passions of the heart; it comforteth the vital spirits, and is good against the Contumption; it expelleth wind, and helpeth digestion, and is an infallible help for all Melancholy.\n\nThe dose is from one to two spoonfuls.\n\nThe Virtues of Aqua Theriacalis.\n\nIt is good against all Diseases of the Spleen whatsoever; It preventeth and helpeth contagions, and sudden oppressions and qualms of the heart.\n\nThe dose is one spoonful to prevent, and 3 to the infected, who ought to sweat after taking it.\n\nThe Virtues of Spirits of Saffron.\n\nIt is good to comfort the vital Spirits, passions, trembling, and pensiveness of the heart, and helpeth all malignity oppressing it.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Kent - 1687 - A choice manual, or Rare secrets in physick and chirurgery collected, & practised by the Right Hono_page_106.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2166, "total-output-tokens": 436, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1632, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]