[{"id": "583cc815c5b4dbec39abc81707f852c3766781a1", "text": "Commander, who upon their first arrival here committed such horrid Cruelties and Massacres, that (as the fore-mention'd Bartholomeo de las Casas writes) five thousand Inhabitants were in a short time reduc'd to less than three hundred, multitudes being put to death in a most inhumane and barbarous manner, some roasted alive, others torn in pieces by the Spanish Dogs, besides many other studied ways of Butchery, too dreadful to be read with patience; nor were they free from Civil War amongst themselves, which first began in this Island.\n\nThe first and only Attempters upon this Island since the Spaniards made themselves Masters thereof, have been the English, who in the Year 1592, under the Conduct of Sir Anthony Shirley Landed upon it, & got clear possession thereof; none of the Spaniards that were then upon the Place daring to make the least resistance; but not thinking it worth the keeping, they soon deserted it, and made Sail back again for England: after which they remain'd unmolested for a long time, till in the Year 1654, a Fleet of English was set out for Hispaniola by Cromwell, under the Command of Colonel Venables, with a Design for the taking of St. Domingo; but meeting with ill success in the Enterprise, and being forc'd to quit that Island with loss of Men, and frustration of their hopes, they steer'd their Course for Jamaica, and on the tenth of May in the Year above-said, with little opposition possest'd themselves of it. Upon their approach to St. Jago the Inhabitants thereof deserted it, and betook them to the Mountains, gaining time by a pretence of Treaty, to secure their Women and Goods; and oftentimes making Incursions upon the straggling Parties of the English, flew and took many Prisoners by surprize: but being weary of this wild and irregular kind of living, they betake themselves at last to the Isle of Cuba, where many of them, the Grandees especially, were permitted by favour to continue, the rest being by the Vice-Roy commanded back, with promise of speedy and considerable Supplies; by that time this remnant of the Spaniards was near tir'd out with hardship and necessity, some being very much discourag'd and driven to utter despondence of Mind, others destroy'd out-right, part of the long promis'd and expected Supply arrives, the greatest part being to follow soon after; but finding", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Ogilby - 1671 - America_page_399.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1568, "total-output-tokens": 553, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2348, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]