[{"id": "6739a1429abe98c9e2f0718171523b260f18a245", "text": "56. To procure an excellent Colour and Complexion in the Face, used by the C. of S.\n\nTake the juice of Hyssop, and drink it in a Morning Fasting, half a dozen spoonfuls in Ale, warm; it will procure an excellent Colour, is good for the Eye-sight, destroyeth Worms, and is good for the Stomack, Liver, and Lungs.\n\n57. To keep the Teeth white, and kill worms.\n\nTake a little Salt in a Morning Fasting, and hold it under your Tongue till it be melted, and then rub your Teeth with it.\n\n58. To procure Beauty, an excellent wash.\n\nTake four Ounces of Sublimate, and one Ounce of crude Mercury, and beat them together exceeding well in a wooden Mortar, and wooden Pestle; you must do it at least six, or eight hours, then with often change of cold water, take away the salts from the Sublimate, change your water twice every day at least, and in seven or eight days it will be dulcified, and then it is prepared; lay it on with Oil of white Poppy.\n\n59. A Beauty-water for the Face, by Madam G.\n\nTake Lye that is not too strong, and put two peels of Oranges, and as much Citron-peel, Blossoms of Camomile, Bay-leaves, and Maiden-hair, of each a handful, of Agrimony two or three Ounces, of Barley-straw chopt in pieces, a handful, as much Fenugreek, a pint of Vine-leaves, two or three handfuls of Broom-blossoms; put all these into the Lye, and mingle them together, and so wash the Head therewith, put to it a little Cinnamon and Myrrh, let it stand, and wash your Face therewith every Evening: It is good to wash the Head, and to comfort the Brain and Memory.\n\n60. Against", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1675 - The Accomplish'd lady's delight in preserving, physick, beautifying, and cookery containing I. the a_page_102.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2166, "total-output-tokens": 450, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1568, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]