[{"id": "d43d14fb5acc44fa71f004fd585a3685646d9ad2", "text": "LIX. Astronomical Observations made at the Island of Barbados; at Willoughby Fort; and at the Observatory on Constitution Hill, both adjoining to Bridge Town. By Nevil Maskelyne, A.M. Fellow of Trinity College, Cambridge, and F.R.S.\n\n[Read December 20, 1764.]\n\nN.B. All the observations of the first satellite of Jupiter were made with a two foot reflector made by Mr. Bird, having an aperture of $3 \\frac{8}{15}$ inches in diameter, except where they are marked as made with my 18 inch reflector made by Mr. Short, having an aperture of four inches and an half in diameter. And the eclipses of the other satellites were all observed with the 18 inch telescope, except a few marked as made with Mr. Bird's two foot reflector. The latitude of Willoughby Fort is $13^\\circ 5' 15''$ N. and that of the Observatory $13^\\circ 5' 15''$ N. This agrees with the latitude I observed when our ship came to anchor at our first arrival in Carlisle Bay, which, carefully calculated, and reduced to St. Michael's Church, gives $13^\\circ 5' 30''$ for its latitude. The Observatory is about 200 yards due east of the church, and Willoughby Fort is about 1600 feet distant from the same, bearing S.W. So that the Observatory is about $15''$ of longitude, or $1''$ of time to the east of Willoughby Fort. The latitudes of Willoughby Fort and the Observatory, set down above, result from altitudes of the sun taken with a baron of quick-silver by the bar's Hadley's sextant made by Mr. Bird, being calculated from them, and the apparent time known from equal altitudes of the sun taken with the equal altitude instrument.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1764 - Astronomical Observations Made at the Island of Barbados; At Willoughby Fort_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 449, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1602, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]