[{"id": "6e02bae7f675b984aa4593d88097b00031dc5398", "text": "culture, and Husbandry bee maintained and duly kept.\n\n8. Item, In every County there shall be Coronors, high Sheriffs, high Constables, petty Constables, and Goalors, who are to do their respective Offices as accustomed; the high Sheriff to be confirmed or nominated by the Supreme Councell out of three to be presented by the County Councell, and the high Sheriff is required to execute the Commands, Orders, and Decrees of the Provinciall and County Councell.\n\n9. Item, In Cities and Towns Corporate Justice is to be done, and the Lawes executed as is accustomed.\n\n10. Item, In every County the high Sheriff shall be Provost Marshall, and shall have power to execute a lay man not worth five pounds, and none other, for murder, man-slaughter, burglary, theft, robbery, or other capitall offence, provided the party to be executed may have four and twenty hours time to prepare his soule; and that the Supreme or Provinciall Councell shall and may name more Provost Marshalls, as they shall think expedient, qualified with the like authority.\n\n11. Item, It is further ordered, that no temporall Government or Jurisdiction shall be assumed, kept, or exercised in this Kingdome, or within any County or Province thereof, during these troubles, other than is before expressed, except such Jurisdiction and Government as is, or shall be approved by this Generall Assembly, or the Supreme Councell.\n\n12. Item, It is further ordered, that whosoever hath entered, since the first day of October 1641, or shall hereafter, during the continuance of the warre in this Kingdom, enter into the Lands, Tenements, or Hereditaments, at or immediately before the first day of October, either by himselfe or his under Tenants, or by receiving the Rents, Issues, or Profits thereof, shall immediately restore, upon demand, the said Possession to the party or parties so put out, with such reasonable damages, as the Councell Provinciall or Supreme shall think fit; and if the party refuse to restore the said Possession as aforesaid, upon demand of the party so put out, his heires or assignes, made to the said possessor, his servants, or adherents in the premises or publication of this Order within the parish where such land lieth, that upon his or their deniall thereof, or default therein, he, his heires and assignes shall be for ever after debarred and secluded from all and every right, title, interest, and demand which he or they may make or pretend to all or any the said lands, tenements, or hereditaments; and if after such deniall or default made, the said party, his heires or assignes shall not immediately restore the possession of the said lands, tenements, or hereditaments so gained, to the party grieved, his heires or assignes, that he, they, and his or their adherents in the premises, shall be declared and proceeded with as enemies. Provided, and so it is meant, that if any of the parties so put out be declared a Neuter or enemy by the Supreme or Provinciall Councell, then the party who gained the possession, as aforesaid, shall give up the possession to such Person or Persons as shall be named either by the said Councell Provinciall, or Supreme Councell, to be disposed of towards the maintenance of the generall Cause, upon the paine and penalty aforesaid.\n\nAnd as for the Rents and meane Profits of the said lands, tenements, and hereditaments, and all kinde of Rents, and the goods or chattels taken or detained from any Catholike, as aforesaid; due satisfaction is to be made for the same to the parties from whom the Rents, Goods, or Chattels were or shall be detained, since these troubles begun, as the Provinciall Councell, or County Councell shall respectively order.\n\n13. Item, It is further ordered and established for the re-", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous and Kilkenny - 1643 - Orders establisht in the popish generall assembly, held (under the specious pretence of supreme auth_page_5.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1568, "total-output-tokens": 900, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 3753, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]