[{"id": "79e67e245718c42a92030465b5409d051d407ed4", "text": "Before the War, if I bought any Commodity in France which cost me a Livre, I paid eighteen Pence English for it, as is well known to every Body that had Dealings there; if I buy now the same thing in France for a Livre, I pay but one Shilling for it, by which means all their Manufactures are rendered so very cheap to us, that if there was but moderate Duties upon their Importation, we should immediately be over-whelmed with French Commodities. For as their Work-men receive no more Sols or Pence for their Days-work or Wages than they did formerly, they sell their Cloth, Paper, and Linnen for no more Sols than they used to do: Therefore if I bought heretofore an Ell of Linnen for a Livre, it cost me then eighteen Pence, and now buying an Ell of the same Linnen for a Livre still, it costs me but one Shilling.\n\nOn the contrary, when the French bought anything of us before the War, if it cost them one Pound Sterling, they paid but thirteen Livres for it; and if they buy now the same thing for one Pound Sterling, they pay twenty Livres: Which renders every Commodity we have so very dear to them, that 'tis hardly possible they should take any thing from us, but what they have an absolute Necessity for.\n\nFor if they bought formerly a Yard of Cloth here for fifteen Shillings, they paid but nine Livres three Quarters for it; and if they buy now here a Yard of the same Cloth for fifteen Shillings, they must pay fifteen Livres: Which", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Janssen - 1713 - General Maxims in Trade_page_26.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1384, "total-output-tokens": 372, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1445, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]