[{"id": "b67112d7f465b0d78a3ca156a8e4aedcd532df74", "text": "or exercised a power over the liberty of another, without having made full and impartial enquiries whether that liberty is justly forfeited, and is also justly at the disposal of the seller; or without being convinced in his conscience that the fact is so; whoever detains the slave in bondage directly or indirectly a moment after that conviction has been done away; or a moment after the conclusion of the time for which the slavery may justly be continued; whoever does not faithfully discharge the duties of a master, or transfers his slave to another whom he does not think likely to discharge them, commits in each of these cases a flagrant sin against God; and in most of them as flagrant an act of injustice to man.\n\nThe requisites necessary to reconcile a state of Slavery with justice, applied to the mode of purchasing Slaves on the Coast of Africa.\n\nNow are any of the indispensible requisites to the acquisition of a just title to a slave scrupulously attended to on the coast of Africa? Are any of them, except the honest payment of the price, attended to at all? Does the purchaser make a conscientious inquiry, or any inquiry whatever, into the fundamental points, whether the liberty of him who is exposed to sale be justly forfeited, and also be justly at the disposal of the seller? Can he, who has bought a thousand slaves, point out any five of them with respect to whom he has sufficient reason to believe this", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Gisborne - 1792 - On slavery and the slave trade_page_1.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1200, "total-output-tokens": 327, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1432, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]