[{"id": "dd6e45a5e802f01de29b73850179f8be7d4eff80", "text": "but those who live under a government, so constitutionally checked and controuled, that proper provision is made against its being otherwise exercised. The late act is founded on the destruction of this constitutional security.\n\nIf the parliament have a right to lay a duty of four shillings and eight pence on a hundred weight of glass, or a ream of paper, they have a right to lay a duty of any other sum on either. They may raise the duty as the author before quoted says, has been done in some countries, till it \"exceeds fifteen or eighteen times the value of the commodity.\" In short, if they have a right to levy a tax of one penny upon us, they have a right to levy a million upon us. For where does their right stop? At any given number of pence, shillings, or pounds? To attempt to limit their right, after granting it to exist at all, is as contrary to reason, as granting it to exist at all is contrary to justice. If they have any right to tax us, then, whether our own money shall continue in our own pockets, or not, depends no longer on us, but on them. \"There is nothing which we can call our own,\" or to use the words of Mr. Locke, \"What property have we in that, which another may, by right, take, when he pleases, to himself.\"\n\nThese duties, which will inevitably be levied upon us, and which are now levying upon us, are expressly laid for the sole purpose of taking money. This is the true definiti-", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1768 - Letters from a farmer in pennsylvania_page_74.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 359, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1421, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]