[{"id": "c01b10d60add84a1ec0800ce41d77762092f6e7f", "text": "us of, without our consent, whilst Great Britain continues a free and independent Kingdom, and her children retain any degree of love for the laws of England and for civil liberty.\n\nTo say, that our rights and possessions are secured to us by the laws of England, and yet at the same time, that we have no title to those powers and privileges, without which they cannot subsist, is downright impudent nonsense; it is mocking us with the sound of Liberty and Property, and robbing us of the substance.\n\nIf we are freemen, and not slaves, our liberties are as much our inheritance, as our lands. If our lives, liberties, and properties are not our inheritance, secured to us by the same laws, determined by the same jurisdictions, and fenced in and defended by the same constitution, as the wisdom of our ancestors found it necessary to establish, for the preservation of these blessings in our mother country; then, are the subjects of the Colonies, not freemen but slaves; not the free subjects, but the outcasts of Britain; possessing these invaluable blessings, only as tenants at will, the most uncertain and wretched of all tenures; and liable to be dispossessed, by the hand of power.\n\nLord chief justice Coke, (that oracle of law) being a member of the house of Commons, in the reign of Charles the 1st. said, in a conference with the Lords: \"For a free-man to be a tenant at will of his liberty; I", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1766 - The privileges of the island of jamaica vindicated_page_64.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1430, "total-output-tokens": 336, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 1404, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]