[{"id": "fc667aee944b8ad125cccddf08c667933d92263d", "text": "The Rumpant Story.\n\nA single person, something like a King,\nNoll's craft, and crew, and power, to palls did bring,\nProtector; or Projector rather, levelling\nAll to his lusts, a while sits proudly revelling\nThe Feather in his Cap, the Title King\nHee calls, and yet the Power still usurping;\nFive years hee rul'd, not reign'd, himself protecting\nBy Power and Sword, all just men else rejecting,\nIn his own craft God still was him defeating.\nHee would and would not, so hee liv'd by cheating.\n\nCalls three Mock-Parlaments, breaks up the thing\nOf his own making, cause hee would bee King;\nA pack of knaves were some, some could not give\nUp our Grand Laws, whilst Charles his Son did live.\nNoll's fit to rule, but no just Title having,\nMakes him unjust, and made him alwayes craving\nOf all Religions that made for his supporting,\nMade all opinions stirrup his usurping;\nA Coach-box favour God him once was giving,\nOn Michaelmas day, to change his wicked living.\n\nState Secretary in the Coach doth sit,\nProtector in the Coach-box, where's his wit?\nSometimes such frolicks mad into his brain\nWere whimsied by his spirit, or his Train;\nBut this one Act was like their Actions all,\nOne draws another, now Noll gets the fall,\nYet God had mercy, though that Noll had none,\nNoll had some virtues, mercy hee lackt alone;\nOne of his three Mock-Parlaments was sitting,\nWhen as their Head at the horse-heels was flitting.\n\nSome part o'ch' Army Nol abroad doth send,\nFor Gold, to Hispaniola, keeps to mend\nThe rest, worms Lambert out, and others trembling\nObey, yet most do hate his base dissembling.\nHis Major Generals, Semi-dragons sting\nThe Land; Noll Bashaws then deserv'd the string.\nFor moneys sake the Jews he in would bring,\nCause they fore him had murder'd Christ their King.\nHe then pleads for the Jews the Scripture Text\nFor their Conversion, though with his own he's vex't.\n\nHe doth Divines call up from severall places,\nTo colour that design, his Chaplains faces\nAre not so braz'd as his, he turns the Jew,\nHe gets the Gold, and then forsakes that crew.\nStill mony lacks, for that his conscience bends\nHis power and sword, and valor thereto tends,\nIt must be had, if that the Gods deny,\nThe Acheron hee'l force, and Devils try,\nMakes Churches stables, a Sacrilegious thing,\nThis was the Reformation Noll did bring.\n\nBrave man, where doth thy spirit sadly rumble?\nHow in this world did thy asprings tumble\nThings upside downe Valour with Counsel awayd\nIs good, grand Noll makes all the world afraid.\nHow many seem to blefs when as they curse?\nNoll cares not, so that hee have power and purse.\nHow did his Parlaments and himself agree?\nHow did his several speeches made to three\nConcur? and with his Recognition more,\nPrayes, and protests, and swears, makes up the score.\n\nE He", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Mullinax - 1660 - Symplegades antrum, or the rumpant story impartially relating their tyrannical dealings, and clymacterial downfall_page_16.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1706, "total-output-tokens": 742, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2771, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]