[{"id": "2ac8ef54056b8d8a18e37b7ef34968ea407c508c", "text": "Their Queen, and I am weary of the Load,\nAnd want a Friend like thee to lull my Sorrows.\n\nC. Eff. Behold these tears sprung from fierce Pain and Joy,\nTo see your wond'rous Grief, your wondrous Pity.\nO that kind Heav'n would but instruct my thoughts,\nAnd teach my Tongue such soothing, healing Words,\nThat it might Charm your Soul, and Cure your Breast\nFor ever.\n\nQueen. Thou art my better Angel then,\nAnd sent to give me everlasting quiet—\nSay, Is't not pity that so brave a Man,\nAnd one that once was reckon'd as a God,\nThat he should be the Author of such Treasons?\nThat he, that was like Caesar, and so great,\nHas had the Power to make and unmake Kings,\nShould stoop to gain a petty Throne from me?\n\nC. Eff. I can't believe 'tis in his Soul to think,\nMuch less to act a Treason against you,\nYour Majesty, whom I have heard him so\nCommend, that Angels words did never flow\nWith so much Eloquence, so rare, so sweet,\nThat nothing but the Subject cou'd deserve.\n\nQueen. Hast thou then heard him talk of me?\n\nC. Eff. I have,\nAnd as of so much Excellence, as if\nHe meant to make a rare Encomium on\nThe World, the Stars, or what is brighter, Heav'n.\nShe is, said he, the Goddess of her Sex,\nSo far beyond all Woman kind beside,\nThat what in them is most ador'd, and lov'd,\nTheir Beauties, Parts, and other Ornaments,\nAre but in her the Foils to greater Lustre,\nAnd all Perfections else, how rare soever,\nAre in her Person but as lesser Gleams,\nAnd infinite Beams that usher still the Sun,\nBut scarce are visible amidst her other brightness.\nAnd then she is so good, it might be said,\nThat whilst she lives, a Goddess reigns in England,\nFor all her Laws are register'd in Heaven,\nAnd copy'd thence by her———But then he cry'd:\nWith a deep sigh fetch'd from his loyal Heart,\nWell may the World bewail that time at last,\nWhen so much Goodness shall on Earth be mortal,\nAnd wretched England break its stubborn Heart.\n\nQueen. Did he say all this?\n\nC. Eff. All this! nay more,\nA thousand times as much, I never saw him.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Banks - 1699 - The unhappy favourite_page_37.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1660, "total-output-tokens": 552, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2009, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]