[{"id": "4176e43003ef9b98e64ca0d9fcda97be9d816e81", "text": "That the India Trade was encreased before the War, to a very great height, and their Manufactures in so great request, that they (from being a Scandal to be worn a few years before) soon after became the general Wear of almost all sorts and degrees of Persons; by which means our own Manufactures were neglected, and our Manufacturers thereby under great discouragement, being not able to carry on their Trades, many were forced to give over, whereby the Poor wanted Employment, the Price of Wool reduced very low, and great quantities of Wool could not be Manufactured: Whereupon the Parliament thought it necessary to make a Law for Burying in Woollen, thereby to consume some of the Wool that lay heavy upon the Growers Hand.\n\nThat the Indians have Provisions and Materials very cheap, and Wages at three Half-pence or two pence a Day; which disables us, and the rest of the European Traders, to contend with them; and for this reason, their Trade did encrease apace, until this War; and unless restrained, will most certainly encrease, to the ruining of our best Fabricks, and the vast number of People that have their Livelihood and Dependance thereupon.\n\nThat since this War, the India Company have laboured under some Discouragements, and but small quantities of their Manufactured Goods, in proportion to what they formerly brought in, have been Imported; by reason thereof, great Encouragement hath been given to the Manufactures of Silk, Half-Silk, and Worsted, which have been very much improved in a great variety of Figured, Strip'd, and other sort of Stuffs, which have been made not only in London, Norwich and Canterbury, in much greater quantities than ever; but this Manufacture has now spread itself to Bristol, Newbury, and divers other Parts of the Kingdom; and will yet encrease, if due Encouragement be given thereto.\n\nThat since our Trade hath encreased, greater numbers of Poor have been employed, and greater quantities of English Wool consumed; so that the Price of the Wool is advanced, and the Labour and Wages of the Poor encreased; which enables them to live comfortably, and consume the Produce of the Land, to support themselves and Families; which is of great Advantage to the Landlords and Tenants, and the Benefit of the whole Nation.\n\nThat in case the East-India Stock should be enlarged, and that Trade settled by Act of Parliament, it will be in the power of that Company to ruin our Woollen and Silk Manufactures, and bring down the Price of Wool, and Work-men's Labour and Wages, as low, if not lower, than ever, unless the Wearing of the said Manufactured Goods be prohibited in England, and the Plantations.\n\nThat such Prohibition would not only encourage our own Manufactures, upon which the Value of Lands, and the Employment of our Poor depends, but prevents the Exportation of much of our Coin, which at this time can be very ill spared; and also prevent many of the Inconveniences feared from the Scotch East-India Company.\n\nThat since there is a Trade found out to the Indies, no Objection can well be made against their Trade in Spices, Drugs, Salt-petre, &c. nor against the Manufactured Goods that are brought in, and again exported to Foreign Markets; because it will be carry'd on by others, if we should neglect it: But certainly it must be accounted very ill Husbandry, and will be of fatal and ruinous consequence, to destroy our own Manufactures, and send our Gold and Silver to the Indies, from whence it will never return, to purchase Manufactur'd Goods to be consumed at Home, when our Money may be kept here to circulate among ourselves; and is so necessary to our Commerce, and payments of our Fleets and Armies, without which, we can neither be rich or safe.\n\nThat the great Argument that is used in favour of the East-India Company, is, That although they Export great Quantities of Bullion, yet they bring in much more for the Goods they sell in Foreign Markets. Supposing their Assertion to be true, this can be no Argument against the prohibiting their Manufactures to be worn in England, and our Plantations, but rather an Argument for it; for what is consumed at Home, brings in no Bullion; and if none be consumed at Home, more may be sent Abroad; for it will make the Company more industrious to find out either New Commodities to deal in, or Markets for the vending thereof, whereby they may make their Trade more Profitable to the Nation.\n\nIt is also alleged, in favour of the East-India Trade, That there have of late years been great Quantities of English Cloth Exported by the Company. To which this Answer is to be given, That the Cloth by them Exported more than formerly, is not consumed in India, but sent thence to Persia; which hinders the Turkey Merchants, who formerly used to supply those Markets. So that the East-India Company sending away our Cloth, proves no Advantage to us, and is only done to gain a good Opinion, and make the Nation believe that their Trade is not so prejudicial to us as has been represented, or as in reality it is.\n\nThat the sending our Money to the East-Indies, to purchase Goods perfectly Manufactured there, may Advance Lands, Enrich the People, Employ the Poor in India: But such as are spent here, in the room of our own Manufactures, must have the quite contrary effect with us.\n\nWhether it be for the Interest of England, to Settle the East-India Trade, without Restrictions, is humbly submitted to the Consideration of the Parliament.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous and Company - 1691 - A list of the names of all the adventurers in the stock of the honourable the East-India-Company, th_page_9.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1890, "total-output-tokens": 1223, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5456, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]