[{"id": "58a257c463ffb5c4ed37a89ff614e4ef4cd1e5a2", "text": "The Epistle Dedicatory,\n\nviolent? and on the contrary, upon the kind Aspects of the Sun, Jupiter, and Venus, they be not more gentle, mild, and refrigerating? and also, Whether the arising of your Pleiades, Hyades, and Constellated Eagle, &c. (chiefly when any eminent Conjunction or Aspect falls in with them) do not certainly induce Moisture?\n\nI beseech you (my honoured and worthy Friends) to take some notice of these matters, which you may easily do, by keeping a Diary of the Weather; as also of the Effects of your Vernal Ingresses, (which I intend, God permitting me Life, once a Year to present you withal;) and pray ye also observe, together therewith, the Transits, Conjunctions, &c. of the Planets over the prime parts of your Islands Palladium, or Genesis; that they may be preserved by your generous Communication, as well for the advance of Truth in Science, as advantage of your Selves and Country.\n\nThus, worthy Friends and Countrymen, wishing you all Happiness, and, as so many successful Columbus's, to encrease as well in your Acquaintance with the Influences of the glorious Diamonds of Heaven, as in the Gold and Treasure of the Indies; which (if St. Paul may be credited, Rom.1.19.) will lead ye certainly unto an enjoyment of that Immortal Treasure, of which Saints and Angels partake in Heaven —— I remain,\n\nTo your Honoured Selves, and to the Truths of Astrologie, a Real Servant, whilst,\n\nBrick-Court, by the Deans-Yard, Westminster.\n\nJohn Gadbury.\n\nThe Names of the several Governors of Jamaica, since the taking thereof by the English, Anno 1655.\n\n1. The Honourable Col. D'Oyley, was Governour thereof, first after its being taken.\n\n2. The Right Honourable the Lord of Windsor, was Governour thereof.\n\n3. The Honourable Sir Thomas Modyford, Knight and Baronet, was Governour of this Noble Island; And He it was that commanded a general Surveigh to be taken of it, at his own Charge; and under him it began eminently to flourish.\n\n4. The Honourable and Valiant Sir Thomas Lynch, Knight, succeeded Sir Thomas Modyford, and is the present Governour thereof; and under him hath this gallant Country happily improved.\n\nIn my next years Book, I shall (God permitting) give you a more ample Chronology of the Remarkables relating to this Noble Island; together with an Account of the Commodities, and growth thereof.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Gadbury - 1672 - The Jamaica Almanack_page_4.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1844, "total-output-tokens": 593, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2338, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]