[{"id": "6dfed242b7f9af047bbc0be575a10fed061b3d31", "text": "These Trees are exceedingly different amongst themselves; for some shoot up in 2 or 3 bodies; others in one, as this. Their Leaves are many of them dead, and most discolour'd, unless on very young Trees. They are not at all beautiful, nor so agreeable to the Eye, as the Fruit is to the Palate of them that love Chocolatto. The number of Codds the Tree produces, is uncertain: But we reckon, a bearing Tree yields from 2 to 8 pound of nuts a year; and each Codd contains from 20 to 30 nuts.\n\nThe Manner of Curing them is; to cut them down when they are ripe, and to lay them to sweat 3 or 4 days in the Codds; which is done by laying them on heaps. After this they cut the codds, and take out the nuts, and put them into a trough cover'd with plantan-leaves, where they sweat again about 16 or 20 days. The nuts that are in each codd, are knit together by certain fibres, and have about them a white kind of pulp, that's agreeable to the palate. By the turning and swetting their little strings are broken, and the pulp is imbibed and mingled with the substance of the nut. After this, they are put to dry 3 or 4 weeks in the Sun, and then they become of a reddish dark colour, as you see, and so are cured.\n\nWhat is remarkable in this Fruit is, that the Codds grow only out of the Body or great Limbs and boughs; and that at the same time, and in the same place, there are blossoms, young and ripe fruit.\n\nThese Trees bear at different times; the greatest crop at most of our Cacao walks is in December and January: But at one of Colonel Modifords walks, whence this Tree was taken, they bear most in May; yet its not above 5 miles from those walks, which bear always in December: But those that bear then, have some fruit in May; as the other have in December.\n\nIt's planted first in the Nut, always under shade: Sometime it under Cassava; others, under Plantan-tree, and some in the Woods. The Spaniards used a certain large shady plant, called by them Madre di Cacao: We only the others; and seldom transplant, only where it fails, as it doth many times in open, poor and dry lands: for, this Tree requires to be shelter'd.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1753 - An accurate description of the cacao-tree_page_2.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 1522, "total-output-tokens": 564, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 2127, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]