[{"id": "f9063994e8b4fda4e10b1be0966fc3d6fd5dff7e", "text": "our own People in England, and pay Three times the Price for it; they make the return of all their Industry and Labour to us; this is the Center of their Wealth, the Place where they lay it up, and where their 'offerity spend it'; therefore to Burthen them, is to Ruin the most Profitable and most Industrious part of our own Body.\n\nBut 'tis Objected, That though this be true, it does not appear that laying a Duty on their Goods here can be a Burthen or Ruin to their Trade, it being rais'd here nor there, and paid by the Importer, and to him again by the Retailer, and at last by the Consumer, in the Prices of the Goods; all Taxes in general being supposed to be paid by the last Buyer.\n\nThis were a good Argument, if sad Experience had not made it appear to be a mistake; and to convince those who are of another Opinion, 'twould be necessary a little to examine the History of the Trade, and of the last Duty imposed upon it.\n\nOur Sugar Trade, in general, is but a young Manufacture, and dates its Original within the Memory of some Persons now living, and is, perhaps, the greatest improv'd Trade, and the most Profitable to England, that is, or ever was in the World. The first cause of its rise was from the Indiscretion of the Portuguese, who presuming upon their being Masters of the Sugar-Trade in the Brazils, laid a heavy Tax on their own Sugar, which encourag'd our Island of Barbadoes, to whom first the way of making of Sugar was discover'd, to run into the Trade; and it has been in vain that the Portuguese saw their Error, and have since endeavour'd to retrieve it. This is to direct an Example; 'tis needless to argue it. And whoever knows the Sugar-Trade, cannot be ignorant, that it is not impossible to be lost by the same Error by which it was gain'd.\n\nIn the Reign of the late King James an additional Duty was laid upon Sugar, notwithstanding all the Remonstrances of the Traders and Planters to the contrary; and yet even then nothing but the pretence that the Duty would not affect the Planters but lie on the Consumer, with a Promise of His Majesty to remit it if it prov'd otherwise, could make it seem tolerable.\n\nBut when time demonstrated the sad effect it had on the Planter, and they applied for Relief, they were answer'd, 'Twas an Unmanly thing to put His Majesty in mind of His Promise.\n\n'Tis true, if Sugar was Planted and Cur'd in England, the Duty might lie on the Consumer, as in other Cases it does; but here the Case differs exceedingly.\n\nThe Planter is the Seller at our Market, the Merchant here is but the Factor; when the Planter Ships his Sugars for England he consigns them to his Factor to be Sold for him, and generally draws Bills upon his Factor for as much as he supposes the Produce to be, and sometimes more.\n\nUpon laying the Duty abovementioned, the Experiment was made; the Factor had two ways to manage the Sugars and Bills, and no more.\n\n1. To Accept the Bills absolutely. Or,\n2. Conditionally.\n\nIf he accepted the Bills absolutely, he would then sell the Goods at the Market-price, let it be what it would, to enable him to comply with the Payment; and if the Produce did not make it good, the Planter remain'd Debtor to the Balance, so the Loss return'd upon him.\n\nIf he accepted the Bills conditionally, that is, to pay when the Goods are sold: If the Goods did not sell in time, the Bills went back protested, or else were Noted, and lay here at Interest and Charges. By both which the Planter was a considerable Loser both in Money and Reputation.\n\nThe Buyers here knowing too well these Methods of their Trade, and that of Necessity the Factors must sell for the Reasons aforesaid, refused to advance in Price notwithstanding the Duty, and withheld buying by a General Consent, and the Consequence soon answered their Expectation, for the Factors were forced to sell at the old Price to support the Credit both of themselves and their Principals.\n\nBut some of the most Considerable Factors being willing to try all possible Ways for their Employers, shipp'd off great Quantities for Holland, Hamburg, and other Parts, but those Markets being not able to take off the Quantities, and the Bills still following the Goods, to enable the Exporter to pay the Planters Bills, as above, the very same thing follow'd Abroad, the Goods were forced to be sold to raise the Money, and the Loss fell still upon the poor Planter.\n\nThus, whoever pays the Money, the Planter bears the Loss, and is left in Debt, and consequently Undone; for 'tis quite another thing to be in Debt in the West-Indies than 'tis in England.\n\nThat the Planter is not able to bear the Duty, at least, at this time, is the next thing to be proved, and that is as plain as the other. The War which has lasted now nine Years, has been a General Prejudice to all Trade, but to the West-India Trade in particular: And in the West Indies, the Islands of Barbadoes and Jamaica have been as it were destin'd to be Ruin'd, having besides the War had a Complication of Disasters, as the dreadful Earthquake, and the Insurrection of the Negroes at Jamaica, the Loss of Three or Four entire Fleets from Barbadoes, by Disaster of Weather and Hurricanes, together with a Distemper brought amongst them by the Men of War, little better than the Plague, which swept away great Numbers of their Inhabitants.\n\nAlso they have raised Forces, and fitted out Ships at their own Charge for several Expeditions; and in short, besides their Losses at Sea by the French, with the Ruin of great part of Jamaica, and St. Christophers, by their Descents, have raised larger Taxes on their Estates than has been paid by us at home; by which Means there is not half the Sugar planted in the West-Indies that was before the War.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jacob/Anonymous - 1695 - Reasons humbly offer'd, why a duty should not be laid on sugars_page_2.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 1, "total-input-tokens": 2028, "total-output-tokens": 1346, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 5728, 1]], "primary_language": ["en"], "is_rotation_valid": [true], "rotation_correction": [0], "is_table": [false], "is_diagram": [false]}}]