[{"id": "2948de5c1caa9715654c35bb43ffda28e6a238d2", "text": "What did early Canadian pioneer eat?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: W. O. Fraser\nAddress: O'Keefe Ranch\nBirthplace: Portage La Prairie, Man\nBorn: Sept. 23, 1880\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start housekeeping in eastern Canada? 1902\n   Where did you set up housekeeping? Bradshaw, Man\n   Where had you been living before that? Hamilton, Man\n   For how many people did you prepare meals? myself\n   How far was it to your nearest store? In Bradshaw\n   How often could a visit be made to the store? Any time\n   What groceries did you usually buy in those earliest years? oat meal\n   Sugar, apples, meat from farmers, milk\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Gilmore\n   In what quantities did you buy it? 50 pounds per bag\n   What was the usual price per hundred pounds of white flour? $2.75 per bag\n   How much did you use graham flour? 50 pounds per year\n   Whole wheat flour?\n   Was flour milled locally? Yes\n   How far away? 40 miles\n   What year? 1900\n   What was the price for a twenty pound bag of rolled oats? 80 cents\n   What other grain products did you use?\n   Cornmeal? A little\n   Whole wheat? A little\n   Farina? A little\n   Other?\n   Did you grind your own wheat for porridge? Some whole wheat\n   How did you grind it? Stock Crusher Roller\n1. INTERMEDIATE HISTORY\n\nWhat year did you start school? 1902\nWhere did you go to high school? [illegible]\nWhere have you been living before that? [illegible]\nFor how many years did you live there? [illegible]\nHow far was it to your nearest store? [illegible]\nHow often could a visit be made to the store? [illegible]\nWhat commodities did you usually buy in those early years? [illegible]\n\nSugar, apples, meat, flour, potatoes.\n\n2. FLAX AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [illegible]\nIn which quantities did you buy it? [illegible]\nWhat was the usual price per hundred pounds of white flour? [illegible]\nFor how much did you use regular flour? [illegible]\nHow much flour milled locally? [illegible]\nWhat was the price for a twenty pound bag? [illegible]\nWhat other grain products did you use? [illegible]\nCornmeal? [illegible]\nOats? [illegible]\nDid you grind your own wheat for hominy? [illegible]\nFor all? [illegible]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20\nWhat was the price for a ten pound sack of white sugar?\nWhat brand of golden corn syrup did you use? Maple\nWhat size of tin of syrup did you usually buy? Five pints\nAt what price? 6c\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Yes\nPlenty\nButter? Plenty\nEggs? Plenty\nWhat was the price of butter? 5 to 6c\nDid you pack eggs for inter? Yes\nDid you make butter? Yes\nCheese? No\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, Pork, Deer, Pheasant, Chickens, Quail, Pheasants\nHow did you get fresh meat? Shoot and Raise on Farm or Buy from Farmer\nHow often did you get fresh meat? All Winter\nHow did you preserve meat? Brine, Jerk Meat, Deer\nWas there a \"beef ring\" in your neighborhood? No\nIf so what year was it organized?\nDid you use game? Yes\nWhat kinds? Deer, Moose\nFor how long? Winter, 1920\nWhat part did fish play in the family diet? Some Fish\nin Spring and Winter\nWas the fish fresh, curst, or canned? Fresh or Salt\nKinds? White Fish, Jack Fish, Pickeral\n2.\n\n3. **SUGAR AND BUTTER**\n\n   - In what quantity did you buy \"Hills\" sugar? 20 lbs.\n   - What was the price for a ton (per lb.)? $1.50.\n   - What brand of butter did you buy? Smith's.\n   - What size of tin of butter did you usually buy? 1 lb.\n\n4. **DAIRY PRODUCTS**\n\n   - How did you get a supply of fresh milk in the early part of the year?\n     - Butter.\n     - Cheese.\n     - Yogurt.\n   - What was the price of butter? 5¢ per lb.\n   - Did you purchase from the store? Yes.\n   - Did you make butter? No.\n   - What kind of cheese?\n\n5. **MEAT AND FISH**\n\n   - What was your meat supply in the early part of the year?\n     - Poultry.\n     - Pork.\n     - Beef.\n     - Lamb.\n   - How did you get fresh meat?\n     - From the store.\n     - From the butcher.\n     - From the market.\n   - How often did you get fresh meat?\n     - Weekly.\n     - Bi-weekly.\n     - Monthly.\n   - How did you preserve meat?\n     - Canned.\n     - Frozen.\n     - Dried.\n   - Was there a \"short time\"?\n     - Yes.\n     - No.\n   - If so what year was it?\n     - 1920.\n   - Did you use games?\n     - Yes.\n     - No.\n   - For how long?\n     - 1920.\n   - Did you buy fish in the family diet?\n     - Yes.\n     - No.\n   - What kind of fish?\n     - Fresh.\n     - Salted.\n   - Notes:\n\n   - Use the fish fresh, canned or cured.\n6. Beverages:\n   - What kind of tea did you buy? Black tea.\n   - At what price? 40¢.\n   - What kind of coffee did you buy? (beans or ground) Ground.\n   - Price? 25¢.\n   - What other beverages were used? Chocolate.\n\n7. Vegetables and Dried Fruits:\n   - What was the price of potatoes per bushel when you set up housekeeping?\n     - 35¢.\n   - Could you get potatoes at the store? No.\n   - If not, where from? Farm.\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes 1902, Cabbages 1902, Carrots 1901, Onions 1902,\n     - Turnips 1902, Beets 1904.\n   - In what quantities did you buy white navy beans? None.\n   - How did you buy prunes, (in bulk or by the box)? At store.\n   - What weight? 10 pounds.\n   - How did the grocer handle prunes (by box)? None.\n   - Monthly bulk.\n   - What was the price of prunes? 6¢.\n   - What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n     - Dried and some welch.\n\n8. Preserving:\n   - In the early years did you preserve any foods by drying? Yes.\n   - Pass? Yes.\n   - Corn? Yes.\n   - Beans? Yes.\n   - Saskatoons? Yes.\n   - Other foods? None.\n   - What year did you first preserve fruit by canning? 1910.\n   - What year did you first preserve vegetables by canning? 1910.\n   - What year did you first preserve meat by canning? 1912.\n   - Do you still preserve foods by canning or drying? Yes.\n   - To what extent? Preserve family.\n   - Did you make your own vinegar? No, don't know.\n   - Mother made vinegar in the years from 1880 to 1920.\n| Food                  | Price |\n|-----------------------|-------|\n| Soda biscuits         | 19.00 |\n| Macaroni              | 19.00 |\n| Graham flour          | 18.86 |\n| Brown sugar           | 18.86 |\n| Molasses              |       |\n| Table salt            | 18.86 |\n| Common salt           |       |\n| Lily white syrup      | 18.86 |\n| Toilet soap           |       |\n| Baking powder         | 18.86 |\n| Baking soda           | 18.86 |\n| Dried peas            |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Raisins - seeded      | 18.86 |\n| Raisins - seedless    | 19.20 |\n| Rice                  |       |\n| Currents              | 18.99 |\n| Store jam - kinds?    |       |\n| Cheese (Cheddar or store cheese) | 19.20 |\n| Vanilla               |       |\n\n**Made our own to 1910**\n\n---\n\n**10. BAKING**\n\nWhat type of yeast did you use? **Heart Cakes**\n\nDid you make yeast for your own use? **Yes**\n\nUsing hops? **No** Salt rising? **No**\n\nDid you buy baking powder? **Yes**\n\nBaking soda? **Yes**\n\nCream of tartar? **Yes**\n\nDid you make your own baking powder? **No**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|-----------------------------------------------|\n| Canned salmon               | 1898                                   |                               |                                               |\n| Canned sardines             | 1900                                   |                               |                                               |\n| Other canned fish that appeared early - give names |                               |                               |                                               |\n| Apples - fresh              | 1886                                   |                               |                                               |\n|                             | dried                                  | 1886                          |                                               |\n| Lettuce                     | 1900                                   |                               |                                               |\n| Tomatoes - fresh            | 1886                                   |                               |                                               |\n|                             | canned                                 | 1886                          |                                               |\n| Bananas                     | 1900                                   |                               |                                               |\n| Lemons                      | 1900                                   |                               |                                               |\n| Oranges                     | 1910                                   |                               |                                               |\n| Cornflakes                  | 1910                                   |                               |                                               |\n| Other prepared breakfast cereals - give names |                               |                               |                                               |\n| Pearl tapioca               |                                        |                               |                                               |\n| Minuto tapioca              |                                        |                               |                                               |\n| Sago                        |                                        |                               |                                               |\n| Dates                       |                                        |                               |                                               |\n| Walnuts                     |                                        |                               |                                               |\n| Icing sugar                 |                                        |                               |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWater in Manitoba was in wells. In Saskatchewan, 1910, hauled in two miles in Tank - House Tank in Cellar.\n13. SOAP\n\nDid you buy laundry soap or make your own? Yes\nIf you made your own, did you use lye? Yes\nWhat kinds of laundry soap did the grocer handle? Lye, washing soda\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\nWhere did you get your fuel? From the mountain\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) 1880\nDid you use an outdoor fireplace or bake oven? (Give dates) 1920\nBy whom was your first cook stove made? Copper Bros - Wrightstown\nWhat year was it purchased? 1880\nPrice? $6.00\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Copper\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware\nWhen did you first see enamel ware? 1920\nAluminum? 1929\n\nMost utensils were done by hand.\n16. WRAPPINGS AND CONTAINERS\n\n Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n Brown paper for wrapping since I can remember or cheap brown paper.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n Porridge, Eggs, Bacon, Bread, Toast over wood fire. We were on a farm in Hamilton Man. from 1890 to 1900, ages 20-18-16-14-12-8-4.\n\nIn 1900.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\n Mother in 1880 at Portage la Prairie myself in 1906 at Sunnyside Manor.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n No - not personally. From 1932 to 1934 very nearly for some in Okotoks District.\n\nAny food is better than nothing.\nBrown Paper from another place.\n\nNever use brown paper.\n\nGive a typical name (brochures, letters & reports) for the earliest.\n\nYear was our parents? Give the year and list the names of the children in the order they were born.\n\nParley's, 1890. Brown - Bueler Forest - own\n\nWe moved from Maine from 1890 to 1900 ages\n\nMormon for many years 1896-1906 - 8-4\n\nIn 1906. 30-18-16-14-12-8-4\n\nWhat did you do at your first Christmas dinner in eastern Idaho?\n\nList five things present and five things absent at the time.\n\nChristmas Eve 1889 at Portage, Idaho\n\nChristmas Eve 1906 at Jackson County, Oregon\n\nNo permanent home from 1930 to 1950\n\n1930 very nearly after a move in\n\nButte\n\nAny history in your family?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWe ate from boyhood more from the garden. More home cooking, more wild fruit. Still eat a good deal of the same since 1940 more canned goods, fruit, vegetable, bakers bread.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nUs about 1940\nOthers 1930\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nI was brought up on a farm and our food came from the garden, a great deal of wild fruit tomatoes which we still can.\n\nThe majority in our neighborhood even from farms use canned goods do not have a garden, and do not use any wild fruit.\n\nIn my boyhood days we always had plenty to eat. We were taught to help all others and to not waste to help any person who can work need not be hungry or cold at any time.\nWe ate from boyhood on our own garden and fruit. We grew our own vegetables and fruits.\n\nSince 1940 we have canned goods. Fruit Vegetables. Baker Bread.\n\nWe almost 1940\n\nOthers 1930\n\nI was brought up on a farm and garden. A good deal of our food came from the garden which we grew in our own orchard.\n\nThe majority of our food came from our own garden. We did not have any wild game or animals.\n\nIn any hurry to eat, we were taught to help ourselves and work out our own way.\n\nAny person who can work out their own way is doing well.\nArchives Office Box 100\nSaskatoon\n\nDear Sir,\n\nWestern pioneers in Manitoba and Saskatchewan ate very well sixty years ago. Vegetables were a daily portion; more attention was paid to their cultivation then now. With its town and country, breakfast, porridge (at meal), bacon & eggs, tea or coffee.\n\nDinner:\nMeat: Beef, Pork, Chicken, mutton\nPotatoes, carrots, cabbage\nCarrot peel, Saskatoon or raspberry\n\nSupper:\nCold meat\nFried vegetables\nFruit: Strawberries, raspberries\n\nNot much variation but all good.\nFood cooked over a wood fire.\nPlenty of wild fruit and food for the hunting and gathering.\n\nW.O. Fraser\nDear Sir,\n\nLakota Sioux were very much like the pioneers in Manitoba years ago. Vegetables were a daily part of their diet, more attention was paid to their cultivation than now.\n\nBreakfast: Pancake (pancake) Bacon & Eggs\n\nTea or Coffee\n\nMeat: Beef, Pork (chicken)\n\nPotatoes, Carrots, Cabbage\n\nCarrot Pie, Baskatoon & Rasberry\n\nDinner\n\nCold meat, vegetables, fruit all served\n\nSupper\n\nShort amused conversation but all served\n\nGood cooked over a wood fire for the plenty of united fruit and flour for the hearty appetite.\n\nW.O. Fraser\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1902_99.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4868, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1488, 5], [1488, 2456, 6], [2456, 3559, 7], [3559, 4850, 8], [4850, 6440, 9], [6440, 6440, 10], [6440, 7544, 11], [7544, 7544, 12], [7544, 11440, 13], [11440, 11440, 14], [11440, 12406, 15], [12406, 12406, 16], [12406, 13476, 17], [13476, 14179, 18], [14179, 15389, 19], [15389, 15923, 20], [15923, 16534, 21], [16534, 17069, 22], [17069, 17069, 23], [17069, 17069, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]