[{"id": "2e91b5ae86446944cd662e4a428d628d1a1320fe", "text": "3. SUGAR AND SYRUP\n\nIn what quantity did you buy white sugar? Usually 25 lbs. 6 lbs. 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $0.80\n\nWhat brand of golden corn syrup did you use? Pepsi\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price? $0.50\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought from the station.\n\nDid you make butter? Yes\n\nDid you make cheese? Yes\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Wild game.\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n\nWhen they boiled their fish (which was done the most of the time) on account of no bread, the broth was used in place of tea, and don't think we didn't like it. We enjoyed it. Now it's hard to think of having to eat a boiled fish, much less have to drink the broth instead of tea.\n6. BEVERAGES\n\nWhat kind of tea did you buy? .............. At what price? ..........\n\nWhat kind of coffee did you buy? (beans or ground) .............. Price? .............. What other beverages were used? \n\nwe made our own tea and coffee after we started growing our grain.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store? \n\nIf not, where from? \n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes .............. Cabbage .............. Carrots .............. Onions ..............\n\nTurnips .............. Beets ..............\n\nIn what quantities did you buy white navy beans? \n\nHow did you buy prunes, (in bulk or by the box)? \n\nWhat weight? \n\nHow did the grocer handle prunes (by box)? \n\nWhat was the price of prunes? \n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \n\npeas? .............. corn? .............. beans? .............. Saskatoons? \n\nother foods? \n\nWhat year did you first preserve fruit by canning? \n\nWhat year did you first preserve vegetables by canning? \n\nWhat year did you first preserve meat by canning? \n\nDo you still preserve foods by canning or drying? \n\nTo what extent? \n\nDid you make your own vinegar? \n\nwanted any, it had to be made, fermented fruits and stuff like that all went into the vinegar brine (we called it) later we used a vinegar bean. It wasn't as good neither but sometimes you longed for something with vinegar, it answered the purpose. The pioneer women right now will say \"It also sure good too.\" But then she knew it wasn't as good as what we can buy and pickles made in those days did lack the good vinegar.\n6. Beverages.\n\nWhat kind of tea did you buy? ... [Handwritten text not legible]\n\nWhat kind of coffee did you buy? (beans or grounds)\n\nDid you buy any other beverages?\n\n7. Vegetables and Other Fruits\n\nCan you name some vegetables and fruits which you used in your diet?\n\nWhat was the price of potatoes per bushel when you bought them at the store?\n\nCan you get potatoes at the store?\n\nIf so, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes\n\nCabbages\n\nCarrots\n\nOnions\n\nTurnips\n\nBeets\n\nRadishes\n\nLettuce\n\nIn what quantities did you buy white beans?\n\nHow did you buy groceries (in bulk or by the box)?\n\nWhat weight? [Handwritten text not legible]\n\nTime did the grocer hold his groats (or box)? [Handwritten text not legible]\n\nWhat was the price of groats?\n\nWhat other dried fruits did you use in the earliest days? (apricots, peaches, prunes, raisins, currants, etc.)\n\n8. Preservation\n\nIn what years did you make any preserves by yourself?\n\nOther foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\n9. Miscellaneous\n\nCan you describe how you preserved food?\n\n[Handwritten text not legible]\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD          | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|---------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits |                                               |                                                  |                                   |                     |\n| Macaroni      |                                               |                                                  |                                   |                     |\n| Graham flour  |                                               |                                                  |                                   |                     |\n| Brown sugar   |                                               |                                                  |                                   |                     |\n| Molasses      |                                               |                                                  |                                   |                     |\n| Table salt    |                                               |                                                  |                                   |                     |\n| Common salt   |                                               |                                                  |                                   |                     |\n| Lily white syrup |                                             |                                                  |                                   |                     |\n| Toilet soap   |                                               |                                                  |                                   |                     |\n| Baking powder |                                               |                                                  |                                   |                     |\n| Baking soda   |                                               |                                                  |                                   |                     |\n| Dried peas    |                                               |                                                  |                                   |                     |\n| Dried corn    |                                               |                                                  |                                   |                     |\n| Vinegar       |                                               |                                                  |                                   |                     |\n| Raisins - seeded |                                             |                                                  |                                   |                     |\n| Seedless      |                                               |                                                  |                                   |                     |\n| Rice          |                                               |                                                  |                                   |                     |\n| Currents      |                                               |                                                  |                                   |                     |\n| Store jam - kinds? |                                         |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) |                           |                                                  |                                   |                     |\n| Vanilla       |                                               |                                                  |                                   |                     |\n\nThere were no larger places but we never got that far only once or twice a year. Managed without once there was never any money left for extras.\n\n10. BAKING\n\nWhat type of yeast did you use? Naturally started\nDid you make yeast for your own use? Yes\nUsing starter? Yes\nUsing hops? No\nSalt rising? Naturally\nDid you buy baking powder? No\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\nAlways soda biscuits not by powder\nHow much sugar powder do you use in larger pans?\n\nMark how much you use on the\n\nTable salt\n\nBaking soda\n\nDrained beans\n\nDrink cream\n\nWater\n\nVanilla\n\nChoose (Cheddar) or store cheese\n\nStore jar - Molds\n\nCurrants\n\nHoney\n\nRaisins - seeded\n\nScallions\n\nMilk\n\nButter\n\nEggs\n\nFlour\n\nSugar\n\nSalt\n\nYeast\n\n10. TAKING\n\nWhat types of yeast did you use? Yes\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Usually\n\nSalt rising? Usually\n\nDid you buy baking powder? Yes\n\nDid you make your own baking powder? No\n\nGroup of turkey?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minute tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Nuts                        |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) _________\n\nHow far was this water from your home? _________\n\nHow was it brought to the home? (pail, barrel, tank) _________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nThese parts are not far advanced in water supply. Most of us have wells, but many have no pump. The old bucket is used and wound up with a rope. Still carry it in pails to the house.\n12. WATER SUPPLY\n\nThere did not exist water for drinking and for cooking (rally, river, stream, etc.)\n\nHow far was this water from your house?\n\nFor how long have you been without water?\n\nThese facts are not part of any plans which have been made.\n\nWe are well aware that no supplies will be available quickly and we need to work with a large staff to carry out our plans in time.\n13. SOAP\n\nDid you buy laundry soap or make your own? Made our own.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Soap, detergent.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? This country was all but coal oil lamps, stoves, and wood.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWood is still used in stores but gas lights are used quite extensively the last 10 years or so not much longer. Almost there are no electric lights in our district here, not even self-owned plants. But a few miles away some have their own little power units.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Mostly indoor.\n\nDid you use an outdoor fireplace or back oven? (Give dates)\n\nThere was an outdoor bake oven in the district (later).\n\nBy whom was your first cook stove made? Don't know.\n\nThat year was it purchased? Bought it from the store.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron pots and tin pans.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nEarthenware and wooden bowls.\n\nWhen did you first see enamel ware? These things were\n\nAluminum? General all over before we saw any out here, but they gradually came into the stores, better enamel ware than what we buy now it seems, or maybe we got so far, we took better care of them, we had to make them last longer.\n13. Did you buy laundry soap or make your own?\n\nIf you made your own, did you use powdered or liquid?\n\nWhat brand did you use? (e.g., Ajax, Downy)\n\n14. Fill in the blanks:\n\nThat fuel did you use in the spring? (e.g., wood, coal)\n\nThat fuel did you use in the fall? (e.g., wood, coal)\n\nThat fuel did you use in the winter? (e.g., wood, coal)\n\nWhat was the main reason for using this fuel?\n\nWas there any change in the type of fuel used during the year?\n\n15. For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove used?\n\nThat year when I purchased my first cook stove?\n\nFor preparing food? (e.g., stove, oven, crockery, etc.)\n\nThen did you first use:\n\nAluminum?\n\nIron?\n\nSteel?\n\nGlass?\n\nWood?\n\nOther?\n\nWhen did you first use:\n\nElectric range?\n\nGas range?\n\nCoal range?\n\nWood range?\n\nOther?\n\nInto the stove, butter became more than\n\nwhat we used now. It became, or maybe we\n\ngot so few, we took better care of them, we had.\n\nTo make them last longer.\n16. **SHAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nTo keep dry for hours even since we came here Canada we used to bury it just behind us the store before this. Bulk was the general way of buying we never got anything all fancy packed like now. Some of us bought meat etc came in wooden boxes.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast and supper were the same every day. We had meat, fish or go without. We used what we had. Sometimes we missed our tea. The most we ever had was tea. We had to get along on what tea was to get up on.\n\nWe were mother, (dad died in the flu) 3 boys and two girls. We boys averaged from 28 to 19 — the girls were younger.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nOur times dinners were just another ordinary meal, with whatever extra mother would try to make out of nothing. No one came in so there were no fun and far between.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe never thought of it as starvation, but seem to me we would even call it that today as we got used to it and we were not hard to please as folks now days. (Always wanting a change.) We could eat fish week in and week out, we still love fish. We were different then all God must have made us that way as I don't think the younger generation could come down to live as we did and get along, they would sure think they were being abused, although they are some folks living that away today, and no need for it, their children are half good natured all the time.\n15. Give a typical family scene (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. Tell the grandparents, mother, etc., enter-\n\nBreakfast would be breakfast, dinner and supper would be dinner.\n\n16. What did you serve for your first Christmas dinner in your home? (Give details.)\n\nChristmas dinner was just another ordinary meal, with whatever extras mother could try to make out of nothing. No one ate in as they were no fun and no dinner.\n\n19. Have you ever refused to almost starvation? Give details.\n\nWe never thought we'd starve to death today as we got well. But and we were not hard to please so if it had always been a change we would have made sure that way as I don't think the younger generation would come down to this as we did and get along, they would sure think they were having a hard time, although they are now quite well off.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAs soon as we could afford it, and had a means of getting it in line. We then bought as long as our money lasted. Same as folks do today.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nThe undersigned names were old timers in line.\n\nMr. Leo Dory - McPague Sack.\nMr. Alf Mawby - Wallwort P.O. Sack.\n\nFrom:\nMr. Del Markham\nWallwort P.O.\nSack\n21. As soon as we could afford it and had a means of getting it in the house, we bought an old cow every fall.\n\n22. Please add other details from your early experiences of buying groceries and similar foods in the early days during pioneer days in northern Indiana.\n\nThe undersigned names were old timers in this:\n\nMrs. Leo Dory - M. E. Lodge, Sec'y\n\nMrs. Mrs. Mauzy - Wallwood P.O., Sec'y\n\nFrom,\n\nMrs. Delmarkham\n\nMrs. Wallwood Jack\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_320.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4497, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1101, 5], [1101, 1101, 6], [1101, 2935, 7], [2935, 4244, 8], [4244, 8785, 9], [8785, 9308, 10], [9308, 12960, 11], [12960, 13340, 12], [13340, 14918, 13], [14918, 16000, 14], [16000, 17970, 15], [17970, 18911, 16], [18911, 19803, 17], [19803, 20237, 18], [20237, 20373, 19], [20373, 20527, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]