[{"id": "cec5d670b0299865f07b9d268e50726602421b5f", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TYPICALLY EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to complete a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about it. If there is something that you feel should be included in this form, please let us know.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, but may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sport and recreation\n- Pioneer housing, building and churchwork\n- Pioneer farming experience\n\nInterpretation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Centre,\nUniversity of Saskatchewan,\nCalmatters, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA TEST OF EXTRAVAGANCE TO THE PERSON\n\nIt is difficult to receive a general questionnaire on pioneer life because some of the questions here will not apply to your experiences or others may prove impossible for you to answer so don't worry about leaving blank spaces. If you can't give short or exact answers, just say so. It's not sufficient to state \"not applicable\" or \"not applicable\" in Western Canada before 1914, and may be answered by someone who has personal experience of the pioneer years whether born in this province or not, or describe particular events, if they apply to answer the questions.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 3 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nA letter from Saskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n[ ] All questionnaires\n\n[ ] Pioneer health conditions\n\n[ ] Pioneer social life, sports and recreation\n\n[ ] Pioneer housing and churchwork\n\n[ ] Pioneer education and experience\n\n[ ] Pioneer family experience\n\nEnrollment of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, SASKATCHEWAN,\n\n[Stamp]\n1. Your full name: John Breadner\n\n2. Your address: Yeadale\n\n3. Date: Aug. 9, 1962\n\n4. Where were you born? (Give name of place and country): Brooklyn, P.C., County of Grey, Ont.\n\n5. What was your father's name and occupation?: James Breadner, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): July 1st, 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - Toronto and back to place of birth in 1890.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.): I was in my teens.\n\n9. What were your reasons for coming West?\n\n   - To find work, selling store,\n   - And changeable weather in winter, and to get from market.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?):\n\n    - Reading about it.\n1. Your full name: John Breadner\n\n2. Your address: Yardsall\n\n3. Date: 1962\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nAnd playing pool call.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey did you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nServing\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by train or with a family/friends?\n\n13. What means of transportation did you use? Car.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? On the Early/Other\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nEnduring the flood of 1921 on the Redwater River and again in 1948.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? (by what means of travel?)\n\nReturned to Ontario in winter of 1926 to visit friends.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you are married, give the name of your husband or wife along with the date of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (parents, siblings, etc.) came west:\n\n   - Why did they come?\n   - When did they arrive?\n   - Where did they settle?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n   - Enduring the flood of 1921 on the Assiniboine River and again in 1948.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\n   - Returned to England in winter of 1926 to visit family.\n25. When was the first car used in the community? Jan. 1919\n\n26. If you owned a car before 1912, when did you buy it? That makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what changes in your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n1. Yes, final sight.\n2. Not final sight.\n25. When was the first car used in the community? Jan. 1919\n\n26. If you owned a car before 1917, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc.)\n\n29. How often did you shop in the early days? About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogs? (Indicate also what fraction of purchases were by mail order)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Sandusky? Or did you make up your mind after trying it out? When did you make this decision?\n\n1. 1929 from Cleveland\n\n2. At first sight.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n1. You & number of family members\n2. Family of clothing\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been president of the different clubs, and director of the society at different times.\n\n37. If you or any of your family or friends were part of the first automobile club, mention it here, giving dates wherever possible. (Such as owning the first automobile, organizing the first league, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person responsible for the name; (2) date in which the name was given; (3) date of the place's existence.\n\n1. Oconomowoc town from the whole of Wisconsin on which settlement was based.\n\n2. Glen Owen town from the name of the first people who settled. (County) And the county of Wisconsin named after them as Oconomowoc, as founded by Germans.\n5. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving?\n\n   1. For a change of life.\n   2. Hardly anything.\n\n35. Did many people move away during the 1930s?\n\n36. If you or any member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were forced to leave or do something in the district mention it here (giving dates wherever possible), (such as owning the first automobile, opening an organization, selling timber, etc.).\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.), from to river (1) name and occupation of person selecting place (2) origin and meaning of the name (3) date of its adoption (4) any reason for changing (5) any other facts about the name as above in (1), (2), (3).\n\n1. [Handwritten text not legible]\n\n2. [Handwritten text not legible]\n6.\n\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, old newspapers, old books of community organizations, old pamphlets, old posters, old pictures, old records, old reminiscences? (Describe)\n\nShow a photo of a farm scenery in Ontario until\n\nHe had two regiments 1863-19 Queen Victoria's 1878 (see also)\n\nHalls, Breadner, Owen, 439-220-40-10 (Poveshull)\n\nWilliam, Alden (my daughter's son)\n\nClaim Family (my daughter's son)\n\nGeorge & Emma (my daughter's son)\n\n(1) willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University of Saskatchewan\n\n(Inquire your preference, if any) ..........................\n\nIf you have children or grandchildren, please give their names where they live\n\nand occupations.\n\nSir John A. Macdonald\n\nY Wadda Omatahi\n\n42. What do you think are the most important changes in your community since you\n\nFirst came West?\n\nThe switch from horses to tractors in farming with\n\nmeadows and also the emergence of surrounding suburbs\n\nof the town the farm\n\nJohn Breadner, Virdal, Saskatchewan\n\nPlease give the names and addresses of other persons who could answer this question\n\nIf someone else has filled in this questionnaire for you, please have this person\n\ngive name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old pamphlets, old publications, written reminiscences and oral traditions? (Describe)\n\n40. Have a lot of a farm story in Ontario until\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThis switch from horses to tractors in farming with meadows and also the combination of wintering cattle.\n\nJohn Breadner, Harold, Sarah\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here and address here:\n\n_________________________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_619.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4069, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1770, 5], [1770, 3568, 6], [3568, 4526, 7], [4526, 5224, 8], [5224, 5926, 9], [5926, 6618, 10], [6618, 7328, 11], [7328, 8100, 12], [8100, 9147, 13], [9147, 9963, 14], [9963, 11173, 15], [11173, 12200, 16], [12200, 13648, 17], [13648, 14472, 18], [14472, 14627, 19], [14627, 14778, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]