[{"id": "c8740976935618dde16fa4fc6dfae94fdb33e4e8", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Jacob D. Stratyshuk.\n\n2. Your address: Lumsden, Sask.\n\n3. Date: April 21, 1952\n\n4. Where were you born? (Give name of place and country): Western Ukraine\n\n5. What was your father's name and occupation?: Dmytro Stratyshuk, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Western Ukraine\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\n   12 years old.\n\n9. What were your reasons for coming West?\n\n   My parents came to Canada to seek a better living and brought all the family. Four boys (including me).\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    My uncle Hnat came to Canada in 1896, stayed here 3 years, went back to Ukraine (Old Austria), took his family back to Canada in 1900. We heard about Canada from him and my folks decided to come to Canada.\nJacob D. Stratyshuk\n\n1. Your full name: Jacob D. Stratyshuk\n2. Your address: [Address not visible]\n3. Date: April 3, 1952\n4. Where were you born? Western Ukraine\n5. What was your father's name and occupation? Smylie Stratyshuk, farmer\n6. When did you come to Saskatchewan? May 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   Western Ukraine\n8. How old were you when you first came to Western Canada? (You do not need to answer this question)\n9. What were your reasons for coming West?\n   My parents came to Canada to seek a better living and brought all the family. I was 12 years old.\n\nMy uncle went to Canada in 1896 and played there 3 years. Went back to Ukraine (old country) with his family and came to Canada in 1900. We heard about Canada from him and my folks decided to come to Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nSome of them were anxious to come along too but due to poor circumstances they could not.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nFamily and party of about 50 from our village and neighboring villages.\n\n13. What means of transportation did you use?\nSteamship - Train\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nIn Quebec, were we landed, we were met by very good people. We did not understand their language, but from their actions we knew they were good. In Delisle we stayed in Immigration Hall during Easter Sunday. We received many gifts from local people although there were not very many of them.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nYorkton, in the Immigration Hall which was located one block south of C.P.R. Station.\n\n16. Where did you settle or take up land?\n30 miles north of Yorkton.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nAll my life I lived in Eastern Scotia, in Canada district or in town.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nWas just a school boy.\nSome of them were anxious to come along. They came but due to poor circumstances. They came not.\n\n12. What means of transportation did you use?\n\nSteamship - 2 days\n\n13. What incidents of the journey best do you remember? (People you met, on the way, meetings with Indians, sicknesses or other experiences)\n\nOn October, we landed at were met by very good people. We did not remember their names, but from their actions we knew they were good. In October we were an old friend. During our stay there were many gifts from three people although their names may very many of them.\n\n14. Where did you first stay when you arrived in Saskatchewan?\n\nYorkton in the home of Mr. & Mrs. Smith\n\n15. What was your first job when you arrived in Saskatchewan?\n\nWe worked on a farm in Yorkton\n\n16. What was your occupation or trade?\n\nFarmer\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nNone\n19. How often did you write to relatives or friends in your old home?\n\nBefore 2nd war. I used to write to my cousins in western Ukraine (under Poland) twice a year or three times, but not every 1939.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMary Ochitwa July 15, 1912.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, many people from our village came to Canada as a result of our letters back to the old country.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll came at the same time, and all stayed on the farm until they grew up.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nIn 1907, I and one brother together with two cousins we started in the spring to look for jobs. We walked to Winnipeg and as there was a strike on the Railroads we could not get jobs. As we knew no money other than between us, we used to buy 4 fresh loaves of rye bread for 10¢ and that was all our meal for 24 hrs. We slept by the river bank. After money was down to 50¢ I started home on the old immigrant ticket to Yorkton which was given me by a fellow country man who\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nHas no intention to go to Yorkton. But intended to stay in Winnipeg. I got home to Yorkton safely the next morning, walked 30 miles home, told my dad what happened. Dad sold a calf and sent $10 to my brother in Winnipeg in order to get him home.\n\n(I am writing a book about this particular trip to Winnipeg and back) (as our feet were bleeding from walking the streets of Winnipeg looking for any jobs.)\n19. How often did you write to relatives or friends in your old home?\n\n20. If so, how often? (Please give the name of your husband or wife along with the date and place of marriage.)\n\n21. Did anyone else come to Canada because of your recommendation it as a place to settle?\n\n22. If so, who came and where they settled?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) If so, how far did you go?\n\n---\n\nIn 1907 I and my brother Joseph went to Winnipeg. We traveled by train to stay in Winnipeg for a few days to get tickets. Safely the next morning we walked 30 miles back to find my dad. When he heard I was there he was very happy to see me.\n25. When was the first car used in the community?\n   1912\n\n26. If you owned a car before 1912, when did you buy it? What make?\n   No, bought first car in 1918.\n\n27. Where was your trading center? How far from your home?\n   Yorkton Sd. 30 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We traded there until 1905. When a store was opened on the present site of Canada.\n\n29. How often did you shop in the early days?\n   Twice a year fall & spring\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Mail order Catalogues came into about 1911. First Eaton & then Simpson's\n\n32. When did you first have a telephone and what company provided it?\n   1918 Sask Tel. Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   When we came to Saskatchewan it was with the idea to establish a home here.\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling custom? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in these proportions\n\nfor subsequent years.\n\nMail order catalogues came into\n\nabout 1911. Then I turned\n\nabout 1911. Then I turned\n\nto them.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nWhen we came to Canada we thought it was\n\nwith the idea to establish a house here\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few people left Canora district before 1943 or 1944.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo. Very few left farms in 1930s.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was first chairman of Ukrainian Catholic Brotherhood, local section and from 1932 to 1942, and first Dominion Chairman of the same organization. Director for Local Mutual Benefit Association of St. Nicholas, Brandon, circa 1922.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nSletychnuk family organized School District and named it \"Dnieper\" in memory of Dnieper river, which we lived in the old country.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nDnieper School District as mentioned before Canora. (Town) Being first two letters from Canadian Northern Railway. This name was picked by chief surveyor for the Railway Co. (name is not known to me.)\n5. Did many people move away during the 1920's? Did many return?\n\nVery few people left between 1930's\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"in\" to have or do something in the district mention it here whenever possible. (Such as owning the first automobile, building the first house, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) full reason for change. Give facts of new name as above in (1), (2), (3).\n\nDorothy School District as mentioned before\n\nJansen (born) Berry first two cities\n\nTaken from Canadian Northern Railway.\n\nThis name was given by chief engineer for the Railway Co. It name is not known to me!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. J. Hanchak, Canora Post (Husband a grocer).\nMrs. S. Shottbits, Yorkton Post (Husband insurance agent, and our brother).\nMrs. J. Lysyshyn, Canora Post (Husband National Co-op Board Representative, former Saskatchewan).\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen we came to Canada, people used to like each other and were very friendly. Now it seems that all jealousy is on the way to prevent this friendly spirit.\n\nRoads are playing a big part in the modern living of the farmers.\n\nMachinery are the other items who help farmers to enjoy a better living.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJacob D. Stratyshuk\nCanora Post\n6. Question regarding historical source materials:\nDo you have in your possession or do you know who possesses diaries, old letters, old photos and programs, minute books of communal organizations, old pamphlets, old posters and propaganda, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Circle your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they are living and occupation.\n\nMrs. J. Strachan, Emma Ford (Married & grown)\nMrs. J. Strachan, Gordon Ford (Married & grown)\nMrs. J. Strachan, Donald Ford (Married & grown)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen we came to Canada, people used to like each other and were very friendly. Now it seems that all feeling is in the way to friends. This friendly spirit is disappearing and taking a big part in it. Modern machinery are also other items why huge farmers & anyone a better living.\n\nPlease give the names and addresses of other pioneers who should answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nGive name and address here:\n\nJacob D. Strachan\n\n[Signature]\n\n[Signature]\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNo\n\nWould you or the person who owns them either do not know of any\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. J. Hunchak, Canora, Saskatchewan (husband a grocer).\nMrs. S. Hobbs, Yorkton, Saskatchewan (and old brother).\nMrs. J. Kyslyshyn, Canora, Saskatchewan (husband, farmer, also Board Representative for Women's Cooperative).\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen we came to Canada, people used to like each other and were very friendly. Now it seems that all jealousy is on the way to prevent this friendly spirit.\n\nRoads are playing a big part in the modern living of the farmers.\n\nMachinery are the other items who help farmers to enjoy a better living.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJacob D. Stratyshuk\nCanora, Saskatchewan\n39. Questions regarding historical source materials.\n\nDo you have any personal or family papers, letters, old photos, newspapers, or other materials that you would like to donate to the archives? If so, please provide details about them.\n\n40. If you have children or grandchildren, please give their names, where they live, and any other relevant information.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nWhen we came to Canada, people were very friendly and it seemed that life was easy. However, this gradually changed. Nowadays, everything is very hard. The economy is developing at a rapid pace. Machinery and other items are being used by farmers and everyone is working hard.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nJacob D. Stratyshuk\n\n[Signature]\n\n[Signature]\nJ. D. Stratychuk Retires\n\nJacob D. Stratychuk, \"J.-D.\", a member of the staff of the Canora branch of the Canadian Bank of Commerce for 27 years, retired this month after a total of 35 years of banking.\n\nMr. Stratychuk was born in Western Ukraine in 1891. In 1902 he came to Canada and settled with his father on a farm, seven miles south west of Canora. The nearest post office at that time was Yorkton.\n\nAt the age of 15 he started working as a section man on the railway at 20c an hour for ten hours a day and six days a week. Two years later he took up a homestead north of Buchanan. In the fall of 1910 he broke his arm and being unable to work he attended the Regina Training school especially organized by the government for those not having had the opportunity to learn English. After 14 months he obtained his grade 10 diploma and in 1911 he started teaching school. Mr. Stratychuk taught at Dnister, Poplar Springs, Vasloutz, Mazeppa, and East Wexford. He took grade 11 by correspondence.\n\nIn 1912 Mr. Stratychuk married Mary Ochitwa and they have three daughters; Helen (Mrs. J. Hunchak), Canora; Grace (Mrs. S. T. Shabbits), Yorkton; and Zoria (Mrs. J. Lysyshyn), Canora.\n\nOn October 21, 1916 Mr. Stratychuk joined the staff of the Canadian Bank of Commerce at Canora as a discount clerk. On Feb 1, 1917 he was promoted to teller and in 1921 became assistant accountant. From 1927 to 1931 he was accountant at the Kamsack branch. When the branch closed there he was made special representative of the Bank of Commerce for eastern Saskatchewan and served in this capacity while residing at Kamsack until 1935 when he returned to Canora as accountant, the position he held until his retirement which became effective on Monday, March 5.\n\nMr. Stratychuk has been receiving manager at several points including Norquay, Watson, Wadena, Buchanan and Yorkton. Mr. Stratychuk has been treasurer of the Greek Catholic Parish of St. Peter and St. Paul at Canora since its inception in 1932. He was first Dominion president of the Ukrainian Catholic Brotherhood, a position which he held from 1933 to 1942. He is president of the Ukrainian Catholic Mutual Benefit Association, Canora Branch, and a Saskatchewan director.\n\nMr. Stratychuk plays golf and has been curling since 1912 when he was a member of the \"J. D.\" rink which consisted of J. D. Robertson, skip, John Spandier, J. D. Reese, and J. D. Stratychuk.\n\nMr. and Mrs. Stratychuk intend to live in Canora where they recently built a house. Mr. Stratychuk says it will keep him busy finishing it off and fixing up the grounds—at least for some time. Later on he will probably take some part time jobs. He seems to have no intention of really \"retiring\" and has been considering another full-time job. Anyway to pass the time he has his work shop in the basement and has already been turning out some work since he left the bank.\n\nMr. Stratychuk told The Courier reporter who interviewed him, several stories of experiences he had had during his 35 years in banking, and said that probably one of the biggest thrills he had was when he was threatened with being shot while he was out collecting. He had had no experiences with robberies, and of course had experienced the usual difficulties with balancing.\n\nThe Canora Courier\nMarch 22, 1951\nJ. D. Stratychuk Retires\n\nJacob D. Stratychuk, \"J. D.\", a member of the staff of the Canora branch of the Canadian Bank of Commerce for 27 years, retired this month after a total of 35 years of banking.\n\nMr. Stratychuk was born in Western Ukraine in 1891. In 1902 he came to Canada and settled seven miles south west of Canora. The nearest post office at that time was Yorkton.\n\nAt the age of 15 he started working as a section man on the railway at 20¢ an hour for ten hours a day and six days a week. Two years later he took up a homestead north of Buchanan. In the fall of 1910 he broke his arm and being unable to work he attended the Regina Training School especially organized by the government for those not having had the opportunity to learn English. After 14 months he obtained his grade 10 diploma and in 1911 he started teaching school. Mr. Stratychuk taught at Duster, Poplar Springs, Vassilivtsi, Mazeppa, and East Wexford. He took grade 11 by correspondence.\n\nIn 1912 Mr. Stratychuk married Mary Oktiwa and they have three daughters; Helen (Mrs. J. T. Hanchak), Canora; Grace (Mrs. S. T. Shabbits), over Grace (Mrs. S. T. Shabbits), Canora; and Zoria (Mrs. J. Lysyshyn), Canora.\n\nOn October 21, 1916 Mr. Stratychuk joined the staff of the fall Canadian Bank of Commerce at Canora as a discount clerk. On Feb 1, 1917 he was promoted to Canoral reporter who interview-er and in 1921 became assistant accountant. From 1927 to 1931 he was accountant at the Kamsack branch. When the branch closed there he was made a special representative of the Bank of Commerce for eastern Saskatchewan and served in this capacity while residing at Kamloops. For sack until 1935 when he returned to Canora as accountant, the balancing...\nGIRLS! WOMEN! Do you suffer distress from 'periodic' FEMALE WEAKNESS\n\nAnd also want to build up red blood?\n\nDo female functional periodic disturbances make you suffer pain, feel so nervous, weak, cranky, restless—at such times? Then do try Lydia E. Pinkham's TABLETS to relieve such symptoms!\n\nTaken regularly throughout month—Lydia E. Pinkham's Tablets help build up resistance against such annoying distress.\n\nPinkham's Tablets are also one of the greatest blood-iron tonics you can buy to help build up red blood to give more strength and energy in simple anemia. A pleasant stomachic tonic, too! Just see if you, too, don't remarkably benefit. Any drugstore.\n\nLydia E. Pinkham's TABLETS\nGIRLS! WOMEN! Do you suffer distress from periodic FEMALE WEAKNESS\n\nAnd also want to build up red blood?\n\nDo female functional periodic disturbances make you suffer pain, feel so nervous, weak, cranky, restless—at such times? Then do try Lydia E. Pinkham's TABLETS to relieve such symptoms.\n\nTaken regularly throughout energy in simple anaemia. A pleasant tonic, too; don't resist its benefit. Any druggist will have it.\n\nLydia E. Pinkham's TABLETS", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_665.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6512, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1223, 5], [1223, 2085, 6], [2085, 3425, 7], [3425, 4426, 8], [4426, 6311, 9], [6311, 7132, 10], [7132, 8494, 11], [8494, 9639, 12], [9639, 11257, 13], [11257, 12334, 14], [12334, 13886, 15], [13886, 15370, 16], [15370, 16955, 17], [16955, 17933, 18], [17933, 21232, 19], [21232, 22966, 20], [22966, 23657, 21], [23657, 24105, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]