[{"id": "5e12bfdfb81936dc223f66a52dd7888f4d6d633c", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; others may be impossible to answer. Do not worry about this; simply answer those questions which apply to you.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian pioneers' Questionnaire No. 1, entitled \"Pioneer Life: What Did You Answer This?\" and would be willing to do so, please put a check mark here and one will be sent to you.\n\nWestern Canadian Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did You Answer This?\" and would be willing to do so, please put a check mark here and one will be sent to you.\n\nEnlargement of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent provincial records. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, SASK.\n1. Your full name: Mary Alice Riddell Palmer\n\n2. Your address: Blanworth, Saskatchewan\n\n3. Date: April 7, 1952\n\n4. Where were you born? (Give name of place and country): Ormstown, Quebec\n\n5. What was your father's name and occupation?: Harold L. Stephenson - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): Sept. 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n\n9. What were your reasons for coming West?\n\n   Father's health (Asthma)\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n\n    Father was seeking a place where he could live free of asthma. He came West and spent 6 months in Regina. After he was convinced the climate was good for him we moved West.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThought we were crazy, as they felt there were only wild Indians in the West.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nFamily group on harvest excursion.\n\n13. What means of transportation did you use?\nHorses - buggy.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nCrossed across the track in Northern Ontario, while it was being removed harvesters tied a mower behind the train this kept going clackety clock. I also remember an elderly couple the old lady woke in the night opened a huge bottle took a good drink then woke her husband and offered him one after which she indulged in a second one.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWent direct to father's homestead.\n\n16. Where did you settle or take up land?\n10 miles southwest of Bladworth.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nHome other - excepting my home after marriage on a farm in Bladworth district.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nSchool girl - lived at home on the farm. Helped neighbours occasionally.\n19. How often did you write to relatives or friends in your old home?\n\nRegularly, still write occasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nLewis Palmer - Dec 20th 1909\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes - Mrs. Green\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll came together. Settled at Bladworth.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nFirst prairie fires. They came so fast and swept everything before them.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nPeople visited neighbors at a distance. We went by lumber wagon buggy or democratic, a few by ox team. Had services in our home; student ministers usually served during summer months. Sometimes the small folding organ were carried around by the minister.\n25. When was the first car used in the community? — J. F. Johnston\n   1911 or 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No\n\n27. Where was your trading center? How far from your home?\n   Bladworth. 10 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes! Do still!\n\n29. How often did you shop in the early days?\n   Once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Bought first three ads in Winnipeg Free Press. First Catalogue came from Eaton's Toronto. Our first purchases were white blouses at $1 each. Clothing practically all came through mail order— a large percentage is now bought in city stores, personal shopping.\n\n32. When did you first have a telephone and what company provided it?\n   1914 — Bladworth rural.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes to stay permanently — Before leaving for the West.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes! Few returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband on the Knob Hill school board for 22 years—school built in 1914 served from that date on.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy husband was organizer of school district—the organization meeting was held at home in 1913. First representative on Local Improvement district for our district.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool district Knob Hill received its name from elevation 3 land in district known as Knob Hill. Bladworth named after official of C.M.R. railway. No new names.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, articles, pamphlets, old photographs, etc., which would be of interest to historians and genealogists? (Questionnaire)\n\nWould you or the person who owns them either:\n(1) be willing to lend things to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nModern conveniences — air radio, television, cars etc.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\nMrs. Ag Hill\n\nBladworth Lake\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_786.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2272, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1423, 2], [1423, 2429, 3], [2429, 3774, 4], [3774, 4902, 5], [4902, 6328, 6], [6328, 7749, 7], [7749, 8789, 8], [8789, 8789, 9]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]