[{"id": "a4c4ff9b96c004674b107c9d095b79a13a25bf4d", "text": "S-X2\n599. Stirling Kate Belle (Mrs. Robert)\nS-X2\n599. Stirling Kate Belle (Mrs. Robert)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nA. A brief explanation to the purpose\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in this province will have experienced exactly the same circumstances as another. Some of the questions here will apply only to persons who have lived in the province for more than ten years; others may be applicable to persons who have lived in the province for less than ten years.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Have?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer:\n\n- All Questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\nJULY 7, 1952\n\nI would be glad to fill in this work I think it is interesting my knowledge of data is hard in some cases to state exactly. I understand you have a new edition printed if the information you have acquired and are adding printed type that if there is a charge for them I would like to have them.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES - A GENERAL QUESTIONNAIRE\n\nA NICE OCCASION TO ENHANCE THE PERSONAL HISTORY OF THE FAMILY.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has a story which will fit exactly into the same expression as another. However, there are many things which can be included in such a form. This questionnaire is intended for persons who lived in Western Canada before 1914, and who have personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and who have personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate pages or apply for separate questionnaires.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these may interest you. Please mark the ones you would be willing to answer.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\nI would be glad to fill in this work I think it is interesting my knowledge of dates is hard to state exactly.\n\nIf the information you have acquired and any additional printed before that if there is a charge for them I would like to have them.\n1. Your full name: Mrs. Kate Belle Stirling\n2. Your address: 60 Russell Street\n3. Date: May 29th, 1952\n4. Where were you born? (Give name or place and country): Watertown, Massachusetts, U.S.A.\n5. What was your father's name and occupation?\n6. Then did you come to Saskatchewan? (Give month and year): June, 1899\n\nWe came west in the fall of 1906 to Texas, Mont. where we lived on a ranch near the Bear Paw River.\n\nJune ten years old when I came to Montana.\n\nMy father died when I was eleven years old and living on a mortgaged farm my mother and three young children had no way of support so moved west to an Uncle's place twenty miles out from Harris, Montana.\n\nMy Uncle told me of the possibilities in the rural New England States for nearly all the farms were mortgaged and they didn't appear to be any future. I finished school at thirteen years of age there wasn't the opportunity in those days to go much further in school like working for mile board everyone was in the same financial position.\n1. Your full name: Mrs. Kate Belle Stirling\n2. Year of birth: 1873\n3. Date: May 29th, 1873\n4. Where were you born? (Give name of place and country)\n   - Waltham, Massachusetts, U.S.A.\n5. What was your father's name and occupation?\n   - Henry Ellsworth Stirling\n6. When did you come to Saskatchewan? (Give month and year)\n   - June 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - We came west in the fall of 1906 to Idaho, Mont.\n     when we lived on a ranch near the Bear Paw Range.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n   - I was 16 years old when I came to Canada.\n9. What were your reasons for coming West?\n   - My father died when I was eleven years old\n     and living on a mortgaged farm my mother\n     and three young children had no way of support\n     so moved west to an Uncle's place twenty miles\n     out from Harris, Montana.\n10. How did you learn about the West? (Through other people? Reading about it? Internet or government information?)\n    - My uncle told me of the possibilities in the\n      west that we wouldn't have obtained in the\n      rural New England State. For nearly all the\n      farms were mortgaged and they didn't appear\n      to be any future. So finished school at thirteen\n      Montana passing the eighth grade at twelve you\n      of age then wasn't the opportunity in those days\n      to go so much farther in school like working for\n      our board everyone was in the same financial position\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOur friends and relatives didn't think much of the idea of coming west on account of the Indian massacres they had heard about (whether or not we came).\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nMy uncle had already established himself in the west so I came back east and bought a seat on the same railroad to Maine, Mont., which only contained some half a dozen buildings including a two story hotel and has grown into a very nice city.\n\n13. What means of transportation did you use?\n\nWe had a very nice journey west on the train taking our generous farmer with us. He didn't say anything about the way—just one incident I will have to mention is the fact that we had been seen by a man who said \"there goes a nigger\" who gave me a rather harsh look at such a satirical remark.\n\n14. Where did you first stay when you arrived in Saskatchewan?\n\nMy Uncle and Brother had come to Saskatchewan a frame house where we had a home to come to when we settled on Battle creek about twenty miles from Kansas.\n\n15. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have always lived within four miles where I am at present situated which has been a very pleasant home since I was married which has been over forty years.\n\n16. How long have you lived before coming to Western Canada? How after you came?\n\nOn our New England farm my father made a good living raising the numerous which soon consisted of milking cows and selling butter, raising fruit, wood, a good apple orchard and tobacco raising. But since we came west it has been stock raising mainly there wasn't any raised farming till the farmers settled.\nOur friends and relatives didn't think much of the idea of coming west on account of the Indians massacring the head and about half a dozen before we came.\n\nMy uncle had already established himself in the west as came back east and brought us out to his named.\n\nThe same by railroad to Moore, Grant, which only contained some half a dozen buildings including a two story hotel and has grown into a very nice city.\n\nWe had a very nice journey west on the train taking our generous farmer with me. He didn't accompany Grandma on the way but one accident I will have to mention is the first night of dad ever seen was a negro farmer that passed through the coach and he shouted \"there goes a nigger who gave me a rather sharp look at such a satirical remark.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy Uncle and brother had come to shack and built a frame house where we had a home to come to when we arrived.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have always lived within four miles where I am at present situated which has been a few minutes from since I was married which has been over forty years.\n\n18. Was this your first coming to Western Canada? How did you travel?\n\nOn our New England farm my father made a good living considering the resources which consisted of milking cows and selling butter, raising hogs, a good apple orchard and tobacco raising. It since we came west it has been stock raising mainly there wasn't any raised farming till the farmers settle.\nMy husband's name is Robert Stirling and we moved into a house in Battle Creek, Montana. We came through the Canadian government agencies and many of them are still living on the same farms as when we left.\n\nWhen we came to Montana we took what was called \"settling rights\" for the land we wanted in this southern part of Idaho. We were quite a happy lot and could put up all the hay we needed within five miles of home but still had to practice plenty of economy in this undeveloped country. The stores were mostly towards a living though everything was cheap.\n\nWe would put new fat on our steers and another pair later.\n\nOld habits die hard, we could make do another pair later.\n\nWe didn't travel about very much in the early years. For business, a travelling church, visiting relatives, etc., how often? How far? By what means of travel?\n\nWe would ride on a saddle horse for the mail once a week which was twenty miles to Battle Creek.\n\nThe post office and brought by stage from Maple Creek.\n\nThe world took a team and wagon and during our prosperity from Maple Creek once or twice a year which was a distance of thirty miles. We lived about twenty miles from church, stores and Jurnell with a saddle horse along the way. We didn't want much of anyone's help in which riding the old.\nThe whole family was an average of once a week at first until the homesteaders were away attending to all the ranchers that settled on Battle Creek were Canadian citizens buying the land that they lived about eight miles down the creek until the same we came through the advice of government agencies.\n\nOur family were the only ones that came out and many of them are still living on the same farms as when we left.\n\nWhen we came to Canada we took what was called \"squatter's rights\" in the land warrant issued in the southern part of Saskatchewan. We were granted a happy lot we could put up all the house needed within five miles of some but still had to practice plenty of pioneering in this undeveloped country. The trees were mostly towards a living though everything was cheap.\n\nWe would put new feet in our old things after four or five old shoes in case we could make another pair later.\n\nWe didn't travel about very much in the early years. We would ride on a saddle horse for the mail once a week which was twenty miles to Battle Creek post office and bought by stage from Maple Creek. We would take a team and wagon and bring our groceries from Maple Creek once or twice a year which was a distance of fifty miles. We lived about twenty-five miles from church services and surrounded with a saddle horse along with other folks along the way. We didn't want much of anything else in which making you feel.\nAbout 1912:\n\n25. When was the first car used in the community?\n26. If you owned a car before 1911, when did you buy it? What makes?\n27. What was your trading center? How far from your home?\n28. Were there any changes due to post office system?\n29. How often did you travel there?\n\nWe have always done our trading in Vermul through\nwe plan to defend by the mail order house mostly\nfor our clothes and hardware mostly. We are used altogether.\n\nThe unit to a neighbor house for groceries.\n\nWhen the village of Vermul was established, there were\nSaturday night dances that were as far back as 1915.\n\nEvery since 1899 when we settled in Sack, we have\npurchased quite a portion of our groceries and\nclothes from the mail order house until Vermul\nsupplied our needs to some extent. We need to pur-\nchase our clothes and some groceries from the American\nMail Order House which were quite a little cheaper.\n\nWe used to buy all our clothes through mail order\nand about one third of our groceries.\n\nWe had never heard of any calling hall until recently.\n\nWe came to Saskatchewan to make a permanent\nhome there was everything here with a little\nlabor that anyone should want. There were no\ntaxes when we came for the land wasn't surveyed\nand we range in a bundance. There were no\nfarms and the girls my age did most of the milking.\nAbout 1912.\n\n25. When was the first car used in the community?\n\n26. If you owned a car before 1912, when did you buy it? What makes?\n\n27. What was your trading center? How far from your home? A new rail road was built from of Humorous to Longport. How much was the trading center which was a distance from your home?\n\nWe have always done our trading in Longport through our own. We bought the mail order house monthly for our clothes and hardware. We would go to town regularly.\n\nThe unit to a neighbor's house for groceries.\n\nWhen the village of Humorous was established there was Saturday night dances that was as far back as 1915.\n\nEvery since 1899 when we settled in back, we have purchased quite a few items of our groceries and clothes from the mail order house until we could supply our needs to some extent. We used to purchase our clothes and some groceries from the Cominian mail order house which were quite a little cheaper.\n\nWe used to buy all our clothes through mail order and about one third of our groceries.\n\n32. Then all you first have a telephone and what company provided it?\n\n33. When did you first have electricity?\n\n34. Did you have a washer and dryer?\n\n35. When did you make up your mind to try it out? When did you make this decision?\n\nWe came to Sashakwehun to make a permanent home there was everything nice with a little labor that anyone should want. There were no taxes when we came for the land wasn't assessed and free range in abundance. There were no farms and the girls my age did mostly the milking.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThere were no people moved away from the district before 1914, that was about the time the farmers started to settle the vacant land.\n\n35. Did many people move away during the 1930's? Did many return?\n\nWhen the depression came there was a general uneasiness in the district with dry years and low prices most of the farmers moved away but a few are left that could obtain more land for mining.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband's Uncle Mr. Isaac Stirling was elected a Member in the Provincial Government at Regina and served one term it would be about in the early 20's. I was a secretary of our School District for ten years and my brother was Secretary of adjoining district a few years earlier.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy brother Earl Nash owned the first car in the district which was a Model T touring car. He also started the first post office in the community which he called Nashlyn about 1912. There wasn't much social activity other than country dances.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe railway company has built a branch line from Bonny which passes our place within a mile of where we live and has named a side station after the Nashlyn post office. This is all rolling prairie around us and there isn't many prominent works of nature and their names still remain as original. There is a hill about fifteen miles east of us called Old Man on this Back which was an Indian name given many years ago before we came here. The creeks have retained their original names.\nThere were no people moved away from the district before 1914, that was about the time the farmers started to settle the vacant land.\n\nWhen the depression came there was a general uncertainty in the district with dry years and low prices most of the farmers more or less had a fall off that year that would be hard to forget.\n\nMy husband Uncle Mr. S. said Stirling was elected a member in the Provincial Government at Regina and served one term it would be about in the early 20's. I was a secretary of our school district for some years and my brothers were deputy for another.\n\nMy father Earl Nash owned the first car in the district which was a Model T touring car. He also started the first post office in the community which he called Nashby in about 1915. There wasn't much social activity other than country dances.\n\nThe railway company has built a branch line from Nashby which passes our place within a mile of where we live and has named a siding station after the Nashby post office. This is all rolling prairie around us and there isn't many prominent marks of nature and their names still remain as original. There is a hill about fifteen miles east called Old Man on this road which was an old Indian camp many years ago before we came here. The settlers have named their original names.\nWe are just about the last of the pioneers in our district though others have married might be able to supply some of them. I have no records or diary but these names of those mentioned might be after 1875 and some photographs that might be left.\n\nWould you be willing to lend them to the Provincial Archives for any purpose?\n\n(1) be willing to lend them to the Provincial Archives for any purpose.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan.\n\n(3) be willing to lend them to the Provincial Archives for any purpose.\n\n(4) If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have four children two girls and two boys the oldest girl is married and runs a hotel in Brandon she taught school for ten years, the next girl is a commercial nurse and works for an accountant in Brandon her name is Alma Stirling, the reply by Postcard stating purpose of farming at home and interests, hobbies and personal activities.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nI think the greatest improvement in my community are the means of transportation from the horse and buggy days and also the mechanized farming.\n\nThe early settlers had so many years of manual labor. The means of entertainment are more modern like we have a picture show every Saturday night in the hall at Larned which enthralls the old as well as the young.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMiss Grand Ollamy, Victoria, Saskatchewan\n\nMrs. Frank Wagner, Denman, Saskatchewan\n\nMrs. P. Kennedy, Denman, Saskatchewan\n\nIf someone else has filled in this questionnaire for you, please have this person give race and address here:\n\n(40) continued We have no grandchildren, there are two of our children married up to now.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWe are just about the last of the pioneers in our district though others I have named might be able to supply some of them. I have no records or diaries but these names I have mentioned might be able to. I will send some photographs that might be of interest.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon.......\n\n(Indicate your preference, if any.)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have four children two girls and two boys; the oldest girl is married and runs a hotel in Greenock; she taught school for ten years, the next girl took a commercial course and works for an accountant in Lethbridge; her name is Yelma Stirling; the oldest boy Raymond Stirling is farming at home and Stewart Stirling owns a garage at Athabasca.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nI think the greatest improvement in our community are the means of transportation from the horse and buggy days and also the mechanized farming; the early settlers had so many years of manual labor. The means of entertainment are more modern like we have a picture show every Saturday night in the hall at Boncel which entertains the old as well as young.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Frank Bellamy, Virdora, Sask.\nMrs. Frank Wagner, Senate, Sask.\nMrs. R. Kennedy, Boncel, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n\n__________________________\n\n(40) continued - We have no grandchildren there are two of our children married up to now.\nTo your office—\n\nI have written the words to a new song and want it away to be set to music.\n\nI have sent to have some better copies printed. I am enclosing this sample if you would like to try it out.\n\nI hope the Quotemar will be all right; it's hard sometimes to remember as far back in some cases.\n\nMrs. Slate B. Stirling.\n\nP.S. I will be willing to help with the information you require any time in the future.\nTo your office-\n\nI have written the words to a new song and sent it away to be set to music.\n\nI have sent to have some better copies printed. I am enclosing this sample if you would like to try it out.\n\nI hope the questionnaire will be all right; it is hard sometimes to remember so far back in time.\n\nMrs. Slate B. Stirling.\n\nP.S. I will be willing to help with the information you require any time in the future.\nSOMEDAY WE WILL MEET AGAIN\n\nIntroduction\n\nModerato\n\nSlowly With Feeling\n\nI don't know why you left me Mary, I vow by all the stars above. We laid you 'neath the old oak tree,\n\nWhere we both betrothed our love;-- Each day we wandered in the\n\nCopyright 1952 By Kate Stirling\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_599.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6154, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 44, 3], [44, 88, 4], [88, 2198, 5], [2198, 4057, 6], [4057, 5060, 7], [5060, 6660, 8], [6660, 8424, 9], [8424, 9966, 10], [9966, 11253, 11], [11253, 12669, 12], [12669, 13989, 13], [13989, 15526, 14], [15526, 17825, 15], [17825, 19127, 16], [19127, 21064, 17], [21064, 23280, 18], [23280, 23695, 19], [23695, 24110, 20], [24110, 24383, 21], [24383, 24383, 22], [24383, 24383, 23], [24383, 24383, 24], [24383, 24383, 25], [24383, 24383, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, true, true]}}]