[{"id": "f1bb5f96a42e39714382e56cc8af13ee4f1c4e9f", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer will have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer life\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan, as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: J.F. Paul Borschel\n\n2. Your address: Canora Sask.\n\n3. Date: July 9th, 1956\n\n4. Where were you born? (Give name of place and country): Langenau, Kreiss Corlitz, Province Silesia, Germany.\n\n5. What was your father's name and occupation? Johann Friedrich Borschel, Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year): July 1893\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Lived in no other place\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): I was 18 years old.\n\n9. What were your reasons for coming West? To get the owner of a farm.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): An agent in Fortit, Germany gave me a book published by the Government of Canada on the free lands of Canada in the North West Territories.\n1. Your full name: J.F. Paul, Barschel\n\n2. Your address: Limerick, Sask.\n\n3. Date: July 9th, 1856\n\n4. Where were you born? (Give name of place and country): Langenau, Kingdom of Wurtemberg, Province of Wurtemberg, Germany\n\n5. What was your occupation? Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): July 1893\n\n7. Mention any other places there you lived before coming to Saskatchewan, giving dates, whenever possible:\n\n   - Given in two other places\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, \"I was in my teens\", etc):\n\n   - 18 years old\n\n9. What were your reasons for coming West?\n\n   - To get the owner of a farm\n\n10. How did you learn about the West? (Through other peoples' reading about it?)\n\n    - Railroad or government information? The Agent in British Columbia, Government Agent of Canada Book published by the Government of Canada in the North West Territories\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought we were making a good decision. Others thought we should not go. But the whole village all wished us God's speed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? No, our whole family came out. Father, mother, 4 brothers and sisters. One brother remained in Germany.\n\n13. What means of transportation did you use? We left Bury which was our nearest railway station by train to Hamburg where we boarded our ship the Rickhoven which carried us to Montreal, where we boarded the P.R.R. Calgarian Train which took us to Winnipeg where we boarded the Macdonald Northwestern Railway which took us to Yorkton.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe first and most outstanding incident and also the most exciting of the journey was on board of the ship. We entered the Gulf Stream. Towards evening our officer told us tomorrow we will see the ice bergs. About 10 o'clock in the evening it was very dark. I was sitting on a bench below deck, when an awful crash came, then another and another. There was a fearful quietness. All at once the jarring of the ship's ships together with screams from the people made terrible. The ship had struck an ice berg. Luckily it pulled off. It was however badly badly in and had a while but was able to proceed.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in the immigration shed in Yorkton. The two oldest sisters went to Winnipeg to work. Weymington and Owen. The two oldest brothers and myself went to build a house on the homestead. Father, mother and three young children stayed in Yorkton until we had a house built.\n\n16. Where did you settle or take up land?\n\nTwenty miles north of Yorkton on Sect. 20 Tp. 28 Rg 4 W.4th Mer.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI never worked outside of Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nBefore coming out, I studied on the College, worked on my father's farm and for my oldest brother who was a contractor. After coming out here, I proved up my homestead and worked for my father. The first winter I worked in the bush cutting logs for a saw mill. Later I worked for Ranchers. On survey parties and building roads for the Government. In 1898 I cut 500 telephone poles for the first telephone line built out of Yorkton.\n11. What did your friends and relatives think of your decision to go to Western Canada? How do you feel about it now?\n\n12. Did you travel by train or by boat? If by boat, what was the name of the vessel?\n\n13. What means of transportation did you use? If by train, what was the name of the train?\n\n14. What was the weather like during your journey?\n\n15. What were the main attractions along the way?\n\n16. What were the most memorable experiences during your journey?\n\n17. What were the challenges you faced during your journey?\n\n18. How did you earn a living before coming to Western Canada? How do you feel about it now?\n\n19. Before coming to Western Canada, who was a close friend or relative?\n\n20. How did you feel about the journey overall?\n19. How often did you write to relatives or friends in your old home?\nVery often\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nAmong (see Stubel) Civil marriage\n21st March, Church marriage 31st March in Halli, Schale, Germany\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes quite a number, but many went back again. Those who stayed are now settled all over Canada.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nBrother-in-Law\nMrs. Francis with wife and one son came out in 1909 and settled in Canora. Where is she now? Family are living yet.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nWhen we came to Yorkton after such a long journey over land and sea, Yorkton was the end station of the Manitoba North Western Railway Company consisting of two stores, a hotel, a livery barns, a post office and some dwellings stuck up in the prairie. It was one of those nice summer days the whole prairie was full of flowers, the whole village was at the station to greet us amongst them were two members of the Canadian North West Mounted Police force, of whom I had read before and who were considered as the finest police force in the world. This made us feel that we were wanted here and would be able to make a home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nThe first eight years I came to Canada I did not much travelling. We went to Yorkton perhaps once in a month to buy provisions etc. Yorkton was 20 miles. The first year we made the trips with oxen. Later we had horses. Going to church, which was held in the neighborhood. There were many people in the country and those in the country were mostly single young men. The Ministers there always held church where a family was blessed with young ladies of marriageable age.\n19. How often did you write to relatives or friends in your old home?\n\nVery often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many came?\n\nYes, we came to Saskatchewan because of our recommendation. We came in 1909 and settled in Canada. We had a son and family are living yet.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWhen we came to Canada, we had a son and family are living yet.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to report?\n\nThe first eight years was very hard and we had horses. The first year we needed two trips with our horses across 10 miles. Going to church, which was held in the schoolhouse, was very hard. People in the community used to bring their horses to church. We were mostly single young men and women in the community who helped each other before a farm was blessed with young families of marriages age.\nIn this way, the minister was sure of a good attendance. The people came on foot, on horseback, with wagons and buggies. One time I was to church, when a sleek team of Black Oxen came along pulling a wagon with 4 young men and a lady along.\n\nWhen we had a picnic, people came from all over the country sometimes from a distance of twenty miles.\n\nThe most travelling I did was when I worked on the Land Survey. In 1897, I worked for Mr. Duberger L.S.P. and later until 1900 I worked for Mr. J.D. Belanger L.S.P. Mr. Duberger was instructed by the Dominion Government to survey the line between Range three and four north until he strikes the Saskatchewan River. Mr. Belanger surveyed the Second Meridian and Base Line north of No. 40.\n\nWe used wagons when we could, in the bushy country we used pack horses. In swamps where we could use no horses at all, we had to pack it all on our own backs, and in winter we had each man a sleigh. When we started out these sleighs were loaded quite heavy as it was figured that each man had to load enough provision to last him till spring for pulling the instruments etc. We had a sled with 4 dogs. The dogs however were not much help if the party is out all winter as a dog will pull no more than he needs for food for himself in four months.\nIn this the minister was sure of a good attendance.\n\nThe people came on foot or horseback, with wagons and mules. One time I was to church, when we slept two men of Black River coming along pulling a wagon with 4 yams man and a lady along.\n\nWhen we had a big picnic people came from all over the country sometimes from a distance of twenty miles.\n\nWe went travelling I did not work when I worked on the land survey. In 1897 I worked for Mr. Belanger & Co., and later until 1900 I worked for Mr. F. Belanger & Co. Mr. Belanger was interested in the Dominion Government for surveying the line between Range three and four north until he struck the second Missouri River. Mr. Belanger came to the Second Missouri and Base Line north to 40.\n\nWe used wagons where we could, in the bushy country we used pack horses, but whenever we could use no horses at all. We had to pack it all on our own backs, and whatever we hid back meant a slough. When we started out there always seemed quite heavy as it was figured that each horse had to load enough provision to last him till spring for pulling the instruments etc. We had a sled with 4 dogs. The dogs however were not much help if the pack is not all. Winter as they will pull no more than he needs for food for himself in four months.\nIn this way the minister was sure of a good attendance. The people came on foot, on horseback, with wagons and buggies. One time I was to church, when a sleek team of Black Oxen came along pulling a wagon with young man and a lady along.\n\nWhen we had a picnic, people came from all over the country sometimes from a distance of twenty miles.\n\nThe most travelling I did was when I worked on the Land Survey. In 1897, I worked for Mr. Duberg T.L.S. and later until 1900 I worked for Mr. J.A. Belanger T.L.S. Mr. Duberg was instructed by the Dominion Government to survey the line between Range three and four north until he strikes the Saskatchewan River. Mr. Belanger surveyed the Second Meridian and Base line north No. 40.\n\nWe used wagons when we could, in the bushy country we used pack horses. In swamps where we could use no horses at all. We had to pack it all on our own backs, and minister we had each man a sleigh. When we started out these sleighs were loaded quite heavy as it was figured that each man had to load enough provision to last him till spring. For pulling the instruments etc., we had a sled with 4 dogs. The dogs however were not much help if the party is out all winter as dog will pull no more than he needs for food for himself in four months.\nIn this way, the minister was sure of a good attendance.\n\nThe people came on foot or horseback, with wagons and buggies. One time I was to church, when the sleigh team of Black Oxen came along pulling a wagon with 4 young men and a lady along.\n\nWhen we had a picnic, people came from all over the country sometimes from a distance of twenty miles.\n\nThe worst travelling I did was when I worked on the Grand Survey. In 1897, I worked for Mr. Belanger & Co., and later until 1900 I worked for Mr. J. D. Belanger & Co., who Belanger may have been.\n\nBy the Dominion Government to survey the line between Range three and four, north until the thirty-first parallel.\n\nThe second Abominian and Base Village near the 40th parallel.\n\nWe used wagons where we could, in the bushy country, we used pack horses, two wagons when we could use no horses at all. We had to pack it all our own backs, and when we had to pack it, we had quite heavy as times figured that each of our sleds had to load enough provisions to last him till spring.\n\nFor pulling the instruments yet, we had a sled with 4 dogs. The dogs however were not much help if the snow is out all winter and will pull no more than he needs for food for himself in four months.\n25. When was the first car used in the community? In 1911.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I did not own any until 1915, a Chevrolet.\n\n27. Where was your trading center? How far from your home? From 1893 to 1905 Yorkton 20 miles from home, after 1905 Cawra I lived right in Cawra.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Cawra came into being in 1904, it was closer.\n\n29. How often did you shop in the early days? About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   I had a Route on the farm Peter Wilson, he went with his wife to town regularly every Saturday to sell butter, eggs, etc.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   In 1895, Garden Seeds, Harness, Small Machinery, about 10%. Yes later we bought about 20%.\n\n32. When did you first have a telephone and what company provided it? 1908 The Government Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We were 6 boys each wanted to get some land. Here we were offered 160 acres. We had our mind made up to stay here before we left Germany.\n25. When was the first car used in the community? In 1911.\n\n26. If you owned a car before 1914, when did you buy it? Your name?\n\n27. Where was your trading center? How far from your home? From 1893 to 1915 Yorkton 20 miles from home. After 1915 Sarnia.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? About every month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? I had a little store there. We would go to town every Saturday to sell butter, eggs, etc.\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion.\n\n32. When did you first have a telephone and what company?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe were 6 boys each wanted to get some land. We were offered 160 acres. We had our minds made up to stay here before we left Germany.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nIn the hard years from 1873 to 1896 all the families who had come out prior to 95 went back to Germany because they did not think they could make a living here.\n\nThere was a whole German settlement west where Tolietz is situated. They left and settled near Humboldt. They wanted to be with their own people.\n\n35. Did many people move away during the 1930's? Did many return?\n\nIn the years from 1898 to 1915 many Americans settled in the Canora District. They brought power machinery and big outfits for farming with them and farmed in a bigger scale. In the 30's all these farmers sold out and went back to the U.S.A. Many young Canadians went away in those years also, but returned.\n\nAt present I am Hon. President and Five Member of the Canora Agricultural Society.\n\nLife Member of the Canora and District Chamber of Commerce and Hon. Member of the Ukrainian Power Society.\n\nMr. R.W. Cummings, James Charters, Harry Bausman, my brothers Herman, Ernest and myself organized the Canora Agricultural Society. Mr. Cummings was the first President and I was the first Secretary. My brother Ernest built the first Livery Barn in Canora.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMrs. Wilson Allan was the first store keeper. He named the Town Canora after the first Canadian Northern Railway Co.-Catto-Ra.\n\nTolietz 1/2 south of Canora is named after the town we came from in Germany. Mikado received its name from the Railway Officials. The Russian-Japanese war was just on at that time, the Station Amsterdam was named by a Hollander who had a farm close by. Petlock P.O. was named by J. Boivin who settled there in 1890, 7 miles south of Canora today it is called Berrios.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nIn the hard years from 1893 to 1896 all the families who had come out prior to '95 went back to Germany because they did not think they could make a living here.\n\nThere was a whole German Settlement to east where Gority is situated they left and settled near Humboldt. They wanted to be with their own people.\n\n35. Did many people move away during the 1930's? Did many return?\n\nIn the years from 1898 to 1915 many Americans settled in the Canora District. They brought power machinery and big outfits for farming with them and farmed in a bigger scale. In the 30's all these farmers sold out and went home to the U.S.A. Many young Canadians went away in these years also, but returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Brother was Post Master in Gority from 1903 to 1915 and later Postmaster from Canora from 1907 to 1914. I was appointed J.P. in 1902 and held this Office till 1948. Was Sub-Dominion Land Agent in Canora from 1905 to 1910. Was Councilor from 1907 to 1910, School Trustee from 1911 to 1926. Mayor of the Town of Canora from 1928 to 1932. Trustee of the Canora School Board from 1932 to 1940. I was elected Wheat Pool Delegate for Sub-District 5 District 8 from 1940 to 1941.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMr. R.W. Cummings, James Charters, Harry Bausman, my brothers Herman Ernst and myself organized the Canora Agricultural Society. Mr. Cummings was the first President and I was the first Secretary.\n\nMy Brother Ernst build the first Poveshell Barn in Canora.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMr. Wilson Allan was the first store keeper. He named the Town Canora after the first Canadian Northern Railway Co.-Rt No. Ra. Gority 1/2 south of Canora is named after the town we came from in Germany. Mikado received its name from the Railway Officials. The Russian Japanese war was just on at that time. The Station Anderdon was named by a Hollander who had a farm close by. Setlock P.O. was named by 4 Brothers who settled there in 1870, 7 miles south of Canora today it's called Burges.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of communities or organizations, old pamphlets, old photographs written reminiscences? (Describe)\n\nI have photos, letters and papers from the early days of the Greater History.\n\nWhen we came out here in #1893 my father wrote articles in The New Californian newspaper about our trip from Germany out here and also about the country's early history. I have all the copies but not the newspaper itself.\n\nCould you, or the person who owns them, lend them to the Provincial Archivist for everything?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina; or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon Otto Herman Erich Barschel, married to Irene Pauline, Spokane, Washington\nVisor of Electrical Installations and employment of the plant in the MacDonald Aircraft Company in Winnipeg, Manitoba\nGrand Daughter Betty Ann married to James Knickmouster, at present employed at the General Hospital in Winnipeg, Manitoba\nGrand Son Robert Paul\nGreat Grand Daughter Helen Ann Knickmouster\nSon Paul Otto Joseph, married to Irma Phillippe, Winnipeg, Manitoba\nGrand Daughter Anne\nFriedrich Wilhelm Son, bookkeeper, married to Marjorie Stange\nSheriff Son Ernest, married to Jane\nGrand Daughter Anna\nJohn Willard, Son, married to Sophie Kushner, Sales Manager for Sherwood Park Grace Ltd., Ford Monarch Dealers, Edmonton, Alberta\nJohannes Ernst Son, married to Alice Johnson, Parts Manager for Sherwood Park Grace Ltd., Ford Monarch Dealers, Edmonton, Alberta\nGrand Daughter Eva\nGrand Daughter Anna\nGrand Son William\nGreat Grand Daughter Theresa\nArvin Hermann, Son, married to Gladys, Manager of Lighter Fluid and Machine Parts, Montreal, Quebec\nPaul Richard, Son, married to Pauline Shiskin, Teacher in the Regina, College\n\n41. The pioneer farmer lived happily in his log shanty without the help of the government school. It is still on the farm, perhaps now used by the new schoolhouse. It is still standing in the same place as when he was living there. He has never been able to pay the rent, though he has always paid his taxes.\n39. Questions regarding historical source materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, newspapers (photographs), written recollections and reminiscences? (Describe).\n\nI have photographs and copies from the early days of the [town/village].\n\nWhen we came out here in [year], my father wrote to [describe his arrival and experiences].\n\n(1) Are willing to lend them to the Provincial Archivist for copying.\n\n(2) Willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon - Otto Herman Erich Bernholz, married to Edith, supervisor of electrical installations and employment of the plant in the Macbollard Aircraft factory in Winnipeg.\n\nGrand Daughter Betty Ann married to James Dinklhofer at [date].\n\nGreat Grand Daughter Nancy Ann Enloehofer.\n\nSon Paul Ottio, mechanic, married to Emma Phillip, Winnipeg, Man.\n\nGrand Daughter Lynn.\n\nGrand Daughter Lynn.\n\nGrand Daughter Lynn.\n\nGrand Daughter Lynn.\n\nGrand Daughter Lynn.\n\nJohn Milford, son, married to Sophie Kusner, sales manager for Sherwood Hardware Ltd., Ford Lumber Dealers, Edmonton, Alberta.\n\nJohannes Kusner, son, married to Alice Johnson, parts manager for [company name].\n\nPaul Richard, son, married to Gladys, manufacturer of [product name].\n\nPaul Richard, son, married to Pauline Shihak, teacher in the [school name].\n\n41. The pioneer farmer lived happily in his log cabin on the farm he bought for $150. Later he had a house built on the same land. His children went to the country school, but still attended the school on the farm when the school was closed.\n\nTo pay the rent the family had to sell the cow. They needed money to buy food for the winter. They had to move into town because the house in town was much nicer than the one on the farm.\n\nThe family moved into town and bought a new house. They were happy living in town because they could go to the movies and have more fun.\n41. What do you think are the most important changes in your community since you first came West?\n\nQuestion 41.\n\n1) The dwelling of a log shanty with sod roof on the farm where Mother the lady of the farm did the washing with the washboard, by the coal oil lamp, and cooked with the comfortable fitted out with modern fixtures. One day where the lady of the farm only puts in the switch to have electricity provide her with power for most all of her work while she can take it easy.\n\n2) The change from the ox and the horse to the use of the tractor and the auto. In pioneer days wanted to go to town or church when the family in pioneer days wanted to go to town or church a team of oxen later a team of horses were hitched to the wagon but sure today the family acts fast but often having a team of horses hitched to the road. It was slow going and happily they went singing on their way.\n\n3) In pioneer days a boy went to see his best girl on foot or on horseback when time to go home his girl accompanied him generally as far as the gate and here the last secret were exchanged between you and me and the gate post and if he wanted to take her to church or to a picnic he borrowed a buggy.\n\nTo-day the boy takes his best girl off in a comfortable auto. In pioneer days ladies thought below their dignity to smoke. In fact a boy visiting his fiancee would not light his pipe before to-day women smoke as much as men.\n\n4) The pioneer farmer lived happily in his log shanty without roof, plaster he had a house with chinglet roof. His children were to the country school. To-day the same house is still on the farm, perhaps mouldered, but the county schoolhouse is still standing in the district to-day the farmer only couples the house when he is grading but which he gets by living in town while children go to more efficient town school he worries not farms from the town by going in and out with his own and such things as horses does right no more he does all his work with power machinery.\n41. What do you think are the most important changes in your community since first came Meet?\n\nQuestion 41.\n\n1) The dwelling of a log shanty with sod roof on the farm where by the coal oil lamp was replaced with the washing with the washboard, with modern electric light and comfort of the day where the Lady of the farm only puts in the switch to have electricity provide her with power for most all of her work while she can take it easy.\n\n2) The change from the ox and the horse to the use of the tractor and the auto.\n\nWhen the family in pioneer days wanted to go to town or church a team of oxen later a team of horses were hitched to the wagon and happily they trotted along the road but sure not fast but often.\n\n3) In pioneer days a boy went to see his best girl on foot or on horseback when time permitted go to town or church. You and me and the gate post and if he wanted to take her to church or to a picnic he borrowed a buggy.\n\nIn pioneer days ladies thought low their dignity to smoke in feet a boy visiting his favorite would not light his pipe before first receiving her permission to do so.\n\nTo dress women moved so much as man.\n\n4) The pioneer farmer lived happily in his log shanty without roof, after he had a house with chinglet roof. His children went to the country school. To get the best house is still on the farm perhaps modified until the new schoolhouse in the district to be a grandpa's house. The farmer only couples the house when he is comfortable borrowing and threshing his own corn run to the more efficient town school he works his farms on the town by going in and out with his own and enough horses does it all. No more he does all his work with his own power machinery.\nPlease give the names and addresses of other pioneers who could answer these questions.\n\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Mr. Harry Slavov.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nGive name and address here:\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Harry Ellerbe\nGardena, Calif.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nArchiv Provin\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our heritage. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of examination to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the question. Don't hesitate to give details or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatoon\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ... J.E. Paul, Joseph\n\n2. Your address ... 10225 36th Street\n\n3. Date ... July 15, 1933\n\n4. Where were you born? (Give name of place and country).\n   Langenau, Kreis Neumarkt, Gorlitz, Province of Silesia, Germany.\n\n5. What was your father's name and occupation?\n   Johann P. Paul, farmer\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   July, 1893\n\n7. Mention any other places where you lived before coming to Saskatchewan,\n   giving dates wherever possible.\n   Lived in no other place.\n\n8. How old were you when you first came to Western Canada? (You do not need\n   to answer this question if you would rather not or you may use \"I was a\n   small child,\" \"I was in my teens,\" etc).\n   I was 13 years old.\n\n9. What were your reasons for coming West?\n   To become the owner of a farm.\n\n10. How did you learn about the West? (Through other people? Reading about it?\n    Railroad or government information?).\n    An agent in Gorlitz, Germany gave us a book published by the Government\n    of Canada, on the Prairies Lands of Canada. In the North West Territories.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure how to spell or write a word, please ask someone else.\n\n1. Your full name: [Name]\n\n2. Your address: [Address]\n\n3. Date: [Date]\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\nTo become the owner of a farm.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nAn agent in Germany gave us a booklet published by the Government of Canada, on the Free Lands of Canada in the North West Territories.\n11. What did your friends and relatives think of your decision to come to Western Canada? Some thought we were making a bold decision. Others thought we should not go, but on the whole the village all wished us God's speed.\n\nOne brother remained in Germany.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? No, our little family came out, father, mother, 4 brothers and 3 sisters.\n\n13. What means of transportation did you use? We left Tendel, which was our nearest railway station, by train to Hamburg where we boarded our ship, the Pictoumers, which carried us to Montreal. From there we boarded a C.P.R. Colonist train which took us to Winnipeg where we boarded the Manitoba Northern terminus railway, which took us to Yorkton.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) The first and most outstanding incident and also the most exciting of the journey was on board of the ship. We entered the Gulf Stream. Towards evening our officer told us tomorrow we will see the Ice bergs. About 10 o'clock in the evening it was very dark. I was sitting on a bench outside deck when an awful crash came, then another and another. There was a fearful quietness. All fell silent, then came the sound of the ship together with screams from the people. It was terrible. The Ship had struck an ice berg, but luckily it pulled off. It was, however, badly damaged and had a hole, but was able to proceed.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in the Immigration Shed in Yorkton. The two oldest sisters went to Winnipeg to work. We bought a wagon and oxen. The two oldest brothers and myself went to build a house on the homestead. Father, Mother and the three youngest children stayed in Yorkton until we had a house built.\n\nTwenty miles north of Yorkton on Section 30 Tp. 29, Rg. 4, W.2nd No.\n\n16. Mention any other places where you have lived since coming to Saskatchewan. I never lived outside of Saskatchewan.\n\n17. How did you earn a living before coming to Western Canada? How, after you came?\n\nBefore coming out I studied on the College, worked on my father's farm and for my oldest brother who was a contractor. After coming out here I worked in the bush cutting logs for a saw mill. Later I worked for lumber companies and building roads for the Government. In 1899 I got 500 telephone poles for the first telephone line built out of Yorkton.\n11. What did your friends and relatives think of your decision to go to Western Canada? Some thought we were making a bad decision; others thought we should not go, but on the whole the village all wished us God's speed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Yes, our whole family came out, father, mother, 4 brothers and 3 sisters.\n\nOne brother remained in Germany.\n\n13. What means of transportation did you use? We left Temes, which was our nearest railway station, by train to Winnipeg where we boarded a C.P.R. Colonist train which took us to Manitoba where we boarded the Manitoba North-Western Railway, which took us to Yorkton.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) The first and most outstanding incident and also the most exciting of the journey was on board the steamer. Toward evening our officer told us tomorrow we will see the ice bergs. About 10 o'clock in the evening it was very dark. I was sitting on a bench below deck, when an awful crash came, then another and another. There was a fearful uproar. All at once, the plump of the ship together with a fearful sound from the people were terrible. The ship had struck an ice berg, luckily it pulled off. It was, however, badly banged in another hole, but was able to proceed.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in the Immigration Shed in Yorkton. The two oldest sisters went to Winnipeg to work. We bought a wagon and oxen. The two oldest brothers and myself went to build a house on the homestead. Father, Mother and the three youngest children stayed in Yorkton until we had a house built.\n\n16. Where did you settle or take up land? Twenty miles north of Yorkton on Section 30 Tp. 28, Rg. 4 W. 2nd W.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I never lived outside of Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you before coming out I studied on the College, worked on my father's farm and for my eldest brother who was a contractor. After coming out I served up by honest brother and worked for my father. The first winter I served as the bush cutting logs for a saw mill. Later I worked for survey parties and building roads for the Government. In 1938 I got 500 telephone poles for the first telephone line built out of Yorkton.\n19. How often did you write to relatives or friends in your old home?\nVery often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nAnna (nee Strobel), Civil marriage, 21st March, Church marriage, 31st March in Halle a/Saale, Germany.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nYes, quite a number but many went back again. Those who stayed are now settled all over Canada.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nWm. Grams, brother-in-law, with wife and one son came out in 1909 and settled in Canora where his son Egon and family are living yet.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nWhen we came to Yorkton after such a long journey over land and sea Yorkton was the end Station of the Manitoba North Western Railway Camp, consisting of two stores, one hotel, 2 livery barns, a Post Office and some dwellings stuck up in the prairie. It was one of those nice summer days, the whole prairie was full of flowers. The whole village was at the station to greet us, amongst those were two members of the Canadian North West Mounted Police force of whom I had read before and who were considered the finest Police force in the world. This made us feel that we were wanted here and will be able to make a home.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nThe first eight years I came to Canada I did not do much travelling. We went to Yorkton perhaps once a month to buy provisions. Yorkton was 20 miles. The first year we made the trips with oxen. Later we had horses. Going to church, which was held in the neighborhood. There were not many people in the country and those in the country were mostly single young men. The ministers therefore always held church where a family was blessed with young ladies of marriageable age. In this way the minister was sure of a good attendance. The people came on foot, on horseback, with wagons and buggies. One time I was to church when a sleek team of black oxen came along pulling a wagon with 4 young men and a lady along. When we had a picnic people came from all over the country, sometimes from distance of twenty miles.\n\nAs most travelling I did was when I worked on the Land Survey. In 1897 I worked for Mr. Duberger, D.L.T., and later until 1900 I worked for Mr. J.A. Belanger, D.L.T. Mr. Duberger was instructed by the Dominion Government to survey the line between range three and four north until he reached the\n19. How often did you write to relatives or friends in your old home?\n   Very often.\n\n20. If you got married, give the name of your husband or wife along with the\n    date and place of marriage.\n    Anna (nee Strebel), civil marriage, 21st March, church marriage, 31st\n    March in Hall, 9th June, Germany.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so,\n    please do switch.\n    Yes, quite a number but many went back again. Those who stayed are now\n    settled all over Canada.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tall when they came and where they settled.\n    Mr. Grimes, brother-in-law with wife and one son came out in 1879 and\n    settled in Canada where his son Egou and family are living yet.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    When we came to Yorkton after such a long journey over land and sea Yorkton\n    was the last station of the Manitoba North Western Railway Corp., consisting\n    of two stories one hotel, 21 very hands, a post office and some dwelling\n    stick up in the prairie. It was one of those nice summer days, the viola\n    pride was full of flowers. The whole village was at the station to greet\n    forces of whom I had read before and who were considered the finest Pollie\n    forces in the world. They made us feel that we were very well have and will\n    be able to make a home.\n\n24. Did you travel about much in the early years? (For business, attending\n    church, visiting friends, etc.) How often? How far? By what means of\n    travel?\n    The first flight we've I came to Canada I did not do much travelling. We\n    went to Yorkton once in a month to buy provisions. Yorkton was\n    211 km. The first year we made the trip with Orono. Later we had horses.\n    Going to church was a field in the neighborhood. There were not many\n    people in the country and those in the country were mostly single young\n    women. The ministers therefore always held church where a family was blessed\n    with young ladies or marriages. In this way the ministers were sure\n    of a good attendance. The people came on foot, on horseback, with wagons\n    and sometimes even by sleigh. To church when a sleigh team of black oxen came\n    from the east side of town.\nSaskatchewan River. Mr. Belanger ran the Second Meridian and Base Line north of Tp.40. We used wagons where we could, in the bushy country we used pack horses. In swamps where we could use no horses at all we had to pack it all on our own backs and in winter we had each man a sleigh. When we started out these sleighs were loaded quite heavy as it was figured that each man had to load enough provision to last him till spring. For pulling the instruments etc., we had a sled with 4 dogs. The dogs, however, were not much help if the party is out all winter as a dog will pull no more than he needs for food for himself in four months.\nSaskatchewan River. Mr. Belanger ran the Second Meridian and base line north of Tp.40. We used wagons where we could, in the bushy country we used pack horses. In swamps where we could use no horses at all we had to pack it all on our own backs and in winter we had each man a sleigh. When we started out these sleighs were loaded quite heavy as it was figured that each man had to load enough provision to last him till spring. For pulling the instruments etc., we had a sled with 4 dogs. The dogs, however, were not much help if the party is out all winter as a dog will pull no more than he needs for food for himself in four months.\n25. When was the first car used in the community?\n   In 1911.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I did not own any until 1915, a Chevrolet.\n\n27. Where was your trading center? How far from your home?\n   1905, Yorkton 20 miles from home. After 1905 Canora. I lived right in Canora.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Canora came in to being in 1900. It was closer.\n\n29. How often did you shop in the early days?\n   About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   I had a kettler on the farm, Peter Weilson. He went with his wife to town regularly every Saturday to sell butter, eggs, etc.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1898, garden seeds, farmers, small machinery, about 10%. Yes, later we bought about 20%.\n\n32. When did you first have a telephone and what company provided it?\n   1904. The Saskatchewan Government Telephone Company.\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n   We were 6 boys, each wanted to get some land. Here we were offered 160 acres. We had our mind made up to stay here before we left Germany.\n25. When was the first car used in the community?\n   In 1911\n\n26. If you owned a car before 1911, when did you buy it? What make?\n   I did not own any until 1915; a Chevrolet.\n\n27. Where was your trading center? How far from your home?\n   1905, Yorkton 20 miles from home. After 1905 Canora. I lived right in Canora.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns)\n   Yes, we continued to trade there. We had our store in Canora, close to being in 1904. It was closer.\n\n29. How often did you shop in the early days?\n   About once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   I had a letter on the farm, Peter Heilman. He went with his wife to town regularly every Saturday to sell butter, eggs, etc.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nIn 1899, garden seeds, farmers, small machines, about 10%. Two years later we bought about 20%.\n\n32. When did you first have a telephone and what company provided it?\n   1901. The Saskatchewan Government Telephone Company.\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came here because we wanted to get some land. Here we were offered 160 acres. We had our mind made up to stay here but Dora said \"Let's go.\"\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nIn the hard years from 1903 to 1906 all the families who had come out prior to 1903 went back to Germany because they did not think they could make a living here.\n\nThere was a whole German settlement to the east where Gorilla is situated. They left and settled near himself. They wanted to be with their own people.\n\n35. Did many people move away during the 1920s? Did many return?\n\nIn the years from 1909 to 1915 many Americans settled in Omora District. They brought power machinery and big outfits for farming with them and formed in a bigger scale. In the following all the farmers sold out and went home to the U.S.A. Many young Canadians went away in those years also. Some returned.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy brother Herman was Post Master in Gorilla from 1903 to 1905, and J.P. and Javer Postmaster from Omora from 1907 to 1914. He was appointed J.P. in 1902 and held this office until 1914. He was also Justice of the Peace in Omora from 1911 to 1914. He was Councilor on town council from 1928 to 1932. Trustee of the Omora School Board from 1928 to 1929. I was elected Wheat Pool Delegate for sub district 5 from 1929 to 1932. At present I am Town President and Life Member of the Omora and District Chamber of Commerce.\n\nLife member of the Omora and District Chamber of Commerce.\n\n37. If you or any of your family or friends were willing to have or do something in the district mention it here, giving dates wherever possible, (such as owning the first automobile, building, organizing the first lodge, etc.).\n\nMr. H. Omand was Town Clerk, Harry Shumway, my brother Herman Ernest and myself organized the Omora Agricultural Society. Mr. Omand was the first president and I was the first Secretary. My brother Ernest built the first library barn in Omora.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railroads, lakes, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (date and reason for change). Give facts of Mr. Williamson Allen was the first store keeper. He named the town Omora after the Omora Northern Railway Co. - Omora, Colville, 12 miles south of Omora. As named after the town, we came from Idaho. Mr. W. was residing there at that time. The railway official, Anderson, who had a farm store by Fellock P.O., was met by 4 brothers who settled there in 1899, 7 miles north of Omora, today it is called Argyle.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\nIn the last years from 1925 to 1926 all the families who had come over prior to 1923 went back to Germany because they did not think they could make a living here.\n\nThere was a whole German settlement to the west where Gorilla is situated. They left and settled near Humboldt. They wanted to be with their own people.\n\n35. Did many people move away during the 1930s? Did many return?\nIn the years from 1900 to 1915 many homesteaders settled in Gorilla District. They brought power machinery and big outfits for farming with them and farmed in a bigger scale. In the winter time all the farmers sold and went home to the U.S.A.; many young Goerans went away in those years also. Some returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nMy brother Herman was Post Master in Gorilla from 1903 to 1905, and later Postmaster for Gorilla from 1917 to 1924. I was elected Judge in October and held this office till 1941. Was Councilman from 1927 to 1930, School Trustee from 1928 to 1932, Mayor of Gorilla from 1929 to 1930, School Trustee of the Gorilla School Board from 1932 to 1935. I was elected Vice President Delegate to Torrington 5 District (from 1929 to 1930) to 1940. At present I am Hon. President and Life Member of the Gorilla Agricultural Society, Life Member of the Gorilla Land & Water Company and Hon. Member of the Canadian Pioneer Society.\n\n37. If you or any of your family or friends were firsts to have or do something in the district mention it here, giving dates whenever possible.\n(Such as owning the first automobile, combining, organizing the first lodge, etc.)\nMr. H.H. Osmundson, John Charleton, Harry Buleman, my brother Herman, Ernest and Harry Miller organized the Gorilla Agricultural Society. Mr. Osmundson was the first President and I was the first Secretary. My brother Ernest built the first livery barn in Gorilla.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railroads, stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting the name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name in (1), (2), (3).\nMr. William Allan was the first store keeper. He named the town Gorilla after the Canadian Northern Railway Co. Gorilla, Ont., 1911, 12 miles north of Gorilla. It was named after the railway offices. The nearest post office was just on at that time. The station master Mr. Allan named by 4 brothers who settled there in 1900, 7 miles south of Gorilla, today it is called Hurley.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe)\n\nI have photographs and papers from the early days of the Carora History.\n\nWhen we came out here in 1859 my father wrote articles in the Hume Garryyer and gave about our trip, from certainty out here and also about the country. It will not be much handling any more. I am writing and am about finished The History of Carora and District.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying? Yes...\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any) Yes.../No...\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSons, Otto, Harold, John, and Donald.\nElectrical Instrumentation and equipment for the plant in the National Airplane Manufacturing in Winnipeg, Manitoba.\nMarried to Evelyn Bette, Superior of General Hospital in Winnipeg, Manitoba.\nMarried to James Macleod, at present living in Edmonton, Alberta.\n\nDaughters, Anna, and Ethel.\nMarried to Phillip Boyd, Winnipeg, Manitoba.\n\nGrandsons, Donald and Harold.\n\n41.\n6.\n\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, minute books of community organiza-\n   tions, old pamphlets, old photographs, written reminiscences?\n   I have photographs and papers from the early days of the Carora History.\n   When we came out here in 1899 my father wrote articles in the three Carora\n   papers about our trip from Carona out here about the country\n   It will not stand much handling any more. I am writing and am about\n   finished The History of Carona and District.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes\n(2) be willing to present them to the Archives Division of the Legislative\n    Library? (Indicate your preference, if any) Yes\n\n40. If you have children or grandchildren, please give their names, their\n    age, occupation, marital status, and address.\n\n41. If you have obtained any information from the following sources:\n\n   [List of sources]\n\nIf anyone else has filled in this questionnaire for you, please have this person\ngive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_545.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 48, "total-input-tokens": 79680, "total-output-tokens": 16241, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3165, 6], [3165, 4517, 7], [4517, 5529, 8], [5529, 8134, 9], [8134, 8878, 10], [8878, 10979, 11], [10979, 12112, 12], [12112, 13394, 13], [13394, 14673, 14], [14673, 15944, 15], [15944, 17169, 16], [17169, 18757, 17], [18757, 19913, 18], [19913, 22052, 19], [22052, 22052, 20], [22052, 24855, 21], [24855, 24855, 22], [24855, 27243, 23], [27243, 29401, 24], [29401, 31398, 25], [31398, 33109, 26], [33109, 33317, 27], [33317, 33317, 28], [33317, 33562, 29], [33562, 33797, 30], [33797, 35309, 31], [35309, 36906, 32], [36906, 38321, 33], [38321, 39383, 34], [39383, 41917, 35], [41917, 44420, 36], [44420, 47167, 37], [47167, 49530, 38], [49530, 50167, 39], [50167, 50804, 40], [50804, 52387, 41], [52387, 54022, 42], [54022, 56808, 43], [56808, 59589, 44], [59589, 61060, 45], [61060, 62248, 46], [62248, 62403, 47], [62403, 62557, 48]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]