[{"id": "cb3c8266c2f94287ea459ea5ab578d251ff34219", "text": "S-X2\n736. Watson Edward Collis\n\nWatson, Edward Collis\nWishart. 1903\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire to pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so that sufficient space to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1920, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family answered the questions, they should write them on separate sheets or copy for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board No. 1, entitled \"Pioneer Life What It Was Like\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (—).\n\nSaskatchewan Archives Board No. 2, entitled \"Pioneer Life What It Was Like\" is still being circulated. If you have not already answered this, and would be willing to do so, please mark this one and one will be sent to you.\n\nPlease answer all questions. Please send your completed questionnaire to:\n\nOffice of the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's archives.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your own experience but may prove impossible or irrelevant to others. It is therefore suggested that you answer the questions most relevant to your own experience. Also, if there are any questions which you feel should be included in the questionnaire, please let us know.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1920. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life,\" was distributed to Western Canadian pioneers in 1947 and will be circulated again. If you have not already answered this, and would be willing to do so, please put a check mark beside it and we will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer social life\n- Pioneer religious life\n- Pioneer sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nOffice of the University of Saskatchewan Archives Board's Provincial Archives. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: FOWARD, GILLIS, WATSON\n\n2. Your address: WISNART, SASK.\n\n3. Date: 9/7/1952\n\n4. Where were you born? (Give name of place and country) YOLOFIELD, MAN.\n\n5. What was your father's name and occupation? JAMES GILLES\n\n6. When did you come to Saskatchewan? (Give month and year) OCTOBER 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) 18 YEARS OLD\n\n9. What were your reasons for coming west? TO WORK ON FAMILY FARM\n\n10. How did you learn about the West? THROUGH OTHER PEOPLE? READING ABOUT IT\n1. Your full name: EDWARD COLLIS\n2. Your address: WATSON\n3. Date: 1947\n4. Where were you born? (Give name of place and country): SOLMFIELD, MAN.\n5. What was your father's name and occupation? COLLIS\n6. When did you come to Saskatchewan? (Give month and year): about August 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Regina, Saskatchewan\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question or you would rather not or you may use \"I was small child\")\n   - I was in my teens\n9. What were your reasons for coming West?\n   - To earn a living\n10. How did you learn about the West? (Through other people? Reading about it)\n    - Through government information\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use? (car, bus, train, plane)\n\n14. What difficulties did you encounter during your journey, accidents or other obstacles met along with Indians, adventurers on the journey, accidents or other obstacles.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (Train, car, horse-drawn, etc.)\n\n14. What incidents of the journey best do you remember? (People you met, on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell them they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nMy dear mother and father,\n\nI am writing to you from (insert location).\n\nI have been working hard and trying to save money.\n\nI am looking forward to seeing you soon.\n\nYour loving son,\n\n[Signature]\n\nP.S. I am planning to visit you next summer.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nI'm not sure how much time we have available today. If there's a few minutes left, I'd like to discuss something important with you.\n\nAs you know, we've been working on this project for quite some time now. It's been challenging at times, but I believe we're making progress.\n\nOne thing I want to mention is the upcoming presentation. We need to ensure that everything is in order by next week. I'll be sending out an email with more details soon.\n\nThank you for your attention to this matter. I look forward to hearing your thoughts on this.\n\nBest regards,\n\n[Signature]\nA few days later Walter came with a message. He said we must wait until May. We were in our own house and could not go out. My mother said we needed to move away from the town. She said she would take us somewhere else.\n\nWe moved into a new house. We were happy there. We went to school and played with other children. We had a good time.\n\nWe missed our old home. We missed our friends. We missed our family. We missed our pets.\n\nWe were happy in our new home. We were happy to be together again. We were happy to be free.\n\nWe were happy to be together again. We were happy to be free.\n25. When was the first car used in the community? (Name and date)\n\n26. If you owned a car before 1912, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? (Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n34. When did you first have a telephone and what company provided it?\n\n35. When did you first have a telephone and what company provided it?\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any advantages in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\n35. Did many people move away during the 1950s or did very few?\n\n36. If you or some member of your family or friends were \"freemen\" to have or do something active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"freemen\" to have or do something in the settlement section, it was giving dates wherever possible, (such as owning the first automobile, owning, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, Villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person (2) any changes in names since the first name was given (3) date of its adoption (4) any other facts of note above in (2) (5).\n\n39. How old are the places in your community get their names? (School districts, Post offices, Villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person (2) any changes in names since the first name was given (3) date of its adoption (4) any other facts of note above in (2) (5).\n5.\n\n34. Did any people move away from your district prior to 1914? If so, please give their names and addresses.\n\n35. If you or any member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. In the district mentioned above, was there ever a school district organized?\n\n37. If you or any of your family or friends were appointed to have or do anything in connection with the first automobile, describe it.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the date and occupation of person making place name; (2) date and meaning of the name; (3) date of its adoption; (4) date and reason for change.\n\n39. Have you any other information about your district which might be of interest to others?\n37. Questions regarding historical source materials\n\nWould you or the person who owns these either:\n\n(1) Be willing to lend them to the Provincial Archives for copying?\n\n(2) Be willing to present them to the archives division of the Legislative Library, Regina, or the archives office of the University in Saskatoon?\n\n(Indicate your preference, if any) ____________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\n42. Give the name and address of other persons who could answer these questions.\n\nPlease give the name and address of other persons who could answer these questions.\n10. Questions regarding historical source materials.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n43. What do you think are the most important changes in your community since you\n\nPlease give the name and address of other persons who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_736.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4000, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 68, 4], [68, 1773, 5], [1773, 3493, 6], [3493, 4252, 7], [4252, 5030, 8], [5030, 5720, 9], [5720, 6410, 10], [6410, 7174, 11], [7174, 7682, 12], [7682, 8253, 13], [8253, 8839, 14], [8839, 9876, 15], [9876, 10843, 16], [10843, 12045, 17], [12045, 12930, 18], [12930, 13680, 19], [13680, 14400, 20], [14400, 14400, 21], [14400, 14563, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]