[{"id": "05a6e757a985a5aa6c1e239b7c6cd4d72041bca3", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have which may apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThe extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire too.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. John Francis Orr.\n2. Your address ................................................................. 323-10A St., N.W., Calgary, Alberta.\n3. Date ................................................................. April 14, 1955.\n4. Where were you born? (Give name of place and country).\n   Cobourg, on lake Ontario, Canada, in the year 1871.\n5. What was your father's name and occupation?\n   James Orr, Farmer.\n6. When did you come to Saskatchewan? (Give month and Year).\n   October, 1905.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Brice Hill, post office, Ontario, Cobourg, Ontario, Dromore Post Office, Ont., Little Current, Manitoulin Island, Ontario.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Was Twenty years old.\n9. What were your reasons for coming West?\n   Adventure the first time, coming to Manitoba, in 1891. Later, after I was married, to get a homestead, in 1905, to start farming in Saskatchewan.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Saskatchewan was formed into a Province in 1905, and there was considerable publicity regarding the West at that time.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULES: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: John Francis Orr.\n2. Your address: 324-10A St. N.W., Calgary, Alberta.\n3. Date: April 11, 1955.\n4. Where were you born? (Give name of place and country): Edmonton, Alberta, Canada.\n5. What was your father's name and occupation? James Orr, Farmer.\n6. When did you come to Saskatchewan? (Give month and year): October 28, 1905.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Prince Hill, post office Ontario, Colborne, Ontario, Ontario Post Offices, Ont.\n   - Little Current, Manitoulin Island, Ontario.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   Was Twenty years old.\n9. What were your reasons for coming West?\n   Adventure, the first time coming to Manitoba, in 1891. Later, after I was married, to get a homestead. In 1905, to start farming in Saskatchewan.\n10. How did you learn about the West? (Through other people? Reading about it?)\n    Saskatchewan was forced into a Province in 1905, and there was considerable publicity regarding the West at that time.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy father thought we were old enough to decide for ourselves. He later came West himself, and homesteaded the S.W.32.29.16-West of 3rd in 1907.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy brother Albert and I came West together, the first time to Manitoba, in 1894.\n\n13. What means of transportation did you use?\n\nWe came by C.P.R. Harvest excursion.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaskatoon was our headquarters until we were ready to start locating the homesteads. Later we came back to Saskatoon to have our claims recorded at the Dominion Land Office. Then back to Ontario until spring, when we came West again, with a car-load of settlers effects.\n\n16. Where did you settle or take up land?\n\nI homesteaded the N.W.of 32.29.16.West of 3rd, and later procured all of section.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived in Saskatoon, between intervals from homestead duties. I hauled stone and gravel for the abutments of the C.P.R. bridge in Saskatoon.\n\nI was second-man in the installation of the Gas-Producer Electric-Light-Plant, in Saskatoon, at Ave.-G, and 22nd St; And too I operated the first Electric-Light-Plant in Saskatoon. I have also worked for 15 cents an hour in Saskatoon.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nTo keep the record straight, my mother died when I was 7 years old. My father sold his land, in the vicinity of Cobourg, Ont., and bought a farm in Grey County, Ont., Lot.22, con. 16, Tp. of Egremont.\n\nI worked for my father. Then I worked on a farm near Guelph, Ontario, for 8 months at 14 dollars and seventy-five cents a month.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy brother thought we were old enough to decide for ourselves. We later came West himself and homesteaded the S.W.32-36-16-East of 3rd. In 1907.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nMy brother Albert and I took the train together, the first time to Manitoba in 1908.\n\n13. What means of transportation did you use?\nWe came by C.P.R. Backwater excursion.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nWhen we came West again with a six-lead of settlers there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nI homesteaded the N.W. of 32-36-16-West of 3rd, and later purchased all of section.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\nWe lived in Saskatoon between intervals from homestead duties. I bought stone and gravel for the installation of the O.P.R. bridge in Saskatoon.\n\n17. How did you earn a living before coming to Western Canada?\nFor Father & Co., Ltd., until my mother died when I was 17 years old.\n\n18. How did you earn a living after coming to Western Canada?\nHow, after you\n19. How often did you write to relatives or friends in your old home?\n   Am afraid I did not write too often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Married Jeannetta Fullerton, at her home, on the 8th con., of Proton, Tp.-Grey Co., Ont., on July 9th, 1901. Went to Pan-American Exposition at Buffalo.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, my father, and James Deans and wife came West in the fall of 1906. James Deans homesteaded the S.W.-28, 29, 16, West of 3rd. Later got the N.W. of 28, 29, 16, West of 3rd, as pre-emption.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My brother Albert, homesteaded a mile West of our place on the S.W. of 6, 30, 16, West of 3rd. Donald Fullerton—my brother-in-law—homesteaded with us—in fact I selected his land.—His land is the N.E. of 36, 29, 16, West of 3rd.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Our homestead was 132 miles from Saskatoon, via the bone-trail. It was said this trail got its name from the dead carcasses of oxen along its route. We measured the distance to Saskatoon by tying a rag on a spoke of the wagon-wheel, and counting the turns of the wheel, figuring it out from that. The circumference of our wagon-wheel was just slightly over one rod. I made in all 17 trips to Saskatoon. I was on one of these trips; leaving my wife and two little girls, Grace and Christine, on the homestead, when one of my horses took sick, which delayed me several days. There had run out of food, and my wife was going out to hunt some herbs, or something, when she saw two rabbits sitting at the corner of the house. She took the 22 rifle, shot one of the rabbits, the other rabbit sat there until she reloaded the rifle, and shot it also. They were on the last leg of the last rabbit when I arrived home. They were certainly glad to see me.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   We had no means of travel except the horses and wagon, until we got our first car—a model T. Ford, in 1915. We had no need to go visiting anywhere as the homesteaders, from all over this vast wilderness of space, came to our place almost every Sunday, and got a good meal. My wife being the only woman, for miles in every direction.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\n23. In these particular experiences of pioneer days that stand out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\nWe had the first car in the community, bought it in Toronto, Ont., in 1915.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nOurs was a model T, Ford.\n\n27. Where was your trading center? How far from your home?\nSaskatoon was our Post Office and store, 132 miles by trail until 1908.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nAfter the Rail-Road came to Rosetown, in the fall of 1908, we traded there. I bought the first farm-implement sold out of Rosetown, and a neighbor borrowed it before I had used it. We done that kind of thing those days.\n\n29. How often did you shop in the early days?\nWe went to Zealandia—about every two weeks for supplies, as we had, what was called a stopping-house in 1908, and the first part of 1909.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? I would say about 1914 or 1915. We had a good general store in McGee, in 1916, owned by Thos Gales. I believe it is a common practice today.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nWe never bought much through the mail-order-house.\n\n32. When did you first have a telephone and what company provided it?\nWe formed the McGee Rural Telephone Co; in 1912. There was a levy on the land adjacent, and a service charge.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWe had decided, before we came West, on a C.P.R. Harvest Excursion, to get homesteads if at all possible. We landed at Souris, Man., and then hiked our way to Elgin, Man., where we had a cousin John Dodds, for whom we done some stocking. We then went to Boissevain, Man., where I got a job running a separator, from Abe Buck. My brother got a job on the same outfit. After threshing, we headed for Saskatoon, Mr. Buck going with us as locater. It was about the last of October, when we filed on our homesteads in Saskatoon.\n25. When was the first car used in the community?\n   We had the first car in the community, bought it in Toronto, Ont., in 1915.\n\n26. If you owned a car before 1915, when did you buy it? What make?\n   Our car was a model T Ford.\n\n27. Where was your trading center? How far from your home?\n   Saskatoon was our Post Office and store, 132 miles by train until 1926.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   After the railroad came to Saskatoon, in the fall of 1909 we traded there. I bought the first farm implement sold out of Saskatoon, and we neither borrowed it before I had used it. We done that kind of thing those days.\n\n29. How often did you shop in the early days?\n   We went to Saskatoon about every two weeks for supplies, as we had what was called a stopping house in 1909, and the first part of 1910.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? I would say about 1914 or 1915. We had a good general store in the town in 1910, owned by Mrs. Gales. I believe it is a common practice today.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe never bought much through the mail-order-house.\n\n32. When did you first have a telephone and what company provided it?\n   We formed the North Rural Telephone Co. in 1912.\n\nThere was a levy on the land adjacent, and a service charge.\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out?\n   We had decided, before we came West, on a C.P.R. Harvest Excursion, to get homesteads if at all possible. We landed at Souris, Man., and then hitched our way to Regina, Man., where we had a cousin John Dadds, for whom we done some shoewing. We then went to Moose Jaw, Man., where we got a job running a separator, from the buck, my brother got a job on the same outfit.\n\nAfter threshing, we headed for Saskatoon, to hitch onto us as loco-pump. It was about the last of October, when we filled on our homesteads in Saskatoon.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nNo one moved from our district that I know of. I think they were all quite well satisfied with the progress they had made.\n\n35. Did many people move away during the 1920's? Did many return?\nWe came to Calgary, Alberta, in the fall of 1929, on account of sickness, but I never heard of anyone moving because they did not like the district.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was a trustee for the first Rural School district in our community.\nWas also trustee in the No. 8 school district for 1926 and 1927.\nI was councillor for Pleasant Valley Municipality, for 1916 and 1917.\nWas President of the Farmers Union of Canada, Sask., section, for 3 years.\nCan not remember the exact dates.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible.\n(Such as owning the first automobile, combine, organizing the first lodge, etc.). When I was councillor, I had a road made, where I was told it was impossible to do so. It is used extensively today.\nWe had a good crop of oats and flax in 1909. As there was no threshing-machine anywhere near us, I bought a 6 team horse-power threshing-machine through a Mr. Middleton who had a feed store in Eastwood, and had it shipped in from Manitoba. After some repairs, we done our threshing, and some for our neighbors, in the month of February, 1910.\nAfter all that treatment, our oats yielded 110 bu. to the acre.\nI bought a large gas-threshing-machine in 1911.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1917? What reason did they have for leaving?\n\nSo many moved out our district that I think they were all killed.\n\n35. Did any people move away during the 1920s? Did any return?\n\nWe went to Calgary, Alberta, in the fall of 1929, an account of alabaster.\n\nBut I never heard of anyone moving because they did not like the district.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nI was a trustee for the first Rural School district in our community.\n\nI was also trustee for the first school district for 1928 and 1929.\n\nI was councillor for Pleasant Valley Rural District for 1930 and 1931.\n\nWas President of the Farmers Union of Canada, Saskatchewan, for 3 years.\n\nCan not remember the exact dates.\n\n37. If you or any of your family or friends were \"flirt\" to have or do something in the district mention it here giving dates whenever possible.\n\nSuch as owning the first automobile, building, organizing the first lodge, etc., then you councillor, and a real name, where I was told it was impossible to be sold at such an exorbitant salary.\n\nThere was no threshold, we had a good crop of oats and flax in 1929, but there was no threshold.\n\nMachine operators were not bought at such a low rate, but it allowed through by legislation.\n\nWe had a few more landowners and had it shipped.\n\nIn two months, after the death of Mr. Johnson, 1930, our threshold, and some for our neighbors.\n\nIn those days, in those days of pioneer life, 1930, after all that treatment, our oats planted like fire to the acre.\n\nI bought a large One-horse-team-machine in 1931.\n\n38. How did the places in your community get their names? (School, districts, post offices, villages, railway stations, creeks, hills, etc.)\n\nGive (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given, date and reason for change. Give dates of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon ......... (indicate your preference, if any) ........................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe had 6 children—(names) Mr. Dalong, Raymond, Saskatchewan, (Christine), Mrs. J.J. Millard, Blackfalds, Alberta, (Mary Ray), Mrs. M. Ronald, 2nd Ave., N.W., Calgary, Alberta, James D., (not home, married), 3rd Ave., N.W., Calgary, Alberta, Everett, and Marjorie, sons, now dead.\n\nI have 15 grandchildren, and two great-grandchildren.\n\nGrandchildren—John L. Dalong, dealer in farm implements, at Calgary, Alberta, Andy and Barbara, Dalong, at home at Raymond, Saskatchewan, Margaret, Millard, living at 8th Avenue, Calgary, Alberta, Elaine, Jerry, Ray, Ray, Donald, Donald, Ronald, 2nd Ave., N.W., Calgary, Alberta, Frank, (name), & child, (age 10), 4th St., N.W., Calgary, Alberta.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt has changed from a wilderness of spaces into a thriving community, in a great country.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThe Pioneers are about all gone, I only know of two persons in this Community, John Evans and Donald, Pullerton, both of Halifax, who could answer from personal knowledge.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here. I wrote and typed this myself for better or worse.\n\n[Signature]\nJohn Francis Orr\n323-10A St., N.W., Calgary, Alta.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905M-R_860.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6239, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1643, 5], [1643, 1643, 6], [1643, 3413, 7], [3413, 4884, 8], [4884, 6881, 9], [6881, 8186, 10], [8186, 10764, 11], [10764, 11440, 12], [11440, 13781, 13], [13781, 16116, 14], [16116, 18235, 15], [18235, 20346, 16], [20346, 22445, 17], [22445, 22445, 18], [22445, 22445, 19], [22445, 22599, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]