[{"id": "baeb861577af89dcb610b2d16549e874fdaec99e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NEED OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or prove impossible for you to answer, so don't worry about leaving blank spaces in the questions. If there is not enough space to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneers' Diets: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Pioneers' Education and Chronology\n\nWestern Canadian Pioneers' Education and Chronology\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nJUN 25 1967\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MODEL OF ORIENTATION TO THE PIONEER HISTORY OF SASKATCHEWAN\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences and some may be impossible for you to answer, so do not worry about answering all the questions. If there is not enough space to answer a question, please give details, or describe particular events, if they may help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and who have personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Tales: What I Did,\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Pioneers' Experiences will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nArchives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nHow did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n\nThrough other people that had heard of the possibilities in Saskatchewan.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\nHow did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n\nThrough other people they had heard of the possibilities in Saskatchewan.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: EDWIN J.M. BARTEL\n\n2. Your address: MOUNT RIDGE, KANSAS\n\n3. Date: 1852\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to swear this question if you would rather not or you may use \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFamily:\n\nMother was looking for a future for his family.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: E. D. W. J. M. S. BARTEL\n\n2. Your address: MOUNT RIDGE, KANSAS\n\n3. Date: August 24th, 1952\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to say how long you have been in Saskatchewan. If you came by train, say so.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nFamily was looking for a future for his family.\n\nThey peoples that had heard of the possibilities in Saskatchewan.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThe Wilsons were very pleased to have me join them.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\nWe traveled together in a group of four.\n\n13. What means of transportation did you use?\n\nWe traveled by train from Chicago to Kansas City, then by horse-drawn wagon to our destination.\n\n14. What incidents of the journey do you remember? People you met on the way, meetings with Indians, adventures on the journey, mishaps or other experiences.\n\nWe met many interesting people along the way, including friendly Indians who helped us.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at the Wilson farm until we found a permanent home.\n\n16. Where did you settle or take up land?\n\nWe settled on the farm of Mr. Bartel, who had arrived here the year before.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived on the farm of Mr. Bartel for two years, then moved to the farm of Mr. Wilson.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWe worked on the farm until the 1919 crop was harvested.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. How did you travel to your farm?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, mishaps or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How did you work out your homestead claim?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\n25. Did you attend school? What kind? How long? How far away? How much did it cost?\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, list their names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n25. Did you ever attend church services in the United States? If so, how often?\n5.\n\n34. Did any people move away from your district prior to 1921? What reasons did they have for moving?\n\n35. Did many people move in mainly because of the promise of fortune\n\n36. If you or some member of your family have held public office or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, post office, village, railroad stations, creeks, hills, etc.) Try to give (1) full origin; (2) origin and meaning of the name; (3) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe name was changed to \"Poveshull\" on July 1, 1913 (the original district name was \"Poveshull\") and the name was changed again on July 1, 1913 (the original district name was \"Poveshull\").\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or do something in the district mention it here, giving data wherever possible. (Such as organizing the first school, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, townships, stations, creeks, hills, etc.) Try to give: (1) name; (2) origin and meaning; (3) date of origin; (4) any changes in name since then; (5) date and reason for change. Give facts of new name.\n\nThe names above will be used in the 1915 (Statewide) list.\n5. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"thrilled\" to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, combining organizing the first library, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of name (3) date of its adoption (4) any changes in name since then (5) date and reason for change. Give facts of the name as below in (1), (2), (3).\n\nThe name was changed from \"Poveshull\" to \"Poveshull\" in 1935. It is now known as \"Poveshull\" throughout the county.\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1914-1918 war? Did many farmers move away during this period due to changing circumstances?\n\n36. If you or any member of your family have held public offices or been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were involved in having a new building erected (such as school, church, etc.), mention it here, giving dates where possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give all the facts and complete history of each place-name. Mention the date and reason for the name change.\n\n39. How did the town get its name?\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library (refer to the Archives Office at the University of Saskatchewan)?\n(3) indicate your preference, if any?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n6.\n\nQuestions regarding historical records material:\n\nTo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, newspapers, etc., relating to the settlement and early history of Ontario?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Include your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could assist with this questionnaire.\n\nIf someone has filled in this questionnaire for you, please have this person sign here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_891.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4237, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1608, 5], [1608, 3402, 6], [3402, 3834, 7], [3834, 4266, 8], [4266, 5106, 9], [5106, 5977, 10], [5977, 7197, 11], [7197, 7863, 12], [7863, 8609, 13], [8609, 9283, 14], [9283, 9283, 15], [9283, 9283, 16], [9283, 10321, 17], [10321, 11203, 18], [11203, 12158, 19], [12158, 13013, 20], [13013, 13985, 21], [13985, 14820, 22], [14820, 14975, 23], [14975, 15129, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]