[{"id": "07c8486fb45dd5e452501186f56b533b0af3db50", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Richard Henry Luyckx\nPresent Address: Morden\nPioneer Address: Lac Vaudreuil\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the Questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? about two\n\nHow many of these were bachelor's homes? 50%\n\n2. How often did you usually visit neighbors? once a week\n\n3. Did you usually visit on a Sunday, or other days? both\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly without an invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? evenings\n\nWhat about meals? Did you stay when not invited beforehand? seldom\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? take whatever we have\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? generally the whole family\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? the first buildings (log) were all put up by \"bees\"\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nfor the first few years there would be a bee everyday for two weeks somewhere, would be as much as ten miles and have 20-25 men, the ladies would serve dinner while we would stand around in the snow or be seated on a log.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe, not until our school was built in 1909, until then the dances would be in a house our parties was mostly by way of our literary society which would put on an evening of entertainment, such as debates etc., every two weeks.\n\nWere these more frequent in later years? Give dates. NO\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\n\nThe literary meetings were held every two weeks and the men with horses would take turns gathering at the homes and go to where the meeting would be for that time.\nMEMORIAL VISITING, PARTIES, ETC.\n\n1. In the first five years, how many homes were near enough to you for visiting? How many of these were bachelor's houses? 60%\n\n2. How often did you usually visit neighbors? Once a week\n\n3. Did you usually visit on a Sunday, or other days? Not at all\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly unwritten invitation\n\nThat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Evening\n\nWhat about meals? Did you stay when not invited beforehand? Welcome\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Nada whatever\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"meets\" when groups of neighbors came together for a building and quilting, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling where they were held, and how often they occurred.\n\nIn the earliest years that you were here, were there many parties, whilst driving or dancing in homes? Unanswerable\n\n7. In the early years, would the dances mostly be held at our church, or would they be held on an evening of celebration, such as a birthday?\n\nWere these more frequent in later years? Give dates...no\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? The Wilburys met up every two weeks, once a week, once a month, etc., and knew when the meeting would be for that time.\n2. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nDescribe in the school Questionnaire.\n\nHow much of your social life was centred around the school, and within the school district? Describe. All of it, as there was no villages or railroad.\n\n9. When was your first community hall built? (The school was used as such.)\n\nWhat material was it made of? Lumber\n\nHow large was it? About 20' x 50'\n\nWho built it - the community through special funds, the municipality, some organization, etc.? By the community, funds raised by entertainments, etc.\n\nWas it built in the village or town, or was it a country hall? In the village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nThe new school was built in the village in 1928 and the basement was used as a hall for all functions until its help was put up in 1948.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Only on the nights of the Xmas tree where offered and were prepared.\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties? In the school barn until the new school was built and they were put into the living room.\n\n11. What card games were popular in the early days? Euchre, whist.\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Square dances and waltzes\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Not in the early years, some in later years.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nAs a general thing cards was not frowned on only by a very small faction, as we never played for prizes only at a wheat drive, and then the party was put on by the curling club or Agricultural Society and a small prize given.\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. (Include also the school Christmas tree, pianos, etc.)\n\nIf you have not described these on the School Questionnaire, give dates.\n\n9. When was your first community hall built? What material was it made of? Who built it - the community organization, etc.? How large was it? How was it used?\n\nWas it built in the village or town, or was it a country hall? For what purpose did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for all district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? The new school was built in its village in 1928 and the farmyard was used as a hall for all functions until at least 1935.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9), how many attended? How were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nHas there ever been playing for prizes? What dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home or for community gatherings? Explain.\n\nAs a general thing, cards was not known (or only rarely) as we never played for prizes. It was a very casual function, as we never played for prizes only at a what time, and then the story was lost.\nProvince of Saskatchewan\n\nOFFICE OF THE SASKATCHEWAN ARCHIVES\nUNIVERSITY OF SASKATCHEWAN\n\nEnclosed are three Archives questionnaires on pioneer schools, churches and recreation. During the past two years the Saskatchewan Archives Board has carried out a policy of distributing questionnaires to old-timers of the province, in order that experiences and events of pioneer life may be recorded and preserved, and we hope that you will assist in this enterprise.\n\nThese three questionnaires, No. 3 on pioneer schools, No. 4 on pioneer churches, and No. 5 dealing with recreation and social life, have been sent out as a group, since these are phases of pioneer life in which there was a distinct overlapping of activity. Each questionnaire is complete within itself, but by having the three of them to answer at the same time, it was thought that the person answering them would find it easier to avoid repetition from one questionnaire to another.\n\nWe realize that the answering of these will take some time, but you may be sure that your effort will be appreciated, and that all questionnaires which are completed and returned to the Archives Office are valued as part of the permanent record of our province, and provide an important source of information on early provincial settlement. If you wish, you may have someone else write your answers for you. If it is hard for you to write in English, it is quite all right to answer the questions in your own language.\n\nPlease give below the names and addresses of other pioneer who could answer these questionnaires. (You may send this form in with your completed questionnaires or may send this in now if you wish, and the questionnaires later).\n\nTwo other questionnaires which have been distributed within the past two years are still available; No. 1, \"Pioneer Diet: What Did Western Canadian Pioneers Eat\", and No. 2, \"Pioneer Experiences: A General Questionnaire\". If you have not completed these, please put a check mark below and they will be sent to you.\n\nPlease send me Archives Questionnaires No.1 and No. 2.\n\nSend to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nYour name Henry Lovas\nAddress (Manitou Wascana)\nBox 274\nProvince of Saskatchewan\n\nOffice of the Saskatchewan Archives\n\nEnclosed are three Archives questionnaires on pioneer schools, churches and religion. During the past two years the Saskatchewan Archives Board has carried out a policy of distributing questionnaires to old-timers of the province, in order that their stories and events of pioneer life may be recorded and preserved, and we hope that you will assist in this enterprise.\n\nThese three questionnaires, No. 3 on pioneer schools, No. 4 on pioneer churches, and No. 5 dealing with recreation and social life, have been sent out as a group, since these topics concern all pioneer life in which there was a distinct overlapping of activity. Each pioneer community is unique to which he belongs, but by having these clues find it easier to avoid repetition from one questionnaire to another.\n\nWe realise that the answering of these will take some time, but you may be sure that your effort will be appreciated, and that all stories, facts and which are completed and returned to the Archives Office, will be used as part of the Pioneer Records of our province, and provide an important source of information on early provincial settlement. If you feel that you have enough space left in your questionnaire, or if it is hard for you to write in English, it is quite all right to answer the questions in your own language.\n\nPlease give below the names and addresses of other pioneer who could answer these questionnaires. (You may send this form in with your completed questionnaires or may send this in now if you wish, and the questionnaires later).\n\nTwo other questionnaires which have been distributed within the past two years are still available; No. 1, Pioneer Diet; What Did Western Canadian Pioneers Eat?, and No. 2, Pioneer Experiences; A General Questionnaire. If you have not completed these, please put a check mark below and they will be sent to you.\n\nPlease send me Archives Questionnaires No. 1 and No. 2.\n\nSend to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nYour name ____________________________\nAddress _____________________________\nPhone _______________________________\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? \n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? \n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\nTell when it was organized, and what steps led to its organization. \n\nApproximately what proportion of the farmers in the community belonged to it? \n\nHow many women belonged? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes took place. Tell also what was done for fun and recreation.\n\nORGANIZATIONS AND ASSOCIATIONS:\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give date, location, purpose, etc.\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nBoys' Socials, Picnics, Dances\n\n19. Where did various organizations hold their meetings? In the school\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?...not until after 1921, then thru the Agricultural Bureau. Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Were any other organizations that were in evidence in your community before 1914, rising to the status of a church? If so, what was its name, when did it originate, who founded it (men, women, young people), whether it included only a few people or a large number, whether it was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\nBy Church, Picton, Maine\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, what kind of lectures? Who gave them? (Local minister or teacher, special lecturer, etc.) Where they held? How well they were attended? Any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (marbles, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nfootball\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. June 1908\n\n26. Who organized it? The Community\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For everyone\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Football, Baseball, and Races\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nOut of habit, each family had lunch, everyone sat down for dinner, all helped themselves, everything was free except the beer and the booth, the profits went for prizes for games.\n\n31. What did you have to eat and drink? Tea - water, beer, no prizes for games.\n\nanswered in #30\n\n32. What time of the day did it start, and how long did it last?\nStart at eleven A.M., go home about 7-8 P.M.\nThen have a dinner in the school from 9\n22. What winter games were played outside - fox and hounds, baseball, etc.? \n\nWhat games were played indoors in winter - card games such as Whist, Patti, etc., Mahjongg or pinochle, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, berries, seeds, etc.? If so, describe them.\n\nPICKNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \nGive year and month if possible. June 1908\n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did each family bring food? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nStart of dinner A.M. Got home about 7-8 PM\n33. Describe any features of this picnic which you remember as outstanding.\n\nPlaying football when there was water or puddles all over the grounds. If you fell down, we would have to carry the water out from under a woman spectator who hit us in the head with her hat pin. The game was held for an hour until a new ball was obtained.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nEach community had its own organization that they own picnic, but would have visiting teams from one community to another, and each community would visit the other at their respective picnics and Christmas entertainments.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nFrom 1918 on, when cars became numerous and people wanted to go to the larger centers, the greater change took place after 1923 when the R.R. went through. We were 30 miles from any town or by way of that time.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nEveryone almost was always willing to help. Men and women of 60 would run races.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball\n\nWhat year? 1906\n\nHow long did it continue? Until about 1925\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nUntil 1920 there was competition between these different settlements, each having the same organization and competed at each of their respective picnics, for sport only. No prizes were given.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nAbout 1928 used for hockey. A curling rink was built about the same time.\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe basement of the curling rink was used still used for serving tea, etc., at W.A. and country club meetings not as often now as a few years ago.\n13. Describe any features of the picnic which you remember as outstanding.\n\n14. Describe any different kinds of picnics which you know of in the early days, such as school or Sunday School picnics, family picnics, etc., tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n15. Tell how the various organizations used their own facilities. Let us have a list of the other community centers and what they were used for.\n\n16. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n17. Describe the sports which were popular in your community in the early years, telling who took part in them, the various games and sports (men, women, mostly young people), and where they were played.\n\n18. For what game was the first team organized in your community to play against neighboring teams?\n\n19. How long did it continue?\n\n20. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n21. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.), also when it was built and for hockey.\n\n22. When was the first indoor rink built, and what was it used for?\n\n23. The answer to the above may be used for serving tea, etc., at U.A. and country club meetings as often now as a few years ago.\n40. When did an annual \"sports day\" become established in your community? about 1930\nDid it grow out of or replace the earlier community picnic? replace the picnic\nWho was responsible for starting the first sports day? The Agricultural Society\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\nBill and Ben Brown\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nSeveral people who came here before 1914 were school teachers and brought their school books along from Ontario and other provinces. Shakespeare & Dickens\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? very little\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\nYes, by the Saskatchewan Government\n\n48. Was there a school library? Yes! When was it begun? about 1930\nTo what extent were books borrowed from the school library for adults to read at home? very few\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community plans? Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become numbers of well-known hockey, ball, or other teams? Give names and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheet if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?  \n   Answered at #47\n   Who started it?\n   Is it still in existence? The travelling library is still in existence.\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe travelling library was kept in a private home generally and the lady of the house or someone else shrewdly looked after it. Anyone could use the books, and the whole library was returned and another one takes its place.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   The Farmers Advocate, \"Winnipeg Free Press\"\n   The \"Watson Witness\"\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   Because of the free press and the lack of politics, it offered nothing any good for the farmer. The Advocate changed its name to the \"Country Guide\" I still take it also several farm papers, and our local Duncan paper.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   My Methodist hymn book, my Bible that I got out of my grandmother's papers that I got in 1888\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   To come up to us we had to go 35 miles to the PO so only went every two weeks but got plenty when we did get it. Got our provisions at the same time.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe travelling library was a great convenience to the farmers in remote districts. Books could be obtained at a fraction of the cost of purchasing them locally. The library was well attended and a brother once took it away.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe \"Farmers Advocate,\" \"Weekly Sun Press\"\nThe \"Water Witness\"\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nMy mother's hymn book and my Bible.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nTo avoid isolation and loneliness, I read to go places where we didn't get our newspapers at the same time.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? @ Harmonica\n\n57. What instruments did any of your neighbors have? Accordions and Violins\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nBut a street. Violin in 1909 for $5 and still have. Got it here from a homesteader, piano 675\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. Very little, the music and singing was nearly all at church services or entertainments in the community? (were there musical concerts, was there group singing at parties, etc.) Describe. Seldom\n\n60. What were some of the favorite songs in the home? hymns\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n55. What musical instruments did you bring with you?\n\n56. What instruments did any of your neighbors have?\n\n57. What musical instruments have you bought since you came to the west? Give dates, prices, etc., and tell where you bought them.\n\n58. How large a part did singing and other forms of music play in your house entertainments in early years in the West? Describe, say little, the music and explain why it was so popular.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\nLess important, too many movies\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them.\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\nOnly hobbies are collecting lead pencils and thermometers, have the letters from Vancouver to Ottawa and pencils (50) from nearly as far apart, stones from the Rockies.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\nNo\n\n68. Describe other hobbies or special interests of yours not already mentioned.\nI can tell since Oct. 1903 every year when I started, seeding, harvestings, and when finished each year until 1950\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nGot married Jan. 26, 1910 and am still going strong. raised two boys and one girl.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important part of your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? If so, explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nGot married Jan. 26, 1910 and am still living strong. Married two boys and one girl.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2043.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 9426, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1224, 5], [1224, 1224, 6], [1224, 3464, 7], [3464, 5237, 8], [5237, 7707, 9], [7707, 9527, 10], [9527, 11736, 11], [11736, 13912, 12], [13912, 15251, 13], [15251, 16603, 14], [16603, 17951, 15], [17951, 19173, 16], [19173, 20830, 17], [20830, 22090, 18], [22090, 24542, 19], [24542, 26088, 20], [26088, 27654, 21], [27654, 28801, 22], [28801, 30582, 23], [30582, 31935, 24], [31935, 33337, 25], [33337, 34555, 26], [34555, 36099, 27], [36099, 37317, 28], [37317, 37464, 29], [37464, 37618, 30]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]