[{"id": "6e0705084d6bfc413deac64e97e8278d30515f8a", "text": "It is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra effort of answering these questions will be appreciated.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered it, and would like to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA written explanation to the person submitting this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may be impossible for you to answer, so don't worry about having blank spaces or extra sheets of paper. If there is not sufficient space to answer all questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadians Do?\" is still being circulated. If you have not already answered it, and would be willing to do so, please put a check mark here ( ). If you have answered it, or are unwilling to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of this Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...........................................\n   Frederick Johnstone Riggs\n\n2. Your address ..............................................\n   Butte, Saskatchewan\n\n3. Date .......................................................\n   April 6, 1953\n\n4. Where were you born? (Give name of place and country)\n   Tithebowl, Berkshire, England\n\n5. What was your father's name and occupation?\n   Thomas Frederick Riggs\n   Anglican clergyman\n\n6. When did you come to Saskatchewan? (Give month and year)\n   June 4, 1893\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Edmonton, Manitoba March 25-28, 1893 to June 1st, 1893\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18\n\n9. What were your reasons for coming West?\n   In preference to being a Bank Clerk!\n   Elder brother went to Manitoba in 1886\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    I knew nothing about it except from letters & geography\n1. Your full name: Frederick Johnstone\n\n2. Your address: 307, Hector, Sask.\n\n3. Date: April 5, 1953\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years old.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Radio? TV? Government information?)\n\n\"I knew nothing about it, except from telling grandparents.\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThought I was very foolish.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself\n\n13. What means of transportation did you use?\n\nCanadian Pacific Railway, horse-drawn cart, Caribou Bay farm, homestead, intercontinental train, Winnipeg\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nShip's engineer wrote down in March 1918, buffeted until sea anchor for a week, no course of Newfoundland, March 20. Whole population of Winnipeg down at harbour, we see no more, our passengers swept on land, one man fell off train in New Brunswick, presumably walked home, landed in Manitoba village 167, Charlie Beaver, Nellie Brown gave me $10 to buy food in Winnipeg.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nNew Portage Ranch in Regina,\n\n16. Where did you settle or take up land?\n\nMinister, Saskatoon\n\nNovember 1918,\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPrince Albert, Maple Creek, Estevan, Swift Current, Duck Lake, Belcourt, Indian Reserve, Sask.,\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nTeacher for a few months in family, on farm in Manitoba, New Portage, farming, Department of the Interior.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought I was very foolish.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\nBy myself.\n\n13. What means of transportation did you have?\nHomestead River, Saskatoon, horse-drawn cart, and then the train.\n\n14. That incident of the journey West do you remember? (People you met on the way, experiences with Indians, difficulties on the journey, accidents or other excitement etc.)\nYes, we encountered many difficulties, such as lack of food and water, harsh weather conditions, and encounters with hostile Indians.\n\n15. Where did you first settle when you arrived in Saskatchewan?\nFirst in Regina, then in Prince Albert.\n\n16. Where did you settle or take up land?\nHomestead in 1901.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nPrince Albert, homestead, Regina, Prince Albert, Saskatchewan, Prince Albert, Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nTeaching for a few months in families' homes, then in Prince Albert, farming.\n19. How often did you write to relatives or friends in your old home?\n   Monthly.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Mr. Ethel Thrall, November 26, 1901\n    at Muskawat, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    [Handwritten text not legible]\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    In horseback, 1901 to 1912, wagons, hauling grain + freight, walking in the woods, 65 miles longest journey.\n    Also by car, neighbors' horses.\n29. How often did you write to relatives or friends in your old home?\n\n30. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation to go there?\n\n22. If other members of your family (parents, children, siblings, etc.) came west, tell us when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For instance, attending church, visiting friends, etc.)\n\nIn his own words, he wrote:\n\n\"I was in Poveshull, Saskatchewan, from 1901 to 1912, and then I moved to Regina, Saskatchewan, where I worked as a miner.\"\n\nChurch in neighboring town.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No.\n\n27. Where was your trading center? How far from your home?\n   Prairie Settlement, 66 miles, by 1906.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   CPR from Saskatoon to P. a came through in 1906.\n   Minnedosa railroad, 17 miles from farm.\n\n29. How often did you shop in the early days? Twice a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Never.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Eaton's Winnipeg 1901. Clothing & small tools.\n   Small percentage of purchases as above.\n   Little or nothing of late years.\n\n32. When did you first have a telephone and what company provided it?\n   1945? Sask. Tel., ?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Permanently from time family, no indication of leaving at 75.\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and what changes in the proportion of\n\npurchase made by mail order since this time period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon, the first thing was it with the idea of starting\n\npermanently? Or did you make up your mind after trying it out? Why?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nno.\n\n35. Did many people move away during the 1930's? Did many return?\n\nno.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nHelped to organize 1st Grain Growers Club in South River district in 1907.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nno.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nGalena School named after family lived by my family in Annandale. Memphis School named by W.E. Truitt was first settler. Mudmanaw is the Indian word for Truitt. Ethelton named after my wife who was the first child in community. Ministro named from Kinoianse Indians.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\n35. If so, who were these people?\n\n36. If you or anyone in your family have held public office or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or anyone in your family or friends were \"firsts\" to happen or do something in the district, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) date of suggestion; (3) date and reason for change.\n\n39. Give facts of new name as above in (1), (2), (3).\n\n40. Write a short biography of yourself, including your family history.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. \n\n41. What do you think are the most important changes in your community since you first came West? Good roads, general prosperity, increased value of farm lands.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. \n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n37. Questions regarding historical source materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, slides, books of community ephemera, old pamphlets, old photographs, written revolutionary and revolutionary literature?\n\nks.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University in Saskatoon?\n\n(Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here? (Your name, general prosperity, increased value of farms, land, etc.)\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nV. John Eadie, husband, Ro. 65th\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra space if necessary if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n_________________________\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you about your living blank spaces. The answers for your particular family or community may be different from those given by others.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1947, and may have personal experience of the pioneer years whether born in that province or not. If more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Family West 3rd Western Canadian Pioneer Survey\" is still being circulated. If you haven't already answered it, and would be willing to do so now please put a check mark here ( ).\n\nEnd of document.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Bagg FREDERICK JOHNSTONE\n\n2. Your address: Boa. 37, MEGA, SASK.\n\n3. Date: January 16, 1964\n\n4. Where were you born? (Give name of place and country)\n   Handley, Berkshire England\n\n5. What was your father's name and occupation?\n   Big Thomas F. Anglican Clergyman\n\n6. When did you come to Saskatchewan? (Give month and year)\n   June 4, 1893\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Claraville, Manitoba March 26 to June 4, 1893\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Fifteen years old\n\n9. What were your reasons for coming West?\n   To make my own living\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Brothers & Reading\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are unable to write, have someone else do the writing at your dictation.\n\n1. Your full name: Bigg Frederick Johnstone\n\n2. Your address: Box 37, Meota, Sask.\n\n3. Date: January 1st, 1954\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, stating dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming here?\n\nTo make my own living\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nRailroad or government information?\n\n11. Any other comments?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Thought I was foolish.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   Travelled alone.\n\n13. What means of transportation did you use?\n   Dominion Line S.S. Sasqua\n   Intercolonial & C.P. Railways\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   Very uneventful.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   W.M. P. Barracks, Regina.\n\n16. Where did you settle or take up land?\n   Homesteaded in 1901 S.W. 1/4 Section 12\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Prairie Alfred, North, Swift Current, Maple Creek, Tisdale, Yanick\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   First left school prior to emigrating\n   N.W.M.P. June 1898 to June 1901\n   Farmed at Hurkanaux Oct 1901 to Oct 1912\n   Civil Service, Dept. of Interior 1912 to 1931\n   On hand at Yanick 1933 to 1943\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\nThank you for your kind words.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? \n\nTravelled alone.\n\n13. What means of transportation did you use? \n\nCanadian Pacific R.R. & S.S. Service\n\nIndustrials & C.P. Railway\n\n14. Best highlights of the journey? What do you remember? (People you met on the way, meetings with Indians, experiences on the prairies, accidents or other encounters etc.)\n\nVery memorable.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWm. R. Barwick, Regina.\n\n16. Where did you settle or take up land? \n\nHeaded west in 1901 by train.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSwift Current, Bub, Tisdale, Regina.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nJust left school June 6, 1901.\n\nWm. R. June 1896 to June 1901.\n\nFarmed at Buttenauer Oct. 1901 to Oct. 1912.\n\nCame to Regina, Sept. 1912 to 1931.\n\nOn hand at Regina 1933 to 1943.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThought I was foolish.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nTravelled alone.\n\n13. What means of transportation did you use?\nDominion Line S.S. Beaver\nIntercolonial & C.P. Railways\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nVery uneventful.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nH.W.M. P. Barracks, Regina.\n\n16. Where did you settle or take up land?\nHomesteaded in 1901 S.W. 1/4 Section 10.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nPoveshell, Melfort, Swift Current, Maple Creek, Tisdale, Yanick.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nJust left school prior to emigrating.\nH.W.M. P. June 1893 to June 1901.\nFarmer at Miskawana Oct 1901 to Oct 1912.\nCivil Servant, Dept. of Interior 1912 to 1931\nOn hand at Yanick 1933 to 1943.\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   Traveled alone.\n\n13. What means of transportation did you use?\n   Boarded train & C.P. Railway\n\n14. What incidents of the journey best do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   N/A\n\n15. Where did you first stay when you arrived in Saskatoon?\n   Wm. P. Banfield, Regina\n\n16. Where did you settle or take up land?\n   Homesteaded in 1901 & 1902\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Paris, Alberta, Martensville, Swift Current, Moose Jaw\n\n18. How did you earn a living before coming to Western Canada? How about you now?\n   Worked at homestead from 1901 to Oct. 1912,\n   farmed at homestead from 1912 to 1931\n   Civil servant, both federal and provincial\n   On harvest at Yarrow & 1933 & 1943,\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the names of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\nArthur Rovell 1886 at Clawmillian Hamilton\nPortia Henry 1892 at Clawmillian Hamilton\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nGrief deep work. Wash slave quickly in Whiskey to eat a\nloaf of your fortune long will grow to my mind,\nsleep on a hard floor in hotel of you in a muddy\nroad willing to eat for two days.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn N.W.M.R. mostly on horseback, on prairie trails.\n25. When was the first car used in the community? **1911**.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n   **1901 to 1906. Rummel about 65 miles**\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n   **C & R came to Rummel 1906. 17 miles N of Homestead**\n\n29. How often did you shop in the early days?\n\n   **Weekly & Monthly**\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n   **In June 1920**\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n   **Clothing. Small purchases irregular**\n\n32. When did you first have a telephone and what company provided it?\n\n   **June had one**\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n   **Settling permanently**\n25. When was the first car used in the community? 1911.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first hear of Saskatchewan the first time was it with the idea of settling permanently? Or did you make up your mind after trying it out? When did you make that decision?\n\n34. Small purchases + irregular\n\n35. Small purchases + irregular\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nno.\n\n35. Did many people move away during the 1930's? Did many return?\n\nnone.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nGranite Springs Assessor 1891 in Canton River Valley, 1907,\nAnglican Church in 1901.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nhit.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nGateland School was named after family property in\nFriesland, Holland by F.J. Riggs\n\nPort Hope was named by John McCay named it. The PM\nwas W.E. Truill & McCay was the one for Truill\nJohn McCay was local farmer, no changes in name,\nElliot was named after his Riggs by Rev. Thomas Clarke\nAnglican missionary as he was first girl married in the\ndistrict. The name was Elliot Truill\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Have you or any member of your family held public offices or have been active in any organizations? Mention it here, giving dates whenever possible.\n\n36. If you or any member of your family were \"liberated\" to have or do something, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"liberated\" to have or do something, mention it here, giving dates whenever possible.\n\n38. Has the place in your community got their names? (School district, post office, village, railway stations, creeks, hills, etc.) Try to state origin of name, date of establishment, and reason for change.\n\n39. Have you heard of any local person who was named after your town? If so, who was he/she?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n[Handwritten text not legible]\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(3) have any other suggestions regarding their disposition?\n\n40. If you have children or grandchildren, please give their names, where they live\n\n41. That do you think are the most important changes in your community since you\n\nPlease give the name and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\ngive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_546.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 59760, "total-output-tokens": 9343, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1669, 5], [1669, 3689, 6], [3689, 5213, 7], [5213, 5943, 8], [5943, 7397, 9], [7397, 8541, 10], [8541, 9498, 11], [9498, 10301, 12], [10301, 11676, 13], [11676, 12637, 14], [12637, 13960, 15], [13960, 14798, 16], [14798, 15890, 17], [15890, 16990, 18], [16990, 18989, 19], [18989, 19932, 20], [19932, 21203, 21], [21203, 22226, 22], [22226, 23365, 23], [23365, 24443, 24], [24443, 25544, 25], [25544, 26462, 26], [26462, 27132, 27], [27132, 28139, 28], [28139, 29376, 29], [29376, 30197, 30], [30197, 31643, 31], [31643, 32469, 32], [32469, 33528, 33], [33528, 34217, 34], [34217, 34217, 35], [34217, 34371, 36]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]