[{"id": "e06aa1e69139809c67d7fd9d43d7d229342a8b9b", "text": "What did early Canadian pioneers eat?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Laura Wilson Knox\nAddress Valco Ranch\nBirthplace Ontario\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Eastern Canada? April 1927\nWhere did you set up housekeeping? On farm where I now live\nWhere had you been living before that? In Toronto, Ont.\nFor how many people did you prepare meals? The last year for four people\nHow far was it to your nearest store? 2½ miles\nHow often could a visit be made to the store? Every day\nWhat groceries did you usually buy in those earliest years? Staple supplies as soap - salt - sugar - yeast - cake - R. Oats - other cereals - celery - pepper - vinegar\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Maple Leaf mostly\nIn what quantities did you buy it? 42 tons each\nWhat was the usual price per hundred pounds of white flour? About $3.25\nHow much did you use Graham flour? Very little\nWhole wheat flour? About 3 bags per year\nWas flour milled locally? Yes, in the 30's\nHow far away? Not far away\nWhat was the price for a twenty pound bag of rolled oats? About 25 cents\nWhat other grain products did you use?\n\nCornmeal? Yes\nWhole wheat? Yes\nFarina? Yes\nOther? Cream of Wheat, Polenta\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n1920, Knox, Mrs. Wilson\n\nName: Mrs. Wilson\nAge: 75\nOccupation: Homemaker\n\nWhere did you live before this?\nFor how many people did you prepare meals?\nHow far was it to your nearest store?\nHow often could a visit be made to the store?\n\nSupply: sugar, flour, salt, pepper, yeast, vinegar\n\n2. Flour and other grain products\n\nWhat brand of white flour did you use in the early years?\nIn what quantities did you buy?\nWas there a usual price per hundred pounds of flour?\nHow much did you use per meal?\nWas flour milled locally?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal?\nOats?\nDid you grind your own wheat for porridge?\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ... in 10 lb. bags ...\nWhat was the price for a ten pound sack of white sugar? ... 5¢ per lb. ...\nWhat brand of golden corn syrup did you use? ... usually Rogers ...\nWhat size of tin of syrup did you usually buy? ... 1 lb. packs ...\nAt what price? ... about ... 6¢ per pack ...\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ... we always kept our own cows ...\nButter? ... made our own ...\nWhat was the price of butter? ... 15 cents per lb. ...\nDid you keep eggs for winter? ... yes ... how? ... mostly in water jars ...\nDid you make butter? ... yes ... cheese? ... no ...\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ... we had our own - fresh hogs in winter, canned beef and pork & beefing in summer ...\nHow did you get fresh meat? ... 2-3 weeks in summer and as long as it would keep during the winter ...\nHow often did you get fresh meat? ... we have been eating meat up to 20 yrs ...\nHow did you preserve meat? ... in Brine or dry salt up to 22 years ...\nHas there a \"beef ring\" in your neighborhood? ... yes ...\nIf so what year was it organized? ... 1921 ...\nDid you use game? ... no ... What kinds? ...\nFor how long? ...\nWhat part did fish play in the family diet? ... we wanted them ...\nWas the fish fresh, cured, or canned? ... some times we had canned fish ...\nKinds? ... the usual ... fresh water fish such as pickerel - jackfish - mullet etc.\n3. **SERIES OF QUESTIONS**\n\nIn what manner did you get your milk? How much did you pay per quart?\n\nAt what price did you buy your butter? Did you make butter? If so, how much did you make?\n\nDid you make cheese? If so, what kind?\n\n4. **EXTRA INFORMATION**\n\nHow did you get a supply of fresh milk in the early days? What changes have you seen in the methods used for preserving milk?\n\nWhat was the price of butter at that time? Did you make butter? If so, how much?\n\nDid you make cheese? If so, what kind?\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days? How did you get it?\n\nFor how long did you keep it? Did you use any preservatives?\n\nWas there a meat ring in your neighborhood? If so, what year was it organized?\n\nDid you use game? If so, what kind?\n\nFor how long? Did you use fish? If so, what kind?\n\nWas the fish fresh, cured, or smoked?\n\nKinds? \n\nPickled - salted - smoked - etc.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon. At what price? 30¢ per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Price? 40¢ per lb.\n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? About 90¢.\n\nCould you get potatoes at the store? Usually.\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1920 Cabbage 1925 Carrots 1920 Onions 1920\n\nTurnips 1920 Beets 1920\n\nIn what quantities did you buy white navy beans? 5 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 2 lbs. How did the grocer handle prunes (by box)? In boxes.\n\nWhat was the price of prunes? 25¢ per lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nCherries\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Yes. Corn? No. Beans? No. Saskatoons? No.\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1920\n\nWhat year did you first preserve vegetables by canning? 1930\n\nWhat year did you first preserve meat by canning? 1930\n\nDo you still preserve foods by canning or drying? We still can fruit, meat, also chicken & vegetables.\n\nTo what extent? To a large extent, to save trips to locker in town.\n\nDid you make your own vinegar? No.\n6. BEVERAGES\n\nWhat kind of tea did you buy? (Tea, coffee, or both?) \n\nWhat kind of coffee did you buy? (Beans or ground?)\n\nShort answer required.\n\n7. VEGETABLES AND OTHER FRUITS\n\nWhat was the price of potatoes per bushel than the year before?\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1925\n\nCarrots 1924\n\nOnions 1923\n\nCabbage 1925\n\nTurnips 1924\n\nBeets 1924\n\nHow did you buy prunes, (in bulk or by the box)?\n\nThat weight of prunes did you buy?\n\nHow did you buy apples?\n\nThat was the price of apples that year?\n\nWhat other dried fruits did you use in the apple butter days?\n\nApricots, peaches, loganberries, raisins, currants, or others?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by freezing?\n\nPeas? Yes\n\nCorn? Yes\n\nBeans? Yes\n\nSaskatoons? Yes\n\nOther foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nDid you make your own vinegar?\n\nDid you make your own jam?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | all my life                                   |                                                  |                                    | 24c                 |\n| Macaroni              |                                               |                                                  |                                    | 5c                  |\n| Graham flour          |                                               |                                                  |                                    | 10c                 |\n| Brown sugar           |                                               |                                                  |                                    | 5c                  |\n| Molasses              |                                               |                                                  |                                    | 80c                 |\n| Table salt            |                                               |                                                  |                                    | 100c                |\n| Common salt           |                                               |                                                  |                                    |                     |\n| Lily white syrup      |                                               |                                                  |                                    |                     |\n| Toilet soap           | castile                                       |                                                  |                                    |                     |\n| Baking powder         |                                               |                                                  |                                    |                     |\n| Baking soda           |                                               |                                                  |                                    |                     |\n| Dried beans           |                                               |                                                  |                                    |                     |\n| Dried corn            |                                               |                                                  |                                    |                     |\n| Vinegar               |                                               |                                                  |                                    |                     |\n| Raisins - seeded      |                                               |                                                  |                                    |                     |\n|                       | seedless                                       |                                                  |                                    | 5c                  |\n| Rice                  |                                               |                                                  |                                    | 2c                  |\n| Currents              |                                               |                                                  |                                    | Cases 1/2 ctn       |\n| Store jam - kinds?    |                                               |                                                  |                                    |                     |\n| Cheese (Cheddar or store cheese) | | | | small quantities as 1 lb. 2 lbs. |\n| Vanilla               |                                               |                                                  |                                    | 60c 80c             |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cake.\n\nDid you make yeast for your own use? Yes. Using starter? Yes.\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? No.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Item                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | all my life                            | 25¢ lb                      | It's double in price now                       |\n| Canned sardines             |                                        |                              | very cheap - 5 cents per tin - 9 cents now     |\n| Other canned fish that appeared early - give names |                                        |                              |                                                 |\n| Apples - fresh              | as low as 1.50 a crate                 | now 3¢ each                 |                                                |\n|                             | dried                                  | 2 lbs 25¢                    | 30¢ lb                                         |\n| Lettuce                     | didn't notice when                     |                              |                                                |\n| Tomatoes - fresh            | all my life                            | 15¢ lb                      | now as high as 35¢                             |\n|                             | canned                                 | 15¢ can                      | 2¢ lb                                          |\n| Bananas                     | all my life                            | 35¢ doz                      |                                                |\n| Lemons                      |                                        | 30¢                          |                                                |\n| Oranges                     |                                        | 40¢                          |                                                |\n| Cornflakes                  |                                        | 2/25                         |                                                |\n| Other prepared breakfast cereals - five names |                                        |                              |                                                |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       | 30 yrs ago                             | double in price now          |                                                |\n| Nuts                        | 35¢                                   |                              |                                                |\n| Icing sugar                 | 35¢                                   | up a third                   | 2/3 in price                                   |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) **Well** - We have 3 wells - 1 in barn - 1 in yard - 1 in basement.\n\nHow far was this water from your home? **and one in basement**\n\nHow was it brought to the home? (pail, barrel, tank) **left water in barrels**\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nSince 1927 we have water on tap in bathroom upstairs - downstairs & in basement - from soft water system & Crane water pressure system.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (A.M., river, stream, well)\n\nIf so far was this water from your house? (pail, barrel, tank)\n\nHave you had any changes which have taken place since you last started household water use?\n\nSince 1927 we have water on tap in both rooms upstairs.\n\nDownstairs in basement - from loft water system.\n\n*Chase water pressure system.*\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bath —…………………\n\nIf you made your own, did you use lye? Yes… good ashes……………\n\nWhat kinds of laundry soap did the grocer supply? White Pearl—Sunlight & Prog—also gold soap.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal, wood, kerosene, wood, heat.\n\nWhere did you get your fuel? Sometimes bought from someone, sometimes from the woods.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nFuel used now are much the same as when I started housekeeping except that for the past 25 years we have had electric light and power for washing & cleaning—also all water & fuel inside.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Kitchen Range………………\n\nDid you use an outdoor fireplace or bake oven? (Give dates) Mud………………\n\nBy whom was your first cook stove made? Mrs. Johnson………………\n\nWhat year was it purchased? 1915………………Price? $25.00………………\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) None………………\n\nBut what, an iron kettle or pot belonging to my grandmother which is about 150 years old—\n\nFor preparing food? (china, earthenware, wooden bowls, other) ………………\n\nWhen did you first see enamel ware? Ever since I first came back in 1916.\n\nAluminum? Yes………………\n13. SIMPLER\nDid you have any trouble doing any of these things? If so, what was it?\n\n14. FULL\nThat fuel did you use in the past? (Coal, wood, oil, gas, etc.)\n\n15. FUEL\nPoveshull, Green, or other?\n\n16. FUEL\nFuel used now are mixed. The same as when I started.\n\n17. FUEL\nHave had electric heat and proper fan blowing a cleaning also all water & fuel meals.\n\n18. FUEL\nPer cooking, did you use an outdoor fireplace or open hearth? In the coldest days? (Old wives)\n\n19. FUEL\nDid you use an outdoor fireplace or inside oven? (Give dates)\n\n20. FUEL\nBy whom was your first cook stove made? Price\n\n21. FUEL\nWhat year was it purchased? (Give date)\n\n22. FUEL\nType brand name of stove? (Iron, copper, tin, household)\n\n23. FUEL\nWhen did you first use central heating? (Electric, hot water, steam, other)\n\n24. FUEL\nWhen did you first use central water? (Electric, hot water, steam, other)\n\n25. FUEL\nWhen did you first use central water? (Electric, hot water, steam, other)\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nThings have been rather up to date when I first came west. If we were in Ontario where we bought hard, butter, syrup & molasses, etc., in bulk—taking our own jug for butter & having the former served to us on wooden \"butter dishes\" made in local mill—\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nIn early years even after I came west folks wanted potatoes & meat for breakfast—but have changed over—perhaps about 15 or 20 yrs ago. Breakfast & \"juice or fruit—Cereal—Toast & bacon or eggs—or both and in most cases—coffee.\"\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nIn those days we didn't always have turkey—just chicken—I had no folks in this province so had my husband's father & mother—aged 63 & 53—his three brothers & three sisters aged 35-33, 27-26, 22 & 16 yrs. Also his brothers-in-law aged 32 & —one sister-in-law age 26—\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nIn 1934-'34 we had complete crop failures and with five children to clothe & feed the situation was very grim—One evening all we had for supper was a stew made from a little bit of cabbage & carrot the hoppers had missed in the garden. Our potato crop was 3/4 less—so I told my husband we would have to apply for relief lest the little ones starve—He applied but had to wait a month for application to be accepted—in the mean time we scurried along but it was mighty hard to manage.\n17. Give a typical start's meal (breakfast, dinner & supper) for the militant\n    family. You can remember. Give the names of the members of the militant\n    family. Write their ages at the time. State the approximate income\n    or resources.\n\nIn early years after marriage we ate fairly\nwarranted foodstuffs - meat, fish, bread, butter,\neggs, milk, sugar, tea, coffee, etc.\n\nIn more recent years we had\nmore limited diets - meat, fish, bread, butter,\neggs, milk, sugar, tea, coffee, etc.\n\n18. What was your first Christian church? Name it.\n\nFirst Church - Baptist\n\n19. Have you ever resided in almost starvation level living on one or two\n    locally produced foods? Give details.\n\nIn 1934, if we had completed our facilities and what\nfive children to clothe & feed the situation was very grim -\none evening all we had for supper was a potato made from\na little bit of cabbage & carrots. We looked hard toward our\nhusband for a word of comfort. He applied for relief but the\nlittle ones starved - he applied but said it would be\napplication to be accepted - in the mean time we scurried\nalong but it was mighty hard to manage\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWe don't seem to eat as hearty now as in the old days and the preparation of meals is a lot simpler than they used to be.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nIt is the other way round now for we are less dependent on purchased foods than ever before—it is true we buy our bread and butter while we ship our cream but we can still make bread and butter—can fruit & our own vegetables & meat as well as use a quick freeze locker in town.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI'm afraid I'm a generation too late in giving you the details. Nearly pioneer days as the country was quite well established with railway-cars, stores etc when I came—It was my husband's people who settled here in 1909 who could give the details of hauling produce by supplies from Moose Jaw in all kinds of weather—If you wish—at a later date—I could obtain considerable local early history for you.\n\nMrs Wilson Knox.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWe don't seem to eat as hearty now as in the old days and the preparation of meals is a lot simpler than they used to be.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nIt is the other way round now for we are less dependent on purchased foods than ever before—it is true we buy our bread and butter while we ship our cream but we can still make bread and butter—can plant & our own vegetables & meat as well as use a quick freeze locker in town.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI'm afraid I'm a generation too late in giving you the details. Nearly pioneer days as the country was quite well established with railway cars, stores etc when I came—It was my husband's people who settled here in 1909 who could give the details of hauling produce to & supplies from Moose Jaw in all kinds of weather—If you wish—at a later date—I could obtain considerable local early history for you.\n\nMrs Wilson Ains.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1918_355.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5756, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1482, 3], [1482, 2181, 4], [2181, 3672, 5], [3672, 4576, 6], [4576, 5988, 7], [5988, 7127, 8], [7127, 11586, 9], [11586, 11586, 10], [11586, 15487, 11], [15487, 15883, 12], [15883, 17289, 13], [17289, 18248, 14], [18248, 20146, 15], [20146, 21273, 16], [21273, 22693, 17], [22693, 24115, 18], [24115, 24251, 19], [24251, 24405, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]