[{"id": "365f91bc343116de3af1f3c567f562b980187675", "text": "S-X2\n413. McLellan Margaret (Mrs. Peter)\nRegina Normal Bouvenir, 1902, pp. 103, donated by Mrs. P. McLeellan, has been removed from this file and deposited in the Regina Office of the Archives of Saskatchewan.\n1.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. MARGARET MCLELLAN\n\n2. Your address: ARCOLA, SASKATCHEWAN\n\n3. Date: SEPTEMBER 1952\n\n4. Where were you born? (Give name of place and country) I was born in Brussels, Ontario in the county of Huron.\n\n5. What was your father's name and occupation? Thomas Hislop; he was a farmer. We had fifty acres of land and one half miles south of Brussels.\n\n6. When did you come to Saskatchewan? (Give month and year) We came to the North West Territories on April 11th 1885.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. We came direct from Brussels to the Moose Mountain district coming by C.P.R. to Moosomin and then by horse and wagon from there to our homestead.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) I was nineteen years old. I was born on December 29th 1865 at Brussels where my parents lived after their marriage in 1860.\n\n9. What were your reasons for coming West? My father's brother had a lot of sons and I had three brothers all younger than myself. The older men thought it best for the younger to establish themselves on farms. Western Canada offered that opportunity. One Uncle came to Manitoba shortly before while another had gone to Kansas with his larger family and yet another to North Dakota the same time we came to Saskatchewan. The small farms around us were becoming congested and if one wanted to farm it was better to migrate somewhere. Possibly the adventurous spirit had little to do with it too. We heard a great deal about the wonders of these places. Just why my father chose western Canada instead of Kansas I don't know unless he wanted to stay under the British flag which I knew full well.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Mostly other people talking about it and from people who had been out and come back to Ontario. My father came out in 1882, homesteaded and then came back for us. We sold everything by auction sale but the horses and cattle we took to the west and my uncle rented the land until it was sold a few years after.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name MRS. MARGARET MCLELLAN\n\n2. Your address - ACOOLA, SASKATCHEWAN\n\n3. Date - SEPTEMBER 14TH, 1952\n\n4. Where were You born? (Give name of place and country) I was born in Moose Jaw, Ontario in the county of Huron.\n\n5. What was your father's name and occupation? Thomas Hislop he was a farmer. He had thirty acres of land and one half mile frontage or fourteen.\n\n6. When did you come to Saskatchewan? (Give month and year) We came to the North West Territories on April 11th, 1883.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. We came direct from Moose Jaw to the Moose Mountain district, first coming by C.P.R. to Moose Jaw and then by horse and wagon from there to our homestead.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer if it is impossible to give an exact age.)\n\n9. What were your reasons for coming West? By 1883 a brother had a lot of store in Western Canada offered that opportunity to the younger men. The older men thought it best for the younger to establish themselves on farms in Western Canada.\n\n10. How many children did you have? I have five children.\n\n11. What kind of work did you do? I worked on the farm around us and were becoming organized and one wanted to live in the city. We heard a great deal about changes I don't know where he wanted to stay under the British flag which I knew I will.\n\n12. In the early days many people preferred to stay under the British flag because they realized about it and railroad or government information. Monthly other people talking about it and from people who had been out and come back to Ontario. My father came out in 1882, however, and cattle took to the west and my wife raised the Lord until it stood off a few years after.\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very good idea. My sister would not come with us as she was teaching. Both she and her fiancé came out the next summer and were married at home this was the first wedding in this part of the country; In the Moose Mountain district so far as we can learn. I had been going to school up to this time and had done nothing away from home for myself so came with the family.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My parents and three younger brothers were with me.\n\n13. What means of transportation did you use? We came out on the new C.P.R. railroad to Moosomin and unloaded our settler's effects car and from there we used horses to draw our furniture and implements. Mother rode on the wagon but we children ran along beside the wagon and drove the cows and played around as we came slowly along.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) There was nothing unusual about our trek in. We stayed at Greenbank's all night, that was the stopping place, and Mrs. Greenbanks made beds for us in our own little hut but we had a comfortable sleep. There were several others inside our family bedded down for the night. Mother, unable to sleep got up when she heard Mrs. Greenbanks moving around. The men had hung their wet clothes on a line over the kitchen stove to dry. Mrs. Greenbanks made a huge pot of rolled oats porridge and left the lid off mother going around the kitchen shortly after the porridge was boiling saw one of these heavy knitted socks fall in. Mrs. Greenbanks fished out the sock and stirred up the porridge. At breakfast mother drank tea and took bread and a boiled egg. We children and father tucked in a goodly supply of porridge and enjoyed it. Mother told us afterwards. We reached our farm about sunset that day, we had our food for the summer with us.\n\n15. Where did you first stay when you arrived in Saskatchewan? Father had been out in the spring of 1882 and he and a nephew and cousins had built log house, or rather hut as it had only one room so the house did us until they built the house that summer getting logs from the Moose Mountains and using concrete as there was lots of gravel in the little prairie creek near by. This house is still standing and is occupied by the youngest son. My youngest brother. It is still in good repair and is about as large as the house we thought it small at the time.\n\n16. Where did you settle or take up land? In range 4 township 8 west of the second meridian. My father, his brother and three nephews had taken homesteads in 1882 round here. The brother went back to Ontario.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We have lived no other place even when I married my husband had land in township 8 range 4 and I only moved half a mile.\n\n18. How did you earn a living before coming to Western Canada? How after you came? My father and brothers farmed there was no school for my teenage brothers to go to so they had to learn what they did at home. I went to Manitoba and taught school for two summers before I married and then the first summer I was married both my husband and myself taught school. I walked to the school near by and he rode horseback to his some eight or ten miles distant. No it would not be 8 miles away about six. I walked a mile the other direction. I was the first teacher in our school my husband's school had been opened the summer before the name of the teacher before him was Melissa Jefferson and the name of the school was Buffalo Head. This was the first school for miles and miles until ours, Clare, opened in 1887. Buffalo Head opened in 1886.\n21. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very good idea. My sister would not come with us as she was teaching. Both she and her fiancé came out in the fall of 1949.\n\nAugust 4th, 1949, we were married at home. This was the first wedding in the town of Buffalo, going so easy with the help of the church and the community.\n\n12. Did you travel by yourself or with a family (family, friends or other group)? My parents and three younger sisters were with me.\n\n13. What name of transportation did you use? We came out on the CPR train.\n\n14. What incidents of the journey best do you remember? People you met on the way, meetings with Indians, accidents or other events etc., etc., that were interesting, pleasant, amusing about our trek. We stayed at Greenbank's place all night, that was the only place we could find. There were several others beside our family bedded down there for the night. Mother made a big pot of soup for dinner and let it boil over the fire. She cooked some bread and butter and a boiled egg. We children played around the house and drove the cows and played around the house a lovely afternoon.\n\n15. Where did you first stay when you arrived in Saskatchewan? Father had been out in the spring of 1948 and he and a relative had built a log house but rather put as it had only one room. The house burned down until they built another house with lots of gravel. In the little prairie creek nearby, it is still there.\n\n16. Where did you settle or take up homestead? By the river, his brother and three nephews had taken homesteads. We have lived in the same place ever since coming to Saskatchewan.\n\n17. Mention any other places where you lived. We have lived no other places except when I married my husband in January 1950.\n\n18. How did you earn a living before coming to Western Canada? How often you went to school? My father and brothers farmed there was no school for teenagers. Brother taught school for two summers before I married and then myself taught school near by and I rode horseback to school each day. It was the first teacher in our school before he became principal. After I had graduated from high school, I worked on the farm before I married. Since then I have worked on the farm until today.\n\n19. Any other comments?\n19. How often did you write to relatives or friends in your old home?\n   Quite often, possibly every two weeks. My sister living in Ont. I would write\n   to her and to other school friends which I still write to, or at least the ones still\n   living.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage. PEER McCLELLAN December 29th 1886. We were married in my\n    father's house by Rev. Goudie who was the Presbyterian minister at that time.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle? My father went home to Ontario and brought out my sister and her\n    husband and three small daughters and settled them on a farm five miles distant.\n    My sister was not strong and he thought the change of climate would do her good.\n    She died in 1892.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record? The birth of my five children is the\n    outstanding thing in my life. No doctor no nurse yet no one died. A neighbour\n    woman would come and stay with me a week or two until I got around again.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    For the first three or four years the church service was held in our home. We often went\n    visiting had to dances. We went in sleigh loads and had heaps of jolly fun too.\n    We would gather up young folk as we went along until we had several in the sleigh.\n    We went ten miles or perhaps more once or twice.\n19. How often did you write to relatives or friends in your old home?\n\nQuite often, especially every two weeks. My sisters living in Ont., I would write to her and to other school friends which I still visited.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nTHOMAS MCLELLAN, December 23rd, 1866. We were married in my father's house by Rev. Gaudie who was the Presbyterian minister at that time.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It is a place to settle?\n\nMy father went home to Ontario and brought out my sister and her husband and three small daughters and settled them on a farm five miles distant.\n\nMy sister was not strong and she thought the change of climate would do her good.\n\nShe died in 1892.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe birth of my five children is the thing in my life. No doctor no nurse yet; no one died. A neighbour came each end stay with me a week of two until I got around again.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\nFor the first three or four years the church service was held in our house. We often visited and danced. We went in sleigh loads and had heaps of jolly fun too.\n\nWe went up to see Mr. McLeod, young Billy McLeod, until we had several in the sleigh.\n25. When was the first car used in the community?\n   If you were to take a vote most people would say 1912. I don't think any one is exactly sure or who owned it is another bone of contention for years.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   My brother owned one in 1914 but there were many around by then.\n\n27. Where was your trading center? How far from your home?\n   When we were in first Moosomin was for a while then J.G. Turriff opened a general store along with the post office in 1884. Moosomin was 70 miles from our farm, Carlyle was twelve miles. My father was postmaster for Clare at\n\n28. Did you continue to trade there? (Indicate any changes due to new town appearing, better means of travel, etc.)\n   was opened shortly after the one at Carlyle for the western homesteaders. People mostly walked to our place on Saturday or Sunday for their mail. It was brought from Moosomin to Carlyle and then on up to our place once a week. The odd homesteader had a horse and buggy, some brought the heavy team and wagon. Of course the young men rode horseback a lot. Father kept this until a third post office was opened, Arcola. This was about six miles or half way between Carlyle and Clare. This was opened in Feb. 1889.\n\nThere was so little mail coming to the office then that my father would not bother with it and they moved it two miles east, where it could serve more people.\n\n29. How often did you shop in the early days?\n   Whenever the neighbors went to Carlyle we sent for food and father went possible once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? The C.P.R. came in to our district in the fall of 1900 and we went there for supplies. It was not until after we had a car that everyone met in town on Saturday night.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFather and mother used to send to the Hudson Bay Co. once a year for winter supplies. I was married quite a while before I heard of Eaton's. I remember about 1903 or 4 that we sent to Scotland for drygoods and ready made clothing and got good results. Lovely clothes for our children.\n\nNo we never sent huge orders to Eaton's as some people did. My husband had a sister who sent us clothing for the winter. She lived in Stratford Ontario and seemed to enjoy packing us warm things for the winter. When the railway came in we mostly bought supplies there in the town of Arcola.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came to stay and never thought of returning to Ontario. So we all went back for visits a few years later as we got the money to travel.\n\nWe enjoyed the life and would not exchange it for another --- they are still the best days of my life, our pioneer ones.\n25. If you were to take a vote now people would say 1912 I don't think any one else exactly sure or who owned it is another none of contention for years.\n\n26. If you could own one in 1914 but there were many around by then.\n\n27. Where was your trading centre? How far from your home?\n\n28. Did you ever go to school? If so how long did you attend?\n\n29. Did you ever go to church? If so what denomination?\n\n30. What kind of articles did you buy from your local store?\n\n31. What kind of articles did you buy through the mail order catalogue?\n\n32. When did you first have a telephone?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? We all went back for visits a few years later and we gave the money to travel. We enjoyed the life and would not exchange it for another --- they are still the best days of my life, our pioneer ones.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe have no photographs worth while and lots of memories are now in a scribbler which my daughter has taken material from for a number of stories. The Leader-Post, Regina has published many of them.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. I have five children all living at Arcola, ten grandchildren, and three great grandchildren not in the west. I do not know why you should wish to have their names. However here the names of the three great grandsons:\n\nStephen Cox aged nine, Port Arthur, Patric Irvine, age 5 Toronto and Christopher Vogel, age 5, Regina.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nmother too wonder what to say here.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. There is only one woman and I left of the people who came into this district as adults in 1883 living, of course there are many who came as children.\n\nYou might send Mr. W. T Hislop a questionnaire if you have not already his name. Arcola is the address.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nI have typed this for my mother if there are more details or help she might give you I should indeed enjoy sending them to you.\n\nJeanette McLellan\n6. Questions regarding historical source materials:\n\n39. Do you have any photographs or other materials that you would like to donate to the Provincial Archives? If so, please provide details.\n\n40. Would you be willing to lend them to the Provincial Archives for display?\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nThere is only one person who could answer this questionnaire.\n\nI have typed this for my mother if there are any more details or help she might give you I should immediately notify her.\n\nJeanette McLellan\n\n[Signature]\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_413.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 5566, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 41, 4], [41, 41, 5], [41, 210, 6], [210, 2824, 7], [2824, 4925, 8], [4925, 8801, 9], [8801, 11138, 10], [11138, 12918, 11], [12918, 14497, 12], [14497, 17711, 13], [17711, 18637, 14], [18637, 20624, 15], [20624, 21304, 16], [21304, 21440, 17], [21440, 21594, 18]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]