[{"id": "cd703ca9b3a120950ec9a52929bd1da497c6ec06", "text": "Name: MARTIN Duesterbeck\nAddress: DANIA\nBirthplace: HABERDORF, GERMANY\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start homesteading in Northern Canada? 1897\nWhere did you meet up homesteading? Dewey, Bessarabia, Russia\nWhere had you been living before that? Russia\nHow many people did you propose besides? 14\nHow far was it to your nearest store? 14 miles\nHow often could a visit be made to the store? Once every few weeks\nWhat provisions did you usually buy in those earliest years?\nFlour, sugar, coffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? 4 X flour\nIn what quantities did you buy it? 300 lbs\nWhat was the usual price per hundred pounds of white flour? $1.50\nHow much did you use Graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away was it? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use?\nCornmeal\nWheat Flour\nBarley\nOther:\nDid you grind your own wheat for porridge? Yes\nHow did you grind it?\nDear Mr. Haberhauer,\n\nI am writing to express my gratitude for your recent donation of $150 to our local charity. Your generosity has made a significant impact on our community, allowing us to provide much-needed assistance to those in need.\n\nThank you for your kindness and support. We look forward to working together again in the future.\n\nSincerely,\n\n[Your Name]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? by 25 cents.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nMy own cows.\n\nButter? Own cows.\n\nThat was the price of butter?\n\nDid you keep eggs for winter?\n\nDid you make butter?\n\nDid you make cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n2.\n\n3. SUGAR AND SPICES\n\nIn what quantity did you buy? How much did you pay?\n\nWhat was the price for a ten pound sack of coffee beans?\n\nThat brand of flour was very good. Did you buy it?\n\nThat size of tin at that price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you keep cows?\n\nThat was the price of butter?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. SELF-HELP\n\nHow often did you get fresh meat?\n\nWas there a meat \"ring\" in your neighborhood?\n\nIf so, what was it organized?\n\nDid you use games?\n\nFor how long?\n\nThat part of town had a fish market.\n\nWas the fish fresh, canned, or smoked?\n\nKind of?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) Beans. ..........\nPrice? $2.50. That other beverages were used? .......................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes.\nIf not, where from? From someone else. For my own seed.\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1891. Cabbages 1891. Carrots 1891. Onions 1891.\nTurnips 1891. Beets 1891.\n\nIn what quantities did you buy white navy beans? 5 cwt.\nHow did you buy prunes, (in bulk or by the box)? By the box.\nWhat weight? 2 lbs. How did the grocer handle prunes (by box)? ...\nWhat was the price of prunes? ...........\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? Dried apples.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ............\npeas? Yes. corn? ........ beans? Yes. Saskatoons? ...........\nother foods? ................................................................\n\nThat year did you first preserve fruit by canning? .....................\nThat year did you first preserve vegetables by canning? .............\nThat year did you first preserve meat by canning? .....................\nDo you still preserve foods by canning or drying? Yes.\nTo what extent? Not very much.\nDid you make your own vinegar? ...........................................\n5. Beverages:\n   - What kind of tea did you buy? (Oleana or round) Oleana.\n   - At what price?\n   - What kind of coffee did you buy? (Oleana or round) Oleana.\n   - At what price?\n   - What other beverages were used?\n\n6. Vegetables and Fruits:\n   - What was the price of potatoes per bushel then you got up housekeeping?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes\n     - Cabbages\n     - Carrots\n     - Onions\n   - Turnips\n   - Beets\n   - In what quantities did you buy white navy beans?\n   - How did you buy grapes? (In bulk or by the box)?\n   - What weight?\n   - How did the grocer handle grapes (by box)?\n   - What was the price of prunes?\n   - What other dried fruits did you use in the earliest days? (apricots, peaches, loganberries, raisins, currants or other)\n   - Did apples\n\n7. Preserving:\n   - In the early years did you preserve any foods by air? Air.\n   - Beans?\n   - Sustatooms?\n   - Other foods?\n   - That year did you first preserve fruits by canning?\n   - That year did you first preserve vegetables by canning?\n   - Do you still preserve foods by canning or drying?\n   - To that extent?\n   - Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lbs. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                    |                     |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           | 1910                                          | any amt., 1 lb.                                   |                                    |                     |\n| Molasses              |                                               |                                                   |                                    |                     |\n| Table salt            | 1889                                          | any amt., 5 lbs.                                  |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      |                                               |                                                   |                                    |                     |\n| Toilet soap           | 1889                                          | bars, cakes                                       |                                    |                     |\n| Baking powder         | 1889                                          | tin                                               |                                    |                     |\n| Baking soda           | 1889                                          |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               |                                               |                                                   |                                    |                     |\n| Raisins - seeded      |                                               |                                                   |                                    |                     |\n|                      |                                               | seedless                                          |                                    |                     |\n| Rice                  |                                               |                                                   |                                    |                     |\n| Currants              |                                               |                                                   |                                    |                     |\n| Store jam - kinds?    |                                               |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                   |                                    |                     |\n\nMost of these groceries we couldn't afford to buy so don't know the prices.\n\n10. BAKING\n\nWhat type of yeast did you use? ...........................................\n\nDid you make yeast for your own use? .......................................\n\nUsing hops? .......................................................... Salt rising? ......................................................\n\nDid you buy baking powder? ........................................... Baking soda? ............................................\n\nCream of tartar? ........................................... Did you make your own baking powder?\n\n..........................................................\nSoda biscuits\nTartaric acid\nOrchard flour\nBrown sugar\nMolasses\nTable salt\nCayenne pepper\nLily white flour\nDutch cocoa\nToilet soap\nBaking powder\nFermenting soda\nDelicate eggs\nVinegar\nRaisins - seedless\nRice\nCurrants\nStore Jan - March?\nChoose (Cheddar) or store cheese\nVanilla\n\n10. BAKING\nWhat type of yeast did you use? cake yeast (Royal Yeast)\nDid you make yeast for your own use? Yes\nUsing starter? Yes\nUsing hops? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? No\nCream of tartar? No\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWSING FOR THE REST OF THE ITEMS:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | Not all fit differ from the same prod at 60-62? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                 |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appear early - give names |                                        |                               |                                                 |\n| Apples - fresh              | 1905 or p                             |                               |                                                 |\n|                             | fried                                 | 1889                          |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                 |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Ulimoto tapioca             |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout) ...........................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the house? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1904 I had a well dug on my farm 24 ft deep.\nI will buy my farm.\n\nIn 1906 I will buy my farm.\n\n24 feet deep.\n13. SOAP\n\nDid you buy laundry soap or make your own? Made and own.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? David Monroe.\n\nWhere did you get your fuel? From the prairie.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1902 started to burn some wood hauled by oxen from bush at Edenvold which was 1/2 mile from my farm. It was got by the polls and cut with a buck saw by hand.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Open fireplace 1889.\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased? 1889. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron all from Old Country.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China.\n\nWhat did you first see enamel ware? 1889, but never used it.\n\nAluminum?\n\nRemarks of fireplace. We built it in the house with bricks made out of mud. We had a stove but couldn't use it on account of no wood for fuel.\n13. Did you buy laundry soap or make your own? \n\n14. Tell me about your daily routine.\n\nIn 1912 started to burn some wood \nwhich was 1/2 mile from my farm. This \nwood by the barrel only cost $1.50 a bushel \nand by the pound.\n\n15. How much did you pay for fuel?\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake over an open fire? (Give dates)\n\nWhat was your first cook stove model?\n\nLast year was it purchased? \n\nWhat types of utensils did you use? (Iron, copper, tin, homestead) \n\nFor preparing food? (Pots, kettles, wooden bowls, other)\n\nWhen did you first see charcoal?\n\nAluminum?\n\nRemakes of fireplace. We built it in the \nhouse until bricks could be laid. It was \nnot until we had a stove that we could \nuse wood for fuel.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nNot much difference now just fancy new and more secure.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Coffee and bread.\nDinner: Water knepfla and slice of bread.\nSupper: Coffee, maybe potatoes and bread.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nWe always had bread to eat and some other little item to keep going.\nNot much difference now, just fancy new and more secure.\n\nBreakfast: Coffee and bread.\n\nDinner: White meatballs and chili beef.\n\nSupper: Coffee, maybe potatoes and fried.\n\n18. What year did you observe your first Christmas dinner in Eastern Canada?\n\n19. Have you ever witnessed or experienced starvation level living in any of our towns?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThe store and we can afford to get what we want.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAlways grew my own vegetables and raised my own meat until retired.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nIn 1889 and on there were lots of groceries to buy if one had the money but most of us didn't.\n20. Mention any outstanding difficulties in the preparation of meals in the\ncurrent year as compared to last year.\n\nThe time and we can afford to get\nwhat we want.\n\n21. When did you begin to roll on your own (or to store food instead\nof buying from local stores)? (If possible)\n\nAlways put my own vegetables and avoid\nanyone's until I tried.\n\n22. Please add other details from your early experiences of border crossings\nand securing food in other ways (for example, here in Northern Canada).\n\nIn 1889 when we were late for\ngoing to buy if we had the money\nbut most of the time.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1889_33.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4406, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1037, 5], [1037, 1403, 6], [1403, 2229, 7], [2229, 2872, 8], [2872, 4423, 9], [4423, 5671, 10], [5671, 10523, 11], [10523, 11065, 12], [11065, 14932, 13], [14932, 14996, 14], [14996, 16269, 15], [16269, 17085, 16], [17085, 18010, 17], [18010, 18348, 18], [18348, 19160, 19], [19160, 19738, 20], [19738, 19738, 21], [19738, 19738, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]