[{"id": "fa9174f904bbec083fad08459d02b157580c6c13", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the patron answering the questionnaires.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. Robert Golder Wood\n2. Your address .................................................. Winston Hotel, Melfort, Sask.\n3. Date .................................................. July 7, 1854\n4. Where were you born? (Give name of place and country) .................................................. 32 Avenue Road, Toronto, Ont.\n   in Edinburgh, Scotland\n5. What was your father's name and occupation? .................................................. John Wood, Commercial Traveller.\n6. When did you come to Saskatchewan? (Give month and Year) .................................................. At the beginning of April 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .................................................. When I was about a year old my parents moved to Glasgow, Scotland, where we lived about ten years. We then moved to Dundee where we lived till my brother and I immigrated to Canada. While in Dundee I was a pupil at the Harris Academy there.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) .................................................. I was sixteen years old.\n9. What were your reasons for coming West? .................................................. At that time (in the 1890s) a great many of the young people of the British Islands were thinking of emigrating. The old land was getting crowded and stories were coming through about the fine opportunities in the colonies, and particularly in Canada, where a quarter section of good land could be got free by performing certain duties.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) .................................................. My father, in the course of business, knew a merchant in Bath, Scotland, who had a son in the Oak Lake district of Manitoba, Canada. This son was about to strike out for himself and take up a homestead somewhere in the Prince Albert district. Then a part of the North West Territories. My brother and I decided to follow his lead and settle in this district also. Also at that time Clifford Hilton was doing his best to attract settlers to the West and had put on a strong advertising campaign showing how a man could, without land (if he worked) become prosperous and independent in a short time. The quarter section of land, seven free, was, of course, almost mathematical certainty, played quite a strong part too. Now for three hopes were realized in the story of the West for the next twenty years. According to the story (quite ignored by Hilton) had something to say about it in the form of nature (quite ignored by Hilton), also low prices - 35¢ per barrel for wheat and drought, dust, frost also hail, also low prices - 35¢ per barrel for wheat and drought.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRCIE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and community) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and Year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child then.\") ...............................................................\n9. What were your reasons for coming West? ...............................................................\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ...............................................................\n\n[Signature]\n\n[Date]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI believe they thought it rather risky as we were so young. I was sixteen years old and my brother seventeen.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe travelled by ourselves but knew another person on the boat we sailed on, the \"Sardinian,\" this being Rev. John McKean, Methodist minister at Moose Jaw and formerly a missionary among the Indians in the West.\n\n13. What means of transportation did you use?\n\nWe sailed on the \"Sardinian\" from Liverpool to Quebec. Then from Quebec to Prince Albert by train via Regina. Went from Prince Albert to the Stoney Creek district - as it was then called (now Melrose district) by team and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nDuring the sea voyage the Rev. John McKean, previously mentioned, prevailed on us to visit the Moose Jaw district before we went north to Prince Albert. There were lots of homesteads available in that district then and he thought we might decide to settle there. We therefore went on through Regina to Moose Jaw, then a village. One look by us at this country was enough. Not a tree nor even a shrub to be seen anywhere. Nothing but prairie and not even nothing, after one night in moose jaw we went back to Regina and continued our journey north from there to Prince Albert. Here we were joined by the young man whose lead we were following and who had already been out to the Stoney Creek district locating homesteads for himself and his brother. My brother, being only 17 years old, was too young to homestead but the rule was waived in his case as the boat was anxious to get settlers. We at Prince Albert were advised to take a team and wagon and also supplies and the three of us started off. We bought a team and wagon, and also supplies and the three of us started off. Stoney Creek eighty miles away by the nearest road - 60 miles by the present railway. Among our supplies we had a pair of oxen, which had been sold, and some time about April 10th, 1892, we arrived at my brother's homestead - the NE¼ of sec 28 - um 19 - w2 - located this time and established ourselves.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe never arrived in Saskatchewan, we arrived in Prince Albert about April 5th, 1892 but Prince Albert was then situated in the North West Territorial and it was not until 1895 - thirteen year later, that the Province of Saskatchewan was formed. On our arrival in Prince Albert we stayed at the Belland Hotel, run by David Pelletier.\n\n16. Where did you settle or take up land?\n\nWe settled on my brother's homestead - the NE¼ of sec 28 - um 19 - w2, about 90 miles southwest of Prince Albert.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAt Melrose (which was founded in 1904 - twelve years after I arrived in Canada), at Kinistino, Northern Regina, Medicine Hat, Calgary, Toronto, Aldershot Camp, N.S., and Quebec.\n\nAlso since coming to Canada in 1892, I have made three trips overseas - two of them to Britain and Europe and one (in 1953) to Britain, Europe and the Near East.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nSee separate sheets enclosed.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nSee separate sheets enclosed.\n19. How often did you write to relatives or friends in your old home?\n\nGenerally once a week. But this schedule was interrupted mid-winter for a month or about two months when the railway line between Regina and Prince Albert was completely snowed up and no mail passed through.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nGry D. Fox were married at the Methodist Church, Melville, Sask., on Dec. 1st, 1915.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nThree of my cousins in Scotland followed us out—James Leslie, now of Orillia, Ontario, Mr. Walter Mansell, now of Winnipeg, Man., and Mrs. Graham, now somewhere north of Prince Albert, Sask.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nSee separate sheet enclosed.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nSee separate sheets enclosed.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSee separate sheet enclosed.\n19. How often did you write to relatives or friends in your old home?\n\nGenerally once a week. But this schedule was interrupted by my work in the army. This was completed in June 1945.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJames Robert, married at the Methodist Church, on Dec. 1, 1915.\n\n21. Did anyone else come to Saskatoon because of your recommendation as a place to settle?\n\nYes, my cousins in Scotland followed us out—\n\nJames Robert, now residing in Saskatoon, and Walter Macdonald, now residing in Regina.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nSee separate sheet enclosed.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nSee separate sheet enclosed.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSee separate sheet enclosed.\n25. When was the first car used in the community?\n   I believe about the year 1917. It was owned by John Hatton, a liveryman, was painted a bright red and made a noise like a threshing machine.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Did not own me then\n\n27. Where was your trading center? How far from your home?\n   At a place called Pilot Springs, about twelve miles distant and with no trails. Used to ride there for supplies. Our main trading center was near Albert, approximately nine miles distant on the way to trail and with the South Saskatchewan River nearby.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   My brothers and I traded at these points till we had finished homesteading. After that my brother Will and I were away for about six years. When we returned to town, Melfort had been started. (It was started in 1904).\n\n29. How often did you shop in the early days?\n   As rarely as possible. Maybe once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Cannot say. No town here at first.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Never bought through the mail order catalogues at any time that I can recall.\n\n32. When did you first have a telephone and what company provided it?\n   Cannot recall the year that telephone was installed in Melfort. Would be between years 1906 and 1910. Was owned at first by Mr. McFerran.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel abroad?\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Sundays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. Permanent or temporary? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI cannot recall any settlers moving away from the Melfort district prior to 1914. And very few after that until about 1950 when a number of them, having by that time become independent, retired to the coast and are there now.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSo far as I know no settlers moved away from here during the 1930's. A number of settlers came in during that period from the drought stricken areas of southern Saskatchewan and Alberta. I remember talking to one of them and he told me about his well built up section of land he had left in the south. Said he could not raise any crops etc. in the drought.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSee separate sheet enclosed.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI was the first one to break land in that part of the Stoney Creek country later called Pleasant Valley. I did this breaking thirty acres on my brother's homestead the NE¼ Sec. 28-14-19-1901 in the summer of 1892 with a team of white oxen, the largest team I have ever seen. I was sixteen years old at the time. My brother and I raised oats on this land in the spring of 1893, doing the sowing broadcast in the old fashioned way. There was a good crop.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSee separate sheets enclosed.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSee separate sheet enclosed.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and composition of person making suggestion (2) date of its adoption (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSee separate sheets enclosed.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNo. I have had them but have no idea where they are now. Have moved around a lot.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have two sons - Frederick Golder Wood, who lives in Melville, Saskatchewan, and Dr. Robert Wakefield Wood, now Senior Intern at Sunnybrook Hospital, Toronto. I have a daughter, Agnes Dorothy, now Mrs. L.S. Langford, who lives in Toronto. She has a daughter, Dorothy Elizabeth Langford, (my grand daughter) who is still an infant.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSee separate sheet enclosed.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nNo. I have had them there have no idea where they are now. Have moved around a lot.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have two sons - Francis Golder and Robert Golder who both work in the city of Regina. They are married and have families.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nSee separate sheet enclosed.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nQuestion 18\n\nI was not long our of school - The Harris Academy in Dundee, Scotland - when my brother and I decided to emigrate. On our arrival in Canada my brother took up a homestead and we lived three years on this homesteaded (SE¼ 9 sec.32-43-19-w2) and we put in three years together on this land till I got my title deed. There being nothing in farming then owing to low prices and the distance we had to go to market (160 miles round trip to Prince Albert and back) we both decided to try something else.\n\nI read up for a Teachers examination during my last year on the homestead, succeeded in passing my examination (held at Prince Albert) and got a Permit to teach. My first school was Rossell situated about eight miles east of my homestead - a seven months school. My salary was $35.00 per month.\n\nThe following winter I attended Normal School at Regina - a no Penrett being our teacher - and got a Teacher's Certificate. The spring of that year (1899) I became Teacher of the Country school of Kinsington - a seven month school succeeding the normal. A.S. Shadd who had taught it the previous year. Board my salary at this school was $45.00 per month.\nQuestion 18\n\nI was not long out of school - the Harris Academy in Dundee, Scotland - when my brother and I decided to emigrate. On our arrival in Canada my brother took up a homestead and we lived three years on this homesteaded (Sec. 9 TEC. 32-43-19-112) and we put in three years to settle on this land till I got my title deed. There being nothing in farming then owing to low prices and the distance we had to go to market (160 miles round trip to Prince Albert and back) we both decided to try something else.\n\nI read up for a Teachers examination during my last year on the homestead, succeeded in passing my examination (held at Prince Albert) and got a Permit to teach. My first school was Roswell situated about eight miles east of my homestead - a seven months school. My salary was $35 per month.\n\nThe following winter I attended Normal School at Regina - a Mr. Bennett being our teacher - and got a Teacher's Certificate. The spring of that year (1899) I became teacher of the Country school of Kimisimo - a seven month school succeeding the noted Mr. A.S. Shadd who had taught at the previous year.\n\nMy salary at this school was $45 per month. Board\nand lodging however at the Chas. Brown farm a mile\nand a half away was only $10 per month so it was\nnot so bad. (In fact I saved most of my salary and\ninvested it in land scrip at 75¢ per acre. This land\nI sold six years afterwards at $10 per acre and so\nmade a very good thing out of my season's work.)\n\nOne interesting thing I recall in connection with\nthis school. The school inspectors who inspected it\nthat year were James Alexander Calder who afterwards\nbecame Minister of Education for the Province of\nSaskatchewan and was at one time Deputy Premier.\n\nFurther to this - on the retirement of Premier Scott in\n1916 Mr. Calder was offered the Premiership but declined\nit. He became a member of the Dominion Cabinet at\nOttawa in 1917 as Minister of Immigration and President\nof the Privy Council. In 1921 he was appointed a\nmember of the Senate.\n\nIt is my recollection that the evening following\nthe inspection of my school I met Mr. Elder at the\nhome of Mr. Fred Myers, a prominent settler in the\ndistrict, and that we three had a very pleasant\nevening together. Mr. Myers was at that time a\nmember of the Council of the North West Territories\n(I think under Macdonald) which non-things in the\nwest till the Provinces of Saskatchewan and Alberta\nwere formed.\nand lodging however at the Chas. Bowles farm a mile\nand a half away was only $10 per month so it was\nnot so bad. (In fact I saved most of my salary and\ninvested it in land scrips at 75¢ per acre. This land\nI sold six years afterwards at $10 per acre and so\nmade a very good thing out of my season's work.)\n\nOne interesting thing I wrote in connection with\nthis school. The School Inspector who inspected it\nthat year was James Alexander Dallas who afterwards\nbecame Minister of Education for the Province of\nSaskatchewan and was at one time Deputy Premier.\n\nFurther to this - on the retirement of Premier Scott in\n1916 Mr. Dallas was offered the Premiership but declined\nit. He became a member of the Dominion Cabinet at\nOttawa in 1917 as Minister of Immigration and President\nof the Privy Council. In 1921 he was appointed a\nmember of the Senate.\n\nIt is my recollection that the evening following\nthe inspection of my school I met Mr. Dallas at the\nhome of Mr. Fred Myers, a prominent settler in the\ndistrict, and that we three had a very pleasant\nevening together. Mr. Myers was at that time a\nmember of the Council of the North West Territories\n(think under Manitoba) which now changed its name\nto the Provinces of Saskatchewan and Alberta\nwere formed.\nThe writer following I did chores on my father's rented farm (where he ran a small store) and the next spring (Spring of 1900) I went to the town of Rothenburg and got what work I could at rough carpentering, digging cellars, etc. The pay never varied.\n\nIt was $5 per hour - so for a ten-hour day - and you had to work for it. For about two months that fall I drove the team for a lumber company, unloading cars on the track and delivering lumber round town.\n\nThe pay was still $1.50 per day but it was a twelve-hour day as the team had to be looked after. This team (a heavy one) was finally taken away to work in the bush during the winter. There were no more jobs available as all building construction in the town had stopped for the season, it being then about the middle of November. I therefore bought a buck saw and for over two weeks sawed stove wood from dawn to dark at the rear of different houses.\n\nIn this job I was paid by the cord and I had usually to work till well after dark to make up my living wage $7.50. By this time it was December and getting very cold. Just then I met a man named Bob Galloway who wanted to go into the bush at Red Rock - about\nThe writer following I did chores on my father's rented farm (where he ran a small store) and the next spring (starting in 1900) I went to the town of Rothen and got what work I could at rough carpentering, digging cellars, etc. The pay never varied.\n\nIt was $5 per hour - $5 for a ten-hour day - and you had to work for it. For about two months that fall I drove the team for a lumber company, unloading logs on the track and delivering lumber around town.\n\nThe pay was still $5 per day but it was a twelve-hour day as the team had to be looked after. This team (a heavy one) was finally taken away to work in the bush during the winter. There were no more jobs available as all building construction in the town had stopped for the season, it being then about the middle of November. I therefore bought a buck saw and for over two weeks sawed stove wood from dawn to dark at the rear of different houses.\n\nIn this job I was paid by the cord and I had usually to work till well after dark to make up my living wage $1.00. By this time it was December and getting very cold. Just then I met a man named Bob Pelloway who wanted to go into the bush at Reddeck - about\nTwenty miles north of Roscher - and get out two car loads of cordwood. We needed another man and I took the job. We drove to an abandoned lumber camp two miles out of Balluck - taking half a load of hay with us - and our first job was to build a small log shack. This we did in one day, all complete and chinked with moss. We had a small tin stove with us and when this had been set up were quite comfortable. The horses lay put in a broken down stable. In two weeks we had cut a carload of tamarack cordwood and a car load of pine. Our greatest trouble was with the pine which was rather knotty and had to be split and for days we were sawing our axes at each end of a cordwood stick. Temperature a good part of the time was about 30° below zero.\n\nI got paid off here and made my way north to Prince Albert and from there to Macdonald's camp, about 145 miles or more north of Prince Albert. Where I spent the winter. Wages were low and after working very hard all winter I came out in the spring with only $10. But I never felt better in my life.\n\nMy next move was to Madeleine Hat where I got a job with the Can. Pacific Railway as an elevator.\nTwenty miles north of Roschen - and get out two car loads of cordwood. We needed another man and I took the job. We drove to an abandoned lumber camp two miles out of Reddick - taking half a load of them with us - and our first job was to build a small log shack. This we did in one day, all complete and chinked with moss. We had a small tin stove with us and when this had been set up were quite comfortable. The horses lay put in a broken down stable. In two weeks we had built a shelter, but present trouble was with the prime. There was rather knotty and had to be split and for days we were sawing our axes at each end of a cordwood stick. Temperature a good part of the time was about 30° below zero.\n\nI got paid off here and made my way north to Prince Albert and from there to Macdonald's camp, about 145 miles or more north of Prince Albert. Where I spent the winter. Wages were low and after working very hard all winter I came out in the spring with only $10. But I never felt better in my life.\n\nMy next move was to Medicine Hat where I got a job with the Can. Pacific Railway as an checker.\nQuestion 18 Continued\n\nand baggage men at the station there. Loading that\nluggage was sometimes quite a job. Wages were\n$50 per month and the hours never less than\ntwelve and sometimes fourteen hours a day. This\nwas perhaps the hardest job I ever had in my life\nand I got thin on it.\n\nAfter some months I finally succeeded\nin getting a job with the C.P.R. as time keeper on\none of their extra gangs. This extra gang - under a\nboss named Ysewede - kept part of the track in\nrepair between Medicine Hat and Calgary and there\nwere generally about one hundred and twenty-five\nmen in it. The men were mostly South Europeans\n(Czechs, Poles and Australians) these being brought\nout under the immigration policy of Sir Clifford Sifton\nin force at that time. And it is pretty well known\nthat it was largely through that policy that the Canadian\nPacific railway was built and finally completed. It\nsupplied most of the necessary labor.\n\nThis gang I now worked with would be located\nat different points of the line during the season.\nAmong the places I recall are - Strathmore, Suffield,\nBassano and Namaqua. Here was not even a\nsettlement among them at that time but there\nQuestion 18 continued\n\nand baggage men at the station there. Loading that\nbaggage was sometimes quite a job. Wages were\n$50 per month and the hours never less than\ntwelve and sometimes fourteen hours a day. This\nwas perhaps the hardest job I ever had in my life\nand I got this on it.\n\nAfter some months I finally succeeded\nin getting a job with the CPR as time keeper on\none of their extra gangs. This was gang under a\nloco named Tweedle-Dee (part of the track in\nrepair between Medicine Hat and Calgary and there\nwere generally about one hundred and twenty-five\nmen in it. The men were mostly South Europeans\n(Czechs, Poles and Australians) these being brought\nout under the immigration policy of Sir Clifford Sifton\nin force at that time. And it is pretty well known\nthat it was largely through their policy that the Canadian\nPacific Railway was built and finally completed. It\nsupplied most of the necessary labor.\n\nThis gang I now worked with would be located\nat different points of the line during the season.\nAmong the places I recall are - Strathmore, Suffield,\nBassano and Namaqua. There was not even a\nsection house among them at that time but there\nmust have been.\nQuestion 18 continued\n\nwas a dem under construction near Batson.\n\nI would like to say a word here about Bill Tweedle, the boss of this extra gang. He was a very rugged individualist, seventy years old, a six-footer and his hair still black as a crow. He was quite illiterate but knew everything about the repair of track, building a railroad switch, etc. When the gang would be slowing out along the track tamping ties and other work he and I would sit on a rail and discuss things in general. One day, from a chance remark I made, the question came up as to the shape of the earth. When I made the statement that the earth was round a look of incredulity came over his face and he flatly disbelieved it. From that time the battle was on and we had many a terrific argument about it. Sample Question by Tweedle - If the earth is round, as you say, how is it that the people on the other side of the earth don't drop off into space? No, of course, never heard of the laws of gravity. And so the fight raged on all their summer. But it was no use and I never could convince Tweedle that the earth was round. I got to be very fond of the old man and I count him as one of the friends I have known.\nQuestion 18 continued\n\nwas a dam under construction near Bassano.\n\nI would like to say a word here about Bill\n\nGreeley, the boss of this extra gang. He was a very\n\nrugged individual, seventy years old, a six-footer\n\nand his hair still black as a crow. He was quite\n\nilliterate but knew everything about the repair of\n\ntrack, building a railroad switch, etc. When the\n\ngang would be stringing out along the track tamping\n\nties and other work he and I would sit on a rail\n\nand discuss things in general. One day, from a chance\n\nremark I made the question came up as to the shape\n\nof the earth. When I made the statement that the\n\nearth was round a look of incredulity came over his\n\nface and he flatly disbelieved it. From that time the\n\nbattle was on and we had many a terrific argument\n\nabout it. Sample: Question by Trumble - if the earth is\n\nround, as you say, how is it that the people on the\n\nother side of the earth don't drop off into space. /No\n\nnot, of course, never heard of the law of gravity.\n\nAnd so the fight raged on all their summer. By it\n\nwas no use and I never could convince my brother\n\nthe earth was round. I got to be very fond of the\n\nold man and I count him as one of the persons\n\nI have known.\nIt was during this summer that the C.P.R. bridge at Calgary broke in the middle during a heavy flood and all trains were held up for nearly two weeks. Our gang was sent up there and was put on the job of transferring baggage across the bridge by trucks - ten men pushing each loaded truck - and so making some transportation possible. The roar of the flood was incessant and the bridge was liable to go out any minute. Travellers walked over it at their own risk. That was easily the worst flood I have ever seen.\n\nI worked at this job 9 times keeping on the extra gang for five years during the spring, summer and fall. In the winter I worked in the Redwater office at Medicine Hat, the Roadmaster during that time being James Norner.\n\nOn the fifth year (1905) our extra gang had the job of changing a good part of the track between Medicine Hat and Calgary from 56 lb. to 80 lb. steel - a much heavier rail - and for this job the C.P.R. got in a gang of Italians from Montreal. They were better fitted for this type of work than the usual Rind Europeans we had always had. Everything went until the cold weather came about the end of\nIt was during this summer that the C.P.R. bridge at Calgary broke in the middle during a heavy flood and all trains were held up for nearly two weeks. Our gang was sent up there and was put on the job of transferring baggage across the bridge by trucks - ten men pushing each loaded truck - and something some transportation impossible. The roar of the flood was incessant and the bridge was liable to go out any minute. Travellers walked over it at their own risk. That was easily the worst flood I have ever seen.\n\nI worked at this job quite a time keeping on the extra gang for five years during the spring, summer and fall. In the winter I worked in the Roadmaster's office at Macleod's Hotel, the Roadmaster during that time being James Norman.\n\nIn the fifth year (1905) our extra gang had the job of changing a good part of the track between Macleod's Hotel and Calgary from 36 lb. to 80 lb. steel - a much heavier rail - and for this job the C.P.R. got in a gang of stations from Montreal. They were better fitted for this type of work than we could find Europeans we had always had. Everything went until the cold weather came along the end of...\nQuestion 18 continued\n\nOctober. Then the gang wanted to go back to Montreal but the job had to be finished and the Company would not let them go. The following five weeks were rather hectic. Our boss was a man named Marchen and there were two sub-bosses and myself, the time keeper.\n\nHe gave us boxes in one boxcar for sleeping purposes and used to barricade the doors every night. Also we each got good revolvers accepting the second boss - Hanson, a Dane - who already had one.\n\nAnd as a further precaution we kept a plentiful supply of Hemmings' Three Star brandy on hand. Every morning before going out we would each take a good stiff drink of this new and then could go out and face any thing. Here was only one serious casualty - this being the unfortunate Italian interpreter - who had to spend three or four months in a Redemeer Mat hospital. The gang, for some reason, had got the idea that he was double crossing them. In five weeks more we had finished the job of charging steel and were very glad to be rid of that lot.\n\nI was spending my money as fast as I made it and was not getting on. So, late in 1905, after the job of time keeping for that season was finished, I made my way home to my original stomping ground.\nQuestion 18 continued\n\nOctober. Then the gang wanted to go back to Montreal but the job had to be finished and the Company would not let them go. The following two weeks were rather hectic. Our boss was a man named Marchen and there were two sub bosses and myself, the time keeper.\n\nWe moved into one house for sleeping purposes and used to barricade the doors every night. Also we each got good revolvers accepting the second boss - Hanson, a Dane who already had one.\n\nAnd as a further precaution we kept a plentiful supply of Hennessey's three star ready on hand. Every morning before going out we would each take a good stiff drink of this nay and then could go out and face anything. There was only one serious casualty - this being the unfortunate Italian interpreter who had to spend three or four months in a Medicine Hat hospital. The gang, for some reason, had got the idea that he was double crossing them. In five weeks more we had finished the job of changing steel and were very glad to be rid of that lot.\n\nI was spending my money as fast as I made it and was not getting on. So, late in 1905, after the job? Time keeping for that season was finished, I made my way home to my original stomping ground.\nQuestion 18 continued\n\nin Pleasant Valley. The town of Melvour had been started there two years previously and I made my way there, living with my mother at her farm about one mile south of the town. The following year (1906) I went into business - Real Estate and Insurance - with Mr. Reginald Beatty, a former Hudson Bay Company man and their Agent at the Pas for several years, had settled in the eastern part of the Stoney Creek district in the year 1884 and was our earliest settler. He may well have been one of the first White men to know that there was gold in not then Manitoba and Saskatchewan. In fact, while he was stationed here (at the Pas)\n\nsometime in the seventies that an Indian came to the Post to trade and showed him a small piece of ore very rich in gold that he had found up north somewhere. As it was of no value to the Indian he gave it to Mr. Beatty and he (Mr. Beatty) later had it assayed in Toronto. It yielded sufficient gold to make a small watch charm. Ever after that Mr. Beatty was of the firm opinion that there was gold in the North and later on his opinion was fully justified. He had of course at that time no idea of the vast supplies of copper and other minerals\nQuestion 18 continued\n\nin Pleasant Valley. The town of Melvour had been started three years previously and I made my way there, living with my mother at her farm about one mile south of the town. The following year (1906) I went into business - Real Estate and Insurance - with Mr. Reynolds Beauty, Mr. Beauty, a former Hudson Bay Company man and their Agent at the Pas for several years, had settled in the eastern part of the Stoney Creek district in the year 1884 and was our earliest settler. He may well have been one of the first white men to know that there was gold in northern Manitoba and Saskatchewan. In fact, while he was stationed here (at the Pas) sometime in the seventies that an Indian came to the Post to trade and showed him a small piece of ore very rich in gold that he had found up north somewhere. As it was of no value to the Indian he gave it to Mr. Beauty and he (Mr. Beauty) later had it assayed in Toronto. It yielded sufficient gold to make a small watch chain. Even after that Mr. Beauty was not the firm opinion that there was gold in the North and later on his opinion was fully justified. He had of course at that time no idea of the vast supplies of copper and other minerals.\nQuestion 18 continued\n\nThat were there as well.\n\nMr. Beatty and I, having formed our partnership,\n\ntotal booked our office on the C.N.R. right of way in\n\ntown. We were land agents for the C.N.R. in the\n\ndistrict (and their lands were considerable.) We\n\nnamed the firm \"Beatty and Wood\" and this partnership\n\nlasted till the death of Mr. Beatty in 1928. There\n\nwere only two breaks in this period - one when I\n\nmade a five months trip to Britain and France in\n\n1913 and again when I enlisted in the Royal Artillery\n\nin the year 1917 and was away for a year.\n\nAfter Mr. Beatty's death I carried on alone\n\nunder the name of Wood Agencies and at this time\n\nI moved the office from the C.N.R. right of way\n\nto Main Street. The business grew and prospered\n\nand finally in the year 1949, having reached the\n\nage of seventy-three, I sold out to J. Wesley Chipperfield,\n\na grandson of one of our earliest settlers.\n\nSince then I have travelled considerably. I\n\nmade a six month trip to Britain and Europe in\n\n1950 and again in 1953 I made another six months\n\ntrip in which I covered Britain, many parts of\n\nEurope and also the Near East (including Egypt).\n\nAlso during this trip I saw the Coronation.\nQuestion 18 continued\n\nthat were there as well.\n\nMr. Beatty and I, having formed our partnership,\n\nestablished our office on the C.N.R. right of way in\n\ntown. We were land agents for the C.N.R. in the\n\ndistrict (and their lands were considerable.) We\n\nnamed the firm \"Beatty and Wood\" and this partnership\n\nlasted till the death of Mr. Beatty in 1928. There\n\nwere only two branches in this period - one when I\n\nmade a five months trip to Britain and France in\n\nthe year 1917 and was away for a year.\n\nAfter Mr. Beatty's death I carried on alone\n\nunder the name of Wood Agencies and at this time\n\nI moved the office from the C.N.R. right of way\n\nto Main Street. The business grew and prospered\n\nand finally in the year 1949, having reached the\n\nage of seventy-three, I sold out to my eldest son\n\na grandson of one of our earlier settlers.\n\nSince then I have travelled considerably. I\n\nmade a six month trip to Britain and Europe in\n\n1950 and again in 1953 I made another six month\n\ntrip in which I covered Britain, many parts of\n\nEurope and also the Near East (including Egypt).\n\nAlso during this trip I saw the Coronation.\nMy younger brother, James Golder Wood, came out from Dundee, Scotland, and joined us on my brother Will's homestead in the summer of 1894. He was then thirteen years of age. He enlisted in the Great War, though by that time had a wife and four children, was seriously wounded at the Battle of Passchendaele in 1917 and died of his wounds some years later.\n\nMy mother, Agnes Young Wood, and my sister, Agnes Margaret Wood, came out from Dundee, Scotland and joined us on my homestead (Sec. 6-43-19-w2) in June 1896. My sister was then just four years old.\n\nMy father, John Wood, and my aunt, Catherine Brown, came out from Dundee, Scotland and joined us in the summer of 1897 and later my father homesteaded the Sec. 6-45-18-w2.\n\nIn December 1900 he died on this homestead and was buried there on a spot picked out by himself previous to his death, there being no cemetery in the district at that time. Later on, when a cemetery was started, we took up his body and buried it there in a family plot.\nQuestion 22\n\nMy younger brother, James Golder Wood, came out from Dundee, Scotland, and joined us on my brother Will's homestead in the summer of 1894. He was then thirteen years of age. He enlisted in the First Spear unit, though by that time had a wife and four children, was seriously wounded at the battle of Passchendaele in 1917 and died of his wounds some years later.\n\nMy mother, Agnes Young Wood, and my sisters, Agnes Margaret Wood, came out from Dundee, Scotland and joined us on my homestead (SE 67) Sec. 32-43-19-4W2 in June 1896. My sisters were then just four years old.\n\nMy father, John Wood, and my aunt Catherine Brown came out from Dundee, Scotland and joined us in the summer of 1897 and took my father's homestead the same year (Sec. 6-45-18-4W2).\n\nIn December 1900 he died on this homestead and was buried there on a spot picked out by himself previous to his death, there being no cemetery in the district at that time. Later on, when a cemetery was started, we took up his body and buried it there in a family plot.\nIn the fall of the year 1899, having finished a season of teaching at Kinistino School, I was helping to do chores on my father's rented farm on which he had a small store. My father at that time owned a herd of cattle numbering about one hundred and ten head. As they were getting scarce in the vicinity, my brother Jim had started a ranch at Beaver River, about fourteen miles east of the store, and during the summer and fall of 1899 he had been erecting the necessary buildings on it and putting up hay. The herd of cattle had also been taken out there so that they could be kept under observation. That whole country was at that time a wilderness and with only two squatters in it - two brothers named McDonald.\n\nAbout the end of September, just as things were getting in shape on the ranch, the whole band of cattle disappeared and the most intense searching failed to locate them. The search was finally halted till the first snowfall should come so that we could track them. That fall (that of 1899) was a very fine one and it kept fairly mild up till New Year. Then we had our first snowfall - about five\nIn the fall of the year 1899, having finished a season of teaching at Minisink School, I was helping to do chores on my father's rented farm on which he had a small store. My father at that time owned a herd of cattle numbering about one hundred and ten head. As they were getting scarce in the vicinity my brother had started a store, and during the summer and fall of 1899 he had been erecting the necessary buildings on it and putting up hay. The herd of cattle had also been taken out there so that they could be kept under observation. That whole country was at that time a wilderness and with only two squatters on it - two brothers named McDonald.\n\nAbout the end of September, just as things were getting in shape on the ranch, the whole band of cattle disappeared and the most intense searching failed to locate them. The search was finally halted till the first snowfall should come so that we could track them. That fall (that of 1899) was a very fine one and it kept fairly mild until New Year. Then we had our first snowfall - about five\nIn the fall of the year 1899, having finished a season of teaching at Kinistino School, I was helping to do chores on my father's rented farm on which he had a small store. My father at that time owned a herd of cattle numbering about one hundred and ten head. As they were getting scarce in the vicinity, my brother Jim had started a ranch at Kezner River, about fourteen miles east of the store, and during the summer and fall of 1899 he had been erecting the necessary buildings on it and putting up hay. The land of cattle had also been taken out there so that they could be kept under observation. That whole country was at that time a wilderness and with only two squatters in it - two brothers named McDonald.\n\nAbout the end of September, just as things were getting in shape on the ranch, the whole band of cattle disappeared and the most intense searching failed to locate them. The search was finally halted till the first snowfall should come so that we could track them. That fall (that of 1899) was a very fine one and it kept fairly mild until New Year. Then we had our first snowfall - about five inches.\nIn the fall of the year 1899, having finished a season of teaching at Trinity Trio School, I was helping to do chores on my father's rented farm on which he had a small store. My father at that time owned a herd of cattle numbering about one hundred and ten head. As they were getting scarce in the vicinity, my brother Jim had started a ranch at Keatley River, about fourteen miles east of the store, and during the summer and fall of 1899 he had been erecting the necessary buildings on it and putting up hay. The land of cattle had also been taken out there so that they could be kept under observation. That whole country was at that time a wilderness and was only two brothers on it - two brothers named McDonald.\n\nAbout the end of September, just as things were getting in shape on the ranch, the whole band of cattle disappeared and the most intense searching failed to locate them. The search was finally halted till the first snowfall should come so that we could track them. That fall (that of 1899) was a very fine one and it fairly mild until New Year. Then we had our first snowfall - about five\nQuestion 23 continued\n\ninches—and my brother Jim and I decided that it was time to renew the search for the cattle. Preparations were made and my mother cooked enough food to do us for a week. The weather had continued mild up till then but the day before we had planned to start it turned very cold. As everything was ready however we decided to go anyway and, in spite of the morning of our departure being colder still, we started off. We took a good team of horses, a sleigh, a deep wagon box, oats for the horses and, best of all, a good riding horse—a stallion named \"Nipper\"—and it was this riding horse that, I believe, eventually saved our lives—as the story will show.\n\nStarting out on a morning of the first week in January we got to the Carrot River that night, a distance of about fifteen miles, and camped there. We lit a good fire, had our supper, and then went to sleep—or tried to sleep—in the wagon box. We spent a very cold night you may be sure and never camped that way again. The next day we made another fifteen miles or so, going northeasterly along the course of the Carrot River and this day one of us rode Nipper and ranged far and wide.\nQuestion 23 continued\n\ninches - and my brother Jim and I decided that it was time to renew the search for the cattle.\n\nPreparations were made and my mother cooked enough food to do us for a week. The weather had continued mild until then but the day before we had planned to start it turned very cold. So anyway and, in spite of the meaning of our departure being colder still, we started off. We took a good team of horses, a sleigh, a deep wagon box, oats for the horses and, best of all, a good riding horse - a stallion named \"Tripper\" - And it was this riding horse that, I believe, eventually saved our lives - or the story will show.\n\nStarting out on a morning of the first week in January we got to the Carrot River that night, a distance of about fifteen miles, and camped there. We lit a good fire, had our supper, and then went to sleep - or tried to sleep - in the wagon box. We spent a very cold night you may be sure and never camped thereafter again. The next day we made another fifteen miles or so, going north-easterly along a course of the Carrot River and this day one of us rode supper and ranged for and wrote\non the east bank. That night we camped in a dry poplar cliff and, profiting by our experience of the night before, we turned the deep wagon box on its side, lit a twelve foot fire in front of it and took three or four shifts of sleeping there, the one on duty piling wood on the fire as needed.\n\nIn this way though the weather was much colder than it had been the previous day, we got through that night without almost trying to reach, as we had the first night. The third day was a repetition of the second. One of us drove the team northerly following in a general way the course of the Carrot River. While the other ranged the country on flapper. But we got no trace of the cattle. The fourth day we kept due some general direction and that night when we camped we estimated we might be forty or forty-five miles from home.\n\nThe weather had been getting steadily colder since we left home and on the morning of the fifth day we decided we had gone as far as we could with the team. However we decided we would make one last cast with the riding horse.\non the east bank. That night we camped in a dry poplar bluff and, profiting by our experience of the night before, we turned the deep wagon box on its side, let a twelve foot fire in front of it and took three more shifts of sleeping there, the one on duty piling wood on the fire as needed.\n\nIn this way, though the weather was much colder than it had been the previous day, we got through that night without almost trying to reach as we had the first night. The third day was a repetition of the second. One of us drove the team northerly, following in a general way the course of the Carrot River, while the other ranged the country on flippers. But we got no trace of the cattle. The fourth day we kept to some general direction and that night when we camped we estimated we might be forty or forty-five miles from home.\n\nThe weather had been getting steadily colder since we left home and on the morning of the fifth day we decided we had gone as far as we could with the team. However we decided we would make one last east with the siding horse.\nQuestion 23 continued\n\nand in the grey that morning Jim left on Nipper,\ngoing northeast while I stayed in camp and\nchopped down dry poplar most of the day,\ncutting it into twelve foot lengths. I would say\nthe first camp was about half a mile from the\nriver. It was intensely cold and when darkness\ncame that night and Jim hadn't got back I became\nvery anxious. We had a shotgun with us and\nabout a dozen shells. An hour or so after dark\nI fired a shot and thereafter every half hour or\nthereabouts I would fire another. In that time\nI went through all the emotions of the condemned\nman who was to be executed the next morning -\nfor I had made up my mind that Jim was going\nand I had no intention of going back without\nhim. But about nine o'clock that night Jim\nrode into the camp.\n\nHe had a very remarkable tale to tell over\nthe campfire that night. Travelling northeast\nin the morning for quite a few miles he had\nstumbled on an Indian Camp. (I have reached\nthe conclusion since that it was a camp of Crees\nand that the chief would be Kinistin, a chief\nand in the grey? That morning Jim left on Nipper,\ngoing northeast, while I stayed in camp and\nchopped down dry poplar most of the day,\ncutting it into twelve foot lengths. I would say\nthat our camp was about half a mile from the\nriver. It was intensely cold and when darkness\ncame that night and Jim hadn't got back I became\nvery anxious. We had a carbine with us and\nabout a dozen shells. An hour or so after dark\nI fired a shot and thereafter every half hour or\nthereabouts I would fire another. In that time\nI went through all the emotions of the condemned\nmen who was to be executed the next morning -\nfor I had made up my mind that Jim was going\nand I had no intention of going back without\nhim. But about nine o'clock that night Jim\nrode into the camp.\n\nHe had a very remarkable tale to tell over\nthe campfire that night. Travelling northeast\nin the morning for quite a few miles he had\nstumbled on an Indian Camp. (I have reached\nthe conclusion since that it was a camp of Crees\nand that the chief would be Nimiskin, a chief\nI knew something about it (later deleted). After Jim had explained himself in some way and managed to inform them that he was looking for a land or cattle the Indians, some of whom apparently knew a few words of English, told him that the cattle were safe and were only a few miles from their camp. The absence of snow had helped them and they were coming through alright.\n\nJim did not go any further but let that afternoon took to the bed of the Carrot River heading southwest towards our camp. After travelling slowly for hours and for long after dark he had no idea whether he had passed the camp or was still approaching it. He had his heavy fur coat on and the collar up over his ears and could not hear anything. But suddenly he saw Nipper stick up his ears and knew he must have heard something. Scrambling up the steep bank at the last possible place he gave Nipper his head and the horse walked back about a mile and some distance from the river and finally walked into the camp. He had heard one of my shots in the first place no doubt and had them located the\nI knew something about it (later date). After Jim had explained himself in some way and managed to inform them that he was looking for a band of cattle the Indians, some of whom apparently knew a few words of English, told him that the cattle were safe and were only a few miles from their camp. The absence of snow had helped them and they were coming through alright.\n\nJim did not go any further but late that afternoon took to the bed of the Carrot River heading south west towards own camp. After travelling slowly for hours and for long after dark he had no idea whether he had passed the camp or was still approaching it. He had his heavy gun and on and the collar up over his ears and could not hear anything. But suddenly he saw Nipper stick up his ears and knew he must have heard something. Scrambling up the steep bank at the first possible place he gave Nipper his head and the horse walked back about a mile and some distance from the river and finally walked into the camp. He had heard one of my shots in the last place no doubt and led them located the\nCamp by the smell of the campfire. It was a very tense moment for us both. If Nipper had not heard that shot Jim would have been completely lost and would no doubt have frozen as he had no way of making a fire. You will anticipate here a little and say that the temperature that night, ascertained by us when we finally got home again, was 64° below zero.\n\nThat night Jim became very ill and in the morning I had a sick man on my hands. I knew it was going to be a close thing. My best chance would lie to try and locate the Beaver River ranch which would lie, I thought, about thirty miles south of our camp—and this I decided to try for. Fortunately the sun was shining the next morning or I would have been lost in a very short time so far as seeing south was concerned. With Jim lying in the bottom of the sleigh and almost everything I had piled on top of him I travelled steadily south all that day. There could be no stopping. Darkness came and I then used the stars to guide me. Then on the snow I found...\nCamp by the smell of the campfire. It was a very tense moment for us both. If Nubbler had not heard that shot gun would have been completely lost and would no doubt have frozen as he had no way of making a fire. You will anticipate here a little and say that the temperature that night, entertained by us when we finally got home again, was 64° below zero.\n\nThat night Jim became very ill and in the morning I had a sick man on my hands. I knew it was going to be a close thing. My last chance would be to try and locate the Beaver River ranch which would be, I thought, about thirty miles south of our camp—and this I decided to try for. Fortunately, the sun was shining the next morning or I would have been lost in a very short time so far as seeing myself was concerned.\n\nWith Jim lying on the bottom of the sleigh and almost everything I had piled on top of him I travelled steadily south all that day. There could be no stopping. Darkness came and I then used the stars to guide me. Then on the snow I found\nQuestion 23 continued\n\na faint sleigh trail. Now it had come there I did not know. As it seemed to be going south it might lead to the ranch but I had no idea as to this.\n\nI had to take a chance. Jim was still tying her on the bottom of the wagon box. I put the reins in his hands and told him I was riding ahead but I doubted he understood me. I slung the axe in my belt, swung on rupper and made the race of my life. Ten about two miles, following the faint trail. I rode finally into the yard of the Leather River ranch. I flung myself into one of the open stables and tore into wood chopping for some stove wood, working like a fiend.\n\nThere was a stove in the shack with stovepipe going outside through the wall and protected by some tin. I had a fire nicely going when the team walked into the yard. They had been able to follow the trail in some way though in the dark it was hardly discernible. I dragged Jim out of the wagon box the best way I could, dropped him into the shack in the same way and put him close to the stove. I then started the team and the next night kept the stove\nQuestion 23 continued\n\na faint slough trail. Now it had come there I did not know, as it seemed to be going south or might lead to the ranch but I had no idea as to this.\n\nI had to take a chance. Jim was still tying his horse on the bottom of the wagon box. I put the reins in his hands and told him I was riding ahead but I doubted he understood me. I slung the axe in my belt, swung on rapsers and made the race of my life for about two miles, following the faint trail. I rode finally into the yard of the Leather River ranch. I flung myself into one of the open stables and tore into wood chopping for some stove wood, working like a fiend.\n\nThere was a stove in the shack with stove pipe going outside through the wall and protected by some tin. I had a fire nicely going when the team walked into the yard. They had been able to follow the trail in some way though in the dark it was hardly discernible. I dropped Jim out of the wagon box the best way I could, dragged him into the shack in the same way and put him close to the stove. I then started the team and the next night kept the stove\nQuestion 23 continued\n\na plain straight trail, now it had come time I did not know. As it seemed to be going south it might lead to the ranch but I had no idea as to this.\n\nI need to take a chance. Jim was still tying flat on the bottom of the wagon box. I put the reins in his hands and told him I was riding ahead but I doubted he understood me. I slung the axe in my belt, swung on Tupples and made the race of my life for about two miles, following the plain trail. I rode finally into the yard of the Leather River ranch. I put Tupples into one of the open stables and tore into wood chopping for some stove wood, working like a fiend.\n\nThere was a stove in the shack with stovepipe going outside through the well and protected by some tin. I had a fire nicely going when the team walked into the yard. They had been all to follow the trail in some way though in the dark it was hardly discernible. I dragged Jim out of the wagon box the best way I could, dragged him into the shack in the same way and put him close to the stove. I then started the team and the next night Repr the stove.\nQuestion 23 continued\n\nnot know. As it seemed to be going south it might lead to the ranch but I had no idea as to this.\n\nI need to take a chance. Jim was still tying his horse on the bottom of the wagon box. I put the reins in his hands and told him I was riding ahead.\n\nbut I doubt if he understood me. I slung the axe in my belt, swung on Nipper and made the race of my life. In about two miles, following the Paint Trail, I rode finally into the yard of the Leather River Ranch. I put Nipper into one of the open stables and tore into wood chopping.\n\nFor some stove wood, working like a fiend.\n\nThere was a stove in the shack with stovepipe going outside through the well and protected by some tin. I had a fire nicely going when the team walked into the yard. They had been alla to follow the trail in some way though in the dark it was hardly discernible. I dragged Jim out of the wagon too the best way I could.\n\ndragged him into the shack in the same way and put him close to the stove. I then started the team and the rest of the night. Repr the stove\nQuestion 23 continued\n\nNeither Jim lying propped up beside it and covered\nwith ulan kets, the log shack was unchinked\nand it was naturally impossible to get it warm\n—but you could partly take the chill off and it\nwas heaven compared to the outside. There was no\nsleep that night. In the morning so soon as daylight\nhad appeared and we had had something to eat\nI hitched up the team and Jim, with my help,\nmanaged to stagger to the sleigh. I covered them\nup, tied riper behind and headed west for the\nhome yard that afternoon with Jim still alive\nand would say here that in a few days he was\nalright again. My mother had been almost out\nof her mind. Five settlers, headed by Jim Cameron,\na close friend, had organized a search party\nand would search for the bodies of the\n\"Wood Boys\" as soon as the weather moderated\na little. But none of them ever dreamed they\nwould see us alive again.\n\nHere I can now give the thermometer\nreadings for the six nights we were out, this\nQuestion 23 continued\n\nred hot. Jim lying propped up beside it and covered with clam kets. The log shack was unchinked and it was naturally impossible to get it warm - but you could barely take the chill off and it was heaven compared to the outside. There was no sleep that night. In the morning so soon as daylight had appeared and we had had something to eat I hitched up the team and Jim, with my help, managed to stagger to the sleigh. I covered him up, tied nippers behind and headed west for the remaining fourteen miles home. I drove into the homestead that afternoon with Jim still alive and would say here that in a few days he was alright again. My mother had been almost out of her mind. Five settlers, headed by Jim Cameron, a close friend, had organized a search party and would \"search for the bodies of the wood boys\" as soon as the weather moderated a little. But none of them ever dreamed they would see us alive again.\n\nHere I can now give the thermometer readings for the six nights we were out, this\nas given by neighbors in the settlement. The first night in bed up the Carrot River - 30° below zero. The second, third and fourth nights from 35 below to 60° below zero. The fifth and sixth nights 64° below zero.\n\nThe sequel to all this happened about a month afterwards when the weather had considerably moderated. Then my brother Jim, accompanied by a settler named Jack Beddome, rode to the Indian encampment. Jim had discovered and found the cattle a few miles away on the Red River Ranch. Out of the one hundred and ten head only one cow was lost and so my father escaped what would have been a serious financial loss.\nQuestion 23 continued\n\nas given by neighbors in the settlement. The first night in bed up the Carrot River - 30° below zero. The second, third and fourth nights from 35 below to 60° below zero. The fifth and sixth nights 64° below zero.\n\nThe sequel to all this happened about a month afterwards when the weather had considerably moderated. Then my brother Jim, accompanied by a settler named Jack Beddome, rode to the Indian encampment. Jim had discovered and found the cattle a few miles away on the Red River Ranch. They then drove them back to the Red River Ranch. Out of the one hundred and ten head only one cow was lost and so my father suspected what would have been a serious financial loss.\nQuestion 24\n\nAfter getting my title for my homestead in 1898 I had to concentrate on making a living. School teaching answered for two seasons.\n\nAfter that travelled from Stoney Creek to the Rocky Mountains trying to hit in somewhere. I travelled generally by train. These were hard times and a man had to take what he could get. (See my answer to Question No. 18).\nQuestion 24\n\nAfter getting my title for my homestead in 1898 I had to concentrate on making a bare living. School teaching answered for two seasons.\n\nAfter that I traveled from Stoney Creek to the Rocky Mountains trying to get in somewhere. I traveled generally by train. These were hard times and a man had to take what he could get. (See my answer to Question No. 18).\nQuestion 36\n\nI was a member of the Lady Minto Hospital Board at Melport from 1907. When the hospital was built, in 1949 when it became a Union Hospital, a period of 42 years. I was absent for a period of one year during that time - from March 1917. Then I enlisted, to March 1918.\n\nI was a member of the Melport High School Board for several years, the final year being 1935. A.R. Babington, Editor of the Melport Moon, was our Chairman.\n\nI was also Secretary-Treasurer of the Melport Board of Trade for several years at a time. When we were trying to get the C.P.R. into Melport as a competing line to the C.N.R., that would be about the year 1909 to 1912. We sent out several delegations at that time - one to Ottawa - and were eventually successful in getting in the C.P.R. These delegations were costly and in order to cover the annual Board of Trade fees at that time was $25.00. We had a strong membership. The main driving force was our President, Harold P. Dawson, who was in the grain business and head of an elevator company.\nQuestion 36\n\nI was a member of the Lady Minto Hospital Board at Melkior from 1907 when the hospital was built to 1949 when it became a Union Hospital, a period of 42 years. I was absent for a period of one year during that time - from March 1917 when I enlisted, to March 1918.\n\nI was a member of the Melkior High School Board for several years, the final year being 1935. A.R. Belington, Editor of the Melkior Moon, was our chairman.\n\nI was also Secretary-Treasurer of the Melkior Board of Trade for several years at a time. Then we were trying to get an O.P.R. into Melkior as a competing line to the C.N.R. That would be about the year 1909 to 1912. We sent out several delegations at that time - one to Ottawa - and were eventually successful in getting in the C.P.R. These delegations were costly and in order to cover the annual Board expenses at that time was $25. We had a strong membership. The main driving force was our President Harold G. Dawson, who was in the grain business and head of an elevator company.\nQuestion 37\n\nIf you or any of your family or friends ever \"visit\" to have or do something in the district mention it here. Swing dates wherever possible.\n\nI was the first one to break land in that part of the Stoney Creek country later called Okanagan Valley. I did this breaking - 30 acres - on my brothers homestead - the NE¼ 9 ac. 28-44-19-W2 - in the summer of 1892 with a team of white oxen, the biggest team I ever have seen. I was sixteen years of age at the time. My brother and I sowed black oats on this land in the spring of 1893, doing the sowing broadcast in the old fashioned way. There was a good crop.\n\nThe whole valley is of course now cultivated.\nQuestion 37\n\nIf you or any of your family or friends ever\n\"have to leave or do something in the district mention\nit here, swing dates wherever possible.\n\nI was the first one to break land in that\npart of the Stoney Creek country later called\nAlberta Valley. I did this breaking - 30 acres -\non my brother's homestead - the NE¼ 9 sec. 28-44-19-W2\nin the summer of 1892 with a team of white oxen,\nthe biggest team I ever had seen. I was\nsixteen years of age at the time. My bro. and\nI owned black oats on this land in the spring\nof 1893, doing the sowing broadcast in the\nold fashioned way. There was a good crop.\nThe whole valley is, of course now cultivated.\nQuestion 38\n\nWhen the first School District was formed in Pleasant Valley one of the members of the Board was a settler named Solomon Stone. His wife's name was Melinda. We believe he became Chairman of the Board and led the School District named Melinda after his wife.\n\nThe first Postmaster in the western part of the Stony Creek district was named Charles Heath. He had settled there in 1893 on a year-long visit from Vermont. Mr. Heath let his grandfather name the Post Office and the old gentleman named it \"Pleasant Valley\" after the district he came from in Vermont.\nwhen the first School District was formed in Pleasant Valley one of the members of the Board was a settler named Solomon Stone. His wife's name was Melinda. We believe became Chairman of the Board and held the School District named Melinda also his wife.\n\nThe first Postmaster in the western part of the Stony Creek district was named Charles Heath. He had settled there in 1893 or a year or so. Sec. 22-44-19-W2. We had the privilege of naming the new Post Office and as it happened, my great-grandfather, a Mr. Whittaker from Vermont U.S. was visiting him at the time. Mr. Heath let his grandfather name the Post Office and the old gentleman named it \"Pleasant Valley\" after the district he came from in Vermont.\nQuestion 38\n\nWhen the first School District was formed in Pleasant Valley one of the members of the Board was a settler named Solomon Stone. His wife's name was Melinda. We believe became Chairman of the Board and had the School District named Melinda after his wife.\n\nThe last Postmaster in the western part of the Stoney Creek district was named Charles Heath. He had settled there in 1893 on a quarter-section. He had the privilege of naming the new Post Office and as it happened, Mr. Heath's grandfather, a Mr. Whittaker from Vermont, U.S., was visiting him at the time. Mr. Heath let his grandfather name the Post Office and the old gentleman named it \"Pleasant Valley\" after the district he came from in Vermont.\nQuestion 38\n\nWhen the first School District was formed in Pleasant Valley, one of the members of the Board was a settler named Solomon Stone. His wife's name was Melinda. We believe she became Chairman of the Board and led the School District named \"Melinda\" after his wife.\n\nThe last Postmaster in the western part of the Stoney Creek district was named Charles Neats. He had settled there in 1893 on a piece of land near the new Post Office and as it happened, Mr. Neats' grandfather, a Mr. Whitaker from Vermont, U.S., was visiting him at the time. Mr. Neats let his grandfather name the Post Office and the old gentleman named it \"Pleasant Valley\" after the district he came from in Vermont.\nIt was in the year 1903 I believe that the Con. Northern Line, then being built, had reached the point where the town of Yisdale now stands. The new station need to be named and that evening round the campfire, the matter was being discussed. There were six present in the party, these being - three railway construction engineers, Mr. Reginald Beatty of Ottery Creek (who had a contract with the C.N.R.), Mr. Richard Stovel, Purchasing Agent for the C.N.R., and Mr. Stovel's clerk (a young fellow named Fred Yisdale). It suddenly occurred to Mr. Beatty that the name \"Yisdale\" would be a good name for the new location and raising the said \"Gentlemen, fill your cups (they were tin ones) and let us drink to the new town. They all rose accordingly and Mr. Beatty named the new location \"Yisdale\". The toast was drunk (in water) with great enthusiasm.\n\nI may say that Mr. Beatty gave me these facts some years later, he being at that time my partner in business in Melfort. Mr. Yisdale now lives at Beaverton, Ontario, and I understand runs a hotel there.\nIt was in the year 1903 I believe that the Con. Northern Line, then being built, had reached the point where the Town of Yisdale now stands. The new station was to be named and that evening, round the campfire, the matter was being discussed. There were six present in the party, these being - three railway construction engineers, Mr. Reginald Beatty of Atmore Creek (who had a contract with the C.N.R. to supply head oats for the teams), Richard Stovel, Purchasing Agent for the C.N.R., and Mrs. Stovel's clerk (a young fellow named Fred Gisdale). It suddenly occurred to Mr. Beatty that the name \"Yisdale\" would be a good name for the new location and rising he said \"Gentlemen, fill your cups (they were tin ones) and let us drink to the new town. May all those accordingly and Mr. Beatty named the new location \"Yisdale.\" He toast was drunk (in water) with great enthusiasm.\n\nI may say that Mrs. Beatty gave me these facts some years later, she being at that time my partner in business in Melfort. Mr. Yisdale now lives at Beaumont, Ontario, and I understand runs a hotel there.\nThe Town of Melior received its name as follows:\n\nMr. Beatty, wife Reginald Beatty, the first settler in the Stoney Creek district (he having settled there in 1884) was given the privilege of naming the town. Mrs. Beatty's maiden name was Campbell and she was one of a family of Campbells who had owned the Melior estate in Argyleshire, Scotland, for about thirteen hundred years. She named the new town from this estate.\n\nThe village of Beatty, the first station west of Melior on the C.N.Railway, was called after Mr. Reginald Beatty, the first settler in the Stoney Creek district. Later called the Melior district. He came in and squatted on a homestead there in the year 1884.\n\nThe siding of Cleopet received its name on account of James Cleopet, a prominent cattle buyer and farmer in the early days of the Town of Melior and still in business.\nThe town of Melkior received its name as follows:\n\nMrs. Beatty, wife of Reginald Beatty, the first settler in the Stoney Creek district (he having settled there in 1884) was given the privilege of naming the town. Mrs. Beatty's maiden name was Campbell and she was one of a family of Campbells who had owned the Melkior Estate in Argyllshire, Scotland, for about three hundred years. She named the new town after this estate.\n\nThe village of Beatty, the train station west of Melkior on the C.N.Railway was called after Mr. Reginald Beatty, the first settler in the Stoney Creek district. Later called the Melkior district.\n\nHe came in and squatted on a homestead there in the year 1884.\n\nThe siding of Cleopet received its name on account of James Cleopet, a prominent cattle buyer and farmer in the early days of the town of Melkior and still in business.\nI have two sons - Frederick Golder Wood, who lives in Melrose Park, and Dr. Robert Waterfield Wood, now living intern at Sunnybrook Hospital, Toronto.\n\nI have a daughter, Agnes Dorothy, now Mrs. R.S. Campbell, who lives in Toronto. She has a daughter,\n\nDorothy & Elizabeth Campbell (my grand daughters) who is still an infant.\nI have two sons - Frederick Golder Wood, who lives in Melrose Park, and Dr. Robert Waterfield Wood, now senior intern at Sunnybrook Hospital, Toronto.\n\nI have a daughter, Agnes Dorothy, now Mrs. R.S. Langford, who lives in Toronto. She has a daughter,\n\n- Doris Lily Elizabeth Langford (my grand daughter) who is still an infant.\nAs there was no community at least the most important change to me is the transformation of a wilderness into a settled community of prosperous farmers and the establishment of several farms and villages in the area - the main town being Melton. The advent of two railways - the E.N.P. and the C.P.R. - into the district was a part of this and of course played the leading part. The development of our roads by the different Rural Municipalities also played a large part.\n\nThere is the change during this period from the horse and buggy days to the present era of cars and trucks - complete transformation. Most of the farms now have telephones and power has been installed in many of them from different power lines.\n\nPower all these factors have played their part in the building up of this area into one of the most highly developed and prosperous districts in Canada.\nAs there was no community at first the most important change to me is the transformation of a wilderness into a settled community of prosperous farmers and the establishment of several towns and villages in the area - the main town being Melport. The advent of two railways - the E.N.P. and the C.P.R. - into the district was a part of this and of course played the leading part. The development of our roads by the different Rural Municipalities also played a large part. Then there is the change during this period from the horse and buggy days to the present era of cars and trucks - a complete transformation. Many of the farms now have telephones and power has been installed in many of them from different power lines.\n\nAll these factors have played their part in the building up of this area into one of the most highly developed and prosperous districts in Canada.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_544.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 82, "total-input-tokens": 136120, "total-output-tokens": 22084, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1640, 5], [1640, 3182, 6], [3182, 6524, 7], [6524, 8096, 8], [8096, 11518, 9], [11518, 12213, 10], [12213, 13461, 11], [13461, 14531, 12], [14531, 16472, 13], [16472, 17105, 14], [17105, 19164, 15], [19164, 20089, 16], [20089, 21560, 17], [21560, 22810, 18], [22810, 23973, 19], [23973, 25136, 20], [25136, 26399, 21], [26399, 27655, 22], [27655, 28826, 23], [28826, 29992, 24], [29992, 31139, 25], [31139, 32244, 26], [32244, 33407, 27], [33407, 34582, 28], [34582, 35777, 29], [35777, 36995, 30], [36995, 38131, 31], [38131, 39286, 32], [39286, 40517, 33], [40517, 41735, 34], [41735, 42938, 35], [42938, 44150, 36], [44150, 45342, 37], [45342, 46465, 38], [46465, 47464, 39], [47464, 48504, 40], [48504, 49618, 41], [49618, 50668, 42], [50668, 51788, 43], [51788, 52897, 44], [52897, 54062, 45], [54062, 55194, 46], [55194, 56249, 47], [56249, 57302, 48], [57302, 58356, 49], [58356, 59388, 50], [59388, 60459, 51], [60459, 61528, 52], [61528, 62543, 53], [62543, 63557, 54], [63557, 64650, 55], [64650, 65750, 56], [65750, 66845, 57], [66845, 67906, 58], [67906, 68876, 59], [68876, 69897, 60], [69897, 70522, 61], [70522, 71222, 62], [71222, 71588, 63], [71588, 71959, 64], [71959, 72995, 65], [72995, 74017, 66], [74017, 74682, 67], [74682, 75341, 68], [75341, 75915, 69], [75915, 76630, 70], [76630, 77350, 71], [77350, 78046, 72], [78046, 79102, 73], [79102, 80187, 74], [80187, 81038, 75], [81038, 81896, 76], [81896, 82223, 77], [82223, 82552, 78], [82552, 83424, 79], [83424, 84297, 80], [84297, 84452, 81], [84452, 84606, 82]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]