[{"id": "a39f1a10315fcf4c304eebfa6686a9b60194e1c1", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked to answer it has generally been experienced by everyone. Some of the questions have not been answered by everyone, so don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ADRIAN APPERLEY\n2. Your address WHITEWOOD SASKATCHEWAN\n3. Date OCT 3/1955\n4. Where were you born? (Give name of place and country).\n   BORN SIMCO COUNTY ONTARIO\n5. What was your father's name and occupation?\n   Brick layer by trade.\n6. When did you come to Saskatchewan? (Give month and Year).\n   I came here in NOVEMBER 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   NONE\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was seven years old\n9. What were your reasons for coming West?\n   My parents thought it would be best to homestead with such a large family. I had ten brothers and one sister. 12 of a family. My father's name was Adrian Apperley. Since I was only seven I came with my parents.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n1. Your full name: ADRIAN APPERLEY\n2. Your address: WHITEWOOD, SASKATCHEWAN\n3. Date: OCT 3/1955\n4. Where were you born? (Give name of place and country): BURNSIMCO COUNTY, ONTARIO\n5. What was your father's name and occupation?: Buck Apperley by trade.\n6. When did you come to Saskatchewan? (Give month and year): OCTOBER 1955\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.: NONE\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Radio? Or government information?).\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was the best move.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\nWe traveled with a party of neighbors.\n\n13. What means of transportation did you use?\nRailroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nNot very much.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe stayed in a tent boarding place a few days until my built a shanty on a homestead.\n\n16. Where did you settle or take up land?\nMy father homesteaded 3 1/2 miles South of Whitewood, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nNone.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nI stayed with my parents until I was 16 years old and worked out till I was old enough to homestead.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was the best move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWe traveled with a party of neighbors.\n\n13. What means of transportation did you use?\nRailroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nNot very much.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe stayed in a tent for about a few days until my family built a house.\n\n16. Where did you settle or take up land?\nMy family settled in Whitehead, 3½ miles south of my future homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nJamestown.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nPlanted and worked until I was old enough to homestead.\n19. How often did you write to relatives or friends in your old home?\n   About once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I got married 12th of May, 1904 to Edith Tweedie, Inverness.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   None.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   All came together in the year 1883 and settled around Whitewood, Sask.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   At the time of the Rebellion there were twelve Indians came to our place & ordered my mother to give them dinner. All carried rifles but were peaceful.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   We traveled just to the neighbors and danced with oxen and horse made sleigh or steamboat in summer.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Bastrop because of your recommendation? If so:\n\nPlease list names:\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll came together in fall year 1883 and settled around Whitewood SASK.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nAt the time of the settlement there were Indians coming to any place we visited and made us give them dinner all around it after but very peaceful.\n\n24. Did you travel about much in the early years? (For instance attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe traveled most to the right hand side of demurrage and down river.\n25. When was the first car used in the community? About 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Did not own one\n\n27. Where was your trading center? How far from your home?\n   The town of WHITEWOOD, 3 1/2 or 4 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, till I homesteaded south of KIPLING, SASK. In 1903, 1904 the CPR built the RESTON WOOLSEY LINE. We dealt at WINDTHORST.\n\n29. How often did you shop in the early days?\n   Once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Not till cars got plentiful in 1924\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1900. Mostly about 3 percent. Very little change\n\n32. When did you first have a telephone and what company provided it?\n   About 1914. The SILVERWOOD TELEPHONE CO.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   To stay\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Bealteshoun the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Some of the bachelors got tired of bachelor life so moved away.\n\n35. Did many people move away during the 1930's? Did many return?\n   A great many left and went to northern Saskatchewan.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   None outside of being school trustee.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   John Scott and brothers owned the first threshing machine.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Silverwood School got its name from the silver willows which were plentiful. Thomas Stewart a farmer named the school. Silverwood Municipality was named after Silverwood School.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates whenever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of now name as above in (1), (2), (3).\n\nThe Silverwood School got its name from Thomas Stewart, a farmer named after Silverwood Municipality, which was named after Silverwood School.\nTo my daughters married names & husbands\n\nOccupations are -\n\nGLADYS - MRS STEVE STEPHENSON, KINLEY, SASK\nHusband is C.N.R. Station Agent\n\nIRENE - MRS ANDREW ARMSTRONG, CHILLIWACK BC\nHusband is a truck driver\n\nFLORENCE - MRS AL MEISNER, MEYRONNE, SASK\nHusband is a drayman (once a farmer)\n\nDOROTHY - MRS WILLIAM ASTROPE, WHITEWOOD, SASK\nHusband a farmer\n\nGOLDA - MRS HECTOR WALKER, KENESTON, SASK\nHusband is grain buyer in the Consolidated elevator\n\nSome occupations & addresses are\n\nFREEMAN APPERLEY - TABER, ALBERTA... Occupation a welder\n\n& CLARENCE and GLENBURN APPERLEY, NAPLETTA\nare occupied as farmers.\n\nBERT APPERLEY - REGINA, SASK.\nWorks on the C.P.R. Station and also is a plasterer.\nMy daughters married names & husbands\n\nOccupations are -\n\nGLADYS - MRS STEVE STEPHENSON, KINLEY, SASK\nIRENE - MRS ANDREW ARMSTRONG, CHILLIWACK, BC\nFLORENCE - MRS AL MEISNER, MEYRIONNE, SASK\nDOROTHY - MRS WILLIAM ASTROPE, WHITEMUD, SASK\n\nFreeman Apperley - Taber Alberta occupation a teacher\n& Clarence and Glenburn Apperley, were also\n\nare occupied as farmers in Regina SASK.\n\nBERT APPERLEY & P.R. Station and also in a\nwriter in the C.P.R. Station.\n\nFlorence\nTo my daughters married names & husbands:\n\nOccupations are -\n\nGLADYS - MRS STEVE STEPHENSON, KINLEY, SASK\nHusband is C.N.R. Station Agent\n\nIRENE - MRS ANDREW ARMSTRONG, CHILLIWACK BC\nHusband is a truck driver\n\nFLORENCE - MRS AL MEISNER, MEYRONNE, SASK\nHusband is a drug merchant (once a farmer)\n\nDOROTHY - MRS WILLIAM ASTROPE, WHITEWOOD, SASK\nHusband a farmer\n\nGOLDA - MRS HECTOR WALKER, KENESTON, SASK\nHusband is grain buyer in the consolidated elevator\n\nSome occupations & addresses are -\n\nFREEMAN APPERLEY - TABER, ALBERTA. Occupation: a welder\n\nCLARENCE and GLENBURN APPERLEY, WAPPELIA\nare occupied as farmers.\n\nBERT APPERLEY - REGINA, SASK.\nWorks in the C.P.R. Station and also is a plasterer.\nTo my daughter married names & husbands:\n\nOccupations are:\nGLADYS - MRS STEVE STEPHENSON, KINLEY, SASK.\nIRENE - MRS ANDREW ARMSTRONG, CHILLIWACK, BC.\nFLORENCE - MRS AL MEISNER, MEYRIONNE, SASK.\n\nDOROTHY - MRS WILLIAM ASTROPE, WHITEMOSS, SASK.\nGORDON - MRS HECTOR WALKER, KENESTON, SASK.\n\nFreeman Apperley - Taber Alberta, occupation:\na widower and Glenburn Apperley, occupation:\n& Clarence and Regina, occupation:\nare occupied at Regina, SASK.\nBERT Apperley C.P.R. Atticus and also in a\nwheat town.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWe have no diaries etc., so everything we owned was destroyed in a fire when we lost our home in 1945.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatchewan?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have ten children & thirty one grandchildren.\n\nGLADYS - GIRL\nEDNA\nFREEMAN\nDOROTHY\nCLARENCE\nGLENBURN\nLOLA\nIRENE\nFLORENCE\nBERT\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important changes I can think of are the cars taking the place of the horse and buggy and also the power machinery farming.\n\nMiss Bonnie McCaig, Whitewood, Sask.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Williams, Oatspe, Whitewood, Sask.\nWould you or the person also own items other than those listed above?\n\n(1) be willing to lend them to the Provincial Archives for display?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify name of the Archives Office at the University of Saskatchewan)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nCLAYTON - GIRL\nFREEMAN\nCLARENCE\nGLENBURN\nFLORENCE\n\n43. What do you think are the most important changes in your community since you first came here?\n\nThe most important changes have been the growth of the town and the increase in the number of ordinary farms.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here.\n\nMrs. W. Williams, Ootegam\n\nUnidentified text\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883A-C_389.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5514, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3148, 6], [3148, 4514, 7], [4514, 5301, 8], [5301, 6317, 9], [6317, 7289, 10], [7289, 8388, 11], [8388, 9348, 12], [9348, 10699, 13], [10699, 11685, 14], [11685, 13052, 15], [13052, 14159, 16], [14159, 14852, 17], [14852, 15312, 18], [15312, 16011, 19], [16011, 16510, 20], [16510, 17984, 21], [17984, 18886, 22], [18886, 18886, 23], [18886, 19041, 24], [19041, 19041, 25], [19041, 19195, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]