[{"id": "34f505583ef9919bffdc4dae9a6ee272bb4a91a9", "text": "S-X2\n533. Evans William\n\nS-X2\n532. Evans John\nS-X2\n533. Evans William\n\nS-X2\n532. Evans John\nEvans, John\n305 - 11th St., Saskatoon.\nTo Sask. - April, 1892.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences others may prove impractical for you to answer, so don't worry about having blank spaces. Use \"etc.\" instead of \"insert here,\" do not worry about being able to answer all the questions. Give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1 entitled \"Pioneer Diets: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires available\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nEvans, John\n305 - 11th St., Saskatoon.\nTo Sask. - April, 1892.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because some of the questions here will not apply to your experiences or those of your family. You may have lived in a different part of the province than others who answered the questionnaire. If you have any information about pioneer life in your area, please include it in your answers.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life,\" was answered by you and will be sent to you. We would like to hear from you again if you have not already answered this questionnaire. Please put a check mark here (X) if you have already answered this questionnaire.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please make sure you are willing to answer.\n\n[ ] All questionnaires completed\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer housing and churchwork\n[ ] Pioneer education and churchwork\n\nEnrollment of Questionnaire\n\nOffice: All questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan, Saskatoon, Saskatchewan. Please complete your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nEvans, John\n305 - 11th St., Saskatoon.\nTo Sask. - April, 1892.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................... John Evans\n2. Your address .............................................. 305, 11th St., Saskatoon.\n3. Date .......................................................... April 1892\n4. Where were you born? (Give name of place and country) ......................................................... Rhayader, Wales\n5. What was your father's name and occupation? ................................................................. John Evans - Farmer\n6. When did you come to Saskatchewan? (Give month and year) .................................................... April 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ................................................................. Lived at Carding farm until 1899\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" or \"I was in my teens\", etc.) ................................................................. Twenty-five - June 25, 1892\n\n9. What were your reasons for coming West? The farm home in Wales was when my father died. The land was good and there was plenty of room for me to move.\n\n10. How did you learn about the West? Through other people; hearing about it from railroad or government information.\nEvans, John\n305 - 12th St., Saskatoon.\n\nTo Bank - April 1892\n\nSASKATCHEWAN ARCHIVES, REGISTRATION\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John Evans\n2. Your address: 305, 11th St., Saskatoon\n3. Date: \n4. Where were you born? (Give name of place and country): Rhayader\n5. What was your father's name and occupation: John Evans - Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Lived at Cobhane, Ontario in 1899\n   - Married March 1899, Returned to Ontario\n   - Came back to Canada April 1892, Arrived in Regina April 1892\n   - Own farm located in Regina, had my home in Saskatoon on SE 1/4 30 36 44\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? The farm home in Wales was taken up by others\n10. Did you attend any schools in the pioneer days? Yes, attended school in Ontario\n11. How did you learn about the West? Through other people, Reading about it, Railroad or Government Information\nEvans, John\n305 - 11th St., Saskatoon.\nTo Sask. - April 13, 1892.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John Evans\n2. Your address: 305 - 11th St., Saskatoon\n3. Date: \n4. Where were you born? (Give name of place and country): Rhayader, Wales\n5. What was your father's name and occupation?: John Evans - Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Lived at Cambrian farm until 1899\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.): Twenty-five years old\n9. What were your reasons for coming West?: The farm homes in Wales were lacking in comfort.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n[Handwritten text not legible]\nEvans, John\n305 - 11th St., Saskatoon.\nTo back - April, 1892.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: John Evans\n2. Your address: 305 - 11th St., Saskatoon\n3. Date: \n4. Where were you born? (Give name of place and country): Rhayader, Wales\n5. What was your father's name and occupation?: John Evans - Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1892\n7. Mention any other places where you lived before coming to Saskatchewan until 1899:\n   - Earl Burt, Missouri - Aug. 1878 to March 1899, arrived at Regina, Saskatchewan on form SE 28, 36, 46, 47\n   - Queen Grand Portage, Ontario - April 1899, arrived at Regina, Saskatchewan on form SE 28, 36, 46, 47\n8. How old were you when you first came to Saskatchewan? (You do not need to answer this question if you were under 18 years old in 1899)\n9. Why did you come to Saskatchewan? (Give reasons for coming West)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVery much interested in my Emigration.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBetween Liverpool and Preston I traveled with my wife and two children. We arrived at Preston on the 25th of June, 1879.\n\n13. What means of transportation did you use?\n\nMy wife came by CPR freight train while I came by horse and cart.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement etc.)\n\nThey had to keep me from going to preachers. The station agent tried to have me miss the train when the train was ready to pull out. The Railway from Regina to Prince Albert was completed in 1879, the same year.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed for a time with Edgar and his wife five miles east of Saskatoon. Later we moved to a neighbor's place near the town of Saskatoon.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nOur home has been continuous at least fifteen years from Saskatoon.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on my father's farm until 1879. My mother farmed on Thompson's farm until 1879. My brother farmed on Thompson's farm until 1879. My wife farmed on Thompson's farm until 1879.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nVery much interested in my Emigration.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nBetween Edmonton and Calgary we traveled by ourselves. We came by way of Edmonton and Calgary. We traveled by train from Edmonton to Calgary.\n\n13. What means of transportation did you use?\n\nMy wife came by CPR freight train. She traveled with a team of horses and mules.\n\n14. What obstacles of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nThey had to cross a river near the town of Red Deer. They also had to cross a river near the town of Red Deer.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed for a time with Mr. and Mrs. Clements. They lived near the town of Red Deer.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nOur home has been near the town of Red Deer.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on a farm until 1898. My wife was a housewife.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on a farm until 1898. My wife was a housewife.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you attend church regularly? If so, what was the name of the church?\n\n25. Did you travel about much in the early years? For business, visiting friends, etc.? How far? By what means of travel?\n\nWe attended church on the promenade—travelling by team and horse and miles.\n25. When was the first car used in the community? (Think it was 1904)\n\n26. If you owned a car before 1911, when did you buy it? What make was it?\n\n27. Where was your trading center? How far from your house? (What town?)\n\n28. Did you continue to trade there? (Initiate any changes due to new terms appear-\n\ning, better means of travel, etc.) (An answer needed in Rockton.)\n\n29. How often did you shop in the early days of Rockton? In two weeks.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? (Only of late years.)\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. Than did you first have a telephone and what company provided it?\n\n33. When you came to Rockton, was the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nOur homes were always...\n25. When was the first car used in the community? (Thanksgiving or Christmas)\n\n26. If you could go before 1914, when did you buy it? What made you buy it?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Initiate any changes due to new terms, etc.)\n\n29. How often did you shop in the early days? (Four times in two weeks)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Salt Lake City, the first time was it with the idea of settling permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Have you ever visited the city?\n34. Did any people move away from your district prior to 1914? What reasons did they give for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining cornfields, etc.)\n\nOrganized the Somerville School District No. 1922, Charles Carroll\n\nSawyer's Corner\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date and reason for change (4) any changes in names since the first name was given.\n\nCharlottesville - The Smith family were first permanent settlers.\n\nAnother land was named after Mr. Charlton who was the member of the first legislature. Probably on Post Road near the town of Langley.\n31. Did any people move away from your district prior to 1914? What reasons did they give for moving? (Note: This question pertains to the period before World War I.)\n\n32. On what occasions did you attend church services? How often?\n\n33. Did many people move away during the 1930s? Did many return? Why?\n\n34. Was this district active in the National League of Women Voters? If so, when did it begin?\n\n35. If you or some member of your family have held public office, or have been active in any organization, please list them here.\n\n36. If you or any of your family were \"drafted\" to have or do something in the District of Columbia, it is important to record these details. Please provide the following information:\n\n- Name(s)\n- Occupation\n- Date of service\n- Length of service\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the District of Columbia, please provide the following information:\n\n- Name(s)\n- Occupation\n- Date of service\n- Length of service\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the origin and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given.\n\n39. The name of the town was changed to \"Newtown\" in 1912. Why was this done?\n\n40. The first settlement was made by farmers along the river.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst came here in 1875. The land was still being cleared out and there was a lot of work to be done.\n\nIf someone else has filled in this questionnaire for you, please give this person’s name and address here:\n\n[Signature]\n\n[Date]\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please give this person's name and address here:\n\n[Signature]\n\n[Date]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to \"rehash\" a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may apply to those of your family or friends. If there is not enough space to answer the questions, feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nTransmission of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office and the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA NOTE OF EXPLANATION TO THE PERSON SUBMITTING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences or others may cover impossible for you to answer, so don't worry about leaving blank spaces. If you have to \"skip\" over details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet; What Did Western Saskatchewan Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... John Evans\n2. Your address ................................................ 305-2, 115 St., Saskatoon\n3. Date .......................................................... Phayader, Wales\n4. Where were you born? (Give name of place and country) ...................................................... John Evans, farmer\n5. What was your father's name and occupation? ................................................................. April, 1892,\n6. When did you come to Saskatchewan? (Give month and year) .............................................. April, 1892,\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Come to Canada North 1890 with my wife and lived in Owen Sound, Ontario until April 1892.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years old.)\n9. What were your reasons for coming West? The agricultural depression of the 1880s made me decide to immigrate to escape unemployment.\n10. How did you learn about the West? (Through other people's reading about it?) Railroad or government information?\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: John Evans\n2. Your address: 305-2nd Ave. S., Saskatoon\n3. Date: \n4. Where were you born? (Give name of place and country): Rhayader, Wales\n5. What was your father's name and occupation?: John Evans, farmer\n6. When did you come to Saskatchewan? (Give month and year): April, 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Came to Canada March 1890 with my wife and lived in Owen Sound, Ontario until April 1892.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming to Canada? The agricultural depression of the 1880s made me decide to emigrate to escape bankruptcy.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Mainly reading the Grain and Homestead Agricultural Exhibitions held at Regina in 1887. I also went from immigration literature and a map of the western Prairies with the Canadian Pacific Railway partly completed.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very much against me leaving our rural breaking and farming land during the war.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My wife and I traveled together from Liverpool, England, to Quebec, Montreal, and then to Edmonton, Alberta.\n\n13. What mode of transportation did you use? We traveled by train from Liverpool to Liverpool, Ontario, and then by boat to Quebec City. From Quebec City, we took the train to Montreal, where we boarded another train to Edmonton.\n\n14. What challenges of the journey did you experience? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other problems.) We encountered many challenges, including meeting with Indians along the way and dealing with accidents and delays.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at the Red Hat Hotel in Regina.\n\n16. Where did you settle or take up land? We settled on a homestead near Saskatoon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We lived in our home in Regina until 1921.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. Describe the homestead you worked at. It was located near Saskatoon, and we worked hard to make it productive.\n\n20. Any other comments or observations about your experiences in Western Canada? We enjoyed our time there and learned a lot about farming and homesteading.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were very much against me leaving and I was very disappointed.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? We traveled with a group of friends.\n\n13. What mode of transportation did you use? We traveled by train.\n\n14. How many days between departure and arrival? We traveled for about two weeks.\n\n15. Where did you first stay when you arrived in Western Canada? We stayed at a friend's house.\n\n16. Where did you settle or take up land? We settled in Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Western Canada. We have lived in several places.\n\n18. How did you earn a living before coming to Western Canada? How did you earn a living after coming to Western Canada? We worked in the fields and then we started our own business.\n\nThe summer of 1920 was very hot and we had to work hard. The fall of 1920 was very cold and we had to work even harder.\n19. How often did you write to relatives or friends in your old home? — Three\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy wife's name was Ellen Pope.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them:\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nLandlordism but soon into a system of organized socialism under the leadership of Mr. Macdonald, who became Premier of Canada. The family had been carried on the Homestead Act until the land was surveyed and the homestead was claimed. The land was then transferred to the government and the family moved to a new location. The family also purchased land nearby for farming purposes. They continued to farm and eventually sold the land to another family.\n\nIn conclusion, the family faced many challenges during their time in Saskatchewan, but they persevered and built a successful farm.\n3.\n\n19. How often did you write to relatives or friends in your old home? — Three\n\n20. If you got married, give the name of your husband or wife, all dates with the date\nand place of marriage. The names of your children, their ages, and places of residence.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please\ngive details.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first,\ntell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your\nmemory which you would like to recount? Formed a Canadian of Canada.\n\nLandlord from but came into a life of hardship. He remained steadfastly\nwhich was largely determined by the circumstances then existing for the family at that time.\n\nEmergency, through the kindness of friends and neighbors. The family\nalso another. In making the decision, however, and purchasing the land, the family\nwere convinced in a very genuine manner, that the land was suitable for farming.\n\nBy Oct. 30th in Nov. 1875, the family had completed the purchase of the land.\n\nThe family moved to the new home in the spring of 1876.\n\nThere were about nine (or ten) families living in the district at that time.\n\nThe family traveled about six (or seven) miles each day of travel.\n\nThe family arrived in the spring of 1876.\n\nCanadian homesteaders. There were a few loggers. All were\nclosed in winter—mostly homesteads.\n25. When was the first car used in the community? 1904\n\n26. If you owned a car before 1912, when did you buy it? What make? — 1913 - Chevrolet\n\n27. Where was your trading center? How far from your home? Blackabony 8½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) We always traded at Blackabony.\n\n29. How often did you shop in the early days? No particular times, but as needed.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by circular since the pioneer period.\n\nThe King's Clothing from Eldon Prince 1893.\n\n32. When did you first have a telephonic and what company provided it? 1915, the Floral Telephone Co.\n\n33. When you came to Shoshone the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Making a home here.\n\nThe members of the cooperative developed the land and applied politics for homemaking.\n25. What was the first car used in the community? 1904\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. How far from your home is the nearest town? Sixty miles.\n\n28. Were there any changes due to new laws or regulations?\n\n29. How often did you travel by train?\n\n30. When did people in your district first start going on Saturday trips?\n\n31. What kind of articles did you buy by mail order? Initiate also what fraction of your total purchases were by mail order?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Bashaw, how long did you stay? Make this decision.\n\nThe history of Bashaw is closely tied to the development of the railroad and the growth of the town.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n\n37. If you or any of your family or friends were \"known\" to have or do something, mention it here, giving dates wherever possible.\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creek hills, etc.). Try to give the name, date of its adoption, and reason for change.\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n\n39. Any other comments?\n\nMy wife organized the Armadale School District Board in 1902. She was elected school trustee in 1915.\n34. Did any people move away from your district prior to 1941? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s-1930s due to economic conditions or other factors?\n\n36. If so, what were the main causes?\n\n37. If you or any member of your family were involved in any organizations, please list them.\n\n38. How did the changes in your community affect their names? (School districts, post offices, etc.)\n\n39. Try to give the original name of the town, village, railroad station, etc., and the date it was changed.\n\n40. Any other comments or observations?\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written books or community organizations, old pamphlets, old newspapers, written recollections and reminiscences? (Check all that apply.)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library Region, or the Archives Office at the University of Saskatchewan? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n(1) The mechanization of the farm.\n\n(2) The growth of the city of Saskatoon.\n\n(3) Prohibition.\n\n(4) Temperance movement.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6. Questions regarding historical documents and artifacts:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, old books, or community organization records? If so, please describe them.\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n(2) No\n\nIf yes, would you be willing to donate them to the Archives Division of the Legislative Library? (Specify your preference, if any)\n\n(1) Yes\n(2) No\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n40. If you think there are the most important changes in your community since you first came West? (Please list at least five.)\n\n(1) The growth of the city of Edmonton\n(2) Land use planning\n(3) Urban revitalization\n(4) Transportation improvements\n(5) Economic development\n\n41. What do you think are the most important issues facing the province today?\n\n(1) Environment\n(2) Education\n(3) Health care\n(4) Crime prevention\n(5) Economic development\n\n42. Please list the names and addresses of other pioneers who could answer this question.\n\nMr. Thomas Smith\nMrs. Jane Doe\nMr. John Smith\nMrs. Jane Doe\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n__________________________\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n__________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892A-G_532.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 66400, "total-output-tokens": 10004, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 46, 3], [46, 92, 4], [92, 92, 5], [92, 92, 6], [92, 92, 7], [92, 92, 8], [92, 2076, 9], [2076, 3909, 10], [3909, 5456, 11], [5456, 6678, 12], [6678, 7630, 13], [7630, 8660, 14], [8660, 10117, 15], [10117, 11447, 16], [11447, 11943, 17], [11943, 12707, 18], [12707, 13837, 19], [13837, 14679, 20], [14679, 15828, 21], [15828, 17297, 22], [17297, 18258, 23], [18258, 19230, 24], [19230, 21037, 25], [21037, 22786, 26], [22786, 24280, 27], [24280, 25648, 28], [25648, 27204, 29], [27204, 28222, 30], [28222, 29372, 31], [29372, 30829, 32], [30829, 32103, 33], [32103, 32836, 34], [32836, 34144, 35], [34144, 34732, 36], [34732, 35861, 37], [35861, 37309, 38], [37309, 37464, 39], [37464, 37618, 40]], "primary_language": ["None", "None", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]