[{"id": "54d1999f9171e2e3ebf1fc698595b47a299973c6", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. John Banta\nAddress: 82 Main Street\nBirthplace: Carlton Co., Minnesota\n\n1. Introductory Questions\n   What year did you start housekeeping in Eastern Canada? 1917\n   Where did you set up housekeeping? Homestead, Northfield Division\n   Where had you been living before that? Duluth, Minnesota\n   For how many people did you prepare meals? 5\n   How far was it to your nearest store? Eleven miles\n   How often could a visit be made to the store? About twice a month\n   What groceries did you usually buy in those earliest years?\n   Flour, sugar, coffee, rice, oatmeal, salt\n   Dried peas & beans and some dried fruit\n\n2. Flour and Other Grain Products\n   What brand of white flour did you use in the early years? Robin Hood\n   In what quantities did you buy it? One hundred pound bags\n   What was the usual price per hundred pounds of white flour? About 2.50\n   How much did you use graham flour? Very little\n   Whole wheat flour? None\n   Was flour milled locally? No. How far away? _______ that year? _______\n   What was the price for a twenty pound bag of rolled oats? _______\n   What other grain products did you use? _______\n   Cornmeal? No. Whole wheat? No. Farina? Same\n   Other? _______\n   Did you grind your own wheat for porridge? Sometimes\n   How did you grind it? Coffee grinder\nMrs. John Ranta\n\nAddress: Hamilton, Pa., Pennsylvania\n\n1. TERRITORY LISTING\n\nWhat year did you start homesteading in Indiana County? (1917)\n\nHow far did you go to hunt for timber? (Hamilton, Pennsylvania)\n\nFor how many people did you prepare meals? (5)\n\nHow far was it to your nearest store? (Hamilton, Pennsylvania)\n\nHow often would you visit by foot to the store? (Weekly)\n\nWhat groceries did you usually buy in town during a year? (Flour, sugar, coffee, rice, oatmeal, salt, dried peas & beans and some dried fruit)\n\n2. FOODS USED\n\nIn what quantities did you buy flour? (One hundred pounds)\n\nWas there any other food product of Mrs. Ranta's? (Yes)\n\nHow much did you use cracker flour? (Very little)\n\nWas flour killed locally? (Yes)\n\nDid you purchase any other similar products? (No)\n\nCorn meal? (Yes)\n\nOats? (Yes)\n\nDid you grind your own wheat for yourselves? (Yes)\n\nHow did you grind it? (Grinder)\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 2.0 lb bag\nWhat was the price for a ten pound sack of white sugar? 7.0 cents\nWhat brand of golden corn syrup did you use? Golden Roger's\nWhat size of tin of syrup did you usually buy? 5 lb\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Yes\nButter? Yes Eggs? Yes\nWhat was the price of butter? 15¢ of eggs? About 10¢\nDid you pick eggs for hens? Some How? In crates\nDid you make butter? Yes Cheese? No\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Hog\nHow did you get fresh meat? Very little\nHow often did you get fresh meat? Once a month\nHow did you preserve meat? Cured\nWas there a \"beef ring\" in your neighborhood? After 1926\nIf so what year was it organized? About 1926\nDid you use game? No What kinds?\nFor how long?\nWhat part did fish play in the family diet?\nWas the fish fresh, cured, or canned? Cured & fresh in winter\nKinds? Whitefish and salt herring\n2.\n\n3.\n\n4. **DAIRY FARMING**\n   - Did you get a supply of fresh milk in the early days? Yes\n   - Butter? Yes\n   - That was the price of butter? 15¢\n   - Did you make butter? Yes\n   - What kind of cheese?\n\n5. **EGGS AND MILK**\n   - Did you get fresh eggs? Yes\n   - How often did you get fresh milk? Once a month\n   - How did you preserve milk?\n   - Was there a \"milk run\" in your neighborhood? Yes\n   - If so what year was it organized? 1926\n   - Did you use farms? No\n   - For how long?\n   - What part did milk play in the family diet?\n   - Was the dish fresh, curdled, or curdled? Curdled & fresh from water\n   - Kind? White, yellow, etc., most having\n6. BEVERAGES\n\nWhat kind of tea did you buy? ... At what price? ......\nWhat kind of coffee did you buy? (beans or ground) ... Price? ... 3.0.4 ....... What other beverages were used? ... Same, cocoa ...\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? ... 1.5q. a. buna. Could you get potatoes at the store? ... No .......\nIf not, where from? ... Might have ...\nWhat year did you first grow your own supply for the winter of:\nPotatoes ... 1917 ... Cabbage ... Turnips ... Carrots ... Onions ... Turnips ... Beets ...\nIn what quantities did you buy white navy beans? ... By the pound ...\nHow did you buy prunes, (in bulk or by the box)? ... By the box ...\nWhat weight? ... 5 lbs ... How did the grocer handle prunes (by box)? ... ... What was the price of prunes? ... $5.50 for 5 lbs ...\nWhat other dried fruits did you use in the earliest days? (aples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nApples, raisins and peaches.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? ... No ...\npeas? ... corn? ... beans? ... Saskatoons? ... other foods? ...\nWhat year did you first preserve fruit by canning? ... about 1925 ...\nWhat year did you first preserve vegetables by canning? ... about 1929 ...\nWhat year did you first preserve meat by canning? ... 1930 ...\nDo you still preserve foods by canning or drying? ... By canning ...\nTo what extent? ... Not to a large extent ...\nDid you make your own vinegar? ... No ...\n3.\n\n4. **VEGETABLES**\n\n   - What kind of tea did you buy?  \n     *Answer:* At that time, I bought...  \n   - What kind of coffee did you buy? (beans or ground)  \n     *Answer:*  \n   - Please...  \n     *Answer:*  \n\n5. **VEGETABLES AND FRUITS**\n\n   - What was the price of potatoes per lb. at that time?  \n     *Answer:*  \n   - Could you get potatoes at the store?  \n     *Answer:*  \n   - If not, where from?  \n     *Answer:*  \n   - That year did you first grow your own supply for the winter of?  \n     *Answer:*  \n   - Potatoes  \n     *Answer:*  \n   - Turnips  \n     *Answer:*  \n   - In what quantities did you buy white navy beans?  \n     *Answer:*  \n   - How did you buy prunes? (in bulk or by the box)?  \n     *Answer:*  \n   - That weight?  \n     *Answer:*  \n   - How much did the grocer charge you?  \n     *Answer:*  \n   - That other dried fruits did you use in the fall? (apples, pears, apricots, peaches, lemons, raisins, currants, or others)?  \n     *Answer:*  \n   - Apples, raisins, and prunes.  \n\n6. **PRESERVING**\n\n   - In the early years did you preserve any foods by canning?  \n     *Answer:*  \n   - Other foods?  \n     *Answer:*  \n   - Juice?  \n     *Answer:*  \n   - Beans?  \n     *Answer:*  \n   - Sauerkraut?  \n     *Answer:*  \n   - That year did you first preserve fruits by canning?  \n     *Answer:*  \n   - That year did you first preserve vegetables by canning?  \n     *Answer:*  \n   - Do you still preserve foods by canning or drying?  \n     *Answer:*  \n   - To that extent?  \n     *Answer:*  \n   - Did you make your own vinegar?  \n     *Answer:*\n9. PLEASE FILL IN THE FOLLOWING ON THE LIST OF YOUR DAY:\n\n| FOOD                  | Year you first remember seeing it in the store | How can it be sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-----------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | about 1920                                     | Packages Small 25¢                              |                                   |                     |\n| Macaroni              | 1925                                           | bulk 26¢                                          |                                   |                     |\n| Graham flour          |                                               |                                                    |                                   |                     |\n| Brown sugar           | 1917                                           | bulk 5¢                                           |                                   |                     |\n| Molasses              | 1917                                           | 50 lb. bag                                        |                                   |                     |\n| Table salt            | 1917                                           |                                                    |                                   |                     |\n| Common salt           |                                               |                                                    |                                   |                     |\n| Lily white syrup      | 1917                                           |                                                    |                                   |                     |\n| Toilet soap           |                                               |                                                    |                                   |                     |\n| Baking powder         | 1917                                           |                                                    |                                   |                     |\n| Baking soda           |                                               |                                                    |                                   |                     |\n| Dried peas            |                                               |                                                    |                                   |                     |\n| Dried corn            |                                               |                                                    |                                   |                     |\n| Vinegar               |                                               |                                                    |                                   |                     |\n| Raisins - seeded      |                                               |                                                    |                                   |                     |\n|                      |                                               |                                                    |                                   |                     |\n| Rice                  | 1987                                           | bulk 3 lbs. for 25¢                               |                                   |                     |\n| Currents              |                                               |                                                    |                                   |                     |\n| Store jam - kinds?    |                                               |                                                    |                                   |                     |\n| Cheese (Cheddar or store cheese) | — | | | |\n| Vanilla               |                                               |                                                    |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal dry yeast\nDid you make yeast for your own use? No\nUsing starter? No\nUsing hops? Yes\nSalt rising? Yes\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? No\n| Item                  | Package | Small | 2 lb |\n|-----------------------|---------|-------|------|\n| Soda Bicarbonate      | about 1/2 lb | 26c   | 54c  |\n| Cornmeal              |         |       |      |\n| Graham Flour          |         |       |      |\n| Green Sugar           |         |       |      |\n| Molasses              |         |       |      |\n| Table Salt            |         |       |      |\n| Corn                 |         |       |      |\n| Butter                |         |       |      |\n| Cheese (Cheddar)      |         |       |      |\n| Vanilla               |         |       |      |\n\n10. **DIARY**\n\nWhat type of yeast did you use? Royal dry yeast\n\nDid you make yeast for your own use? No\n\nUsing starter? Yes\n\nUsed hops? Yes\n\nSalt rising? Yes\n\nBaking soda? Yes\n\nDid you buy baking powder? Yes\n\nDid you make your own baking powder? Yes\n\nOrigin of tartar? Yes\n### 11. NAME THE FOODS THAT YOU DID NOT SEE ON THE MARKET.\n\n| Food                  | Earliest Date | Approximate Price at the Time | How Did It Differ from the Same Good at Today? |\n|-----------------------|---------------|-------------------------------|-----------------------------------------------|\n| Canned salmon         | About 1920    |                               | Not much change except somewhat drier now.    |\n| Canned muttons        |               |                               |                                               |\n| Other canned fish     |               |                               |                                               |\n| Fish that appeared early | 1925          |                               |                                               |\n| - Herring             |               |                               |                                               |\n| - Pilchards           |               |                               |                                               |\n| Apples - fresh        |               |                               |                                               |\n| - dried               |               |                               |                                               |\n| Lettuce               |               |                               |                                               |\n| Tomatoes - fresh      |               |                               |                                               |\n| - canned              |               |                               |                                               |\n| Bananas               |               |                               |                                               |\n| Lemons                |               |                               |                                               |\n| Oranges               |               |                               |                                               |\n| Cornflakes            |               |                               |                                               |\n| Other prepared breakfast cereals - give names |               |                               |                                               |\n| Shredded wheat        |               |                               |                                               |\n| Pearl tapioca         |               |                               |                                               |\n| Minute tapioca        |               |                               |                                               |\n| Sage                  |               |                               |                                               |\n| Dates                 |               |                               |                                               |\n| Nuts                  |               |                               |                                               |\n| Icing sugar           |               |                               |                                               |\n\nMore variety now.\n\n---\n\n### 12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ________Well________ in the yard_____________________\n\nHow far was this water from your house? ________________________________\n\nHow was it brought to the house? (pail, barrel, tank) _______carried by pail________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nNo change. Still use well water carried by pail or brought near house in a barrel.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (e.g., river, stream, dugout)...........Likely....from the yard.\n\nIf or for was this water from your house? (e.g., barrel, tank) (Answer by first)\n\nWas it brought to the house? (e.g., barrel, tank) (Answer by first)\n\nWas it started immediately, started later when you came?\n\nno change. Still use well water, answer\n\nby pair or trough near house to a well.\n13. SOAP\n\nDid you buy laundry soap or make your own? Buy and made some.\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Fels naptha and Prt & G.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Prairie chips in summer.\n\nWhere did you get your fuel? Coal and wood bought in town...for winter use.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nNo prairie chips are used anymore. Same supply of coal and wood as during first years.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? By Batzner's.\n\nWhat year was it purchased? 1917. Price? $7.50.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China and earthenware.\n\nWhen did you first see enamel ware? About 1920.\n\nAluminum? About 1926.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought wood made some.\n\nIf you made it yourself what wood did you use? Ash.\n\nWhat kinds of laundry soap did the grocer sell? Castile soap and No. 8.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Prairie chips in Summer.\n\nAnd how did you get your fuel? Coal and wood bought at Wm dollar.\n\nDistant any changes in the use of fuels which have taken place since then?\n\nFirst started housekeeping, giving dates where possible.\n\nNo prairie chips are used anymore. Some supply of coal and wood also during first years.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Yes.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) Yes.\n\nBy whom was your first cook stove made? Kyntz Bateman.\n\nWhat year was it purchased? 1917. Price $17.50\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first use enamel ware? Around 1920.\n\nAluminum? 1926.\nDuring the 1920s dried fruits were packed in convenient 5 lb packages. There are none of these nowadays.\n\nGive a typical day's menu (breakfast, dinner, supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast:\nCereal, coffee, buns or bread, butter and eggs.\nMeat potatoes, bread, butter, milk, fruit or milk pudding.\nVegetable, applesauce, milk, bread, butter, Buns or croissants.\n\nMy husband - age 27\nMyself - 18\nBaby daughter -\n\nWhat year did you serve your first Christmas dinner in October? Sunday?\n\nRoast chicken - Potatoes, carrots, beet pickles,\nPumpkin pie & cookies.\n\nThis is our family as given above and\nmy sister and her husband - ages 20 and 30\nrespectively.\n\nHave you ever returned to almost starvation level living on one or two locally produced foods? Give details.\n\nNo.\n\nWe have always had such necessary foods as milk and butter, chicken and pork grown on the place ever since we started on the homestead. Also potatoes and vegetables such as keep for part of the winter. We have always used a lot of milk, as beverage and feedings etc.\n\nShortage of fuel was our greatest problem and for the first few years used prairie chips in summer. The coal and wood prices being almost prohibitive, and used only during the cold weather. Money was scarce so we tried to cut fuel costs to a minimum.\nMorning, the 1920s dried fruits were packed in convenient 5 oz. packages. You will notice\n\nof these nowadays.\n\nBreakfast:\nCoffee, brown sugar, milk, bread, butter, and jelly.\n\nSupper:\nMeat (hot dogs, sausages), milk, bread, or milk pudding.\n\nMy husband - age 37 -\nMyself - age 18 -\nEldest daughter -\n\nWe have always been well nourished\nthanks to milk and buttery chickens and\npork. Growing our own vegetables was essential\nfor the Homestead. Also potatoes and vegetables\nwere kept for part of the winter. We knew always\nwe had a lot of milk, so pennies and pounds dropped\nfor the first few years used for great problems and\nshortage of fuel were our greatest problem and\nsummer, the cold and wood prices being almost\nfrightening, and used only during the cold weather.\n\nMoney was scarce as we tried to cut fuel costs.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThe one outstanding article in preparing meals is the pressure cooker of today, which can be used even in remote areas where no power is available. The small gas stoves are now in common use and certainly are convenient especially during the hot months.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nIn the last ten years such foods as Lipton's Soups that come in envelopes and other soups in cans are wonderful help in preparing meals.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. Use back of page if more space is needed.\nThe one outstanding article in preparing meals is the pressure cooker of today which can be used even in remote areas where no power is available. The small gas plants are now common and certainly an convenience especially during the hot month.\n\nIn the last two years much food has been prepared by home economics classes and other groups in same and wonderful help in preparing meals.\n\nPlants and other plants have been grown under various types of hydroponic systems and results obtained show quality, methods of merchandising, and possibilities for storage, preservation and other details. (This book of)\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1917_353.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5421, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1459, 3], [1459, 2361, 4], [2361, 3369, 5], [3369, 4022, 6], [4022, 5542, 7], [5542, 7106, 8], [7106, 11550, 9], [11550, 12440, 10], [12440, 16142, 11], [16142, 16570, 12], [16570, 17696, 13], [17696, 18788, 14], [18788, 20228, 15], [20228, 21046, 16], [21046, 22034, 17], [22034, 22642, 18], [22642, 22730, 19], [22730, 22884, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]