[{"id": "443b5b398498e0ddbe191720f42ba1fbf86868c9", "text": "S-X2\n412. Markland Margaret Isabel (Mrs. George)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if they are not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMarkland, Mrs. Geo. (Margaret Isabel)\nTantallon.\n\nTo Sask., October, 1883.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES; A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PIONEER QUESTIONNAIRES\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experiences, others may cover experiences which are not applicable to you. You need not worry about answering questions which do not apply to you. Answer only those questions which you feel apply to you.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled Pioneer Life: What Did Western Canadian Pioneers Do? is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). One will be sent to you, and one will be sent back. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer occupation and churchwork\n- Pioneer farming experiences\n\nEncouragement of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Maud Isabel MacLeod\n2. Your address: 2411 Albert\n3. Date: October 1952\n4. Where were you born? (Give name of place and country): Toronto, Ontario\n5. What was your father's name and occupation?: James Douglas, Methodist Presbyterian missionary\n6. When did you come to Saskatchewan? (Give month and year): Oct. 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: I've lived in Toronto and at Brandon 1883-1887\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 11 months\n9. What were your reasons for coming West?: My father wished to get land for his four sons. He was pastor of Knox Presbyterian Church in Brandon, visited brother taught at Rapid City, from there traveled to Saskatchewan where they both took homesteads and their mother also got a homestead adjoining\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): I thought white people reading I expect an uncle came with my father or shortly before\nMarkland, Mrs. Geo. (Margaret Isabel)\nTantallon.\n\nTo Sask. - October, 1883.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Markland Isabel Markland\n2. Your address: Tantallon\n3. Date: 1883\n4. Where were you born? (Give name of place and country): Quebec\n5. What was your father's name and occupation?: Mr. Markland\n6. When did you come to Saskatchewan? (Give month and year): October 1883\n7. Mention any other places where you lived before coming to Saskatchewan, etc.: None\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you were a small child at that time).\n9. What were your reasons for coming West?\n   My father wished to go. I went too.\n   You were part of your family. Always.\n   We moved because we thought it would be better for our family.\n   We moved to find work and the beauty of the West.\n   I got a promised land promising.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Through my people. Reading newspapers. And uncle James wrote my family in letters before.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Mother & I and younger brother followed, also two sisters who taught school, sisters & teacher in nice Brandon.\n\n13. What means of transportation did you use?\n   Came by rail, having to go by Cheyapo as the road was not completed.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   1887 came to Moose Jaw and Mother stayed the night at a hotel so they moved me to her room on the bed and let up herself. We met by brother the next day.\n\n16. Where did you settle or take up land?\n   Didn't know how much with B. Moose Jaw across the Cypress, White Cane & Biggy.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Was at school in Victoria B.C., California and Winnipeg.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Never earned my living at least would pick money for any exertion.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. How did you travel to school? (Train, bus, car, etc.)\n\n14. What means of transportation did you use?\n\n15. What incidents of the journey? (Accidents, adventures, etc.)\n\n16. Where did you first stay when you arrived in Saskatchewan?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. Money for any exercise\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Geo. MacLeod June 1918\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nOnly three children and 8 grand children. My father came from England stayed with us (the Duff family) until he settled at Dantellon district 1889.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nI have 6 older brothers came first 1883, and took up land at Dantellon. There was no rail way, walked market town, Woodbine or Wapella. Another uncle, Mr. Douglas came about the same time, married my 1887 at the Ormeau's long family lived at Duff's.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI was five when we came to the farm that summer there was a terrible prairie fire. Rather scary, three brothers were playing games to save the new house my father homesteaded. Mother, oldest brother back, my self, youngest to keep log shovels hidden at back where we living mother packed a few valuable and we were preparing to flee much to my dismay, as I thought I had been left behind. We were dismayed when the fire was about ten feet from our cabin.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went to school at Woodbine, where Father took charge of Sunday Church also did medical work as he had training for his missionary work, so at least so covered charges, this was more popular also a winter in Ontario, in Victoria, two years in California with settle as there was no school near the farm. Occasionally there was church service at neighboring houses, 5 or 6 miles away, but on top of horse or wagon, sometimes horse or sled, there was a buggy to take for more important matters of the family.\n12. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date they came to Canada.\n\n21. Did anyone else come to Saskatche when you came? Yes. Who did they come as a place to settle?\n\nDuey, their child, and Bresal\n\nPlaced to my northern farm from Southwold.\n\nMoved June 1918 and been working at the farm until the present time.\n\n23. If other members of your family (brother, sisters, parents, etc.) came West before you did please state how long ago.\n\n24. Have you made any friends while living in Canada? Yes.\n\nPathetic. Yes. It was a trial to be away from home for so long.\n\n25. In what particular experiences did you meet difficulties?\n\nAnswers vary. Paying taxes was a heavy thing but we worked hard.\n\n26. Would you advise others who have been thinking about moving west to go?\n\nAnswers varies too much.\n\n27. Where did you go to school?\n\nAnswers vary widely.\n\n28. What were your chief occupations during your stay in Canada?\n\nGlassblowing.\n\nMarried Mr. Nicholson June 1918.\n\nPlaced to my northern farm from Southwold.\n25. When was the first car used in the community? \n   First I knew was 1910\n   The local riders took their horses over there.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Bought a Ford Summer of 1914\n\n27. Where was your trading center? How far from your home?\n   I believe this was near there, 3 miles from our farm.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   My family traded at M. Douglas but few people\n   But change to Dantilow where C.P.R. came in.\n   1904 1903 Mosser was formed S.E.\n\n29. How often did you shop in the early days?\n   We may have bought once a month, going to town once.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In 1913 or 14\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Remember my mother buying mail ordered\n   in 1916 groceries & dry goods and it might have been earlier.\n\n32. When did you first have a telephone and what company provided it?\n   In 1911 or 12.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came with idea of staying. The family had an idea.\n25. When was the first car used in the community? \n   - 1910\n\n26. If you owned a car before 1914, what did you buy it for?\n   - For personal use\n\n27. How far from your home was the nearest store?\n   - 3 miles\n\n28. Did you subscribe to any newspapers?\n   - Yes\n\n29. What was the name of the newspaper?\n   - The Daily News\n\n30. How often did you shop in the nearby town?\n   - Weekly\n\n31. How many people attended the town meetings?\n   - 100\n\n32. How many people attended the town meetings?\n   - 100\n\n33. When did you first have a telephone?\n   - 1911\n\n34. When did you come to Saskatchewan the first time?\n   - 1912\n\n35. When did you make up your mind to stay permanently?\n   - 1913\n\n36. Why did you make this decision?\n   - To be closer to family and friends\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nLack of the rail road has encouraged some, these people found homes elsewhere.\n\n35. Did many people move away during the 1930's? Did many return?\n\nBrothers and some family moved in '31. Did not return. A few others went to Peace River Country.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nFather became member of Parliament - in 1896 because he was late at Premier's dinner. Mother organized first Methodist - she was Miss Sarah Chandler, in Motomoy. She died early in Presbyterian Church.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy husband, Mr. MacLeod, had one of first autos. (Six came to mind) 1915. Also a combine (not satisfactory). Since I have learned there was another combine used by C. and Shand in some places near Campbell earlier than ours. It was a very large cloudy affair, 5 or 6 years earlier.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nOur farm was named Dartelow, after Dartelow Castle Scotland, home of the Douglas' in history and near my father's home. He located it because a P.O. was early there about 1896 coming by horse stage from Motomoy. When railway came, the place was moved to little Village and kept its name. The avenue to east named after Baron de Bastien an early French settler. Elevation to west after Count Estiehag, Hungarian who brought Hungarian cattle there. Holay & Co. named by Macleod & East. But now belongs to Campbell. School in Dartelow.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe Agricultural Societies' records (noted) included records up to 1885. Church records need more. Ladies Aid and Women's Institutes' records also. Also 200 ft + photos. Also old photos of first football & hockey teams. These would be very nice.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMargaret, Mrs. Ralph Miller, living at Hope Lake, Saskatchewan. Mrs. M. B. Johnson, lived at Hope Lake, Saskatchewan. Douglas, graduated in Biological Engineering, Saskatoon University, employed in British Columbia, lives in British Columbia. Grandchildren live with parents (all school).\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads, electric power, telephone, good church, schools, movies, (though few attended), school organized sports, agricultural fairs, several up to date stores.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. & Mrs. Brown, living at Hope Lake, Saskatchewan. Mr. & Mrs. Ormiston, living at Hope Lake, Saskatchewan.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical records material:\n\nDo you have any personal items or do you know the whereabouts of diaries, letters, old photos, and programs? Please include any old photographs, written recollections, and reminiscences.\n\nThe Aboriginals also provided essential services to the area and were very generous.\n\nWould you or the person who owns them either donate them to:\n\n(1) be willing to lend them to the Provincial Archives for organizing?\n\n(2) be willing to present them to the Archives Division of the Legislative Library Region, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nMary and Mr. Robert had two boys, George and Robert.\n\nMary's mother was Mary Ann Smith, a Douglas, who died in 1850.\n\nMary's father was Robert Smith, a carpenter.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPaul Wood, (signature) Calgary\n\nPaul Wood, (signature) Calgary\n\n42. Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_412.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5086, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 49, 4], [49, 2024, 5], [2024, 3870, 6], [3870, 5151, 7], [5151, 6302, 8], [6302, 7521, 9], [7521, 8123, 10], [8123, 10191, 11], [10191, 11303, 12], [11303, 12839, 13], [12839, 13597, 14], [13597, 15753, 15], [15753, 15753, 16], [15753, 17557, 17], [17557, 18833, 18], [18833, 18833, 19], [18833, 18987, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]