[{"id": "d1b1df154dc66254c53a0883db50148a2f2fdbf0", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName ____________________________\nAddress _________________________\nBirthplace _______________________\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ____________________________\n\nWhere did you set up housekeeping? _____________________________________________\n\nWhere had you been living before that? _________________________________________\n\nFor how many people did you prepare meals? ____________________________________\n\nHow far was it to your nearest store? ____________________________________________\n\nHow often could a visit be made to the store? ____________________________________\n\nWhat groceries did you usually buy in those earliest years? _________________________\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ____________________________\n\nIn what quantities did you buy it? ________________________________________________\n\nWhat was the usual price per hundred pounds of white flour? ________________________\n\nHow much did you use graham flour? ____________________________________________\n\nWhole wheat flour? ____________________________________________________________\n\nWas flour milled locally? _____________________________________________________\n\nWhat was the price for a twenty pound bag of rolled oats? __________________________\n\nWhat other grain products did you use? _________________________________________\n\nCornmeal? __________________________________ Whole Wheat? ____________________\n\nFarina? __________________________________ Other? ____________________________\n\nDid you grind your own wheat for porridge? ____________________________________\n\nHow did you grind it? ________________________________________________________\nBRIDLE, MRS. CHARLES\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Charles Bridle\nAddress: 1220\nBirthplace: England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1913\nWhere did you set up housekeeping? Saskatoon\nWhere had you been living before that? England\nFor how many people did you prepare meals? 5\nHow far was it to your nearest store? 5 miles\nHow often could a visit be made to the store? 5 times a week\nWhat groceries did you usually buy in those earliest years? Sugar, coffee, bacon\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Standard\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? $3.65\nHow much did you use graham flour?\nWhole wheat flour? Yes\nWas flour milled locally? No\nWhat was the price for a twenty pound bag of rolled oats? $0.40\nWhat other grain products did you use? Cornmeal, Farina\nOther?\nDid you grind your own wheat for porridge?\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.65.\n\nWhat brand of golden corn syrup did you use? Rogers, Armstrongburg.\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price? $9.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? [Handwritten]\n\nButter? [Handwritten]\n\nEggs? [Handwritten]\n\nWhat was the price of butter? [Handwritten]\n\nDid you pick eggs for winter? [Handwritten]\n\nDid you make butter? [Handwritten]\n\nDid you make cheese? [Handwritten]\n\nWhat kind of cheese? [Handwritten]\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, Pork, Poultry.\n\nHow did you get fresh meat? [Handwritten]\n\nHow often did you get fresh meat? During the 1920s.\n\nHow did you preserve meat? By canning.\n\nWas there a \"beef ring\" in your neighborhood? [Handwritten]\n\nIf so, what year was it organized? [Handwritten]\n\nDid you use game? [Handwritten]\n\nFor how long? [Handwritten]\n\nWhat part did fish play in the family diet? [Handwritten]\n\nWas the fish fresh, cured, or canned? [Handwritten]\n\nKinds? [Handwritten]\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea at what price? $1.50.\n\nWhat kind of coffee did you buy? (beans or ground) Ground coffee at what price? $2.50.\n\nWhat other beverages were used? Hot chocolate.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.50.\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1912, Cabbage 1912, Carrots 1912, Onions 1912,\n\nTurnips 1912, Beets 1912.\n\nIn what quantities did you buy white navy beans? 20 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight? 25 lbs.\n\nHow did the grocer handle prunes (by box)? By the box.\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? Bought by 25 lbs.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Yes, corn? Yes, beans? Yes, Saskatoons? No.\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1915.\n\nWhat year did you first preserve vegetables by canning? 1915.\n\nWhat year did you first preserve meat by canning? 1915.\n\nDo you still preserve foods by canning or drying? Yes.\n\nTo what extent? Just a lot, about 400 quarts.\n\nDid you make your own vinegar? Yes.\n\nAt Dana there was a profusion of lovely wild raspberries & strawberries. I think that was really my first attempt at canning fruit, in 1906-1907-1908.\n\nPineberries.\n\nGooseberries.\n\nHigh Bush cranberries.\n\nWayne nuts.\n6. NEW VEGETABLES. At what prices? $1.50\n\n7. VEGETABLES AND FRUITS. What was the price of potatoes per bushel when you set up housekeeping? $1.50\n\n8. PRESERVING. In the early years did you preserve any foods by freezing or canning? Yes\n\n9. To what extent? Did you make your own vinegar? Yes\n\n10. Bush Groceries.\n9. Please fill in the following to the best of your memory:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Are you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|----------------------------------|---------------------|\n| Soda biscuits         | 1905                                          | 3 units 20 lb/box                                 |                                  |                     |\n| Macaroni              |                                               |                                                  |                                  |                     |\n| Graham flour          |                                               |                                                  |                                  |                     |\n| Brown sugar           |                                               |                                                  |                                  |                     |\n| Molasses              |                                               |                                                  |                                  |                     |\n| Table salt            |                                               |                                                  | 5¢ each                          |                     |\n| Common salt           |                                               |                                                  | 85¢ per 10 lb                    |                     |\n| Lily white syrup      |                                               |                                                  | 99¢ per 10 lb                   |                     |\n| Toilet soap           |                                               |                                                  | 5¢ a bar                         |                     |\n| Baking powder         |                                               |                                                  | 25¢ a lb                        |                     |\n| Baking soda           |                                               |                                                  | 10¢ a lb                        |                     |\n| Dried peas            |                                               |                                                  |                                  |                     |\n| Dried corn            |                                               |                                                  |                                  |                     |\n| Vinegar               |                                               |                                                  |                                  |                     |\n| Raisins - seeded      |                                               |                                                  | 18¢ a lb                        |                     |\n|                      |                                               |                                                  |                                  |                     |\n|                      |                                               |                                                  |                                  |                     |\n| Rice                  |                                               |                                                  |                                  |                     |\n| Currants              |                                               |                                                  |                                  |                     |\n| Store jam - kinds?    |                                               |                                                  |                                  |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               | 25¢ a bottle                                 |                                                  |                                  |                     |\n| Salt                  | 100 lb sack in 1914 was 85¢ a 100             |                                                  |                                  |                     |\n\nD. BAKING\n\nWhat type of yeast did you use? Royal Yeast? Home made Potato Yeast\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon         |                                        |                               |                                                 |\n| Canned sardines       | 5¢ a tin                               |                               |                                                 |\n| Other canned fish     |                                        |                               |                                                 |\n| Apples - fresh        | about 5¢ a barrel, from but.           |                               |                                                 |\n| dried                 |                                        |                               |                                                 |\n| Lettuce               |                                        |                               |                                                 |\n| Tomatoes - fresh      |                                        |                               |                                                 |\n| canned                | 15¢ a can                             |                               |                                                 |\n| cabbage               | 1¢ a lb.                              |                               |                                                 |\n| Bananas               |                                        |                               |                                                 |\n| Carrots               | 2¢ a lb.                              |                               |                                                 |\n| Lemons                |                                        |                               |                                                 |\n| Yummys                | 1¢ a lb.                              |                               |                                                 |\n| Trusses               | 3¢ a lb.                              |                               |                                                 |\n| Parsnips              |                                        |                               |                                                 |\n| Cornflakes            |                                        |                               |                                                 |\n| Other prepared        |                                        |                               |                                                 |\n| breakfast cereals     |                                        |                               |                                                 |\n| - five names          |                                        |                               |                                                 |\n| Pearl tapioca         |                                        |                               |                                                 |\n| Minuto tapioca        |                                        |                               |                                                 |\n| Sago                  | yes                                   |                               |                                                 |\n| Dates                 | yes                                   |                               |                                                 |\n| Walnuts               | yes                                   |                               |                                                 |\n| Icing sugar           | yes                                   |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n1906. Well near Slough.\n1914. Near House.\n1945. Basement Pump.\n1945. Well near Barn & Electric Motor Pump.\n13. SOAP\n\nDid you buy laundry soap or make your own? Royal Brown Soap.\n\nIf you made your own, did you use lye? Yes, good ashes?\n\nWhat kinds of laundry soap did the grocer handle? Royal Brown Soap.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the Bank.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n1906. Wood at Dana Bank\n1912 Coal & Wood Simpson\n1915 Coal & R.R. Yer at Elmo\n1945 Coal in furnace at Watson Bank\n1945 Electric stove to cook with.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Royal Brown Soap Iron Range.\n\nWhat year was it purchased? 1905 Price? $100.00\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron\n\nFor preparing food? (china, earthenware, wooden bowls, other) China\n\nWhen did you first see enamel ware? About 1912\n\nAluminum? 1920\n13. STAPLES\n\nDid you buy lumber once or make your own? If so, how much did you pay?\n\nThat kind of lumber did you buy? How much did you pay?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? What kind?\n\nThere did you get your fuel?\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy then was your first cook stove purchased? That year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteaded)\n\nTypes of food cooked (chili, cornbread, baked beans, etc.)\n\nSupplies used for...\n16. **SHAPPINGS AND CONTAINERS**\n\nMention any shappings which you recall in the shappings and containers received with the food you purchased (give dates where possible).\n\nSugar in Muslin Sack(s) 1910.\nSoda Biscuits in Wooden Box(es) 1915.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1906 Breakfast: A Oats, Fried Pork & Potatoes Bread Butter Coffee\nBraised Pork, Potatoes Vegetable Pudding\n\nSupper Cold Meat Potatoes Pickles Cake & Bottled Fruit.\n\n1906 Mrs Sarah Emma Handley 36 Homesteader at Dance Hall\nJoseph 18 Son\nFlora Emily 12 Daughter\nMarissa Louise 10\nLucile Strong Step Daughter 10\n\nMother's\n\nThat year did you serve your first Christmas dinner in western Canada? 1906\n\nGive the menu. List those present and give their approximate ages at that time.\n\nall the above, to a family by the name of Douglas who also Homesteaded near Batha which is now Yotshi\n\n1906 also William Bonar Homesteader.\n\n1906 Dave\n1906 Herbert Arthur Fischer new P.O. at Yotshi said\n1907 Two Bachelors Charlie & Tom Wilson came,\n1905 John Young was a farmer near Reino, now is operated by his son Thomas Young.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. Yes.\n\nMy Brother Herbert Fischer had to eat plain boiled Wheat & Shot Bread for Meat in 1905. In the fall of 1905 my Mother who lived in Wpg. at that time, shipped them up a parcel for Xmas. They were so hungry they ate it all on the way home from town.\n\nThere was no school for me to attend at that time. No phones or neighbors near us.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nWe used to send to Eaton's in Winnipeg to buy what we thought was enough groceries to last all winter. In the Winter of 1906, snow was very deep, so we had to always carry a gun in the sleigh as there was lots of wild animals, coyotes, bears, lynxes, wolves, lynxes, wild cat. My brother shot a wild cat I brought it in the house. I have also helped my brother trap wolves, minks, muskrat, badger. I think I to stretch the pelts. I have also helped load the cartridges when empty. In the Winters of 1906-7 & 8, the trains used to get stuck in the snow drifts, so we used to put up the crew to supply food.\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and regular foods in other ways during pioneer days in Newberry Township.\n\nInclude items not mentioned above, quality, methods of purchase, prices, problems of storage, shortages and other details. Use back of page if more space is needed.\n\nIn the winter of 1910-11, snow was very deep. I remember we always carried a gun in the building so there was no lack of wild game. We bought a Wild Goose from Mr. Graham. We also helped my parents hunt for Wild Goose. We brought it in the house. We also hunted for Woodchuck (Badger) and brought them to the cellar. We also hunted for Squirrel. We also hunted for Rabbit. We also hunted for Muskrat.\n\nWe bought the Cassells' goods when empty. We used to go to the winter of 1910-11. The Cassells used to sell us our supplies good.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M6\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_315.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4795, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 2030, 3], [2030, 3299, 4], [3299, 4444, 5], [4444, 4444, 6], [4444, 6034, 7], [6034, 6346, 8], [6346, 11106, 9], [11106, 11106, 10], [11106, 15776, 11], [15776, 15776, 12], [15776, 16886, 13], [16886, 17551, 14], [17551, 19283, 15], [19283, 19283, 16], [19283, 20487, 17], [20487, 21500, 18], [21500, 21647, 19], [21647, 21801, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]