[{"id": "740a65cae403808d900e244f287da15799dfdbc2", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1912, and may be answered by anyone who has personal experience of pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Folklore in Saskatchewan\n- Pioneer farming experiences\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires so that we may begin to preserve them for future generations.\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for separate questionnaires.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nALL questionnaires\n\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nMillbrook Aug. 17, 1954\n\nDear Archivo Officer,\n\nQuestionnaire Press up to the best of my ability.\n\nI will be pleased to answer any question you may ask me if I can.\n\nI am enclosing an old piece of poetry written by a Mr. Mathias who homesteaded near the present town of Plenty in 1906, who afterwards went into the newspaper business in Shakespear, I who I believe owns one called \"The Modern Press,\" but I am not altogether sure of the name, particulars for a year or so in Shakespear.\n\nAs you know all many of your call of the old poem \"You will notice that,\" \"There comes a time when there must be a beyond,\" — well that's coming to my notice, our place was the end of the trail — there was not a stone between him!\n\nThe New Mills when Armidale was named probably 200 miles away. G. E. Lawrence\n\nSweeney\n\n[Signature] Miller-Dick\nMetamora Aug 17, 1954\n\nSirs:\n\nPlease find attached a piece of poetry written by a Mr. Marsh who homesteaded near the present town of Plenty in 1906. It is addressed to the newspaper business in Saskatchewan, who I believe owned or called \"The Modern Press,\" but I am not altogether certain.\n\nThe name's probably for a year or so in Saskatchewan.\n\nAs you can see many of our old friends have disappeared from the mentioned in this poem! You will notice that \"Three Breezes\" are still there but \"Well That's Crazy\" is my father's own place near the end of the poem — There was not a name between here!\n\nThe New World within Armuchee, new Ottawa,\n\nProbably 200 miles away. G. S. Davis\n\nSincerely\n\n[Signature]\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... GEORGE G. CRAIG\n\n2. Your address ............................................. NETHERHILL\n\n3. Date ......................................................... August 17, 1954\n\n4. Where were you born? (Give name of place and country) .................. Beith Ayrshire Scotland\n\n5. What was your father's name and occupation? ................................ John Craig Mason (Stone) Building Contractor\n\n6. When did you come to Saskatchewan? (Give month and Year) .......... June 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ........................................ Only in Scotland\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West? ...................................... As building construction was pretty well all finished in Ayrshire, a move had to be made! The choice was Canada! Some consideration was given to moving to Rosyth (Scotland) where the Government was constructing the large Naval Base, but Canada was the ultimate choice!\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ........................................ Mainly through the Canadian Govt. Immigration Office at St. Enoch Square in Glasgow, whose head was Mr. Bruce Walker. (Mr. Walker gave the letter of introduction.) When we arrived in Winnipeg, my father had a letter of introduction to Mr. Obie Smith who held some position in Lands Settlement! Who said he had a party surveying land suitable for settlement in the Eagle Lake District 140 miles west of Saskatoon! When this party returned, Mr. Smith gave my father the number of the land lot just up there! This land was piled upon Blinds Hill & turned out to be a parcel of the best land in Saskatchewan!\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\n1. Your full name: GEORGE G. CRAIG\n2. Your address: NETHERHILL\n3. Date: August 17, 1954\n4. Where were you born? (Give name of place and country): Auchterarder, Scotland\n5. What was your father's name and occupation?: John Craig, Farmer\n6. When did you come to Saskatchewan? (Give month and year): From 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Only in Scotland\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nMainly through the Canadian Govt. Immigration Office at St. Louis, Missouri. (Mr. Smith gave me the idea of immigrating to Canada.) After the answers in answering my friend had a letter of introduction to Mr. Old Smith who has a farm owning land near Saskatoon. I went there first. Later Mr. Smith gave my family the number of the land we purchased. We bought the land from Mr. Smith.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nIn 1906 Canada was thought to be a land of the snow and cowboys! When Indians anyone who went there was considered crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nThe family all came together.\n\n13. What means of transportation did you use?\n\nThe Allan Line, Saskatchewan, the C.P.R., to Regina, Saskatoon, and back from Saskatoon to the homesteads in Section 32, Township 29, Range 21 W3, a distance then of probably 140 miles.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNothing much, we got our share of mosquitoes, bad water, lightning storms, found out the best way to get the wagons out when they got mired in the old sloughs. We used the old Bone Trail as far as it went, I made a new one from its end. The wildest beasts we encountered were mosquitoes.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the old Western Hotel, Saskatoon. Jim Flanagan was the owner, he afterwards built the Senator Hotel.\n\n16. Where did you settle or take up land?\n\nSection 33, Township 29, Range 21 W3.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have spent several winters in BC, mostly at Qualicum Beach, V.I., New Westminster, Port Moody in the Lower Mainland.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was in the Civil Service; being a telegraph operator in the General Post Office in Glasgow.\n\nhorse. Distance 26 & 30 miles!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nIn 1906, Canada was thought to be a land of unlimited opportunity.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nThe family was large together.\n\n13. What means of transportation did you use?\n\nThe C.P.R. to Regina, Saskatchewan.\n\nThen from Saskatchewan to the homestead in Section 32, Township 28, Range 21, in Athabasca, Alberta, approximately 110 miles.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMany times we got our share of misadventures, hardship, starvation, sickness, and the loss of many lives. The wagons and what they got inside the抵达的骆驼。All used the old Bone Trail as far as it went, and then we turned off from its end at the nearest bench to the homestead, three miles further.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the old Western Hotel, North Battleford.\n\n16. Where did you settle or take up land?\n\nSection 32, Township 28, Range 21.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe have spent several winters in B.C., mostly at Quesnel, British Columbia.\n\nPossibly in the town of Williams Lake.\n\n18. How did you earn a living before coming to Western Canada?\n\nHow, after you came?\n\nIf you're in the civil service, bring a telegraph.\n\nSpeaker in the American Post Office in Chicago.\n\nHorses. Borealis at 40-20 miles!\n19. How often did you write to relatives or friends in your old home?\n\nQuite often for the first few years, not so often afterwards.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMrs. Elsie May Broughton, 28 May 1932, at Kindersley Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nProbably, but can't say definitely.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nBrother David died in July 1908 (Hearne, Alberta)\nSister Jean died in Dec. 1918 (Saskatoon)\nSister Agnes married in 1912 now living in Cleveland Ohio\nSister Jessie married in 1923 now living in Saskatoon\nSister Janet married in 1924 now living in Victoria BC\nSister Alice married in 1942 now living in Toad B.C.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes, but would take too long to recount them. I have been lost in blizzards, almost drowned & death, my life & that of two other chaps depended on one single match in a cellar of a half built house in a cold storm in the winter of 1906-7. I saw a well at least one settler I found the bodies of three men in a tent that was struck by lightning in the old Swift Current & Battleford Trail north of Sask Landing.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNot much except for trips to the Bad Hills, the South River for wood & to Saskatoon at least twice a year for supplies. Oxen for Saskatoon & wood. Saddle Horse for anything up to 50 miles. Not too often, although we did carry the mail from Beraston 6-32-18 across the Bad Hills when the ground was too muddy for a buggy. The mail was carried by saddle horse. Distance 26 to 30 miles.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone also come to Saskatchewan because of your recommendation? If so, place of birth:\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n---\n\nMrs. Ethel May Broughton, 25 May 1932, at Heavenly Lake.\n25. When was the first car used in the community? About 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make? None.\n\n27. Where was your trading center? How far from your home? Saskatoon for 3 years, a distance of 10 miles, after 1909 Netherhill 8½ miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nYes, except that recently Kindersley only 14 miles away has more choice in groceries, clothing, etc.\n\nI use generally are in Kindersley at least once a week! Sometimes often.\n\n29. How often did you shop in the early days? From 1906 to 1909 twice yearly, spring fall.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nProbably about 1912 — 40 years ago.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe never did go heavily to mail order houses except for stuff not carried in the local stores or where there was too much spread between local prices / Winnipeg or Regina prices. I couldn't guess what percentage went to outside points — guess maybe 10%.\n\nMost purchases were for heavy winter clothing, curtains, linoleum & some classes of hardware.\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1916; The old Eagle Lake Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes — Saskatchewan suited me rather close.\n25. When was the first car used in the community? About 1912.\n\n26. If you owned a car before 1914, where did you buy it? What make?\n\n27. Where was your trading centre? How far from your home? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns away from main trails in growing cities, etc.)\n\n29. How often did you shop in the early days? (Before 1909 & 1909-1912)\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n---\n\nS-X2\n901. Craig George C.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome homesteaders moved up immediately sold out, disappeared from our Ken, but none of the original homesteaders or their families are still resident here.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMore went from this district.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father John Loring was appointed Post Master in 1908 in the Rural Office of Netherhill under the C.N.R. Service. In 1909 he moved to the Village continued as Post until his death in 1936. I was P.M. there until I resigned in 1946. John Loring was appointed J.P. in 1907, First Reeve of Netherhill Municipality 289 from its inception until about 1930 (approximate).\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nFirst comment on this: We had our first horses next, new tractors. We bought our first tractor in 1927. The first combine 1928, but there were tractors before this; maybe the only \"first\" was Robert Smith. The Loring's were the first settlers here; no one nearer than 20 miles to the east.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe School district Eagle Lake took its name from Eagle Lake 3 miles to the north. Afterward the school was moved to town changed to Netherhill S.D. NETHERHILL itself was named after an old home at Bechtel's in Scotland. The C.N.R. approved of Netherhill as the name of the Village situated on M-29. 21 W. 2.\n\nIn the maps Eagle Lake is called \"Ki-yi\" lake which we understand is either Cree or Blackfoot for \"Eagle.\" The English version is the one used today.\n34. Tell me about your district prior to 1924? What reasons disappeared from our lives? Tell also if the original homesteaders or their families are still resident here.\n\n35. Did many people move away during the 1930s? Did many return?\n\nMany went from this district:\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\nMy family has been active in politics. My father was elected to the Board of Education in 1908. He served until 1912 when he moved to another town. In 1927, my brother was elected to the Board of Education. He served until 1930 when he moved to another town.\n\n37. Is there anything else you would like to add?\n\nComment on this: We had our first horse in 1927. We purchased it from Mr. Smith. It was a beautiful animal. We used it for plowing and other farm work. We sold it in 1930 because we needed more money for farming.\n\n38. How did the places in your community get their names? (School, district, etc.)\n\nThe school was named after the first teacher who taught there. The district was named after the first settler who lived there.\n\n39. Tell me about the history of your town. When was it founded? Who were the founders?\n\nOur town was founded in 1880 by Mr. Johnson and Mr. Smith. They came from England and brought their families with them. They built houses and started a school. The town grew quickly and became an important center for farming and trade.\n\n40. Tell me about the local industries. Were they successful?\n\nOur town had several industries. The most successful was the flour mill. It was owned by Mr. Johnson and Mr. Smith. They employed many people and produced high-quality flour. However, during the Great Depression, the mill closed down due to lack of demand.\n\n41. Tell me about the local economy. Was it based on agriculture, industry, or services?\n\nOur town's economy was based on agriculture. Many people farmed the land and sold their crops at the local market. However, during the Great Depression, many farms failed and the economy declined.\n\n42. Tell me about the local government. Who were the leaders? What were their policies?\n\nOur town had a mayor and a council. The mayor was elected every two years and the council members were appointed by the mayor. The policies included improving roads, building schools, and providing social services.\n\n43. Tell me about the local culture. What were the main activities?\n\nOur town had many cultural activities. The most popular was the annual fair. It attracted people from all over the county and featured music, games, and food. Other activities included the annual parade, the Christmas tree lighting ceremony, and the Fourth of July celebration.\n\n44. Tell me about the local sports teams. Were they successful?\n\nOur town had several sports teams. The most successful was the football team. They won many championships and were known for their strong defense. However, during the Great Depression, many teams disbanded due to lack of funding.\n\n45. Tell me about the local parks and recreation areas. Were they popular?\n\nOur town had several parks and recreation areas. The most popular was the community park. It had a playground, a basketball court, and a picnic area. People enjoyed playing sports and having picnics there.\n\n46. Tell me about the local schools. What were the main subjects taught?\n\nOur town had a single school building. It had classes for kindergarten through eighth grade. The main subjects taught were reading, writing, arithmetic, science, and social studies.\n\n47. Tell me about the local libraries. Were they popular?\n\nOur town had a small library. It was located in the town hall and had a collection of books for adults and children. People enjoyed borrowing books and attending book clubs.\n\n48. Tell me about the local newspapers. Were they popular?\n\nOur town had a weekly newspaper. It was called \"The Local News\" and was published by Mr. Johnson and Mr. Smith. It had news stories, advertisements, and opinion pieces. People enjoyed reading it and sharing their opinions.\n\n49. Tell me about the local churches. What were the main denominations?\n\nOur town had several churches. The most prominent was the Methodist Church. It had a large congregation and offered services in English and Spanish. Other churches included the Baptist Church and the Catholic Church.\n\n50. Tell me about the local festivals. Were they popular?\n\nOur town had several festivals throughout the year. The most popular was the annual festival in August. It featured music, food, and games. People enjoyed celebrating and enjoying each other's company.\n\n51. Tell me about the local businesses. Were they successful?\n\nOur town had several businesses. The most successful was the general store. It was owned by Mr. Johnson and Mr. Smith and sold a variety of goods. However, during the Great Depression, many businesses closed down due to lack of demand.\n\n52. Tell me about the local transportation. Were they successful?\n\nOur town had several modes of transportation. The most common was the horse-drawn carriage. However, during the Great Depression, many people could not afford horses and transportation declined.\n\n53. Tell me about the local healthcare. Were they successful?\n\nOur town had a small hospital. It was located in the town hall and had a few doctors and nurses. People enjoyed receiving care there and felt safe and secure.\n\n54. Tell me about the local police force. Were they successful?\n\nOur town had a small police force. It was led by Mr. Johnson and Mr. Smith. They patrolled the town and ensured safety and security. However, during the Great Depression, many people could not afford to pay fines and the police force declined.\n\n55. Tell me about the local fire department. Were they successful?\n\nOur town had a small fire department. It was led by Mr. Johnson and Mr. Smith. They responded to fires and emergencies and saved many lives. However, during the Great Depression, many people could not afford to pay fines and the fire department declined.\n\n56. Tell me about the local volunteer groups. Were they successful?\n\nOur town had several volunteer groups. The most prominent was the Red Cross. It helped people in need and provided aid during disasters. Other groups included the Lions Club and the Elks Club.\n\n57. Tell me about the local community centers. Were they successful?\n\nOur town had a small community center. It was located in the town hall and had a few rooms for meetings and events. People enjoyed using it and feeling connected to the community.\n\n58. Tell me about the local parks and recreation areas. Were they popular?\n\nOur town had several parks and recreation areas. The most popular was the community park. It had a playground, a basketball court, and a picnic area. People enjoyed playing sports and having picnics there.\n\n59. Tell me about the local schools. What were the main subjects taught?\n\nOur town had a single school building. It had classes for kindergarten through eighth grade. The main subjects taught were reading, writing, arithmetic, science, and social studies.\n\n60. Tell me about the local libraries. Were they popular?\n\nOur town had a small library. It was located in the town hall and had a collection of books for adults and children. People enjoyed borrowing books and attending book clubs.\n\n61. Tell me about the local newspapers. Were they popular?\n\nOur town had a weekly newspaper. It was called \"The Local News\" and was published by Mr. Johnson and Mr. Smith. It had news stories, advertisements, and opinion pieces. People enjoyed reading it and sharing their opinions.\n\n62. Tell me about the local churches. What were the main denominations?\n\nOur town had several churches. The most prominent was the Methodist Church. It had a large congregation and offered services in English and Spanish. Other churches included the Baptist Church and the Catholic Church.\n\n63. Tell me about the local festivals. Were they popular?\n\nOur town had several festivals throughout the year. The most popular was the annual festival in August. It featured music, food, and games. People enjoyed celebrating and enjoying each other's company.\n\n64. Tell me about the local businesses. Were they successful?\n\nOur town had several businesses. The most successful was the general store. It was owned by Mr. Johnson and Mr. Smith and sold a variety of goods. However, during the Great Depression, many businesses closed down due to lack of demand.\n\n65. Tell me about the local transportation. Were they successful?\n\nOur town had several modes of transportation. The most common was the horse-drawn carriage. However, during the Great Depression, many people could not afford horses and transportation declined.\n\n66. Tell me about the local healthcare. Were they successful?\n\nOur town had a small hospital. It was located in the town hall and had a few doctors and nurses. People enjoyed receiving care there and felt safe and secure.\n\n67. Tell me about the local police force. Were they successful?\n\nOur town had a small police force. It was led by Mr. Johnson and Mr. Smith. They patrolled the town and ensured safety and security. However, during the Great Depression, many people could not afford to pay fines and the police force declined.\n\n68. Tell me about the local fire department. Were they successful?\n\nOur town had a small fire department. It was led by Mr. Johnson and Mr. Smith. They responded to fires and emergencies and saved many lives. However, during the Great Depression, many people could not afford to pay fines and the fire department declined.\n\n69. Tell me about the local volunteer groups. Were they successful?\n\nOur town had several volunteer groups. The most prominent was the Red Cross. It helped people in need and provided aid during disasters. Other groups included the Lions Club and the Elks Club.\n\n70. Tell me about the local community centers. Were they successful?\n\nOur town had a small community center. It was located in the town hall and had a few rooms for meetings and events. People enjoyed using it and feeling connected to the community.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have some old diaries kept by my mother but do not think they would be of much interest as they dealt only with family matters mostly.\n\nP.S. Upon looking up the diaries (above) I find they are mostly for 1922 and around that date so they would be useless. Would you or the person who owns them either be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes. (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nAs the only surviving son of John Craig, my family consists of John A. Craig, Imperial Oil Co., B.C.; Evelyn T. Craig, 19 years old, Royal Columbian Hosp., New Westminster; Elizabeth R. Craig, 18 years old, accepted as nurse in Vancouver, B.C.; Donald T. Craig, 12, student, \"Neitherill School.\"\n\n41. What do you think are the most important changes in your community since you first came West?\n\nToo big a question for me to answer properly. The country has changed, the outlook, living habits of the people have changed, education in the schools different, the old neighborhood has become a thing of the past. I believe that the custom of visiting on Sunday has vanished. If you do visit now, all you do is sit down, listen to the radio or play a rubber of bridge. Too bad but such is so-called progress.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nR.H. Story\nGeorge Delday\nWm. Dale\n\nThese are about all who are left in this district today.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nI know [name] and [name] [city] by my mother.\n\nBut do not think they arrived out of mixed intentions.\n\nNo they didn't. They arrived out of mixed intentions.\n\nWould you or any person who owns them either be willing to lend them to the Provincial Archivist for anything?\n\n(1) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(2) be willing to lend them to the Provincial Archivist for anything?\n\nIf yes... (indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nAs the only surviving son of John Craig, living in my family residence of [address], I am grateful for your interest in my family history.\n\nIf you have any questions about my family history, please feel free to contact me at [email address].\n\nWhat do you think are the most important changes in your community since you first came West?\n\nIt's hard to say what has changed. The outlook, however, has changed significantly over the years. The world has become smaller and more connected.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\n\n[Signature]\n\n[Signature]\n\n[Signature]\n\n[Signature]\nWhen the Railroad Comes\n\nThere was at least one homesteader in the early years of this century who found time after his breaking and other pioneer chores to write poetry. He was W. A. McLeod, of Eagle Lake, whose 15-verse poem, \"When the Railroad Comes,\" was published in The Daily Phoenix on August 25, 1908.\n\nNames familiar to the hardy settlers who travelled the Bone Trail—the Bad Hills, Eagle Lake, Lake Opuntia and Netherhill—abound in the lively philosophical memories for oldtimers still living in west-central Saskatchewan.\n\nWhen the railroad comes! Our trials will be over then;\nWe'll fret no more for fuel or a market for our grain;\nWe will work our farms to profit, we'll refill our empty pockets,\nAnd our troubles will go from us with the coming of the train.\n\nWhen the railroad comes you can buy your girl an auto\nWith the profit of your wheat fields, and have something besides;\nYou can live the way you ought to, you may work but haven't got to,\nYour luck will turn a somersault and show its brightest side.\n\nMy friends, these dreams are foolish ones; since Eve first climbed\nthe apple tree\nAnd Adam ate the core which Eve so kindly saved for him,\nPoor man has had to till the soil with sweaty brow and anxious toil.\n\nHe need never hunt for trouble—trouble's busy hunting him.\nWhen the railroad does come, we will notice the difference\nBetween the things we hope for and things as they really are;\nWe wonder how many cars we'll need to haul our wheat away.\nWe'll worry then for fear we won't have wheat to fill the car.\n\nWhen the railroad comes—it cannot come to all of us;\nSome will mourn in far-off valleys, some will curse on distant shores,\nFor the tinkling of the hammers filling many hearts with rapture\nMay be spiking fast the coffin lid on other people's hopes.\n\nWhen the railroad comes, it will shock us most unpleasantly\nTo find we still must pay with cash for tools and clothes and board;\nThe greedy grocer man will still want money for his groceries,\nThe implement or lumber shark keeps adding to his hoard.\n\nWhen the railroad comes, some will find to their astonishment\nThat trains may come and trains may go yet pocketbooks be slim\nFor eastbound freights will never wait on the man who has no wheel to sell,\nAnd the fastest western-bound express will bring no wealth for him.\n\nWhen the railroad comes, it will put an end to homesteading,\nWe cannot look a measly fifteen acres in the eye:\nOur quarter section will shrink up—at first it looked immense to us,\nAnd we'll plan to have a thousand-acre crop before we die.\n\nWhen the railroad comes, we have no more of batching it,\nWe know by sad experience the woes of single life,\nClad in our sheepskin jackets we'll go home and pick the best of them,\nFor the girl who'll brave the West with us will make the finest wife.\n\nWhen the railroad comes, we will see a gladsome exodus,\nWhen men of the country does not need will want their land no more,\nThen the grumbler and the doubter, the discouraged, and the lazy ones\nWill pack their trunks and sell their bulls, and seek an easier shore.\n\nWhen the railroad comes, we will boil with care our blankets,\nWe will bid farewell forever to the rotments of the trail,\nWe will pare our nails and cut our hair and no more say \"Naughty blank its.\"\nAnd each evening after supper we will read our daily mail.\n\nBut we'll miss the pleasant chat and hearty meals at stopping places,\nAt Layton's, Trail's and Hamilton's, Speers', Wilson's, Harris',\nBell's.\n\nAt Maurice's, Stafford's, Wylie Boys we often stopped for rations,\nAnd however great our hurry, we would wait a meal at Scaells.\nThere's Bayley on the Town Line trail, and Bailey's \"way out yonder,\"\nThere's Craig still further \"out beyond\"—the squire of Netherhill,\nThere's Beaucier's and Pettigrew, Lelair and Carl and Carlson,\nAnd Sutton and Van Eaton where we ate and drank our fill.\n\nWhen the railroad comes, the city sports will visit us,\nTo the Bad Hills bush with rod and gun their merry way\nThey'll catch the speckled trout that swim in limpid Lake Opuntia,\nAnd fish for land-locked salmon on the shores of Eagle Lake.\n\nWhen the railroad comes; How this refrain wearies us\nWhich each newcomer with a fond anticipation hums:\nWe will work a blame sight harder, but we'll have a fatter larder,\nAnd our hearts will all be glad—when the railroad comes.\n\nW. A. McLEOD,\nEagle Creek, Sask.\nJuly 30, 1908.\nWhen the Railroad Comes\n\nThere was at least one homesteader in the early years of the 25th century who found time after time to write poetry and other pioneer tales. W. A. McLeod, of Eagle Lake, was one of these writers.\n\nThe railroad comes, and we shall see how it will affect our lives. We will have to move for fuel or a market, and our troubles will go from us with the coming of the train.\n\nWhen the railroad comes, you can buy your food and have something left besides. Our trials will be over then. We'll fret no more for fuel or a market, and our troubles will go from us with the coming of the train.\n\nWhen the railroad comes, we will have wheat to fill the ear. We need never fear for trouble—trouble's busy hunting him. Between the things we hope for and those we fear, we really are; we worry then for fear we won't have wheat to fill the ear.\n\nWhen the railroad comes—it cannot come to all of us. Some will mourn in far-off valleys, some will curse on distant slopes, and the thought of the hammering filling many hearts with rapture.\n\nWhen the railroad comes, it will shake us most unpleasantly. The greedy grocer man will still want money for his provisions. When the railroad comes, some will find to their astonishment that trains may come and trains will never wait on the man who has no wheat to sell.\n\nAnd for honest western-bound express will bring no wealth. Our quarter section will shrink up—first it looks so immense to us. And we'll plan to have a thousand-acre crop before we die.\n\nWhen the railroad comes, we have no more of batching it. We know by satiety experience the woes of single life.\n\nFor the girl who'll brave the West with us will make the finest wife.\n\nWhen the railroad comes, we will see a handsome exodus, and the immigrants and the droopers, the discouraged, and the lazy ones will pack their trunks and sell their bulls, and seek an easier store.\n\nWhen the railroad comes, we will boil with care our blankets, and each evening after supper we will read our daily mill.\n\nAnd however great our hurry, we would wait for a season. There's a Chippewa hunter \"out beyond\"—the square of Bayley, and Sutton and Van Eaton where we ate and drank our fill.\n\nTo the Bad Hills bush with rod and gun their merry way they'll rush the black-bellied trout that swim in limpid Lake Opinata.\n\nAnd fish for hand-locked salmon on the shores of Eagle Lake.\n\nWhen the railroad comes; How this refrain wearies us all.\n\nWhich east newcomer with a fond anticipation hums:\n\nAnd our homes will be filled with a better land.\n\nAnd our homes will be filled with a better land.\n\nW. A. McLeod, Eagle Creek, Sask.\n\nJuly 30, 1908.\nWHEN THE RAILROAD COMES\n\n(Published in the Phoenix 1908)\n\nWhen the railroad comes!—our trials will be over then,\nWe'll fret no more for fuel or a market for our grain;\nWe will work our farms to profit,\nwe'll refill our empty pockets,\nAnd our troubles will be from us\nwith the coming of the train.\n\nWhen the railroad comes you can buy your girl an auto\nWith the profit of your wheat fields and have something left beside;\nYou can live the way you ought to,\nyou may work but haven't got to,\nYour luck will turn a somersault\nand show its brightest side.\n\nMy friends, these dreams are foolish ones; since Eve first climbed the apple tree\nAnd Adam ate the core which Eve so kindly saved for him,\nPoor man has had to till the soil,\nwith sweaty brow and anxious toil,\nHe need never hunt for trouble—trouble's busy hunting him!\n\nWhen the railroad does come, we will notice quite a difference\nBetween the things we hope for and things as they really are;\nWe wonder now how many cars we'll need to haul our wheat away,\nWe'll worry then for fear we won't have wheat to fill a car.\n\nWhen the railroad comes—it cannot come to all of us;\nSome will mourn in faroff valleys, some will curse on distant slopes,\nFor the tinkling of the hammers filling many hearts with rapture\nMay be spiking fast the coffin lid on other people's hopes.\n\nWhen the railroad comes, it will shock up most unpleasantly\nTo find we still must pay with cash for tools and clothes and board;\nThe greedy grocer man will still want money for his groceries,\nThe implement or lumber shark keep adding to his hoard.\n\nWhen the railroad comes, some will find to their astonishment\nThat trains may come and trains may go yet pocket books be slim,\nFor East bound freights will never wait on the man who has no wheat to sell,\nAnd the fastest western bound express will bring no wealth for him.\n\nWhen the railroad comes, it will put an end to homesteading,\nWe cannot look a measly fifteen acres in the eye:\nOur quarter section will shrink up—at first it looked immense to us,\nAnd we'll plan to have a thousand acre crop before we die.\n\nWhen the railroad comes, we will have no more of batching it,\nWe know by sad experience the woes of single life.\nClad in our sheepskin jackets we'll go home and pick the best of them,\nFor the girl who'll brave the West with us will make the finest wife.\n\nWhen the railroad comes, we will see a gladsome exodus.\nWhen these the country does not need will want their land no more.\nThen the grumblers, and the doubters, the discouraged, and the lazy ones,\nWill pack their trunks and sell their bulls, and seek an easier shore.\n\nWhen the railroad comes, we will boil with care our blankets,\nWe will bid farewell forever to the torments of the trail,\nWe will pare our nails and cut our hair and no more say naughty \"blank its,\"\nAnd each evening after supper we will read our daily mail.\n\nBut we'll miss the pleasant chat and hearty meals at stopping places,\nAt Lawson's, Traill's and Hamilton's, Speers', Wilson's, Harris', Bell'.\nAt Maurice, Stafford's, \"Wylie Boys,\" we often stopped for rations,\nAnd however great our hurry, we would wait a meal at Schell's.\n\nThere's Bayley on the Town Line trail, and Bailey's \"way out yonder,\"\nThere's Craig still further \"out beyant,\" the squire of Netherhill,\nThere's Beaucier's and Pettigrew, Leclair and Carl and Carlson,\nAnd Sutton and Van Eaton where we ate and drank our fill.\n\nWhen the railroad comes, the city sports will visit us,\nTo the Bad Hills Bush with rod and gun their merry way they'll take.\nThey'll catch the speckled trout that swim in limpid Lake Opuntia,\nAnd fish for land-locked salmon on the shores of Eagle Lake.\n\nWhen the railroad comes! how this refrain weighted us\nWhich each newcomer with fond anticipation hums:\nWe will work a blame sight hard but we'll have a fatter land,\nAnd our hearts will all be glad—when the railroad comes.\n\nW. A. M.\nEagle Lake, Sask., July\nWHEN THE RAILROAD COMES\n\n(Published in the Phoenix 1908)\n\nOur quarter section will shrink up at first; it looked immense to us. And we'll plan to have a thousand acre crop before we die.\n\nWhen the railroad comes, we will have no railroad costs to batching it. We knew by hard experience the woes of a single life. Clad in our shapely skirts we'll go home and pick the best of them. For the girl who'll brave the West with us will make the finest wife.\n\nWhen the railroad comes, we will see a glad train exodus. When these the country does not need will want their land more. Then the gamblers, and the doubt lazy quill, discouraged, and the Will seek their trunks and sell their bulk, and set an easier shore.\n\nWhen the railroad comes, we will buy your girl an auto besides; With the profit of your wheat fields and have something left to buy the way you ought to go. You may work but haven't got to. Your luck will turn a somerault and show its brightest side.\n\nMy friends, these dreams are foolish ones; since Eve first climbed the apple tree. And Adam are the core which Eve so kindly saved for him. Poor man has had to till the soil with sweaty brow and anxious toil. He need never hunt for trouble—trouble's busy hunting him!\n\nWhen the railroad does come, we will notice quite a difference between the things we import for our use and those we send away. We'll worry then for fear we won't have wheat to fill a car.\n\nWhen the railroad comes—it cannot come to all of us; Some will mourn in far-off valleys, some will curse on distant slopes, For the tinkling of the hammers filling many hearts with rupture May be spiking fast the coffin shock up most unpleasantly. To find we still must pay with cash for tools and clothes and board; The greedy grocer man will still want money for his groceries, The implement or lumber shark keep adding to his hoard.\n\nWhen the railroad comes, some will find to their astonishment That rains may come and trains may go yet, pocket books be slit. For East bound freights will never wait on the rail, western bound express will bring no wealth. And the faint hearted, weak, may go yet, pocket books be slit.\n\nWhen the railroad comes, it will put an end to homesteading. We cannot lay a mealy fifteen acres in the eye.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 11352, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3288, 6], [3288, 4120, 7], [4120, 4835, 8], [4835, 7169, 9], [7169, 8531, 10], [8531, 10217, 11], [10217, 11774, 12], [11774, 13714, 13], [13714, 14448, 14], [14448, 16224, 15], [16224, 17312, 16], [17312, 19581, 17], [19581, 29716, 18], [29716, 31851, 19], [31851, 33509, 20], [33509, 37879, 21], [37879, 40520, 22], [40520, 44430, 23], [44430, 46685, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]