[{"id": "4c67d944d0cfd8ec07d22ec80821f7becdf5465e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaires.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire in which all questions are applicable to everyone who has lived in western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaire:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires from\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer housing\n\nPioneer education and churchwork\n\nPioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\n\nVol. 3 1954\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Guy Hartzel Hummel\n\n2. Your address: NOKOMIS\n\n3. Date: F.A.Y. 24-1954\n\n4. Where were you born? (Give name of place and country) HUMBOLDT NEBR. U.S.A.\n\n5. What was your father's name and occupation? F.A. HUMMEL. Until 1907 he farmed. Afterwards owned and operated a small store. He died in 1918.\n\n6. When did you come to Saskatchewan? (Give month and year) March - 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. None other than my place of birth.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 22 years of age\n\n9. What were your reasons for coming West? To own land. Land was cheap in 1904-05. Also, I was raised on a farm and knew how to work the land. I thought opportunities to get started farming in Saskatchewan were numerous compared with other small settled districts.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Through other people. Reading about it. Railroad agencies supported by government information & publicity.\n\nRECEIVED\nMar 8, 1954.\n1. Your full name: Guy Hummel\n\n2. Your address: N.A.O.M.S.\n\n3. Date: March 1905\n\n4. Where were you born? (City, name of place and country): Humboldt, Neb., U.S.A.\n\n5. What was your father's name and occupation?: F.A. Hummel, Quail\n\n6. When did you come to Saskatchewan? (Give month and year): March 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: [Handwritten text not legible]\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a child.\")\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relations think of your decision to come to Western Canada? (Relatives, etc.)\n\n12. Did you travel by train or by car?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey? (Do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle at take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\nPerhaps twice a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Joseph Wells, Humboldt, Feb. 20, 1907\n\nCame to Canada in March and established our land.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, an occasional individual and family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNo other members of my family ever came west to settle. Only paid a visit.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOur three children were born in the farm house. The oldest boy, Fred, born July 6, 1911—5 A.M. He was called the day before, and the worst typhoid fever ever seen and likely stayed all night. It was the only attack back when typhoid was known. He arrived an hour later.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDid not travel much. Did attend church which was held occasionally, 1/2 mile distant. Visited friends frequently. The first two years made of travel was by wagon. Later we owned a democrat, then a rubber-tired buggy before purchasing my first car.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a pioneer to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Did you ever own a team of horses?\n25. When was the first car used in the community? In 1908 used by the Hotel Proprietor Mr. Pepper.\n\n26. If you owned a car before 1914, when did you buy it? What make? I purchased my first car in 1914. It was a Model T Ford.\n\n27. Where was your trading center? How far from your home? Nystrom. After 1909 was four miles from my home.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). Basically speaking most of my trading has been done in Nystrom. Prior to 1908 often traded in Lake City, a store located on the west side of Long Lake about 8 miles west of Superior. And at a store near where Nystrom stands today our supplies were freighted.\n\n29. How often did you shop in the early days? Seldom in early days. After railroads arrived, between four or five times a year would be our town shopping and collecting time.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? The custom, I should say started in 1910-1911.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nThe first year we were married, we purchased articles & necessities when they could not be purchased locally. Especially, T. Eaton Co., prices were cheaper than those charged by local merchants. For some time mail order was the only way to purchase goods. So mail order purchases were reduced to a minimum. The regular run of supplies now required can be purchased locally as cheap as local.\n\n32. When did you first have a telephone and what company provided it? Fall of 1911. The Nystrom Rural Tel. Co. was organized.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI proved up on my homestead in 1908. Which I traded in for a half section, even though I made up my mind to permanently reside in Sask. Have never resided anywhere else.\n25. When was the first car used in the community? (from 1908 onward)\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Indicate how much money you had)\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, a few moved to the North & West Cemetery which was opening up for settlement. Reason to improve their financial position. Which some died, and others joined.\n\n35. Did many people move away during the 1930s? Did many return?\n\nA large number moved away in the 1930s. Practically none returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nSince including year 1911 - I served as chairman and at present am serving my 3rd year as Chair of the Rural Mtn. Board #280. From 1922 consecutive years commencing 1915 I was a juror of the Peace Tribunal Mtn. A few last mentioned Cens. 1934-38. I am including a copy of the minutes of the Board, Nov. 1953 which appears an article outlining some of my activities during my 49 years residence in Board.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI assisted in forming the first agricultural society which I believe was held 1909-1910 (year unknown) assisted in organizing our first Homemakers Club. New Homestead & 2nd charter members of Homemakers chapter & the Eastern Star. I joined Philadephia Masonic Lodge in 1918 when it operated under Dispensation.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nTown of Homestead got its name from a Post Office by the same name located four miles South East where the Union is now situated when Mrs. Halstead was the pioneer Post master. When the road and can through here Mrs. Halstead became the first Postmaster. The new organized town which inherited the name, Northern.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having a car, buying a car, selling a car, or doing something else related to cars, please describe it here.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give:\n\n(a) Date of its acquisition\n(b) Any changes in names since the first name was given\n(c) Date and reason for change\n\n39. What was the name of your school district? What was the name of your post office? What was the name of your village? What was the name of your creek? What was the name of your hill?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences (describe):\n\nIf I have located any such documents or other materials which will serve for your purposes, I shall send them and let you know.\n\nWould you or the person who owns them either:\n\n(1) Be willing to lend them to the Provincial Archives for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n[Handwritten text not legible]\n\n41. What do you think are the most important changes in your community since you first came here?\n\n[Handwritten text not legible]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\n[Handwritten text not legible]\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address here:\n\n[Handwritten signature]\nTHE FACTS\nSpeak for Themselves\n\nAsk any owner of a \"Caterpillar\" Diesel Motor Grader, and you will be told without exception, of its amazing economy, of its unrivaled power and dependability. You can depend on Caterpillar to stand behind its machines on the job, and to work together with other machines in any combination.\n\nSee the CATERPILLAR No.12 Diesel MOTOR GRADER Today\n\nPLATE GLASS INSURANCE\n\nSaskatchewan Government Insurance\n\nHON. C. M. FINES\nMinister\nREGINA\n\nH. L. HAMMOND\nManager\nTHE FACTS\nSpeak for Themselves\n\nAsk any owner... any operator... of a \"CAT\" Diesel Motor Grader, and you will be told in glowing terms about its high-speed economy, of its amazing power and ruggedness, its complete versatility. You can depend on \"Caterpillar\" Motor Graders to do every job and to work together with other earthmoving equipment to make the most of any construction project.\n\n\"Caterpillar\" Diesel Motor Graders are designed and built to do every grading job more quickly and more efficiently - from ditching to bank shaping; scarifying to oil sand mining; finishing to snow-plowing. Talk to us now about your needs and you'll be talking to men who know your business.\n\nSee the CATERPILLAR No. 12 Diesel MOTOR GRADER Today\n\nKRAMER TRACTOR COMPANY LTD.\nREGINA, SASKATOON & TISDALE\nCaterpillar DISTRIBUTORS FOR SASKATCHEWAN\n\nPLATE GLASS INSURANCE\n\nSaskatchewan GOVERNMENT INSURANCE\n\nHON. C. M. FINES\nMinister\n\nREGINA\n\nH. L. HAMMOND\nManager\nON THE COVER\n\nLONG SERVICE BRINGS AWARD TO REEVE GUY HUMMEL\n\nReeve Guy Hummel of Weyburn municipality was honored recently within a summit of a Queen's Coronation medal and Mr. Hummel is still wondering how that came about.\n\nThe citation accompanying the award said it was presented for \"Outstanding Service.\" And he has tried to figure out what outstanding service he has rendered.\n\nAn examination of Mr. Hummel's background would seem to make it very evident why the honor was awarded on the basis of outstanding service.\n\nMr. Hummel has been active in local municipal affairs for 34 years all but three of which he has held the position of mayor of Weyburn municipality. During that time he has been a member of the board of directors of the Saskatchewan Association of Rural Municipalities for 12 years and its president for seven. He has served as a member of the board of directors of the Saskatchewan Municipal Hall Association for 31 years and its vice-president for the past 12 years.\n\nHis varied activities also include chairmanship of the Notomis Union Hospital board and in 1962 he served as Grand Master of the Provincial Legislature from 1984 to 1985.\n\nFormerly fifteen years he has been a highly respected farmer in the district serving a wide circle of activities which began as a justice of the peace. He retired from active farming in 1949 when he organized savings committees in Saskatchewan.\n\nA rather impressive record for the young immigrant who arrived in Canada in 1915 with a tradition of hard work and determination. He has no trouble in anyone's mind why the Queen bestowed the medal on Mr. Hummel for outstanding service.\n\nAn even more glorious designation comes to Mr. Hummel from one of his next-door neighbors who said: \"He's one of the town's outstanding citizens and a swell guy.\"\n\nThat is a citation not earned by too many people in this world.\n\nYour Board is satisfied that the establishment of efficient production methods require considerable expenditure on suitable buildings and equipment for stock and food supplies. To some extent at least, the degree of efficiency at present exists in the province, with prices fully in line with those paid in the United States. The domestic market for livestock involves a higher original investment than in itself is not enough to provide stability for the livestock producer. For example, during the year 1956, monthly average prices ranged from a low of $28.56 in January to high of $38.33 in July, a range of $9.78. Durc is sold in the cow-pot market, yet this price variation was not due to the domestic market, for the best available data shows that the domestic market for livestock producers is not large enough to provide stability for the livestock producer. If the best interests of the livestock producer are to be served, it will be necessary to bring about stability in the market for cattle. This would mean that the domestic market for cattle would be better balanced by implementing the provisions of the Agricultural Prices Support Act to make every effort in recent years to stabilize livestock prices where they do not already exist.\n\nThe experience gained during the period of the floor market in 1944 when it amalgamated with the Saskatchewan Co-operative Livestock Producers Limited. Following amalgamation, one of the first projects carried out was the establishment of public stockyards that the losses suffered by producers in the absence of support action in all parts of the province have been many times as great. There is no doubt, in our opinion, that prices to producers remove from violent production and are damaging regular markets to producers but only to the producer but to the country as a whole. In the adoption of the Wheat Pool system, the producers have been able to maintain their prices at a level that is competitive with those prevailing in the United States.\nReeve Guy Hummel of Wreford municipality was honored recently with the award of a Queen's Coronation medal and Mr. Hummel is still wondering how that came about.\n\nThe citation accompanying the award said it was presented for \"Outstanding Service.\" And Mr. Hummel is trying to figure out what outstanding service he has rendered.\n\nAn examination of Mr. Hummel's background would seem to make it very evident why he had received the medal and why it was awarded on the basis of outstanding service.\n\nMr. Hummel has been active in local municipal affairs for 34 years all but three of which he has held the position of reeve of Wreford municipality. During that time he has missed only two meetings, both due to illness. In provincial municipal circles, he has been a member of the board of directors of the Saskatchewan Association of Rural Municipalities for 12 years, and its president for seven. He has served as a member of the board of directors of the Saskatchewan Municipal Hall Association for 31 years, and its vice-president for the past 12 years.\n\nHis varied activities also include chairmanship of the Nokomis Union Hospital board, and in 1952 he served as Grand Master of the Masonic Lodge in Saskatchewan. He was a Liberal member of the provincial legislature from 1934 to 1938.\n\nFor nearly fifty years he has been a prominent, highly respected farmer in the district, enjoying a wide circle of activities which began as a justice of the peace. He retired from active farming in 1949.\n\nDuring the war he organized salvage committees in Saskatchewan for the Department of National War Services.\n\nA rather impressive record for the young immigrant who arrived in Nokomis in 1905 with a trainload of homesteaders from Nebraska—and it should leave no doubt in anyone's mind why the Queen bestowed the medal on Mr. Hummel for outstanding service.\n\nAn even more gracious designation comes to Mr. Hummel from one of his next-door neighbors, who said: 'He's one of the town's outstanding citizens and a swell guy.'\n\nThat is a citation not earned by too many people in this world.\n\nThe success of this extension of market facilities is outlined in the following excerpt from the 1949 annual report of the Wheat Pool, which states:\n\n\"Your Board is satisfied that the establishment of markets at these points, with prices fully in line with those prevailing elsewhere, has raised the basic price of livestock not only to Pool members but also to all livestock producers in the surrounding area.\"\n\nWhile the Pool now provides expert livestock marketing service at seven major centres in Saskatchewan, this in itself is not enough to provide stability for the livestock industry.\n\nThe domestic market for livestock today absorbs the major part of production, cattle and hog production. Only a small percent of livestock production is sold in the export market, yet this outlet is a strong factor in determining the domestic price. If the best interests of the livestock producer are to be served, it will be necessary to bring about stability in price and production. Stable prices and operation efficiencies can best be achieved by implementing the provisions of the Agricultural Prices Support Act to establish floor prices where they do not already exist.\n\nThe experience gained during the period of the foot-and-mouth disease embargo has shown that a floor price system can operate successfully. Critics may suggest that the losses incurred by the government during this period can be justified only under emergency conditions. It is our opinion that the losses suffered by producers and the nation, in the absence of support prices during the embargo, would have been many times as great. There is no doubt, in our opinion, that price support action fully justified itself.\n\nFurther, we are of the opinion that violent price fluctuations create emergencies which conditions are damaging not only to the producer but to the country as a whole. In the adoption\nON THE COVER\n\nREEVE GUY HUMMEL\n\nLONG SERVICE BRINGS AWARD\n\nReeve Guy Hummel of Wreford municipality was honored recently with the award of a Queen's Coronation medal and Mr. Hummel is still wondering how that came about.\n\nThe citation accompanying the award said it was presented for \"Outstanding Service.\" And Mr. Hummel is trying to figure out what outstanding service he has rendered.\n\nAn examination of Mr. Hummel's background would seem to make it very evident why he had received the medal and why it was awarded on the basis of outstanding service.\n\nMr. Hummel has been active in local municipal affairs for 34 years, all but three of which he has held the position of mayor of Wreford municipality. During that time, he has missed only two meetings both due to illness. In provincial municipal circles he has been a member of the board of directors of the Saskatchewan Municipal Hall Association for the past 12 years, president for the past 12 years.\n\nHis varied activities also include chairmanship of the Nokomis Union Hospital board and in 1962 he became a Liberal Member of the Provincial Legislature from Saskatchewan.\n\nFor nearly fifty years he has been a prominent livestock producer in the district, enjoying a wide circle of activities which began as a justice of the peace. He retired from active farming in 1949.\n\nDuring the war he organized salvage committees in Saskatchewan and during the Korean War he organized salvage committees in Saskatchewan.\n\nMr. Hummel has a record of outstanding service to his community and the nation. His services have been recognized by the Queen and he has been honored by the citizens of his town.\n\nThat is a citation not earned by too many people in this world.\nReeve Guy Hummel of Wreford municipality was honored recently with the award of a Queen's Coronation medal and Mr. Hummel is still wondering how that came about.\n\nThe citation accompanying the award said it was presented for \"Outstanding Service.\" And Mr. Hummel is trying to figure out what outstanding service he has rendered.\n\nAn examination of Mr. Hummel's background would seem to make it very evident why he had received the medal and why it was awarded on the basis of outstanding service.\n\nMr. Hummel has been active in local municipal affairs for 34 years all but three of which he has held the position of reeve of Wreford municipality. During that time, he has missed only two meetings, both due to illness. In provincial municipal circles he has been a member of the board of directors of the Saskatchewan Association of Rural Municipalities for 12 years, and its president for seven. He has served as a member of the board of directors of the Saskatchewan Municipal Hall Association for 31 years, and its vice-president for the past 12 years.\n\nHis varied activities also include chairmanship of the Nokomis Union Hospital board, and in 1962 he served as Grand Master of the Masonic Lodge in Saskatchewan. He was a Liberal member of the provincial legislature from 1934 to 1938.\n\nFor nearly fifty years he has been a prominent, highly respected farmer in the district, enjoying a wide circle of activities which began as a justice of the peace. He retired from active farming in 1949.\n\nDuring the war he organized salvage committees in Saskatchewan for the Department of National War Services.\n\nA rather impressive record for the young immigrant who arrived in Nokomis in 1905 with a trainload of homesteaders from Nebraska—and it should leave no doubt in anyone's mind why the Queen bestowed the medal on Mr. Hummel for outstanding service.\n\nAn even more gracious designation comes to Mr. Hummel from one of his next-door neighbors, who said: \"He's one of the town's outstanding citizens and a swell guy.\"\n\nThat is a citation not earned by too many people in this world.\n\nThe success of this extension of market facilities is outlined in the following excerpt from the 1949 annual report of the Wheat Pool, which states:\n\n\"Your Board is satisfied that the establishment of markets at these points, with prices fully in line with outside markets, has raised the basic price of livestock not only to Pool members but also to all livestock producers in the surrounding area.\"\n\nWhile the Pool now provides expert livestock marketing service at seven major centres in Saskatchewan, this organization does not provide stability for the livestock industry.\n\nThe domestic market for livestock today absorbs the major part of Canadian cattle and hog production. Only a small percent of livestock production is sold in the export market, yet this outlet is a strong factor determining the domestic price. If the best market for the livestock producer are to be served, it will be necessary to bring about stability in price and production. Stable prices, this organization believes, can be best achieved by improving the provisions of the Agricultural Prices Support Act to establish floor prices where they do not already exist.\n\nThe experience gained during the period of the foot-and-mouth disease embargo has shown that a floor price system can operate successfully. Critics have suggested that the losses incurred by the government during this period can be justified only under emergency conditions. It is our opinion that the losses suffered by producers and the nation, in the absence of support prices during an embargo, would have been many times as great. There is no doubt, in our opinion, that price support action fully justified itself.\n\nFurther, we are of the opinion that violent price fluctuations create emergency conditions and are damaging not only to the producer but to the country as a whole. In the adoption\nWheat Pool Submission\n\nTo The Royal Commission on Agriculture and Rural Life\n\n(Continued)\n\nTHE PROBLEMS OF PRODUCTION\n\nViolent fluctuations in the production of wheat and other cereals in Saskatchewan arise from many causes, some of them beyond human control, land or from a persistent shortage of moisture. However, many things may be done to reduce the natural variability in production by following certain practices which will help to maintain the proper use of land in these provinces.\n\nThis section of our submission will try to suggest some of the things which may be done to reduce the threat of production to suggest the proper use of land in these provinces.\n\nLand utilization, however, is only one part of the general problem of soil and water conservation. Much valuable work has been done by the provincial government in developing irrigation projects and in land management programs.\n\nThe natural hazards of grain production in Saskatchewan were aggravated in the early days. It is a commonplace of Saskatchewan agricultural history that the land under the prairie farm rehabilitation act below which would have been left in its native state. Provincial and federal governments have spent substantial amounts in recent years to return some of the land to grass. The result is by no means finished and both governments are still engaged in policies designed to correct remaining problems.\n\nLivestock Marketing\n\nLivestock marketing is essential in Western Canada and the federal government has done important explanatory work in the area. What has been accomplished in the last ten years of P.E.I. experience is that farmers in 46 municipalities qualified for assistance in five out of ten years. In 177 other municipalities, the main problem was paid off eight out of ten years.\nJanuary 10 — On or before this date where a public library has been established, in a municipality, at the first meeting of the council, the members of the library board shall be appointed. Section 20, The Libraries Act.\n\nJanuary 10 — At first meeting of the council (on or before this date) appointment of fire guardians shall be made and Minister of Municipal Affairs notified of those appointed. Subsection (1), section 61 and section 62, Prairie and Forest Fire Act.\n\nJanuary 10 — At first meeting of councils of rural municipalities, villages and towns (on or before this date) copy of the treasurer's bond and employer's statement shall be presented and a copy also forwarded to the Minister. Subsection (4), section 164, R.M. Act; subsection (4), section 164, Village Act; subsection (3), section 59, Town Act.\n\nJanuary 10 — At first meeting of new council (on or before this date) overseer of village and deputy mayor of towns and cities shall be appointed. Section 37, Village Act; section 38, Town Act; section 38, City Act.\n\nJanuary 10 — First meeting of the new council shall be held on or before this date. Subsection (1), section 29, R.M. Act; section 36, Village Act; section 29, Town Act; section 29, City Act.\n\nJanuary 10 — At first meeting of the new council (on or before this date) deputy reeve of rural municipality shall be appointed. Section 37, R.M. Act.\n\nJanuary 15 — On or before this date secretary-treasurer of villages or rural municipalities and the treasurer of cities and towns which are situated wholly or partly in a Union Hospital District shall forward to the Board a statement of the account of the municipality with the district as at December 31st in the preceding year. Section 44, Union Hospital Act.\n\nJanuary 15 — On or before this date secretary-treasurers of rural municipalities and villages shall transmit to board of trustees of school districts or school units situated wholly or partly within the municipality a statement of account as at December 31st preceding. Section 327, Village Act; subsection (8), section 349, R.M. Act.\n\nJanuary 20 — In towns and cities working under \"Special Provisions\" assessments shall insert in a newspaper not later than this date a notice in form given in section 418 of The Town Act and section 449 of The City Act. Clause 2, section 498, Town Act; clause 2, subsection (1), section 532, City Act.\n\nJanuary 20 — In towns and cities working under \"Special Provisions\" assessment notices shall be sent out not later than this date. Clause 3, section 498, Town Act; clause 3, subsection (1), section 532, City Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities the assessor shall not later than this date insert in a newspaper circulating in the municipality a notice in the form given in section 294. Paragraph 2, section 389, R.M. Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities assessor shall on or before this date send out assessment notice. Paragraph 3, section 389, R.M. Act.\n\nJanuary 31 — Not later than this date tax liens shall be forwarded to the proper land titles office for registration. Subsection (1), section 10, Tax Enforcement Act.\n\nThe Canadian Farm Loans Act and the Farm Improvement Loans Act. The Farm Loan Board lends on long-term and intermediate terms. Its long-term lendings are based on real estate first mortgages and its shorter term lendings on second mortgages. Improvement loans are financed through banks. Under the federal government program to guarantee lenders against loss up to 10 percent of the amount loaned by each. The bulk of borrowings under this act in Saskatchewan have been for the purchase of mechanized farm equipment. Under the Farm Loan Board, first mortgages may be arranged for the purchase of equipment, livestock, land and for improvements and refinancing of debts. To persons who have secured first mortgages, the board also offers intermediate credit on five-year, second mortgage loans for farm improvements.\n\nIt is worth noting that the number of loans granted in Saskatchewan under both these acts is higher than in any other Canadian province. The amounts loaned also exceed loans in other provinces.\n\nThe federal government has placed a ceiling of $200,000,000 on the losses it will pay under this plan. Its guarantee to the lending companies will cover losses up to 10 percent of the amount lent. It is evident that much more money is available under this act than has been taken up by Canadians farmers, for the total amount loaned in seven years is not much more than the government is prepared to make good in the event of loss.\n\nA further source of credit which they did not previously enjoy is now available to some Saskatchewan farmers. This money is available through the credit union movement in the province which has undergone spectacular development during the last decade. The department of cooperation reports that credit unions in Saskatchewan lent an estimated $100,000,000 to farmers for farm opera-\nJanuary 4 — Two months after election secretaries-treasurers of rural municipalities and villages shall open ballot boxes and destroy contents in presence of two witnesses. Section 133, R.M. Act; section 128, Village Act.\n\nJanuary 10 — On or before this date where a public library has been established, in a municipality, at the first meeting of the council, the members of the library board shall be appointed. Section 20, The Libraries Act.\n\nJanuary 16 — At first meeting of the council (on or before this date) appointment of fire guardians shall be made and Minister of Municipal Affairs notified of those appointed. Subsection (1), section 61 and section 62, Prairie and Forest Fires Act.\n\nJanuary 10 — At first meeting of councils of rural municipalities, villages and towns (on or before this date) copy of the treasurer's bond and employer's statement shall be presented and a copy also forwarded to the Minister. Subsection (4), section 164, R.M. Act; subsection (4), section 154, Village Act; subsection (3), section 52, Town Act.\n\nJanuary 10 — At first meeting of the new council shall be held on or before this date. Subsection (1), section 29, R.M. Act; section 36, Village Act; section 29, Town Act; section 29, City Act.\n\nJanuary 10 — First meeting of the new council (on or before this date) overseer of village and deputy mayor of towns and cities shall be appointed. Section 37, Village Act; section 36, Town Act; section 38, City Act.\n\nJanuary 10 — At first meeting of the new council (on or before this date) deputy reeve of rural municipality shall be appointed. Section 37, R.M. Act.\n\nJanuary 15 — On or before this date secretary-treasurer of villages or rural municipalities and the treasurer of cities and towns which are situated wholly or partly in a Union Hospital District shall forward to the Board a statement of the account of the municipality with the district as at December 31st in the preceding year. Section 44, Union Hospital Act.\n\nJanuary 15 — On or before this date secretaries-treasurers of rural municipalities and villages shall transmit to board of trustees of school districts or school units situated wholly or partly within the municipality a statement of account as at December 31st preceding; section 327, Village Act; subsection (8), section 349, R.M. Act.\n\nJanuary 3 — In towns and cities working under \"Special Provisions\" assessment shall insert in a newspaper not later than this date a notice in the form given in section 118 of The Town Act and section 449 of The City Act. Clause 2, section 498, Town Act; clause 2, subsection (1), section 532, City Act.\n\nJanuary 20 — In towns and cities working under \"Special Provisions\" assessment notices shall be sent out not later than this date. Clause 3, section 498, Town Act; clause 3, subsection (1), section 532, City Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities the assessor shall not later than this date insert in a newspaper circulating in the municipality a notice in the form given in section 294, Paragraph 2, section 389, R.M. Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities assessor shall on or before this date send out assessment notices. Paragraph 3, section 389, R.M. Act.\n\nJanuary 31 — Not later than this date tax liens shall be forwarded to the proper land titles office for registration. Subsection (1), section 10, Tax Enforcement Act.\n\nThe Canadian Farm Loans Act and the Farm Improvement Loans Act. The Farm Loan Board lends on long-term and intermediate terms. Its long-term lendings are based on real estate first mortgages and its shorter term lendings on second mortgages. Improvement loans are financed through banks with the federal government prepared to guarantee lenders against losses up to 10 percent of the amount loaned by each. The bulk of borrowings under this act in Saskatchewan have been for the purchase of mechanized farm equipment. Under the Farm Loan Board, first mortgages may be arranged for the purchase of equipment, livestock, seed and for improving and refinancing of debts. To persons who have secured first mortgages, the board also offers intermediate credit on five-year, second mortgage loans for farm improvements.\n\nIt is worth noting that the number of loans granted in Saskatchewan under both these acts is higher than in any other Canadian province. The amounts loaned also exceed loans in other provinces.\n\nThe federal government has placed a ceiling of $200,000,000 on the losses it will pay under this plan. Its guarantee to the lending companies will cover losses up to 10 percent of the amount loaned. It is evident that much money is available under the act that has been taken up by Canadian farmers, for the total amount loaned in seven years is not much more than the government is prepared to make good in the event of loss.\n\nA further source of credit which they did not previously enjoy is now available to some Saskatchewan farmers. This new currency is available through the credit union movement in the province which has undergone spectacular development during the last decade. The department of cooperation reports that credit unions in Saskatchewan lent an estimated $10,500,000 to farmers for farm opera-\nJanuary 4 — Two months after election secretary-treasurers of rural municipalities and villages shall open ballot boxes and destroy contents in presence of two witnesses. Section 135, R.M. Act; section 126, Village Act.\n\nJanuary 10 — On or before this date where a public library has been established in a municipality, at the first meeting of the council, the members of the library board shall be appointed. Section 20, The Libraries Act.\n\nJanuary 10 — At first meeting of the council (on or before this date) appointment of fire guardians shall be made and Minister of Municipal Affairs notified of those appointed. Subsection (1), section 61 and section 62, Prairie and Forest Fires Act.\n\nJanuary 10 — At first meeting of councils of rural municipalities, villages and towns (on or before this date) copy of the treasurer's bond and employee statement shall be presented and a copy also forwarded to the Minister. Subsection (4), section 164, R.M. Act; subsection (4), section 154, Village Act; subsection (3), section 59, Town Act.\n\nJanuary 10 — At first meeting of new council (on or before this date) overseer of village and deputy mayor of towns and cities shall be appointed. Section 37, Village Act; section 35, Town Act; section 38, City Act.\n\nJanuary 10 — First meeting of the new council shall be held on or before this date. Subsection (1), section 29, R.M. Act; section 36, Village Act; section 29, Town Act; section 29, City Act.\n\nJanuary 10 — At first meeting of the new council (on or before this date) deputy reeve of rural municipality shall be appointed. Section 37, R.M. Act.\n\nJanuary 15 — On or before this date secretary-treasurer of villages or rural municipalities and the treasurer of cities and towns which are situated wholly or partly in a Union Hospital District shall forward to the Board a statement of the account of the municipality with the district as at December 31st in the preceding year. Section 44, Union Hospital Act.\n\nJanuary 15 — On or before this date secretary-treasurers of rural municipalities and villages shall transmit to board of trustees of school districts or school units situated wholly or partly within the municipality a statement of account as at December 31st preceding. Section 327, Village Act; subsection (8), section 149, R.M. Act.\n\nJanuary 20 — In towns and cities working under \"Special Provisions\" assessors shall insert in a newspaper not later than this date a notice in the form given in section 418 of The Town Act and section 449 of The City Act. Clause 2, section 498, Town Act; clause 2, subsection (1), section 532, City Act.\n\nJanuary 20 — In towns and cities working under \"Special Provisions\" assessment notices shall be sent out not later than this date. Clause 3, section 498, Town Act; clause 3, subsection (1), section 532, City Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities the assessor shall not later than this date send out assessment notices. Paragraph 3, section 389, R.M. Act.\n\nJanuary 20 — Where \"Special Provisions\" have been adopted by rural municipalities assessor shall on or before this date send out assessment notices. Paragraph 3, section 389, R.M. Act.\n\nJanuary 31 — Not later than this date tax liens shall be forwarded to the proper land titles office for registration. Subsection (1), section 10, Tax Enforcement Act.\n\nThe Canadian Farm Loans Act and the Farm Improvement Loans Act. The Farm Loan Board lends on long-term and intermediate terms. Its long-term lendings are based on real estate first mortgages and shorter term second mortgages. Improvement loans are financed through banks with the federal government prepared to guarantee lenders against loss up to 10 percent of the amount loaned by each. The terms of borrowings under this act in Saskatchewan have been for the purchase of mechanized farm equipment. Under the Farm Loan Board, first mortgages may be arranged for the purchase of equipment, second mortgages for intermediate and refinancing of debts. To persons who have secured first mortgages, the board also offers intermediate credit on five-year, second mortgage loans for farm improvements.\n\nIt is worth noting that the number of loans granted in Saskatchewan under both these acts is higher than in any other Canadian province. The amounts loaned also exceed loans in other provinces.\n\nThe federal government has placed a ceiling of $200,000,000 on the losses it will pay under this plan. Its guarantees to the lending companies will cover losses up to 10 percent of the amount loaned. It is evident that much more money could be lent under this act than has been taken up by Canadian farmers, for the total amount loaned in seven years is not much more than the government is prepared to make good in the event of loss.\n\nA further source of credit which they did not previously enjoy is now available to some Saskatchewan farmers. This money is available through the credit union movement in the province which has undergone spectacular development during the last decade. The department of cooperation reports that credit unions in Saskatchewan lent an estimated $10,500,000 to farmers for farm opera-\nDonald Lambie\n\nNew Valuator\n\nDonald D. Lambie has been appointed property valuator in the extension service branch of the Department of Municipal Affairs in Saskatchewan.\n\nThis organization suggests that additional emphasis should be put on farm management and matters generally related to the farm as a business enterprise. It appears that farmers are generally interested in such subjects although they have received more attention than where they are located in soils in 1942.\n\nHe did experimental work with wheat at the Dominion Experimental Station at Swift Current in 1936 and 1937. Much of the information that is given in this pamphlet was obtained from the farmers' soil sampling at Virdenhill in 1938.\n\nMr. Lambie was born in Dublin, Saskatchewan in 1910 and graduated from the University of Saskatchewan in 1936.\n\nApart from the numerous examinations of P.F.A.A., the number of awards made by the organization has been steadily increasing since its establishment in 1920.\n\nThe average value of awards paid annually by P.F.A.A. is slightly more than $47,000, which makes it the largest single source of income for the organization.\n\nIn the light of these circumstances, the attention of the commission is directed to the following resolution:\n\n\"A resolution expressing the opinion that the organization should be continued and strengthened, and that the services of Mr. Lambie should be continued.\"\n\nThe benefits under this scheme are limited. In the event of a complete failure of crops, there will be no loss to the farmer except in the case of partial crop failures.\n\nSufficient experience has now been accumulated among up to 300 acres of land, the maximum area covered by the act, to show the advantages of this new system of crop insurance.\n\nThe maximum coverage under the act is $150 per acre, and the premiums charged are based on costs and prices prevailing in 1938.\n\nTwo things emerge from this brief examination of the scheme of crop insurance:\n\nFirstly, that the organization has been successful in providing a valuable service to the farmers.\n\nSecondly, that the organization should be continued and strengthened, and that the services of Mr. Lambie should be continued.\n\nThe question of farm credit is closely associated with the problem of stable production in Saskatchewan.\nUniversity of Saskatchewan, the field service of the provincial department of agriculture, the field service of this organization are but three of many sources offering information of vital importance to farmers' success. The newspapers and radio stations offer another essential avenue of information.\n\nThese avenues of information and education have helped the farmer to improve his production methods in many instances. The gradual improvement in agricultural practice which has taken place over the years can be attributed in some measure at least to the work of extension agencies.\n\nAgricultural extension services generally recognize how far performance still falls behind knowledge. They are conscious that their best efforts have not been completely fruitful and they have spent much time and thought in analyzing their own work to discover where improvements may be made. We feel sure that this process will continue and that improvements in extension methods will come as a result of continued critical examination by those engaged in this field.\n\nThis organization suggests that additional emphasis in extension work should be put on farm management and matters generally related to the farm as a business enterprise. It appears that farmers are generally interested in such subjects and would be receptive to more information than they have received in the past.\n\nThe present wheat situation appears to be a case in point. Much of the information that is given to the public by some agencies is of dubious merit from the farmer's standpoint. This organization suggests that the farmer needs to understand the basic principles of marketing and farm economics so that he may make his own critical analysis of material that reaches him from the many sources that are competing for his attention.\n\nAn adequate farm information program ought to have three virtues: it should be comprehensive; it should be timely, and it should be accurate. And of these virtues, accuracy is the greatest.\n\nCrop Insurance\n\nUp to this point this submission has directed attention to some of the ways in which the hazards of production which face Saskatchewan farmers may be reduced or eliminated. But, however conscientiously these remedies are applied, the fact is that the Saskatchewan economy will remain subject to violent fluctuations in yield and income.\n\nThis is now officially recognized in national farm policy and steps have been taken to ameliorate the condition through the Prairie Farm Assistance Act which has been in operation since 1939. Under this act prairie farmers and the federal government share the cost of making adjustment payments to farmers who experience complete or partial crop failures.\n\nSufficient experience has now been accumulated under this act to point the way to broader and more comprehensive schemes further to reduce the instability arising from the natural hazards of grain production in Saskatchewan. A brief review of P.F.A.A. experience will point up some of the problems involved in developing an effective pattern of coverage.\n\nIn the 14 years P.F.A.A. has been operating in Saskatchewan, it has been necessary to make payments under the provisions of the act in every year but one—1942. Even in the record year of 1952 when the province as a whole reaped the largest total wheat crop in its history and enjoyed the highest average yield, 3,084 claims for assistance were honored to the amount of $758,000.\n\nApart from 1952, the number of awards under P.F.A.A. has ranged from 10,576 in 1941 to 62,473 in 1941. The average number of awards paid annually since 1939 (but not including 1942) is slightly more than 34,700. Annual payments have ranged from $758,000 in 1952 to more than $15,000,000 in 1949. This record reflects a variability in production which calls for broad policies to level off the effects of such instability.\n\nP.F.A.A. has been supported by the farmers through a contribution of one percent on the value of grain delivered to the elevators. In Saskatchewan this contribution has amounted, in 14 years, to $41,500,000. During the same period, payments in Saskatchewan under the act have amounted to $103,800,000. Thus Saskatchewan farmers have borne 40 percent of the cost of this elementary system of income insurance. The balance has been made up by payments from the federal treasury together with small surpluses earned by the scheme from its operation in Manitoba.\n\nThe benefits under this scheme are limited. In the event of a complete crop failure (that is less than five bushels to the acre) the farmer receives $2.50 per acre on half his cultivated acreage up to 200 acres. The maximum payment under P.F.A.A. is, therefore, $250. For partial failure, the maximum is $150. These amounts are based on costs and prices prevailing in 1938. They are obviously inadequate now to give even the level of security envisaged when the act was passed. There are other limitations in the P.F.A.A. scheme which make it questionable as the basis for an adequate crop insurance plan. P.F.A.A. has been useful as an emergency measure to meet conditions which prevailed when the act was passed. Amendments have increased its usefulness as conditions have changed. But it is nowhere represented as a substitute for adequate crop insurance.\n\nTwo things emerge from this brief examination of the experience accumulated by P.F.A.A. The first is that some form of insurance against the hazards of cereal crop production is necessary. The second is that it is unlikely that the farmers themselves can bear the whole cost of a satisfactory insurance scheme.\n\nIn the light of these circumstances, the attention of the commission is directed to the following resolution which has been approved by the delegate body of the Saskatchewan Wheat Pool:\n\n\"That we again urge upon the federal government the adoption of a national agricultural policy which would provide for:\n(a) An adequate scheme of crop insurance, the cost to be borne jointly by the Dominion and provincial governments and the producers.\"\n\nFARM CREDIT\n\nThe question of farm credit is closely associated with the problem of stable production in Saskatchewan.\nWHEAT POOL SUBMISSION\n\n(Continued from Page 6)\n\nWithout adequate credit facilities, many Saskatchewan farmers would find it very difficult to operate their farms efficiently in adverse weather conditions. Indeed, many farmers have been forced to sell their livestock at a loss because they could not obtain credit to purchase feed or other supplies.\n\nCredit is essential to the operation of a farm. It provides the means by which the farmer can acquire the necessary equipment and supplies to maintain his operation. Without credit, the farmer is forced to operate on a cash basis, which can be extremely difficult during periods of adverse weather conditions.\n\nThe availability of credit is crucial to the success of any farming operation. It allows the farmer to purchase supplies and equipment when needed, rather than having to wait until he has saved enough money to make the purchase. This flexibility is essential to the successful operation of a farm.\n\nMoreover, a greater degree of stability in livestock prices would encourage farmers to invest more in their operations. The increased investment would lead to higher productivity and better profits.\n\nIn conclusion, the availability of adequate credit facilities is essential to the successful operation of a farm. Without credit, farmers are forced to operate on a cash basis, which can be extremely difficult during periods of adverse weather conditions. The availability of credit allows farmers to purchase supplies and equipment when needed, rather than having to wait until they have saved enough money to make the purchase. This flexibility is essential to the successful operation of a farm.\n\nResearch and Extension\n\nScience has become increasingly important in the development of the prairies. From the earliest days of settlement, the people have operated on a very limited scale, with little knowledge of the potential of the land. During the homesteading period, advances were made by pioneers, stores, and banks, and eventually, the entire mortgage system was developed. As the century was laid out, the farmers found themselves in the midst of the depression, and the farm debt problem increased. Interest rates also increased, and agricultural companies for tractor fuel were unable to pay their bills. The situation became worse when the problem of farm debt was compounded by the failure of the federal government to provide adequate assistance.\n\nIn conclusion, the availability of adequate credit facilities is essential to the successful operation of a farm. Without credit, farmers are forced to operate on a cash basis, which can be extremely difficult during periods of adverse weather conditions. The availability of credit allows farmers to purchase supplies and equipment when needed, rather than having to wait until they have saved enough money to make the purchase. This flexibility is essential to the successful operation of a farm.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_850.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 14499, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3515, 6], [3515, 5101, 7], [5101, 5896, 8], [5896, 6561, 9], [6561, 7196, 10], [7196, 8627, 11], [8627, 9338, 12], [9338, 11518, 13], [11518, 12524, 14], [12524, 14746, 15], [14746, 15703, 16], [15703, 16946, 17], [16946, 16946, 18], [16946, 17438, 19], [17438, 18390, 20], [18390, 18390, 21], [18390, 18390, 22], [18390, 22275, 23], [22275, 26238, 24], [26238, 27956, 25], [27956, 31892, 26], [31892, 33684, 27], [33684, 33684, 28], [33684, 38721, 29], [38721, 43990, 30], [43990, 43990, 31], [43990, 49164, 32], [49164, 49164, 33], [49164, 49164, 34], [49164, 49164, 35], [49164, 49164, 36], [49164, 51464, 37], [51464, 57623, 38], [57623, 60546, 39], [60546, 60546, 40], [60546, 60634, 41], [60634, 60788, 42]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]