[{"id": "77cf6de83f1f5e2afd52833acabc5c708896449f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? All in what district? How many of these were bachelor's houses? Would you have visited them?\n\n2. How often did you usually visit neighbors? Not often, too busy.\n\n3. Did you usually visit on a Sunday, or other days not on Sunday unless invited? Any time you thought a friend would like to go there.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Any time you thought a friend could come to your home.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand? You.\n\nHow was the invitation to a meal worded when people had some unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Cup of tea.\n\n5. Did the whole family go, or did someone stay home to \"cook after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? (Name times)\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIn the earliest years that you have been here, were there many parties, whilst drives or dances in homes were desirable? No, they were rare.\n\nKeep these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks once a week, once a month, etc.?\n\nDid you ever have any kind of formal schedule, such as going by turn from one home to another at definite times, - every two weeks once a week, once a month, etc.?\n\nDid you ever have any kind of formal schedule, such as going by turn from one home to another at definite times, - every two weeks once a week, once a month, etc.?\nSAINTHETRAN ARCHIVES QUESTIONNAIRE.\n\nPioneer Recreation and Social Life.\n\nNEIGHBOR VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were you invited enough to you for visiting back and forth? How often did you visit neighbors?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday or other days not on Sundays unless invited?\n\n4. Have you been invited to other homes? If so, was it a good time if you could have gone there?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had some unexpected? (That is, was the term \"to have a potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIn the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many houses were close enough to you for visiting back and forth? All in town were close enough.\n\n2. How often did you usually visit neighbors? Not often close by.\n\n3. Did you usually visit on Sundays or other days not on Sundays unless invited? Any time you thought a family would be there.\n\n4. Were you often invited to other homes? Or was most visiting done without an invitation?\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? \n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? Didn't say, was the term to make politely used, or was some other expression common?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Cup of tea.\n\n5. Did the whole family go or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"neegau\" when groups of neighbors came together to put up a building, make quilts, or other such activity? None.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nSome neighbors would come to get their mail, others would come to see what was going on at the house.\n\nIn the earliest years that you remember, before there were automobiles, how did people arrive or depart in homes? Before the automobile, people walked or traveled by horseback.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNEIGHBOUR VISITING, PARTIES, ETC.\n\n1. In the first few years how many houses were near enough to you for visiting back and forth? How often did you visit? How often did you receive visits?\n\n2. How often did you usually visit neighbors? Not often at all, occasionally, frequently.\n\n3. Did you usually visit on Sundays or other days? Not on Sundays unless invited? Any time you thought a good day to visit you would go there.\n\n4. Were you often invited to other homes? If so, was this visiting done without an invitation? Any time you thought a good day to visit you would go there.\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (Note: This was the term to \"make potluck\" used, or was some other expression commonly?)\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"meat\" when groups of neighbors came together to put up a building, make quilts, or other such activity? None.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"meat\" was for, and how often they occurred.\n\nSome neighbors would bring one anything we could have, we needed something.\n\nIn the earliest years that you were here, were there many parties, what drives or dances in homes, etc.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times - every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community games, box socials, and other activities. (Include also on the school Christmas tree, proms, etc., if you have not described these on the school questionnaire.) How much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? What material was it made of? Who built it - the community through special funds, the municipality, some organisation, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and close to the hall in town for other gatherings, or were you close enough to make use of the hall for all gatherings, etc.? ) Hall was expensive after railway came through.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties? Tied in school barn or outside.\n\n11. What card games were popular in the early days? Was there card playing for a prize? What dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Parent of big families don't show shine or the purpose of singing playing instruments, were a care for our family how to go out much.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school's contribution thereto.) Describe.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\nSchool house grounds were used for everything.\n\n9. When was your first community hall built? Never had any time.\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.,?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? If hall was known as a\n\nrailway came through\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10), did the entire family attend?\n\nHow were babies and small children provided for? We baby-sat in nice days we all helped after our own.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nFind in school barn or outside.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it; either as an entertainment in the home or for community gatherings? Explain.\n\nParents of this families didn't have time or\n\nParents of this families didn't have time or\n12. What attempts at formality, or \"manners,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? We didn't bother with such nonsense.\n\n13. Was the chivalry known in your community? Yes\n\nDescribe what you remember about chivalries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some change in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Yes in late 40s\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? Not sure\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes in late 40s\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3. What attempts at formalities or \"etiquette\" do you remember in small towns—such as gloves and hats when calling cards, visiting cards, etc., were used?\n\n15. Was the chivalry known in your community? Yes.\n\nDescribe what you remember about chivalry, telling how common these incidents connected with them, etc.\n\nII. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments, no matter how commonplace they were, regular or special, and give approximate dates whenever you can when some change in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n4. Name any other organizations that were in existence in your community before 1912, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included all races or only in one relatively small area (for example, within a school community), or was centered in the town or village and included the surrounding connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Sometimes\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n4. Name any other organizations that were in existence in your community before 1921, giving the name of each, date when it was first organized, its chief purpose, who belonged (men, women, young people), whether it included children only in one relatively small area (for example, within a school district), or was carried in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Sometimes\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? Describe.\n\nPICKNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n21. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Whist, Pinochle, Patience, or others, checkers or other games? \n\nDid the whole family join in each game, or only the children? Explain.\n\n22. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n23. Did children invent games connected with such things as buffalo bones, arrows, beads, ribbons or other objects or animals, or games in the snow? Describe.\n\nPICKING AND SPORTS.\n\n24. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n25. Who organized it?\n\n26. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n27. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n28. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n29. What did you have to eat and drink?\n\n30. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities, played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities, played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 23rd or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came here? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Magazines? Books as a rule?\n\n45. Did you buy many books after you came here? Give details. You bought so many?\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? Yes\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nThen, was the sports day usually held? (what month, or any special day, such as May 25th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and places.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell as nearly as you can how many books you brought, and what kind. (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Magazines?\n\n45. Did you buy many books after you came west? Give details. (If so, how much?)\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? If so, when was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n52. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? Who started it?\n\nIs it still in existence? No\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n53. What newspapers or magazines did you subscribe to when you first came to the west? [Handwritten: \"Daily Herald, Minneapolis Star Tribune\"]\n\n54. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n55. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n56. What books or papers that you brought to the west with you do you still have?\n\n57. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? Who started it?\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nMembers of the Board of Directors:\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped our—\n\nTell in subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? \n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe. \n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n55. What musical instruments did you bring with you? (Church organ)\n\n57. What instruments did any of your neighbors have?\n\n59. What musical instruments have you bought since you came to the west? Give dates, if possible, and tell where you bought them.\n\n59a. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe. Write a good deal.\n\n60. What were some of the favorite songs in the homes?\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many members were included? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\nWall or window hanging at the opera house\n\nBut we have a fine band now in town\n\nalso musical societies and Y.M.C.A.\n\nwhen they come from neighboring towns.\n\n66. Do you have any collections such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them and tell how you became interested in them.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page or extra sheets if necessary)\n64. Has anyone from your community become well known or famous in the musical world? If so, name and date any places or public appearances.\n\n65. Is music an important or less important to your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\" such as stamps, stones, photographs, firearms, arrowheads, etc.? If so, describe them briefly.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, readings, musicals, pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2056.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 7628, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 2120, 7], [2120, 3507, 8], [3507, 5176, 9], [5176, 6813, 10], [6813, 8635, 11], [8635, 10486, 12], [10486, 11899, 13], [11899, 13206, 14], [13206, 14372, 15], [14372, 15593, 16], [15593, 16715, 17], [16715, 17881, 18], [17881, 19097, 19], [19097, 20325, 20], [20325, 21611, 21], [21611, 22912, 22], [22912, 23904, 23], [23904, 24883, 24], [24883, 26041, 25], [26041, 27159, 26], [27159, 28498, 27], [28498, 29475, 28], [29475, 29630, 29], [29630, 29784, 30]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]