[{"id": "738f4a345bdac77848c3112c8b3d557e78a11b8e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Mrs. Minnie Taphein\n\nPresent Address: St. Gregor, Sask.\n\nPioneer Address: St. Gregor, Sask.\n\nYear you came to Saskatchewan: 1926 Nov. 18\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Six homes, were family homes. How many of these were bachelor's homes? We had fairly bachelor neighbors.\n\n2. How often did you usually visit neighbors? Generally once a week.\n\n3. Did you usually visit on a Sunday, or other days? When such we wished.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? It was done without invitations.\n\nWhat time of the day did you go—in the morning and spend the day, or in the afternoon, etc.? Sometimes in afternoon, sometimes evenings.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, we stayed as we were told to.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) They said you better stay for supper.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee, bread and butter, sometimes cake and fruit.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes we all went, sometimes not.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, we had a bee for building a log barn.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe neighbors came early, everyone brought hammer and saw. Our big log barn was built, beginning of April 1907.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nThere were no whist drives. Only in town once in awhile, no dances. But we had parties when plenty young folks were there.\n\nWere these more frequent in later years? Give dates.\n\nYes, there were more frequent in later years.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? We went when we felt like having a good chat with a neighbor, sometimes once a week. Sometimes once a month.\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRES.\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough for visiting back and forth? How many homes? How many homes?\n\n2. How often did you usually visit neighbors? Sometimes once a week.\n\n3. Did you usually visit on Sundays or other days? When such we wished.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? It was done without invitation.\n\nWhat time of the day did you go in the morning and spend the day, or in the afternoon, etc.? Sometimes after dinner, sometimes evening.\n\nWhat about meals? Did you stay when not invited beforehand? Sometimes they stayed.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"to take potatoes\" used, or was some other expression common?) They said you better stay for supper.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Coffee, bread and butter, sometimes cake and fruit.\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Sometimes we all went. Sometimes not.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe neighbor came early. Every one brought hammer and saw. Our big log barn was built beginning April 1907.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThere were no what drives. Only in town once in awhile, no dances. But we had parties when plenty young folks were there.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? We went when we felt like having a good chat with a neighbor, sometimes once a month. Sometimes once a month.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Six homes. Were family homes? How many of these were bachelor's homes? We had five bachelor neighbors.\n\n2. How often did you usually visit neighbors? Generally once a week.\n\n3. Did you usually visit on a Sunday, or other days? Whenever we wished.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? It was done without invitations.\n\nWhat time of the day did you go in the morning and spend the day, or in the afternoon, etc.? Sometimes in afternoon, sometimes evenings.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, we stayed as we were told to.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?) They said you better stay for supper.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Coffee, bread and butter, sometimes cake and fruit.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes we all went. Sometimes not.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, we had a bee for building a log barn.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe neighbors came early, everyone brought hammer and saw. Our big log barn was built beginning of April 1907.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nThere were no whist drives. Only in town once in awhile, no dances. But we had parties when plenty young folks were there.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? We went when we felt like having a good chat with a neighbor, sometimes once a week. Sometimes once a month.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were near enough to visit back and forth? How many of these were bachelor's homes? Our family had friendly neighbors.\n\n2. How often did you usually visit neighbors? Occasionally once a week.\n\n3. Did you usually visit on a Sunday, or other days? Whichever we wished.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? It was done without invitation.\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? We came home after work, sometimes even at dinner time.\n\n5. Did you ever have a meal when people had come unexpectedly? (That is, was the term \"to make potluck\" used or was some other expression common?)\n\n6. Did you ever have a fire for building a log barn?\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\n8. Were there no social dances? Only in town once in awhile, no dances. But we had parties when plenty of young folks were there.\n\n9. Were these more frequent in later years? Give dates.\n\n10. Did you follow any kind of informal schedule, such as going by car, train, etc., once a month, etc.? We went when we felt like having a good chat with a neighbor, sometimes once a month.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. if you have not described these on the School Questionnaire). Give dates.\n\nAs long as I can remember, there was only one dance held in school. There were no box socials or Christmas concerts in the early years.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nI came to St. George in 1904 at the age of 17. I never went to a Catholic school although I spent four years of single life in the district before I married. Then I moved away and came back to this district in 1936.\n\n9. When was your first community hall built? It was built in St. George. But I forgot when.\n\nWhat material was it made of? Of lumber. How large was it? I do not know.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? I think the community through special funds.\n\nWas it built in the village or town, or was it a country hall? It was built in the village.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?) I never went to these gatherings, as they were mostly in winter. It was too far at night, and too cold.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? No\n\nHow were babies and small children provided for? They were mostly kept at home.\n\nHow were horses sheltered and fed in the winter time at these parties? They were put in a barn and fed.\n\n11. What card games were popular in the early days? The men generally played cards.\n\nWas there card playing for a prize? There was in town.\n\nWhat dances were popular? Square dancing, waltz, two step, rye waltz, one step, cakle two steps.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No everyone seemed to get along all right.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. It was up to the person if he wanted to play cards he could. If he did not want to play it was alright. Nothing was said if they did not want to play.\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. (Include also the school Christmas tree, pennants, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local schoolhouse for its district gatherings, and come to the hall in town for other functions?)\n\n11. What dances were popular in the early days?\n\n12. Was there card playing for prizes? If so, what was the prize?\n\n13. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n14. If he wanted to play cards he could, if he did not want to play it was allowed, if nothing was said if they did not want to play.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? There were no parlor around here. Whatever body sat in dining room, they wore hats. But not gloves and no, they did not use calling cards. But everyone was treated as best they could make it.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. There were mostly in town. When they came and chivareed a couple, a drink was generally passed to each one. The bunch sometimes sang songs. There were no incidents.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. They played games of deadman, and who's got the bottle, post office, auctioneer, fruit basket upset, Please and these games were played around 1908—displease.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. That attempts at formality or \"femininity\" do you remember in small homes such as gloomy old-fashioned parlor, etc.? Were there no parties allowed? What was the character known in your community?\n\nDescribe what you remember about churches, telling how common they were, any incidents connected with them, etc.\n\n13. Was there a dance hall in your town? When they came and danced a couple of dances, who was generally paired to each one?\n\nDescribe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n14. They played games of deadman's, card, who's got the bottle, post office, auctioneer, fruit basket, upset, place and draw.\n\nThese games were played around 1908.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaires for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? a picnic, or dance.\n\n19. Where did various organizations hold their meetings? In hall,\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? None Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball games\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Drop the handkerchief, play house, dolls, and see who could win a race\n18. Name any other organizations that were in existence in your community before 1914, listing those who belonged to both women, young people, (for example), whether it included people only in one relatively small area (for example) within a school district, or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat places were commonly used by organizations for raising money? (For example)\n\n19. Where did various organizations hold their meetings? (For example)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? (For example)\n\nDescribe telling who gave them (local ministers or teachers), special lectures, etc., where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? (For example)\n\nGive dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (skipping rope, ball, marbles, fly kites, etc.)?\n\nBall games\n\nThat games did girls play in summer (skipping rope, play house, etc.)?\n\nThat the household play house dolls, and\n\nnee who could win a race\n22. What winter games were played outside? Fox and hounds, skating, etc.? \n   Fox and hounds, snowball, sledding, snowshoeing.\n   It generally was too cold to play outside.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n   Checkers, snail, authors, old maid, Black Peter.\n\nDid the whole family join in such games, or only the children? Explain.\n   No these games were played only by children and young folks.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n   There was lots of time for games, but there were played in the evening; elders were generally discussing things.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n   The first picnic took place at [illegible] in July, though from 1968.\n\n26. Was it organized by?\n   The Catholic Church held this picnic.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? It was for the church.\n\n28. Was it the first picnic held in the community? Yes, as much as no.\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n   Ball games, choir singing, and meeting friends.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n   There was dinner served. Every family brought some eats, and they charged for the dinner.\n\n31. What did you have to eat and drink?\n   There was everything one could think of to eat; coffee was for drink and soft drinks.\n\n32. What time of the day did it start, and how long did it last?\n   It generally started at 10 till evening in morning till evening.\n21. Was there much time for games? If so, what kind of games?\n\n22. Did children invent games connected with any things or animals, or games in the story \"Dickens\"?\n\n23. Were there any differences in games played by boys and girls?\n\n24. Did children play with dolls, blocks, or other objects or animals?\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Was it held at the Catholic Church, or some other place?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? It was for the church.\n\n28. Was it the first picnic held in the community? Yes, as much as I can remember.\n\n29. Do you know the date of the first one that had been held?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? It generally started at 10 o'clock in the morning till evening.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThey raffled off things who had lucky number won and spun the wheel which 3 numbers for 25¢. Where the arrow stopped, who had the number won also bingo was played.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThere were only church picnics held.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI don't think there are many changes. Only people have cars now. And there are bigger crowds. Also bands in attendance at some picnics.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nThe first indoor rink was built in 1951. It was mostly used for curling.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThey raffled off things who had big numbers, and spun the wheel which I remember for $5. When the owner stepped into the number way also, bingo was played.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday school, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThere were only church picnics held.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI don't think there are many changes. Only people have cars now. And there are bigger crowds, also bands in attendance at home picnics.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n\nThe first outdoor rink was built in 1951.\n\nIt was mostly used for curling.\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day? When was the sports day usually held? (what month, or any special day, such as May 14th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nI did not bring many. *Wide Wide World*, *Black Beauty*, *Christie the organ grinder*, *Chief Primrose* some school books, *any books*, *geograph*, I do not remember the authors.\n\n43. How many of your neighbors brought books with them? I don't know.\n\nWhat kind of books and how many? Don't know.\n\n44. To what extent did you exchange books with neighbors? None.\n\n45. Did you buy many books after you came west? Give details. No.\n\n46. What books were sent to you as gifts in early years? None.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Yes, I think there is a traveling library now at school. I think the larger units send these books.\n\n48. Was there a school library? There is. When was it begun? I don't know.\n\nTo what extent were books borrowed from the school library for adults to read at home? No, there were mostly foreigners who could not read English.\n\n49. Did parents ever use their children's school text books as additional reading material? I don't know.\n7. Then did an annual sports day? (not established in your community)\n   Did it grow out of or replace the earlier community games?\n   Who was responsible for starting the first sports day?\n   What was the sports day usually held? (that month, or any special day, such\n   as July 4th or Victory Day?)\n\n8. Are there any items from your community who have become members of well-known\n   history, hall of fame, or other honors? Give names, and dates.\n\nREADING\n\n9. What books did you bring with you when you came west? (Give a list of the\n   names and authors, if possible; if not, tell us exactly as you remember them.)\n   How many books did you bring, and what kind?\n\n10. I did not bring any books. Under Wide World, Black\n    Beauty, Treasure Island, Quiller, Philo Dunnington,\n    some school books, any books, geography.\n\n11. Do you remember the author? I don't.\n\n12. How many of your neighbors brought books with them? Don't.\n\n13. What kind of books did you bring? Don't.\n\n14. To what extent did you exchange books with neighbors? None.\n\n15. Did you buy any books after you came west? Give details. No.\n\n16. What books were sent to you as gifts in early years? None.\n\n17. Have you ever had any travelling library books in your community or school?\n    Give details and dates.\n\n18. Was there a school library? When was it begun? I don't know.\n\n19. To what extent were books borrowed from the school library for adults to\n    read at home? No, they were mostly foreigner who could not read English.\n\n20. Did parents give their children's school texts books as additional reading?\n\nI don't know.\n50. Has there ever been a community library in your district or town?  \n   When was it started?  \n   Who started it?  \n   Is it still in existence?  \n   If not, when was it discontinued, and why?  \n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \n   To the Winnipeg Free Press former\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.  \n   We did not nor of other papers. Now I take Family Herold, Western Producer, Country Guide\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \n   No  \n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?  \n   I do not have any left.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.  \n   Yes I liked to read, but had nothing. We could of ordered books from Eaton's. But there was no money for such things as books.\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? In 1927\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nGo to the Alamosa Free Press Phone forum\n\n52. Describe later changes in your subscriptions, telling why you stopped certain in subscriptions and added others.\n\nWe did not receive any other papers. How I got the Family Herald Western Producer's Country Guide\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nI do not have any left\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYes, I needed to read, but had no access. We could not afford newspapers or books. But there was no money for such things.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Organ\n\n57. What instruments did any of your neighbors have? None\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nWe have a guitar, which was a gift given to my daughter for Christmas. It was given her in 1947. Price $10.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nI liked to sing very much, so I sang a lot in the stores in schools before coming here.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe. No\n\n60. What were some of the favorite songs in the home?\n\nUnder the shade of the old apple tree, Wait till the sun shines, Nellie, Good old summer time, Darling Nellie Grey, etc.\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home community? Explain.\n\nThere were lots of German here, they generally sang their folk songs.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No\n\n63. Was there a band in your community? No When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instrument\n\n55. What musical instruments did you bring most with you?\n\n57. What instruments did any of your neighbors have?\n\n59. What musical instruments have you bought since you came to the west? Give dates, places if possible, and tell how you bought them.\n\n61. Was \"folk music\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where.\n\nIf members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nI have a collection of Indian hammers, stamps, do shell work also have collection of shells and rocks. I started collecting rocks in the State of Wash., as there are so many beautiful rocks there. I have quite a few agates, a thunderhead, a geode, a barn rock and other started in 1947.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nBirds generally came middle April or end of April. Trees started greening middle May or late. Depended on weather.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI would like if one could learn other hobbies. I also make seed pictures and have made a swing tree. In the States an extension teacher comes round once a month. They learn something different every time.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? No\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nLike decorating chairs, making table lamps, decorating cakes with ornaments, icing, sewing, etc. They gather in a hall or house on the 4th of July. After the race they have their lunch or potluck. It was done free of charge, I thought it was very nice. Each lady brings one dish and all the different varieties they get to eat.\nGENERAL\n\n69. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\n70. Like decorating chairs, making table lamps, etc., etc.\n\nOn the Saturday afternoon they have their lunch or potluck. It is done free of charge, I think it was very nice. Each lady brings one dish and of all the different varieties they get to eat.\nI have an old china nest egg. My parents brought these eggs along when they came here from the States. I must say it layed under the ground a long time, as a year ago my son was cultivating the field, and this china nest egg came to the top. A young pup must of buried it there years ago. We came here 1956, and in the spring of 1957 it came to the top, as good as ever. These kind of eggs do not exist no more. They have lime nest eggs now, so it's quite an antique.\nI have an old china nest egg. My parents brought these eggs along when they came here from the States. I must say it layed under the ground a long time, as a year ago my son was cultivating the field, and this china nest egg came to the top. A young pup must of buried it there years ago. We came here 1956, and in the spring of 1957 it came to the top, as good as ever. These kind of eggs do not exist no more. They have lime nest eggs now, so it's quite an antique.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906Q-Z_2079.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 9495, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1248, 5], [1248, 1248, 6], [1248, 3477, 7], [3477, 5589, 8], [5589, 7764, 9], [7764, 9080, 10], [9080, 11712, 11], [11712, 12702, 12], [12702, 14552, 13], [14552, 16138, 14], [16138, 17502, 15], [17502, 18823, 16], [18823, 20860, 17], [20860, 21893, 18], [21893, 23535, 19], [23535, 25163, 20], [25163, 26845, 21], [26845, 28441, 22], [28441, 29698, 23], [29698, 30922, 24], [30922, 32503, 25], [32503, 33373, 26], [33373, 35435, 27], [35435, 35900, 28], [35900, 36368, 29], [36368, 36836, 30], [36836, 36991, 31], [36991, 37145, 32]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]