[{"id": "c7e57a458dd0f24e642cde45c057dec903e479ed", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: Dixon, Alfred Lyman\nPresent Address: Maple Creek, Sask.\nPioneer Address: Maple Creek, N.W.T.\nYear you came to Saskatchewan: 1883\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 3 - 10\n\nHow many of these were bachelor's homes? 2\n\n2. How often did you usually visit neighbors? Weekly.\n\n3. Did you usually visit on a Sunday, or other days? Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Early days visited without invitations.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon, evenings.\n\nWhat about meals? Did you stay when not invited beforehand? Very seldom.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Potluck.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Lunch of crackers or cake with tea or coffee.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Very seldom whole family attended.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Ladies used to have quilt making activities for church or hospital.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. Small attendance of interested persons. 1895 - 1910.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Was brought up as a strict Methodist so did not attend social parties until after 1903. Was at parties or an odd home dance only.\n\nWere these more frequent in later years? Give dates. After 1900.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No.\nSASKATCHEWAN ARCHITECTURAL QUESTIONNAIRE,\n\nNo. 5\n\nPlanner Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first five years, how many homes were near enough to you for visiting back and forth? 3 - 10\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Have you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nThat about annual? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term to make potluck used, or was some other expression common?)\n\nPotluck.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"lock after the places?\"\n\n6. Did you ever have \"meetings\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the purpose was for, how often they occurred.\n\nSmall and large parties of various sizes. 1895 - 1910\n\nand more that time, how many years.\n\n7. In the earliest years that you were here, were there many parties, whilst dresses or dances in homes? (Describe briefly)\n\nWas there any kind of informal schedule, such as going by turn from house to house, once a week, twice a month, etc.?\n6. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, picnics, etc.)\n\n7. How much of your social life was centered around the school, and within the school district? Describe.\n\n8. When was your first community hall built? How was it built?\n\n9. What material was it made of? How large was it?\n\n10. Who built it - the community through special funds, the municipality, some organization, etc.? \n\n11. Was it built in the village or town, or was it a country hall?\n\n12. To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n13. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 5, 6, and 10) did the entire family attend? In rural areas, how were babies and small children provided for?\n\n14. How were horses sheltered and fed in the winter time at these parties?\n\n15. What card games were popular in the early days?\n\n16. Was there card playing for a prize? If so, what was the prize?\n\n17. What dances were popular?\n\n18. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n19. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nUp to 1900 formality was attempted, but since then it became less formal.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nOnly in stories of Mounted Police, where members were most cases brought up that way.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nIn early day had more games planned as musical chairs, charades, spelling matches, etc.\n\nRecent year parties most case card playing.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nP.S. of Temperance.\n\nGive the date and reason for it being organized.\n\n1895 for social temperance work.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes at present.\n\nTell when it was organized, and what steps led to its organization.\n\nThis district is 75% ranching. Grain growers came here early 1890s but could not exist, but after 1899 had influx of farmers.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\n75%\n\nHow many women belonged? 8\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n2.\n\n17. Was there a Homemakers' Club in your district? Yes.\n\nWhen was it organized? 1910.\n\nApproximately how many women belonged to it? 20\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality or \"social\" do you remember in small towns, such as dances and hat raising calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the obverse known in your community? \n\n14. Describe any other details of visiting, parties, etc., that you remember, at parlor and give approximate dates whenever you can. \n\n15. Was there a Saskatchewan Grain Growers' Local in your community? \n\n16. Tell when it was organized, and what steps led to its organization. \n\n17. Was there a Homemakers' Club in your district? \n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? \n\nGive the date and reason for it being organized. \n\n16. Was there a Saskatchewan Grain Growers' Local in your community? \n\nTell when it was organized, and what steps led to its organization. \n\nApproximately what proportion of the farmers in the community belonged to it? \n\nHow many women belonged to it? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization? \n\n17. Was there a Homemakers' Club in your district? \n\nThen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nSack Stock Growers Assn., dist & Annie in Maple Creek.\nS. H. Sack Growers Assn.\nFarm Growers Assn.\nDistrict meetings.\nAgricultural Society at least 1890.\n\nWhat means were commonly used by organisations for raising money?\n\nDonations\n\n19. Where did various organizations hold their meetings?\n\nIn Town of Maple Creek. Stock Growers association rotated\nSwift Current, Shaunavon, Bull Lake, Maple Creek.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nAs above. Olden boys. Cricket. Football.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nAs above. Tag. Punchbowl.\n18. Name any other organizations that were in existence in your community before 1872, listing the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, children), whether it was a social club or only in one relatively small area, whether it was connected with the church, or was centered in the town or village, and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nA. A. Leck William Owen\n\nAnnual Church Meeting\n\n19. What means were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n22. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.)?\n\nOn above. Older boys played baseball.\n\nWhat games did girls play in summer (jump rope, play house, etc.)?\n\nOn above. Tug - Pum - Shelfrun.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *As above.*\n\n   What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Authors: Checkers - Chicken - Cribbage.*\n\n   Did the whole family join in such games, or only the children? Explain.  \n   *Yes, whole family in evenings.*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *Evenings for short time*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *Yes, tag.*\n\n**PICNICS AND SPORTS.**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *July - 1887.*\n\n26. Who organized it?  \n   *Methodist Sunday School.*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *Entire Community.*\n\n28. Was it the first picnic held in the community?  \n   *Yes, to knowledge.*\n\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *Ball Games - races - Swings - Climbing Trees - Hills.*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *General lunch. Children served first.*\n\n31. What did you have to eat and drink?  \n   *Sandwiches - Cookies - Cakes - Pie - Lemonade - Coffee.*\n\n32. What time of the day did it start, and how long did it last?  \n   *In afternoon till nearing sundown.*\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Rummy? \n\nChess, checkers or other games? \n\nChildren - Chutes - Cribbage \n\nDid the whole family join in such games, or only the children? \n\nExplain. \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, graphons or other objects or animals, or games in the snow? Describe. \n\nYour name \n\nPicnics and Sports \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\nJuly - 1888 \n\n26. Who organized it? \n\nMethodist Sunday School \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization? \n\nIndigenous Community \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\nBasketball - Games - Climbing Trees Hills \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\nGeneral Lunch. Children served first. \n\n31. What did you have to eat and drink? \n\nSandwiches, Cookies, Cake, Punch, Lemonade, Coffee \n\n32. What time of the day did it start, and how long did it last? \n\nIn afternoon till evening sundown\n11. Describe any features of this place which you remember as outstanding.\n\nFree and easy time.\n\n12. Describe any different kinds of places which you knew of in the early days, such as the large community places, school or Sunday School, places, family places, etc. Tell about any differences in matters attending, activities, food and drink, when held, etc.\n\nSunday School places.\nFamily places - usually not special arranged - had your own places. Popular places included.\n\n13. What changes have you noticed in places since the first years? If possible, give dates when changes became noticeable.\n\nLittle better arranged from how clean, whole day.\n\n14. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (sex, women, mostly young people).\n\nAll took part in early days, no numbers very much smaller in attendance.\n\n15. For what game was the first team organized in your community to play against neighboring teams?\n\nCurling - Polo.\n\nWhat year? 1940 How long did it continue? 3-4 yrs\n\n16. Name any other sports teams that were organized before 1940, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nLacrosse, softball, baseball.\n\n17. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nCurling and skating done on natural slushy. First skating rink built 1940.\n\nThen was the first indoor rink built, and what was it used for?\n\nCurling skating rink 1950. Used for hockey also.\nDescribe the way children of these families would be treated in the event of their parents' death.\n\n1. Describe how different minority groups, including African Americans, Hispanics, and Asian Americans, would be treated in the event of their parents' death.\n\n2. How do you think these changes will affect the community?\n\n3. What changes have you noticed in the community since the recent protests?\n\n4. How do you think these changes will affect the community?\n\n5. Describe the types of services that are available to the community.\n\n6. How do you think these changes will affect the community?\n\n7. For what purpose was the event organized by your community to stay together?\n\n8. How do you think these changes will affect the community?\n\n9. How do you think these changes will affect the community?\n\n10. How do you think these changes will affect the community?\n\n11. How do you think these changes will affect the community?\n\n12. How do you think these changes will affect the community?\n\n13. How do you think these changes will affect the community?\n\n14. How do you think these changes will affect the community?\n\n15. How do you think these changes will affect the community?\n\n16. How do you think these changes will affect the community?\n\n17. How do you think these changes will affect the community?\n\n18. How do you think these changes will affect the community?\n\n19. How do you think these changes will affect the community?\n\n20. How do you think these changes will affect the community?\n\n21. How do you think these changes will affect the community?\n\n22. How do you think these changes will affect the community?\n\n23. How do you think these changes will affect the community?\n\n24. How do you think these changes will affect the community?\n\n25. How do you think these changes will affect the community?\n\n26. How do you think these changes will affect the community?\n\n27. How do you think these changes will affect the community?\n\n28. How do you think these changes will affect the community?\n\n29. How do you think these changes will affect the community?\n\n30. How do you think these changes will affect the community?\n\n31. How do you think these changes will affect the community?\n\n32. How do you think these changes will affect the community?\n\n33. How do you think these changes will affect the community?\n\n34. How do you think these changes will affect the community?\n\n35. How do you think these changes will affect the community?\n\n36. How do you think these changes will affect the community?\n\n37. How do you think these changes will affect the community?\n\n38. How do you think these changes will affect the community?\n\n39. How do you think these changes will affect the community?\n\n40. How do you think these changes will affect the community?\n\n41. How do you think these changes will affect the community?\n\n42. How do you think these changes will affect the community?\n\n43. How do you think these changes will affect the community?\n\n44. How do you think these changes will affect the community?\n\n45. How do you think these changes will affect the community?\n\n46. How do you think these changes will affect the community?\n\n47. How do you think these changes will affect the community?\n\n48. How do you think these changes will affect the community?\n\n49. How do you think these changes will affect the community?\n\n50. How do you think these changes will affect the community?\n\n51. How do you think these changes will affect the community?\n\n52. How do you think these changes will affect the community?\n\n53. How do you think these changes will affect the community?\n\n54. How do you think these changes will affect the community?\n\n55. How do you think these changes will affect the community?\n\n56. How do you think these changes will affect the community?\n\n57. How do you think these changes will affect the community?\n\n58. How do you think these changes will affect the community?\n\n59. How do you think these changes will affect the community?\n\n60. How do you think these changes will affect the community?\n\n61. How do you think these changes will affect the community?\n\n62. How do you think these changes will affect the community?\n\n63. How do you think these changes will affect the community?\n\n64. How do you think these changes will affect the community?\n\n65. How do you think these changes will affect the community?\n\n66. How do you think these changes will affect the community?\n\n67. How do you think these changes will affect the community?\n\n68. How do you think these changes will affect the community?\n\n69. How do you think these changes will affect the community?\n\n70. How do you think these changes will affect the community?\n\n71. How do you think these changes will affect the community?\n\n72. How do you think these changes will affect the community?\n\n73. How do you think these changes will affect the community?\n\n74. How do you think these changes will affect the community?\n\n75. How do you think these changes will affect the community?\n\n76. How do you think these changes will affect the community?\n\n77. How do you think these changes will affect the community?\n\n78. How do you think these changes will affect the community?\n\n79. How do you think these changes will affect the community?\n\n80. How do you think these changes will affect the community?\n\n81. How do you think these changes will affect the community?\n\n82. How do you think these changes will affect the community?\n\n83. How do you think these changes will affect the community?\n\n84. How do you think these changes will affect the community?\n\n85. How do you think these changes will affect the community?\n\n86. How do you think these changes will affect the community?\n\n87. How do you think these changes will affect the community?\n\n88. How do you think these changes will affect the community?\n\n89. How do you think these changes will affect the community?\n\n90. How do you think these changes will affect the community?\n\n91. How do you think these changes will affect the community?\n\n92. How do you think these changes will affect the community?\n\n93. How do you think these changes will affect the community?\n\n94. How do you think these changes will affect the community?\n\n95. How do you think these changes will affect the community?\n\n96. How do you think these changes will affect the community?\n\n97. How do you think these changes will affect the community?\n\n98. How do you think these changes will affect the community?\n\n99. How do you think these changes will affect the community?\n\n100. How do you think these changes will affect the community?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Only school days.\n\nDid it grow out of or replace the earlier community picnic? Or was it responsible for starting the first sports day?\n\nThen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nUsed Old-Time Text Books\n\nHead I remember We knew both brothers (Handy School gradebook)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\nPopular.\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\nColonial Books, Thirty\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\nHead of School Library, After 1895. Sunday School Library, Before 1895.\n\nAcknowledgment of.\n\n48. Was there a school library? When was it begun? 1895\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nNot to any extent.\n\n49. Did parents ever use their children's school texts books as additional reading material?\n\nYes\n50. Has there ever been a community library in your district or town? When was it started? Who started it? Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nMost of books were donated. Many in not too good repair & not able to finance a librarian's office. Books were supposed to be returned in 2 weeks.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nSubscribed to Winnipeg papers, Toronto papers, district papers. Changed to Regina papers, local papers. Also magazines.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYes. Depended on church publications a great deal.\n50. Has there ever been a community library in your district or town? If so,\nwhen was it started? How many people used it? What arrangements were made for borrowing books?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Abbotien packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nYou attended church functions a good deal.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   Ans.: Got a piano about $80\n\n57. What instruments did any of your neighbors have?\n   Organs, Piano, Violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   Piano. But from ranchers who moved away do not know price paid.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   Not very great. Usually had a sing song Sunday evenings by relatives and friends.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   Mostly sing songs. Occasional Musical Concerts. Very little group singing.\n\n60. What were some of the favorite songs in the home?\n   Church & School hymns.\n\nin the community?\n   The popular songs of the day.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   Not to any extent. Was very few instruments were in district. Not enough to take part.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   No.\n\n63. Was there a band in your community? Yes. When was it started? 1895.\n   Who started it? Local farmers. How long did it continue? 7-8 yrs.\n   After started school closed but it did not continue long due to lack of a leader.\n   How many were in it? 15. Who was bandmaster? Don't remember.\n\nWhat instruments were included?\n   Popular band of brass.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n   Practiced regular. Did not have uniforms. Which played at several events with band concerts in summer.\n56. What musical instruments did you bring west with you?\n   - [Handwritten note: \"Piano\"]\n\n57. What instruments did any of your neighbors have?\n   - [Handwritten note: \"Piano\"]\n\n58. What musical instruments have you bought since you came to the west? Give\n   dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your entertainments in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How many were in it? What instruments were included?\n\n   - [Handwritten note: \"Played at regular events with bands in summer.\"]\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNo\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nLess important other than church choirs. Younger generation do not seem to have time for it.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHave a few stamps not well kept. Have an old times museum in town I donate to it. It's open to public & have a nice selection. Keep a resident caretaker.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nNo special hobbies. In early days did lot of horseback riding & often went out in evenings on riding party.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNot to any extent\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nBeing in ranching district round my time, branding time always very popular. Later years horse racing. Stampedes.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, races, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page; or extra sheets if necessary.)\n\nBeing in ranching district Normal of time, handling lime always over popular. But year house raising. Starfields.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883A-L_1897.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 8681, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1210, 3], [1210, 1210, 4], [1210, 3115, 5], [3115, 4669, 6], [4669, 6341, 7], [6341, 6341, 8], [6341, 8195, 9], [8195, 9477, 10], [9477, 11073, 11], [11073, 12160, 12], [12160, 13889, 13], [13889, 15409, 14], [15409, 17082, 15], [17082, 23616, 16], [23616, 24875, 17], [24875, 26408, 18], [26408, 27656, 19], [27656, 28560, 20], [28560, 30453, 21], [30453, 31443, 22], [31443, 33063, 23], [33063, 34147, 24], [34147, 34147, 25], [34147, 34301, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]