[{"id": "7a0a1561c62ae06492bb767cb00c6fffdeeca03c", "text": "Dear Mr. Bishop,\n\nI have received this form enclosed from the Provincial Archives and as I have not been in this country too long I was wondering if you would be good enough to complete this form and mail it. I am enclosing a stamped addressed envelope for your convenience.\n\nYours truly,\n\nP. T. Hill\n\nMarch 24, 1952\n\nOXBOW, SASK.\n\nGRAN - FLOUR - COAL - BINDER TWINE\n\nTelephone 24\n\nFRASER-HILL LIMITED\nFRASER-HILL LIMITED\nGRAND TRADING\nOXBOW, SASK.\nMarch 24, 1952.\n\nDear Mr. Bishop,\n\nI have received this form enclosed from the Provincial Archivist and as I have not been in this country too long I was wondering if you would be good enough to complete this form and mail it. I am enclosing a stamped addressed envelope for your convenience.\n\nYours truly,\nF. T. Hill.\n\n[Signature]\n\nDear Mr. Thomas,\n\nI'm glad to hear that you're doing well and having success in your new venture. It's wonderful to hear about your progress.\n\nSincerely,\n\n[Signature]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA LIST OF QUESTIONS TO THE PERSON\n\nANSWERING THIS QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES OFFICE,\n\nUNIVERSITY OF SASKATCHEWAN,\n\nSASKATOON, SASK.\n\nPROVINCE. PLEASE SEND YOUR COMPLETED QUESTIONNAIRE TO:\n\nOFFICE AT THE UNIVERSITY OF SASKATCHEWAN AS PART OF THE PERMANENT RECORD OF OUR\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's\n\nPreservation of Questionnaires\n\n() Pioneer family experiences\n\n() Pioneer social life, sports and recreation\n\n() Pioneer farming experiences\n\n() Pioneer education and childhood\n\n() Pioneer housing\n\n() All questionnaires\n\nand one will be sent to you.\n\nWestern Canadian Pioneers' Day is still being celebrated. If you have not already\n\nanswered this, and would be willing to do so, please put a check mark here ( )\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nOther Questionnaires\n\nWrite them on separate sheets of paper for a separate questionnaire.\n\nIf more than one member of the family can answer the questions, they should\n\nwrite them on separate sheets of paper for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before\n\n1922, and may be answered by anyone who has personal experience of the pioneer\n\nyears whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should\n\nwrite them on separate sheets of paper for a separate questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because\n\nindividuals who are asked to answer it have exactly the same experiences as another\n\nSome of the questions here will not apply to your experiences; others may prove\n\nimpossible for you to answer, so don't worry about leaving blank spaces. Use a\n\nblack pen or pencil if there is not sufficient space to answer the questions. Do not\n\nhesitate to give details, or describe particular events, if they help to answer\n\nthe questions.\n\nIt is difficult to prepare a general questionnaire on pioneer life because\n\nindividuals who are asked to answer it have exactly the same experiences as another\n\nSome of the questions here will not apply to your experiences; others may prove\n\nimpossible for you to answer, so don't worry about leaving blank spaces. Use a\n\nblack pen or pencil if there is not sufficient space to answer the questions. Do not\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nA. METHOD OF ORIENTATION TO THE PIONEER EXPERIENCE QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Saskatchewan will have exactly the same experiences as another.\n\nSome of the questions here will not apply to your experience; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use \"I don't know\" or \"not applicable\" if there is not sufficient space to answer the question.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled Pioneer Life: What Did Western Canadian Pioneers Eat? is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing and churchwork\n( ) Pioneer education and employment\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Bishop Ernest\n\n2. Your address: Saskatchewan\n\n3. Date: March 29, 1962\n\n4. Where were you born? (Give name of place and country) Almogava, Moldavia\n\n5. What was your father's name and occupation? Joseph Alexander\n\n6. When did you come to Saskatchewan? (Give month and year) April 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Hallard or government information?) Through other people? Reading about it?\n\n11. What did you think of the land and climate when you first arrived?\n\n12. Did you have any difficulty adjusting to life in the new country?\n1. Your full name: Edward Bishop\n2. Your address: Palmeria, Nanticoke\n3. Date: March 29, 1962\n4. Where were you born? (Give name of place and country): Palmeria, Nanticoke\n5. What was your father's name and occupation?: Henry Bishop, Blacksmith\n6. When did you come to Saskatchewan? (Give month and year): April 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: [Handwritten text not legible]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.) [Handwritten text not legible]\n9. What were your reasons for coming West? [Handwritten text not legible]\n10. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?) [Handwritten text not legible]\n12. What did you, friends and relatives think of your decision to come to Western Canada?\n\n13. Did you travel by yourself or with a party (family, friends or other groups)?\n\n14. What difficulties of the journey best do you remember? (People you met on the way, meetings with Indians, experiences on the journey, accidents or other experiences)\n\n15. Where did you first stay when you arrived in Saskatchewan? (We lived at)\n\n16. Where did you settle or take up land? (Section 32, Township 31, Range 31)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn 1891 until 1894, we lived in Melfort, Saskatchewan\n\nIn 1894 until 1897, we moved from Melfort to\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy father was a teacher in Ontario until we moved west to the Prairies. He taught school as a missionary for 3 yrs. John is an auto mechanic.\n\n19. What part of a tree and a formula...\n21. What did your friends and relatives think of your decision to come to Western Canada? They were mostly afraid of the harsh climate.\n\n22. Did you travel by yourself or with a family (father, mother, children)? We came as a family but father had been out west until 1894.\n\n23. What means of transportation did you use? We used the Canadian Pacific Railway.\n\n24. How many people were in your family? We had 6 people.\n\n25. What was the weather like when you arrived? It was very cold and snowy.\n\n26. What was the first thing you did after arriving? We set up camp near a river.\n\n27. What was the hardest part of the journey? The long train ride.\n\n28. What was the most memorable experience? Meeting new people and making friends.\n\n29. What was the best part of the journey? Seeing the beautiful scenery.\n\n30. What was the worst part of the journey? The long train ride.\n\n31. Where did you first stay when you arrived in Saskatchewan? We stayed at a farm.\n\n32. Where did you settle or take up land? We settled in the Alameda district.\n\n33. Mention any other places where you have lived since coming to Saskatchewan. We moved to the railroad town in 1891 until 1894.\n\n34. How did you earn a living before coming to Western Canada? How after you came?\n\nMy family were blacksmiths in Alberta until we moved here. Then we started the farm at Cochrane for 3 years. We opened up a blacksmith shop in the little village of alameda which ended as part of a store and 2 families.\n19. How often did you write to relatives or friends in your old home? Shortly 2 or 3 times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle especially because it had commerce and an opportunity to earn a living doing business and making a living.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. Also names.\n\nOur brothers farmed in Ontario and Alberta until 1910. Our mother farmed in Ontario and Alberta. Parents.\n\nMy other brother worked in Canada about 18 years to 1900. He was only about 18 when he left.\n\n23. If there any particular experience of pioneer days that stands out in your memory which you would like to record.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting relatives, etc.) How often how far?\n\nHad a good time by town farm working from Edmonton to Nanton. Worked hard. It was difficult at first because we had a house to build and food to grow. We also needed a lot of lumber. We had a hard time getting food and supplies. However, it was a good experience. We learned a lot of things from our work.\n\n25. In what way do you think life has changed since then?\n12. How often did you write to relatives or friends in your old home? Twice a year.\n\n13. If you have a letter that may be of interest back to answer letters from your uncle John Bailey.\n\n14. If you got married, give the name of your husband or wife, along with the date of marriage.\n\n15. If you have any children, give their names and ages.\n\n16. If you have any grandchildren, give their names and ages.\n\n17. If you have any great-grandchildren, give their names and ages.\n\n18. If you have any nieces or nephews, give their names and ages.\n\n19. If you have any cousins, give their names and ages.\n\n20. If you have any aunts or uncles, give their names and ages.\n\n21. Did you ever go to school? Yes, I attended school for five years.\n\n22. If so, where did you attend school? I attended school in [city].\n\n23. If you have any brothers or sisters, give their names and ages.\n\n24. Did you travel about much in the early years? Yes, I traveled extensively by train and car.\n\n25. What was your occupation? I worked as a [occupation].\n\n26. Did you have any hobbies or interests? Yes, I enjoyed [hobby].\n\n27. Did you have any pets? Yes, I had a [pet].\n\n28. Did you have any favorite books or authors? Yes, I enjoyed reading [author].\n\n29. Did you have any favorite songs or musicians? Yes, I liked [musician].\n\n30. Did you have any favorite movies or actors? Yes, I enjoyed watching [actor].\n\n31. Did you have any favorite TV shows or performers? Yes, I liked [performer].\n\n32. Did you have any favorite sports or athletes? Yes, I enjoyed watching [athlete].\n\n33. Did you have any favorite foods or recipes? Yes, I loved [food].\n\n34. Did you have any favorite places to visit? Yes, I enjoyed visiting [place].\n\n35. Did you have any favorite vacations or trips? Yes, I enjoyed [trip].\n\n36. Did you have any favorite holidays or celebrations? Yes, I enjoyed [holiday].\n\n37. Did you have any favorite traditions or customs? Yes, I enjoyed [custom].\n\n38. Did you have any favorite memories or experiences? Yes, I enjoyed [experience].\n\n39. Did you have any favorite quotes or sayings? Yes, I liked [quote].\n\n40. Did you have any favorite sayings or quotes? Yes, I liked [quote].\n29. How often did you shop in the early days? About once a week usually.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of stores did you buy in the very earliest also what recreation of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period?\n\n32. What (if ever) did you first begin to buy through the mail order catalogue?\n\n33. When you came to Greenbushen the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n34. How did you first have a telephone and what company provided it?\n\n35. When did you first have a automobile and what make?\n\n36. If you owned a car before 1917, did you buy it from a dealer or did you buy it from someone else?\n\n37. Where was your trading center? How far from your house was it? How much did you have to walk to get there?\n\n38. What was your favorite game?\n25. Then was the first car used in the community? about 1909\n\n26. If you owned a car before 1914, when did you buy it? What makes did you have until 1917?\n\n27. Where was your residence at that time? How far from your home was it?\n\n28. Did you continue to travel by horse and buggy or did you acquire any other means of travel?\n\n29. How often did you shop in the early days? About once a week regularly.\n\n30. When (if ever) did people in your district first start buying by mail order?\n\n31. (If ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order since then.\n\n32. When did you first have a telephone? What company provided it?\n\n33. When did you come to Santa Barbara? You make up your mind after trying it out? Then did you make your final decision?\n\n34. Have you ever desired to leave Santa Barbara and go to California? If so, where did you go?\n\n35. Are you still living in Santa Barbara?\n34. Did any people move away from your district prior to 1947? What messages did they leave?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were likely to have or do something\n\n38. How did the places in your community get their names? (School district, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) the date and reason for change, (2) the origin and meaning of the name, and composition of present signposting place-name, (3) any changes in names since the latest name in column (2), (4) any changes in names since the latest name in column (3).\n\n39. Are there any other interesting facts about your town or county?\n\n40. Bishop Ernest\n34. Did any people move into your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? If so, why?\n\n36. If you or some members of your family have held political offices or have been active in any organization, mention it here. Giving dates whenever possible.\n\n37. If so, why?\n\n38. How did the places in your community get their names? (School, Listerly Post Office, Village, Railway Station, Bridge, Hill, etc.) Try to give the origin and meaning of the name.\n\n39. Other—(I cannot give the one who suggested it) October 1st named.\n\n40. New—(I cannot give the one who suggested it) December 1st named.\n\n41. Other—(I cannot give the one who suggested it) November 1st named.\n\n42. Other—(I cannot give the one who suggested it) September 1st named.\n\n43. Other—(I cannot give the one who suggested it) August 1st named.\n\n44. Other—(I cannot give the one who suggested it) July 1st named.\n\n45. Other—(I cannot give the one who suggested it) June 1st named.\n\n46. Other—(I cannot give the one who suggested it) May 1st named.\n\n47. Other—(I cannot give the one who suggested it) April 1st named.\n\n48. Other—(I cannot give the one who suggested it) March 1st named.\n\n49. Other—(I cannot give the one who suggested it) February 1st named.\n\n50. Other—(I cannot give the one who suggested it) January 1st named.\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n(1) Be willing to lend them to the Provincial Archives for copying.\n\n(2) Be willing to present them to the Archives Library at the University of Saskatchewan...\n\n(Indicate your preferences, if any) ..................\n\nIf you have any other information about your family history, please provide it here:\n\nWould you be the person who owns them all?\n\nDo you have any personal papers or photos of your family? If so, how many do you have?\n\nDo you have any personal papers or photos of your family? If so, how many do you have?\n\nPlease give the names and addresses of other persons who could answer this question.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nHelen Wright (Manager of Gardens)\n\nAnd New Zealand\n\nTo date: Henry Alexander\n\nGive name and address here:\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, family records, and documents relating to Bishop Ernest?\n\nIf so, please provide details.\n\nWould you or the person who owns them be willing to lend them to the Provincial Archives for copyright purposes?\n\n(1) Yes\n(2) No\n\nIf yes, please provide details.\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\nMy oldest daughter, Mary (Mary) Albert Andrews, married John Smith.\n\nMy second daughter, Jane (Jane) Smith, married Robert Johnson.\n\nMy son, Albert Smith, married Emily Johnson.\n\n41. What do you think are the most important changes in your community since 1914?\n\nFirst came the railroad, then came the school, then came the church, then came the hospital, then came the library, then came the park, then came the school, then came the hospital, then came the library, then came the park.\n\n42. How has the social life changed in your community since 1914?\n\nSocial life has changed greatly. Children now attend school instead of working in the fields. Social life has also become more focused on family gatherings and community events.\n\nPlease list the names and addresses of other persons who could answer these questions.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_426.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5475, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 402, 5], [402, 949, 6], [949, 3448, 7], [3448, 5478, 8], [5478, 6395, 9], [6395, 7235, 10], [7235, 8187, 11], [8187, 9657, 12], [9657, 11021, 13], [11021, 13188, 14], [13188, 14206, 15], [14206, 15232, 16], [15232, 16121, 17], [16121, 17481, 18], [17481, 18578, 19], [18578, 20030, 20], [20030, 20030, 21], [20030, 20184, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]