[{"id": "5f94af0db63d710804df7643c33b2e67b35efcbf", "text": "S-X2\n574. Cates Catherine Esther (Mrs. Charles William)\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the question.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in western Canada for 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\nOther questionnaires\n\n() All questionnaires\n() Pioneer diet\n() Pioneer schools\n() Pioneer churches\n() Pioneer recreation and social life\n() Pioneer farming experiences\n() Pioneering in Saskatchewan\n() Pioneer health and housing\n\nPresentation of questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Catherine Esther (Mrs. Charles William)\n\n2. Your address: R.R. 1, HAMMANS, BRITISH COLUMBIA\n\n3. Date: 30th June, 1944\n\n4. Where were you born? (Give name of place and country): Oct. 19, 1871 - HELNSBURGH, SCOTLAND\n\n5. What was your father's name and occupation?: ROBERT W. M. BUSINESS MAN\n\n6. When did you come to Saskatchewan? (Give month and year): January 1897\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n8. How old were you when you first came to western Canada? (You do not need to answer this question if you were not yet born when I was a small child, or if I was in my teens, etc.)\n\n9. What were your reasons for coming west? (Including family, business, opportunity, etc.)\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: CATHERINE E. ESTHER (MRS. CHARLES) GATES\n\n2. Your address: R.R.I., CHEMINUS, B.C.\n\n3. Date: JULY 1947\n\n4. Where were you born? (Give name of place and country): HELENSBURGH, SCOTLAND\n\n5. What was your father's name and occupation?: ROBERT WE MYSS BUSINESS MAN\n\n6. When did you come to Saskatchewan? (Give month and year): JANUARY 1897\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   Scotland 1871 - 1881 To RONDO 1881 - 1883\n   WINNIPEG - NOV 1883 - 1884\n   RABBIT HILL PLACE\n\n8. How old were you when you first came to Western Canada? (If you do not need to answer this question, let us know)\n\n9. What were your reasons for coming West? (To find work, to be near family, etc.)\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nEvery little except that some friends who had lived near our Manitoba home were living in Okotoks. We were called South Okotoks then, and the school was called Okotoks Point. It was named after a point.\n12. What did you friends and relatives think of your decision to come to West-\n\nern Canada?\n\n13. Did you travel by yourself or with a party (family, friends or other group)?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other)\n\n15. Where did you first stay when you arrived in Saskatchewan? (As a Mennonite)\n\n16. Where did you settle or take up land?\n\n17. What places have you visited since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nSee 22-17-93 W.3.\n\n2.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was an adventure because we were going west and exploring new places.\n\n12. Did you travel with a party (family, friends or other group)? Yes, we traveled with a group of friends.\n\n13. What means of transportation did you use? We took the CPR train to South Pasco, Washington.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.) We had a long journey which seemed endless. The meeting with the two friends who were getting married in South Pasco was very special.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a friend's house until we found work.\n\n16. Mention any other places where you have lived since coming to Saskatchewan. We moved to British Columbia.\n\n17. How did you earn a living before coming to Western Canada? Teaching then farming at Bonnifield.\n\n18. How did you earn a living after coming to Western Canada? Now, after you...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskaheehan because of your recommendation? If so, what?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\n25. How far to church? To school? To town? By what means of transportation?\n\n26. What was life like when you were young? What kind of games did you play?\n\n27. What kind of clothing did you wear?\n\n28. What kind of food did you eat?\n\n29. What kind of entertainment did you have?\n\n30. Did you have any pets?\n\n31. What kind of work did you do?\n\n32. What kind of leisure activities did you enjoy?\n\n33. What kind of music did you listen to?\n\n34. What kind of sports did you play?\n\n35. What kind of books did you read?\n\n36. What kind of movies did you watch?\n\n37. What kind of TV shows did you watch?\n\n38. What kind of radio programs did you listen to?\n\n39. What kind of computers did you use?\n\n40. What kind of cell phones did you use?\n\n41. What kind of internet did you use?\n\n42. What kind of social media did you use?\n\n43. What kind of transportation did you use?\n\n44. What kind of travel did you take?\n\n45. What kind of vacations did you take?\n\n46. What kind of hobbies did you have?\n\n47. What kind of sports did you play?\n\n48. What kind of music did you listen to?\n\n49. What kind of movies did you watch?\n\n50. What kind of TV shows did you watch?\n\n51. What kind of radio programs did you listen to?\n\n52. What kind of computers did you use?\n\n53. What kind of cell phones did you use?\n\n54. What kind of internet did you use?\n\n55. What kind of social media did you use?\n\n56. What kind of transportation did you use?\n\n57. What kind of travel did you take?\n\n58. What kind of vacations did you take?\n\n59. What kind of hobbies did you have?\n\n60. What kind of sports did you play?\n\n61. What kind of music did you listen to?\n\n62. What kind of movies did you watch?\n\n63. What kind of TV shows did you watch?\n\n64. What kind of radio programs did you listen to?\n\n65. What kind of computers did you use?\n\n66. What kind of cell phones did you use?\n\n67. What kind of internet did you use?\n\n68. What kind of social media did you use?\n\n69. What kind of transportation did you use?\n\n70. What kind of travel did you take?\n\n71. What kind of vacations did you take?\n\n72. What kind of hobbies did you have?\n\n73. What kind of sports did you play?\n\n74. What kind of music did you listen to?\n\n75. What kind of movies did you watch?\n\n76. What kind of TV shows did you watch?\n\n77. What kind of radio programs did you listen to?\n\n78. What kind of computers did you use?\n\n79. What kind of cell phones did you use?\n\n80. What kind of internet did you use?\n\n81. What kind of social media did you use?\n\n82. What kind of transportation did you use?\n\n83. What kind of travel did you take?\n\n84. What kind of vacations did you take?\n\n85. What kind of hobbies did you have?\n\n86. What kind of sports did you play?\n\n87. What kind of music did you listen to?\n\n88. What kind of movies did you watch?\n\n89. What kind of TV shows did you watch?\n\n90. What kind of radio programs did you listen to?\n\n91. What kind of computers did you use?\n\n92. What kind of cell phones did you use?\n\n93. What kind of internet did you use?\n\n94. What kind of social media did you use?\n\n95. What kind of transportation did you use?\n\n96. What kind of travel did you take?\n\n97. What kind of vacations did you take?\n\n98. What kind of hobbies did you have?\n\n99. What kind of sports did you play?\n\n100. What kind of music did you listen to?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the date and place of marriage.\n\n21. Did anyone also come to Saskatchewan because of your recommendation as a place to settle? [Signature]\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nMy husband's family usually went to church. The vehicle was always filled with people from Brandon and two horses pulled from church. You used horse and buggy or cutter, also a dray buggy. Also drove to Delapelle occasionally. Sometimes went more often to Red Deer. Visits to Valhalla & Kinneighly C.R.C. Often to 1916 pleasure excursions & to Appelle, Indian Head, & other places.\n25. When was the title car used in the commission? Why did you choose it?\n\n26. If you owned a car before 1916, when did you buy it?\n\n27. Have you ever trading contact from your house?\n\n28. Did you continue to trade horses (including any changes due to new taxes)\n\n29. How often did you shop in the early days? What was your favorite store?\n\n30. When (if ever) did people in your district first start going to town reg-\n\n31. When (if ever) did you first begin to bury through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Benningtonen the first time we it with the idea of staying permanently? Or did you make up your mind after trying it out? When did\n\n\\[a - H_0 = b \\cdot y_{0.5} - c/1899\\]\n25. When was the first car used in the community? (It was bought by Mr. Smith in 1912.)\n\n26. If you lived near before 1912, why did you buy it? What makes it?\n\n27. Did you travel outside the county? If so, how far?\n\n28. Did you continue to trade there? (Indicate any changes due to new stores appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Why?\n\n30. When did people in your district start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, did you make up your mind after trying it out? (Most did not make this decision.)\n34. Did any people move away from your district prior to 1947? What reasons?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"tied\" to have or do some—\n\n38. How did the places in your community get their present (school districts, post offices, villages, railway stations, creeks, hills, etc.)? Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first use of the name (5) any changes in names since then.\n\n39. How would you like to see your community grow? Would you like to see new names added above it (1), (2), (3), (4), (5)?\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people leave during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"active\" to have or do something in the district mentioned here, give dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change.\n\n39. How did the school buildings get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in name since the first name was given, date and reason for change.\n\n40. Did any buildings or structures in the district have special significance?\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, town, old pamphlets, old newspapers, written recordings and remarks, essays (typescript), etc.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archives for copying?...........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the Saskatchewan Institute for Public Policy?\n\n40. If you have children or grandchildren, please give their names, where they live and occupation. Please give their names, where they live and occupation.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe new appearance of the Sandilands School in downtown Estevan in 1883.\n\nSaw the school built by parents and students in Estevan in 1883.\n\nSchool Board for eighty-five years and many more in the future.\n\nPoveshell County for field work.\n\nPoveshell County for field work.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIt someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nCatherine Ester, Oct. 1958\n\nIf you have any questions R.C. to personnel\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have a list handy of paragraphs, please give their names, dates, etc.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1897_574.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5013, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 56, 4], [56, 1601, 5], [1601, 3267, 6], [3267, 4173, 7], [4173, 5532, 8], [5532, 6157, 9], [6157, 7255, 10], [7255, 11094, 11], [11094, 12085, 12], [12085, 12851, 13], [12851, 13597, 14], [13597, 14464, 15], [14464, 15702, 16], [15702, 17096, 17], [17096, 18043, 18], [18043, 18043, 19], [18043, 18197, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]