[{"id": "20659f88f33277e0c00d63cd089d750b3d490aec", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Grahame)\n\nPlease print name and address in capital letters.\n\nYour full name: WILLIAM SCHAEFER\nPresent Address: Cavalier\nPioneer Address: Nicola\nYear you came to Saskatchewan: 1907\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About 10 or 11.\n   How many of these were bachelor's homes? Seven.\n\n2. How often did you usually visit neighbors? Once or twice a week.\n\n3. Did you usually visit on a Sunday, or other days? Anytime.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Visited without invitations.\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Anytime.\n   What about meals? Did you stay when not invited beforehand? Of course.\n\n   How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?)\n\n   If no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n   In a few cases crops were tended or harvested for someone who was ill.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n   Cards & dances were common.\n\n   Were these more frequent in later years? Give dates.\n\n   Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No\nSASKATCHEWAN ARCHITECT QUESTIONNAIRE\n\nNo. 5\nPopular Recreation and Social Life.\n\nRECREATIONAL ACTIVITIES, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? (Please list names.)\n\n2. How often did you usually visit neighbors? Once or twice a week?\n\n3. Did you usually visit on a Sunday, or other days? Anytime.\n\n4. Have you visited to other homes, or was most visiting done without an invitation? Visit without invitation.\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? Any time.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees,\" with groups of neighbors come together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, and if possible, tell what the reasons were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in houses? Describe.\n\nCarol & David went camping.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.? No\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? about 1910\n\nWhat material was it made of? Lumber\n\nHow large was it? Good size\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Limited liability co.\n\nWas it built in the village or town, or was it a country hall? Village meets\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) It served a much greater area, including about four school districts.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties? In Barns\n\n11. What card games were popular in the early days? Whist, Euchre, Pinocle\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Square, Waltz, Polka, Two Step, etc.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. No one frowned on it, they never heard of it.\n8. Tell what was made of the school house for community events, parties, etc., if you have not described these in the School Questionnaire. Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built? (around 1910)\n\nWhat material was it made of? (wood)\n\nWas it built by the community through special funds, the school board, or other organizations?\n\nWas it built in the village or town, or was it a country hall? (Village)\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you have to go to town to have parties?)\n\nDid you have to travel far for other functions? (if you were close enough to make use of the hall for all gatherings, etc.)\n\n10. How did a school function also? (including about four school districts)\n\nWhen parties, dances, etc., were held in houses, school houses or halls? (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? (yes, no)\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. (yes, no)\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. (yes, no)\n12. What attempts at formality, or \"manners\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? None.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nI am 84 years old and never knew of had a chance to attend a Chivaree.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Local Improvement Club\n\nGive the date and reason for it being organized.\n\nTo get roads & other improvements\n\nSaves were $400 or $500 each for local improvement\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nOrganized about 1906\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nPractically all.\n\nHow many women belonged? How often did it meet? Three or four times a year\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? Yes in the early years\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n13. Was the church known in your community? Yes\n\nDescribe what you remember about churchwork, telling how contacts they were.\n\nHave you ever attended a church service?\n\nDescribe any other details of visiting or attending a church service.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can recall being established in your community?\n\nGive the date and reason for its being organized.\n\nWas there a Saskatchewan Grain Growers' Association in your community?\n\nTall when it was organized and what stage had it reached by this organization?\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nHandwritten: \"Russell's Band of Literary Society including only the school band. This included school children and parents.\"\n\nWhat means were commonly used by organizations for raising money?\n\nHandwritten: \"Dances, concerts, fairs\"\n\n19. Where did various organizations hold their meetings?\n\nHandwritten: \"In the school or in someone's home\"\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before\nthe school was built (for example, clubs, lodges, etc.). If there were none, explain why.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures? Talks on foreign\nlands, etc.? Yes\n\n21. What games did boys play in summer (rattlesnake, ball, marbles, fly kites,\netc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *Skating and sherry on nearby Pond*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.  \n   *only children*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *Adults had little time for games*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n**PICNICS AND SPORTS**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *July 1906*\n\n26. Who organized it?  \n   *Mr. Marnick*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *Entire Community & Surrounding districts*\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *Pony races, children's races also races for boys, girls, teenagers*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *People brought own lunch*\n\n31. What did you have to eat and drink?  \n   *Tea, coffee, sandwiches, salads, etc.*\n\n32. What time of the day did it start, and how long did it last?  \n   *About two P.M.*\n5. What winter games were played outside - fox and hounds, baseball, etc.\n\n22. Did anyone play indoor games in winter - card games such as \"Happy Face,\" \"Go Fish,\" \"Checkers,\" or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? Describe.\n\nPRINCIPLES AND METHODS\n\n25. What was the date of the first picnic that you attended in Omaha?\n\n26. Who organized it? (Name)\n\n27. Was it for the entire community or for a smaller group, such as a school district, Sunday school, civic organization, etc.?\n\n28. Was it the first picnic held in the community? If so, describe it.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)? (Any other children have the same fun?)\n\nBoy's Girls' Teenagers\n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups?\n\nPeople brought own dinner\n\n31. What did you have to eat and drink?\n\nTea, Coffee, Sandwiches - Delicacies, etc.\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nCurling Rink built in Nicola about 1926.\n35. What changes have you noticed in skating since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local airports, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nCurling Puck briefly in North about 1926\n40. When did an annual \"sports day\" become established in your community? About 1922.\nDid it grow out of or replace the earlier community picnic? Yes.\nWho was responsible for starting the first sports day?\nGrace Brown.\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). May 1st.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. Not at all.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\nThere are two libraries in Cavalcade.\nTraveling and Mechanics Institute.\n\n48. Was there a school library? Yes. When was it begun? About 1905.\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. Then did an annual \"sports day\" become established in your community? If so, did it grow out of or replace the earlier community plans?\n\nWho was responsible for starting the first sports day?\n\nWhat was the sports day usually called (that month, or any special day, such as May 25th or July 4th)?\n\n41. Are there any from your community who have been members of well-known boxing, hall or other teams? Give names and dates.\n\nREADING:\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible.) If not all on nearly as you can how many books you brought, and what kind? (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nEarly Days:\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\nThere are two libraries in Covington, but they are travelling and Mediation's local.\n\n48. Was there a school library? Yes.\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it? \n   Is it still in existence? Yes.\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n   Russell & Co. Library consisting of about sixty or seventy five books, kept by teacher. Later, Mechanics & Library combined kept by elevator agent. Both still in existence.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   Country Gentleman, Saturday Evening Post, Family Herald and Weekly Star and several other farm papers.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   Several dozen of books, no papers.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No\n8. Has there ever been a community library in your district or town?  \n   When was it started?  \n   Who started it?  \n   Is it still in existence? Yes  \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n50. What newspapers or magazines did you subscribe to when you first came to the west?\n\n51. Describe later charges in your subscription, such as increase in subscriptions and added others.\n\n52. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\n53. Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Brass Euphonium\n\n57. What instruments did any of your neighbors have? Violins\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nCanadian Born, a few from the states—No old Country folk songs were ever heard.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? yes When was it started? 1910 or Eleven\n\nWho started it? Mr. Schaefer\n\nHow long did it continue? Until First War\n\nHow many were in it? About 15 to 20\n\nWho was bandmaster? Mr. Schoepf\n\nWhat instruments were included? Basses Baritone tenors altos Cornets drums slide trombones Reeds\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nPractice once a week, no uniforms\n\nFairs, Picnics, Stampedes &c.\n\nThis band was organized after the first war was discontinued.\n\nin 1935\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? (List)\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.)\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? About who was conductor? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nMeet twice a week. No uniforms!\n\nFairs, Picnics, Church socials, etc.\n\nThe finish was never discontinued. (Later)\nThe following Members were in military Bands during the First War:\n\nGeorge Willey, Cornetist; Frank Greening, Cornet\nJames Tompkins, Tuba.\n\nHenry Verne is now Clarinetist in the Toronto Symphony Orchestra.\nThe following members were in military bands during the first war.\n\nGeorge W. Kelley, Cornetist, French Hornist, Cornetist\n\nHenry Warner is new Clarinetist for the Toronto Symphony Orchestra!\nIf Slimtrim Fasteners No. 613 S are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1982.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6915, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1213, 5], [1213, 1213, 6], [1213, 2975, 7], [2975, 4567, 8], [4567, 6466, 9], [6466, 8122, 10], [8122, 9739, 11], [9739, 10714, 12], [10714, 12181, 13], [12181, 12596, 14], [12596, 14209, 15], [14209, 15569, 16], [15569, 16839, 17], [16839, 17761, 18], [17761, 19160, 19], [19160, 20537, 20], [20537, 21812, 21], [21812, 22757, 22], [22757, 24315, 23], [24315, 25582, 24], [25582, 25788, 25], [25788, 25980, 26], [25980, 26078, 27], [26078, 26229, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]