[{"id": "f41e07eccd72a3e8d7a25507d3417b9791d75817", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If the question does not apply to you, simply leave it blank.\n\nIf there is not enough space to answer all the questions, please feel free to give details or describe particular events. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Charles Dentith\n2. Your address: 123 Main Street, Saskatoon, Saskatchewan\n3. Date: March 21, 1952\n4. Where were you born? (Give name of place and country): Canada\n5. What was your father's name and occupation? William Dentith\n6. When did you come to Saskatchewan? (Give month and year): June 19, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Lived in England (Old Home)\n   - Lived in Calgary (Old Home)\n   - Lived in Edmonton (Old Home)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.)\n9. What were your reasons for coming West?\n   - To find work\n   - To find land\n   - To find opportunity\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nFrom all three sources\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Full name: Charles Dentith\n2. Your address: 3724 4th Ave., Regina, Saskatchewan\n3. Date: 27.06.1952\n4. Where were you born? (Give race of place and country)\n   County: Weyburn, Province: Saskatchewan\n5. What was your father's name and occupation?\n   Father: Edward Dentith\n6. When did you come to Saskatchewan? (Give month and year)\n   January 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   1889-1905: Parson, Prince Albert\n   1905-1911: Regina, Saskatchewan\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n9. What were your reasons for coming West?\n   To find work and earn a living\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFrom all three sources\nThis first homestead from Cal 3 to\nNov 23 when we had a three day\nblizzard & walked eleven miles for\nthat year. Came on homestead and\nfound this place 30th then went to North Y\nBonny O'neal (Haworth Schooltown)\nNorth east of Bonny's Township a year\n& had to pull back to home town for 6\nFeb in last 6 months $707 + $1456 in loss\nBy 09 in our to take Jane Carmack\nKennedy's School W.W. Butts\nRemained there till July 9 1911. Had\nto leave to find a time to purchase land\nhomestead. Have remained on farm\nsince then.\nThis first mentioned from Cal's.\n\nNov. 23 when we had a three day stay and worked on homestead and that year came on homestead and tried this place in the then new North Y.\n\nBrooklyn of Green (Prairie Schoolhouse)\n\nNorth east of Bountiful Township a year\n\nHad a few friends to come by on Feb. 8\n\nPut in east 6 months $741.56 worth\n\n1909 in June was completed. Went out on\n\nKeighly School R.R. Butts\n\nRemained there till July 1st 1911. Had\n\nto leave to find me time on the homestead\n\nHomestead. Have remained on farm\n\nKnew them.\nThis first mentioned from from Ola's K.\nFrom 23 when we had a three day\nBurgess & worked elated Schorfor\nMay - June. Came on homestead and\nfound in 1926 in the then head. North Y\nBrooklyn opened (Poveshell School House)\nNorth east - Boundary Township on Pan L.\nHad to sell house to farm\nFirst in 1927 - 6 months $857.74 / 1926 mths\n$358.74 move up homestead. Went out in\n1929 - 1930 went to take Large German\nSchools School R.M. Poveshell.\nRemained there till July 1931. Had\nto leave it find another time to homestead\nHomestead. Have remained on farm\nKnow them.\nThis first remained from April 3rd to Nov. 23 when we had a three day Blizzard which closed school for that year. Came on homestead and lived in one room then went to North of Bounty opened (Hassock School Open) North east of Bounty taught a year & had to get back to prove up on land. First in last 6 months of '07 & '08 & '09 proved up homestead. Went out in '09 & '10 Aug. to take charge of German Heights School N.W. of Butte. Remained there till July 1st '11. Had to leave to find me time to purchased homestead. Have remained on farm since then.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThought it was a good opportunity.\n\nFor young people to get a start.\n\n12. Did you travel by train or bus with a party (family, friends or other groups)?\n\nWorked in Harwood, excursion to Medicine Hat.\n\n13. What means of transportation did you use?\n\nTrain from Warden Station to Medicine Hat.\n\nNatural excursion.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nJourney was without incident of note.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Early Laramie Hotel.\n\n16. Where did you settle or take up land?\n\nTownship 27 R16 W3.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSpent from April 3rd in Regina.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWas on farm near St. Albert before coming to Saskatchewan. After completing Normal School in July 1911, then came to farm near Medicine Hat. Then came to new school (Invermere) June 8th, 1912.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it was a good opportunity.\n\n12. Did you travel by train or car? If by train, what day was it?\n   I traveled by train from Windsor Station in Ontario.\n\n13. What means of transportation did you use?\n   Train from Windsor Station in Ontario.\n\n14. What incidents of the journey most do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement.)\n   I remember meeting many interesting people along the way.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   I stayed at the early Clunton Hotel.\n\n16. Where did you settle or take up land?\n   I settled in the area near the town of Clunton.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   I have lived in Regina, Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Before coming to Western Canada, I worked as a farmer. After coming, I worked as a teacher in a school.\n\n19. How did you earn a living before coming to Western Canada? How after you came?\n   Before coming to Western Canada, I worked as a farmer. After coming, I worked as a teacher in a school.\n19. How often did you write to relatives or friends by your old home?  \nNot very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.  \nMr. & Mrs. John Johnson & daughter\n\n21. Did anyone else come to Saskatchewan because of your recommendation?  \nNo\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.  \nNone\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?  \nSpent a month in June 1916 on hills south of Elmoza on two-to-one wood while neighbor (Riley) Hauled up from So. Lanes worked around for winter. No Railway. Nearest town was Sutherland or Numbly. No Bridge at Hamley so had to cross to Sutherland to cross river.\n\n24. Did you travel about much in the early years? (For business or attending church, visiting friends, etc.) How often? By what means of travel?  \nVery little. Church over 8 miles away. Neighbors house by Ocean & miles away occasionally. Would only fill these miles away.\n19. How often did you write to relatives or friends by your old home?\n\nNot very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nBruce Johnson & Emily Johnson d.d.s. (signature)\n\n21. Did anyone else come to Saskatchewan because of your recommendation to settle?\n\nOlder brother, Mr. Johnson.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n\nPartially East, partially West.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nSpent a month in January 1916 in South of Elmoire on twelfth and worked while neighbor (Riley) Hauled up house load.\n\nHave never owned a car or winter No Railway.\n\nReceives through Saskatoon or Nambly. No Bridge at Nambly so had to come to Saskatoon to cross river.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n\nVery little. Visited our brother in neighboring house by Ocean railroad occasionally. Visited neighbors there rarely.\n\naway\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading post? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. What kind of articles did you buy by mail order? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nI expected to make a permanent of State\n\nup land.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. What was your traveling expenses from your house to Hamilton in 1909\n\non the year-year road? In 1914 Elmo and\n\n28. Did you continue to make these [intentional] any changes due to new terms appear-\n\nlast better means of travel, etc.\n\nline advanced hotels trade at Hamilton 25 miles\n\nthen Ruthven 16 miles away\n\nThen in 1914 Elmo 13 miles + When Wartime 8 miles\n\nFord all gas from one\n\ncity for winter\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogue?\n\n32. What kind of articles did you buy by mail order since the pioneer period.\n\nPoveshell about 1914-15 when Railroad\n\n33. When did you first have a telephone and what company provided it?\n\nWartime Rural\n\n34. When you came to Ruthven the first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? Then did you\n\nmake this decision?\n\nI expected it to make a permanent of itself\n\nmy land.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or do something in the district, mention it here, giving dates whenever possible. (Such as owning the first automobile, organizing, contributing, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (If any change in name since the first name was given, date and reason for change. Give facts of new name as stored in (1), (2), (3).\n\nSchool districts (Running down) from South on edge of town in this district - Post Office\n\non armed after Station when Railway came in in 1923\n\nWas named after some hero in World War One.\n\nHas been no change in name.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nNo\n\n35. Did many people move during the 1920s? Did many return?\n\nIn any word away did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nSally F. (or) Charlie Bunnyworth S.B. 2559\n\nAbout 4 years she was a trustee of Baldwin S.D. about 3 years am living in Baldwin so yet.\n\n37. If you or any of your family or friends were interested in having or do something in the district, mention it here, giving dates whenever possible. (Such as town meetings, school board meetings, etc.)\n\nLee Evans for R.C.G.F. and got elevator (paid)\n\nNew Lee Evans Part + got paid to buy R.C.G.F.\n\nall Garnworth\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railroad stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (If any change in name since the first name was given, date and reason for change. Give facts of your name as above in (1); (2), (3).\n\nSchool district - (Poveshull) from land on edge of hills in this district - Post Office named after Station when Railway came on in 1923 and known when Station got name.\n\nWas named after some hero in World War One.\n\nHas been no change in name.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, minute books of community organizations? (Genealogical)\n\nRight. Have two old typewriters that they are on farm house.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) _______ _______ _______\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur children Ida, Hattie, Bernie, Louise\n\nClara & Bruce. Family & Grand children\n\nFive Great Grand children were arriving\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe villages Hamlet of Yarmouth was most with railway advance in this county also introduction of telephone.\n\n1917. Bigger change was lack of people remaining on farms in winter and introduction of larger farms & fewer neighbors\n\nPlease give the names and addresses of other pioneers who could answer this ques-\n\ntionnaire. Jim James & Robertson one of earliest\n\nresidents of Roblin Rawlins River Pam.\n\nTom Fitzgerald also Roblin River\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, newspapers, old photographs, etc.? If so, please describe them.\n\n40. Would you be willing to lend them to the Provincial Archivist for copying? Yes/No\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe village Hamlet of Gramworth was once with its storeyed homes in this county, also introduction of telephones.\n\n1917. Began change over lack of people remaining on farms in remote area introduction of larger farms of fewer neighbors.\n\nPlease give the names and addresses of other people who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906D-G_903.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5210, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1954, 5], [1954, 1954, 6], [1954, 2903, 7], [2903, 3862, 8], [3862, 4376, 9], [4376, 4904, 10], [4904, 5466, 11], [5466, 6018, 12], [6018, 7171, 13], [7171, 8450, 14], [8450, 9549, 15], [9549, 10651, 16], [10651, 11612, 17], [11612, 12787, 18], [12787, 13961, 19], [13961, 15424, 20], [15424, 16907, 21], [16907, 17829, 22], [17829, 17984, 23], [17984, 18138, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]