[{"id": "5ed7f4930a997e6d9c75b79892bd6ffc4ccc7115", "text": "Please print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan ______________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: Robert Young John\n\nPresent Address: [Handwritten]\n\nPioneer Address: [Handwritten]\n\nYear you came to Saskatchewan: [Handwritten]\n\n[Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.]\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1944, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nYOUR EXPERIENCE OF EARLY SCHOOL ACTIVITY\n\n1. Persons answering this questionnaire will have learned of school life in the early days in Saskatchewan in different ways, and in order that your answers may be of the most value, please put a check mark beside each of the following which apply to you, giving dates wherever possible:\n\n   - You went to school in Saskatchewan\n   - Your children attended school\n   - You taught school\n   - You were a school trustee\n   - Other (ratepayer or resident, school inspector, etc.) Explain and give dates.\n\nIf your experience in different capacities took you into more than one community (for example, if you taught in various districts, or taught in one place, then married and lived in another part of the province), make it clear in your answers which place and time you are referring to in each question, or explain here which of these you intend to deal with in this questionnaire. (If you would like separate questionnaires for different roles which you played, please ask for another copy).\n\nBUILDING AND EQUIPMENT\n\n2. Was school held in your district before a school building was erected?\n\n   If so, describe the arrangements, telling where school was held, how many pupils attended, who the teacher was, how long this system continued, as well as any other details which you may remember.\n\n3. When was the school in your district built? 1905\n\n4. Who designed and built the building? Edmelson (not legible)\n\n5. What material was the school made of (logs, lumber, stone, or other material)? Lumber\n\n6. What was the size of the building? about 24 by 36 ft\n\n   Of the classroom? (if more than one classroom, give number and sizes)\n\n   Were there cloakrooms for coats, or were they hung at the back of the classroom? Hung at back of school\n\n   Did the school have a basement? No What use was made of it?\n\n   If the building included any other rooms besides those mentioned in this question, tell what they were used for, and their sizes.\nYOUR EXPERIENCE OF EARLY SCHOOL ACTIVITY\n\n1. Persons answering this questionnaire will have learned of school life in the early days in Saskatchewan in different ways, and in order to have your answers be of the most value, please put a check mark beside each of the following which apply to you, giving dates wherever possible:\n\n   - You went to school in Saskatchewan\n   - Your children attended school\n   - You taught school\n   - You were a school trustee\n   - Other (ratepayer or resident, school inspector, etc.) Explain and give dates.\n\nIf your experience in different capacities took you into more than one community (for example, if you taught in various districts, or taught in one place, then moved and lived in another part of the province), make it clear in your answers which place and the year you are referring to in each question, or explain here which of these you intend to deal with in this questionnaire. If you would like separate questionnaires for different roles which you played, please ask for another copy.\n\nBUILDING AND EQUIPMENT\n\n2. Was school held in your district before a school building was erected?\n\n   If so, describe the arrangements, telling where school was held, how many pupils attended, who the teacher was, how long this system continued, as well as any other details which you may remember.\n\n3. When was the school in your district built? 1905\n\n4. Who designed and built the building? Jack Bull\n\n5. What materials was the school made of (logs, lumber, stone, or other material)?\n\n6. What was the size of the building? Of the classroom? (If more than one classroom, give number and sizes)\n\n   Were there cloakrooms for coats, or were they hung at the back of the classroom? Yes\n\n7. Did the school have a basement? No\n\n   What use was made of it?\n\nIf the building included any other rooms besides those mentioned in this question, tell what they were used for, and their sizes.\n7. Were there any additions or major alterations in the school later? If so, explain what these changes were, giving sizes, and explain the reason. (that is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed).\n\n8. Is this first school building still in use? If not, give the reason. (burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started?\n\nHow many children of school age were there in the school?\n\nHow many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n7. Were there any additions or major alterations in the school later? If so, explain what these changes were, giving sizes, and explain the reason. (That is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed).\n\n8. Is this first school building still in use? If not, give the reason. (Burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain.\n\n10. Describe the school equipment—desks, (kind and number), blackboards, maps, etc., one desk or front & blackboards at front and same ones on other side.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started? How many children of school age were there in the school? How many bachelors or others in the district helped in establishing the school? Explain.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n12. Describe the steps taken towards the starting of the school.\n\nA meeting was called by the people in the district and it was decided to build a school.\n\n13. What was the name and number of the school district? Gap View School District named after the Gap View district.\n\nWho suggested the name? George Watson when he and his sister were visiting their aunt Mrs. John Baxter.\n\nWho or what was the district named after? A gap in the hills between Mount Mountain and a ridge of small hills.\n\nWas there any difficulty or disagreement over choosing this name? No.\n\n14. How many women, if any, were on the first trustee board set up?\n\nHow many women have served on boards since? Give dates if possible.\n\nHow many bachelors were on the first board? None since?\n\n15. Was it difficult to get people to act as trustees? Explain.\n\n16. Were school trustees usually parents with children going to school? Yes.\n\nWas it thought that the teacher \"flourished\" the children of trustees? No.\n\nDid the trustees try to do their best for the school, or were they mainly interested in \"keeping down expenses\"? Explain.\n\n17. Were the ratepayers' annual meetings well attended? Yes.\n\n18. How long did teachers usually stay at your school - a year, less than a year, for several years?\n\nMostly summer months.\n\n19. Did the teacher \"board around\" from one place to another, have a regular boarding place, a teacherage, etc.? Explain.\n\nStayed at Emma's or John Baxter Jr.'s.\n\nHow much was charged for board? Mostly free.\n\n20. How did the teacher get to school? Mostly horse.\n\nHow far did he or she have to go? From a mile to three mile.\n\n21. In choosing a teacher, was preference shown to either sex? No.\n\nDid a man receive a higher salary? How much were the salaries?\n\nWas a preference shown to any nationality or religion? Explain. No.\n12. Describe the steps taken towards the starting of the school.\n\n13. What was the name and number of the school district? Who suggested the name? Who or what was the district named after?\n\n14. How many women, if any, were on the first trustee board set up? How many men have served on boards since? Give dates if possible.\n\n15. Was it difficult to get people to serve as trustees?\n\n16. Were school trustees usually parents with children going to school? Was it thought that the teacher represented the children of trustees? Did the trustees try to do their best for the school, or were they mainly interested in keeping down expenses?\n\n17. Were the ratepayers' annual meetings well attended?\n\n18. How long did teachers usually stay at your school - a year, less than a year, or several years?\n\n19. Did the teacher board around from one place to another, have a regular boarding place, a teaching place, etc.? How much was charged for board?\n\n20. How far did he or she have to go? How far did he or she have to travel to their school?\n\n21. In choosing a teacher, was preference shown to either sex? Did a man receive a higher salary? Was a preference shown to any nationality or religion? Explain.\n22. What was the approximate age of most teachers in your school? 24\n\nIn choosing a teacher, was preference given to any particular age group? Explain.\n\nWhat were the teachers like, mix with people in the district, take part in community activities, etc.? \n\nDid many of the teachers marry someone in the district?\n\n23. How much did older pupils help the teacher with smaller ones at school? Tell whether it was a regular custom, or only once in a while, and what they did to help—mark arithmetic questions, hear reading, give spelling, etc.\n\n24. Were report cards sent to parents? How often?\n\nWere any other means used to let parents know how their children were doing in school? Explain.\n\nWere parents usually interested in finding out how their children were doing, and in what activities were being carried on in school? Explain.\n\n25. How often did the school inspector visit the school? Once a year\n\nWhat means of travel did he use?\n\nWere his visits considered of benefit to the school? Explain.\n\nWas the character of the inspector such that he was respected by trustees, teachers and others in the district? Explain.\n\n26. Who did the janitor work and lit the fires?\n\nWho looked after the fire during the day?\n\nWhat kind of a stove or furnace was used?\n\nWhat fuel was used? Where was fuel kept (a separate building, in school building, etc.)?\n\nDuring cold weather, was the school always warm enough in the morning to start school on time?\n\nIf not, what did the pupils do to keep warm (play running games, etc.)?\n\n27. Did school always start at 9 a.m. and close at 3:30 p.m.? If not, tell what changes were made, and reasons. (For example, if opening time in winter was 9:30 a.m., etc.)\n22. What was the approximate age of most teachers in your school? \n\nIn choosing a teacher, was preference given to any particular age group? \nExplain.\n\nWhat were the teachers like, mix with people in the district, take part in community activities, etc.? \n\nDid many of the teachers marry someone in the district? \n\n23. How much did older pupils help the teacher with smaller ones at schools? Tell whether it was a regular custom or only done in a crisis, and what they did to help—mark arithmetic questions, hear reading, give spelling, etc.\n\n24. Were report cards sent to parents? \nHow often? \nWere any other means used to let parents know how their children were doing in school? Explain.\n\nThere parents usually interested in finding out how their children were doing, and in what activities were being carried on in school? Explain.\n\n25. How often did the school inspector visit the school? \nOnce a year\n\nWhat means of travel did he use? \nWas his visits considered of benefit to the school? Explain.\n\nWas the character of the inspector such that he was respected by trustees, teachers and others in the district? Explain.\n\n26. Who did the janitor work and lit the fires? \nWho looked after the fire during the day? \nWhat kind of stove or furnace was used? \nWhat fuel was used? \nWhere was fuel kept (a separate building, in school buildings, etc.)?\n\nDuring cold weather, was the school always warm enough in the morning to start school on time? \nIf not, what did the pupils do to keep warm (play running games, etc.)?\n\n27. Did school always start at 9 a.m., and close at 3:30 p.m.? If not, tell what changes were made, and reasons. (For example, if opening time in winter was 9:30 a.m., etc.)\n\nS-N2\n3563. Young Robert John\n28. To what extent did the school board buy textbooks to supply free to the pupils?\n\nto resell to the pupils?\n\nDid the school board supply pupils with scribblers, pencils, or other school supplies? Explain.\n\nIf each family bought their own books and supplies for school, where did they usually buy them (at the local store, send away for them, teacher sent for them)? Teacher sent for them.\n\nSCHOOL ATTENDANCE.\n\n29. How many pupils attended your school? about 20\n\n30. How far were you from school? 1 mile\n\nHow did most of the children in the district get to school (walking, riding horseback, etc.) in summer? drive\n\nin winter?\n\nWas there a barn for the horses? yes how large? about 16x20\n\n31. Do you remember the pupils ever having to stay at school all night because of a blizzard, spring time floods, or other such conditions? In 1914 they had to stay in school overnight or describe the circumstances.\n\nWas it the custom to have the school closed during the winter months? Explain. yes\n\nin the fall or other time so children could help with work at home?\n\n33. Was the school ever closed because of epidemics of diseases?\n\nTell what diseases, and give dates and length of time school was closed.\n\n34. How much did pupils have to miss school to help with work at home?\n\nbecause of bad weather?\n28. To what extent did the school board buy text books to supply free to the pupils? \n\nDid the school board supply pupils with pencils, pens, etc.? Explain.\n\nIf each family bought their own books and supplies for school, where did they usually buy them (at the local store, send away for them, teacher gave for them)? \n\nSCHOOL ATTENDANCE.\n\n29. How many pupils attended your school? \n\n30. How far were you from school? \n\nHow did most of the children in the district get to school? (walking, riding horseback, etc.) In summer? In winter?\n\nWas there a barn for the horses? Yes or No? \n\nWas there a stable for the horses? Yes or No? \n\n31. Do you remember the pupils ever having to stay at school all night because of a blizzard, spring tide floods or other such conditions? \n\nDescribe the circumstances.\n\n32. Was it the custom to have the school closed during the winter months? \n\nIn the fall or other time so children could help with work at home?\n\n33. Was the school ever closed because of epidemics of diseases? \n\nTell what diseases, and give dates and length of time school was closed.\n\n34. How much did pupils have to miss school to help with work at home because of bad weather?\n35. What was the attitude of most of the children towards going to school (dislike it, like it because of teacher, other pupils, get away from work at home, learning to read books, etc.)? Explain.\n\n36. Were any children in your district taught at home instead of coming to school?\n   Why (distance, weather, not wish children to associate with others, etc.)?\n\nCLASSROOM ACTIVITIES\n\n37. Did the subjects, reading, writing, and arithmetic, make up most of the school program? Explain.\n\n38. Was reading taught mostly by \"sounds\", or by some other method? Explain.\n\n39. How large a part did oral reading play in school work (how often did pupils in lower grades read aloud from their readers, in what grade was this discontinued, did pupils ever read aloud from other books besides their readers, did pupils in higher public school grades ever read aloud, and from what books, etc.)?\n\n40. Were pupils given much \"memory work\" to learn from their readers or from other books? Explain.\n   Did the teacher usually ask pupils to recite memory work, or write it on the blackboard, or in scribblers, etc.?\n\n41. Describe the nature of writing lessons and practice, - were they from copy books, from the readers, writing so many lines of a certain letter, etc.?\n   How much was printing used in the primary grades instead of writing?\n\n42. Describe any particular features of arithmetic classes which you remember. (For example, were questions written on the blackboard or were books used, was adding, subtracting, multiplying and dividing of extremely large numbers required, was much use made of practical, everyday problems in arithmetic?)\n35. What was the attitude of most of the children toward going to school (like it, liked it because of teacher, other pupils, got away from work at home, learning to read books, etc.)? Explain.\n\n36. Were any children in your district taught at home instead of attending to school? Why (distance, weather, not wish children to associate with others, etc.)?\n\n37. Did the subjects, reading, writing, and arithmetic, make up most of the school program? Explain.\n\n38. Was reading taught mostly by \"sounds\", or by some other method? Explain.\n\n39. How large a part did oral reading play in school work (how often did pupils in lower grades read aloud from their readers)? In what grades was this discontinued? Did pupils in higher public school grades ever read aloud, and from what books, etc.? \n\n40. Were pupils given much \"memory work\" to learn from their readers or from other books? Explain.\n\nDid the teacher usually ask pupils to recite memory work, or write it on the blackboard, or in notebooks, etc.? \n\n41. Describe the nature of writing lessons and practice, - were they from copy books, from the readers, writing so many lines of a certain letter, etc.? \n\nHow much was printing used in the primary grades instead of writing?\n\n42. Describe any particular features of arithmetic classes which you remember. (For example, solving questions written on the blackboard or were books used, was adding, subtracting, multiplying and dividing of extremely large numbers required, was much use made of practical, everyday problems in arithmetic?)\n43. Did you have much formal grammar (parsing words, picking out subject, predicate, object, etc.)?\n\n44. Describe any activities designed to improve the manner of speaking and writing of the pupils, such as written exercises in the use of the correct word, or attempts of the teacher to improve the spoken English of the pupils.\n\n45. Were pupils very often asked to write compositions, and how important a part did this activity play in school?\n\n46. Did any of the teachers encourage pupils to write poetry?\n\n47. Did pupils do much speaking before the rest of the school, such as telling stories, giving talks, holding debates, etc.?\n\n48. Was any language besides English taught in any of the public school grades? Give details.\n\nWhat proportion of the children, if any, could not speak English when they started school?\n\nWere they given special instruction to help them learn English, or were they left alone to \"pick it up\" from the other children?\n\n49. As nearly as you can remember, tell how much the following subjects were taught — whether they were taught regularly, not taught at all, or only once in a while if a teacher was interested in that subject. Add any details you can remember as to how they were taught, and what activities were carried on in connection with these subjects:\n\n- History\n- Geography\n- Nature Science\n- Literature\n- Art\n- Music\n- Physical Training\n7.\n\n43. Did you have much formal grammar (parsing words, picking out subject, predicate, object, etc.)?\n\n44. Describe any activities designed to improve the manner of speaking and writing of the pupils, such as written exercises in the use of the correct word, or attempts of the teacher to improve the spoken English of the pupils.\n\n45. Were pupils very often asked to write compositions, and how important a part did this activity play in school?\n\n46. Did any of the teachers encourage pupils to write poetry?\n\n47. Did pupils do much speaking before the rest of the school, such as telling stories, giving talks, holding debates, etc.?\n\n48. Was any language besides English taught in any of the public school grades? Give details.\n\nWhat proportion of the children, if any, could not speak English when they started school?\n\nWere they given special instruction to help them learn English, or were they left alone to \"pick it up\" from the other children?\n\n49. As nearly as you can remember, tell how much the following subjects were taught, - whether a teacher was interested in that subject, Add any details you can remember as to how they were taught, and what activities were carried on in connection with these subjects:\n\nHistory\n\nGeography\n\nNature Science\n\nLiterature\n\nArt\n\nMusic\n\nPhysical Training\n50. Tell about any other subjects studied at school, or activities carried on in connection with school work, which have not already been mentioned.\n\n51. Were slates ever used in your school? If so, when was their use discontinued?\n\n52. What were the usual punishments for misbehavior?\n\nHow much did teachers make pupils learn memory work as a punishment?\nWere they very often required to write lines as a punishment?\nWere there any incidents in which parents objected to the form of punishment given by the teacher? What was done about it?\n\n53. What religious observance was carried on in school, such as opening school with Lord's prayer, hymn, etc.?\n\nSCHOOL HEALTH CONDITIONS\n\n54. What arrangements were made for eating the noon lunch? (Did pupils sit in their seats, go outside, etc.) in summer? in winter?\n\n55. Did pupils wash their hands before eating? Describe the washing arrangements.\n\n56. What foods were brought in school lunches?\n\n57. Were pupils allowed to eat part of their lunch at recess time?\n\n58. Was there always drinking water at school? Where was water secured for the school? Who carried it?\n\n59. Tell what toilet accommodation there was. (outside toilets, separate ones for boys and girls?) Outside toilets.\n51. Were classes over work in your school? Yes\n\nIf so, when was the class dismissed?\n\n52. What were the usual punishments for misbehavior?\n\nHow much did teachers make pupils learn memory work as a punishment?\n\nWere they very often required to write lines as a punishment?\n\nWere there any incidents in which parents objected to the form of punishment given by the teacher?\n\nWhat was done about it?\n\n53. What religious observance was carried on in school, such as open bag school?\n\n54. What arrangements were made for eating the noon lunch? (Old pupils sit in their seats, go outside, etc.)\n\nIn summer?\n\nIn winter?\n\n55. Did pupils wash their hands before eating?\n\nDescribe the washing arrangements.\n\n56. What foods were brought in school lunchbox?\n\n57. Were pupils allowed to eat part of their lunch at recess time?\n\n58. Was there always drinking water at school?\n\nWas water secured for the school?\n\nWho carried it?\n\n59. Tell what toilet accommodation there was. (outside toilets, separate cases for boys and girls)\nSCHOOL GROUNDS, GAMES AND ENTERTAINMENT\n\n60. How large was the school yard? Was it fenced? Yes\n\nDescribe any efforts at improvement of the school yard, such as planting trees, flowers, gardens, etc. Give dates if possible.\n\n61. What games did the pupils usually play in cold or rainy weather?\n\nin good weather?\n\nWhat equipment did they have for games, and how was it secured?\n\n62. Were any school teams organized before 1914 to play against teams from neighboring schools?\n\nfor what game or games?\n\nDescribe any details you remember about arrangements for such games.\n\n63. Were there divisions or \"sides\" taken among the pupils because of racial differences, or were some children \"picked on\" because of that or other reasons?\n\n64. Tell what you remember about the school library, as to number and kind of books.\n\nHow much use did the pupils make of the library during school hours?\n\nout of school hours?\n\n65. Was Friday afternoon, or some other time, usually used for special activities, such as spelling, arithmetic or geography matches, meetings of a school society, or other activities? Explain.\n\nDISTRICT SOCIAL LIFE.\n\n66. When did the annual Christmas concert and tree become an established custom in your school, and in neighboring schools? About 1906\n\nHow was money secured for the expenses of the concert, and for gifts and treats for the children (if these were provided)?\nSCHOOL GROUNDS, GAMES AND ENTERTAINMENT\n\n60. How large was the school yard? Describe any efforts at improvement of the school yard, such as planting trees, flowers, gardens, etc. Give dates if possible.\n\n61. What games did the pupils usually play in cold or rainy weather?\n\nIn good weather?\n\nWhat equipment did they have for games, and how was it secured?\n\n62. Were any school teams organized before 1911 to play against teams from neighboring schools?\n\nFor what game or games?\n\nDescribe any details you remember about arrangements for such games.\n\n63. Were there divisions or \"sides\" taken among the pupils because of racial differences, or were some children \"picked out\" because of that or other reasons?\n\n64. Tell what you remember about the school library, as to number and kind of books.\n\nHow much use did the pupils make of the library during school hours?\n\nOut of school hours?\n\n65. Was Friday afternoon, or some other time, usually used for special activities, such as spelling, arithmetic, or geography matches, meetings of a school society, or other activities? Explain.\n\nDISTRICT SOCIAL LIFE.\n\n66. When did the annual Christmas concert and tree become an established custom in your school, and in neighboring schools?\n\nHow was money secured for the expenses of the concert, and for gifts and treats for the children (if these were provided)?\n67. Tell what you remember of the Christmas concerts, type of program, when it was held, if a platform was erected for it, and other incidents connected with it.\n\nThey were held last night at school and mostly had reading, recitation songs, music of several kinds and a dance afterwards.\n\nTo what extent was the teacher's ability as a teacher judged by the success of her Christmas concert? Give details.\n\nWas there much neighborhood rivalry as to which school could put on the best concert? Explain.\n\n68. Tell about any other parties or special events held on particular days, which were a part of the school activity, such as Valentine or Halloween parties, parents visiting the school, etc.\n\nChildren used to exchange valentines.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\nSchool was used as community hall for any meetings that taxpayers wanted to hold.\n\n70. Was the school yard used for school or community picnics, ball games, etc.? Describe.\n\nNo, as we had a quarter section opposite that was always used.\n\nGENERAL\n\n71. What differences were there in the way the school was conducted in the first years you were here as compared with the country you came from?\n\n72. What do you think of the school system today as compared with that in the pioneer days?\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (Use back of page or extra sheets if necessary.)\n67. Tell what you remember of the Christian concerts. Type of program, when it was held, if a platform was erected for it, and other details.\n\n68. Tell about any other parties or special events held on particular days which were a part of the school activity, such as Valentine or Halloween.\n\n69. To what extent was the school building used as a community hall, for dances, dinners, etc., for school meetings, organization meetings, etc.? Describe.\n\n70. Was the school yard used for school or community plants, ball games, etc.? Describe.\n\nGENERAL\n\n71. What differences were there in the way the school was conducted in the first year you were here as compared with the country you came from?\n\n72. What do you think of the school system today as compared with that in pioneer days?\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (See back of page for continuation sheet if necessary.)\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3563.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7692, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1161, 5], [1161, 2288, 6], [2288, 4267, 7], [4267, 6186, 8], [6186, 7362, 9], [7362, 8604, 10], [8604, 10416, 11], [10416, 11614, 12], [11614, 13304, 13], [13304, 15028, 14], [15028, 16324, 15], [16324, 17505, 16], [17505, 19135, 17], [19135, 20675, 18], [20675, 22056, 19], [22056, 23360, 20], [23360, 24591, 21], [24591, 25605, 22], [25605, 26988, 23], [26988, 28342, 24], [28342, 30032, 25], [30032, 31137, 26], [31137, 31137, 27], [31137, 31288, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]