[{"id": "f57596420b4e1176e3b9fcf2c59710d19b1aa82a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graham)\n\nPlease print name and address in capital letters.\nYour full name GEORGE HENRY KNOX\nPresent Address BROADVIEW, S.A.S.K.\nPioneer Address\nYear you came to Saskatchewan 1883\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaires.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nRECEIVED\nMAY 1 - 1953\nSOCIAL LIFE AND VISITING.\n\nNo. 9\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTYING, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? [Handwritten: 2 & 3]\n\nHow many of these were bachelor's homes? [Handwritten: None, only one in a year.]\n\n2. How often did you usually visit neighbors? [Handwritten: After two or three visits a year.]\n\n3. Did you usually visit on Sundays, or other days? [Handwritten: Other days.]\n\n4. Have you often invited to other homes, or was most visiting done without an invitation? [Handwritten: Mostly without invitation.]\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? [Handwritten: Afternoon.]\n\nWhat about meals? Did you stay when not invited beforehand? [Handwritten: Yes, for another.]\n\nBut was the invitation to a meal extended when people had come unexpectedly? (That is, was the term to \"take potatoes\" used, or was some other expression common?) [Handwritten: They were just glad of the company and we took anything that was offered.]\n\nIf no meal, what other refreshment might be offered to visitors who had \"stopped in\"? [Handwritten: Coffee, tea, bread, and butter.]\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? [Handwritten: All went.]\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? [Handwritten: Not many bees in those parts.]\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? [Handwritten: None.]\n\nWere these more frequent in later years? Give dates. [Handwritten: Yes, in winter.]\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, - every two weeks, once a month, once a month, etc.? [Handwritten: Just went and visited people and talked lunch along.]\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire.) Give dates.\n\nHow much of your social life was centered around the school, and within its school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall for town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n1. Tell what you know of the school. What I know for certain is that there was a school at [location]. If you have not described these on the school, you may do so now.\n\n2. How much of your social life was centered around the school? How much did it involve other activities?\n\n3. Was your first community hall built in the village or town, or was it a country hall?\n\n4. How large was it made off? How large was it?\n\n5. Was it built by the community through special funds, the municipality, or some organization?\n\n6. To what extent did it take the place of home or the school house as a place for social intercourse and parties? (For example, if you lived in the country, did you continue to use the local school house for dinner parties, gatherings, etc.? If so, why?)\n\n7. Did you ever attend parties, dances, etc., held in houses, school houses, or halls? (If so, describe them.)\n\n8. How were horses slaughtered and fed in the winter time at these parties?\n\n9. What social games were popular in the early days?\n\n10. Was there any playing for a prize? If so, describe it.\n\n11. Was there any disappointment between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n12. Was playing accepted by all residents in the community, or were there some who favored open, others as an entertainment in the house, or for community gatherings? Explain.\n12. What attempts at formality, or \"snark,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? \n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. \n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? \n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? \n\nTell when it was organized, and what steps led to its organization. \n\nApproximately what proportion of the farmers in the community belonged to it? \n\nHow many women belonged? \n\nHow often did it meet? \n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \n\nWhen was it organized? \n\nApproximately how many women belonged to it? \n\nDescribe what you remember of its activities and services.\n12. What attempts at informality, or friendliness, do you remember to make? Such as getting out into the yard, killing social visits, talking casually in groups?\n\n13. Was the attitude toward you in your community informal? Describe what you remember about children, adults, boys only, or girls only.\n\n14. Describe any other details of childhood, including how you felt about school, family life, friends, and activities.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Bankers' Women's Club in your community? If so, when was it organized, and what steps led to its organization? Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Insert here what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people from outside the town or village (e.g., within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? ☑ Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, purpose(s) for which it was organized, and whether it was connected with the church or not.\n\nWhat names were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Have you ever attended to having general information lectures, talks or foreign lectures, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you ever have magic lantern shows? Give dates if possible.\n\nWho provided the lanterns and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (skipping rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n20. What winter games were played outside - fox and hounds, skating, etc.?\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nmostly the children\n\n21. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\npeople were mostly busy with work.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nfor the entire community\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nmostly races\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\ngeneral lunch\n\n31. What did you have to eat and drink?\n\ncake, pie, sandwiches, meat, tea, lemonade\n\n32. What time of the day did it start, and how long did it last?\n\nafternoon till after supper, as people had to milk cows\n22. What winter games were played outside? (Ex. Red Indians, skating, etc.)\n\nWhat games were played indoors in winter? (Card games such as \"Happy Families,\" \"Checkers\" or other games?)\n\n23. Did the whole family join in such games, or only the children?\n\n24. Tell them what time for games, or was everyone usually busy with some kind of work? Explain.\n\n25. Did children invent games connected with animals, things as buffalo bones, arrows, birds, geese, or other objects or animals, or games in the snow? (Describe)\n\n**POINTS AND SPECS**\n\n26. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n27. Was it for the entire community or for a smaller group, such as a school district, Sunday school, some organization, etc.? (Describe)\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended? (Include games, races, band, etc.)\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? Cake, pie, sandwiches, meat, tea, lemonade.\n\n32. What time of the day did it start, and how long did it last?\n\n33. Afternoon till after dinner, or until half past six in the evening.\n13. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. bigger as more people attend but not as good a time now as then.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n   What year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). skating rink\n\nWhen was the first indoor rink built, and what was it used for?\n31. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of pictures which you know of in the early days, such as the large community pictures taken in churches or Sunday School pictures, family pictures, etc. Tell about any differences in the arrangements, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in pictures since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1911, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger countries, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). \n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? all brought a few.\n\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? there was some done.\n\n45. Did you buy many books after you came west? Give details. not many as there was no money.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. yes, but I have no dates it was in later years.\n\n48. Was there a school library? yes. When was it begun?\n\n   To what extent were books borrowed from the school library for adults to read at home? quite a lot.\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month, or any special day, such as May 21st or July 4th)? First July 8th.\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? All brought a few.\n\nWhat kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors? Give details.\n\n45. Did you buy many books after you came west? Give details. Not many yet.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes, but I love to do it in libraries.\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home? Quite a bit.\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes, in town.\n\nWhen was it started? Who started it? And one started in the school.\n\nIs it still in existence? No\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Family Herald & Weekly Star.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. There got to be more western papers for people to get.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, as the word means & finding out anything.\n50. Has there ever been a community library in your district or town? If so, when was it started?\n   Who started it? How many books did it have?\n\n51. What newspapers or magazines did you subscribe to when you first came to this area? Why did you choose them?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading materials? If so, give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n64. What musical instruments did you bring west with you? None\n\n65. What instruments did any of your neighbors have? None\n\n66. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Organ first\n\n67. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. It played a large part in our lives as neighbors would come and sing.\n\nin the community? Were there musical concerts, was there group singing at parties, etc.? Describe.\n\n68. What were some of the favorite songs in the home?\n\nin the community?\n\n69. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n70. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or somebody, or because of some special happening in the community? Explain. We do not make up songs by self.\n\n71. Was there a band in your community? Yes When was it started? Who started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n1. What instrument did you play at your school?\n\n2. What instrument have you bought since you came to the school?\n\n3. How long have you played this instrument?\n\n4. What was your favorite song in the band?\n\n5. What was your favorite song in the orchestra?\n\n6. What was your favorite song in the choir?\n\n7. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something, or because of some special happening in the community? Explain.\n\n8. Have you ever been in a band in your community?\n\n9. How many were in the band?\n\n10. What instruments were included?\n\n11. Tell what you remember of its activities, how often practice was held, where, if matters had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nIt is more important; it is easier to get to gather and to get music.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n65. In what way has your community become well known or famous in the musical, artistic, or other fields? Mention names and dates and places of public appearances.\n\n66. Is music an important or less important factor in your community now as compared with the early days? If so, why?\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary)\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883A-L_1901.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6593, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1233, 5], [1233, 1233, 6], [1233, 3313, 7], [3313, 3313, 8], [3313, 4961, 9], [4961, 6345, 10], [6345, 7686, 11], [7686, 8779, 12], [8779, 10016, 13], [10016, 10981, 14], [10981, 12446, 15], [12446, 13791, 16], [13791, 15099, 17], [15099, 16342, 18], [16342, 17757, 19], [17757, 19136, 20], [19136, 20249, 21], [20249, 20945, 22], [20945, 22245, 23], [22245, 22979, 24], [22979, 24172, 25], [24172, 24993, 26], [24993, 25140, 27], [25140, 25294, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]