[{"id": "b85f8def1ffeb8941227410915155a646fa79419", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Peter Friesen\n\n2. Your address: Box X1, Rosthern, Sask.\n\n3. Date: April 1899\n\n4. Where were you born? (Give name of place and country): Mountain Saskatchewan\n\n5. What was your father's name and occupation? Peter Friesen, farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 1899\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, \"I was in my teens\", etc.) I was about 15 years old.\n\n9. What were your reasons for coming West?\n\nMy mother used to say that a man named Green and also Mr. Klaus Peters wrote about a new patch settlement in Canada and that there was good farming and hunting here so father wanted to come.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nIt could be that Mr. Klaus Peters was the immigration agent at that time and wrote to the family.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Sokoloff, Julia Ann\n2. Your address: Box 381, Rosthern, Sask.\n3. Date: July 18, 1943\n4. Where were you born? (Give name of place and country): Mountain Ska, Man., N.S.\n5. What was your father's name and occupation?: Peter P. Friesen, farmer.\n6. When did you come to Saskatchewan? (Give month and year): April 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - [Blank]\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) I was about 12 years old.\n9. What were your reasons for coming West?\n   - My mother used to say that a Mr. Hauke from and also Mr. Klaus Peters wrote about a new Dutch settlement in Canada and that there was good farming and hunting here, or father wanted to come.\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?)\n\nIt could be that Mr. Klaus Peters was the immigration agent at that time and wrote to the Indians.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy grandmother on mother's side was very fond about us running. She thought the land between the two men would bleed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nIt was a special train made up of quite a few families.\n\n13. What means of transportation did you use? We came by train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere was one car they used for cooking and since there were so many families, it was hard to find space on the cooker to heat water for coffee. One time father had seen to it that he got his coffee hot on, and when he came back he put it on the table. The rain started and which made the coffee pour all over the table.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at a small shack 16x14 ft. with a sod roof.\n\n16. Where did you settle or take up land?\n\nI bought a quarter section to Saskatoon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nonly farming.\n11. What did your friends and relatives think of your decision to come to Canada?\n\nMy grandmother on mother's side was very fond about us. Warning. We thought the land between the two men would bleed.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nIt was a special train made up of quite a few families.\n\n13. What means of transportation did you use? We came by train.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere was one car they used for cooking and since there were so many families, it was hard to find space on the cooker to heat water for coffee. One time father had run to it that he got his coffee just on, and when he came back he just it on the table. The main branch and which made the coffee pour all over the table.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at almost nothing with another family. We stayed at a small house for a week or two till father could build a small shack 16x14 ft. with a sod roof.\n\n16. Where did you settle or take up land? I bought a quarter 5 miles east of Peshawin.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home? \n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nIn the old days here, we didn't travel much, we had horses but some people only had oxen. Sunday school was held in the school house.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSunday school was held in the school house.\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? \n\n27. Where was your trading center? How far from your home? \n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) \n\n29. How often did you shop in the early days? \n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? \n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. \n\nI remember buying something around 1913. But some of our migrant children had a typewriter, etc., and they ordered nice jewelry very cheap, that was quite a bit earlier. \n\n32. When did you first have a telephone and what company provided it? \n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? \n\nWe came to stay; father came with everything he had.\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? \n\n27. How far from your home? \n\n28. Did you continue to travel by train? (Indicate any changes due to new towns appearing, better means of travel, etc.) \n\n29. How often did you shop in the early days? \n\n30. When did people in your district first start going to town regularly on Saturdays? \n\n31. When did you first begin to buy through the mail order catalogue? \n\nWhat kind of articles did you buy in this way? \n\n32. When did you first have a telephone and what company provided it? \n\n33. When did you come to Saskatchewan the first time? \n\nOr did you make up your mind after trying it out? \n\nWe came to stay, further came with everything. \n\nShe said.\n5. Did any people move away from your district prior to 1941? Most reasons\n\n34. Did any people move away during the 1920's? Did many return?\n\n35. Acme families moved to Paraguay and some came back.\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School) districts, post offices, villages, railway stations, creeks, hills, etc., try to give: (1) name and date of name suggestion, (2) reason for change, (3) date of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nJackson Town council moved away. They took up homestead around Plain Lake.\n\n35. Did many people move away during the 1920's? If so, why?\n\nSome families moved to Paraguay and some came back in 1927. A few families moved to Meadow Lake in 1930's.\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nNothing but school trustees.\n\n37. If you or any of your family or friends were \"thirds\" to have or do something in the district mention it here, giving dates whenever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, etc.) Mention the date of the adoption of any changes in names of places, and mention of the name (3) date of last revision for change. Give dates of since the first name was given, the last reason for change.\n\nNew name as above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations? (Please be sure to include any other materials you may have.)\n\nIf so, would you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes, I am willing to lend them to the Provincial Archivist for copying.\n\n(2) No, I am not willing to lend them to the Provincial Archivist for copying.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJulius Robert Friesen of Port Credit Ont., worked at Walton Air Port.\n\nHe was an officer in the Air Force in the last war.\n\nBetty, William Hunter, Saskatchewan Sask. Rex Husband is a carpenter.\n\nJames Henry Friesen of Port Credit, Sask. a farmer.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe new, the phones and better roads.\n\nThe power coming to the farmers, is the best.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations (describe), old newspapers, written recollections and reminiscences?\n\n3. Years within recollection and circumstances of the years 1899 to 1916 mostly our family and surrounding neighbors.\n\nIt would make a novel book of about 16 or 17 thousand words.\n\nI would like to have it published, but don't know who to turn to.\n\nYes, you should be an old man's historian.\n\n40. Would you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n.............. (initiate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nGraham Robert Friesen of Port Credit Ont., worked at Walton Air Base.\n\nShe was an officer in the Air Force in the last war.\n\nBetty Gillian Harder, Saskatchewan Sack. Her husband is a carpenter.\n\nJames Henry Friesen of Portage Sack, a farmer.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe power coming to the farmers, to the West.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_589.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4497, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1603, 5], [1603, 3200, 6], [3200, 4294, 7], [4294, 5729, 8], [5729, 7021, 9], [7021, 8398, 10], [8398, 9212, 11], [9212, 9935, 12], [9935, 11144, 13], [11144, 11905, 14], [11905, 12675, 15], [12675, 13792, 16], [13792, 15044, 17], [15044, 16627, 18], [16627, 16782, 19], [16782, 16936, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]