[{"id": "9fcf17770125bb9fea7dd50e932263ccc7eb19cc", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of caution to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada for many years can answer all questions. Some of the questions may not apply to your experience; others may have importance only to you. If they do, don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada for 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you or your family; others may prove impossible for you to answer. Don't worry about leaving blank spaces. Don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada for more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark two ones you would be willing to answer:\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have corrections also do the writing at your dictation.\n\n1. Your full name: F. EDWARD WILMOT\n2. Your address: MAYAMENT, SASKATCHEWAN, SASKATCHEWAN\n3. Date: JULY 23, 1955\n4. Where were you born? (Give name of place and country): SLough\n5. What was your father's name and occupation: BUCKINGHAM, ENGLAND\n6. When did you come to Saskatchewan? (Give month and year): WILLIAM WILMOT, June 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you were a small child; \"It was in by tears\", etc).\n   Answer: 25 years\n\n9. What were your reasons for coming West?\n   Possibly being taught much by the Indians, learning their ways, seeing how they live, hearing much talk about young Indians uprising, and I thought it was beautiful there.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    My information obtained from Shapley and Canadian government offices in Gordon's Land.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have answers also do the writing at your dictation.\n\n1. Your full name: ERWAKO, WILMOT\n2. Your address: MAYMENT, SASKATCHEWAN\n3. Date: JULY 22, 1955\n4. Where were you born? (Give name of place and country): SLOUGH, BUCKINGHAM, ENGLAND\n5. What was your father's name and occupation? WILLIAM, WILMOT, FARMER\n6. When did you come to Saskatchewan? (Give month and year): JUNE, 1905\n7. Mention other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you say why I was a child). I was in my teens, etc.\n9. What were your reasons for coming West? Possibly being taught much of the business Canada\n10. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?)\n\nMy information obtained from \"Saskatchewan\" and \"Canada\"\n\nGovernment offices in London, England.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were very surprised when I decided to leave home.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled with my wife, Mrs. William Henry Wilmot.\n\n13. What means of transportation did you use?\n\nSteamship from England.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNothing of extraordinary importance. Please note an incident that is memorable about our journey.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBrandon, Manitoba.\n\n16. Where did you settle or take up land?\n\nPoveshuig, 8th July 1905.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn Canada, especially Toronto 1916-1919.\n\nIn 1931, I took up homestead at what is now known as Junor.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nI was a carpenter in England and a lumberjack in Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They were very surprised by my decision to come here.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I traveled with my wife and family.\n\n13. What means of transportation did you use?\n   We used a steamship from England.\n\n14. What incidents of the journey best do you remember? (People you met on the way, adventures, etc.)\n   Nothing of extraordinary importance. Please note.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Regina, July 8th, 1905\n\n16. Where did you settle or take up land?\n   In Canada, 1911-1915\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   In Canada, 1911-1915\n\n18. How did you earn a living before coming to Western Canada? How long after you came?\n   I worked as a farmer in England and then came to Canada.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nSee above question 21\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWent on a trip always in May/June 1906 also at Roadwork & Melville Roads. Western Alberta too.\n\nattended church. Anglican. Mayors who was built in 1909. You could drive your prairie deck for two years during in 1910. Grew and down through the years during Povesh. Communion Hall and other places for which figure thanks to offerings $5.00 for the opportunity to do same. To this summer glory.\n\nMowbrack mostly in early days & later with snow wagon.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Any other questions?\n25. When was the first car used in the community? (Not sure if this year but)\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes, I came here because my mother promised to go to war in France. You know, I promised to keep my promise, telling my homeland, \"Hey, what's going on?\" We don't have much money and we can't do our life.\n25. When was the first car used in the community? (not any of the year but)\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? Did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy wife Mrs. E.J. Wilmot was leader of the Girl Guides for a year or so before 1930. Wilmot was organized by the Junior Branch about 1928 (PEARL)\n\n37. If you or any of your family or friends were ever forced to have or do something in the district of your residence, please list all such events.\n\n(pearl) as owning the first automobile, combining, etc., etc.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and derivation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change; give facts of new name as above in (1), (2), (3).\n\nMaymont I have always understood was named in honour of a lady, Mrs. May Montgomery, relative to a builder & H.R.\n\nOne through Maymont and JUNIOR SASK was named after the Pemmican Co. South west of Pearl Lake. After rail way came through, town near junior river was the Post Office was moved to Black Lake Rail Station and in Pearl known the Railway Station were named junior.\n\nPEARL School named after the first teacher Mr. Pemmican.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy aunt Mrs. E. Wilmot was head of the Girl Scouts for a year or so before 1930. Pearl was organized by the Chamber of Commerce to pay Ray (1938-1943) was organized by the Junior Board School District (PEARL).\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates whenever possible.\n\nSuch as owning the first automobile, constructing a building, etc.\n\n38. How did the places in your community get their names? (School districts, Post Offices, etc.)\n\nGive (1) name and location of person, agency, place-name, (2) origin of name and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMaymont: Name always pronounced as if written in Roman.\n\nOriginally named \"JUNIOR\" Station, named after the prominent land owner JUNIOR BIRCHLAKE. P.O. Office named after the railway line which ran through the town. The town was named after the railway line which ran through the town.\n\nOffice was named to PEARL after the PEARL school district was named after the Chamber of Commerce.\nQuestions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of councils, by-laws, minutes? (Describe).\n\nAnything to show us what your town looked like?\n\nAnything to show us what your town looked like?\n\nWould you or the person who owns them either:\n\n(1) Be willing to lend them to the Provincial Archivist for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think was the most important change in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nWritten by myself — Edward Wilmot\n\nMaymont, B.C.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of letters, old photos, old photographs, written accounts, etc., which may contain historical material?\n\n(1) Be willing to lend them to the Provincial Archivist for copying. . . . .\n(2) Be willing to present them to the Archives Division of the Legislative Library in Regina, or the Archives Office at the University of Saskatchewan.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address here:\n\nWritten by myself - Edward Wilmot\n\n[Signature]\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\nCopy\n\nMemories of Mr. & Mrs. Edward Wilmot on Leaving England for Canada on June 3rd, 1905 with Ten Month Old Son William Henry Wilmot\n\nWe sailed from England, London Docks on the \"Allan\" Line Steamer Barmanian 31st June Saturday June 3rd 1905.\n\nCalled at Havre, France, staying there one day was permitted to go ashore and saw a little charity feeding hour most day and crossed the Atlantic to Quebec and Montreal.\n\nWe had a very pleasant voyage except for one stormy day. It was very interesting the large fish (porpoises) believe in great numbers gathered around the ship in great numbers. Then too on reaching Canada the large sealings, quite a few of them were young up the mouth of the St. Lawrence river as lightning storms during the night and getting up in the morning to see the villages with their...\nCopy\n\nMemoirs of Mr. & Mrs. Edward Wilmot on Leaving England for Canada on June 3rd, 1905 under Ten Months Old Son William Henry Wilmot.\n\nWe sailed from England London Docks on the \"Allan\" Line Steamer Barmanian Saturday June 3rd, 1905.\n\nCalled at Havre, France, staying there one day was permitted to go ashore and saw a little eighty-five year old man named Mr. Smith.\n\nWe had a very pleasant voyage except for one stormy day. It was very interesting the large fish (porpoises) following great numbers gathered around the ship in great numbers. From Toronto or Montreal Canada the large schools go up the mouth of the St. Lawrence river as lightning storms during the night and getting up in the morning to see the villages with their...\nBlind sheep looking like prisoners doled out fine and\nthere along the shore looking out Cheshire them closer\non to move back away there Sunday June 17th.\n\nFollowing Monday we came to Newbury next day\nshe rammed us stayed over for three or four days\nthen rushed to continue own journey to Bathford\nso we had planned before leaving England\n\nWe were informed at Newbury that we could\nonly get tickets to as far as Humbleton so they\nwere more than two hours the deal \"Had been laid\non our way at Humbleton back we travel a few\nmiles where until we finally crawled into what\nwas to be North Bathford somewhat unexpectedly\nthe final passenger train (of which I am not\nquite sure). Our luggage was dumped out on\nground which we had no leave\nstill we could see were tents mobile charge I\nbelieve there was a log plastered brick dairy on\nsouth side of church\nthe hotel was a manager (and) the restaurant and\nworse than was the same.\nChurch chapel looking like pictures dotted pine and\ntrees along the shore, looking at Chautauqua Lake\non Wednesday morning June 19th.\n\nJourneying northward on train for New York next day\nwe traveled we stayed over night or four days\nthen wished to continue our journey to Barreford\nso we had planned before leaving England\n\nWe were informed at Milwaukee that we could\nonly get tickets to as far as Humboldt so they\nwere not sure how far the steel \"road\" went back\non arriving at Humboldt back we traveled afar-\nward North Barreford on what was probably\nthe first passenger train (of which I am not\nquite sure). Our baggage was dumped out on\nground which we had to leave\nall we could see were tents mobile change\nbefore there was any pleasant building on\nsouth side of track\nthe hotel was a house (not) the restaurant and\nwork-room was the same\nWe left to go across river to Banffford the following\nmorning. We packed a new and thrilling experience crossing\nthe river watching the buggies hung low and the horses\nand mules hanging in hitched buggies pulled on top of\neach other, then gradually and slowly crossing the\nriver.\n\nThen we changed the direction to Invermere.\nBuilding that was quite another experience (learned\nnot much). It was shelter for us (through cloudy)\nas was appreciated.\n\nIn a day or so we purchased a tent & two life\nrafts walls and camp stove which was our only\nstore and shelter for that winter.\n\nIf you work (camping) for a week or so then\nwe moved back to town Banffford. I remember\nwell carrying him and poles with camp stove and\nwhat else. Mr. Wilmet carrying Henry and other\nthings he could manage and hauled up the path\nof nature leading to now the city purchasing our first\na little wear of the Post Office and moving him\nto town as the buildings were being built fast. If you\nwork again and be used to the Canadian way of\nliving was very strange.\nWe left to go across river to Barnlyford the crossing was quite a narrow and thrilling experience crossing a ferry watching them buggies carry horses and cows and mules living in kitchen buggies piled on top of each other then gradually and slowly crossing the river.\n\nThen we changed the direction to Immigrator Barnlyford that was quite another experience (car in dust not much it was shelter for us through our day) it was appreciated.\n\nIn a day or so we purchased a tent & four legs for a foot walls and camp stove which was our only shelter was heater for that winter.\n\nIf you work in camp (working) for a week or so then we moved back to town Barnlyford Premium Co well carrying him and poles with camp stove and what else. Mr. Nelson carrying Henry and other Always she could manage and build up the path of course heading to town the city purchasing our last little wear of the Poor Coffin and moving him to town as the buildings were being built fast. If you work again and big used to the Canadian way of building was very strange\nThe morning it shut you know we walked together I am\namazed when I cross the bridge when travelling\nby railway in and out it chapman.\nOur and was near a young married couple I'm sure\nPercy Knowles will you marry daughter Edmundo from\nNew Orleans Decatur & Homestead NE Sec 8 J41\n3 miles south of Homestead South.\nOn July 9th I flew on it and a day or so later took\nthe train to Yulee where I remained for two weeks\non Shackleford on Shackleford walking the beaches for\nhomestead to see what it was like. Nothing in particular\nnoting was looking around and was eaten in the\ngold rush appearance of the gold like flecks in a man\ncame along young towards building who chopped\nand cut down will Mr. Yurin was his name\nan old prospector and was had a very pleasant\nconversation about how those stories happened to come\ntrue there he young family I saw a man on\nhorseback galloping towards me and I found out\nhis name was Mr. Yurin at the trail at that\ntime passed through Rio Chico and what happens\nwould be his barn.\nThe morning it was pouring we walked together I am convinced when I cross the bridge when travelling my railway in and out of civilization.\n\nOur next was near a young married couple but I have partly thrown in with young daughter Edith Evans from Mr. Houlton's farm at a homestead NE of Sec 2 July 3 miles south of Marymount South.\n\nOn July 9th I fell on my knees and a day or so later Cook the train to Yelvington while I remained there was known as Blacktown on Blackwater walking the 6 mile to homestead to see what it was like, nothing in our town.\n\nMineral was looking our store and interested in what gold tube appeared to be gold like flashes a man came along young towards building who stopped and asked whom with me. Mr. Yurman was his name an old prospector and we had a very pleasant conversation. How these stories happened to come to life there in Garry family I knew a man on horseback galloping towards me and I found out his name was Mr. Yurman the Traveling Chef turns proved to be a shock and what Dampier would be his team.\n5 shillings food at Mrs. Brown's\nand I had noticed a building being erected\nespecially someone working on it! So I was journeying\nto find out what it was about. Mrs. Brown\ngave me a ride in her buggy. (Maymont)\nI worked at the Butterfield for a month or two on them\nwith Mr. Brown. (He was always having horses\nin his wagon which he had much trouble buying between Buttefield\nand Maymont) and ourselves with the journey on\nknock to own homesheads and build our own log\nshack hoping to get into before the cold weather came.\nOn land we were caught still in own Kenton snow.\nStorm which was several inches deep, luckily we could\ncarry wood to fuel which was in a cliff nearby.\nThe winter was not such a cold one (but cold enough)\nso the mud between logs shrunk.\n\nI perhaps would mention here own living was\nflour for bacon while beans which we had difficulty\ngetting them to soften in cooking and rabbits which\nwe then killed. You, I remember I had gone out\nwith a rifle and shot a prairie chicken which\nwas our first Christmas dinner in Canada, and it\nwas so yummy and warm it lasted us a long time\nthis day.\n5 children, food at hand, house warming,\nand I had noticed a building being erected nearby,\nespecially someone working on roof! But I couldn't\nsee anyone or turn and found out after it was too late.\n\nSo we went to Hotel Boulton for tea and lunch on them\nlight May 19th. Knowles (as we called him) having been\nworking at Hotel Boulton for two months or so, was in them\ntown when he heard much talk about between Saskatchewan\nand Montana) and ourselves took the journey on\nour own homesteads and built our small log\nshack hoping to get into before the cold weather came.\n\nOn that day we were caught still in our tent in snow.\nStorm which was unusual inches deep. Luckily we could\ncarry wood for fuel which was in a blizzard.\n\nThe winter was mild, such a cold one (but cold enough)\nso the small shelter kept us warm.\n\nI remember well a mention here own living was\nflown for bacon while Cream which we had difficulty\ngathering them to assist in cooking and rabbit rabbits\nin a thin rabbit. You, I remember I had gone out\nwith 22 rifle and shot a prairie chicken which\nwas our first Christmas dinner in Canada and it\nwas so yummy and warm we ate our lamb during\nthe day.\nWe knew through the summer and autumn in the first\nwarm days of spring, the river running through the\ntown, and also a couple of weeks more experience again\nwhen the warm rains came, and looking from above,\nthe prairie was one white mass of mushrooming\nall around us, we had a change of feet.\n\nRemembering too, the what we understood was the\nHudson's Bay Boat, bumping and chugging its way up\ntowards Bathurst.\n\nDuring that summer the Brownmores were formed as\nwe knew them today, of which David Brown was the\nyear 1955 celebrating the 50th jubilee year.\n\nLater two Provincial elections were held and the\nfirst minister for Red River was the late Hon.\n\nGeorge Langley\n\nClose this with perhaps only one regret that I\nwould wish to you in these celebrations and\nknow she would have been able to give us a man\nand send accounts of what had happened in the past.\n\nEdward Remot\nWe lived through the winter and summertime the first\nwinter days by spring, the river running through the\ntown, and also a great one until more experience again\nwhen the warm rains came, and looking from shore,\nthe province was one while mass of mushrooming\nall around us, we had a change of heart.\n\nRemembering too, the what we understood was the\nHudson Bay Road, being and chugging its way up\ntowards Bathurst and.\n\nDuring that summer the provinces were formed as\nwe know them today, a million dollar dream in the\nyear 1955 celebrating the 50th jubilee year.\n\nFurther two provincial elections were held and the\nfirst minister for Redding was the late Hon.\n\nGeorge Langley\n\nClose this with perhaps only one regret their Mum\nwould wish us to join in these celebrations as she\nknew she would have been able to give us a man\nand much account of what had happened in the past.\n\nEdward Remot\nThis account of our earlier journeyings was written at the request of my nephew Paul Wallace of Robinhood, Sask., as he had been asked by his school principal to try and obtain any experiences of early settlers to the province.\n\nE. Wilmot\nThis account of our earlier journeys was written at the request of my nephew Paul Wallace of Robinhood, Sask., as he had been asked by his school principal to try and obtain any experiences of early settlers in the province.\n\nE. Wilmot\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_880.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 7695, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1576, 3], [1576, 2995, 4], [2995, 4339, 5], [4339, 5526, 6], [5526, 6626, 7], [6626, 7545, 8], [7545, 8697, 9], [8697, 9402, 10], [9402, 10619, 11], [10619, 11631, 12], [11631, 13147, 13], [13147, 14649, 14], [14649, 15655, 15], [15655, 16437, 16], [16437, 17249, 17], [17249, 17989, 18], [17989, 18913, 19], [18913, 19757, 20], [19757, 20791, 21], [20791, 21832, 22], [21832, 22845, 23], [22845, 23888, 24], [23888, 24996, 25], [24996, 26162, 26], [26162, 27035, 27], [27035, 27923, 28], [27923, 28162, 29], [28162, 28398, 30], [28398, 28553, 31], [28553, 28707, 32]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]