[{"id": "5edef658a4dc0e9ea7bcf201438ef3046be1fa7b", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName Mrs. H. G. Langley\nAddress\nBirthplace Scotland - Peterhead - Aberdeenshire\n\n1. INDUSTRY QUESTIONS\nWhat year did you start housekeeping in Western Canada? May 1902\nWhere did you set up housekeeping? Whitewold, Regina area\nWhere had you been living before that? Scotland\nFor how many people did you prepare meals? 7\nHow far was it to your nearest store? 16 miles\nHow often could a visit be made to the store? About a week\nWhat groceries did you usually buy in those earliest years?\nSugar, tea, flour, rolled oats, coffee, prunes syrup, dried apples. In 1904 we moved to the area we now reside which was 50 miles from Saskatoon or 40 miles from Battleford. There was no railroad then nor northern Saskatoon.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Saskatoon Champion\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? $1.98\nHow much did you use graham flour? about 20 lbs\nWhole wheat flour? about 20 lbs\nWas flour milled locally? No, far away? Regina, that year? 1904\nWhat was the price for a twenty pound bag of rolled oats? $1.35\nWhat other grain products did you use?\nCornmeal? No Whole wheat? Farina?\nOther?\n\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With the shoffer which ground grain for the stock. We ran it two or three times through the mill until it was as fine as we desired. We found that Garnet wheat made the best porridge having less gluten the porridge was less sticky and had a better flavor.\nLangley, H.G.\nSpores. 1902\n\n1. PERIODIC HISTORY\n   What year did you start homesteading in Eastern Canada? May 1903.\n   Where did you set up housekeeping? Whitewater, Ontario.\n   How far was it to your nearest store? About 5 miles.\n   How often could a visit be made to the store? Once or twice a week.\n   What groceries did you usually buy in those earliest years?\n   Sugar, tea, flour, rolled oats, coffee, brown sugar,\n   dried apples. In 1904 we moved to the area we now reside.\n\n2. FLURR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early days?\n   In what quantities did you buy it? 100 lbs.\n   What was the usual price per hundred pounds of white flour? $1.98.\n   How much did you use Graham flour? About 20 lbs.\n   Was flour called locally? No, far away!\n   That was the price for a twenty pound bag. $1.98.\n   What other grain products did you use?\n   Cornmeal? Yes, whole wheat?\n   Oats?\n\nDid you grind your own wheat for porridge? Yes.\nHow did you grind it? With the help of a hand grinding mill.\nWe found that Gurnett wheat made the best flour.\nFlour ground from the homestead grown wheat had a better flavor.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 30 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $1.40\n\nWhat brand of golden corn syrup did you use? Lily Golden Syrup\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? 20 cents\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Milked cows and cows.\n\nButter? Churned. Eggs? From our own flock.\n\nWhat was the price of butter? Sold at 15¢/lb or eggs? 12¢/dozen.\n\nDid you pack eggs for winter? Yes. How? Lime water.\n\nDid you make butter? Yes. Cheese? Yes.\n\nWhat kind of cheese? Cheddar.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Purchased from neighbors.\n\nHow did you get fresh meat? Purchased from neighbors.\n\nHow often did you get fresh meat? Not in summer.\n\nHow did you preserve meat? Pickled and frozen.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? Operated continuously since 1915.\n\nDid you use game? Yes. What kinds? Pheasants, ducks, geese.\n\nFor how long? During the open season.\n\nWhat part did fish play in the family diet? Mainly used in winter when traders would bring wagon loads of frozen fish.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds? Jacks, white, suckers.\n3. SUGGESTIONS\n\nIn what quantity did you buy milk last month? ... 4.0 lbs.\n\nWhat was the price for a can (one pint) of whole milk? ... $1.00 per can.\n\nWhat brand of milk were you using? ... Whole milk.\n\nDid you buy any other milk? ... No.\n\nAt what price? ... $1.00 per can.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ... By purchasing from local farms.\n\nDid you make butter? ... Yes.\n\nDid you purchase butter? ... Yes.\n\nDid you purchase eggs? ... Yes.\n\nDid you purchase cheese? ... Yes.\n\nDid you purchase meat? ... Yes.\n\n5. MEAT AND FISH\n\nWas there a \"meat ring\" in your neighborhood? ... Yes.\n\nWas there a \"fish ring\" in your neighborhood? ... Yes.\n\nDid you use meat? ... Yes.\n\nDid you use fish? ... Yes.\n\nFor how long? ... Since the beginning of the war.\n\nWas the fish fresh, cured, or canned? ... Fresh.\n\nKind(s): ... White fish.\n5. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon at what price? $0.75.\nWhat kind of coffee did you buy? (beans or ground) Ground.\nPrice? $1.50/lb.\nWhat other beverages were used? Hot tea.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $2.50/bushel.\nCould you get potatoes at the store? Yes.\nIf not, where from? Farm.\nWhat year did you first grow your own supply for the winter of 1902?\nPotatoes, Cabbage, Carrots, Onions, Turnips, Beets.\nIn what quantities did you buy white navy beans? 25 cents/bag.\nHow did you buy prunes, (in bulk or by the box)? Bulk.\nWhat weight? 25 cents.\nHow did the grocer handle prunes (by box)?\nWhat was the price of prunes? $3.00/bag.\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nApples, peaches, raisins, currants, peel.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\nPears? No.\nCorn? No.\nBeans? No.\nSaskatoons? No.\nOther foods? No.\nWhat year did you first preserve fruit by canning? 1902.\nWhat year did you first preserve vegetables by canning? 1902.\nWhat year did you first preserve meat by canning? 1902.\nDo you still preserve foods by canning or drying? Yes.\nTo what extent? According to the size of present family of 2.\nDid you make your own vinegar? No.\n6. **Beverages**\n   - What kind of tea did you buy? (Tea or instant) ________\n   - Price? ________\n\n7. **Vegetables and Fruits**\n   - What was the price of potatoes per bushel in your area? ________\n   - Could you get potatoes at the store? ________\n   - If not, where from? ________\n   - What year did you first grow your own supply for the winter of 1940-41? ________\n   - Turnips ________\n   - In what quantities did you buy white navy beans? ________\n   - How did you buy onions? (In bulk or by the box?) ________\n   - How did you buy carrots? ________\n   - What other dried fruits did you use in the earliest days? ________\n   - Apples, pears, plums, prunes, currants, etc. ________\n\n8. **Preserves**\n   - In the early years did you preserve any foods by freezing? ________\n   - Other foods? ________\n   - That year did you start preserving? ________\n   - Do you still preserve foods by canning or drying? ________\n   - To what extent? ________\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember buying it in the store | How can it be bought? - In bulk, 10 lb. sack, can etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | 1903                                          | bulk                                                   |                                   | 25¢                 |\n| Macaroni              | 1906                                          | pkts                                                  |                                   | 75¢                 |\n| Graham flour          | 1902                                          | bulk                                                   |                                   | 35¢ worth at a time |\n| Brown sugar           | 1902                                          | bulk                                                   |                                   | about 6¢ per lb.    |\n| Molasses              | 1902                                          | 1 lb tins                                              |                                   | 10¢ per tin         |\n| Table salt            | 1902                                          |                                                        |                                   | 50 lb dairy salt    |\n| Common salt           | 1902                                          |                                                        |                                   | 45¢                 |\n| Lily white syrup      | 1902                                          |                                                        |                                   |                     |\n| Toilet soap           | 1902                                          | but rarely used                                        |                                   |                     |\n| Baking powder         | 1902                                          |                                                        |                                   | 20¢ per lb.         |\n| Baking soda           | 1902                                          |                                                        |                                   | 10¢ per lb.         |\n| Dried peas            | 1902                                          | bought in 25 lb lots about 8¢ per lb                   |                                   |                     |\n| Dried corn            |                                               |                                                        |                                   |                     |\n| Vinegar               | 1902                                          | by the gallon                                          |                                   |                     |\n| Raisins               |                                               | seeded up to 1914 we seeded our own                    |                                   |                     |\n|                      |                                               | seedless 1914                                          |                                   |                     |\n| Rice                  | 1902                                          |                                                        |                                   |                     |\n| Currants              | 1902                                          |                                                        |                                   |                     |\n| Store jam - kinds?    | Uptons jams in 5 lb wooden jars                |                                                        |                                   |                     |\n| Cheese (Cheddar or store cheese) | Cheddar in bulk |                                                        |                                   |                     |\n| Vanilla               |                                               |                                                        |                                   | 25¢ per 2 oz        |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast cake\n\nDid you make yeast for your own use? ........... Using starter? ...........\n\nUsing hops? Sometimes ........ Salt rising? ........................\n\nDid you buy baking powder? Yes ........ Baking soda? Yes .........\n\nCream of tartar? Yes ........ Did you make your own baking powder?\n\nNo .................................................................\n| Food Item          | Year | Amount | Notes |\n|-------------------|------|--------|-------|\n| Soda bicarbonate  | 1903 | bulk   |       |\n| Bicarb            | 1906 | bulk   |       |\n| Graham flour      | 1902 | bulk   |       |\n| Brown sugar       | 1902 | 1 lb   |       |\n| Lollipops         | 1902 |        |       |\n| Table salt        | 1903 | 50 lb  | dairy salt |\n| Cream salt        | 1903 |        |       |\n| Lily white apron  | 1902 |        | butterly used |\n| Toilet soap       | 1902 |        |       |\n| Baking powder     | 1902 |        |       |\n| Yeast - soda      | 1902 |        |       |\n| Traded peas       | 1902 | bought in 25¢ lots about 8¢ per lb |\n| Dried corn        | 1902 | by the gallon |\n| Vinegar           | 1902 |        |       |\n| Raisins - started up to 1914 we added our own raisins 1914 |\n| Rice              | 1902 |        |       |\n| Currants          | 1902 |        |       |\n\n10. Baking\n\nWhat type of yeast did you use? Regular yeast cake.\n\nDid you make yeast for your own use? Using starter?\n\nUsing honey? Using flour? Salt rising?\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon                            | 1902                                   | 20¢                           | Same                                           |\n| Canned sardines                          | 1902                                   | 5¢                            | Same                                           |\n| Other canned fish that appeared early - give names | None other until about 1908            |                               | Hemery in tomato sauce                         |\n| Apples - fresh                           | 1902                                   | by the barrel from Ontario    | $4.00                                          |\n| dried                                    | 1902                                   |                               |                                                |\n| Lettuce                                  | None                                   |                               |                                                |\n| Tomatoes - fresh                         | None                                   |                               |                                                |\n| canned                                   | 1902                                   |                               |                                                |\n| Bananas                                  | None                                   |                               |                                                |\n| Lemons                                   | 1902                                   |                               |                                                |\n| Oranges                                  | 1902                                   |                               |                                                |\n| Cornflakes                               |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | None until 1908                        |                               |                                                |\n| Pearl tapioca                            | 1902                                   |                               |                                                |\n| Minuto tapioca                           | 1940                                   |                               |                                                |\n| Sago                                     | 1902                                   |                               |                                                |\n| Dates                                    | 1910                                   |                               |                                                |\n| Walnuts                                  | 1910                                   |                               |                                                |\n| Icing sugar                              | 1906                                   |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) Slough, river when slough dried up.\n\nHow far was this water from your home? 3 miles.\n\nHow was it brought to the home? (pail, barrel, tank) Barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWhen money & time was available wells were dug from 1908 on. Now most farmers have soft water systems for laundry purposes using the well water for cooking & drinking. Dug outs are a further source of water supply for stock & supplementing laundry purposes when rain fails.\n### 11. FOODS\n\n| Food Item          | Arrival Date | Approximate Date at the Market | Notes |\n|--------------------|--------------|---------------------------------|-------|\n| Canned salmon      | 1903         | 3.04                            |       |\n| Canned tomatoes    | 1903         | 5.4                             |       |\n\n*Other canned fish not available until about 1908*\n\n**Harvest in Indiana**\n\n- Apples - fresh 1902 by the barrel from Ontario\n- Apples - dried 1903 none\n- Lettuce 1903 none\n- Tomatoes - fresh 1903 none\n- Bananas 1903 none\n- Oranges 1903 none\n\n**Corn Flakes**\n\n- Other prepared breakfast cereals - give more\n\n**Pearl tapioca**\n\n- Pearl tapioca 1903\n- Instant tapioca 1940\n- Sage 1903\n- Dates 1910\n- Nuts 1910\n- Ice cream 1906\n\n### 12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream)\n\n- Always used river when along dried up.\n\nHow far was this water from your house?\n\n- 3 miles\n\nWas there a water supply mentioned any changes which have taken place since you first started homesteading, giving dates where possible.\n\nNow most farmers have a well water supply for cooking, laundry purposes, and for a further source of water supply for drinking. Pug out onto a further source of water supply for stock and poultry purposes when rain fails.\n13. SOAP\n\nDid you buy laundry soap or make your own? Made our own.\n\nIf you made your own, did you use lye? Yes... good soaps?\n\nWhat kinds of laundry soap did the grocer handle? Royal Crown.\n\nSold in pkts. 6 bars for 5 cents & soap coupons.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From bluff farms along the river and on vacant land not homesteaded.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWe bought our first coal in 1914 when we started to use our furnace in our new home, but coal was available when the trains started to run in 1905 but settlers who had access to wood didn't buy coal.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Always used cook stove since 1902.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Trade name of Grand Jewel.\n\nWhat year was it purchased? 1902. Price? $35.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamel and tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware & china.\n\nWhen did you first see enamel ware? 1902.\n\nAluminum? 1910.\n13. COMPS\n\nDid you buy fuel during any of the years 1914-1918?\n\nIf so, what kind of fuel did you buy? (Give dates)\n\n14. FUEL\n\nDid you have any trouble obtaining fuel during these years?\n\nIf so, what kind of fuel did you buy? (Give dates)\n\n15. FOOD\n\nDid you grow any food during these years?\n\nIf so, what kind of food did you grow? (Give dates)\n\nWhen did you first use canned food?\n16. **TRAPPINGS AND CONTAINERS**\n\nMention any changes which you recall in the trappings and containers received with the food you purchased (give dates where possible).\n\nUp until 1930 most of our goods were bought in bulk.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n**Breakfast:** Porridge, eggs sometimes with bacon\n\n**Dinner:** Meat, potatoes, home grown vegetables, pudding or pie, tea\n\n**Supper:** Eggs, fried potatoes, stewed fruit, bread\n\n**Tea:** Sometimes cake or cookies\n\n**Father:** Tom George Elsie Sally Don\n\n**Mother:** Verna\n\n**Family:** 60 54 19 17 15 13 9\n\n**Name:** Stephen\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\n**Turkey, plum pudding, potatoes, turnips, apples**\n\n**Father:** Tom George Elsie Sally Don\n\n**Mother:** Verna\n\n**Named Brother:** Bob\n\n**Wife:** Elsie\n\n**Children:** In white wood\n\n**Age:** 33 28 18\n\nWhich was still in Assiniboia\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo. In 1906-1907 trains were delayed by storms. Coal oil ran short so we were reduced to using fat to give us light. We put melted fat in a saucer & used rag for a wick. Fat became scarce so neighbors shared around. Roads were very bad & trips to town were few & far between.\n17. Give a special day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family or servant who ate at the table.\n\nBreakfast: Porridge & eggs are eaten with jam, pudding or fruit.\n\nTurkey plum pudding potatoes turnip & parsnips\n\nFather: Mother: Son: George: Elsie: Sally: Jane\n\n60 54 19 19 15 13 9\n\n18. Did you have your Christmas dinner in October? If so, why?\n\n19. What did you eat for breakfast? Give the name, date, place, and time.\n\n20. How did you get to school? Give details.\n\nLocally produced foods? Give details.\n\nNo. In 1906-1907 trains were delayed by storms. Coal was short & we went reduced to using a pot to give us light, we just melted fat in a saucepan used rag for a wick while it lasted. Roads were very bad & when to town were few for between\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere is very little difference, other than we have a greater variety of food to choose from home-canning, etc. We now have a quick freeze cold storage plant giving most people an ample supply of fresh meat, whereas kitchens are better equipped or more convenient.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods? (Give as many details and dates as possible).\n\nSince the 1940s we have bought bacon instead of curing our own & buy bread chiefly because our family is reduced from 6 to 3.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nWe moved to this district in 1904. At that time there was no railroad. Our nearest store and P. Office was Great Bend about 20 miles from us. We made the trip weekly. We milked 20 cows at that time. The butter we made we took to the store & traded for groceries. You can imagine how hard it was to deliver butter in good condition in the hot weather driving 20 miles in a wagon. We made the butter into 1 lb. points. Butter was in short supply so the store keeper had no difficulty in disposing it to the many farming homesteaders. The price was 25¢ in summer.\n\nIn Whitehead from 1902 to 1904 we packed the butter in 25-lb wooden pails. This was shipped by the store keeper and we received 15¢ per lb during the summer.\n21. When did you begin to rely on pure and fresh foods and organic forms instead of canned or preserved foods? (Give us any details and dates at possible.)\n\nSince the 1940s we have bought between indeed buying our own a buy bread shilly because our family is reduced from 6 to 3.\n\n22. Please add other details from your early experiences of buying groceries and eating fresh foods in the early pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of preserving, prices, availability of stores, character and other details. Use back of paper if more space is needed.\n\nWe moved to this district in 1904. At that time there was no railroad. Our nearest store and P.O. office was Great Bend about 30 miles from us. We made the trip weekly. We walked 3-0 cows at that time. This better we made we took to the store to trade for groceries. You can imagine how hard it was to deliver butter in good condition in the hot weather driving 30 miles in a wagon. We made the butter into 1 lb. pints. Butter was in short supply but the store keeper had no difficulty in obtaining it so the money backing homesteaders. The price was 25¢ in summer to the winter wood from 1902 to 1904 we packed the butter in 25 lb. wooden kegs. This was shipped by the storekeeper and we received 15¢ per lb during the summer.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1902_103.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6453, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1766, 5], [1766, 2915, 6], [2915, 4190, 7], [4190, 5058, 8], [5058, 6434, 9], [6434, 7384, 10], [7384, 12191, 11], [12191, 13386, 12], [13386, 17633, 13], [17633, 18946, 14], [18946, 20265, 15], [20265, 20646, 16], [20646, 22205, 17], [22205, 23035, 18], [23035, 24747, 19], [24747, 26073, 20], [26073, 26073, 21], [26073, 26073, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]