[{"id": "0ea5d124df43593b15157e846d8688021fd485ea", "text": "Elliott, Almer Oliver\nDumblane.\n\nTo Sask. - August, 1903.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA TYPICAL QUESTIONNAIRE TO THE PERSON\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has asked to answer it has not had exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use the space to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did They Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer business and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nElliott, Almer Oliver\nDumblane.\n\nTo Sask. - August, 1903.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA METHOD OF EXAMINING THIS QUESTIONNAIRE\n\nIt is difficult to express a general questionnaire on pioneer life because some of the questions here will not apply to everyone; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The object of the questionnaire is to get detailed, or describe particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please let us know which ones you are willing to answer:\n\n- Pioneer health conditions\n- Pioneer social life; sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll Questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... ALMER OLIVER ELLIOTT\n2. Your address ... DUNBLANE, SASK.\n3. Date ... APRIL 1st, 1953\n4. Where were you born? (Give name of place and country)\n   TEVIOTDALE, WELLINGTON COUNTY, ONT.\n5. What was your father's name and occupation?\n   THOMAS C. ELLIOTT, WAGON MAKER.\n6. When did you come to Saskatchewan? (Give month and year)\n   26th Aug 1903, N.W.T.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   18 years old\n\n9. What were your reasons for coming West?\n   To try and get something off my own.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through other people.\nElliot, Almer Oliver\nTo Sask., August, 1903.\n\nSASKATCHEWAN ARCHIVE, CRESTWOOD\n\nFORMER SETTLERS: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names in capital letters. If you cannot read the name as you have given it, please say so. It would rather have someone else do the writing at your discretion, this is more acceptable.\n\n1. Your full name: ALMER OLIVER, E.H.A.T.T.\n2. Your address: D.U.A.BLANE, S.A.S.K.\n3. Date: APRIL 14, 1903.\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. What did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n\nTo say and get something off my chest.\n\nThrough other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   My parents came to the west too, our neighbors thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   Just my older sister and a boy friend of mine came with the rest of our family.\n\n13. What means of transportation did you use?\n   Came by C.P.R. to Lumsden where I worked until the spring of 1904 when we drove to the homestead by Owen at Aylesbury.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   We came on the harvest excursion and there were 21 coaches on our train on which there were 3 or 4 cars of Europeans that couldn't speak English. They had their bread piled like wood in the end of these coaches like as if they were animals.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   I worked at Lumsden that fall and winter.\n\n16. Where did you settle or take up land?\n   At Aylesbury, S.S.W. 17-22-26 W2nd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   I lived at Macario in the years 1913-1914 then returned to Aylesbury where I lived until 1945 when we moved to Danblane, but I intend to return to Aylesbury sometime this summer.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   I worked on farms from I was 14 to 18 in Ont and then worked most of the time on farms after coming west.\n21. What did your parents and relatives think of your decision to come to Western Canada?\n\nOnly parents came to the west.\n\n22. Did you travel by yourself or with a party (family), friends or other groups?\n\nGreat many older sisters and a boy friend of mine came along with the rest of our family.\n\n23. What mode of transportation did you use?\n\nWe came by train to Lumsden where I worked until the spring of 1904 when we drove to the homestead by barn at Athabasca.\n\n24. What highlights of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the trail, etc.)\n\nWe came on the Grand Trunk and there were 2 coaches on our train on which they were 3 in 4 cars of Europeans that couldn't speak English they had their bread and tea mixed in the end of these coaches but as if they were animals.\n\n25. How did you first stay when you arrived in Saskatchewan?\n\nI worked at Lumsden that fall and winter.\n\n26. Where did you settle or take up land?\n\nAt Athabasca Lake, N.W.R. 21-21-2 W.2nd.\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived at Athabasca in the years 1903-1914 then returned to Athabasca after I lived until 1945 when we moved to Edmonton, but I intended to return to Athabasca sometime.\n\n28. How did you earn a living before coming to Western Canada? For what years?\n\nI worked on farms from June 1st to July 15th and then worked most of the time on farms after coming west.\n19. How often did you write to relatives or friends in your old home?\n   not very often after our family moved here.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Married Elsa Forsberg of Dunblane in Outlook Sask March 10th 1915.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    Don't know if any one came just on my account.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    My parents two sisters and one brother came the spring of 1904 and settled at Aylesbury.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n    There is lots of things that happened in those early days that people don't know of these day and will never know they were hard times, but good times that we all enjoyed we just had four oxen and two cows the first two years. I worked at Lumsden in harvest 1904 - All summer 1905 was in Lumsden the spring off 1904 when the big flood was on.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n    Had church in my Father's house the first two or three years there was a student in the summer everyone went to church didn't matter what religion they were off. We had an Organ and had very good singing all the Bachelors near always stayed for supper.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Old timers also came to Saskatchewan because of your recommendation. It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nThere is lots of things that happened in those early days that people don't know of today and will never know that we all enjoyed. We just had four years and two more the first two years. I worked at Lumsden in Saskatchewan during off 1904 when the big flood was on.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\nI read Church in my father's house the first two or three years. There was a student in the summer every one went to church. Didn't matter what religion they were off. We had an organ and had very good singing all the Batchelor men always stayed for supper.\n25. When was the first car used in the community?\n   I think about 1908, a Brush one seat truck.\n\n26. If you owned a car before 1914, when did you buy it? What make? Chain drive.\n    No, did not own a car until 1914.\n\n27. Where was your trading center? How far from your home?\n    First traded at Craik 13 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n    Aylesbury started about 1904.\n\n29. How often did you shop in the early days?\n    Once or twice a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n    About 1908.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n    There wasn't much bought from mail order houses, most people had to buy on time so bought near home.\n\n32. When did you first have a telephone and what company provided it?\n    The first telephone at Aylesbury was about 1910, and is still in use.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n    When I first came west I had my homestead and intended to stay. I had a harvest ticket paid $100 to come out, had to work one month than pay $100 to go back would have gone back in two weeks if I could, but when my month was up I didn't want to go back, never been east of Indian Head since.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make? What model? How many miles have you driven?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new town offerings, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy? In this way? Indicate also what fraction of your total purchases were by mail orders and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen I first came west I had my homeland and intended to stay. I had a warrant ticket paid $100 to come out and had to work one month then May 1895 to go back would have gone back in two weeks if I could but work in my mind was not what I didn't want to go back over there early or immediately.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   No.\n\n35. Did many people move away during the 1930's? Did many return?\n   Not many, those that went didn't return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   No not that I know off.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n   My Brother & I had the first small thrashing machine in 1922, the old Shashawan laughed and said they were coffee mills but they came to stay.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Everything was named before we came only the school; it was named Antelope because there were a lot of antelope in the district at that time.\n34. Did any people move away from your district in 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were forced to have or do something in the district mentioned, it happened because:\n\nMy brother & I had the first small thrashing machine in 1922. The old thrashermen laughed and said they were off to mill but they came to stay.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.), try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since then; (5) reason, data and reason for change. Give facts of new name as above in (1), (2), (3).\n\nEverything was named before we came only the school. It was named Antelope because there were a lot of antelope in the district at that time.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nDon't know of any.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy Oldest son Arvid Elliott, Aylesbury Farmer\nOldest Daughter Mrs E. Woolsey Bergame Store\nSecond Mrs J. Nelson Craig Farmer\nSecond Son Clarence Elliott Craig C.H.R.O.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think our highways and way of traveling is the best thing we have.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nG. L. McRea, Aylesbury\nRobert Hill Macarvie\nTom Fox Dunblane\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nA. O. Elliott\nDunblane\nSask.\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\nIf you have children or grandchildren, please give their names where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came west?\n\nI think our highways and way of traveling is the best thing we have.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nG. L. McRea, Aylsham.\nRobert Hill, Cranbrook.\nTom Fox, Round Lake.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nA. E. Elliott\n\nSigned: [signature]\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_686.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5254, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1812, 5], [1812, 3572, 6], [3572, 4767, 7], [4767, 5752, 8], [5752, 7312, 9], [7312, 8776, 10], [8776, 10323, 11], [10323, 11490, 12], [11490, 13160, 13], [13160, 14470, 14], [14470, 15799, 15], [15799, 16935, 16], [16935, 18313, 17], [18313, 19181, 18], [19181, 19269, 19], [19269, 19423, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]