[{"id": "81bb6eac33863293dd733897a6baee938a1ac2b4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1894, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. So don't worry about leaving blank spaces. The questionnaire is intended for persons who lived in Western Canada before 1894, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian pioneers know?\" is still being consulted. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... Janet Munro Warner\n\n2. Your address .............................................. Wyming\n\n3. Date ......................................................... June 23\n\n4. Where were you born? (Give name of place and country) .......................................................... Mr. Glasgow Scotland\n\n5. What was your father's name and occupation? .......................................................... Rancher & farmer in Sask\n\n6. When did you come to Saskatchewan? (Give month and year) .................................................. April 1894\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). .................................................. 12 years\n\n9. What were your reasons for coming West? .......................................................... My grandfather had come in 1884 & my father thought he would like to follow his family!\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). .................................................. Two other people\n1. Your full name .............................................. Janet Munro\n\n2. Your address ................................................... Winnipeg\n\n3. Date ................................................................. 23\n\n4. Where were you born? (Give name of place and country) Glasgow, Scotland\n\n5. What was your father's name and occupation? Robert Munro, farmer in Saskatchewan\n\n6. When did you come to Saskatchewan? (Give month and year) April 1894\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" instead.)\n\n9. What were your reasons for coming West? (My grandfather had come in 1884 + my father + my mother + two family members)\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Two other people\n11. What did your friends and relatives think of your decision to come to Western Canada? Good\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Family\n\n13. What means of transportation did you use? By boat & rail\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? Arrived at Moose Mountain & came to grandfather for first month\n\n16. Where did you settle or take up land? In Moose Mountain\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Always in Sask. till my husband Mr. J. D. Warner died off & on some work\n\n18. How did you earn a living before coming to Western Canada? How after you came? My dad farmed but previous was on railway\n11. What did your grandparents think of your decision to come to the West?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? By land or rail.\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other experiences etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? Our arrival at the\n\n16. Where did you settle or take up land in Moose Jaw?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nmy dad farmed but promised me my own railway\n19. How often did you write to relatives or friends in your old home?\n   about once a month\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Anola J A Warner - Kennedy\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    yes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    I loved feeding horses back & going for the mail on Friday\n    I may add here that Hildreth P.O. was closed in\n    1937 & a rural mail, the P.O. is now Kennedy\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    no - just to church - wagon, 3 miles\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1915 Ford\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\nThe railroad came to Kennedy in 1907 or 8.\nThe town Kennedy was named after the late\nFinlay Kennedy who drove the mail from\nWhitewood to Retford before the railroad line\nof Reston - Waskes was built.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAs soon as we came to Canada we\nbought from Edgars then only in Toronto\nit took us long to get an order so\nour nearest P.O. at that time was 20\nmiles.\n\n32. When did you first have a telephone and what company provided it? 1912\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We always had the idea\n   we would return to Scotland but\n   didn't do it because our mother made\n   several visits back.\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\nThe railroad came into Kennebec in 1909 or '10.\n\nThe town Kennebec was named after the late Mr. Kennebec who drove the mail from the Grand Trunk (unintelligible) before the Grand Trunk (unintelligible) was built.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order.\n\n32. When did you first have a telephone and what company provided it? 1912\n\n33. When you came to Saskatchewan the first time was it with the idea of settling permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe always had the idea we would return to Scotland but several events back...\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany people came and went but most of the pioneers stayed. I am really the only one left who came here at an early date.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was postmaster for about 40 years also see Mrs. M. Hazelwood for 25 yrs from 1914 till 1939\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMr. Gillis had first car 1914\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nKennedy named after late (Dunlay Kennedy)\n34. Did any people move away from your district prior to 1914? If so, explain why.\n\nMany people came when they had money.\n\n35. Did many people move away during the 1930s?\n\nYes\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was postmaster of [place name] from 1914 to 1936.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district or within its limits, give details wherever possible.\n\nMr. Yello had first car in town.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, Railway Stations, creeks, hills, etc.) Try to give: (1) name; (2) origin and meaning of person originating place-name; (3) origin and meaning of the name; (4) date of its adoption; (5) date and reason for change.\n\n[Handwritten note]\n\nKennedy married Kennedy\n\nLottery (signature)\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\ngrandchildren Saskatoon\nPeggy - Palsy & Lynn Warner\ndaughter in Ontario (Grae) Mrs J A\nFerguson Yalt - Gwen Mrs G E\nStevenson Lovely\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThese papers were sent to me by my step-husband (Raeburn Warner Kennedy - my memory is failing I am not too well now but hope what I've written is true)\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\ncan read it? _______________________\nwill be a help _______________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, albums of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Ottawa, or the Archives Office at the University of Saskatchewan?\n\nIndicate your preference if any:\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nGrandchildren Sarah Atwood\n\nPeggy - Baby & Lynn & Eleanor\nDaughter-in-Law Marie (Grand) Priscilla\nGrayson Wall - Gwen\nGreytown Lovely\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could furnish this information.\n\nIf someone else has filled in this questionnaire for you, please have this person sign it.\n\nWill be a help\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_567.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1975, 5], [1975, 3775, 6], [3775, 5465, 7], [5465, 6468, 8], [6468, 7354, 9], [7354, 8099, 10], [8099, 9055, 11], [9055, 9575, 12], [9575, 11074, 13], [11074, 12346, 14], [12346, 13610, 15], [13610, 14573, 16], [14573, 15969, 17], [15969, 17087, 18], [17087, 17087, 19], [17087, 17239, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]