[{"id": "9acb65cb8715a7fb844be35df7321c58abc3dfa1", "text": "PIONEER Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences and others may prove impossible for you to answer, so don't worry about missing blank spaces. Use more sheets of paper if there is not enough space between the questions. Don't leave any questions unanswered, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: GEORGE G. SEMENOFF\n\n2. Your address: 422 AVENUE G., SOUTH SASKATOON, SASK.\n\n3. Date: JUNE 5, 1954\n\n4. Where were you born? (Give name of place and country): Caucasus, Russia\n\n5. What was your father's name and occupation?: George G. Semenoff - farmer\n\n6. When did you come to Saskatchewan? (Give month and Year): On May 11, 1912, I came to Saskatoon, Sask.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): I was 24 years old.\n\n9. What were your reasons for coming West?: I came to Canada for religious reasons—against militarism.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): My father's brother wrote to us prior to our departure to Canada. He said that this was a free country and there was freedom for religious ideas.\n1. Your full name: GEORGE G. SEMENOFF\n\n2. Your address: 422 Avenue G., South, Saskatoon, Sask.\n\n3. Date: April 5, 1954\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, stating dates whenever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" if you were in my teens, etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n\nReasons against militarism:\n\nMy father wrote to Canada. He said that this was a free country and there was freedom for religious ideas.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy friends said that it is unwise to go to Canada—“you will soon return.”\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nThere were a group 176 people, myself.\n\n13. What means of transportation did you use?\nFrom my Russian home I travelled several days by train to Lepelaja (spelling not sure). Then we, a group of 176, left by ship (Lentana) for London. We had to spend six days in London because we missed the ship Titanic. On May 7, 1912, we arrived in Halifax. Then we took a train to Toronto.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nWhen we arrived in England, on our way to Canada, the ship agent told us that he was sorry that we missed the Titanic ship by two days. Therefore we had to wait for five days for the next ship. However, in about two days after our arrival in London we heard of the disaster of the sinking of the Titanic. We were glad that we did not arrive in London two days earlier because we would have sunk with the ship.\n\nOn our way to Halifax two fellow members of the group died—one was buried at sea and one at Halifax.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe came to Yorkton, Sask.\n\n16. Where did you settle or take up land?\nMy family took some land near Canada.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nIn 1917 I went to the Pincher Creek area of Alberta for one year (rented a farm).\nIn 1918 I took a farm in Arlee, Sask. I farmed till 1944—retired.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\nI farmed in Russia and later in Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friends said \"You will never return.\"\n\n12. Did you travel by yourself or with a party (real), friends or other group?\n\nMyself\n\n13. What means of transportation did you use?\n\nBy train to Regina (going west). Then we went by train to Edmonton.\n\n14. What animals of the journey, went do you remember? (People you met on the way, meetings etc.)\n\nZoo\n\n15. Where did you first stay when you arrived in Saskatoon?\n\nThe Come to Poveshull\n\n16. Where did you settle or take up land?\n\nCanada\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nArea of Albert for one year (noted at farm)\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI farmed in Russia and later in Canada.\n19. How often did you write to relatives or friends in your old home?\n   I wrote every month to my friends in Russia and received many replies.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I married in Russia in 1908. My wife's name was Anna Theresa.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No—my family came shortly after I came to Canada.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   I had a great desire to raise registered wheat, cattle and horses.\n   In 1925 I bought a star car for $1450. The following year I had a crop failure. In 1927 the frost spoiled my wheat. To conserve money I took out the motor from the car and hitched the car up to two horses. This \"Bennet Wagon\" was used both during winter and summer. In winter I put the body classic on sleds. Therefore I literally drove my car winter and summer without a motor and gas.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   I traveled to auctions, funerals, prayer meetings, sold cattle and horses. The frequency of these travels were not often. The distance covered on some of these trips was 25 miles. Travel at the beginning was by horse and buggy.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience or pioneer days that stands out in your memory which you would like to recount?\n\nIn 1925 I bought a car for $450. The following year I paid a trip back to England. In 1927 the snow was very deep and I had to drive the car through the snow. This was very difficult and I had to drive my car through the snow. Therefore I tried to drive my car through the snow and gas.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI traveled to various places and have traveled frequently by train. Traveling by train was very convenient.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   (Asquith) East. 25 miles from home.\n   Purdie 22 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In 1927 a railroad came to Arlee.\n   Therefore I did my shopping in Arlee, 22 miles from home.\n\n29. How often did you shop in the early days?\n   On harvest time we went every day, at times. Later I went once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   1918 and on\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   1918 - we bought beds, clothes, etc., except food.\n\n32. When did you first have a telephone and what company provided it?\n   1920 Bell Company Purdie\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I came to Saskatchewan with the idea of staying permanently.\n25. When was the first car used in the community?\n26. If you owned a car before 1914, when did you buy it? What make?\n27. Where was your trading contact? How far from your home?\n28. Did you continue to trade there? (Indicate any changes due to new towns, supplies, better means of travel, etc.)\n29. How often did you shop in the early days?\n30. What (if ever) did people in your district first start going to town regularly on Saturdays?\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n32. When did you first have a telephone and what company provided it?\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nTherefore I sold my shopping centre in Canada.\n\n1918 - The Government (notice, etc.)\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nMany people moved away from our district during the 1930's. Many of them could not pay their mortgages and were evicted from their lands. People left to various places in Canada—Toronto, etc.\n\nMany of the settlers returned later.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was secretary of the school board in the Arlee district for twenty years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nArlee, Saskatchewan was named after a farmer Mr. Arlee.\n\nEagle Creek was named because of the prominence of eagles by that creek.\n35. Did any of your people move away during the 1920's? If so, did they move away from your district?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) origin and occupation of person suggesting place-name; (2) original spelling of the name; (3) date of its adoption; (4) any changes in name since then; (5) the first name was given; date and reason for change. Give dates of new name as above in (1), (2), (3).\n\nAfter a time Mr. Clark\n\nEagle Creek was named because of the prominence of eagles by that creek\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have quite a lot of antique material. However, I am having a one month vacation today and have no time to describe the collection.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWilliam G. Semenoff - Arlee, Sask. - hardware business\nNick G. Semenoff - Lumsden, Sask. - farmer + field work\nMary G. Kolodoff - Calgary, Alberta - housewife + working\nMrs. Nellie J. Bowater - Saskatoon, Sask. - works in a store\nJohn G. Semenoff - Arlee, Sask. - farmer\nGeorge G. Semenoff - Detroit, Michigan - mechanic\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAdvances in the agricultural field seems to be the most significant change since I first came West. Now there are efficient machines for working the land. The quality of wheat has been improved.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nKozya J. Tarasoff,\n434 Avenue J South,\nSaskatoon, Sask.\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old papers, old photographs, old postcards, written productions and remini-\n   cences? (Indicate)\n\n   I have quite a lot of antique material. I haven't been able to sell and have\n   no time to describe the collection.\n\nWould you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n       Library, Regina, or to the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\n    live and occupations:\n\n    William G. Semenoff - Arlee, Montana\n    Neil G. Semenoff - Calgary, Alberta\n    Mr. Nelles - Edmonton, Alberta\n    John G. Semenoff - Arlee, Montana\n\n41. What do you think are the most important changes in your community since you\n    first came West?\n\n    Advances in the agricultural field seem to be the most significant.\n    Change seems to have come about. New\n    There are efficiency machines for working\n    the land. The quality of what has been\n    improved.\n\nPlease give the names and addresses of other Pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\n__________________________\n__________________________\n__________________________\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have quite a lot of \"antique material.\" However, I am leaving on a one month vacation today and have no time to describe the collection.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ....................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWilliam G. Semenoff - Arlee, Sask. - Hardware business\nNick G. Semenoff - Sunningdale, Sask. - Farmer - held pool-room\nMary G. Kholoff - Calgary, Alberta - Housewife - works in city\nMrs. Nellie G. Bowditch - Saskatoon, Sask. - Works in a store\nJohn G. Semenoff - Arlee, Sask. - Farmer\nGeorge G. Semenoff - Detroit, Michigan, U.S.A. - Mechanic\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAdvances in the agricultural field seems to be the most significant change since I first came West. Now there are efficient machines for working the land. The quality of wheat has been improved.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nKozma J. Tarasoff,\n434 Avenue J South,\nSaskatoon, Sask.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, albums books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Please list)\n\nI have quite a lot going on.\n\n40. Would you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n41. If you have children or grandchildren, please give their names, where they live and occupations:\n\nWilliam G. Semenoff - Archer, Saskatchewan\nMary G. Semenoff - Archer, Saskatchewan\nGeorge G. Semenoff - Archer, Saskatchewan\n\n42. What do you think are the most important changes in your community since you first came West?\n\nField seems to be the most significant change among I first came West. Your there are efficient machines for working the land. The quality of wheat has been improved.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nKozyrevsky, T. (signature)\n434 Avenue J South, Saskatoon, Saskatchewan\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1210.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5491, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1643, 5], [1643, 1643, 6], [1643, 3029, 7], [3029, 3917, 8], [3917, 5749, 9], [5749, 6575, 10], [6575, 8128, 11], [8128, 9198, 12], [9198, 10575, 13], [10575, 11639, 14], [11639, 13039, 15], [13039, 13962, 16], [13962, 15696, 17], [15696, 17207, 18], [17207, 18978, 19], [18978, 20339, 20], [20339, 20339, 21], [20339, 20490, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]