[{"id": "d496992527be3ee62c3ab748ebb97875c812ec39", "text": "It is difficult to prepare a general questionnaire on all aspects of life. In fact, some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nIf there is a particular area which you feel should be included, or if there are particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1900 and 1945 and may be interested in your life story personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or supply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days,\" that has already answered this and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date, some of these are listed below. Please mark the ones you would be willing to answer.\n\n| All questionnaires | |\n|-------------------|---|\n| Pioneer history | |\n| Pioneer farming | |\n| Pioneer education and churchwork | |\n\nTransmittal of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nFerguson, Daniel\nSask., Sask.\n\nPIONEER EXPERIENCES: A GENERAL INTERVIEW\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: DANGLE, FERGUSON.\n2. Your address: B.E.A.T.T.Y., SASK.\n3. Date: JUNE 2, 1952.\n4. Where were you born? (Give name of place and country)\n   PRICEVILLE, ONTARIO, CANADA.\n5. What was your father's name and occupation?\n   REV. DANIEL FERGUSON — farmer-minister — Mennonite Church.\n6. When did you come to Saskatchewan? (Give month and year)\n   APRIL 1902.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   Twenty acres.\n   To homestead.\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    Through advertisements and general talk — western farms in the air.\n1. Your full name: DANIEL FERGUSON\n\n2. Your address: BEATY, SASK.\n\n3. Date: JUNE 2, 1942\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n\n9. What were your reasons for coming here?\n\nTwenty acres\n\nIt's homestead\n\n10. How did you learn about the farm? (Through other people? Reading about it?)\n\nThrough advertisement and general talk - whether from an air.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel yourself or with a party (family, friends or other group)? Yes\n\n13. What means of transportation did you use? Railways - C.P. & Regina (spent four summers as host help on family's farm near Brown, 10 miles north of Regina)\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures or other excitement etc.)\n\nWill all seeing the open prairie -\n\nJourney was merry with singing.\n\nOur group entertained with my violin and ballads of old Ontario.\n\n15. Where did you first stay when you arrived in Saskatchewan? Worked for Alec Brown on farm.\n\n16. Where did you settle or take up land? Nearby present village of Appleby (1902)\n\n17. Mention any other places where you have lived since coming to Saskatchewan. West home (Ont.) in July 9, 1902 - Came back in spring of '03\n\nWorked on railway (repair crew) between Regina and Prince Albert for summer - back to homestead in June 9, 1903.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmer for Mother and brothers in Ontario\n\nFarmer - worked on Railway - Carpentry in homestead district while farming on homestead.\n\nIn 1916 - Star in Quailier (Boarding house)\n\nBack to farming again\n11. What did your relatives and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Yes, I traveled with my family.\n\n13. What mode of transportation did you use? We used the railway.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at Alec Brown's farm.\n\n16. When did you settle or take up land? We settled in 1902.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We lived in Prince Albert.\n\n18. How did you earn a living before coming to Western Canada? How about you now? I farmed for my father and worked in Ontario. Now I work as a carpenter in Prince Albert.\n\n19. In 1916 - stay in Quilchena (Poveshell & Boarding house) Back to farming again.\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to William Anderson, Aug 22, 1906\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nMy brother Archie Ferguson came back with me in 1903\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nARCHIE FERGUSON - in 1903 -\n\nHomesteaded at Cypress Lake.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nNeighbourhood of people - Community gatherings - all young people settled in farms about - homes were opened up turn for dance & parties - Mat music was played - some accordions - and mouth organs.\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How far? By what means of travel?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nOccasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to William Anderson, Aug 12, 1906\n\n21. Did anyone else come to Dakota Territory because of your recommendation? If so, place to settle.\n\nMy brother Archie Ferguson came back with me in 1903\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell what they did and where they settled.\n\nARCHIE FERGUSON - in 1903 -\n\nHomesteaded at Cyril, North Dakota\n\n23. Is there any particular experiences or pioneer days that stand out in your memory which you like to recount?\n\nNeighborhood of people - Community gatherings - all young people settled in farms about - homes were opened up time for dance & parties - Most music was violin - some accordion and mouth organ.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the town? 1905\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling nearest? How far from your house?\n\n28. Did you continue to travel there? (Indicate any changes due to war, labor unrest, etc.)\n\n29. How often did you shop in the early days?\n\n30. What (if any) did people do to your flatboat first start going to town regularly?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also what, if any, of your usual purchases were by mail order and any changes in the proportion of purchases made by mail order since the war period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. 1922\n\n35. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When all you make this decision?\n\nCome with the getaway!\n24. What was the first car used in the family? [Blank]\n25. If you owned a car before 1914, when did you buy it? [Blank]\n26. How many cars have you owned? [Blank]\n27. Have you ever traveled outside the state? [Blank]\n28. Did you notice any changes due to war time restrictions? [Blank]\n29. How often did you shop in the early days? [Blank]\n30. What (if any) did people in your district first start doing to turn regulars into customers? [Blank]\n31. When did you first begin to buy through the mail order catalogs? [Blank]\n32. What kind of articles did you buy in this way? [Blank]\n33. Did you make any purchases by mail order since the war? [Blank]\n\nP.S. Write with clean handwriting.\n\n1922\n5.\n\n34. Did any people move away from your district prior to 1944? What reasons did they have for moving?\n\nNo.\n\nPut in name and other, were chased out by drought.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWe were at Butte by then (1922) and people from the prairie were moving in to their district then.\n\n36. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving year, place, office, etc.\n\n37. If you or any of your family or friends were \"in\" to have or do something in the district mentioned here, listing dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nHow did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; dates and reason for change. Give facts of new name as above in (1), (2), (3).\n\nAliefedly school (Pleasantsville - Gaelic) - 1907\n5.\n\n34. Did any people move away from your district prior to 1924? What reasons did?\n\nNo.\n\nPut in name and other, were chosen all by drought.\n\n35. Did many people move away during the 1930s? Did they return?\n\nWe were at Butte by then (1922) - and people from the prairie were moving in to their district then.\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention it here; giving dates wherever possible.\n\n37. If you or any of your family or friends were pioneers to have or do assist in the district until now, it has given dues names? Possible? (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, Villages, railway stations, creek hills, etc.) Try to give: (1) name and date of origin of place; (2) meaning of name; (3) date and reason for change. Give dates of new name as above In (1), (2), (3).\n\nalbanyfield school (Pleasantville - Vallee) - 1907\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library (herein, or the archives Office at the University in Saskatoon)?\n\n(Initiate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Jake Burt, Beatty, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have any photographs or do you know where they are located? (Diaries, old letters, old posters and programs, written resolutions and resolutions, pamphlets, old photographs, written resolutions and resolutions, newspapers, etc.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Please state your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the name and address of other persons who could answer this questionnaire.\n\nMrs. Jake Brown, Beatty, Sask.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_652.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4017, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1550, 5], [1550, 1550, 6], [1550, 2775, 7], [2775, 3493, 8], [3493, 4860, 9], [4860, 5862, 10], [5862, 6899, 11], [6899, 7944, 12], [7944, 8929, 13], [8929, 9619, 14], [9619, 10790, 15], [10790, 11827, 16], [11827, 12855, 17], [12855, 13705, 18], [13705, 13860, 19], [13860, 14014, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]