[{"id": "121a500f066135b7b534ad8506aa80ea3e0a992c", "text": "Please print name and address in capital letters.\n\nYour full name: THOMAS WILLIAM BENNETT\n\nPresent address: Willow Bunch\n\nPioneer address:\n\nYear you came to Saskatchewan: 1909\n\nCountry or place from which you came: India, England\n\nNote to Persons Answering the Pioneer Housing Questionnaire\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house.\n- to include any early dwellings coming under this general description, even though the family may have lived in it for many years.\n\nPART II: The permanent house.\n- to include the better house built after living for a time in quarters mentioned above, a permanent home built upon arrival, or the \"homestead shack\" which may have been added to and continued as a permanent house.\n\nPART III: General.\n- including aspects applying to either Part I or Part II of the questionnaire.\n\nSome persons will therefore answer only parts two and three, and others will be able to answer all three parts.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER HOUSING\n\n(Drawing by McGregor House)\n\nPlease write name and address in capital letters.\n\nYour full name: THOMAS WILLIAM BENNETT\nPresent address: Willow Bunch\nPioneer address:\nYear you came to Saskatchewan: 1928\nCountry or place from which you came: India, England\n\nNote to Persons Answering the Pioneer Housing Questionnaire:\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house.\n- To include any early dwellings existing under this general description, even though the family may have lived in it for many years.\n\nPART II: The permanent house.\n- To include the better house built after living for a short time in the shack mentioned above; a permanent house built upon arrival, or the \"permanent shack\" which may have been added to and continued as a permanent house.\n\nPART III: General.\n- Including aspects applying to either Part I or Part II of the questionnaire.\n\nPLEASE COMPLETE THIS QUESTIONNAIRE ON ONE PAGE ONLY, PARTS TWO AND THREE, IF NEEDED.\n\nMAIL TO: Saskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE No. 9\nPART I: THE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1909\n\n2. During what years did you live in it? Still living in it.\n\n   How long did you think you might live in it when you built it?\n\n3. What was the location? (township, range, and post office).\n   \n4. Is it still in existence? Yes\n\n5. What material was it made of? Lumber, and in early years sodded. This was made in 1909.\n\n6. How large was it, and how many rooms did it contain? 40 x 30.\n\n   How were they arranged?\n\n7. Who built it? My father W. Edler.\n\n8. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.) Roof Brand.\n\n9. What kind of floors did you have? Lumber.\n\n   What covering did you have on the floor (rushes, linoleum etc.)\n\n10. What expenses did you have connected with the building of the house? This and some following questions answered in accompanying letter.\n\n11. Describe any special problems or unusual happenings connected with its building. Foundation was made 4 ft. so outside measure as extra foundation had to be made when frame work was completed, a storm blew it down which took the rear of sodding it on completion.\n\n12. How many people lived in the house when it was first built? 8 later?\n\n13. What means of heating did you have? Stoves, burning wood and soft coal - we have 250 acres of Poplars.\n\n14. What means of lighting did you use? Coal oil lamps.\n\n15. Was there a cellar? Yes\n\n   Where was the door to the cellar? (in kitchen floor, other place?) In Kitchen floor\nPART I: THE TEMPORARY SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1909\n2. During what years did you live in it? 1909-1917\n3. How long did you think you might live in it when you built it?\n4. What was the location? (township, range, and post office)\n5. What material was it made of? (wood, stone, brick, etc.)\n6. Is it still in existence? Yes\n7. Who built it? My father\n8. How were the walls finished inside? (e.g., rough boards, plaster, painted, etc.)\n9. What kind of floors did you have? Lumber\n10. What expenses did you have connected with the building of the house?\n\n11. Describe any special problems or unusual happenings connected with its building.\n12. How many people lived in the house when it was first built?\n13. What means of heating did you have?\n14. What means of lighting did you use?\n15. Was there a cellar? Yes\n\nWas there a door to the cellar? (in kitchen floor, other places)\nDear Jim,\n\nIn regard to an interesting event in another\n\nhalf of our lives, please remember Mr. Roy Lord.\n\nHe had been afraid about my father & was very\n\nshy when we met. He was interested, and so did\n\nmyself. We met at Leover Park. His call kept me in\n\nfor less time than expected.\n\nThe date was Dec. 31, 1959 - at 5:30 PM a\n\nstorm started to blow off and by 9 PM it was a full\n\nblowout. By a miracle, a simple leaf blew loose\n\nand I met him. He looked around, then surrounded me\n\nwith his arms and began to whisper words, so as he\n\nput out the fires - as we were afraid of cold and he\n\nwent to the house we were afraid to go back into. We\n\nwere so hot we were unable to keep warm. He - we -\n\nwere both very hot and very cold, so we decided to try and\n\ndecide to a new place. Going on the ship, I heard\n\noff and on Mr. Lord called softly. We were all\n\nvery cold and very hot before we fell to our deathbeds.\nDear Jim,\n\nIt was an exciting event in our lives.\n\nIt had been arranged at my father's place that we were to leave for a hotel in early December.\n\nOn the day we were scheduled to arrive, a hurricane hit the area.\n\nPreparing for the hurricane involved strengthening the hotel and ensuring safety measures were in place.\n\nWe didn't get very well, the storm was quite overwhelming.\n\nWith strong winds, we spent the night in our room watching the storm rage outside.\n\nThe next day, after the storm passed, we continued our journey.\n\nThis experience taught us the importance of preparation and resilience in the face of natural disasters.\n\nWishing you all the best in your future adventures.\n\nSincerely,\n\nWillie Boyd\nI dared not tell them the truth which was I did not know alone we were so excited we should not be much longer, and at that time dad looked over the side of the wagon box and was dismayed to see just how bad conditions were he passed some remark well I could not catch and then I called out \"we are alright we are HOME\" the horses had turned and brought us safely home, and I definitely did not know they had turned.\n\nThis was the work of the old time Brave\nI dared not tell them the truth which was I did not know what we were or except we should not be much longer, and that time did looked over the side of the wagon box and was damaged to see just how bad condition were the passed some road. Well I could not catch and then I called out \"We are all right we are HOME.\" The horses had heard and brought us safely home, and I definitely did not know they had turned.\n\nThis was the word of the old time Brave.\n10. The house etc was dark etc. He bought the house a year ago and all equipment and did not decide whether or not.\n\n43. Windows were 2'6\" x 2'6\" each in depth.\n\n44. A child is 2'6\" x 2'6\".\n\nMy father was manager of a large company in London so I was well traveled. We lived in a large building near the center of town and had large rooms. Building was built at least 50 years ago and was very nice. Please advise if you need any more information. I would be happy to provide any further details.\n\nPossibly two rooms available. Please let me know if needed.\n10. The house etc was done over. It brought the owner over $43 and all equipment and did not decline expenses until 26¢.\n\n49. My father was manager for a large company in London, so I would work well handled there and still own a house. Building costs would be low, and I could keep money.\n\nIf I knew Leif, any access would be easy.\n\nI would like to own something. If I could find it, I would try.\nPART II: THE PERMANENT HOME.\n\nNote: For some persons, this section may include a description of more than one house. If so, you may include a list of houses, showing changes and differences from one house to another. If you have moved since your first permanent house was built, you may describe separately these (or other) houses. If you have lived in several houses, and especially if they have been owned by different people, you may wish to answer questions about each house separately.\n\n16. Give the location (township, range, and post office), of the house (or houses) described in this part of the questionnaire, and the years you lived there. If you lived in other houses besides those you listed here, give their location, and the years you lived in each.\n\n17. Who planned and built the house?\n\nWhat previous experience did this person (or persons) have in building? Absolutely none.\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built?\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed.)\n\n20. Does it still exist?\n\n21. What material was it made of?\n\n22. How large was it? 40 x 30\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired.)\n\nWas there a back shed attached? No\n\nDid you have a front porch? No\n\nWas it glassed in?\n\n24. What kind of foundation was under the house (wooden slats, stone, concrete)?\n\n25. What kind of basement did you have (full size cement basement, dirt cellar, etc.)? No\n\nWhere was the door to the basement (kitchen, outside, other room)? No\n2.\n\nPage II: THE PERMANENT HOME.\n\nNote: For some persons, this section may include a description of more than one house. If so, you may include a separate entry for each, including changes and differences from one house to another. If such, you may describe your first permanent house on this form. For others, you may choose an example of your houses (or other questionnaire forms will be needed). If you have both owned and rented houses, and especially if they are only about the same age or size, you may wish to answer questions in which you lived, and easily mention those you have not answered in question 16.\n\nIn all cases, be sure to make a plain, although not necessarily neat, drawing of the house described in question 16.\n\n16. Give the location (room, town, range, and post office), of the house, or rent (described in this part of the questionnaire, and the year it was built (or occupied). If you lived in other houses before these, you should describe them in other parts of this questionnaire, and the year you moved into each.\n\n17. Who planned and built the house?\n\n18. Where did he get his plans as to the kind of house to build?\n\n19. What year was it built?\n\n20. How long did it take to build it? (If possible, give approximate days, weeks, months, years.)\n\n21. Does it still exist?\n\n22. What material was it made of?\n\n23. How large was it?\n\n24. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired.)\n\n25. Was there a tack shed attached?\n\n26. Did you have a front porch?\n\n27. Was there a screened or an open veranda?\n\n28. What kind of foundation was under the house (wooden, brick, stone, concrete)?\n\n29. What kind of a basement did you have (full size cement basement, dirt cellar, etc.)?\n\n30. Where was the door to the basement (kitchen, outside, other room)?\n26. What insulation was used?\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\nDescribe any ornamentation on the exterior of the house (for example, gingerbread, truly carved cornices etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished - (plaster, wood panel, wall-paper etc.)? / /\nHow were they finished (plaster, beamed, moulded plaster)? /\nHow were they finished (plaster, beamed, moulded plaster)? /\nWhat kind of wood were the floors made of?\nWhat width board?\nWere nails or dovetail used?\nDid you have any parquet (patterened inlay) flooring?\nDescribe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\nDid you have a bay window?\nIn what room?\nDid you have any colored or stained glass windows?\nDescribe.\nDid you have shutters inside or outside?\nHow were window frames finished inside (painted, varnished)?\noutside (painted to contrast with house color)?\nDescribe your front door (panelling, door, window in door, or around or above).\nWhat kind of hardware was used on the door - (iron, brass etc.)?\nDid you have a door knocker?\nDescribe interior doors - if panelled, type of hardware, or any other special features about them.\nDid you have any double doors, French doors or swinging doors?\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\nIf you had an upstairs, was the stairway open or closed?\nIf open, what type of baluster and rail was used, and what kind of wood?\n26. What insulation was used?\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n\nDescribe any ornamentation on the exterior of the house (for example, gingerbread trim, curved cornices, etc.)\n\nWhat color was the house, and what color trim was used?\n\nHow were interior walls finished - (plaster, wood panel, wall-\n\npaper etc.)?\n\nHow were the ceilings finished? (plaster, beamed, moulded plaster?)\n\nWhat kind of wood were the floors made of?\n\nWhat width board?\n\nWere nails or screws used?\n\nDid you have any parquet (painted or inlay) flooring?\n\nDescribe the window as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window?\n\nIn what room?\n\nDid you have any colored or stained glass windows?\n\nDescribe.\n\nDid you have shutters inside or outside?\n\nHow were window frames finished inside (painted, varnished)?\n\noutside (painted to contrast with house color)?\n\nDescribe your front door (paned, door, window in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.)?\n\nDescribe.\n\nDid you have a door knocker?\n\nDescribe interior doors - if paneled, type of hardware, or any other special features about them.\n\nDid you have any double doors, French doors or swinging doors?\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\nIf you had an upstairs, was the stairway open or closed?\n\nIf open, what type of baluster and rail was used, and what kind of wood?\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, please reply to those mentioned in either Part I or Part II, not separately. Use extra sheets if necessary.\n\n46. What did you do to winterize your house (windows, doors, banking (with what?), other means)?\n\n47. What additions were built to the house after its original construction? For what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, stock animals or others)\n\n49. As nearly as you can remember, tell what furniture you had in each room in the house (rugs, sofas, chairs, curtains, etc.). If you lived at first in the old house, and later in a larger house, please tell what furniture you had in each place.\n\nHow much of this furniture did you bring with you when you came here? How much was it made or purchased?\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your home, which you would be willing to loan or present to the Archives? If requested to do so, would you be willing to co-operate in having pictures taken of any unusual or rare piece of furniture which you might possess?\n\nCertainly.\nPART III: GENERAL\n\nNote: As you may have more than one answer for questions in this section, please list them all.\n\n46. What did you do to maintain your house? (e.g., extra sheets, storms, windows, doors, banking, other reasons?)\n\n47. What additions were built to the house after its original construction?\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats, other pets, baby animals)\n\n49. As nearly as you can remember, tell what furniture you had in each room in the house, (rugs, chairs, tables, etc.) If you lived in a smaller or old house, and later in a larger house, please list the furniture you had in each place.\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or would you have seen strange in the modern home.\n\nHow did you get furniture during the first few years (make it, from Eaton's etc.)\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your home, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare piece of furniture which you might possess?\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?  \n   A neighbor had a spinning wheel.\n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio?  \n   What kind was it?  \n   Where did you get it?\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?)?  \n   Storage space\n\nWhat windows or means of ventilation were provided in the attic?  \n   Two small windows\n\n55. Did you have an indoor toilet?  \n   No, I tell away later\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?  \n   No\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (for example, fireguards, lightning rods, fire insurance).  \n   Lightning rods, Fire Insurance and Plowed fire guard.\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.  \n   Answered in accompanying letter\n51. Did you or any of your neighbors have loans for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture, etc.\n\n53. When did you get your first radio?\n   What kind was it?\n   Where did you get it?\n\n54. What use was made of the attic (as a sleeping room, for storage space, for ripening, drying, or storing vegetables)?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible (for example, fireguards, lightning rods, fire insurance).\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\nOxford®\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3467.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5507, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1246, 3], [1246, 2524, 4], [2524, 4045, 5], [4045, 4956, 6], [4956, 5865, 7], [5865, 6577, 8], [6577, 7035, 9], [7035, 7489, 10], [7489, 8047, 11], [8047, 8445, 12], [8445, 10084, 13], [10084, 11932, 14], [11932, 13579, 15], [13579, 15192, 16], [15192, 15192, 17], [15192, 15192, 18], [15192, 16378, 19], [16378, 17674, 20], [17674, 18883, 21], [18883, 19810, 22], [19810, 19963, 23], [19963, 20115, 24]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false]}}]