[{"id": "c4855aba0c88c7bad9b2c8fbce4790a399c4d0b8", "text": "Please print name and address in capital letters.\n\nYour full name: THOMAS WILLIAM BENNETT\n\nPresent Address: Willow Bunch\n\nPioneer Address: \n\nYear you came to Saskatchewan: 1909\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: Thomas William BENNETT\n\nPresent Address: Willow Bunch\n\nPioneer Address:\n\nYear you came to Saskatchewan: 1909\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period; although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the other.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRE.\n\nNo. 4\n\nPioneer Churches.\n\n1. To what religious services did you go when you first settled in your district?\n\n2. Where did your neighbors go to church?\n\n3. How long was it after the first settlers came to your area before services of church worship were organized?\n\n4. By whom were religious services held in your community before a regular church became established (by a clergyman from some other place, etc.)?\n\n5. Give details of church arrangements, telling where services were held, how many people attended, how much money was collected, etc.\n\n6. How was the clergyman supported?\n\n7. Was the school house used for church services? Give dates.\n\n8. Did the same congregation ever support both types of services and give equal financial support?\n\n9. Where did the clergyman (or clergyman) live, and how far was it from the school house?\n\n10. How did he get to the school house to conduct services?\n\n11. Was he entertained in homes or supplied with accommodation for the night?\n\n12. Were services continued throughout the winter months, as well as other seasons of the year?\n\n13. Who put on the fire for school house services in winter?\n\n14. What other charges, or appointments, did the clergyman have besides the one at your school house?\n\nDescribe the financial arrangements.\n\nDescribe the arrangements for the collection of money in the Allotment.\n\nWere homes or other buildings such as stores used for church services in your community? Describe the arrangements.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 4\n\nPioneer Churches.\n\n1. To what religious services did you go when you first settled in your district? How long was it after the first settlers came to your area before services?\n\n2. When were religious services held in your community before a regular church became established (by a clergyman from some other place etc.)? Give details of the arrangement, telling where meetings were held, etc.\n\n3. Was the school house used for church services? Give dates.\n\n4. Was it used by congregations of more than one denomination on alternate Sundays?\n\n5. Did the same congregation ever support both types of services and give equal financial support?\n\n6. Where did the clergyman (or clergymen) live, and how far was it from the school house?\n\n7. How did he get to the school house to conduct services?\n\n8. Was he entertained in homes or supplied with accommodation for the nights?\n\n9. Were services continued throughout the winter months, as well as other seasons of the year?\n\n10. Who paid the fire for school house services in winter?\n\n11. What other charges, or appropriations, did the clergymen have besides the rent at your school house?\n\nDescribe the financial arrangements.\n\n12. Were bonds or other building funds such as stores used for church services in your community? Describe the arrangements.\n5. If you had a church building, give the date it was built.\n\nWho designed the building?\n\nWho built it?\n\nWhat material was it made of?\n\nWhat was the name and denomination of the church?\n\n6. Describe the steps taken in securing land for the building of the church.\n\n7. How many families were in the congregation?\n\n8. Is this first building still in use?\n\nIf not, tell why it is not used now, and what happened to it.\n\n9. When did you have a resident clergyman?\n\nWhat provision was made for living quarters for him?\n\n10. Did any other denomination use this church building for services?\n\nDescribe the arrangement.\n\n11. Tell what other churches were built in your community, either before your church was built, or at any time since. Give dates if possible, denomination, etc., if church was built, or any changes which have occurred in the use of the building, that is, if some denomination other than the one who built it is now using the church, or if it is used for some other purpose.\n\nAre all these churches in town? If not, give distances from town.\n\nIf not built in town, why were they not built there?\n5. If you had a church building, give the date it was built:\n   Who designed the building?\n   Who built it?\n   What material was it made of?\n   How many people did it seat?\n   What was the name and denomination of the church?\n\n6. Describe the steps taken in arranging for the building of the church. (Include who started it, how money was raised, etc.)\n\n7. How many families were in the congregation? Remember.\n\n8. Describe any make-shifts or savings resorted to in the building of the church, and in securing furniture and supplies for it.\n\n9. In this first building still in use?\n   If not, tell why it is not used now, and what happened to it.\n\n10. Did any other denomination use this church building for services? Describe the arrangement.\n\n11. Tell what other churches were built in your community, either before your church was built, or at any time since. Give dates if possible, denomination, etc., if known.\n\n12. Are all these churches in town? If not, give distances from town.\n\nIf not built in town, why were they not built there?\n12. Was your church established as a home mission? Describe the arrangements as to finances, student ministers, etc.\n\n13. If families did not have a church of their own denomination in the community, did they usually go to some other church or not attend at all? Explain.\n\nIf families had been attending and supporting a church other than their own denomination, or had not attended because their own church was not present, how well did they support their own church if it became established in their community at a later date?\n\n14. How often and at what time were services held in the church, school or other building? After 1926, explain any Sunday.\n\n15. Did laymen conduct church services when a clergyman was not available? Describe the circumstances.\n\n16. Did you have an organ for the services? Yes. Who played it? Mr. Miller. When was it bought? 1926. How was the money raised for it? Church members.\n\n17. Did you have a choir? No. How many were in it? None. Who started it? None. Were any of the persons who led the choir or sang in it trained musicians? None.\n\n18. Was any other kind of music or musical instrument used in the services? Describe. None.\n\n19. What kind of religious instruction for the young, such as Sunday School or Catholic classes, were held? Give dates when they were started. Every Sunday. How often were they held? Every Sunday. How many children attended? None. Who was in charge of these and helped with the teaching? My daughter-in-law, Mrs. Smith.\n\n20. What organization (or organizations) was formed to help with the support of the church? None. How often did it meet? None. How many women or men belonged to it? None.\n12. Was your church established as a house mission?\nDescribe the arrangements as to finances, student ministers, etc.\n\n13. If families did not have a church of their own denomination in the community, did they usually go to some other church, or not attend at all? Explain.\n\nDid they have any special religious services of some kind in the home if they could not go to church, or if there was no public religious service?\n\nIf families had been attending and supporting a church other than their own denomination, or had not attended because their own church was not present, how well did they support their own church if it became established in their community at a later date?\n\n14. How often and at what time were services held in the church, school, or other building?\n\n15. Did Laymen conduct church services when a clergyman was not available?\nDescribe the circumstances.\n\n16. Did you have an organ for the services? Yes\nWho played it? Mr. Miller\nWhen was it bought? 1926\nHow was the money raised for it? Proceeds of school\n\n17. Did you have a choir? Yes\nHow many were in it? 12\nWho started it? Mr. Miller\nWere any of the persons who led the choir or sang in it trained musicians? Explain.\n\n18. Was any other kind of music or musical instrument used in the services?\nDescribe, if so.\n\n19. What kind of religious instruction for the young, such as Sunday School or Catechism classes, were held? Give dates when they were started.\n\nHow often were they held? Every Sunday\nWho was in charge of these and helped with the teaching?\n\n20. What organization (or organizations) was formed to help with the support of the church?\nWhat year was it started?\nHow often did it meet?\nHow many women or men belonged to it?\n21. In what year was the first church picnic held?\n\nDescribe the church picnics of early days, telling how many attended, what food was eaten, what activities there were, changes which occurred in later years, and any other details about them which you remember.\n\n22. In what year was the first fall supper or harvest dinner held? Describe the fall suppers of early days, telling how many attended, what food was eaten, what activities there were, changes which occurred in later years, and any other details about them which you remember.\n\nWhat differences do you notice between the dinners served at the suppers in the early days, and those served now?\n\nWhat differences are there in serving methods (help yourself, plates served, etc.)?\n\nWhat changes are there in the prices of suppers?\n\nDescribe any changes which you have noticed in the breakfasts offered for boys in type of work or articles brought, those that were most popular at long times, changes in price, or any other details which you may remember.\n\nWas a concert of some kind held in connection with the suppers or banquets in the first years?\n\nDescribe any other activities that were carried on to assist in raising money for the church.\n\n23. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n24. When was any plan of systematic giving for the support of the church and clergyman adopted?\n\nOf what nature? Weekly envelopes, etc.?\n21. In what year was the first church please meet? [Handwritten]\n\nDescribe the church planter of early days, telling how many attended, what they had to eat and drink, what accommodations there were, changes which occurred in later years, and any other details about them which you remember. (Please be as full as possible.)\n\n22. In what year was the first full supper or dinner held? Please meet. [Handwritten]\n\nWas it held every year after 1847? Yes, all the days from then.\n\nWhat differences do you notice between the dishes served at the suppers in the early days, and those served now?\n\nWhat differences are there in serving methods (help yourself, plates served, tray filled, etc.)?\n\nWhat changes are there in the prices of suppers?\n\nDescribe any changes which you have noticed in the breakfast offered for members. If any changes brought, those that were most popular.\n\nHas a concert of some kind held in connection with the suppers or banquets in the first years?\n\n23. Describe any other activities that were carried on to assist in raising funds for the church.\n\n[Handwritten]\n\n24. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n25. Was there any plan of systematic giving for the support of the church and clergyman's stipend?\n\nOf what nature? Weekly envelopes, etc.? Usually envelopes.\n26. What interest or activity was shown in the support of foreign missions?\n\n27. How far did some of the people have to travel to church services? (6 miles)\n\nWhat means of travel was used?\n\n28. What nationalities were represented in the congregation, and in approximately what proportions?\n\n29. Were there special revival or mission services in the early days? Describe.\n\n30. What arrangements were there to provide for the training of the clergy?\n\n31. What differences did you notice in church life on the prairie as compared with the community you came from?\n\n32. To what extent did the social life of the community center around the church service (held in the church, school, or other building) in the early days?\n\n33. Is the church as important a place now of people gathering together for companionship and sociability as it was in the early years? Explain.\n\n34. In the first membership roll of your church still in the community, give:\n\nIf you can, give the name of the person who has it.\n\nDo you have any pictures or photographs of your earliest church or house where the first services were held, or do you know of anyone who has such pictures?\n\n35. Describe any special features or unusual incidents of pioneer churches, or anything connected with it which you found interesting, not already written, (see other sheets, or back of this sheet if necessary.)\n\nW. G. Miller (signature)\n\nPlease note! All the above print should be black\n\nThis available to you from nearest\n26. What interest or activity was there in the support of foreign missions?\n\n27. How far did some of the people have to travel to church services? \n\n28. What nationalities were represented in the congregation, and in approximately what proportions?\n\n29. What languages were spoken at the early days? Describe.\n\n30. What arrangements were there to provide for the training of the clergy?\n\n31. What differences did you notice in church life on the prairie as compared with the community you came from?\n\n32. To what extent did the social life of the community center around the church services (held in the church, school, or other building) in the early days?\n\n33. In the church as important a place now of people gathering together for companionship and sociability as it was in the early years? Explain.\n\n34. Is the first membership roll of your church still in the community? If so, give the name of the person who has it.\n\nTo you have any pictures or photographs of your earliest church or of where the first services were held, or do you know of anyone who has such pictures?\n\n35. Describe any special features or unusual incidents of pioneer churches, or anything connected with it which you found interesting, not all will be mentioned. (See other sheets.)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3466.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4211, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1108, 5], [1108, 2215, 6], [2215, 3724, 7], [3724, 5066, 8], [5066, 6174, 9], [6174, 7216, 10], [7216, 8872, 11], [8872, 10582, 12], [10582, 12085, 13], [12085, 13491, 14], [13491, 14970, 15], [14970, 16232, 16], [16232, 16387, 17], [16387, 16543, 18], [16543, 16543, 19], [16543, 16543, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]