[{"id": "d75ddecbd1959da84541cfb82e8cb13e16ef8fb0", "text": "WHAT DID EARLY CANADIAN FARMERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName MRS. G. M. DAWENT\nAddress M.A.T.R.O.U.S., SASK.\nBirthplace DULLEY, STAFFORDSHIRE ENGLAND\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? W.M. 22, Range 24, Township 31, West 2nd\nWhere had you been living before that? Invercote, Waterloo Farm 2 years\nFor how many people did you prepare meals? 3. Husband, Self, Boy aged\nHow far was it to your nearest store? 5.0 miles\nHow often could a visit be made to the store? 2 times in 6 months\nWhat groceries did you usually buy in those earliest years? Flour, rolled oats, sugar, tea, yeast, syrup, lard\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? First years\nI do not remember what brand rolled oats\nIn what quantities did you buy it? Nov. 15, 1906, 6 bags, 7 lbs., 50 lb. rolled oats\nWhat was the usual price per hundred pounds of white flour? I don't remember\nHow much did you use graham flour? None\nWhole wheat flour? None\nWas flour milled locally? No, how far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? I don't remember\nWhat other grain products did you use? Corn meal\nCorn meal? None, Whole wheat? None, Farina? None\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\nMRS. A. M. DARWENT\nAtreton Matron, O.M.\nMatron, 1926\n\nPUDLEY, STAFFORDSHIRE, ENGLAND\n\n1. PERSONAL HISTORY\n\nWhat year did you enter nursing school? 1906\nWhere did you go to nursing school? St. Mary's Hospital School of Nursing\nHow long have you been working in this hospital? Since 1906\nHave you ever worked in another hospital? No\nHow many years have you been working here? 30\nWhat was your first position? Head Nurse\nWhat is your current position? Matron\n\n2. FOOD AND DIETARY PRODUCTS\n\nWhat brand of milk do you use in the hospital? S.W.A.\nIn what quantities do you buy? 100 lbs.\nWhat is the usual price per hundred pounds of milk? $1.50\nHow much milk do you use each day? 100 lbs.\nWhat kind of flour do you use? Whole wheat flour\nWas flour milled locally? Yes\nWas flour milled by yourself? No\nWhat was the price for a twenty-pound bag of flour? $1.50\nDid you purchase any other food products? No\nWhat were they? None\nDid you make your own bread? No\nHow did you make it? By hand\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lb. sack.\n\nWhat was the price for a ten pound sack of white sugar? 50 cents.\n\nWhat brand of golden corn syrup did you use? Sugar.\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price? I do not remember.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had our own cows.\n\nButter? Made my own.\n\nEggs? Own eggs.\n\nWhat was the price of butter? 10 cents.\n\nDid you pack eggs for market? No.\n\nDid you make butter? Yes.\n\nCheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Wild ducks in summer.\n\nHow did you get fresh meat? Did not have any.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? We dry salted pork.\n\nWas there a \"beef ring\" in your neighborhood? Not till 1923.\n\nIf so what year was it organized? 1923.\n\nDid you use game? Wild ducks.\n\nWhat kinds? Prairie chickens.\n\nFor how long? I don't remember.\n\nWhat part did fish play in the family diet? We never had any.\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n3. **SUGAR AND STARCH**\n   \n   In what quantity did you buy sugar last week? 10 lbs.\n   \n   That was the price for a ten pound sack of white sugar? 5¢ per pound.\n\n   What brand of molasses syrup did you use? Progess.\n\n   What color of this or syrup did you usually buy? Dark brown.\n\n   At what price? 1¢ per lb.\n\n4. **DAIRY PRODUCTS**\n\n   How did you get a supply of fresh milk in the early days? We had cows and butter.\n\n   What was the price of butter? 16¢ per lb.\n\n   Did you pack eggs for market? No.\n\n   Did you make butter? Yes.\n\n   What kind of cheese?\n\n5. **MEAT AND FISH**\n\n   What was your meat supply in the early years? Wild game.\n\n   How did you get fresh meat? We bought small hogs and cattle.\n\n   Was there a butcher in your neighborhood? Yes.\n\n   If so, what year was it established? 1923.\n\n   Did you use game? Yes.\n\n   For how long? I don't remember.\n\n   What part did fish play in the family diet? We never had any.\n\n   Was the fish fresh, cured, or canned?\n\n   Kind?\n6. Beverages\n\nWhat kind of tea did you buy? Blue Ribbon. At what price? $1.00 per lb.\n\nWhat kind of coffee did you buy? (beans or ground) Did not use coffee.\n\nPrice? ................. What other beverages were used? .......................\n\n7. Vegetables and Dried Fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping? Didn't buy. Could you get potatoes at the store? Didn't know.\n\nIf not, where from? ..............................................................\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1907. Cabbage .......... Carrots .......... Onions .............\n\nTurnips .......... Beets .......... \n\nIn what quantities did you buy white navy beans? 4 lb.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 5 lbs. How did the grocer handle prunes (by box)? ...\n\nBy Date. What was the price of prunes? Didn't know.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. Preserving\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? No. Corn? No. Beans? No. Saskatoons? No.\n\nOther foods? ..................................................................\n\nWhat year did you first preserve fruit by canning? I don't remember.\n\nWhat year did you first preserve vegetables by canning? ...................\n\nWhat year did you first preserve meat by canning? ....................\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent? ..................................................................\n\nDid you make your own vinegar? No.\n\nIn 1906 and 1907 I gathered mushrooms and wild strawberries, just enough to make a meal. They were not very plentiful.\n6. What kind of tea did you buy? Blue Ribbon. Are they privately shipped? Yes. Best kind of source did you buy? (Brand or brand). What part of the state? (Not sure).\n\n7. Vegetables and Fruits Purchased. Did you get potatoes at the store? I don't know. If yes, where from? I don't know. Did you first grow your own supply for the winter or buy? Potatoes 12.47. Turnips 8.25. Cabbage 5.89. In what quantities did you buy? 5 lbs. How much did you pay per lb.? 5 lbs.\n\n8. Following. In the early years did you preserve any foods by freezing? Yes, beans, corn, etc. Other foods? No. That year did you first preserve fruit by canning? I don't remember. That year did you first preserve vegetables by canning? That year did you first preserve meat by canning? Do you still preserve foods by canning or drying? Canning.\n\nIn 1906 and 1907 I gathered mushrooms and wild strawberries just enough to make a meal. Why was not very plentiful.\n9. Please fill in the following to the best of your memory:\n\n| FOOD                        | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time. | Price of this amount |\n|-----------------------------|---------------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits               |                                                   |                                      |                     |\n| Macaroni                    |                                                   |                                      |                     |\n| Graham flour                |                                                   |                                      |                     |\n| Brown sugar                 |                                                   |                                      |                     |\n| Molasses                    |                                                   |                                      |                     |\n| Table salt                  |                                                   |                                      |                     |\n| Common salt                 |                                                   |                                      |                     |\n| Lily white syrup            |                                                   |                                      |                     |\n| Toilet soap                 |                                                   |                                      |                     |\n| Baking powder               |                                                   |                                      |                     |\n| Baking soda                 |                                                   |                                      |                     |\n| Dried peas                  |                                                   |                                      |                     |\n| Dried corn                  |                                                   |                                      |                     |\n| Vinegar                     |                                                   |                                      |                     |\n| Raisins - seeded            |                                                   |                                      |                     |\n|                              |                                                   |                                      |                     |\n| Rice                        |                                                   |                                      |                     |\n| Currants                    |                                                   |                                      |                     |\n| Store jam - kinds?          |                                                   |                                      |                     |\n| Cheese (Cheddar or store cheese) |                                                   |                                      |                     |\n| Vanilla                     |                                                   |                                      |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast\n\nDid you make yeast for your own use? etc. Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes Baking soda? Yes\n\nCream of tartar? Did you make your own baking powder? No\n| Item                  | Price |\n|-----------------------|-------|\n| Corn meal             |       |\n| Oats                  |       |\n| Sugar                 |       |\n| Molasses              |       |\n| Table salt            |       |\n| Conserve fruit        |       |\n| Lily white syrup      |       |\n| Yeast                 |       |\n| Baking powder         |       |\n| Yeast extract         |       |\n| Dried peas            |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Raisins               |       |\n| Raisins - seedless    |       |\n| Rice                  |       |\n| Currants              |       |\n| Store jar - berries   |       |\n| Chooses (Cheddar)     |       |\n| or store cheese       |       |\n| Vanilla               |       |\n\n10. BAKING\n\nWhat type of yeast did you use? **Royal Yeast**\n\nDid you make yeast for your own use? **No**\n\nUsing hops? **No**\n\nSalt rising? **No**\n\nDid you buy baking powder? **Yes**\n\nCrack of tartar? **No**\n11. Please fill in the following data for the best of your memory:\n\n| Item                  | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon         | 1910                                   |                              |                                               |\n| Canned sardines       |                                        |                              |                                               |\n| Other canned fish     |                                        |                              |                                               |\n| Apples - fresh        |                                        |                              |                                               |\n| Apples - dried        | 1910                                   |                              |                                               |\n| Lettuce               |                                        |                              |                                               |\n| Tomatoes - fresh      |                                        |                              |                                               |\n| Tomatoes - canned     |                                        |                              |                                               |\n| Bananas               |                                        |                              |                                               |\n| Lemons                |                                        |                              |                                               |\n| Oranges               |                                        |                              |                                               |\n| Cornflakes            |                                        |                              |                                               |\n| Other prepared        |                                        |                              |                                               |\n| breakfast cereals     |                                        |                              |                                               |\n| Pearl tapioca         |                                        |                              |                                               |\n| Minute tapioca        |                                        |                              |                                               |\n| Sago                  |                                        |                              |                                               |\n| Dates                 |                                        |                              |                                               |\n| Nuts                  |                                        |                              |                                               |\n| Icing sugar           |                                        |                              |                                               |\n\n12. WATER SUPPLY Hole dug beside a slough\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the house? (pail, barrel, tank) ........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nDug well 1907. Melted Slough ice in winter\nHave since dug 3 wells on Homestead.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your house? .................................................. 5.0 yards\n\nWas it brought to the house? (well, barrel, tank) ........................................... Pail.\n\nHas there been any changes which have taken place since you first started homesteading? (river, dugout, well)\n\nBuy well 1907. Halted through ice in winter\n\nHave since Aug 3 well on Homestead.\n13. SOAP\n\nDid you buy laundry soap or make your own? Royal Brown.\n\nIf you made your own, did you use lye? Yes. Wood ashes? No.\n\nWhat kinds of laundry soap did the grocer handle? I don't know.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From Baxter in Brandon Lake.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Coal got it from lumber yards.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Mrs. Clark.\n\nThat year was it purchased? 1926. Second hand? Yes.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, copper, tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware, bought in Manitoba.\n\nWhen did you first see enamel ware? 1910.\n\nAluminum? I don't remember.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nSold butter in cellophane 1906.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1906. For days at a time would be rolled oats porridge, bread, Butter and Tea 3 times a day.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\nChristmas 1906... Give the menu. List those present and give their approximate ages at that time.\n\nA pudding made with flour, syrup, Baking Powder\nWe got a little Beef from a neighbor, and potatoes\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo. But I was without flour for 2 weeks. My husband had to go to Hanley 50 miles for our supplies. He bought 6 bags flour rolls rolled oats 2 20 lbs pails syrup and 50 lb pail hard on Nov 15th 1906. But by the end of the winter it was all gone.\n\nWe had deep snow, and only ocean, so could not go to Hanley till May. The reason I do not know. Price my Husband did the buying, and he has passed away.\n\nHave answered question to the best of my ability.\nFold butter in March 1906.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the numbers of the family members at the table. Make up the approximate number of each food item served.\n\n18. Tell how you made your first Christmas dinner in eastern Canada. What did you serve? Give the menu. List those present and five other guests at the time.\n\n19. In 1906, for days at a time would be rolled oats, hominy, bread, butter and tea. 3 times a day\n\n20. Were you ever reduced to almost starvation levels living on one or two local products? Details?\n\n21. But I was without flour for 9 weeks. My husband had to go to Hamilton 50 miles for our supplies. He bought 6 bags flour rolls rolled out 2. 20 lbs flour and 50 lbs hail hard on Mar 15th 1906. But by the end of the winter it was all gone. We had deep snow, and only now, so could not go to Hanly Hill. The reason I do not know. But my husband died the following and he was buried away.\n\nHave answered question to the best of my ability.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\n\"When I first sold butter in Watrous it was unwrapped, I do remember when the wrapper came in but it is a great improvement.\"\nWhen I first sold butter in Kalpine\nit was unsupplied, I do remember\nwhen the supplies came in but it is a\ngreat improvement\nMy second son was born Dec 14th 1906. My nearest neighbor was 2 miles away, if near at home in the town of Hanley 50 miles away. My son and his family live on the homestead he was born on.\nMy second son was born Dec 4th 1906. My nearest neighbor was 2 miles away. Nearest doctor in the town of Hanley 50 miles away. My son and his family live on the homestead he was born on.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_176.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4899, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1519, 3], [1519, 2499, 4], [2499, 3586, 5], [3586, 4573, 6], [4573, 6338, 7], [6338, 7267, 8], [7267, 10918, 9], [10918, 11908, 10], [11908, 15766, 11], [15766, 16264, 12], [16264, 17309, 13], [17309, 17309, 14], [17309, 18671, 15], [18671, 19727, 16], [19727, 20451, 17], [20451, 20576, 18], [20576, 20765, 19], [20765, 20951, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]