[{"id": "4ebd0361c49fbe974ce21307935f118c26862970", "text": "S-X2\n5. Geddes, Alice Gertrude (Mrs. James)\nTHAT DID CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and will it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName ____________________________\nAddress ____________________________\nBirthplace ____________________________\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ____________________________\nWhere did you set up housekeeping? ____________________________\nWhere had you been living before that? ____________________________\nFor how many people did you prepare meals? ____________________________\nHow far was it to your nearest store? ____________________________\nHow often could a visit be made to the store? ____________________________\nWhat groceries did you usually buy in those earliest years? ____________________________\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ____________________________\nIn what quantities did you buy it? ____________________________\nWhat was the usual price per hundred pounds of white flour? ____________________________\nHow much did you use Graham flour? ____________________________\nWhole wheat flour? ____________________________\nWas flour milled locally? ____________________________\nHow far away? ____________________________\nThat year? ____________________________\nWhat was the price for a twenty pound bag of rolled oats? ____________________________\nWhat other grain products did you use? ____________________________\nCornmeal? ____________________________\nWhole wheat? ____________________________\nFarina? ____________________________\nOther? ____________________________\nDid you grind your own wheat for porridge? ____________________________\nHow did you grind it? ____________________________\nGeddes, Mrs. Jan.\nGrenfell, 1882\n\n1. INTERDIARY QUESTIONS\n   - What year did you start homesteading in eastern Canada?\n   - Where did you eat at housekeeping?\n   - How many people did you have at meals?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n\n2. FLOUR AND OTHER GRAINS\n   - What brand of flour did you use in the early days?\n   - In what quantities did you buy flour?\n   - What was the usual price per hundred pounds of flour?\n   - How much did you pay for flour?\n   - Was flour milled locally?\n   - What was the price for a twenty pound bag of rolled oats?\n   - What other grain products did you use?\n   - Commercially grown or locally grown?\n   - Did you plant your own crops for porridge?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 50¢\n\nWhat brand of golden corn syrup did you use? about 5 lbs.\n\nWhat size of tin of syrup did you usually buy? Black Mallee.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Canned.\n\nButter? Eggs?\n\nWhat was the price of butter? Of eggs?\n\nDid you pack eggs for winter? How?\n\nDid you make butter? Yes. Butter cheese? Yes.\n\nWhat kind of cheese? Fresh from pasture cows.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork bacon monthly.\n\nHow did you get fresh meat? Short-ribs.\n\nHow often did you get fresh meat? Not very often.\n\nHow did you preserve meat? Drying it, brine, tender parts.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Plenty. What kinds? Pheasants, ducks, quail, woodcock.\n\nFor how long? While in season.\n\nWhat part did fish play in the family diet? Not a great part.\n\nWas the fish fresh, cured, or canned? Most canned, sometimes fresh.\n\nKinds? Cod, salmon.\n2.\n\n3. ACTIVITIES AND INTERESTS\n\nIn what activities did you take part? Any special clubs or organizations?\n\n4. FAMILY HISTORY\n\nDid you have any children? If so, how many?\n\n5. EDUCATION\n\nWhat was your highest level of education?\n\n6. OCCUPATION\n\nWhat was your occupation?\n\n7. RESIDENCE HISTORY\n\nHave you lived in this area for more than ten years?\n\n8. HEALTH HISTORY\n\nHave you ever been hospitalized?\n\n9. SOCIAL HISTORY\n\nHave you ever been married?\n\n10. RELIGIOUS AFFILIATION\n\nWhat is your religious affiliation?\n\n11. VOLUNTEER ACTIVITIES\n\nHave you volunteered for any community service?\n\n12. OTHER\n\nAny other information you would like to share?\n6. BEVERAGES\n\nWhat kind of tea did you buy? (beans or ground) at what price? $3.00\n\nWhat kind of coffee did you buy? (beans or ground) from where? Price? What other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? Could you get potatoes at the store? If not, where from? What year did you first grow your own supply for the winter of:\n\nPotatoes Cabbage Carrots Onions Turnips Beets\n\nIn what quantities did you buy white navy beans? How did you buy prunes, (in bulk or by the box)? What weight? How did the grocer handle prunes (by box)? What was the price of prunes? What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes Peas Corn Beans Saskatoons Other foods\n\nWhat year did you first preserve fruit by canning? What year did you first preserve vegetables by canning? What year did you first preserve meat by canning? Do you still preserve foods by canning or drying? To what extent? Did you make your own vinegar? Yes\n6. **BUYING**\n\n   - How much did you buy? (Name or amount)\n   - What kind of coffee did you buy? (Name or amount)\n\n7. **VEGETABLES AND DRIED FRUITS**\n\n   - What was the price of potatoes per bushel?\n   - How many pounds did you get potatoes at the store?\n   - What year did you first grow your own supply for the winter?\n   - Potatoes\n   - Turnips\n   - Carrots\n   - Turnips\n   - Turnips\n   - Turnips\n   - Turnips\n\n8. **FREEZING**\n\n   - In the early years, did you freeze any foods by draining?\n   - Other foods?\n   - What year did you first freeze fruits?\n   - What year did you first freeze vegetables?\n   - What year did you first freeze meat?\n   - Do you still preserve foods by canning or drying?\n\n9. **OTHER**\n\n   - Did you ever have a garden?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Your you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant., you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|---------------------|\n| Soda biscuits         |                                               | in bulk. 2s.                                      |                                     |                     |\n| Macaroni              |                                               |                                                   |                                     |                     |\n| Graham flour          |                                               |                                                   |                                     |                     |\n| Brown sugar           |                                               |                                                   |                                     |                     |\n| Molasses              |                                               | in earthenware 2s. 5lbs.                          |                                     |                     |\n| Table salt            |                                               |                                                   |                                     |                     |\n| Common salt           |                                               | in barrel. 7lb bags.                              |                                     |                     |\n| Lily white syrup      |                                               |                                                   |                                     |                     |\n| Toilet soap           |                                               |                                                   |                                     |                     |\n| Baking powder         |                                               |                                                   |                                     |                     |\n| Baking soda           |                                               | in barrel - 1s.                                   |                                     |                     |\n| Dried peas            |                                               |                                                   |                                     |                     |\n| Dried corn            |                                               |                                                   |                                     |                     |\n| Vinegar               |                                               | home made -                                       |                                     |                     |\n| Raisins - seeded      |                                               | seedless                                          |                                     |                     |\n| Rice                  |                                               | packed in barrel.                                 |                                     | 3s. 6d.             |\n| Currants              |                                               | in barrel.                                        |                                     | 1s.                 |\n| Store jam - kindist   |                                               | in can(s).                                        |                                     | 1 can               |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast Coles\n\nDid you make yeast for your own use? Yes\n\nUsing hops? No\n\nSalt rising? Yes\n\nDid you buy baking powder? No\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                  | Price |\n|-----------------------|-------|\n| Soda bicarb           | $3    |\n| Flour                 |       |\n| Brown sugar           |       |\n| Molasses              | $3    |\n| Table salt            | $3    |\n| Carbonate             | $3    |\n| Lily white syrup      |       |\n| Toilet soap           |       |\n| Baking soda           | $3    |\n| Dried peas            |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Rasins                | $3    |\n| Rice                  | $3    |\n| Garrata               | $3    |\n| Store Jan - Kinley    | $3    |\n| Cheese (cheddar)      | $3    |\n| Vanilla               |       |\n\n10. Baking\n   - What type of yeast did you use? **Active dry**\n   - Did you make yeast for your own use? **Yes**\n   - Using lye? **No**\n   - Did you buy baking powder? **Yes**\n   - Cream of tartar? **Yes**\n   - Did you bake your own brown sugar? **No**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | $3                                     |                               |                                                |\n| Canned cardines             | $3                                     |                               |                                                |\n| Other canned fish that appeared early - give names |                           |                               |                                                |\n| Apples - fresh              |                                        | 1890 -                        |                                                |\n|                             | dried                                  | 82 -                          |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names |                           |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minuto tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Nuts                        |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ________________\n\nHow far was this water from your home? ____________________________\n\nHow was it brought to the house? (pail, barrel, tank) ________________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n__________________________ wells and cisterns for soft water\n\nSince about 1896\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, stream, etc.)\n\nIf so, how was this water from your house? (pail, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nHave you had any changes which have taken place since you last visited?\n\nFirst servant housekeeper, Oliver dates when possible.\n\nDistrict water and sewers for about 1896-\n12. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use soap and wood ash? What was your recipe?\n\n14. RUSK\n\nWhat did you use in the earliest days? Sugar and flour?\n\n16. HOUSEHOLD HOUSEKEEPING\n\nList any changes in the use of fuels which have taken place since you began any business in the use of fuels. Which have taken place since you began any business in the use of fuels.\n\n18. METHODS OF COOKING AND WAYS OF USING\n\nDid you use an outdoor fireplace or open hearth in the earliest days? Did you use a brick oven (stone) or a wood stove? By whom was your first cook stove made? Who cooked?\n\nWhat year was it purchased? What types of utensils did you use? (Iron, copper, tin, homestead) Iron & Copper\n\nFor preparing food (chili, arroz con leche, corn bread, other) regelmäßig\n\nWhen did you first see animal power? 1890\n\nAluminum\n16. **UNAPPROVED COPY**\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest possible date. If you can remember, give the year and list the numbers of the family members present at each meal.\n\n18. What did you serve your first Oklahoma dinner in eastern Kansas?\n\n19. Does your record show any other interesting local things on one or two pages?\n\n20. **UNAPPROVED COPY**\n17. Give a typical day's menu (breakfast, dinner & supper) for the schoolcat year you can remember. Give the year until 1914 the children at that family with their ages at the time. State the approximate month, a.c., winter or summer.\n\n18. What type did you serve your first Christmas dinner in eastern Indiana? \n\n19. Have you ever refused to accept starvation level living on an old farm or in a city slum? If so, please describe how you managed to survive.\n\n20. Did you ever produce food? Give details.\n20. Mention any outstanding differences in the interpretation of events in the earlier stage of operation (if today, we would not have\n\n21. When did you begin to rely on prepared foods and prepared foods instead of home-cooked and home-prepared foods? (Give as many details and dates as possible).\n\n22. Planes and other vessels from your early experiences of buying groceries and obtaining foods in order that future planners may be better served.\n\nInclined toward or concerned about quality, perhaps of manufacturing,\n\nInstead, emphasis on economy, convenience and other factors. Use each of methods equally as needed.\n20. Mention any outstanding differences in the preparation of meals in the earlier days as compared with today.\n\n21. What did you begin to rely on purchased foods and prepared foods instead of home-prepared foods? (Give as many details as possible.)\n\n22. Please add other information from your early experiences of buying groceries and other items for the table. Include Pioneer Era in Northern Canada. Include items not mentioned above, quality, methods of merchandising, prices, brands, types or varieties, characters and other details. Use cash or barter, trade goods, etc., in North.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1882_5.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4078, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 44, 4], [44, 1875, 5], [1875, 2622, 6], [2622, 3745, 7], [3745, 4390, 8], [4390, 5546, 9], [5546, 6295, 10], [6295, 10330, 11], [10330, 11264, 12], [11264, 15053, 13], [15053, 15445, 14], [15445, 16305, 15], [16305, 16305, 16], [16305, 16699, 17], [16699, 17204, 18], [17204, 17824, 19], [17824, 18412, 20], [18412, 18412, 21], [18412, 18412, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]