[{"id": "ab581c8110d62559d9f63b783e25f831df29e0d3", "text": "PIONEER HISTORY\n\nPlease fill in name and address in pencil. Jot down:\n\nYour full name ____________________________\n\nPresent address ____________________________\n\nPlace you came from _______________________\n\nCountry or place from which you came ________\n\nRULES TO PASS ON AND ABOUT THE PIONEER HISTORY QUESTIONNAIRE\n\nSince early settlers lived in very different times of history, from one place to another, and because of different circumstances, the questions have been divided into three parts.\n\nPART I: The story of the family and its history.\n\n- To include any and all information about this family.\n\nPART II: The permanent home.\n\n- To include the date the house was built after living for a time in quarters elsewhere; the date of the permanent home built; when arrived at the homestead; the date of the first permanent home.\n\nPART III: General.\n\n- Including anything applying to either Part I or Part II of the questionnaire.\n\nSend completed questionnaires to:\n\nUniversity of Idaho Office of Extension, Box 4512, Moscow, Idaho 83844.\n\nPlease send your completed questionnaires to:\n\nUniversity of Idaho Office of Extension, Box 4512, Moscow, Idaho 83844.\nIn 1904 I traded my homestead the N.W.¼ of Sec. 20 Tp. 8 Rge 8 into a half section of Sec. ½ of Sec. 25 Tp. 9 Rge 7 west 2. You will see houses erected on both parcels placed on the homestead. I had a sod farm 16x30 on the bought land a frame farm 16x28 until 1914 when I built a cement block barn 28x48 with hip roof. Blocks were made on farm.\nIn 1904 I traded my homestead the N.W. ¼ of Sec. 20 Tp. 8 Rge 8 into a half section of Sec. ½ A Sec. 25 Tp. 9 Rge 7 west 2 from will see houses erected on both parcels planned on the homestead. I had a sod farm 16x30 on the bought land and a frame farm 16x28 until 1914 when I built a cement block farm 28x48 with hip roof. Blocks were made on farm.\nIn 1917 I built a large house 28 x 28 ft. \nlumber and stucco outside. It had a full size \nbasement of cement and was heated by a \nfurnace. It had kitchen, parlor, living room, \nwash room and pantry on 1st floor and 6 \nbedrooms and a bathroom upstairs. It was \nplastered and was built by Mr. Harold Gibson \nand myself. It had a well in cellar with force \npump by hand in wash room.\nIn 1917 I built a large house 28x28 ft. \nIt was outside it had a full size \nkitchen, dining room and was heated by a \nfireplace. It had a living room, parlor, dining \nroom and pantry on the floor and 5 \nbedrooms and a bathroom upstairs. It was little \nplastered and was built by own Harold Gibson \nand myself. It had a well in cellar with force \npump by hand in wash room.\nPART I: THE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1902 on homestead\n\n2. During what years did you live in it? 1902 to 1905\n\n   How long did you think you might live in it when you built it? 100 feet\n\n3. What was the location? (township, range, and post office). SW 8 Rg 8\n\n4. Is it still in existence? No\n\n5. What material was it made of? Log\n\n   How long did it take to build it?\n\n6. How large was it, and how many rooms did it contain? It was 10 x 12 ft.\n\n   How were they arranged?\n\n7. Who built it? My father, brothers and uncle built\n\n   What was it as I was working out\n\n8. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.) Never finished only plaster + logs\n\n9. What kind of floors did you have? Sand\n\n   What covering did you have on the floor (rushes, linoleum etc.)\n\n10. What expenses did you have connected with the building of the house? Little only window made door rubber and door catch & hinges\n\n11. Describe any special problems or unusual happenings connected with its building. It was built in the winter & 1901 so took longer than in summer\n\n12. How many people lived in the house when it was first built? Just myself, later?\n\n13. What means of heating did you have? Small cook stove\n\n14. What means of lighting did you use? Coal Oil lamp bought in Arcola spring of 1902 and I have it yet can show you if you want it\n\n15. Was there a cellar? No\n\n   Where was the door to the cellar? (in kitchen floor, other place?)\nPART II\n\nTHE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1902 or homesteaded.\n2. During what years did you live in it? 1902 to 1905.\n3. How long did you think you might live in it when you built it? 100 years.\n4. What was the location? (township, range, and post office.)\n5. What material was it made of?\n6. How large was it, and how many rooms did it contain?\n7. How were they arranged?\n8. Who built it? Any brothers, sisters, and parents working out.\n9. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.)\n10. What kind of floors did you have?\n11. What covering did you have on the floor (rushes, linoleum etc.)\n12. What expenses did you have connected with the building of the house?\n13. Describe any special problems or unusual happenings connected with its building.\n14. How many people lived in the house when it was first built?\n15. Was there a cellar? (In kitchen floor, other place?)\n\n[Handwritten notes]\n\n1. What year was this house built? 1902 or homesteaded.\n2. During what years did you live in it? 1902 to 1905.\n3. How long did you think you might live in it when you built it? 100 years.\n4. What was the location? (township, range, and post office.)\n5. What material was it made of?\n6. How large was it, and how many rooms did it contain?\n7. How were they arranged?\n8. Who built it? Any brothers, sisters, and parents working out.\n9. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.)\n10. What kind of floors did you have?\n11. What covering did you have on the floor (rushes, linoleum etc.)\n12. What expenses did you have connected with the building of the house?\n13. Describe any special problems or unusual happenings connected with its building.\n14. How many people lived in the house when it was first built?\n15. Was there a cellar? (In kitchen floor, other place?)\nPART II: THE PERMANENT HOME.\n\nNote: For some persons, this section may include a description of more than one house. If so, you may include answers for each, showing changes and differences from one house to another. If you wish, you may describe your first permanent house on this form, and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, and especially if they have been of the same type of houses, you may wish to answer questions only about the first one or two (or perhaps an outstanding house in which you lived), and merely mention the others in question 16.\n\nIn all cases, be sure to make it plain which house you are writing about, using dates (and perhaps places) to identify each.\n\n16. Give the location (township, range, and post office), of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\nMy first permanent house was on N. K. 25\nTop Rd. 7 and 2 built in 1905 one room frame\nShortly 12 x 16 lived in till 1917 when I built\nA larger house described on separate sheet\n\n17. Who planned and built the house? myself and built it alone\n\nWhat previous experience did this person (or persons) have in building? none - only what I had picked up\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built? Built in 1905\n\n19. How long did it take to build it (if possible, give approximate dates when started and completed)? About two weeks in April\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Slatlap\n\n22. How large was it? 12 x 16\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet if desired).\n\nDid you have a door in front? No\n\nWas there a back shed attached? Later on in 1907\n\nDid you have a front porch? Yes. If so, was it glassed in, screened or an open verandah?\n\n24. What kind of foundation was under the house (wooden sills, stone, concrete)? Concrete\n\n25. What kind of a basement did you have (full size cement basement, dirt cellar, etc.)? Dirt cellar\n\nWhere was the door to the basement (kitchen, outside, other room)?\nPART III\nTHE PERMANENT HOME\n\nNotes: For some persons, this section may include a description of more than one house. If so, you may choose one house to answer. If you wish, you may describe your first permanent home on this form and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, you may wish to answer questions about only one or two of them.\n\n16. Give the location (county, town, and post office), of the house(s) (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses before those you listed to describe in this questionnaire, give their locations and the years you lived in each.\n\n17. Who planned or built the house?\n\nWhat previous experience did this person (or persons) have in building? Only what I had purchased my own.\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built? 1905\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed?)\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Ship lap\n\n22. How large was it? 12 x 16\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired.)\n\nWas there a back shed attached? Later on - 1907\n\nDid you have a front porch? No\n\nWas it glassed in?\n\nWas the foundation under the house (wooden sills, stone, concrete)? No\n\nWhat kind of basement did you have (full, half, crawl, cellar)?\n\nWhere was the door to the basement (outside, outside, other)?\n26. What insulation was used?\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n\nDescribe any ornamentation on the exterior of the house (for example, \"gingerbread\" trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used? \n\n28. How were interior walls finished - (plaster, wood panel, wallpaper etc.)?\n\n29. How high were the ceilings? \n\nHow were they finished (plaster, beamed, moulded plaster)?\n\n30. What kind of wood were the floors made of? \n\nWhat width board? \n\nWere nails or dowels used? \n\nDid you have any parquet (patterned inlay) flooring?\n\n31. Describe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nWindows were two panes about 12 x 20\"\n\nHow were the windows arranged? \n\nDid you have a bay window? \n\nIn what room?\n\nDid you have any colored or stained glass windows? \n\nDescribe.\n\nDid you have shutters inside or outside?\n\nHow were window frames finished inside (painted, varnished)? \n\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panelled door, windows in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.,)?\n\nDid you have a door knocker? \n\nDescribe.\n\n33. Describe interior doors. - if panelled, type of hardware, or any other special features about them.\n\nDid you have any double doors, french doors or swinging doors?\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed?\n\nIf open, what type of baluster and rail was used, and what kind of wood?\n26. What insulation was used?\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n\nDescribe any ornamentation on the exterior of the house (for example, eightheads, trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished? (plaster, wood panel, wall paper etc?)\n\n29. How high were the ceilings?\n\nHow were they finished (plaster, beamed, molded plaster)?\n\n30. What kind of wood were the floors made of?\n\nWhat width boards?\n\nWere nails or tacks used?\n\nDid you have any parquet (patterned inlay) flooring?\n\n31. Describe the windows as nearly as you can, giving also (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window?\n\nDid you have any colored or stained glass windows?\n\nDid you have shutters inside or outside?\n\nYou were window frames finished inside (painted, varnished)?\n\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panalled door, windows in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.)?\n\nDid you have a door knocker?\n\n33. Describe interior doors, - if panalled, type of hardware, or any other special features about them.\n\nDid you have any double doors, french doors or swinging doors?\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed?\n\nIf open, what type of baluster and rail was used, and what kind of wood?\n35. Did you have any built in cupboards, bookcases, china storage or other similar built in storage or display space?\n\n36. What kind of a chimney did you have?\n\n37. If you had a fireplace, where was it located in the house?\n   What material was it made of - red brick (what size brick?), stone (state color) or other material?\n   How large was the fireplace?\n   What material was the mantle made of (wood, stone, brick)?\n\n38. Were there any built in gas lights or lamp brackets; or candle brackets?\n   Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred?\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible.\n\n41. Did you have a cistern? What size and material?\n   Was the pump from it in the kitchen, basement or elsewhere?\n   Did you have a well in the basement? Outside near the House?\n\n42. Did you have plumbing in your house?\n   If so, what was the source of water?\n\n43. If you built the house described above, what was its cost?\n   If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n   Date of construction of house?\n\n44. If you borrowed money to finance building or purchase, what was the amount of the loan?\n   The source?\n   What was the interest rate?\n   What were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\n   Did you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n45. If you lived in a rented house, what rental did you pay? (Give changes in rental and dates if possible).\n35. Did you have any built-in cupboards, bookcases, china storage or other similar built-in storage or display space?\n\n36. What kind of a chimney did you have?\n\n37. If you had a fireplace, where was it located in the house?\n   What material was it made of - real brick (what size brick),\n   stone (what color) or other material?\n   How large was the fireplace?\n   What material was the mantle made of (wood, stone, brick)?\n   Were there any built-in gas lights or lamp brackets or candle brackets?\n\n38. Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred?\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible.\n\n41. Did you have a closet?\n   What size and material?\n   Was the pump from it in the kitchen, basement or elsewhere?\n   Did you have a well in the basement?\n   Outside near the house?\n\n42. Did you have plumbing in your house?\n   If so, what was the source of water?\n\n43. If you built the house described above, what was its cost?\n   If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n   Date of construction of house?\n\n44. If you borrowed money to finance building or purchase, what was the amount of the loan?\n   What was the interest rate?\n   What were the terms of the loan (that is, the period of the loan,\n   and the method and time of repayment)?\n   Did you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n45. If you lived in a rented house, what rental did you pay? (Give changes in rental and dates if possible).\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, as they apply to houses mentioned in either Part 1 or Part 2, please specify which house you are speaking of if your answer does not apply in both cases. Use extra sheets if necessary.\n\n46. What did you do to \"winterize\" your house in the fall (storm windows, doors, banking (with what?), other means)?\n\n47. What additions were built to the house after its original construction?\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, sick animals or others).\n\n49. As nearly as you can remember tell what furniture you had in each room in the house, (rugs, sofas, chairs, curtains, musical instruments, etc., etc.). If you lived at first in the \"shack\" or sod house, and later in a larger house, please tell what furniture you had in each place.\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or would seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it, from Eaton's etc.)\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your home, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare piece of furniture which you might possess?\nPART III: GENERAL.\n\nNotes: As you may have more than one answer for questions in this section, please modify your answers mentioned in either Part I or Part II, not apply in both cases. Use extra sheets if necessary.\n\n46. What did you do to \"modernize\" your house in the fall (storm windows, doors, backing (with vinyl), other means)?\n\n47. What additions were built to the house after its original construction?\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats, or other pets, baby animals, sick animals or others).\n\n49. As nearly as you can remember tell what furniture you had in each room in the house. (rug, sofa, chairs, curtains, musical instruments, etc., etc.). If you lived at first in the old house, and later in a larger house, please tell what furniture you had in each place.\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your house, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare piece of furniture within you might possess?\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio? 1938\n   What kind was it? Coronado\n   Where did you get it? One Leeds Winnipeg\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?)?\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (for example, fireguards, lightning rods, fire insurance).\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the house (for example, rugs, window curtains, table covers, items of furniture, etc.).\n\n53. When did you get your first radio?  \n   What kind was it?  \n   Where did you get it?\n\n54. What use was made of the attic (as a sleeping room, for storage space, for feeding, crying, or storing vegetables)?\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (For example, fireguards, lightning rods, fire insurance).\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3476.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 6208, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1159, 5], [1159, 1159, 6], [1159, 1504, 7], [1504, 1504, 8], [1504, 1854, 9], [1854, 1854, 10], [1854, 2235, 11], [2235, 2608, 12], [2608, 4112, 13], [4112, 5991, 14], [5991, 8335, 15], [8335, 9961, 16], [9961, 11675, 17], [11675, 13298, 18], [13298, 15020, 19], [15020, 16736, 20], [16736, 18265, 21], [18265, 19499, 22], [19499, 20526, 23], [20526, 21526, 24], [21526, 21662, 25], [21662, 21816, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]