[{"id": "b7f0d5e82bbda1d15882ca1d667f5cca1b4ed1bf", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n✓ All questionnaires\n✓ Pioneer health conditions\n✓ Pioneer social life, sports and recreation\n✓ Pioneer housing\n✓ Pioneer education and churchwork\n✓ Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\nP.O. Bell\nRiverhead\n1. Your full name: Ralph Robert Bell\n\n2. Your address: K.H.R.H., R.R.T.\n\n3. Date: April 7, 1952\n\n4. Where were you born? (Give name of place and country): Chesley, Bruce Co., Ontario\n\n5. What was your father's name and occupation? Angus Bell, Carpenter & Barn Frame\n\n6. When did you come to Saskatchewan? (Give month and year): August 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 19\n\n9. What were your reasons for coming West? Too many for too few jobs, and about that time I didn't want to go West\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\nMajority of people came out on Homestead. Know $10.00 out $15.00 if you went back in the fall most young fellows played, finally took up a homestead, and then had to stay.\nBell, Robert\nRiverhurst\n\nTo Sask., August, 1901\n\nPIONEER QUESTIONNAIRE\n\nNo. 2\n\n1. Your full name: Robert Bell\n2. Your address: Riverhurst\n3. Date: April 7, 1901\n4. Where were you born? Ontario\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan?\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say, \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMagically, I thought you were going back in time. May you find all your family stories and have had a lovely look up a generation and then had a stay.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOur folks didn't like to see me go, other ones joined, but I called by the Indians freeze or starve, get lost, no one knew what they'd do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nAlone, I usually picked up chums, clerks, factory workers, sailors, fishermen, mostly flat types, but a few farmers.\n\n13. What means of transportation did you use?\n\nC.P.R. to Regina & Brandon, drove team of horses, Brandon to Indian Head took about a week, ran out of money and had to turn our way.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nMet some really fine people, quite a few Indians, didn't scalp us, but would be a tobacconist.\n\nWages farm labor $20.00 per month, and you walked behind every implement, no harness costs.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nIndian Head\n\nHusky, farm work. Started threshing at Brandon Aug 31, 1901 finished. Husky 10 miles north, present town Balcanco. Feb 10, 1902 wages $138 to $200 a day.\n\n16. Where did you settle or take up land?\n\nNW ¼ 50-23-6\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nRiverhead, cloth town, at that time Davidson 5½ miles, made three return trips with oxen, hauled first crop of wheat there. 50° bus took 3 days to make the trip, lots of stopping places.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn winter, and a good place for fleas in the summer.\nII. What did your friends and relatives think of your decision to come to Western\n\n11. What did your friends and relatives think of your decision to come to Western\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (e.g., horseback, train, etc.)\n\n14. What happened during your journey? (e.g., meetings with Indians, adventures on the trail, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Any other places where you have lived since coming to Saskatchewan?\n\n18. Mention any other things you would like to add.\n\n19. How do you earn your living before coming to Western Canada? How after you came?\n\n20. How do you feel about living in Western Canada?\n19. How often did you write to relatives or friends in your old home?\n\nWould write when ever a chance came. Would mail it first to Donelson 55 miles, then 2 miles north of Grandview & Elbow. Small store there; generally went on Sunday. Would get a few groceries if they had any. Mail, and then go to church, in the school house. Provided the minister would get there.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nFather & Mother, two brothers, and his sisters lived with me for a while. One brother lives in Regina, one sister in Portland, Oregon.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDon't know of anything special. Most settlers were young, hardworking, soon married, and settled down. Others joined up on the homesteads and left, times were hard. Their standard wasn't high, but everyone was about the same. The winter always seemed to be hard, but men could get along with less. A new pair of shoes also was something down by a year or so later when more settlers arrived.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDances & card parties we held, generally called for a long drive in sleigh or waggon, and most always lasted until day light, and the people that went to dance and done a good time, and we always had it. (No boozing, drinking in cars, then) quite often a load of nuts would get turned around on slick, the wrong trail, but all got home safely. None in this district was ever really lost. Frozen, but the horses had a lot alike them.\n23. How often did you write to relatives or friends in your old home?\n\nIf I had written to them, even a little, I would have been more attentive.\n\n24. If other members of your family (brothers, sisters, parents, etc.) came West\n\nI would have written to them, but they never came.\n\n25. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nYes, there was one experience that stood out in my mind. It was when we first arrived in Nebraska. We had to cross the plains and face many dangers. We faced many hardships, but we never gave up. We always worked hard, and our determination paid off.\n\n26. Did you travel about much in the early years? (For business, attending school, visiting friends, etc.)\n\nYes, I traveled quite a bit. I attended school in Nebraska, and I visited my relatives in Illinois.\n\n27. Did anyone else come to Nebraska because of your recommendation? If so, who?\n\nYes, my brother came because of my recommendation. He settled near Omaha.\n25. When was the first car used in the community? In 1911.\n\n26. If you owned a car before 1912, when did you buy it? What make? Pontiac\n\n27. Where was your trading center? How far from your home? Elbow 19 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). From 1915, Riverhurst, our C.N.R. town improved in roads, we had a daily train service to Moose Jaw from riverhust twice a week. Present times, two round trips a week.\n\n29. How often did you shop in the early days? Twice a week, 10 days while hauling wheat, when the way was good & hard.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1916\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSmall purchases were made by mail order generally. Clothing, today mostly clothing is ordered through mail order. Pants, shirts, Army & Navy, and a lot of repairs & hardware ordered through McReynolds' Small County Store. The block & chairs from\n\n32. When did you first have a telephone and what company provided it? 1918\n\nRiverhurst Rural Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nJust long enough to prove up, and then get out, but it didn't work so I am still here 46 years in one district, but will move soon. So years old this coming June.\n25. When was the first car used in the community? ~1911\n\n26. If you owned a car before 1912, when did you buy it? What make? (Owner) 1928\n\n27. Where was your trading center? How far from your home? (Owner) 19 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\ning, better means of travel etc.)...\n\nFrom 1913, I purchased my daily items, newspapers, etc., from Mr. Marshall\nin a nearby town. During times, like harvest time,\nwholesale prices, when buying any tobacco,\nwere lower around then.\n\n29. How often did you shop in the early days? (Indicate any changes)\n\n30. When did you ever sell people in your district start going to town regularly\non Saturdays? 1916\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy by mail order? Indicate also what fraction of\nyour total purchases were by mail order and any changes in the proportion of\npurchases made by mail order since the pioneer period.\n\nSmall purchases were made in a store\nGenuinely Clothing? Today more clothes\nare ordered through mail order. John Smith\nordered shoes, clothes, small family choir\nitems. He bought clothes from\n\n33. When did you first have a telephone and what company provided it? 1918\n\n34. When did you first travel by bus? And how did you feel about it?\n\n35. How long enough? Have you ever ridden on\nbus? Buy it didn't work so I got off the bus\nfor years... I started buying from B&N Books\n70 years old. The owner's name\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nLots of them, a lot, especially Americans expected to get rich quick, they all going just to steady pitch along ones as still here.\n\n35. Did many people move away during the 1930's? Did many return?\n\nSome not many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nrather let the other fellow\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nNever much for being the first down a new thing even today. I don't think a new hat suit of clothes or a new pair of boots, but different with the wife.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMaple Bush School came from a place which at the river that we all called the Maple Bush. Baldenhurst School was named by a family named Lundy who hailed from Ont. and therefore was called Baldenhurst Farm. Eskimo School was named after a family named Eskimos that lived in the district. Some of schools were named by my present neighbor suggesting names, and was then voted on.\nLet me have a lot of advice. Remember, I'm very rich, but I'm also very poor.\n\nSigned,\n\n[Signature]\n\n---\n\n37. If you or any member of your family have held public office, or have been active in any organization, please list them here, giving dates whenever possible.\n\n---\n\n38. How did the places in your community get their names? (School district, post offices, villages, railway stations, etc.) Try to give (1) name, (2) origin and meaning of place-name, (3) date of its adoption, (4) any changes of name since then, (5) date and reason for change. Give dates of new names above in (1), (2), (3).\n\n---\n\nMarkle School was called the Markle Church at Markle Church School. It was named after a family named Markle who lived there. The school was named by my great-grandfather, Eustace Markle, who was named after a family named Markle who lived there. The school was named by my great-grandfather, Eustace Markle, who was named after a family named Markle who lived there.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy Son Robert Douglas Bell two daughters Mae & Doris. Mrs Robert Ferguson Castleford Ont. They have three children, Douglas, Mauglin.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRailway & the Telephone and some of the greatest people in the world.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJ. E. Smith\nDr. J. E. Titley\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nR. A. Bell\nPinehurst\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n43. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren: [Names not legible]\n\n44. What do you think are the most important changes in your community since you first came here?\n\n45. Railways & the Telephone\n\nAnd some of the greatest people in the world\n\nPlease give the names and addresses of other pioneers who could answer this query.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrates Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_618.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4814, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2000, 5], [2000, 2000, 6], [2000, 3056, 7], [3056, 3922, 8], [3922, 5590, 9], [5590, 6388, 10], [6388, 8319, 11], [8319, 9336, 12], [9336, 11036, 13], [11036, 12532, 14], [12532, 14203, 15], [14203, 15176, 16], [15176, 16461, 17], [16461, 17275, 18], [17275, 17422, 19], [17422, 17576, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]