[{"id": "e788fbd7f9637a4784561f66c271f18f505581fc", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 4\nPioneer Churches.\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan _______ _______\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n(Drawing by Richard Graburn)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nPioneer Churches.\n\n1. To what religious services did you go when you first settled in your district?\n\nWhere did your neighbors go to church?\n\nHow long was it after the first settlers came to your area before services of church worship were organized?\n\n2. By whom were religious services held in your community before a regular church building? If this arrangement, tell who services were held, and give dates if possible.\n\nHow was the clergyman supported?\n\n3. Was the school house used for church services? Give dates.\n\nWas it used by congregations of more than one denomination on alternate Sundays?\n\nDid the same congregation ever support both types of services and give equal financial support?\n\nWhere did the clergyman (or clergymen) live, and how far was it from the school house?\n\nHow did he get to the school house to conduct services?\n\nWas he entertained in homes or supplied with accommodation for the night?\n\nWere services continued throughout the winter months, as well as other seasons of the year?\n\nWho put on the fire for school house services in winter?\n\nWhat other charges, or appointments, did the clergymen have besides the ones at your school house?\n\nDescribe the financial arrangements.\n\n4. Were homes or other buildings such as stores used for church services in your community?\n\nThe Church was built about 1890 of concrete. The living room foundation, the walls, and floor away, it didn't last long.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nPioneer Churches.\n\n1. To what religious services did you go when you first settled in your district?\n\nHow did your neighbors go to church?\n\n2. How long was it after the first settlers came to your area before services of church worship were organized?\n\nBy whom were religious services held in your community before a regular church became established (or a clergyman from some other place)? Give details of the arrangements, telling where services were held, and give dates if possible.\n\nHow was the clergyman supported?\n\n3. Was the school house used for church services? Give dates.\n\nWas it used by congregations of more than one denomination on alternate Sundays?\n\nDid the same congregation ever support both types of services and give equal financial assistance?\n\nWhere did the clergyman (or clergymen) live, and how far was it from the school house?\n\nHow did he get to the school house to conduct services?\n\nWas he entertained in homes or supplied with accommodation for the night?\n\nWere services continued throughout the winter months, as well as other seasons of the year?\n\nWho put up the fire for school house services in winter?\n\nWhat other charges, or appointments, did the clergyman have besides the one at your school house?\n\nDescribe the financial arrangements.\n\nMore than 50 cents fuel kindly\n\n4. Were barns or other buildings used as stores used for church services in your community?\n\nThe Church was built about 1890 of concrete. The living room foundation, the walls are gone away. It didn't last long.\n5. If you had a church building, give the date it was built. The first R.C. Church was St. Paul's 1903.\n\nWho designed the building? Who built it?\n\nWhat material was it made of? Wood\n\nHow many people did it seat? 300 St. Paul's\n\n6. Describe the steps taken in arranging for the building of the church, telling who started it, how money was secured, etc.\n\n7. How many families were in the congregation at the time of its organization? How many families were in the congregation at the time of its closing? How many families were in the congregation at the time of its closing? How many families were in the congregation at the time of its closing?\n\n8. Is this first building still in use? If not, tell why it is not used now, and what happened to it.\n\n9. When did you have a resident clergyman? 1903\n\nWhere did he come from? Grace Methodist\n\nThat provision was made for living quarters for him—a residence built, etc.?\n\n10. Did any other denomination use this church building for services? No\n\nDescribe the arrangement.\n\n11. Tell what other churches were built in your community, either before your church was built, or any time since. Give dates if possible, denomination of church, and any changes which have occurred in the place of the building—that is, if some denomination other than yours who built it is now using the church, or if it is used for some other purpose.\n\nGrace Methodist was the first church in Saugus about 1889.\n\nAre all these churches in town? If not, give distances from town, and from one another.\n\nIf not built in town, why were they not built there?\n5. If you had a church building, give the date it was built.\n\nWho designed the building? Church was St. Paul's 1903\n\nWho built it?\n\nWhat material was it made of? Wood\n\nHow many people did it seat?\n\nWhat was the name and denomination of the church? 300 St. Paul, 86\n\n6. Describe the steps taken in arranging for the building of the church, telling who started it, how money was secured, etc.\n\n7. How many families were engaged in the work? How much was raised? How much was needed? How much was left over?\n\n8. Is this first building still in use? If not, tell why it is not used now, and what happened to it.\n\n9. When did you have a resident clergyman? 1903\n\n10. Did any other denomination use this church building for services? No\n\nDescribe the arrangement.\n\n11. Tell what other churches were built in your community, whether before your church was built, or any time since. Give dates if possible, denomination of church, and any changes which have occurred in the same. If the building is still there, describe it; if not, give its location.\n\nAre all these churches in town? Yes\n\nIf not built in town, why were they not built there?\n12. Was your church established as a home mission? Describe the arrangements as to finance, student ministers, etc.\n\nIt was hard to understand how the minister lived if he didn't believe in the Lord. If families did not have a church of their own denomination in the community, all they usually go to some other church, or not attend at all?\n\n13. If families did not have a church of their own denomination in the community, did they usually go to some other church, or not attend at all?\n\nOld folks' day was held every Sunday afternoon in the home. It was a day for everyone to come together and enjoy each other's company. If there was no public religious service?\n\n14. How often and at what time were services held in the church, school or other building? Every week\n\n15. Did Laymen conduct church services when a clergymen was not available? Describe the circumstances.\n\nA Roman Catholic woman, Mrs. Harrington, did and Geo Harvey, an anglican, held the funeral service.\n\n16. Did you have an organ for the service? Yes. When played it? Every one\n\nWhen was it bought? 1870\n\nHow was the money raised for it?\n\n17. Did you have a choir? Yes. How many were in it? 25\n\nWho started it?\n\nWere any of the persons who led the choir or sang in it trained musicians? Explain.\n\nAnd was the new organ a P.S. Smith?\n\nOn the evening of the Baptist Church service, was any other kind of music or musical instruments used in the service?\n\nDescribe.\n\n18. What kind of religious instruction for the young, such as Sunday School or catechism classes, were held? Give dates when they were started.\n\nHow often were they begun?\n\nHow many children attended?\n\nWho was in charge of these and helped with the teaching?\n\nall the adults\n\n19. What organization (or organizations) was formed to help with the support of the church?\n\nWhat year was it started? 1890\n\nHow often did it meet?\n\nHow many members belonged to it? 15 or more\n12. Was your church established as a home mission?\nDescribe the arrangements as to finance, student ministers, etc.\n\nIt was hard to understand how the missionary\nwould get paid if they didn't believe there was more than one\nin the community. Did they usually go to some other church or not attend at all?\n\n13. If families did not have a church of their own denomination in the com-\nmunity, did they usually go to some other church or not attend at all?\n\n14. How often and at what time were services held in the church, school, or\nother building? Every week\n\n15. Did laymen conduct church services when a clergyman was not available?\nDescribe the circumstances.\n\na. Roman Catholic Church, Mrs. Harrington\nb. Methodist Church, Mr. Smith\n\n16. Did you have an organ? For the services? Yes\n\nWhen was it bought? 1874\nHow was the money raised for it? By subscription\n\n17. Did you have a choir? Yes\nHow many were in it? 25\nWho started it?\nWere any of the persons who led the choir or sang in it trained musicians?\nExplain. Better than New York, a P.E. college\n\n18. Was there any other kind of music or musical instruments used in the services?\nDescribe.\n\n19. What kind of religious instruction for the young, such as Sunday School or\nCatechism classes, were held? Give dates when they were started.\nHow often were they held?\nHow many children attended?\nWho was in charge of these and helped with the teaching? All the adults\n\n20. What organization (or organizations) was formed to help with the support of\nthe church?\nWhat year was it started? 1870\nHow often did it meet?\nHow many women or men belonged to it? 15 or more\n21. In what year was the first church picnic held? 1897\n\nDescribe the church picnics of early days, telling how easy it was to eat and drink, what amusements there were, changes which occurred in later years, and any other details about them which you remember. (There are questions on the Pioneer Recreation Questionnaire dealing with picnics so if you wish to give the information there, you need not repeat it here.)\n\n22. In what year was the first fowl supper or bazaar held? 1890\n\nHas it been held every year after that? Nearly\n\nWhat differences do you notice between the dishes served at the suppers in the early days and those served now?\n\nWhat differences are there in serving methods (help yourself, plates served already filled, etc.)?\n\nWhat changes are there in the price of suppers?\n\nDescribe any changes which you have noticed in the needlework offered for sale, in type of work or articles brought, those that were most popular at various times, changes in prices, or any other details which you may remember.\n\nWas a concert of some kind held in connection with the suppers or bazaars in the first years? Mostly\n\n23. Describe any other activities that were carried on to assist in raising money for the church.\n\nBoys were out as the Methodist we all against it called gambling\n\n24. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n25. Then was any plan of systematic giving for the support of the church and other expenses adopted? No, and then was adopted from apaid many of the ministers' salaries\n\nOf what nature, - weekly envelopes, etc.\n\nTheir meals\n21. In what year was the first church picnic held? 1837\n\nDescribe the church picnics of early days, telling how many attended, what you had to eat and drink, what amusements there were, changes which occurred in later years, and any other details about them which you remember. (There are questions on the Pioneer Recreation Questionnaire dealing with picnics; so if you wish to give the information there, you need not repeat it here.)\n\n22. In what year was the first fall supper or bazaar held? 1840\n\nWas it held every year after that? Yes\n\nWhat differences do you notice between the dishes served at the suppers in the early days and those served now?\n\nBetter than before\n\nWhat differences are there in serving methods (help yourself, plates served already filled, etc.)?\n\nWhat changes are there in the price of suppers?\n\nDescribe any changes which you have noticed in the needlework offered for sale. In type of work or articles brought, those that were most popular at various times, changes in prices, or any other details which you may remember.\n\nHer needle work can compare with later dates, thus work master piece\n\nWas a concert of some kind held in connection with the suppers or bazaars in the first years? Yes\n\n23. Describe any other activities that were carried on to assist in raising money for the church.\n\nBoys were out as the Methodists we all against it called gambling\n\n24. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n25. Was there any plan of systematic giving for the support of the church and clergyman adopted? No real plan was adopted\n\nOf what nature, - weekly envelopes, gifts, apaid many of the ministers salaries\n\nWhen meals\n26. What interest or activity was there in the support of home missions?\n\n27. How far did some of the people have to travel to church services?\n\n28. What means of travel was used?\n\n29. Were there special revival or mission services in the early days? Describe.\n\n30. What arrangements were there to provide for the training of the clergy?\n\n31. What differences did you notice in church life on the prairies as compared with the community you came from?\n\n32. To what extent did the social life of the congregation centre around the church service (held in the church, school, or other building) in the early days?\n\n33. Is the church as important a place now of people gathering together for companionship and sociability as it was in the early years?\n\n34. Is the first membership roll of your church still in the community?\n\nIf you can, give the name of the person who has it.\n\nDo you have any pictures or photographs of your earliest church or of homes where the first services were held? Or do you know of anyone who has such pictures?\n\n35. Describe any special features or unusual influences of pioneer churches or anything connected with it which you found interesting. (Use other sheets, or back of this sheet if necessary.)\n26. What interest or activity was there in the support of home missions? Foreign missions. I have heard of them.\n\n27. How far did some of the people have to travel to church services? 7 miles.\n\nThat means of travel was used? Horse.\n\n28. What nationalities were represented in the congregation, and in approximately what proportion?\n\nAll were represented all nations.\n\n29. Were there special revival or mission services in the early days? Describe.\n\n30. What arrangements were there to provide for the training of the clergy?\n\n31. What differences did you notice in church life on the prairies as compared with the community you came from?\n\nWe all behaved as one of the old times were sent to fail only one and he got you for playing a trick on his neighbor.\n\n32. To what extent did the social life of the community centre around the church services (held in the church, school or other building) in the early days?\n\n33. Is the church as important a place now of people gathering together for companionship and sociability as it was in the early years? Explain.\n\nYes.\n\n34. In the first membership roll of your church still in the community? If you can, give the name of the person who has it.\n\nDo you have any pictures or photographs of your earliest church or of homes where the first services were held, or do you know of anyone who has such pictures?\n\n35. Describe any special features or unusual incidents of pioneer churches, or anything connected with it which you found interesting, not already mentioned.\n\n(Use other sheet(s), or back of this sheet if necessary.) Write the print with a pen.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3510.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4356, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1254, 5], [1254, 1254, 6], [1254, 2715, 7], [2715, 4273, 8], [4273, 5849, 9], [5849, 6984, 10], [6984, 8889, 11], [8889, 10502, 12], [10502, 12178, 13], [12178, 13942, 14], [13942, 15170, 15], [15170, 16769, 16], [16769, 16924, 17], [16924, 17087, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false]}}]