[{"id": "1e01ac7c5a75b6220f79890f1e32d2bb98d076cd", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name Mrs. Richard (Lillian) Miles\n\nPresent Address 5124 Dewdney Avenue, REGINA, Saskatchewan.\n\nPioneer Address Edenwold, Saskatchewan.\n\nYear you came to Saskatchewan Born at Edenwold on Oct. 26th, 1886\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPlease print name and address in capital letters.\n\nYour full name: Mrs. Richard (Mrs. Richard)\n\nPresent Address: 524 Diefenbaker Avenue, Regina, Saskatchewan.\n\nPioneer Address: Ridgeway, Saskatchewan.\n\nYear you came to Saskatchewan: Born at Edmonton on Oct. 26th, 1886.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that only one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received June 9, 1965]\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? There were about 12 homes in our district where we visited back and forth. How many of these were bachelor's homes? No bachelor homes.\n\n2. How often did you usually visit neighbors? Usually on Sunday following Church, or sometimes during the week, particularly if someone was ill or in need of other help.\n\n3. Did you usually visit on a Sunday, or other days? On Sunday mostly.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? People never invited anyone in the early days. People just called in and accepted food or other things as the family were able to supply. People were always pleased to see each other and never worried about anything as formal as an invitation. What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Usually visited in the morning - had dinner with the family and left for home about 4 p.m. in the afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, a meal was always set for visitors if the proper time presented itself. It was quite customary that people stay for dinner, with friends or relatives.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?) As mentioned above everyone was so pleased when visitors came no thought was ever given to whether or not they would stay for a meal - it was just done automatically and without invitation. We ate whatever the family of the house was going to eat - no extras were provided in any way.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? None. If you did not have time to eat a meal with the family - no other refreshment was served.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? When the children of the family were all small they all went with their folks, but as we grew older we usually visited families who had grown up children our own age and less went out separately.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to sew a building, make quilts, or other such activity? Yes we did, and they were usually a good excuse for the community to get together and although we worked hard there was much fun and good fellowship.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. In the winter months we had \"bees\" mostly attended by women who would card and teaze wool and slice feathers for making of cushions, rugs, etc. Sometimes men would attend and would be employed at plucking of the geese. Usually a lunch of bread, buns, butter, and coffee was served. Of course we had \"building bees\" and helped each other in building of houses, barns, etc., along the same lines, the work here being done mostly by men and the women would supply the lunch.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. No, not for our particular family. We were of Baptist Church faith which did not allow us to take part in very many parties etc., just purely socials with perhaps singing and children's games.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? As mentioned above most of our visiting was done on Sunday and we tried to visit a different family each Sunday.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPIONEER RECREATION AND SOCIAL LIFE.\n\nRECREATIONAL VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? There were about 12 houses in our district where we visited back and forth.\n\nHow many of these were bachelor's homes? No bachelor's homes.\n\n2. How often did you usually visit neighbors? Usually on Sunday following Church, or sometimes during the week, particularly if someone was ill or in need of other help.\n\n3. Did you usually visit on a Sunday, or other days? On Sunday mostly.\n\n4. Were you often invited to other homes, or was not visiting done without an invitation? People never invited anyone in the early days. People just called in and accepted food or other things as the family were able to supply. People were always pleased to see each other and never worried about anything so formal as an invitation the afternoon, etc.? Usually visited in the morning - had dinner with the family and left for home about 4 p.m. In the afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? Yes, a meal was always set for visitors if the proper time presented itself. It was quite customary that people stay for dinner, with friends or relatives.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to take \"proluck\" used, or was some other expression common?) It was mentioned above everyone was so pleased when visitors came no thought was ever given to whether or not they would stay for a meal. It was just done automatically.\n\nDid you ever have \"house parties,\" or other such activity? Yes we did, and they were usually a good excuse for the community to get together and although we worried hard there was much fun and good fellowship among the guests.\n\nTell us how you spent your free time and how often they occurred. In the winter months we had fires, what we now call \"fire parties.\" We would card and tease wool and make festivities for ourselves, mostly attended by women who would attend and would be employed at spinning or knitting, etc. Usually a lunch of bread, bun, butter, and coffee was served.\n\nOf course, we had \"building bees\" and helped each other in building of houses, barns, etc., along the same lines; the work here being done mostly by men and the women would just purely socialize with perhaps singing and children's games.\n\nIn the earliest years that you were here, were there many parties, supply the lunch of Baptist Church faith which this not allow us to take part in very many parties etc., drives or dancing in homes? Describe. No, not for our particular family. We were just purely socialize with perhaps singing and children's games.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.? As mentioned above most of our visiting was done on Sunday and we tried to visit a different family each Sunday.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nWe had our Sunday School Christmas Tree in the school house, and had our picnics in the school grounds.\n\nHow much of your social life was centred around the school, and within the school district? Describe. All of our social life emanated from our Church (Baptist) but the functions of necessity had to be held in the school building.\n\n9. When was your first community hall built? never had one while we lived at Edenwold.\n\nWhat material was it made of? - How large was it? -\n\nWho built it - the community through special funds, the municipality, some organization, etc.? -\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes, we would all go.\n\nHow were babies and small children provided for?\nThey were just put to bed on cots, beds, tables, or anything that was handy.\n\nHow were horses sheltered and fed in the winter time at these parties?\nsheltered and fed in sod or log built stables\n\n11. What card games were popular in the early days?\npedro, poker, whist, cribbage and black-jack\n\nWas there card playing for a prize? No - never gave prizes for anything in the early years - the honor was sufficient.\n\nWhat dances were popular?\nQuadrilles mostly, although we had polkas, two-steps and the waltz\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. There was no actual disagreement, but we were not allowed to dance because of our Baptist Faith. Later years when Lutherans began to settle there they had dances but we were not allowed to attend them.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. In our particular community a lot of people frowned on card playing because practically all the families were of Baptist Faith and this religion would not allow the playing of card games.\n2. Tell what was made of the school house for community dances, box socials, etc., other activities. (Include also the school Christian tree, piano, etc.)\n\n8. Tell what was made of the school house for community dances, box socials, etc., other activities. (Include also the school Christian tree, piano, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe. All of our social life emanated from our Church (Baptist), but the functions or meetings had to be held in the school building.\n\n10. When was your first community hall built? We've had one while we lived at Edinboro.\n\nWhat material was it made of? How large was it?\n\nWho built it? The community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the village, did you continue to use the local school house for district gatherings and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n11. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes, we would all go.\n\nHow were babies and small children provided for? They were just put to bed on cots, beds, tables, or anything that was handy.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n12. What card games were popular in the early days?\n\nWas there card playing for a prize? No - never gave prizes for anything in the early years - the honor was sufficient.\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. There was no actual disagreement, but we were not allowed to dance because of our Baptist Faith. Later years when Lutherans began to settle there they had dances but we were not allowed to attend them.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. In our particular community a lot of people frowned on card playing because practically all the families were of Baptist Faith, and this religion would not allow the playing of card games.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? There was nothing at all like this in my day. We were all poor pioneers and could not be bothered with so called \"swank\" nor did we have the money to carry it out.\n\n13. Was the chivaree known in your community? Yes, and quite a popular affair. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. If the particular couple were well liked they were always \"chivareed\". The families would all go - take them gifts and supply the lunch, and then we would wind up with a dance in their new home (usually built by the people of the community).\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. Usually the week prior to Christmas we visited around all during that week. The old folks would sit around and tell ghost stories or other stories which had been told to them when they were growing up \"in the old land\". The young people would play games at these gatherings and possibly sing some of the hymns and songs from the \"old land\".\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The first organization we had of any kind in our community was a syndicate for a threshing machine (Minneapolis-Moline) by the man. Give the date and reason for it being organized. It was organized to purchase the Threshing machine for threshing and grinding wheat for flour, whole wheat, grits, chop and feed. There was a chooper with the threshing machine which was operated by 6 horses going round in a circle turning a machine with long 12 foot arms on it. A man stood in the middle with a whip and kept the horses going 'round. This turned the chopping machine.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"awkward,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting treated ceremonially in parlor, etc.? There was nothing at all like this in my day; we were all poor farmers and could not be bothered with so called \"formalities\" nor did we have the money to carry it out.\n\n13. Was the obivaree known in your community? Yes, and quite a popular affair.\n\nDescribe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes were visited around all during that week. The old folks would tell stories which had been told to them when they were children, possibly sing some of the hymns and songs from the \"Old Land.\"\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The first organization we had of any kind in our community was a syndicate for a threshing machine (Minneapolis-Honey) by the name of...\n\nGive the date and reason for it being organized. It was organized to purchase the threshing machine for threshing and grinding wheat for flour, whole wheat, grits, chop and feed. There was a chopper with the threshing machine which was operated by 6 horses going round in a circle turning a machine with Long 12 foot arms on it. A man stood in the middle with a whip and kept the horses going round. This turned the chopping head in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? If so, when was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible, about 1900\n\nWho provided the lantern and the slides? One of our neighbors had a lantern and some slides\n\nWhat were the slides about? Most of the slides as I recall were pictures of famous buildings and sights in some of the larger cities such as London, England, and Paris, etc.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball, pussy wants a corner, skipping rope, made kites out of paper, drop the handkerchief, and we had a swing made by our parents, and we loved to play school and house, hide and go seek, blind man's buff, and touch wood\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Same as the boys - played together well.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible, about 1900\n\nWho provided the lantern and the slides? One of our neighbors had a lantern and some slides\n\nWhat were the slides about? Most of the slides as I recall were pictures of famous buildings and sights in some of the larger cities such as London, England, and Paris, etc.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Ball, pussy wants a corner, skipping rope, made kites out of paper, drop the handkerchief, and we had a swing made by our parents, and we loved to play school and house, hide and go seek, blind man's buff, and touch wood\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Same as the boys - played together well.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   Sledding mostly in the winter months\n   What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? We would play the games we got for Christmas; what are you taking to the farm; string and a ring; button-button; and card games.\n\n   Did the whole family join in such games, or only the children? Explain.\n   The younger people played the games, but the older people not very much\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. The very small children always played games, but as soon as we were old enough to do our share of the work, we had to mix our work with our pleasure.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n   When I was a child we spent many hours catching gophers and trying to tame squirrels. We made daisy chains and located bird nests but never destroyed anything. When there was wild fruit to be picked we did this - saskatoons, cherries, strawberries, raspberries and gooseberries.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n   Give year and month if possible. about 1892\n\n26. Who organized it? Our Baptist Church Sunday School.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n   It was organized for the whole community.\n\n28. Was it the first picnic held in the community? It was the first one I can remember\n   If not, do you know the date of the first one that had been held? Possibly from the time we settled there in 1886.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n   mostly races and a ball game\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Each family would take what they could for food; everything was spread on white table cloths on the grass in a long row, and everyone would sit down together and eat. There were no groups or cliques of people going off on their own to eat in those days.\n\n31. What did you have to eat and drink?\n   Eggs, green onions, various fancy breads & we milk and coffee\n\n32. What time of the day did it start, and how long did it last?\n   The picnic usually started immediately following the Sunday morning Church Service and last through till about 4 in the afternoon when people had to return to their homes to attend the livestock etc.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nSledding mostly in the winter months. Games were played indoors in winter - card games such as marbles, \"whist,\" \"whack-a-mole,\" or other games. We would play the games we got for Christmas; what are you talking to the family? string and a ring; button-button; did the whole family join in such games, or only the children? Explain.\n\nThe younger people played the games, but the older people not very much.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. The very small children always played games, but as soon as we were old enough to do our share of the work, we had to stick our work with our pleasure.\n\n24. Did children have games connected with such things as buffalo bones, arrowheads, fishhooks, or other objects or animals? If so, explain. In the snow, we made daisy chains and located wind nests but often didn't get anything; there was wild fruit to be picked; we did this - melon, cherries, strawberries, raspberries and gooseberries.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nOliver year and month if possible; about 1922\n\n26. Who organized it? Our Baptist Church Sunday School.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? It was organized for the whole community.\n\n28. Was it the first picnic held in the community? If so, explain. It was the first one I can remember.\n\nIf not, do you know the date of the first one that had been held? (Correctly from the time we settled there in 1886.)\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Mostly races and a ball game.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Each family would take what they could for food; everything was spread on white table cloths on the grass in a long row, and everyone would sit down together and eat. There were no crowds or cliques of people going off on their own to eat in those days.\n\n31. What did you have to eat and drink? Waste bread, butter, and milk.\n\n32. What time of the day did it start, and how long did it last? The picnic usually started immediately following the Sunday morning Church Service and lasted through until about 4 in the afternoon when people had to return to their homes to attend the livestock etc.\n33. Describe any features of this picnic which you remember as outstanding.\n\nI think the feature of these picnics which I remember as being outstanding is the companionship and sociability of the people. They would always be talking and laughing and sharing each other's sorrows and joys. Everyone was reasonably poor and in this regard there could be no class distinction. Everyone was truly interested in each other's welfare.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nOur picnics were always organized by the Church Sunday School and were always a community effort.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI believe I have stated this change in my answer to question number 33.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe younger children of the families were really the only ones who had much time for recreation, and of course they just played the usual children's games mentioned in a previous question.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n23. Name the features of this picnic which you remember as outstanding.\n\nI think the features of these picnics which I remember as being outstanding in the early days were the large community picnics, school or Sunday School Picnics, usually held in the summer, where each child could bring food and drinks, and everyone was interested in each other's welfare.\n\n24. Describe the different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School Picnics, usually food and drinks, when balls, etc.\n\nOur picnics were always organized by the Church Sunday School and were always a community effort.\n\n25. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nI believe I have stated this change in my answer to question number 33.\n\n26. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe younger children of the families were really the only ones who had much time for recreation, and of course they just played the usual children's games mentioned in a previous question.\n\n27. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n28. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against local teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n29. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Not till about 1903.\n\nDid it grow out of or replace the earlier community picnics? I would say it replaced the earlier community picnics.\n\nWho was responsible for starting the first sports day? The Community\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st), in accordance with July 1st usually—or at least closer to that day than any other.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nThe Bibles was the only book brought to this country by my folks.\n\n43. How many of your neighbors brought books with them? They too, just brought the Bible. What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\nNo, we did not—never had the money to do so.\n\n46. What books were sent to you as gifts in early years? None that I know of.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes in later years. When was it begun? Don't recall.\n\nTo what extent were books borrowed from the school library for adults to read at home? We only had about a dozen books and were not allowed to take them home. Our folks could not read the English language, and it was only when the school children arrived at the age when they could read English could we make use of these books.\n\n49. Did parents ever use their children's school text books as additional reading material? No, they could not read English.\n10. What did an annual sports day become established in your community? (Give details)\n\n11. Did it grow out of or replace the earlier community plant? If so, why?\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held (what month, or any special day, such as May 24th or July 1st)? In accordance with what, if any, local custom?\n\nWas there any from your community who have become members of well-known honorary hall of fame?\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.)\n\nThe Bible was the only book brought to this country by my folks.\n\n43. How many of your neighbors brought books with them? They too, just brought the Bible.\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\nNo, we didn't - never had the money to do so.\n\n46. What books were sent to you as gifts in early years? Name that I know of.\n\n47. Have you ever had any travelling library books in your community or school?\n\n48. Was there a school library? Yes in later years. When was it begun? Isn't recall\n\nTo what extent were books borrowed from the school library for adults to read at home? He only had about a dozen books and were not allowed to take them home. Our folks could not read the English language, and it was only when the school children arrived at the age when they could read English could we make use of these books.\n\n49. Did parents ever use their children's school texts books as additional reading material? No, they could not read English.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it\n   contained, how many people used it, where it was kept, who acted as librarian,\n   and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west? We subscribed to a newspaper which was published in Regina in the German\n    language called \"Der Courier\". This was read by our parents.\n    Then we had another German paper from Winnipeg which we received through the\n    Baptist Church called \"Sentbode\" (I'm not sure of the spelling of this)\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material? No.\n    Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain. Yes we did find a lack of reading\n    material a hardship once we children knew our to read the English language.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian,\nand what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\nthe west? We subscribed to a newspaper which was published in Regina, in the German\nlanguage called \"Der Vorort,\" which was read by our parents.\nThen we had another German paper from Germany, which we received through the\nBaptist Church called \"Guthook\" (I'm not sure of the spelling of this)\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\ntain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\nmaterial? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your\nearly days in the west a hardship? Explain. Yes we did find a lack of reading\nmaterial a hardship once we children knew our to read the English language.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? just the accordion\n\n57. What instruments did any of your neighbors have? just the accordion\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\naccordion, organ, violin and Otto harp - but can't remember any details about them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\nEveryone seemed to be very fond of music - instrumental and singing and these played a very large part in the entertainment of those early years. Each time we got together we could have some musical entertainment - singing the old folk songs and hymns in particular, in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\nfolk songs and hymns\nin the community?\nfolk songs and hymns\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\nYes it was very popular - we sang the old folk songs enumerable times.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\nYes we did, but I can't recall any of them now.\n\n63. Was there a band in your community? No. When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Just the accordion.\n\n57. What instruments did any of your neighbors have? Just the accordion.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Accordion, cymbals, violins and other harps — but can't remember any details about them.\n\n59. How large a part did singing and other forms of music play in your entertainment in early years in the West? Describe.\n\nEveryone seemed to be very fond of music — instrumental and singing and these played a very large part in the entertainment of those early years. Each time we got together we would have some musical entertainment — singing the old folk songs and hymns in particular. We would have musical concerts, was there group singing at parties, etc., describes.\n\n60. What were some of the favorite songs in the home?\n\nFolk songs and hymns\n\nIn the community?\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\nYes it was very popular — we sang the old folk songs enumerable times.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. Yes we did, but I can't recall any of them now.\n\n63. Was there a band in your community? Who started it? When was it started? How long did it continue?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? I feel that music plays just as important a part in our lives today as it did in the early days. There are many more opportunities for people today to be taught the different instruments, and we still have our musical festivals, concerts of variety, etc., and everyone seems to enjoy them.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No we did not.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. We always took notice of these things, but no actual record was ever kept.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nWe used to make beads out of colored paper (usually colored pages from the catalogue) and string them on a string. We also made beads out of the silver willow tree seeds. We boiled the seeds until they were soft - remove the skins and use the little nuts inside. We would string these nuts on a thread - let them dry - and then varnish them.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nWe used to have a lot of box socials in connection with the dances when I was old enough to attend. The young girls of the community would make a box and fill it as best she could with a tempting lunch. The young men would gather together and these boxes would be auctioned off. The man making the purchase would eat the lunch with the girl who supplied it and they would be partners for the evening.\n\nOn occasion the whole community would enter into a \"spelling Bee\" - there would be no prize given, but the honor was very acceptable.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? I feel that music plays just as important a part in our lives today as it did in our early days. There are many more opportunities for people today to be involved in different activities, and we still have our musical festivals, and still seem to enjoy them.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, did not.\n\nGive details of this collection, telling when you started it, how you became interested in it, buy, sell, trading events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? If so, did not.\n\nWe always took notice of these things, but no actual record was ever kept.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nWe used to make heads out of old creel paper (usually) colored papers from the catalogue) and string them on a string. We also made nests out of the silver willow tree seeds. We rolled the seeds until they were soft - remove the shell and use the little nut inside. We would string these nuts on a thread - 25 to 30 feet long - and then varnish them.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page) or extra sheets if necessary.\n\nWe used to have a lot of box socials in connection with the dance when I was old enough to attend. The young girls of the community would make a box and fill it as best she could with a tempting lunch. The young men would gather together and these boxes would be auctioned off. The man making the purchase would eat the lunch with the girl who supplied it and they would be partners for the evening.\n\nOn occasion the whole community would enter into a \"spelling Bee\" - there would be no prize given, but the honor was very acceptable.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1886_1920.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 11056, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1307, 5], [1307, 2542, 6], [2542, 6234, 7], [6234, 9303, 8], [9303, 11958, 9], [11958, 14429, 10], [14429, 17062, 11], [17062, 19095, 12], [19095, 20813, 13], [20813, 22530, 14], [22530, 25198, 15], [25198, 27707, 16], [27707, 29650, 17], [29650, 31461, 18], [31461, 33374, 19], [33374, 35097, 20], [35097, 36477, 21], [36477, 37799, 22], [37799, 39521, 23], [39521, 41210, 24], [41210, 43591, 25], [43591, 45961, 26], [45961, 45961, 27], [45961, 46115, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]