[{"id": "c53a0cd0a254e32510a477d5e3d7e203f57d7cca", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nHawkes, Evert\nGlenside.\n\nTo Sask. - June, 1882.\n\nGENERAL EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE READER\n\nIt is difficult to prepare a general questionnaire on Pioneer Life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about having blank spaces appear in the answers of your form. If there is anything you feel should be included, let us know by writing the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Diet: West End Western Canada,\" has been completed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nOne will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaire items\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer religion and churchwork\n- Pioneer education and experience\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Everett Hawker\n2. Your address: Glencairn, Sask.\n3. Date: March 14, 1952\n4. Where were you born? (Give name of place and country): Ruthran, Ont.\n5. What was your father's name and occupation? David Hawker, Farmer\n6. When did you come to Saskatchewan? (Give month and year): June 1, 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ruthran, Ont.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). I was 2 years old\n9. What were your reasons for coming West? Came with my parents hearing about the great opportunities\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). I expect they read about it\nDavid Hawkes\nFormer\n\nMarch 18, 1942\n\nRuth\n\nWhat was your father's name and occupation?\n\nWhen did you come to Saskatchewan? (Give month and year) 1882\n\nMention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n\nPathway out\n\nIf you are a year old\n\nHaving about the great opportunities\n\nIn how did you learn about the West? (Through other people? Reading about it)\n\nI expect they read about it\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought it was a great adventure.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Family\n\n13. What means of transportation did you use?\n   The family came by train all the way. My father came as far as Brandon by train and from there by ox team.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   I don't remember. I was only two years old, most of this information is from my parents talk about it.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Moose Jaw\n\n16. Where did you settle or take up land?\n   Caron\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Eskbank\n   Glenside\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   After I grew up I farmed. I bought land when I was 16 years old, and farmed for 12 years. Then I was in the mercantile trade for 12 years and have farmed since that.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was a great adventure.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nFamily\n\n13. What means of transportation did you use?\n\nTrain all the way my father came as far as Brandon by train and from there by ox team.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\nI don't remember it was only two years old most of this information is from my parents talk about it.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nChurch hall\n\n16. Where did you settle or take up land?\n\nCaron\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nEstherville\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAfter I came I farmed I bought land when I was 16 years old and farmed for 11 years then I was in the mercantile trade for 11 years and have farmed since then.\n19. How often did you write to relatives or friends in your old home?\n   They corresponded quite frequently.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n    Bella Bell in 1904 Jan 6 at Boham\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n    just three or four families\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n    they all came in 1882 7 sisters & 5 brothers\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    I can remember they had to pick buffalo bones off the land before they could break it. They were so many they sold them for $70 a ton.\n    There were lots of Indians with old red river carts looking bones to about the time of the Reil rebellion.\n    They transported supplies to the army right past our place.\n    There were lots of other things if I could remember them.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n    We used to travel around the country quite a little usually by oxen later we got horses.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI can remember this road to Pick Buffalo Boreas. They sold them for $5 per ton. They were lots of Indians with old red river carts. Rocking horses to about the time of the Red Rebellion. They transported supplies to the army right past our place. They were lots of other things if I could. Remember these.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe used to travel around the country quite a little usually by oxen. Later we got horses.\n25. When was the first car used in the community? about 1906 or 7\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   I bought a close car in 1913\n\n27. Where was your trading center? How far from your home?\n   at first it was more than 20 miles away, later it was closer 3 miles away\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   we traded there for many years, it got to be a little village where you could get most all goods you needed\n\n29. How often did you shop in the early days? about once a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   about 1900\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   I think it was about 1900\n   the articles usually were things that could not be obtained in our local stores such as wearing apparel the percentage would be very small\n\n32. When did you first have a telephone and what company provided it?\n   in 1909 Bell Telephone I think\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   My Father came here with the intention of making it a permanent home\n25. When was the first car used in the community? about 1906 or 7\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. How far from your home? (Indicate any changes due to new townships.)\n\n28. Did you continue to trade there? (Indicates any changes due to new townships.)\n\n29. How often did you shop in the early days? about once a month\n\n30. When did people in your district first start going to town regularly? on Saturdays about 1900\n\n31. When did you first begin to buy through the mail order catalogs? (What kind of articles did you buy in this way? Indicate also what was purchased next year.) Purchases were by mail order and any charges in town.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of starting permanently? Or did you make up your mind at that time to make this decision?\n\nMy father came here with the intention of making it a permanent home.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few families went back to Ontario about 1889 just couldn't make a go of it, odd ones came back later.\n\n35. Did many people move away during the 1920's? Did many return?\n\nThere were quite a number, some came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was on the rural municipal council no. 284 for 10 years from 1939 to 1949.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy oldest brother was the first man to use Blue Stone for treating wheat for smut in 1891. I was the first one to use a disc plough in our district in 1899.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. If you have any information about a family that moved back to Ontario about 1889 you could make a note of it and come back later.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here. Give dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here. Giving dates wherever possible. (Such as owning the first automobile, building the first school, etc.)\n\nAny oldest brother was the first man to sell Blue Stone for building material for smelt in 1891\n\nBlue Stone for building material for smelt in our district in 1891\n\n38. How did the places in your community get their names? (Check all that apply.) Post offices, villages, railway stations, creeks, hills, etc., may be given. (1) Name and occupation of person suggesting place-name (2) Date of its adoption (3) Any changes in names since then (4) Date and reason for change. Give dates or new names as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nwe have 4 children & Boys & 2 Girls + one Grandchild\nthe Boys are David & Howard, they Both live at\nAtikokan Ont and are Carpenters. Dorothy too\nis a housewife in Vancouver BC. Jessie housewife in\nCampbell River BC. Grandchild Ruby living with\nParent in Vancouver going to school\n\n41. What do you think are the most important changes in your community since you first came West?\n\nthe modern method of farming & transportation\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI do not know of any real old pioneer in this district\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nTell you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatchewan?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nThe Boys are David & Howard (both live at Attikotan Out and our Cashen's. Possibly the latter will be going to school in Vancouver. Ruby living with Campbell Rider Be Groundfield Ruby living with\n\nThat do you think are the most important changes in your community since you first came here?\n\nThe modern method of farming + transportation\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nI do not know of any old old person in this district.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign it.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_372EvertHawkes.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4688, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1975, 5], [1975, 3898, 6], [3898, 4870, 7], [4870, 5307, 8], [5307, 6452, 9], [6452, 7544, 10], [7544, 8841, 11], [8841, 9901, 12], [9901, 11430, 13], [11430, 12408, 14], [12408, 13753, 15], [13753, 14852, 16], [14852, 16262, 17], [16262, 17238, 18], [17238, 17326, 19], [17326, 17480, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]