[{"id": "b7e4bf9a93d688e4ffcd73044149483afc005660", "text": "Hunt, Andrew Cass\nWisconsin.\n\nTo Sacks - April, 1953.\n\nPARACHUTE ORIENTAL QUESTIONNAIRE\n\nNo. 2\nPARACHUTE ORIENTAL: A GENERAL QUESTIONNAIRE\nA LIST OF ORIENTALITIES IN THE PARACHUTE ORIENTAL FAMILY\n\nIt is difficult to acquire a general understanding of parachute orients because no individual can be asked to answer it in exactly the same way. Some of the questions here will not apply to your experiences; others may prove important for you to answer; so don't worry about having blank spaces. If there are things which you feel should have been included, please let us know.\n\nThis questionnaire is intended for persons who lived in Montana (or other place) and may be interested in learning more about their personal experiences or the parachute oriental family.\n\nIf you have any questions about the family or answers to the questions, they should be sent to the appropriate address or reply to a separate questionnaire.\n\nNotes:\n\nInstructions: Answer all questions on this form. If you have any questions about the instructions, please put them on a sheet of paper.\n\nSignature: Signature: ____________________________\n\nDate: ____________________________\n\nInterpretation of Questionnaire:\n\nAll questionnaires will be preserved in the Smithsonian Institution's Division of Anthropology. The information contained herein is not intended for publication except as part of the personal records of the respondents. Please keep your completed questionnaire for your own use.\n\nSmithsonian Institution,\nWashington, D.C.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... Andrew Cass Hunt ...\n2. Your address ... Mooseminn Sask., formerly Wanda ...\n3. Date ... April 23rd 1952 ...\n4. Where were you born? (Give name of place and country) ... Lancaster, Gregory Co., Ontario Canada ...\n5. What was your father's name and occupation? ... William Duncan Hunt ...\n6. When did you come to Saskatchewan? (Give month and year) ... April 15th 83 ...\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ... Ontario Dec. 77 till April 83 ...\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). ... five years ...\n9. What were your reasons for coming West? ... Parents came ...\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ...\nHunt Andrew Cass\nMontreal\n\nTo Bank - April 13, 1923.\n\nPIONEER SETTLEMENTS: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Hunt Andrew Cass\n2. Your address: Montreal, Quebec, formerly Montreal\n3. Date of arrival: March 15, 1907\n4. Where were you born? Ontario, Canada\n5. What was your occupation before coming to Canada? Farmer\n6. Which did you come to Saskatchewan? (Give month and year)\n   October 15, 1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Ontario, June 7 till April 89.\n8. How old were you when you first came to Western Canada? (You do not need to keep same this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. That were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   family\n\n13. What means of transportation did you use?\n   railroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   We spent eight days on Colonist Train made up of cars of settlers effects with two coaches at the end for crew and passengers. Father said train just moved on when railway had nothing else to do. Remember crossing Detroit river and stop in Chicago, eight hours long stop at St. Paul, remember high bridge and large river. No memory of other stops. Father lost calf jumped from car at feeding time just when train was starting wired back from next station but no word of stay split. Father shared car of effects with Keiths going to Broadview.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Con. on just paper\n\n16. Where did you settle or take up land?\n   South west of se 24 T 13 R west second mer.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\n13. What means of transportation did you use? railroad\n\n14. What thoughts or feelings do you have about your journey? (People you met on the way, weather, scenery, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nRailroad would not allow car to be sidetracked at Mosomin for father to unload his end so he had to go on to Broadview and have his share shipped back to Whitewood for sidetrack unloading. From there took livestock to homestead and came to Mosomin with team and wagon for us.\n\nI do not know how long we were in the station, but after night people by the name of Sullivan came and took us to their home.\n\nWe left Mosomin for homestead parents and eight children in wagon with some household effects. Remember crossing the Pipestone by ferry. Father paid one dollar and twenty-five cents for crossing fee.\n\nDo not remember the end of journey, woke next morning in bed on the floor.\nRailroad would not allow us to be violent about it. We had to wait for the train to go back to Broadview and have our share of the load. We traveled by oxen to homestead land and came to Montana with team and wagon for us.\n\nWe left Montana for homestead and took us to their home. Parents and eight children in wagon with some household effects. Remember crossing the Missouri by ferry. Father paid five cents one dollar and twenty-five cents for crossing fees.\n\nDo not remember the end of journey. Write next morning in well on the floor.\nCame west in 1882, was in Winnipeg at the time of the 82 flood. Came to Brandon when it was the end of the railway. Came from Brandon with oxen and wagon hunting for homestead above danger of floods.\n\nHe chose the place, broke a field, built a log house and stock stable, returned east in autumn.\n\nReturned the following year.\ncame out in 1882, was in Minnesota at the time of the first flood came to Brandon where it was the end of the railway. Came from Brandon with oxen and wagon heading for Normal Road, also on branch of railroad.\n\nHe came over the river, built a cabin, started a log house and finished. Worked, returned east in 1903.\n\nAll Indians following soon. Returned the following year.\n19. How often did you write to relatives or friends in your old home?\nDid not write.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nI was married to Ann Sophia Cotton in Earlswood Church on June 8th 1910.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nNo\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nBrothers all settled in district\nSisters all married in district\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nAn Indian family from Fort Ellis used to go to Morse Mountain to hunt in the fall and used to call at our house. One time the man asked to buy some flour. Mother said she could not spare any. The flour was in sight, the Indian woman threw the little one to her back, pointed at the flour and slammed out of the house. The flour evidently looked larger to her than it did to mother.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nThe first church services were held in the homes, but in the fall of 1885 the Presbyterian Church then called South Church, later Earlswood, was built. As schools were built places without churches held services in schools.\n17. How often will you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nThe first Church across the railroad was finally held but not the fall of 1985. The railroad was without church held south Church was built where without church held our schools in schools.\n25. When was the first car used in the community?\n   In Moorowin in 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n   Moorowin, approximately miles north, thirty-three miles\n   Water Kelso eleven ... Wandra nine\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n   Until light buggies became common shopping was generally\n   done for weeks ahead. As cars came in trips to\n   visit villages more often.\n\n30. What (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   In 1911 the Farmers Telephone Co. was organized and\n   built by farmers of the area and our phone\n   was on hard wire.\n\n33. When you came to Karratha was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n27. There was your trading post near the Wondura mine.\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing.)\n\n29. How much money did you make from trading?\n\n30. What kind of goods did you buy in this way? Indicate also what fraction of your total purchases by mail order came from the proprietor of purchases made by mail order during the pioneer period.\n\n31. What (if any) did you first begin to buy through the mail order catalogs?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases by mail order came from the proprietor of purchases made by mail order during the pioneer period.\n\n33. When you did begin to buy through the mail order catalogs, did you make up your mind at once or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nOne man moved to Missouri, two to Nebraska set up implement business. One sold out to go to southern California. But most movements were to second homesteads.\n\n35. Did many people move away during the 1920's? Did many return?\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nJust School Trustees.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nIn 1884 Ding Brothers and father had first binder; Father drove binder and cut crops for others at one dollar an acre.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nThe Harris hills so named because the four nearest settlers were from Harris Scotland.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\nOne man moved to work in the oil fields in California.\n\nBut most movement was to leave the homesteads.\n\n35. Did any people move into your district prior to 1927? What reasons did they have for moving?\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district while still being organized, mention it here.\n\nOne of the first school boards and fathers' hall presidents.\n\nFather drove horses and built a shop for them.\n\nAt one dollar an acre.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name; (2) date in which name was given; (3) date and reason for change.\n\nThe Harvey Hills to honor Harvey Harvey.\n\nThe Scottsboro area from Harriett Scott.\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (Indicate your preference, if any) ..............\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\nAlexander Hunt Winnipeg, Chartered accountant\nPhillip Duncan Hunt Kelso Sash. farmer\nBarbara Hunt trained nurse, now Mrs O. Finney\n17452 Elwood St. Northridge Calif.\n\n41. What do you think are the most important changes in your community since you first came West?\nFirst Fairmde School was built in 1889 and opened and opened on April first.\nIn 1929 replaced by a new school of brick and tile with two rooms, one for high school.\nAll farming in the 80's started on very small capital horses were very scarce, even the common for A. D. plow wagon. Three neighbors started with one yoke of oxen between them, (Camron, Paul and McAlpine)\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\nJ.J. Clements Wanda\nA. Camron Kelso\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6. Questions regarding historic local source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, old newspapers, old pamphlets, old photographs, written miscellaneous and written press? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University in Saskatoon?\n\n4c. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPhilip W. Hunt (signature)\nHunt Orphanage, Elmoor Road, Sask., farmer\n\nBarbara Hunt (signature)\nElmoor Road, Sask., married woman, now Mrs. O. Finney\n\n4f. What do you think are the most important changes in your community since you moved here?\n\nFirst Fairmilk School was built in 1889 and opened\nand opened on April first, 1889.\nIn 1929 replaced by a new school of brick and tile\nwith two rooms, one for high school,\nall farming in the 80's started in very small capital\nbut now very busy, new the commune for Ribokow\nupgraded. This neighborhood started with only 50 acres\nbetween them (Barrow, Band and the Uplands)\n\nPlease give the name and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nA. Cameron Reid\nsent in by\nMr. Andrew C. Hunt\nBox 647, Moosomin\n\nnear Moosomin\nLog house built in\n1882, originally had\nred roof. Church\nservices\nheld sometime before\nchurch was built.\n\nworks picture returned.\nSend in by Mr. Andrew O'Keeffe\nLot 647, Moosomin\n\nKey to town back lot\n1882 - original last\npool rent & premises held connection before church was built.\n\ncarrots pictures needed\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_403.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 4998, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1520, 5], [1520, 1520, 6], [1520, 2783, 7], [2783, 3886, 8], [3886, 5185, 9], [5185, 5800, 10], [5800, 6480, 11], [6480, 7020, 12], [7020, 7347, 13], [7347, 7720, 14], [7720, 9151, 15], [9151, 9960, 16], [9960, 11307, 17], [11307, 12159, 18], [12159, 13508, 19], [13508, 14611, 20], [14611, 16230, 21], [16230, 17697, 22], [17697, 17890, 23], [17890, 18069, 24], [18069, 18069, 25], [18069, 18069, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]