[{"id": "048b21a925ce069393daedb5f8b312dea18b9071", "text": "Name: Mrs. Sarah Waddingham\nAddress: Battle Lake\nBirthplace: Norway, the Ost, born 1870\n\n1. **PIONEER HISTORY**\n   - What year did you start homesteading in Western Canada? 1896\n   - Where did you set up homesteading? Mybroy, Sask\n   - Where had you been living before that? Battle Lake\n   - For how many people did you propose homestead? 4 adults\n   - How far was it to your nearest store? 4 miles\n   - How often could a visit be made to the store? Once a week\n   - What groceries did you usually buy in those earliest years? Tea, sugar, syrup, honey, salt, pepper, yeast, soda, baking powder\n\n2. **FLOUR AND OTHER GRAIN PRODUCTS**\n   - What brand of white flour did you use in the early years? Golden's\n   - In what quantities did you buy it? About 100 lbs\n   - What was the usual price per hundred pounds of white flour? $1.50\n   - How much did you use Graham flour? Not enough\n   - Whole wheat flour?\n   - Was flour milled locally? Yes, far away? No, what year? 1910\n   - What was the price for a twenty pound bag of rolled oats? Not sure\n   - What other grain products did you use? Oats, cornmeal, buckwheat, flour\n   - Did you grind your own wheat for porridge? Yes, later\n   - How did you grind it? By hand mill and small crusher\n1. **INTERESTING QUESTIONS**\n\n   - What year did you start school?\n   - How many years have you been living in this town?\n   - How many people did you attend school?\n   - How far did you travel to get to school?\n   - How often could a visit be made to the store?\n   - How much did you usually buy at these visits?\n\n2. **Baking Powder**\n\n   - How much did you buy?\n   - How much did you use?\n   - How much did you save?\n   - How much did you throw away?\n   - How much did you give away?\n   - How much did you keep?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs. and 200 lbs. by the pound.\n\nWhat was the price for a ten pound sack of white sugar? About $1.50.\n\nWhat brand of golden corn syrup did you use? Edwardsburg.\n\nWhat size of tin of syrup did you usually buy? 1 lb. browned.\n\nAt what price? Don't remember.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From local cows.\n\nButter? Made own butter.\n\nEggs? Had hens and got own eggs.\n\nWhat was the price of butter? 10 cents.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork and beef.\n\nHow did you get fresh meat? Butchered our own.\n\nHow often did you get fresh meat? Butchered in the fall.\n\nHow did you preserve meat? Cured the pork and canned beef.\n\nWas there a \"beef ring\" in your neighborhood? Not in early days.\n\nIf so what year was it organized? Around 1912.\n\nDid you use game? Yes.\n\nWhat kinds? Turkey and chicken.\n\nFor how long? Ten seasons.\n\nWhat part did fish play in the family diet? More while in spring.\n\nWas the fish fresh, cured, or canned? Some fresh, some cured.\n\nKinds? Suckers, Jack fish, pickerel.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? (to the nearest pound)\n\nWhat was the brand of sugar? Did you buy any other brand?\n\nWhat was the flavor of the syrup? Did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get your supply of fresh milk in the early days? (Was it delivered?)\n\nDid you make butter? If so, how much?\n\nDid you make cheese? If so, what kind?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? (Was it delivered?)\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use canned meat?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas this fish fresh, cured, or canned?\n\nWas this fish salted, pickled, or smoked?\n\nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black, green. At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) ..........\nPrice? ............ What other beverages were used? .............\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n................. Could you get potatoes at the store? Yes..........\nIf not, where from? ................. What year did you first grow your own supply for the winter of: always grew\nPotatoes ........ Cabbage ........ Carrots ........ Onions .........\nTurnips ........ Beets ........\nIn what quantities did you buy white navy beans? ............ pounds\nHow did you buy prunes, (in bulk or by the box)? Bulk..........\nThat weight? ........ How did the grocer handle prunes (by box)? ...........\nWhat was the price of prunes? ...........\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)? all kinds\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes..........\npeas? ........ corn? ........ beans? ........ Saskatoons? ..........\nother foods? No........\nWhat year did you first preserve fruit by canning? ..........\nWhat year did you first preserve vegetables by canning? I didn't..........\nWhat year did you first preserve meat by canning? ..........\nDo you still preserve foods by canning or drying? Yes, I kept the\nfarm after my husband died 14 years ago..........\nTo what extent? ..............\nDid you make your own vinegar? Yes...........\n3.\n\n6. Buy goods.\n\nThat kind of tea did you buy? \nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nThat other housekeeping? \nGreen tea? \nOther? \n\n7. Vegetables and dried fruits.\n\nThat was the price of potatoes per bushel then you set up housekeeping? \nCould you get potatoes at the store? \nIf not, there were? \nThat year did you first grow your own supply for the winter of? (always green) \nPotatoes \nCabbage \nCarrots \nOnions \nTurnips \nBeets \nRadishes \nLettuce \nParsnips \nIn what quantities did you buy white navy beans? \nHow did you buy prunes? (in bulk or by the box?) \nThat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nThat other dried fruits did you use in the earliest days? (apricots, peaches, prunes, raisins, currants or others)? All kinds? \n\n8. Preserving.\n\nIn the early years did you preserve any foods by freezing? \nPeas? \nCorn? \nBeans? \nSaskatoonberries? \nOther foods? \nThat year did you first preserve fruit by canning? \nThat year did you first preserve vegetables by canning? \nThat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar? \nDid you make your own wine?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                  |                                   |                     |\n| Macaroni              |                                               |                                                  |                                   |                     |\n| Graham flour          |                                               |                                                  |                                   |                     |\n| Brown sugar           | 1888                                          | Bulk                                             |                                   |                     |\n| Molasses              | 1888                                          |                                                  |                                   |                     |\n| Table salt            | 1888                                          |                                                  |                                   |                     |\n| Common salt           | 1888                                          |                                                  |                                   |                     |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           |                                               |                                                  |                                   |                     |\n| Baking powder         | 1888                                          |                                                  |                                   |                     |\n| Baking soda           | 1888                                          |                                                  |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               | 1888                                          |                                                  |                                   |                     |\n| Raisins - seeded      | 1888                                          |                                                  |                                   |                     |\n| Raisins - seedless    |                                               |                                                  |                                   |                     |\n| Rice                  | 1888                                          |                                                  |                                   |                     |\n| Currants              | 1888                                          |                                                  |                                   |                     |\n| Store jam - kinds?    |                                               |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                   |                     |\n\nThe railroad was in Oktov when I moved there so we could get anything we could pay for.\n\n10. BAKING\n\nWhat type of yeast did you use? Royal\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? For the Sour River\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same food today? |\n|-----------------------------|----------------------------------------|-------------------------------|--------------------------------------------|\n| Canned salmon               |                                        |                               |                                            |\n| Canned mackerel             |                                        |                               |                                            |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              | yes by the barrel                      |                               |                                            |\n| dried                       | get                                    |                               |                                            |\n| Lettuce                     |                                        |                               |                                            |\n| Tomatoes - fresh           | yes                                    |                               |                                            |\n| canned                      | yes                                    |                               |                                            |\n| Bananas                     |                                        |                               |                                            |\n| Lemons                      |                                        |                               |                                            |\n| Oranges                     |                                        |                               |                                            |\n| Cornflakes                  |                                        |                               |                                            |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                            |\n| Minuto tapioca              |                                        |                               |                                            |\n| Sago                        |                                        |                               |                                            |\n| Dates                       |                                        |                               |                                            |\n| Walnuts                     |                                        |                               |                                            |\n| Icing sugar                 |                                        |                               |                                            |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) well\n\nHow far was this water from your home? 75 yards\n\nHow was it brought to the house? (pail, barrel, tank) pail\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nQuite a few things changed we lived in a sod house for over six years built a stone house a large barn store stable underneath dug a deep well 313 feet bought acre land\nFresh by the barrel\n\nApples - fresh\nApples - dried\nLettuce\nTomatoes - fresh\nTomatoes - canned\nBananas\nLemons\nOranges\nCornflakes\nOther preserved\nSour dough\nCorn to - dry meal\nPearl tapioca\nMinato tapioca\nSago\nDates\nSalmon\nIndian sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) until\n\nHow far was this water from your house? In yards\n\nHow was it brought to the house? (Well, barrel, tank)\n\nTell a few things Changes we lived in a Red Barn Store for over six years built by store owner Mr. Bought Amie Land Stable ambulance till dry a deep well 818 feet bought Amie land\n13. SOAP\n\nDid you buy laundry soap or make your own? ...made my own...\nIf you made your own, did you use lye? ...yes... wood ashes? ...no...\nWhat kinds of laundry soap did the grocer handle? ...not remember...\n\n14. FUEL\n\ncoal from the mines drew by team\nWhat fuel did you use in the earliest days? ...coal drawn by hand from\nWhere did you get your fuel? ...from Eastman... North Mountain...\n\nMention any changes in the use of fuels which have taken place since you\nfirst started housekeeping, giving dates where possible. There is one\nchange only the coal comes by train now.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\ndays? (Give dates) ...yes... always had stoves...\nDid you use an outdoor fireplace or bake oven? (Give dates) ................\n\nBy whom was your first cook stove made? ...I don't know...\nWhat year was it purchased? .................. Price? ..................\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ..........\nIron... copper... tin...\nFor preparing food? (china, earthenware, wooden bowls, other) ............\nWhen did you first see enamel ware? .................. 1896...\nAluminum? ...can't remember the year...\n13. Did you keep laundry soap or make your own? If so, what kind?\n\nIf you made your own, did you use lye? If not, what was used instead?\n\n14. Full Coal from the Original Chew by Cream\n\nThat full coal you used in an earlier type of stove. How much did it cost?\n\nHow did you get your fuel?\n\nChange only the rural census by town.\n\n15. For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Name)\n\nThat year was it purchased? (Year)\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing foods? (Kitchen, earthware, wooden, metal, other)\n\nWhen did you first see enamel? (Year)\n\nAluminum? (Date, place, remember the year)\n15. **Wrappings and Containers**\n\nRation any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Wheat porridge brown sugar milk & cream\nToast eggs Some times meat syrup\nDinner potatoes meat Vegetables pie or pudding\nSupper fried potatoes meat or eggs fruitcake\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\nGive the date, list those present and give their approximate ages at that time.\n\nMrs. Casswell and 2 children\nRoast beef potatoes vegetables plum pudding\nbread crustie butter tea, as long as I was on the farm we had Christmas dinner and supper we usual had 12-16 guests then was some children we had 3 of our own 2 Boys 1 Girl all married now\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nOne year we were often short of money we always had lots to eat meat bread vegetables and some fruit tea sugar\n\nThe women in our area were hard to Remember\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest years. (Give dates here possible.)\n\nBreakfast: Wheat porridge, bacon, sugar, orange juice.\n\nLunch: Eggs, some times cheese & grapefruit.\n\nDinner: Potatoes, peas & vegetables, pie or pudding.\n\nSupper: Fried potatoes, bread & applesauce.\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n\n19. How was the food prepared and cooked?\n\n20. How much food was eaten at each meal?\n\n21. How often did you have meat?\n\n22. How often did you have vegetables and some fruit?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nAs long as I was on the farm I continued to make my own bread, butter, raise fowl, sell egg and butter. Later years we sold cream had an ice well could keep the cream sweet.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back or page if more space is needed).\n\nI will tell you about my parents they came from Ont in 1885 homesteaded in the Carlyle district drove from Moosemin over 60 miles with horses drew lumber for a log house for floor and roof got the logs out of those mountains we sent out for groceries to Portage la Prairie got brown sugar by barrel no fruit the first years bought sugar by barrel no fruit the first years bought corn polished butter in tubs and sold at Moosemin till the railroad came to Carlyle my parents brought later the railroad came to Carlyle my parents brought 6 of their family of 11 one son was here before them and a daughter came after I am the only one that is left here. My Brother in Niche and I am '86 past you will understand it is hard to Remember.\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible.)\n\nAs long as I was on the farm I continued to do as much as I could. We raised our own eggs and cream. We had an ice well and kept the cream.\n\n22. Please add other details from your early experiences of buying groceries and observing foods in other ways. Include prices, problems or stories that illustrate the situation.\n\nI will tell you about my parents they came from out in 1885 homesteaded in the Castle Rock district above from Missouri over 60 miles with horses drawn lumber for a log house for floor and roof. Got the logs off for one dollar a load or send oil for processing. Co-opage was scarce and brown sugar by barrel or barrel. The first years bought and packed both in tubs and sold at $1.00 a barrel.\n\nThe railroad came to Ogden and Placerville and the town grew. Before then it was a small town.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1896_70.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5003, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1237, 5], [1237, 1751, 6], [1751, 2974, 7], [2974, 3796, 8], [3796, 5367, 9], [5367, 6587, 10], [6587, 11070, 11], [11070, 11070, 12], [11070, 14623, 13], [14623, 15252, 14], [15252, 16491, 15], [16491, 17339, 16], [17339, 18605, 17], [18605, 19168, 18], [19168, 20675, 19], [20675, 21648, 20], [21648, 21648, 21], [21648, 21648, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]