[{"id": "7572cc9b6bf46b6166060abe71f0a7034f196bc5", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to frame a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your own experience; others may be impossible for you to answer, so don't worry about leaving blank spaces. You can, however, give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experiences of the pioneer years whether or not they are still living.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to store a general questionnaire on pioneer life because no individual who is asked to answer a question will have experience as another. Some of the questions here will not apply to many persons; others may be impossible for you to answer, so don't worry about leaving blank spaces or answering them in detail. If there is not enough space to answer all the questions, please fill out the sheet of paper attached.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and who have personal experiences of the pioneer years whether they be in the province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What I Did,\" was sent to you by mail. If you have not already answered this, you would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer social conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaire:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: JAMES R. CRAWFORD\n2. Your address: 516 Avenue N. North, Saskatoon\n3. Date: April 11th, 1962\n4. Where were you born? Newfane, Ontario\n5. What was your father's name and occupation? James Crawford\n6. When did you come to Saskatchewan? April 11th, 1962\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nBonus: Mining Ontario in 1870\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n9. What were your weaknesses for our team?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government Information?)\n\nA lady and visiting in Manitoba before I had heard of my mining. I told us about the better opportunities in the west as they were then being in Saskatchewan.\n\nYours Truly,\nJames R. Crawford\nApril 11th, 1899\nSaskatchewan Archives Questionnaire\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: JAMES R. HAYWARD, R.D.\n2. Your address: 816 Avenue N, North, Saskatoon\n3. Date: April 11th, 1962\n4. Where were you born? (Give name of place and country) Newmarket, Ontario\n5. What was your father's name and occupation? James Crawford\n6. When did you come to Saskatchewan? (Give month and year) April 11th, 1962\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nSome of - Meeting Quebec in 1870\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n   It was in my teens.\n\n9. What were your reasons for coming West?\n\nAs the old saying goes, when you go west, you think you're going to school by the time you get there.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nA lady and visiting sir Maclean before I had heard of my mind. I'll tell you about the better opportunities in the west as they worry Red from living in Saskatchewan.\n\nSigned Robert 1899\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? With my wife.\n\n13. What means of transportation did you use? Canadian Pacific Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). We had a coach on the railway when we got to the prairie and had to deliver that night via a day late getting to Regina. We were only two hours behind schedule. We arrived at the train in Saskatchewan. That they needed a train then we made the next stop. The journey was very smooth to Saskatchewan.\n\n15. Where did you first stay when you arrived in Saskatchewan? At my uncle's place until we settled down.\n\n16. Where did you settle or take up land? Seven miles N.W. of Saskatoon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking out $15.416 a month for six months of the year before coming to Saskatoon to work in the mills.\n\nIn 1902 I worked on the Fifth Elevator in Saskatoon. Build for Leslie & Wilson of Saskatoon and in Marching time I worked on George Brown's cattle that fall in 1902.\n11. What was your family's decision to come to Western Canada? They thought it would be better.\n\n12. Did you travel by yourself or with a group (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n\nCanadian Pacific Railway\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other experiences)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nIn 1902 I worked on the Fifth Elevator in Saskatoon. Build by Beulah & Wilson of Saskatoon and in Marching time I worked on George Brown's outfit that fell in 1902.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, tell when they came and where they settled.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWhat is church or religious activity in your life today?\n\nThe practice was to hold services at the time you arrived at the place. If you happened to get off the trail in the evening you would have to stop and get accommodations until you found the hard ship trail.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\n25. How often? (by what means of travel?)\n\n26. What is the distance to the nearest town?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the time mentioned.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time? With the idea of staying\n\npermanent? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nIn July 1911 the Regina Rural Telephone co.\n\nFor I had need of money & only as we had it\n\nany money & travel\n25. When was the first car used in the community?\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Have you trading territory? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIn July 1911, the first telephone in\n\nyou had most of our mind & city as we looked at\n\nany money & travel\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\nWe moved to the city of Rockton in 1937 took a motor trip to our old home town that summer.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nServed a school board from 1910 until 1937\n\nAnd was Secretary December 10 of that year.\n\n37. If you or any of your family or friends were inspired to have or do something in the district mention it here, giving dates wherever possible. (Such as writing the first automobile, combine, organizing the first lodge, etc.)\n\nWe got our first automobile in 1917 and still running well in 1939 Plymouth.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) the origin and conception of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1) (2) (3).\n\n---\n\nS-X2\n645. Crawford James R.\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneer\" to have or do something in the district mention it here. Flying dates wherever possible. (Such as owning the first automobile, combining organizing the first league, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given data and reason for change. Give facts of new name as above in (1) (2), (3).\n\nWe moved to the City Bank in 1937 took a motor trip to our old home town that summer\n\nServed a school in the town 1910 until 1917 and was Secretary December 10 of these years\n\nWe got our first automobile in 1917 and still running now 1939 Plymouth\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\n4C. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nWe have five children & 2 step children. Mary in British Columbia, Betty in Alberta, John in Saskatchewan, Bill in Manitoba, William in Ontario.\n\n17 Grand Children & Great Grand Children\n\n41. What do you think are the most important changes in your community since you first came West?\n\nElectricity on the farms\n\nJ.R. Crawford\n516 Ave St N\nSaskatoon\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ.R. Crawford\n516 Ave St North\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and newspapers, old photographs, written recollections and reminiscences? (Please list)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nIlls there five children & 3 step children\n\nElectricity on the plains\n\nJ.R. Crawford\n516 Ave N W\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJ.R. Crawford\n516 Ave N W\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_645.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4462, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1866, 5], [1866, 3684, 6], [3684, 4626, 7], [4626, 6067, 8], [6067, 7450, 9], [7450, 8309, 10], [8309, 9253, 11], [9253, 9979, 12], [9979, 11070, 13], [11070, 11888, 14], [11888, 13145, 15], [13145, 14251, 16], [14251, 15238, 17], [15238, 16063, 18], [16063, 16218, 19], [16218, 16372, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]