[{"id": "a29a1ddfe324fc5c36158b1b579e04eca31f08f0", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE:\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Victoria Perpette\n2. Your address: Queen of the Home, P.S. Hubert Jack\n3. Date of Year: 1962\n4. Where were you born? (Give name of place and country): France, Alsace\n5. What was your father's name and occupation? Farmer: Henry Chamber\n6. When did you come to Saskatchewan? (Give month and year): 12 April 1950\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (through other people? Reading about it? Radio?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Victoria Bequette\n2. Your address: Room of the Home, P. Hubert Street\n3. Date: 18 March 1969\n4. Where were you born? (Give name of place and country): France, Calais\n5. What was your father's name and occupation? Farmer; Henry Chamber\n6. When did you come to Saskatchewan? (Give month and year): 19 April 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (through other people? Reading about it? Railroad? or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? [father]\n\n13. What means of transportation did you use? [boat to Quebec, train to Weyburn, then team to Forget where we took an homestead]\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? [at Villa Marichano in Forget (that was Olma then)]\n\n16. Where did you settle or take up land? [9 miles south of Mrs. Marichano]\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, other group)? [Other]\n\n13. What means of transportation did you use? [Train to Winnipeg, then team to Forget where we took an homestead]\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? [At Mrs. Marchand's in Forget (that was Alma then)]\n\n16. Where did you settle or take up land? [9 miles south of Mrs. Marchand]\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWalking to church, every Sunday, and driving when we had horses but occasionally by car.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married Florence Reynolds on April 26th, 1901.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy brother came in 1909\n\nstay with my father on the farm\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nPrairie fire nearly every year\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWalking to church, every Sunday and driving when we had horses\n25. When was the first car used in the community?\n\n26. If you purchased a new before 1974, when did you buy it? Where was it purchased?\n\n27. What was your trading partner? How far from your home? (Include all 10 miles.)\n\n28. Did the transaction involve money? (Indicate any charges due to your business expenses.)\n\n29. Service records of travel, etc.\n\n30. How close did you stay to the city limits?\n\n31. When did you first begin to buy through the mail order catalogue? What kind of articles did you buy at this time?\n\n32. What was your trading partner? Indicate also the function of your local purchase area by retail, wholesale, or both.\n\n33. Any changes in the proportion of purchases made by mail since June 1974.\n\n34. When did you first have a telephone and what company provided it?\n\n35. When did you come to Southwestern? For how long have you lived there?\n\n36. What do you think is your main reason for living here?\n\n37. We want to study community life but circumstances change\n25. When was the first car used in the community?\n26. If you purchased a new vehicle, when did you buy it? What model?\n27. Where was your trading center? How far from your home? (Include 10 weeks)\n28. Did you purchase any charges? (Include any charges due to your residence)\n29. Did you purchase any travel? (Include any travel due to your residence)\n30. How often did you shop in the nearby town?\n31. When did you begin to buy through the mail order catalogue? What did you purchase?\n32. How do you buy in this way? (Include other than furniture) Of your total purchases, what percentage was paid by cash and any charges in the proportion of purchases made by cash and charge?\n33. What do you purchase's telephone and other consumer products?\n34. What do you consume? (Include food, clothing, etc.)\n35. What do you consume? (Include food, clothing, etc.)\n\nFor example, the consumption of food, clothing, etc.\n\nBut circumstances change\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. We had to burn the crops because of early frost.\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWe had to burn the sign standing.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_615.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3359, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1064, 5], [1064, 2161, 6], [2161, 3003, 7], [3003, 3827, 8], [3827, 4588, 9], [4588, 5474, 10], [5474, 6460, 11], [6460, 7396, 12], [7396, 8413, 13], [8413, 9413, 14], [9413, 10410, 15], [10410, 11409, 16], [11409, 11564, 17], [11564, 11715, 18]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]