[{"id": "4c5547dfceb338b8e1ffca7b2e993490d9d50df7", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Miss Eleanor J. Webb\nAddress: Sandwith, Saskatchewan\nBirthplace: Oldham, England\n\n1. INDUSTRY (HOUSEKEEPING)\nWhat year did you start housekeeping in eastern Canada? 1917\nWhere did you set up housekeeping? Sandwith, Saskatchewan\nWhere had you been living before that? Windsor, Ontario\nFor how many people did you prepare meals?\nHow far was it to your nearest store?\nHow often could a visit be made to the store?\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years?\nIn what quantities did you buy it? 50 lb., and 100 lb. at times\nWhat was the usual price per hundred pounds of white flour? 6 dollars\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes, how far away? 37 miles, that year? 1915\nWhat was the price for a twenty pound bag of rolled oats? Around 70 cents\nWhat other grain products did you use?\nCornmeal?\nWhole wheat?\nFarina?\nOther?\nDid you grind your own wheat for porridge? Sometimes\nHow did you grind it? With grain chaffers\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 pounds.\n\nWhat was the price for a ten pound sack of white sugar? $1.50.\n\nWhat brand of golden corn syrup did you use? Royal's golden syrup.\n\nWhat size of tin of syrup did you usually buy? 48 ounces.\n\nAt what price? around $1.00.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? milk cows.\n\nButter? Yes, how much? 15 cents.\n\nWhat was the price of butter? 15 cents.\n\nDid you pack eggs for winter? Yes, how many? 20 dozen.\n\nDid you make butter? Yes, cheese?\n\nWhat kind of cheese? Cream cheese & ewe cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef & pork.\n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? In twenty times.\n\nHow did you preserve meat? Salted.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes, what kinds? Pheasant, chicken, and ducks.\n\nFor how long? Just once in a while.\n\nWhat part did fish play in the family diet? None.\n\nWas the fish fresh, cured, or canned?\n\nKinds? Didn't get much often.\n3. **Selling and Buying**\n\nIn what quantity did you buy? (e.g., 26 pounds)\n\nWhat was the price per pound? (e.g., $1.50 per pound)\n\nDid you pay cash or credit? (e.g., cash)\n\nDid you use any coupons? (e.g., yes)\n\n4. **Baking**\n\nHow did you make the dough? (e.g., by hand)\n\nWhat kind of flour did you use? (e.g., all-purpose)\n\nDid you add any ingredients? (e.g., sugar, salt)\n\nDid you use any special techniques? (e.g., kneading)\n\n5. **Meat and Fish**\n\nWhat was your main source of meat? (e.g., beef)\n\nHow did you cook it? (e.g., roasted)\n\nHow often did you eat meat? (e.g., twice a week)\n\nWas there a meat plant in your neighborhood? (e.g., yes)\n\nIf so, what type was it? (e.g., butcher shop)\n\nDid you use any spices? (e.g., yes)\n\nFor how long? (e.g., 1-2 weeks)\n\nDid you store it in the refrigerator? (e.g., yes)\n\nWas the fish fresh, canned, or frozen? (e.g., fresh)\n\nHow was it prepared? (e.g., baked)\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Willow. At what price? 40 cents.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? ________________ That other beverages were used? __________________\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 20 cents.\n\nCould you get potatoes at the store? No.\n\nIf not, where from? From our own.\n\nWhat year did you first grow your own supply for the winter of: 1918.\n\nPotatoes __________ Cabbage __________ Carrots __________ Onions __________\n\nTurnips __________ Beets __________\n\nIn what quantities did you buy white navy beans? 5-10 pounds at a time.\n\nHow did you buy prunes, (in bulk or by the box)? Bulk.\n\nWhat weight? 30 lbs. How did the grocer handle prunes (by box)? __________\n\nWhat was the price of prunes? 25 cents.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? All.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? Yes. Corn? No. Beans? No. Saskatoons? No.\n\nOther foods? __________\n\nWhat year did you first preserve fruit by canning? 1918.\n\nWhat year did you first preserve vegetables by canning? 1918.\n\nWhat year did you first preserve meat by canning? 1923 & 24.\n\nDo you still preserve foods by canning or drying? Canning.\n\nTo what extent? Not a great lot.\n\nDid you make your own vinegar? No.\n6. Vegetables and Fruits\n\nWhat kind of tea did you buy? (Lochaber)\n\nAt what price? (Lochaber)\n\nWhat kind of coffee did you buy? (Lochaber or normal)\n\nPrice?\n\nThat other beverages were used?\n\n7. Vegetables and Fruits\n\nWhat was the price of potatoes per bushel when you got up housekeeping?\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of?\n\nPotatoes\n\nCarrots\n\nOnions\n\nRadishes\n\nTurnips\n\nIn what quantities did you buy these navy beans?\n\nHow did you buy prunes? (In bulk or by the box?)\n\nWhat was the price of prunes?\n\nThat other dried fruits did you use in the earliest days? (apricots, peaches, raisins, currants, or others)?\n\n8. Preserving\n\nIn the early years did you preserve any foods by canning?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve fruit by freezing?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or freezing?\n\nTo what extent? (Not a great lot)\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                  |                                   |                     |\n| Macaroni              |                                               |                                                  |                                   |                     |\n| Graham flour          |                                               |                                                  |                                   |                     |\n| Brown sugar           | 2 lbs 25¢                                    |                                                  |                                   |                     |\n| Molasses              | 10 cents can                                  |                                                  |                                   |                     |\n| Table salt            | 8¢ box                                        |                                                  |                                   |                     |\n| Common salt           | 10¢ bag                                       |                                                  |                                   |                     |\n| Lily white syrup      | 90¢/10 lbs                                    |                                                  |                                   |                     |\n| Toilet soap           | 5¢ box                                        |                                                  |                                   |                     |\n| Baking powder         | 15¢ tin                                       |                                                  |                                   |                     |\n| Baking soda           | 10¢ box                                       |                                                  |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               | 50¢ gal                                       |                                                  |                                   |                     |\n| Raisins - seeded      | 15¢ each                                      |                                                  |                                   |                     |\n| Raisins - seedless    |                                               |                                                  |                                   |                     |\n| Rice                  | 2 lbs 25¢                                    |                                                  |                                   |                     |\n| Currants              | 15¢ lbs                                       |                                                  |                                   |                     |\n| Store jam - kinds     | all kinds mixed 40¢ tin                       |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) | store chart 25¢ lbs |                                                  |                                   |                     |\n| Vanilla               | 15¢ bottle                                    |                                                  |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Start\n\nDid you make yeast for your own use? No\n\nUsing starter? No\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n### 7. Things You'll Need\n\n| Item                  | Price |\n|-----------------------|-------|\n| Bread                  |       |\n| Brown sugar            |       |\n| Salt                   |       |\n| Baking powder          |       |\n| Corn meal              |       |\n| Vanilla                |       |\n\n### 8. Things You'll Buy\n\n- **Year you first purchased baking soda?** In 1915\n- **How much did you usually buy at a time?** 1 lb.\n- **Price of this amount:** $0.25\n\n### 9. New All Things on the Pantry in 1915\n\n- **Sugar**\n- **Brown sugar**\n- **Salt**\n- **Baking powder**\n- **Corn meal**\n- **Vanilla**\n\n### 10. Baking\n\n- **What type of yeast did you use?** Active dry\n- **Did you make yeast for your own use?** No\n- **Using hops?** No\n- **Salt rising?** No\n- **Did you buy baking powder?** Yes\n- **Crack of tartar?** No\n- **Did you bake your own baking powder?** No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate prices at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared surly - give names | |                               |                                                |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | |                               |                                                |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minute tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ........................................... Well ........................................................\n\nHow far was this water from your home? ........................................... In the yard ........................................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................................... Pail ........................................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, cistern, dugout)\n\nIf so, for how long have you had it?\n\nWas it brought to the house by (pail, barrel, tank) first started homesteading, giving date please.\n\nFirst started homesteading, giving date please.\n13. SOAP\n\nDid you buy laundry soap or wood ashes? Yes\n\nIf you made your own, did you use lye? No\n\nWhat kinds of laundry soap did the grocer handle? Soap\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood\n\nWhere did you get your fuel? Out of town home\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nNo change\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) Stove\n\nBy whom was your first cook stove made? My mom made it at home\n\nWhat year was it purchased? 1920\n\nPrice? $20\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nEnamel ware and some tin ware\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nReliance on earthenware\n\nWhen did you first see enamel ware? When I started housekeeping\n\nAluminum? When started housekeeping\n\n1918\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nMostly paper bags.\n\n17. Give a typical daily menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: porridge, toast, eggs\nDinner: meat & potatoes, pudding for dessert\nSupper: fish & meat, syrup\n\n18. What year did you serve your first Christmas dinner in eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. No\n15. **SHIPPING AND CONTAINERS**\n   Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n   \n   *Mostly paper bags*\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. Also the approximate month, e.g., winter or summer.\n   \n   *Breakfast: porridge, toast, eggs*\n   \n   *Dinner: meat & potatoes, pudding for dessert*\n   \n   *Supper: meat & meat syrup*\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe used cells of storing our vegetables.\n21. When all you begin to rely on purchased foods and prepared foods instead of home grown and home prepared foods (Give us every detail and dates as possible). For always prepared every food.\n\n22. Please add other details from your early experiences of border gardening and any other foods in other parts of the world. In Southern Canada, tomatoes, beans not considered above, quality, methods of cultivation, etc.\n\nThe word tally of vegetables\n\nTwo tallies\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1917_352.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4358, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1238, 3], [1238, 1238, 4], [1238, 2344, 5], [2344, 3246, 6], [3246, 4694, 7], [4694, 5744, 8], [5744, 10265, 9], [10265, 11136, 10], [11136, 15054, 11], [15054, 15345, 12], [15345, 16363, 13], [16363, 16363, 14], [16363, 17176, 15], [17176, 18022, 16], [18022, 18661, 17], [18661, 19120, 18], [19120, 19208, 19], [19208, 19362, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]