[{"id": "be252c5be13917b970cb523725b305ebaf66b736", "text": "Please print name and address in capital letters.\n\nYour full name: Frank A.C. Ziegler\nPresent address: R.R.#5, Hagerville, ONT.\nPioneer address: Nokomis, SASK.\nYear you came to Saskatchewan: 1904\nCountry or place from which you came: Ontario\n\nNote to Persons Answering the Pioneer Housing Questionnaire\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house.\n- to include any early dwellings coming under this general description, even though the family may have lived in it for many years.\n\nPART II: The permanent house.\n- to include the better house built after living for a time in quarters mentioned above, a permanent home built upon arrival, or the \"homestead shack\" which may have been added to and continued as a permanent house.\n\nPART III: General.\n- including aspects applying to either Part I or Part II of the questionnaire.\n\nSome persons will therefore answer only parts two and three, and others will be able to answer all three parts.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER Housing\n\nPlease print name and address in capital letters.\n\nYour full name: Frank A.C. Ziegler\nPresent address: R.R.#5, Hidergully, Sask.\nPioneer address: Nokomis, Sask.\nYear you came to Saskatchewan: 1904\nCountry or place from which you came: Ontario\n\nNote to Persons Answering the Pioneer Housing Questionnaire:\n\nSince early settlers lived in very different kinds of houses from one time to another, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPART I: The \"temporary\" shack, sod or log house. To include any early dwellings coming under this general description, even though the family may have lived in it for many years.\n\nPART II: The permanent house. To include the better house built after living for a time in quarters mentioned above, a permanent house built upon arrival, or the \"wholesaled shack,\" which may have been altered, and continued as a permanent house.\n\nPART III: General. Including aspects applying to either Part I or Part II of the questionnaire.\n\nSome persons will therefore answer only parts two and three, and others will be able to answer all three parts.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPART I: THE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1905\n\n2. During what years did you live in it? With additions 1905-36\n\n   How long did you think you might live in it when you built it?\n\n3. What was the location? (township, range, and post office). 30 x 1 Mokomis\n\n4. Is it still in existence? Yes\n\n5. What material was it made of? Sod\n\n   How long did it take to build it? 150177 by Ziegler stone\n\n   Saw hammer 9 5 square\n\n6. How large was it, and how many rooms did it contain? 14x20\n\n   How were they arranged?\n\n7. Who built it? Frank Ziegler\n\n8. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.) Sipplado joint paint\n\n9. What kind of floors did you have? Pin Boards\n\n   What covering did you have on the floor (rushes, linoleum etc.)\n\n10. What expenses did you have connected with the building of the house? Not quite $100\n\n11. Describe any special problems or unusual happenings connected with its building.\n\n12. How many people lived in the house when it was first built? 5\n\n13. What means of heating did you have? Cook stove\n\n14. What means of lighting did you use? Cozy-017\n\n15. Was there a cellar? Yes\n\n   Where was the door to the cellar? (in kitchen floor, other place?)\nPART II\nTHE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1905\n2. During what years did you live in it? 1905-1906\n3. How long did you think you might live in it when you built it?\n4. What was the location? (township, range, and post office)\n5. Is it still in existence? Yes\n6. What material was it made of? Sod\n7. How long did it take to build it? 1 month\n8. How large was it, and how many rooms did it contain? 14 x 10\n9. How were they arranged?\n10. Who built it? Frank Ziegler\n11. How were the walls finished inside? (e.g., rough boards, plaster, painted etc.)\n12. What kind of floors did you have? Boards\n13. What covering did you have on the floor (rushes, linoleum etc.)\n14. What expenses did you have connected with the building of the house?\n\nFrank Ziegler\n\n12. How many people lived in the house when it was first built? 5\n13. What means of heating did you have? Wood stove\n14. What means of lighting did you use? Oil lamps\n15. Was there a cellar? Yes\n16. Where was the door to the cellar? (in kitchen floor, other places?)\nPART II: THE PERMANENT HOME.\n\nNote: For some persons, this section may include a description of more than one house. If so, you may include answers for each, showing changes and differences from one house to another. If you wish, you may describe your first permanent house on this form, and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, and especially if they have been much the same type of house, you may wish to answer questions only about the first one or two (or perhaps an outstanding house in which you lived), and merely mention the others in question 16.\n\nIn all cases, be sure to make it plain which house you are writing about, using dates (and perhaps place) to identify each.\n\n16. Give the location (township, range, and post office), of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\nOriginal Shack added 70, Became a 5 Room House\n\n17. Who planned and built the house? Self\n\nWhat previous experience did this person (or persons) have in building? 70?\n\nWhere did he get his ideas as to the kind of house to build? 90?\n\n18. What year was it built? 1905 & added 70\n\n19. How long did it take to build it (if possible, give approximate dates when started and completed)?\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Lumber\n\n22. How large was it? 14 X 20\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet if desired).\n\nWas there a back shed attached?\n\nDid you have a front porch? If so, was it glassed in, screened or an open verandah?\n\n24. What kind of foundation was under the house (wooden sills, stone, concrete)?\n\n25. What kind of a basement did you have (full size cement basement, dirt cellar, etc)?\n\nWhere was the door to the basement (kitchen, outside, other room)?\nPART II: THE PERMANENT HOME.\n\nNotes: For some persons, this section may include a description of more than one house. If so, you may include answers for each, describing changes and differences from one house to another. If you wish, you may describe your first permanent house on this form, and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, you may wish to answer questions only about the first one or two (or perhaps an outstanding house in which you lived), and merely mention the others in question 16.\n\nIn all cases, be sure to make it plain which house you are writing about, using dates (and numbers placed) to identify each.\n\n16. Give the location (township, range, and post office), of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\nOriginal Stick added 70/1 Become 25 Room House\n\n17. Who planned and built the house?\n\nWhat planning experience did this person (or persons) have in building?\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built? 1905\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed)\n\n20. Does it still exist? Yes\n\n21. What material was it made of?\n\n22. How large was it? 14 x 20\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet, if desired).\n\nWas there a back shed attached?\n\nDid you have a front porch? If so, was it glassed in?\n\nScreened or an open veranda?\n\n24. What kind of foundation was under the house (wooden sills, stone, concrete)?\n\n25. What kind of basement did you have (full size cement basement, utility cellar, etc.)?\n\nWhere was the door to the basement (kitchen, outside, other room)?\n26. What insulation was used? \n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.) \n\nDescribe any ornamentation on the exterior of the house (for example, \"gingerbread\" trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished - (plaster, wood panel, wallpaper etc.)? \n\n29. How high were the ceilings? \n\nHow were they finished (plaster, beamed, moulded plaster)? \n\n30. What kind of wood were the floors made of? \n\nWhat width board? \n\nWere nails or dowels used? \n\nDid you have any parquet (patterned inlay) flooring?\n\n31. Describe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window? \n\nIn what room?\n\nDid you have any colored or stained glass windows? \n\nDescribe.\n\nDid you have shutters inside or outside? \n\nHow were window frames finished inside (painted, varnished)? \n\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panelled door, windows in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.)? \n\nDid you have a door knocker? \n\nDescribe.\n\n33. Describe interior doors. - if panelled, type of hardware, or any other special features about them.\n\nDid you have any double doors, french doors or swinging doors? \n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed? \n\nIf open, what type of baluster and rail was used, and what kind of wood?\n26. What insulation was used? \n\n27. Describe the general exterior appearance of the house (square, rectangular, etc., shape, height, style, color, roof, etc.). \n\nDescribe any ornamentation on the exterior of the house (for example, *engraved* trim, curved cornices, etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished? (plaster, wood panel, wall paper, etc.) \n\nHow were they finished (plaster, beaded, moulded plaster)? \n\n29. How high were the ceilings? \n\n30. What kind of wood were the floors made of? \n\nWhat width board? \n\nWere nails or dovetails used? \n\nDid you have any parquet (patterned inlay) flooring? \n\nDescribe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling. \n\nHow were the windows arranged? \n\nDid you have a bay window? In what room? \n\nDid you have any colored or stained glass windows? \n\nDescribe. \n\nDid you have shutters inside or outside? \n\nHow were window frames finished inside (painted, varnished)? \n\noutside (painted to contrast with house color)? \n\nDescribe your front door (paned door, windows in door, or around or above). \n\nWhat kind of hardware was used on the door (iron, brass, etc.)? \n\nDescribe. \n\nDid you have a door knocker? \n\nDescribe interior doors. If panelled, type of hardware, or any other special features about them. \n\nDid you have any double doors, French doors or swinging doors? \n\nWhat material were door handles made of—brass, iron, porcelain, (white or colored), glass? \n\nIf you had an upstairs, was the stairway open or closed? \n\nIf open, what type of baluster and rail was used, and what kind of wood?\n35. Did you have any built in cupboards, bookcases, china storage or other similar built in storage or display space?\n\n36. What kind of a chimney did you have? 37\" Pipe\n\n37. If you had a fireplace, where was it located in the house?\n   What material was it made of - red brick (what size brick?), stone (state color) or other material?\n   How large was the fireplace?\n   What material was the mantle made of (wood, stone, brick)?\n\n38. Were there any built in gas lights or lamp brackets; or candle brackets?\n   Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred? Oil Lamp\n   Gasoline lantern about 1921\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible. Cook stove, Barge heater\n   Self feeder 805, Home Comfort cook stove\n\n41. Did you have a cistern? Yes\n   What size and material? 10x12\n   Was the pump from it in the kitchen, basement or elsewhere?\n   Did you have a well in the basement? Outside near the House?\n\n42. Did you have plumbing in your house?\n   If so, what was the source of water?\n\n43. If you built the house described above, what was its cost?\n   If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n   Date of construction of house?\n\n44. If you borrowed money to finance building or purchase, what was the amount of the loan?\n   The source?\n   What was the interest rate?\n   What were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\n   Did you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n45. If you lived in a rented house, what rental did you pay? (give changes in rental and dates if possible).\n35. Did you have any built-in cupboards, bookcases, china storage or other similar built-in storage or display spaces?\n\n36. What kind of chimney did you have? \n\n37. If you had a fireplace, where was it located in the house?\n   - What material was it made of - red brick (what size brick), stone (slate color) or other material?\n   - How large was the fireplace?\n   - What material was the mantel made of (wood, stone, brick)?\n   - Were there any built-in gas lights or lamp brackets; or candle brackets?\n\n38. Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred.\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible.\n\n41. Did you have a closet?\n\n42. Did you have plumbing in your house?\n\n43. If you built the house described above, what was its cost?\n\n44. If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n\n45. If you borrowed money to finance building or purchasing, what was the amount of the loan?\n\nWhat was the interest rate?\n\nWhat were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\n\nDid you later think your method of financing was wise, or did you wish you had made other arrangements?\n\nIf you lived in a rented house, what rental did you pay? (Give changes in rental and dates if possible).\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, as they apply to houses mentioned in either Part 1 or Part 2, please specify which house you are speaking of if your answer does not apply in both cases. Use extra sheets if necessary.\n\n46. What did you do to \"winterize\" your house in the fall (storm windows, doors, banking (with what?), other means)?\n   50/?\n\n47. What additions were built to the house after its original construction?\n   37 years old\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, sick animals or others).\n   Little sick pigs, chickens\n\n49. As nearly as you can remember tell what furniture you had in each room in the house. (rugs, sofas, chairs, curtains, musical instruments, etc., etc.). If you lived at first in the \"shack\" or sod house, and later in a larger house, please tell what furniture you had in each place.\n   Shack 1905 Homemade Table\n   2073 Chairs\n   Bed 1907 Cot Married Bedroom Suit & Dining Room set\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or would seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it, from Eaton's etc.)\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your home, which you would be willing to loan or present to the Archives?\n   If requested to do so, would you be willing to co-operate in having pictures taken of any unusual or rare piece of furniture which you might possess?\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, please apply to houses mentioned in either Part I or Part II, not apply to both cases. Use extra sheets if necessary.\n\n46. What did you do to winterize your house in the fall (storm windows, doors, heating (with what?), other means)?\n\n47. What additions were built to the house after its original construction?\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, stock animals or chickens).\n\n49. As nearly as you can remember tell what furniture you had in each room in the house. (rugs, sofas, chairs, curio cases, musical instruments, etc.). If you lived at first in the smaller or old house, and later in a larger house, please list the furniture you had in each place.\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or would seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it from family etc.)\n\n50. Do you have any pictures of early phases of furniture, or interior views of your home, which you would be willing to loan or present to the Archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare pieces of furniture which you might possess?\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels? \n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio? \n   What kind was it? \n   Where did you get it?\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?)?\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet? \n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)? \n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (for example, fireguards, lightning rods, fire insurance). \n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the house, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio?\n   What kind was it?\n   Where did you get it?\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?)\n\nWhat window treatment or ventilation were provided in the attic?\n\n55. Did you have an indoor toilet? Yes / No\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes if possible, for example, fireguards, lightning rods, fire insurance.\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in answers.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3566.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5691, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1257, 5], [1257, 2530, 6], [2530, 3783, 7], [3783, 4842, 8], [4842, 6908, 9], [6908, 8889, 10], [8889, 10569, 11], [10569, 12241, 12], [12241, 14094, 13], [14094, 15576, 14], [15576, 17261, 15], [17261, 18719, 16], [18719, 19719, 17], [19719, 20654, 18], [20654, 20790, 19], [20790, 20944, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]