[{"id": "da5c1f2c207211e562a3cb4f8cfa915398e8890e", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n☐ All questionnaires as many as possible\n☐ Pioneer diet\n☐ Pioneer schools\n☐ Pioneer churches\n☐ Pioneer recreation and social life\n☐ Pioneer farming experiences\n☐ Folklore in Saskatchewan\n☐ Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Just state what you know if there is not sufficient space to answer the question.\n\nDon't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years, whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires as many as possible.\n- Pioneer diets\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: Mrs. Isabella Young Ross\n\n2. Your address: Alexander Young, Box 46, Macdonald, Saskatchewan\n\n3. Date: July 15th, 1955\n\n4. Where were you born? (Give name of place and country): New Comstock, Scotland\n\n5. What was your father's name and occupation: James Hood\n\n6. When did you come to Saskatchewan? (Give month and year): May 1887\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n   - From Scotland to Macdonald\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.) I was in my teens.\n\n9. What were your reasons for coming West? Taken a mother's husband.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. ISABELLA YOUNG ROSS\n2. Your address: ALEXANDER MAITLAND STREET, SASKATOON\n3. Date: FEBRUARY 9, 1953\n4. Where were you born? (Give name of place and country): NEW CUMBERLAND, SCOTLAND\n5. What was your father's name and occupation? JAMES HOOD\n6. When did you come to Saskatoon? (Give month and year): MAY 1887\n7. Mention any other places where you lived before coming to Saskatoon:\n   - From Scotland & Black River\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.). I was in my teens\n9. What were your reasons for coming West? To find a better life\n10. How did you learn about the West? (Through other people? Reading about it?) Railroads or government information\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   With the family father, mother & one sister.\n\n13. What means of transportation did you use?\n   Overland train & horse & wagon from there.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Family in 1886.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Month of school term.\n\n16. Where did you settle or take up land?\n   Father had a homestead place.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Saskatoon, Dundurn, N.E. Elbow, near Prince Albert, Floral & Elbow, Alexander man.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Lived mostly on ranch or farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI think what we all dreaded most was spring. It fell was a frantic fire many a time we fought them.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel? I did not travel much in early years mostly horseback or team & buggy or wagon.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell whom they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI think what we all dreaded most was seeing it fall was a terrific fire & many a time we thought it was.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of transportation?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? For far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? And how much in early years mostly...\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently? Or did you make up your mind after trying it out? What did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few atoms disappeared; they wanted like I didn't in the old country and most of them came back.\n\n35. Did many people move away during the 1920s? Did many return?\n\nSeveral moved away; I did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption. (If any changes in names since the first name was given, state and reason for change. Give dates of new names as above in (1), (2), (3).\n24. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nA few moved away. They wanted to be closer to their old country and most of them came back.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSeveral moved away. I did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were entitled to have or do something in the district section it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, intersections, hills, etc.) Try to give: (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of its adoption (if any changes in names since the first name was given, date and reason for change. Give names of new names as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, atlante books of communities, organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nMy husband came here in 1903 & I have some diaries written by him but they are in my home at Alexandria. My father or mother were royal army nurses & both are gone also my husband.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMr. Mary Paterson, Lumsden, Alta., Mrs. Alexander Young, in New Mexico.\nMiss Bella Ross, 605-720 Main St., Saskatoon.\nMrs. Frank Kelly, Alexandria, Sask.\nMiss Anna Ross, Alexandria, Sask.\nMiss Clara Ross, Alexandria, Sask.\nMiss Ethel Ross, Alexandria, Sask.\nMiss Ethel Ross, Alexandria, Sask.\n\nFirst came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. John Evans, 305-11 Main Rd., Saskatoon.\nMrs. N. Collins, 605-720 Main St., Saskatoon.\nMiss Ethel Ross, Alexandria, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, atlantic books of community newspapers, old newspapers, old pamphlets, old photographs, written recollections and narratives concerning?\n\nMy husband came here in 1903 & I have some diaries written by him. They are in my home at Alexandria. My mother never kept any records & both an gone also my husband.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Archives Division of the Legislative Library? (Regina) or the Archives Office at the University of Saskatchewan?\n……… (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMr. Mary Paterson, a schoolteacher in Alexandria.\nMrs. Belle Maddin, a schoolteacher in Alexandria.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. John Evans, 306-11 St., Regina.\nMrs. M. Collins, 605 Zangarance St., Regina.\nMrs. Dollie Brown, 3-411 Boulton.\nMr. Elmo Maycock, 3-411 Boulton.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1887_477.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4663, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1669, 5], [1669, 3340, 6], [3340, 4194, 7], [4194, 5294, 8], [5294, 6250, 9], [6250, 6913, 10], [6913, 7758, 11], [7758, 8545, 12], [8545, 9218, 13], [9218, 9930, 14], [9930, 10913, 15], [10913, 11899, 16], [11899, 13001, 17], [13001, 14105, 18], [14105, 15590, 19], [15590, 16947, 20], [16947, 17099, 21], [17099, 17250, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]