[{"id": "662feccc9f91cdfa30fb45177519ea1eeb6fe897", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Has Happened Since?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires conditions\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Collection at the University of Saskatchewan as part of the Permanent Records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nCairns, R.B.\nLangbank.\n\nTo Sask., March, 1903\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...................................................... ROBERT BENJAMIN CAIRNS\n2. Your address .......................................................... LANGBANK, SASKATCHEWAN\n3. Date ................................................................. 1874\n4. Where were you born? (Give name of place and country) .............................................................. SCOTIA, NOVA SCOTIA\n5. What was your father's name and occupation? .............................................................. REV. J.A. CAIRNS, PRESBYTERIAN, AND FROM 1855 ON, UNITED CHURCH MINISTER, LETHBRIDGE, ALBERTA, FARMER.\n6. When did you come to Saskatchewan? (Give month and year) .............................................................. MARCH, '03.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .............................................................. BORN IN LETHBRIDGE, ALBERTA, MOVED TO BOWATER, ONTARIO, ABOUT 1899, THEN TO BOWATER RIVER TO SKYE IN 1903.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" I was in my teens\" etc.)\n9. What were your reasons for coming West? .............................................................. MY PA AND MA THOUGHT I SHOULD COME ALONG. HA, HA! MY FATHER WANTED HIS CHILDREN TO HAVE MORE OPPORTUNITIES THAN THE EAST OFFERED. HIS BROTHER HAD BEEN IN ALBERTA FOR SOME YEARS, AND WAS TELLING ACCOUNTS OF THE RICH SOIL AND WONDERFUL NEW COUNTRY. MY FAMILY HAD BEEN RAISED ON A FARM IN R.B., AND HAD HEARD MUCH ABOUT THE WEST THROUGH OTHER PEOPLE. (READING ABOUT IT? FARMING?) HOW DID YOU LEARN ABOUT THE WEST? (THROUGH OTHER PEOPLE? READING ABOUT IT? RAILROAD OR GOVERNMENT INFORMATION?)\n\nMy parents learned about the west from my uncle, and also from friends who had come from one of my father's congregations in Nova Scotia, who was farming in Pohlen, grinn district.\n\nMy father farmed and purchased, built a new barn and house, with more cattle, and established a home during the 1900 period. He was helped and encouraged by my mother. When some disaster overtook us, it was she who gave me courage to go on and make a joke of our misfortune. One of the things we had to face was the harshness and severity of the weather.\nCairns, R.B.\nLongbank.\n\nTo Sask. - March, 1903\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: ROBERT BENJAMIN CAIRNS\n2. Your address: LANEBANK ST.\n3. Date: 1874\n4. Where were you born? (Give name of place and country): Pictou County, Nova Scotia\n5. What was your father's name and occupation? Rev. J. A. Cairns, Presbyterian, and from 1825 on, United Church minister.\n6. When did you come to Saskatchewan? (Give month and year): March '03\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Born in Lindsay, Pictou County, moved to Benning River, October 1899.\n   Moved from Benning River to Sask. in 1903.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc).\n   I was in my teens.\n9. What were your reasons for coming West?\n   My Pa and Ma thought they should come along. Ha, Ha, Ha.\n   My father wanted his children to have more opportunities than the East offered. His brother had been in Alberta for some years, and wrote glowing accounts of the rich soil and wonderful new country. My father had heard about it from a family in Pictou, and was interested. He had heard about it from my father's congregation in Nova Scotia, who were farming in Potter's Creek district.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n\nMy parents arrived about the west from my uncle, and also from friends who had come from one of my father's congregations in Nova Scotia, who were farming in Potter's Creek district.\n\nMy father farmed and purchased, built a new barn and house, with a new cattle, and established a home during the 1903 period. He was helped and encouraged by my mother. When they needed to sell some cattle, one took up, if we were to give our courage to go on, and make a joke of our misfortune, one of them may have won. Hail and farewell, and may we be met with success!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was just an adventure.\n\nThey showed us with food and gifts for my journey.\n\n12. Did you travel by train or by horseback?\n\nMother, I brother, sisters, all older than myself. Father had been gone about six years before.\n\n13. What means of transportation did you use?\n\nVigorously, weighed out, to our friends house, 21 miles.\n\n14. What incidents of the Journey West do you remember? (People you met on the way; meetings with Indians; adventures on the journey; accidents or other excitement etc.).\n\nWe saw our first electric lights on the way out. We made some good friends on the train; my sister corresponded with a girl friend she met on the train for years. No particular adventures except that the cattle we rode in to our friends' home wheat, and killed some of us.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMr. Archibald, Poplar Grove Post Office,\n\nQuamichia, North West Territory.\n\n16. Where did you settle or take up land?\n\nBought quarter section about 4 miles from Archibald's place.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nHave been here ever since, with brief interludes. Went to University of Saskatchewan, 1912-15. Was on a road division survey gang. The summer of 1914 taught school at Parkin, duck, summer of 1913, on a homestead.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmed ever since I was 19 years old.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was quite an adventure. They could not believe we would go.\n\nThey showed us with food and gifts for my journey.\n\n12. Did you travel by train or steamboat?\n\nMother, brother, sisters, all older than myself. Father had been gone West this year before.\n\nWhat means of transportation did you use?\n\nColonial car on C.P.R. to Edmonton, sleigh & oxen to our friends house, 21 miles over broken up roads.\n\n13. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWe saw our first electric lights on the way out. We missed some good friends on the train, my uncle corresponded with a girl friend who met on the train, for years. No particular adventures, except that the cattle we rode in to our friends' home wheat, and killed some of us.\n\n14. Where did you first stay when you arrived in Saskatchewan?\n\nMr. Wilson Archibald, Potlak Grove Post Office,\n\nQu'Appelle, North West Territories.\n\n15. How old were you since, with brief interludes. Went to University of Saskatchewan, 1912-15. Was on a second division survey gang. The summer of 1914 taught school at Parkin, back summer of 1913 on a homestead.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmed over since I was 19 years old.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMrs. Eliza Wilson Cairns. Nov. 27, 1936. Waverly, Man., U.S.A\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nTwo of our English cousins, and several of their friends and acquaintances came to Canada, and worked here for some time, but returned to the East. One lady cousin married in Manitoba, and came West.\n\nMy eldest sister, Mrs. B. Dickey, came West soon after we did. She married Mr. G. H. and they farmed 3 miles from here. They are retired in England. My eldest brother homesteaded in 1928, had been living in Vancouver for 5 years, one of his sons having bought a farm in Vancouver. The last 3 years, he has been farming in Alberta.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nWe had come very thrillingly into prairie fires in the early years.\n\nI thoroughly enjoyed the excitement of fighting fire, armed with a wet sack or a bucket of water, about 2 feet long.\n\nThe prairie around our new home had been recently burned over when we moved from architecture, and I can still remember the pungent smoke smell, mixed with fresh earth aroma, and green tendrils growing blindly looking thru the black ashes on the burning prairie.\n\nAnd the gophers were there in thousands. We armed them with a rope on the first sight of them. That was another thrill.\n\n23. Did you travel much (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nMy father traveled a great deal in the early years, on horseback by horseback or buggy. He went to town about once a fortnight for supplies, to Whitecourt or Wapella, 18 and 24 miles away.\n\nHe bought our first car in 1918. Model T Ford.\n\n24. How long have you lived in this district?\n\nA. 23. We lived for 8 years in a 4-roomed log and heated house, it was partly wooded and very comfortable in winter. The only small on account of being partly wooded, it flooded every spring when the snow melted. I still remember how sunny and balmy weather.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy Eliza Helen Cairns. Nov. 27, 1936. Windsor, Man., U.S.A\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell them they came and where they settled.\n\nMy eldest sister, Mrs. B. Bickley, came West soon after we did. She married Mr. Bickley and they farmed 3 miles from here. They all retired in Campbell. My eldest brother, Mr. Bickley, died in 1928, had been living in Glenavon the last 5 years, one of his new homes being in Glenavon.\n\n23. Is there any particular experiences of pioneer days that stands out in your memory which you would like to record?\n\nWe had some very thrilling pioneer times in the early years.\n\nI thoroughly enjoyed the excitement of fighting fires, armed with a wet sack or a bunch of gunnery, about 2 feet long.\n\nThe prairie around our new home had been recently burned over when we moved from archibald, and I can still remember the pungent smoke smell, mixed with fresh earth odor, and green tendrils growing blindly looking thru the black ashes on the burning prairie.\n\nAnd the gophers were there in abundance. That was another thing I caught my a worry on the first spring. I had very few friends then, and I thought I caught my a worry on the first spring.\n\nMy father traveled a great deal in the early years, on horseback, by horse and mule, and sometimes on horseback and sometimes on horseback and mule.\n\nFor example, he bought our first car in 1918. Harold T. Ford\n\nQ. 23. You lived for 8 years in a normal log and board house, it was partly underground, and very comfortable in winter, the very smallest on account of being partly underground, at flooded every spring when the snow melted. I still remember how snug you worked and heated were.\n25. When was the first car used in the community? Alberta 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\nKennedy 1905-08, Langdon 1908\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.). We traded in Whitewood and Kennedy until 1913.\n\nThey came into being. We go to whitewood and Kennedy until often still, but most of our buying is in Langdon.\n\n29. How often did you shop in the early days? Once a month or twice a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nWe didn't have lots of money in the early days, and we could only afford to have lots of money when the weather turned off. We had to buy through the mail order catalogue.\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail orders since then.\n\nWe ordered by mail every bit from the first, and to Calgary in Toronto, and later to Winnipeg when the Winnipeg branch opened. I think we must have bought almost half our groceries and household stuff from Eaton's in the early years, considerably less today. Not more than 10% in 1928, also buy from Simpson's, the Cloth, Army & Navy, etc.\n\n31. When did you first have a telephone and what company provided it?\n\nFirst telephone, summer of 1913, Campbell Telephone Co.\n\n32. When did you first have a telephone and what company provided it?\n\nFirst telephone, summer of 1913, Campbell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMy parents intended to stay. They had their share of hardships.\n\nYou find a heavy mountain on Sept. 12, 1903, 4000 ft. of our first crop was flattened by snow and hail to be cut one way. We all seemed to have had good health in the early years. I think we will get healthy, we all liked reading. In fact of having work for the first few years was hard; we had to go 18 miles to get wood anyway. Also again, you hauling in winter, and getting buried in fall, our hillsides.\n25. When was the first car used in the community? About 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? Once a month or twice a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first go to town?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\n34. Why haven't we attended to stay? They had their share of hardships.\n\n35. We had a heavy snowstorm on night of 2/3, 1903, 4000 acres of our first crop was flattened by snow & hard to get out one way. We all seemed to have had good health in the early years. I think we were glad to have all liked reading. Half of having wood for the first few years was hard; we had to go 18 miles to get wood anyway. Also again few years were hard in winter, and getting stranded in fall, etc. problems.\n34. Did any people move away from your district prior to 1911? What reasons did they have for moving?\n\nOne family moved to Nelson district. New, very fertile land.\n\nOne moved west to Montana. Said he knew of new, easily broken land.\n\nA few older folks moved to Canada, said their farms in left-room in crop.\n\n35. Did many people move away during the 1920s? Did many return?\n\nWe heard early during the 1930s a number of families moved in\n\nduring that period from Alberta, Okanagan and adjacent districts. They moved north from here during this period, we had men settled here before the dry years.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father and I served on the local school board, municipal council, community club, etc., at different times.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first school, etc.)\n\nWe owned and operated the first cowbarn, an Enterprise herd, in 1928.\n\nFirst string tying hay bailer 1947.\n\nHay string tying hay bails 1908.\n\nPothier's Community Club 1921.\n\nFirst 55 tied tractor (Massey) 1949\n\nSchool districts, Post offices, villages, railway stations, creeks, hills, etc., try to give (1) name, origin and meaning of the name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change.\n\nLongfellow - a long range or branch of hills, about 1 mile north of the station.\n\nPotter's Grove - Part of the land south of this district was purchased by pioneer fur as often that scarcely any trees were more than stunted. The P.G. district had a good growth of young potter's grove, fir did not normally penetrate and destroy it.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nOne family moved to Montana. They came from nearby hardy land.\n\nOur family went to Canada. We knew they farmed in that area.\n\nA few other families moved to Canada, and their farms are still there today.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWe heard early in the 1930s that a number of families moved out.\n\nDuring that period, from 1930 to 1935, many families moved away.\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy family and I served on the local school board, approximately.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district, mention it here, organizing the first school, lodge, etc.\n\nWe owned and operated the first community hall in 1925.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.)\n\nTry to give (1) name, (2) origin and meaning of the name, (3) date and reason for change.\n\nPoveshell Community Club - 1921\n\nFirst 55 civil district (Manley) - 1949\n\n39. Any other comments?\n\nLonghank - a long range or break of hills, about 1 mile north of the station.\n\nPotter's Creek - Plant of the land south of this district was bought by pioneer for so long that scarcely any trees were worth buying. The P.C. district had a good growth of young oaks then, and now they are mostly hardwood and chestnut.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (testimonies).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n(Indicate your preference if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you moved here?\n\n42. First came West?\n\nChange our from house to trailer homes.\nAll the - improved types of farm machines. The combine.\nCant instead of horses. Hydramatic, tractors mounted starters.\nBoth, instead. Rust resistant grainery. Early varieties.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences (documents), pamphlets, old newspapers, etc.? If so, please provide details.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ______\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nFrom Page 37:\n\n[Handwritten text not legible]\n\nChange our farm from horses to tractors.\n\nAll the improved types of farm machines. The combine.\n\nCard instead of horses. Hydrants, Threshing machines.\n\nBeth [signature]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_681.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6303, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1852, 5], [1852, 1852, 6], [1852, 4545, 7], [4545, 6826, 8], [6826, 8365, 9], [8365, 9804, 10], [9804, 12042, 11], [12042, 14029, 12], [14029, 16324, 13], [16324, 17555, 14], [17555, 19482, 15], [19482, 21075, 16], [21075, 22306, 17], [22306, 23420, 18], [23420, 23575, 19], [23575, 23729, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]