[{"id": "489aed898ab77c984bfa93547b8d2d58066936a3", "text": "S-X2\n2053. Woodward, John\nPlease print name and address in capital letters.\n\nYour full name: JOHN WOODWARD\nPresent Address: HINCHCLIFFE SASK\nPioneer Address: 1905\nYear you came to Saskatchewan:\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting about back and forth? 12\n\nHow many of these were bachelor's homes? 5\n\n2. How often did you usually visit neighbors? once a month, in the winter not so often\n\n3. Did you usually visit on a Sunday, or other days? frequently\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly without\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? sometimes in the morning also after dinner\n\nWhat about meals? Did you stay when not invited beforehand? oh yes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) do we just sit down after conversation and dined.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? tea, sometimes coffee, always coffee among the Scandinavian doughnuts\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? some times\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? a few times, we had building bees, and also to put in crop or take it off for sick neighbors\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. Several times a year\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nmany, sometimes during storms there would be as many as 12 or 14 sleeping on the floor covered by horse blankets, all beds being full. Dances were very popular, music being local, wonderful, varied, but everyone enjoyed it the rhythm being good.\n\nWere these more frequent in later years? Give dates.\n\nNo they were not, the settlers grew older, their children grew up and demanded modern dance music. They got it.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\n\nQuite informal, messages were delivered by the scholars and mostly the gatherings were organized that way.\nPIONEER RECREATION AND SOCIAL LIFE.\n\n1. In the first few years, how many homes were near enough to you for visiting about back and forth?\n   How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? (Was it once a month, or the other days?)\n\n3. Did you usually visit on a Sunday, or other days? Frequently\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly without\n\nThat idea of the day did you go - in the morning and spend the day, or in the afternoon, etc.? Sometimes in the morning also after dinner\n\nWhat about meals? Did you stay when not invited beforehand? Yes, sometimes coffee always offered\n\nDid we ever sit down for conversation and dined? Some times\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Several times a year\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such projects? Sometimes\n\nTell what you remember about such gatherings, listing dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst moving? Sometimes during storms there would be as many as 10 or 14 standing on the floor covered by horse blankets.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? And they would meet at some house. They got it.\n\nAnd mostly the gatherings were organized that way.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nMuch use was made of the schoolhouse for social activities and the grounds, which we kept well mowed, were used for sports events mostly followed by a social evening and a dance.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n90% of it, we as yet, had no railroads and were somewhat isolated until 1917 when the Thunder Hill branch was built. CNR, then Sturgis & Princeville came into being, then we could trade at these villages and cut out the long trips about 1935.\n\n9. When was your first community hall built?\n\nWhat material was it made of? Lumber. How large was it? 22 x 60\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Community effort, labour, Coop-organized under Bank coop - organization.\n\nWas it built in the village or town, or was it a country hall? Hamlet & Country, 1 mile south of school.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nWe used the hall for social gatherings except on sport days when we used the school grounds, which were well kept all the time.\n\nNow the Sturgis Unit built us a new school in the Hamlet. The old log school still stands.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nUsually.\n\nHow were babies and small children provided for? Wrapped up and put to sleep on school desks, sometimes, their mothers were very ingenious in that respect.\n\nHow were horses sheltered and fed in the winter time at these parties? We built a log barn 22' x 22'.\n\n11. What card games were popular in the early days?\n\nWhist was quite popular, and other card games.\n\nWas there card playing for a prize? Often.\n\nWhat dances were popular? Waltz, Schottische, square Dances, two step and others including step dancing, mostly by ontario.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Very little in the early years people were hungry for social contacts.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nNo, not all played cards, but non players were quite tolerant about the matter and again social contacts were important and were enjoyed.\n2. Tell what was made of the school house for community dances, box socials, etc., if you have any idea, (include also the school questionnaires). Give dates.\n\nFor social activities, and the grounds, which we used, were movies, were used mostly for socializing and dancing.\n\n90% of the use was made of the school house, and within the school district? Describe.\n\nWas there any special material used in the school house? If so, describe.\n\nWhat was your first community hall built? Out of the long range?\n\nWhat was its name? 1935\n\nWho built it? The community through special funds, the municipality, some organization, etc.?\n\nOrganization, etc.?\n\nCommunity effort, labor, cost organized under county, township, or was it a country hall? 5:00 Shows, etc.\n\nWas it built by the village or town, or was it a county hall? 5:00 Shows, etc.\n\nWas the school used for other purposes? For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come into the hall in town for other functions, etc.? Or were you close enough to make use of the hall for all gatherings, etc.?\n\nWe used the hall for social gatherings except on short days when we used the school grounds, which were well kept all the time.\n\nShow the story, but build us a new school in the hamlet.\n\nWhen parties, dances, etc., were held in houses, school houses or halls (as referred to in question 6, 7, and 10) did the entire family attend?\n\nHow were babies and small children provided for? Usually wrapped up and put to sleep on school chairs, sometimes their mother's knee.\n\nWhat card games were popular in the early days?\n\nWhat card playing was popular? Of an\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nIn the early years people went hungry in community gatherings! Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or far off?\n\nNot all played cards, but own players were quite tolerant about the matter and again seeing off contacts were important and were enjoyed.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? Very little indeed, practically everyone was financially embarrassed in the early years. The few who were not, were good mannered.\n\n13. Was the chivaree known in your community? Rarely about it.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThey were mostly indifferently supported.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nVisiting and social life fell off somewhat about 1915 during the first great war. About 30 of our young men enlisted and 4 failed to come back. After the war our people had prospered somewhat and social organizations and meetings, life while still carried on was not so spontaneous as in pre-war times.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nSaskatchewan Grain Growers\n\nGive the date and reason for it being organized.\n\nDate about 1910\n\nWe were out of funds through expense of clearing land, etc., this district was nearly all bush land, after hauling grain 47 miles to Canada and obtaining only $8 to $5 per bushel.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nA neighboring homesteader from the Pleasanton District came up and we called a meeting in the schoolhouse.\n\nApproximately what proportion of the farmers in the community belonged to it? 90%\n\nHow many women belonged? None\n\nHow often did it meet? About 6 or 8 times a year\n\nWhat were some of the activities carried on by this organization?\n\nWe talked organization to others, we cooperated in hauling grain on the long haul, we paid our dues to Central Regina, sent delegates to various places, one each to organization of the Sask Coop Elevator Co., also to the Convention when the Coop and the Pool were amalgamated and generally supported all coop movements since.\n\n17. Was there a Homemakers' Club in your district?\n\nNo, we had a U. Church ladies club which we still have.\n\nWhen was it organized? 1915\n\nApproximately how many women belonged to it? 30\n\nDescribe what you remember of its activities and services.\n\nThey have organized many social gatherings in the past, helpful support to many worthy causes, and in many other respects have been a decided factor in local social activities.\n12. What attempts at formality, or \"manners,\" do you remember in small towns such as those in which you lived? How did people behave toward each other?\n\n13. Were there any particular customs or traditions that stood out in your community?\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\n15. What was the name of the organization or club that you belonged to?\n\n16. Give the data and reason for its being organized. Date about 1910.\n\n17. How often did it meet?\n\n18. How many women belonged to it?\n\n19. What were some of the activities carried on by this organization?\n\n20. What were some of the activities carried on by this organization?\n\n21. What were some of the activities carried on by this organization?\n\n22. What were some of the activities carried on by this organization?\n\n23. What were some of the activities carried on by this organization?\n\n24. What were some of the activities carried on by this organization?\n\n25. What were some of the activities carried on by this organization?\n\n26. What were some of the activities carried on by this organization?\n\n27. What were some of the activities carried on by this organization?\n\n28. What were some of the activities carried on by this organization?\n\n29. What were some of the activities carried on by this organization?\n\n30. What were some of the activities carried on by this organization?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who was engaged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nSoccer Football club which organized Sports and games including matches with neighboring School districts; we had several players of real merit, from not only Britain but Denmark also, one of the Danes is manager and owner of the Creamery and Dairy Products at the PA.\n\nWhat means were commonly used by organizations for raising money?\n\nConcerts, taking the hat around, but mostly paying our own expenses, but we attracted 7 or 800 people who came to see the games.\n\n19. Where did various organizations hold their meetings?\n\nThe Schoolhouse\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nNo Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nIt must be stated that our early settlers who came from Europe were people of a good order of intelligence, with fair educations. So we did not lack for subjects of discussion. There was no difficulty in obtaining good literature.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nmostly Biblical Pictures\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg; ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\nSoccer-Football club, which organized\n\nShops and games including outdoor craft\n\nNeighboring School Districts, we had sponsoring\n\nPlayers of real merit from not only Baldwin\n\nBut Pennsylvania also, one of the names in monopoly\n\nand owner of the Creamery and Dairy Products\n\nat the PA.\n\nThe Schoolhouse\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nIt must be stated that our early settlers\n\nwho came from Europe were people of a\n\ngood order of intelligence, with fair educations.\n\nSo we did not lack for subjects of discussion.\n\nDid you often have a missionary shown?\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nmostly Biblical pictures\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Football, tag wrestling, jambing.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\nChildren, older boys football before snow came.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n   The young got plenty of time to play, to trap, M.Rats were also set for pocket money.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n   They built igloos, skied, skated, hunted a little.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n   June 1st 1905\n\n26. Who organized it?\n   Mr. Wright & myself at the Ranch.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n   There was no such organization.\n\n28. Was it the first picnic held in the community? Yes\n   If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n   We, Mr. Wright & I fixed up pole vaulting jumps, high jump, long jump, 100 yard dash, using the throwing stick.\n\nThere were only 5 settlers in the district.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n   We all fed at Mr. Wright's Table which was a most hospitable one.\n\n31. What did you have to eat and drink?\n   Roast Beef, F.W. killed a steer, pies, cakes, cookies and all the trimmings.\n\nMr. Wright's daughter looked after the cooking, and believe now Mrs. Tom Reinders, a neighboring rancher, was her husband.\n\n32. What time of the day did it start, and how long did it last?\n   2 o'clock to 7 o'clock.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Face,\" \"Leap,\" \"Wuthering\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent names connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nThe quiet places, streets, schools, limited a little.\n\nPIONEER AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? Mr. Wright, myself at the nearest school.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization?\n\nThere were only 5 settlers on the dig site but there were many families, perhaps 10.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nThere were only 5 settlers on the dig site but there were many families, perhaps 10.\n\n30. What arrangements were made for eating? Was there a general lunch, or did we all feed at Mr. Wright's Table which was a great hospitality one, or did everyone cook their own meal?\n\n31. What did you have to eat and drink? Boast Beef, F.W. Miller, a star, nice, tasty, cooked and ate the homemaking and believe you please, from Religion, Mrs. Husbands, a neighboring rancher, Mrs. Husbands.\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nThis was the first picnic organized North of T-35-R-5-W 2nd. I believe Mr. Jack Shoafelt distinguished himself by clipping off the head of a fine Plymouth Rocker with his first throw of the Indian throwing stick, which worked when thrown by an expert, something like an Australian boomerang.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nLots of picnics were held in the summer down at Squaw Lake, 2 1/2 miles south, mostly on Sundays. The hamlet of Lady Lake was named after this lake we submitted the name to the R.R. people but they finally compromised with Lady Lake. The legend of a young Cree girl was disappointed in love about 70-80 years ago, and swam out to an island in the lake and hid there afterwards disappearing.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nSquaw Lake is a beautiful gem surrounded by hills and spruce bluffs and was a favorite as a summer camping ground by the local Crees, after the tragedy occurred they abandoned the summer camp there, family quarrels over the incident split the Cree society.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly and young people).\n\nSoccer Football, Pole vaulting, Jumping, Speed, Dash, and other races, Horse racing, Pole wrestling, Hop skip jump, long jump, egg racing, Backball.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nSoccer Football, Base Ball\n\nWhat year? 1906 How long did it continue? 46 years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nPoveshulle organized football team in 1910 and Ball Team and played with Edmonton, some games came into Poveshulle and were good soccer players of them is now the Creamery Manager. Owner of the Creamery teams also came in from what is now the Sturgis District.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nAbout 1930 Hockey and skating.\n\nWhen was the first indoor rink built, and what was it used for?\nThis was the first picnic organized North of 7-35 R.W. 24. I believe my name should be written in the place of Mr. Sherrill's name.\n\nDescribe any features of this picnic which you remember at this time.\n\n33. Describe any different kinds of plants which you know of in the area (family, species, etc.)?\n\n34. Tell about any differences in numbers attending activities such as the annual community picnic, school or Sunday school, family picnics, etc.?\n\n35. Give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them.\n\n37. For what game was the first team organized in your community to play against young people?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger games, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.)\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1906\n\nDid it grow out of or replace the earlier community picnic?\n\nJ. Woodworth\n\nWho was responsible for starting the first sports day? A group of us myself, Geo. W. H., E. Louie, F.W. Wright, G.T.B. Benson, E. Weeks.\n\nThen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st.)\n\nJuly.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nNo, we were too isolated.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nEncyclopedia, Mining Engineering, obtained a then 3rd class Certificate at Sheffield University, Scott Books, 3 good Horticultural works, History of Trade Unionism, was active in mining organizations, The Vegetable World, Handbook, Western Canadian Law, 1917.\n\nHistory of the Holy Bible, 1816.\n\n43. How many of your neighbors brought books with them?\n\nThe Bible, mostly popular Novels.\n\nHistory a few books on Science, a few.\n\n44. To what extent did you exchange books with neighbors? Some, I had to be careful, I learned a lot of the way of Wakefield to a neighbor before back with the help of my great-grandfather, John Bram, was on it.\n\nCan you buy many books after you came west? (Give details)\n\nSome fodder & pasture plants, Geo. H. Clothe B.S.A. for being careful to follow such matters as Dr. Thompson's articles, somewhat divergent views from publications and their meanings and the somewhat divergent views from publications and their meanings and the somewhat divergent views from publications and their meanings.\n\n45. What books were sent to you as gifts in early years?\n\nCanada Year Book 45 years.\n\n46. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nA little, some of the scholars & some of their fathers & mothers borrowed, intermittently.\n\n47. Was there a school library? Yes. When was it begun? 1912.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nSome.\n\n48. Did parents ever use their children's school texts as additional reading material?\n\nI suppose so.\n40. When did an annual \"report day\" become established in your community? 1906\n\n41. Are there any from your community who have become members of well-known lodges, clubs, or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors if possible. If not, tell as nearly as you can how many books you brought and what kind.) (Use extra sheets if necessary.)\n\n43. How much land was purchased by your family? (Give acreage.)\n\n44. How much land was purchased by your neighbors? (Give acreage.)\n\n45. How many of your neighbors bought land? (Give number.)\n\n46. What kind of crops did you grow?\n\n47. Did you ever have any \"traveling library\" books in your community or school?\n\n48. Was there a school library? If so, when did it begin?\n\n49. Did parents ever use their children's school textbooks as additional reading material?\n\n50. How do you feel about the new school?\n50. Has there ever been a community library in your district or town?  \n   When was it started? 1912  \n   Who started it? Only the School Library  \n   Is it still in existence? Yes  \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nSchool Library before mentioned\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   Winnipeg Free Press, too busy for any other reading. When the Farm Papers began to be published, such as the Grain Growers Guide, Farmers Advocate, most of the Settlers subscribed.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. They never were stopped.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n   Give dates and tell how and where you got them.\n\nWhat books or papers that you brought to the west with you do you still have?\n   Everything I have before mentioned, and others such as family school books, dating back to the 60 and 70's, and the 80's. Of the 19th century, for instance my grand uncles' copy of the Daily Middle Class School, &c., also my father's technical works; he was a sculptor, a book on money theory, Rev. E. Gurney.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No, I knew where to obtain them.\n50. Has there ever been a community library in your district or town? Only the school library.\n\nWhen was it started? 1912\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, who was its librarian, what arrangements were made for borrowing books.\n\nSchool library before mentioned\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? None\n\n52. Describe later changes in your subscriptions. They were varied.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nTo obtain them...\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A wife and three children.\n\n57. What instruments did any of your neighbors have? Violins, one old organ, somewhat battered, Mrs. Usher owned it, no cornet, banjo, accordion, and Mr. Truax, an American who really was an artist on them, but you cannot use the bones at a church service.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. I cannot play a note.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nVery much so, my daughters sang at school and church gatherings. My youngest son had a little band, our concerts were good, we were fortunate to have School Teachers most of them were in the community! (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nYes, we had some good voices, mostly settlers from Britain and in the early years our schoolhouse used to be crowded to the door on concert nights.\n\n60. What were some of the favorite songs in the home?\n\nWe were still influenced by the music left over from the Boer War, Goodbye Dolly Mule leave you tethered, etc., and from the Russo-Japanese War, Farewell little old Ban. We in the community then supported the boys as against In our own home we had a background the Russians of Gilbert & Sullivan and La Corte, also the choral music of England's Midland Counties.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nSome Americans and Ontarians tried it, but were mostly received in a respectful, if deaf silence.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo, I was never anything of a caricaturist, unless some of these comments may be construed as such.\n\n63. Was there a band in your community? Yes. When was it started? 1900.\n\nWho started it? The older boys. How long did it continue? Intermittently, ever since.\n\nHow many were in it? 6-0-28\n\nWho was bandmaster? Mr. Usher.\n\nWhat instruments were included? Violins, organ, flute, cornet, banjo, bones, triangle, clarinet—a fine combination, but not at all bad.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nWhen the boys got older they organized a creditable Dance Orchestra which lasted until quite recently and were the best dance orchestra in this part of the Province. My youngest son Harry Woodward was the leader, James Lobbie, late Editor of the Sturgis Review, was a member of it.\nREMEMBERED INCIDENTS\n\n54. What musical instruments did you bring with you and why? (Children)\n\n57. What instruments did any of your neighbors have? (Older children)\n\n58. What musical instruments have you bought since then? (Adults)\n\n59. How large a part did dancing and other forms of music play in your home entertainments in early years? (Family)\n\n60. Were there musical concerts, parties, etc.? Describe.\n\n61. Was \"folk music\" or music of the country you came from, popular in your community? (Older children)\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or something? (Older children)\n\n63. Was there a band in your community? (Older children)\n\n64. How long did it continue? (Older children)\n\n65. Who started it? (Older children)\n\n66. How many were in it? (Older children)\n\n67. What instruments were included? (Older children)\n\n68. Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\n69. When the band got older they organized a concert hall. Why?\n\n70. Name orchestra, church, band, etc., that you belonged to. (Older children)\n\n71. What was your favorite song? (Older children)\n\n72. The leader, James Johnson, late Editor of the Strings Review, was a member of it.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A wife & three children.\n\n57. What instruments did any of your neighbors have? Violin, one old organ somewhat battered, Banjo, accordian, and Mr. Turner's harmonica.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. I cannot play a note.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? We were still influenced by the music left over from the Boer War, Goodbye Dolly, I must leave you, Tipperary, etc., and from the Russo-Japanese War, Farewell little old Ban. We in the community then supported the boys against the Russians, in our own home we had a backdrop of the Russian ballet of Gilbert & Sullivan and Lady Conde, also the choral music of England's Midland Counties.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. Some Americans & Ontarians tried it, but were mostly received in a respectful, if deep silence.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No, I was never anything of a caricaturist, unless some of these comments may be construed as such.\n\n63. Was there a band in your community? Yes. When was it started? 1904-1905. Who started it? The older boys. How long did it continue? Intermittently ever since.\n\nHow many were in it? 6-8. Who was bandmaster? Mr. Usher.\n\nWhat instruments were included? Violins, organ, flute, cornet, Banjo, bones, triangle, clarinet—a fine combination, but not at all good.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for. When the boys got older they organized a creditable dance orchestra which lasted until quite recently and were the best dance orchestra in this part of the province. My youngest son Harry Woodward was the leader, James Tobin, late Editor of the Sturgis Review, was a member of it.\nMUSICAL ENTERTAINMENT.\n\n54. What musical instruments did you bring when you came to New Hampshire?\n\n55. What instruments did any of your neighbors have? (Specify.)\n\n56. What musical instruments have you bought since coming here? (Specify.)\n\n57. What musical instruments do you own now? (Specify.)\n\n58. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n59. Was there a band or orchestra in your community? If so, what was its name?\n\n60. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke or prankishly, or because of some special happening in the community? If so, describe.\n\n61. Was there a band in your community? If so, who was the conductor?\n\n62. How many were in it? How often did it practice?\n\n63. What instruments were included? (Specify.)\n\n64. Tell me about the band's uniforms.\n\n65. When did the band start playing?\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNot yet\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nIt is important, the earlier members of our choirs and dance orchestras have mostly retired and the younger set are mostly engaged in doing other things.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nI did for 41 years and the records are hanging up in the porch of my house. The farm science committee didn't have to come here to Hinchcliffe and as my partner perfectly remarks, I never made any difference to the weather by all that writing.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nPainting, Drawing, Horticulture, Politics and the Cooperative Movement, being a member of the Board of Directors of the Sask Forage Crop Cooperative of Saskatchewan.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nHerbert Adamson - Hinchcliffe, Sask\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nIt has suddenly entered my mind that my interest in this questionnaire has revealed to you almost as in a book just about all that I have to tell regarding myself. Now it seems evident to me that I have provided you with about all the information that a new Cocos Prairie needs, and somewhere in those campus buildings you must have at least one building, W.A. Mitchell, who could assemble this information to his advantage on his way to fame and fortune.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important at Josea? What is the reason for this change?\n\nIt is important that the earlier members of our choir and band associations have mostly retired and the younger generation get more engaged in church activities and special interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes, we have a collection of historical artifacts connected with Josea, including a general store, schoolhouse, and church.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of plants, etc.? Yes, we keep detailed records of these observations.\n\n68. Describe other hobbies of special interests not already mentioned.\n\nPainting, drawing, horsemanship, fencing, and the cooperative movement being a sport.\n\n69. In there anyone in your community who is interested in any of these hobbies, or for others such as photography, bird watching, etc.\n\nHerbert Johnson - Homeplace Soak\n\nGENERAL\n\n70. Describe any outstanding features or institutions of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\nJust about all that I have to tell regarding Josea.\n\nNote: It seems evident to me that I have overlooked something with about all the information I have gathered. That's why I'm writing this letter.\n\nYou must have at least one building, possibly a schoolhouse, who could assist us. This information, to his advantage, on this trip to Fame and Fortune.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1905N-Z_2053.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 10503, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 26, 4], [26, 1125, 5], [1125, 1125, 6], [1125, 3415, 7], [3415, 4989, 8], [4989, 7921, 9], [7921, 10159, 10], [10159, 12897, 11], [12897, 14276, 12], [14276, 16202, 13], [16202, 17278, 14], [17278, 19315, 15], [19315, 21073, 16], [21073, 23734, 17], [23734, 24890, 18], [24890, 27247, 19], [27247, 28185, 20], [28185, 29755, 21], [29755, 30561, 22], [30561, 33326, 23], [33326, 34630, 24], [34630, 36861, 25], [36861, 37799, 26], [37799, 39994, 27], [39994, 41616, 28], [41616, 41616, 29], [41616, 41767, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]