[{"id": "eafbf20576ba7549ca47bd92e42de7b5361f24e7", "text": "Sav., Mrs. Lily\nTinistino, 1931\n\n1. What year did you start homesteading in eastern Canada? 1941.\n\n2. Where did you go to homesteaders? SASKATCHEWAN.\n\n3. How far from living before that? Approximately 100 miles.\n\n4. How many people did you prepare meals? Usually cooked for myself.\n\n5. How often could a visit be made by the storekeeper? Visited regularly.\n\n6. What kind of crops did you usually buy? Fresh vegetables, apples, pears, plums.\n\n7. What kind of flour did you use? Whole wheat flour.\n\n8. Have you had any problems with the flour? No.\n\n9. What was the usual price per hundred pounds of white flour? 10 cents.\n\n10. How much did you use per month? 50 pounds.\n\n11. Have you had any problems with the flour? No.\n\n12. What other fruit products did you use? Applesauce.\n\n13. Did you grind your own wheat? No.\n\n14. Did you mind the work? Not at all.\n1. PERSONAL HISTORY\n\nWhat year did you start homesteading in North Dakota? 1941.\n\nWhere did you go to homesteading school? NDSU, NDSU, NDSU, NDSU (University of North Dakota).\n\nFor how many people did you replace metal? 5.\n\nHow far out is to your nearest store? 2 miles.\n\nHow often would you visit the store? Weekly.\n\nWhat crops did you usually buy? Wheat, corn, oats, hay.\n\nWhat animals did you usually keep? Cows, chickens, pigs.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nHave you used any flour mill locally? No.\n\nWas the price for a bushel of flour $1.50?\n\nWhat other grain products did you use? None.\n\nDid you rent your own wheat for processing? No.\n\nHow did you grind it? By hand.\n\nDid you have the whole grain? Yes.\n\nDid you grind it yourself? Yes.\n\nDid you have the flour milled locally? No.\n\nWas the price for a bushel of flour $1.50?\n\nWhat other grain products did you use? None.\n\nDid you rent your own wheat for processing? No.\n\nHow did you grind it? By hand.\n\nDid you have the whole grain? Yes.\n\nDid you grind it yourself? Yes.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lb bag.\n\nWhat was the price for a ten pound sack of white sugar? No idea.\n\nWhat brand of golden corn syrup did you use? (illegible)\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? Don't know.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From one cow, gradually increasing as the herd grew.\n\nButter from same place. Eggs from 72 hens.\n\nWhat was the price of butter? From 13 cents of eggs? 10-15-25 cents.\n\nDid you pack eggs for winter? Yes, hor. Lime water or just in an egg crate.\n\nDid you make butter? Yes. Cheese? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Cattle, Sheep, Prairie Chickens, Ducks, Rarely a Goose, Wild Turkey, Chicken.\n\nHow did you get fresh meat? Killed it.\n\nHow often did you get fresh meat? In fall, kill a cow for winter, spring use.\n\nHow did you preserve meat? Brined pigs.\n\nWas there a \"beef ring\" in your neighborhood? For a very short time.\n\nIf so what year was it organized? Too few families around to bother.\n\nDid you use game? Yes. What kinds? Ducks, Prairie Chicken.\n\nFor how long?\n\nWhat part did fish play in the family diet? None.\n\nAn occasional bit of canned Salmon (25 cents).\n\nWas the fish fresh, cured, or canned?\n\nKinds? In later years when Kinistino Village came into existence, 1/4 lb packaged, powdered cod could be procured, also dried fish.\n1. SIGNS AND NAMES\n\nIn what county did you live? [Blank]\n\nWhat was the price for a ton of corn? [Blank]\n\nWhat amount of golden corn were you paid? [Blank]\n\nWhat size of tin or barrel did you get at that price? [Blank]\n\n2. DELIVERY PROBLEMS\n\nHow did you get your meat in the early days? [Blank]\n\nDid you have any difficulties getting your meat? [Blank]\n\nDid you have any problems with your delivery? [Blank]\n\n3. MEAT AND FISH\n\nWhat was your meat supply in the early years? [Blank]\n\nHow often did you get fresh meat? [Blank]\n\nDid you raise any animals? [Blank]\n\nWas there a \"meat ring\" in your neighborhood for a very short time? [Blank]\n\nIf so, what year was it organized? [Blank]\n\nDid you join? [Blank]\n\nFor how long? [Blank]\n\nThat part did fish play in the family diet? [Blank]\n\n4. ANNUAL MEETING\n\nOn the fish trough, cured, or canned? [Blank]\n\nKinds of fish bought, purchased, or ordered? [Blank]\n6. BEVERAGES\n\nWhat kind of tea did you buy? (Unsurely Red Label Blue Ribbon)\nWhat kind of coffee did you buy? (beans or ground) Both\nPrice? ................. That other beverages were used? Coffee\n........................ Water, sugar, Portland\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? No\nIf not, where from? Grow them\nWhat year did you first grow your own supply for the winter of: 1901\nPotatoes ......... Cabbage ......... Carrots ......... Onions ......... Turnips ......... Beets ......... In what quantities did you buy white navy beans? None\nHow did you buy prunes, (in bulk or by the box)? Both ways\nWhat weight? .......... How did the grocer handle prunes (by box)? ...\nWhat was the price of prunes? 12 to 15 cents\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\npeas? .......... corn? .......... beans? .......... Saskatoons? Sometimes\nother foods? .......................................................\nWhat year did you first preserve fruit by canning? ......................\nWhat year did you first preserve vegetables by canning? ......................\nWhat year did you first preserve meat by canning? ......................\nDo you still preserve foods by canning or drying? ......................\nTo what extent? For home use\nDid you make your own vinegar? No, Some did\n6. **BEVERAGE**\n\n   - What kind of tea did you buy? Usually, Red Leaf, Black Ribbon.\n   - What kind of coffee did you buy? (Strong or cream) - Pretty.\n   - What other beverages were in your cabinet?\n\n7. **VEGETABLES**\n\n   - What was the price of potatoes per bushel? You eat up housekeeping?\n   - If not, where from? Your own supply for the winter of 1941.\n   - What year did you first grow your own supply for the winter of 1941.\n   - Potatoes, Cabbage, Carrots, Onions, Turnips, Beets.\n   - In what quantities did you buy while navy bonus?\n   - How did you buy prunes, (in bulk or by the box)? Both.\n   - What weight? For did the grocer handle prunes (by box)?\n   - That was the price of prunes? 12¢ each.\n   - What other dried fruits did you use in the surplus days? (apricots, peaches, apricots, pears, plums, raisins, currants, or others)?\n   - Did you make your own vinegar? Yes.\n\n8. **PRESERVES**\n\n   - In the early years did you preserve any foods by drying? No.\n   - Other foods? Beans! Sardines!\n   - What year did you first preserve fruit by canning?\n   - What year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent? For home use.\n   - Did you make your own vinegar? Yes.\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Your you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Am. you usually bought at one time. | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                     |                     |\n| Macaroni              |                                               |                                                   |                                     |                     |\n| Graham flour          |                                               |                                                   |                                     |                     |\n| Brown sugar           |                                               |                                                   |                                     |                     |\n| Molasses              |                                               |                                                   |                                     |                     |\n| Table salt            |                                               |                                                   |                                     |                     |\n| Common salt           |                                               |                                                   |                                     |                     |\n| Lily white syrup      |                                               |                                                   |                                     |                     |\n| Toilet soap           |                                               |                                                   |                                     |                     |\n| Baking powder         |                                               |                                                   |                                     |                     |\n| Baking soda           |                                               |                                                   |                                     |                     |\n| Dried peas            |                                               |                                                   |                                     |                     |\n| Dried corn            |                                               |                                                   |                                     |                     |\n| Vinorar               |                                               |                                                   |                                     |                     |\n| Raisins - seeded      |                                               |                                                   |                                     |                     |\n| seedless              |                                               |                                                   |                                     |                     |\n| Rice                  |                                               |                                                   |                                     |                     |\n| Currants              |                                               |                                                   |                                     |                     |\n| Store jam - kinds?    |                                               |                                                   |                                     |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                   |                                     |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ...............................................................\n\nDid you make yeast for your own use? Yes .......... Using starter? ..............\n\nUsing hops? Sometimes .......... Salt rising? .........................................\n\nDid you buy baking powder? Yes .......... Baking soda? Yes .....................\n\nCream of tartar? Yes .......... Did you make your own baking powder? No\nFOOD\n\nYour own flesh. (not eaten by you)\n\nFood\nIt's in this story\ndaily, 10 lbs., bought at\nstore, each time.\n\nSoda biscuits\nIn boxes, written about (2 x 2 inches, don't know).\n\nFlour\nWas sold by before I came here. Don't know.\n\nGraham flour\nCommon use\n\nBrown sugar\n\"\"\n\nTable salt\n\"\"\n\nCotton seed\nBarrel, because for cattle.\n\nLily white syrup\nCould be got.\n\nToilet soap\nCommon use\n\nBaking soda\n\"\"\n\nDried peas\n\"\"\n\nDried corn\n\"\"\n\nVinegar\n\"\"\n\nRaisins - seedless\n\"\"\n\nRaisins - seeded\n\"\"\n\nRice\n\"\"\n\nCurrants\n\"\"\n\nStore jar - kinds?\n\"\"\n\nChoose (Phodiar or store choice)\nVanilla\n\n10. BAKING\n\nWhat type of yeast did you use?\nYes, using starter?\n\nDid you make yeast for your own use?\nNo\n\nUsing hops? Salt rising?\nYes\n\nDid you buy baking powder?\nYes\n\nCream of tartar?\nYes\n\nDid you take your own baking powder?\nYes\n11. Please fill in the following to the best of your memory:\n\n| Food                  | Earliest date it appeared on the market | Approximate price at the time | Has did it differ from the same product today? |\n|-----------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon         | Common                                 | 12c to 15c                   |                                               |\n| Canned sardines       | were here                              |                              |                                               |\n| Other canned fish     |                                        |                              |                                               |\n| Apples - fresh        |                                        | 10c each                     |                                               |\n| dried                 |                                        |                              | Often used by some.                           |\n| Lettuce               |                                        |                              |                                               |\n| Tomatoes - fresh      |                                        |                              | Slew them.                                    |\n| canned                |                                        |                              |                                               |\n| Bananas               |                                        |                              | Don't remember seeing any.                    |\n| Lemons                |                                        |                              |                                               |\n| Oranges               |                                        |                              |                                               |\n| Cornflakes            |                                        |                              |                                               |\n| Other prepared        |                                        |                              |                                               |\n| breakfast cereals     |                                        |                              |                                               |\n| - give names          |                                        |                              |                                               |\n| Pearl tapioca         | In use                                 |                              |                                               |\n| Minuto tapioca        | Don't know                             |                              |                                               |\n| Sago                  | In use                                 |                              | Scarce                                        |\n| Dates                 |                                        |                              | Scarce                                        |\n| Walnuts               |                                        |                              | Scarce                                        |\n| Icing sugar           | In use                                 |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) Slough & Rain Water. Dugout Not Known.\n\nHow far was this water from your home? 2 miles lake across one side & 3/4 mile on other side.\n\nHow was it brought to the home? (pail, barrel, tank) Pail & barrel.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout) ________\n\nIf so, from what source? ________\n\nWas it brought to the house? (pail, barrel, tank) ________\n\nAny arid water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\n______\n13. SOAP\n\nDid you buy laundry soap or make your own? Buy, Neighbor made.\n\nIf you made your own, did you use lye? Yes. Wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Pea Cream, others.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? Wood, from 20 to 30 miles South.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nCoal came in after 1905. Some it miserable stuff.\n\nThe past 3 or 4 years Oil has been used by some.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Never heard of such things here.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Moore, Eastern Canada.\n\nWhat year was it purchased? Don't know. Price? Don't know.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron, kettles, iron pots for boiling, tin utensils.\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware, enamel.\n\nWhen did you first see enamel ware? Here before I was.\n\nAluminum?\n13. **Fuels**\n   - Did you buy lumber and make your own firewood?\n   - If so, did you use it? Did you have any trouble getting it?\n   - What kind of fuel did you use in the earliest days?\n   - What did you use your O.M.I. (oil) for?\n   - Did you use an outdoor fireplace or stove?\n\n14. **Fuel**\n   - Did you use an outdoor fireplace or stove?\n   - Did you use an indoor fireplace or stove?\n   - Did you use an outdoor fireplace or stove?\n\n15. **Cooking**\n   - By whom was your first cook stove made?\n   - What type of utensils did you use?\n   - For preparing food?\n   - When did you first use electric stove?\n   - Aluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBacon & Eggs\nMeat of some kind with potatoes, other vegetables perhaps.\nAll the year. Milk Pudding, Suet puddings, Cakes\nMy husband Christopher Theodore Gay died 1923, age 59.\nMy Mother Mrs Grundy died 1916, age 82.\nMyself.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? ......................... Give the menu. List those present and give their approximate ages at that time.\n\nServed our first Christmas dinner in 1902.\nChristmas 1901. My husband was threshing at a neighbour's (Charles Watson).\nPresent: Just ourselves.\nMince pie. Rum Pudding. Roast of Beef, Vegetables.\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo! No! Fat & hefty.\nNo sickness, no doctors.\nLots of hard work.\nKept us sound, probably.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the date and list the members of the family with their ages at the time. Also give approximate monthly expenses.\n\nBacon & Eggs\nMeat & Gravy\nMashed Potatoes\nBroccoli\nCarrots\n\n18. What did you serve your first Christmas dinner in 1902?\n\nChristmas 1901. My husband was working at a neighboring farm (Charlie Affinton).\n\nPresent: Turkey, Ham, Bread, Vegetables.\n\n19. Have you ever refused to almost starvation level living on two or two locally produced foods? Give details.\n\nNo! No! Fat & healthy.\n\nNo sickness, no doctor.\n\nLots of hard work.\n\nKept no records, probably.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared and home-preserved foods? (Give as many details and dates as possible.)\n\n22. Please list foods from which you have purchased food during the past year. Include those not listed above, quality, price, and where purchased. Use back of paper if needed.\n\n*Please list foods from which you have purchased food during the past year. Include those not listed above, quality, price, and where purchased. Use back of paper if needed.*\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1901_92.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 854, 5], [854, 1888, 6], [1888, 3343, 7], [3343, 4242, 8], [4242, 5794, 9], [5794, 7103, 10], [7103, 11739, 11], [11739, 12541, 12], [12541, 16405, 13], [16405, 16753, 14], [16753, 17943, 15], [17943, 18567, 16], [18567, 19770, 17], [19770, 20442, 18], [20442, 21039, 19], [21039, 21559, 20], [21559, 21559, 21], [21559, 21559, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]