[{"id": "909bdf35cdaf595afcd462c1f7aebd3f5b6969b9", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other; some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada for 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of caution: In the past, answers to this questionnaire have been used to prepare a general questionnaire on pioneer life because no individual who has answered exactly the same experiences as others may prove important for you to answer, so don't worry about having blank spaces.\n\nDon't be afraid to answer if there is not sufficient room to answer the question. This questionnaire is intended for anyone who lived in western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire\n\nNo. 2\n\nPioneer Experiences\n\nA General Questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as others. Some of the questions have all not apply to your experiences; others may prove important for you to answer, so don't worry about having blank spaces.\n\nDon't be afraid to answer if there is not sufficient room to answer the question. This questionnaire is intended for anyone who lived in western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES; A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .............................................. Percy Hansford\n2. Your address .................................................. 7581 Rosewood St., Burnaby, B.C.\n3. Date .................................................................... October 13th, 1974.\n4. Where were you born? (Give name of place and country)....................................................... Bridport, Dorset, England.\n5. What was your father's name and occupation? ................................................................. Harry Symes Hansford, Master Butcher.\n6. When did you come to Saskatchewan? (Give month and Year) ........................................... April 1905.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). ..................................................... 19 Years.\n9. What were your reasons for coming West?\n\n[Handwritten text not legible]\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n[Handwritten text not legible]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have heard it please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: \n2. Your address: \n3. Date: \n4. Where were you born? (Give name of place and country): \n5. What was your father's name and occupation? \n6. When did you come to Saskatchewan? (Give month and Year): \n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. \n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) \n9. What were your reasons for coming West? \n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?) \n\n[Handwritten answers follow]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .............................................. Percy Hansford\n2. Your address .................................................. 7581 Rosewood St., Burnaby, B.C.\n3. Date ............................................................ Monday, March 18th, 1974.\n4. Where were you born? (Give name of place and country) ........................................... Bradford, Dorset, England.\n5. What was your father's name and occupation? .......................................................... Harry Symes Hansford, Master Butcher.\n6. When did you come to Saskatchewan? (Give month and Year) ..................................... April, 1906.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ................................................................. 19 years.\n\n9. What were your reasons for coming West? ...........................................................................\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ...........................................................................................................\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your direction.\n\n1. Your full name: Percy Hansford\n2. Your address: 7381 Bannock & Burnaby Rd., BC\n3. Date: October 18, 1974\n4. Where were you born? (Give name of place and country): Bradfield, Ontario, England\n5. What was your father's name and occupation: Stanley James Hansford\n6. When did you come to Saskatchewan? (Give month and year): April 1910\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was a small child,\" etc.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information?\n\n11. What was your first job in the West?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Westem Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other occurrences, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nVery late that I forget what we had our dinner. I think I was very late getting home. I walked a couple of miles away from town. I could not afford a taxi. I walked back to town after dark. My parents were worried about me. We went to bed early and went to sleep.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. In the any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVery late because I kept working at the same time.\n25. When was the first car used in the community? 1912 (affix)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did people begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order, and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFrom 1911 to 1930, we purchased clothing, shoes, groceries, etc., from wholesale stores. After that, we purchased clothes, groceries, etc., from local stores. We also purchased meat, dairy products, and other goods from local stores.\n\n32. When did you first have a telephone and what company provided it?\n25. When was the first car used in the community? 1912 (Poveshell)\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Online (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in this proportion since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThey knew a lot of an acre young farmers and many ambitious to become successful farmers or other reasons. All of whom moved away.\n\n35. Did many people move away during the 1920s? Did many return?\n\nVery few moved away then. Only a few went west.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible.\n\nSuch as owning the first automobile, combining, organizing the first lodge, etc.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of the adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. What are the main industries of the district?\n34. Did any people move away from your district prior to 1917? What reasons did they have?\n\nThey moved away because of an acute financial condition.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThey moved away due to a lack of jobs and opportunities.\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"fifty\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person responsible for naming place-name (2) origin full meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n---\n\n[Handwritten text not legible]\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few. Most of us were young (completing) and many ambitious to become successful farmers or stock raisers. Most who moved went to farms formerly owned by relatives.\n\n35. Did many people move away during the 1930s? Did many return?\n\nVery few moved. Many town & city dwellers were satisfied by the soil, its settle on our ancient range thus curtailing our means of expanding. Very few of these city new comers stayed but returned to the cities as soon as possible. A few (very few) remained and became town site farmers.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a rural school trustee until the formation of our school trust No. 64 in 1945, when I was elected to the new trust Board of Trustee for said trust representing that said trust continuously until our leaving said in 1954. During the latter period I was required to act as \"helper\" to any young teacher unable through disciplinary or curricular difficulties to make satisfactory progress. By now our son was able to manage our land.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe did not consider ourselves to be numbered among the \"first,\" but I grew to know hundreds of settlers not of Canadian origin, through good opportunities such as Census taking, Returning Officer on Federal, Provincial and Municipal levels and other matters. This opened a working knowledge of several languages which proved invaluable.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPullinger, named by a resident whose ancestors hailed from county of West Meath Ireland. Pallet Lake, when tradition says that the first settlers then inhabited on Pallets for food and lake water for drink. Day Lake—(really a wonder district)—named romantically by a family from Gloucester England. Post Office named to honor the name of the village they served. Most rural schools have not been abandoned since the advent of Consolidation or Consolidated schools—a distinct advantage for the ambitious pupil, but bitterly resented by early residents who since this inception have recognized the advantages for their children and become champions of the change ours.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nVery few, if any, are young (camping) and many are old (farmers).\n\n35. Did many people move away during the 1920s? Did many return?\n\nVery few moved away, but many returned.\n\n36. If you or some members of your family have held public offices or have been active in any organizations, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were involved in organizing the first lodge, etc.,\n\n38. How did the place in your community get its name? (School districts, Post Offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) name that once existed, (2) date of person suggesting place-name, (3) origin and meaning of the name, (4) date of its adoption, (5) any changes in name since the first use, (6) given data and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nP.S. I would suggest the inclusion in these questionnaires of an envelope, in which to mail the required information. It might encourage and facilitate completion and return of information requests. May I also look in envelopes of the size and durability required.\n\nHansford Percy\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters, programs, minute books of community organiza-\n   tions, old pamphlets, old photographs, written recollections and remini-\n   cences? (describe).\n\nWould you of the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives division of the Legislative\n    Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other persons who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3502.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5964, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1514, 5], [1514, 3406, 6], [3406, 4991, 7], [4991, 5971, 8], [5971, 7666, 9], [7666, 8757, 10], [8757, 9421, 11], [9421, 10086, 12], [10086, 10757, 13], [10757, 11691, 14], [11691, 12208, 15], [12208, 12931, 16], [12931, 13984, 17], [13984, 14774, 18], [14774, 15968, 19], [15968, 17002, 20], [17002, 19863, 21], [19863, 20807, 22], [20807, 22085, 23], [22085, 23015, 24], [23015, 23171, 25], [23171, 23325, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]