[{"id": "0f46a4657561f08c85a71ebc81520de37e3db1c8", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name ROBT. JOHN SHAW\nPresent Address PIERCELAND\nPioneer Address LORETTIE MAN\nYear you came to Saskatchewan 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 5\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? five\n\nHow many of these were bachelor's homes? mostly all\n\n2. How often did you usually visit neighbors? in summer or sunday, in winter\n\n3. Did you usually visit on a Sunday, or other days? yes\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? always welcome\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? \n\nWhat about meals? Did you stay when not invited beforehand? yes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThreshing, Hauling the wheat long distance, Saving wood\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe:\n\nyes, dancing was the main amusement in the winter\n\nThe square dance and some waltz\n\nWere these more frequent in later years? Give dates. no\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? I don't think so, mostly at places where there was the most room and suitable floor\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? For example, on Sundays or other days?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? — in the morning and around the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded where people had come unexpectedly? (That is, was the term to make polite? usual, or was some other expression commonly used?)\n\nIf no meal, what other refreshment might be offered to visitors who had not been invited?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there easy parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, — every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. If you have not described these on the School Questionnaire). Give dates.\n\nNo dances, school concerts, school meetings, annual, meetings, to arrange for school picnic from town meetings, or sometimes political meetings.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\njust for your\n\n9. When was your first community hall built? 1934\n\nWhat material was it made of? Concrete How large was it? 40' x 80'\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Community\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nmade full use of the hall\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Generally\n\nHow were babies and small children provided for? In some cases where clothing was just cheap, were easily made\n\nHow were horses sheltered and fed in the winter time at these parties? Generally over crowded in a barn as teams were used\n\n11. What card games were popular in the early days?\n\nFive Hundred, Rummy, Pinochle, Forty-Four, Whist\n\nWas there card playing for a prize? Not often\n\nWhat dances were popular?\n\nSquare dance Waltz\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nvery little if any\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\na certain amount didn't approve\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, poinsettias, etc., if you have not described these in the school questionnaire.)\n\n9. When was your first community hall built? What material was it made of? How large was it? How was it used?\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\n12. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\n13. Was the chivaree known in your community?\n   Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Saskatchewan Grain Growers\n   Give the date and reason for it being organized.\n   Dissatisfied with marketing of grain principal reason\n\n16. Was there a Saskatchewan Grain Growers local in your community? yes\n   Tell when it was organized, and what steps led to its organization. 1967\n   Dissatisfied with grain marketing conditions\n   Approximately what proportion of the farmers in the community belonged to it?\n   How many women belonged? 40%\n   How often did it meet? every two weeks\n   What were some of the activities carried on by this organization?\n   First, farm problems, marketing etc., then card dancing debates spelling matches\n\n17. Was there a Homemakers' Club in your district? no\n   When was it organized?\n   Approximately how many women belonged to it?\n   Describe what you remember of its activities and services.\n3.\n\n12. What attempts at formality, or \"etiquette,\" do you remember in small towns, such as glances and looks when calling, calling cards, visitors treated ceremonially in parlor, etc.? Describe what you remember about chivalry, telling who among they were, any incidents connected with them, etc.\n\n13. Was the chivalry known in your community? Describe any other details of visiting, parties, etc., that you remember, telling of any fines or punishments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any fines or punishments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each; date when it was first organized; its activities and purposes; who belonged (men, women, young people?); whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\nThe hat, box socials, fowl suppers, & jitterbug dances\n\n19. Where did various organizations hold their meetings? Community hall\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? A little.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nRev. Townley and Dr. Martin used to give us lectures every week during one winter in the community church conditions in Ireland, were very well attended.\n\nDid you often have magic lantern shows? Some. Give dates if possible.\n\nWho provided the lantern and the slides? A local resident family home made affair young people of the community\n\nWhat were the slides about? Showed the glass and drew pictures of people, the local teacher being the most popular\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Base ball, foot ball racing\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Ring around rosie, drop the handkerchief\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities, and purpose. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\nThe key to success, food drives, + public buy drives\n\n19. Where did various organizations hold their meetings? Community Hall\n\n20. Tell us about your experiences with magic lantern shows. Give dates if possible.\n\nWho provided the lantern and the slides? A local resident\n\nWhat were the slides about? Stories of the community\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.)?\n\nBaseball, football, racing\n\nWhat games did girls play in summer (jump rope, play house, etc.)?\n\nJump around, dance, etc. The Saturday\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *hide & seek, hopscotch, skating*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *checkers, cards, authors, darts*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *not often*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *often too busy*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n**PICNICS AND SPORTS**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *July 1908*\n\n26. Who organized it?  \n   *homesteaders*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *to get acquainted*\n\n28. Was it the first picnic held in the community?  \n   *yes*\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *pick up ball game, lunch and dance in the evening outside on a platform built for the purpose*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *yes*\n\n31. What did you have to eat and drink?  \n   *Tea, sandwiches, pie, cake*\n\n32. What time of the day did it start, and how long did it last?  \n   *afternoon and evening*\n22. What winter games were played outdoors - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as whist, pinochle, mahjongg or other checkerboard or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buckskin horses, arrowheads, grapes or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnics you attended (ball games, races, band, etc.)? Just off ball games and dance in the evening outside on a platform built for the purpose.\n\n30. That arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nHomesteaders telling about their experiences with their own, of some going into the sloughs with the flock, or others refusing to go up the field again and start for the barn when the flock got lost.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nLarger picnics after railway came at the new trading centre organized sport such a ball from different districts have relay race for all, refreshment booths lunch hot dog, home made lemonade and ice cream.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nPicnics today are really ball tournaments the most attractive sport, refreshments served creamy ice cream, coke, hot dog, pans.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nFoot Ball and Horse Shoes throwing balls at a man behind a canvas with a hole in canvas, for cigars.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFoot ball\n\nWhat year? 1901 How long did it continue? 5 yrs\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nHockey in 1909 Curling 1937\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (early women, mostly young people).\n\nFoot Ball and Horse Shoe Throwing held at\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1902\n\nHow long did it continue? 1903\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, in what sport(s), and tell something of their activities - played games, won prizes, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Starting in 1937\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1907\nDid it grow out of or replace the earlier community picnic? yes\nWho was responsible for starting the first sports day? school\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July 1st\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nno\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? yes When was it begun? when school was built\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. When did annual reports begin? (Give date)\n\n41. Did it grow out of or replace the earlier community plans?\n\n42. Who was responsible for starting the first sports day?\n\n43. What was the sports day usually held? (What month, or any special day, such as May 25th or July 4th.)\n\n44. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible; if not, tell as nearly as you can how many books you had.)\n\n43. How many of your neighbors brought books with them?\n\n44. What kind of books and how many?\n\n45. To what extent did you exchange books with neighbors?\n\n46. Did you buy many books after you came west? Give details.\n\n47. What books were sent to you as gifts in early years?\n\n48. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n49. Was there a school library? When was it begun? When did you begin to read at home?\n\n50. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?  \n   When was it started?  \n   Who started it?  \n   Is it still in existence?  \n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nnot to any great extent\n50. Has there ever been a community library in your district or town? \n   When was it started? \n   Is it still in existence? \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to [place name].\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the post office do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? [Handwritten: \"fiddle\"]\n\n57. What instruments did any of your neighbors have? [Handwritten: \"the harp\"]\n\n58. What musical instruments have you bought since you came to the west? [Handwritten: \"guitar, dates, prices if possible, and tell where you bought them.\"]\n\n1948 - $2\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? [Handwritten: \"yes\"] When was it started? [Handwritten: \"1910\"]\n\nWho started it? [Handwritten: \"Erie Hagen\"]\n\nHow long did it continue? [Handwritten: \"1915\"]\n\nHow many were in it? [Handwritten: \"about 15\"]\n\nWho was bandmaster? [Handwritten: \"Erie Hagen\"]\n\nWhat instruments were included? [Handwritten: \"I can't remember all\"]\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nA good start was made and the band played at a great number of sport days, in 1915 a great number of the boys went overseas and the band got split up.\n56. What musical instruments did you bring west with you? (list)\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? (list)\n\n59. How large a part did singing and other forms of music play in your home life, in the community? (were there musical concerts, was there a singing club, etc.) Describe.\n\n60. Tell me some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, who started it? How many were in it? About how many were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nA good deal was made of the band playing at a great number of fair days, in 1911 a great number of fair days. The boys went around and the band got their fix.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the national world? Give names and dates and places if possible.\n\n65. In what was important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, etc., arranged? Give details of this collection, telling when you started it, how you began, what you have collected in it, and could anything be connected with it, and so forth.\n\n67. Did you make notes of the weather, times of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer day; not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1905N-Z_2049.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7527, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1185, 5], [1185, 1185, 6], [1185, 3015, 7], [3015, 4593, 8], [4593, 6723, 9], [6723, 7579, 10], [7579, 9175, 11], [9175, 10774, 12], [10774, 12486, 13], [12486, 13417, 14], [13417, 15037, 15], [15037, 16383, 16], [16383, 18301, 17], [18301, 19517, 18], [19517, 20831, 19], [20831, 21986, 20], [21986, 22968, 21], [22968, 23893, 22], [23893, 25486, 23], [25486, 26620, 24], [26620, 27740, 25], [27740, 28839, 26], [28839, 28839, 27], [28839, 28993, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]