[{"id": "dfb054f08ae822aff27b3c04e018dc5cdcb16064", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan ______________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n   There were plenty. Twenty or more.\n   How many of these were bachelor's homes?\n   A dozen or more.\n\n2. How often did you usually visit neighbors?\n   In the winter once or twice a week.\n\n3. Did you usually visit on a Sunday, or other days?\n   We always attended the church service.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n   For parties it was invitation but at other times were welcome at any time.\n\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?\n\n5. Generally for the evenings,\n   What about meals? Did you stay when not invited beforehand?\n   Always welcome at any time.\n\n   How was the invitation to a meal worded when people had come unexpectedly?\n   (that is, was the term to \"teke petluck\" used, or was some other expression common?)\n\n6. If no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n   Usually a lunch and tea or coffee.\n\n7. Did the whole family go, or did someone stay home to \"look after the place\"?\n   Generally the family.\n\n8. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n   The ladies aid of the Church held sewing and quilting bees often.\n\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nOne spring there was a neighbor in the district sick and bed fast in seeding time so about a dozen farmers made a bee and put his crop in for him. Two cleaned and treated the grain and the others, some tilled the land and the rest drilled it in. If I remember right we completed it in less than three days. The neighbor was John Lott and he had a wife and family. This was back in 1911 or 12.\n\n9. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nThere were dances and cards for those who did not care to dance in the homes that were large enough.\n\nWere these more frequent in later years? Give dates.\n\nThey were less in the homes after a hall was built in town and more central.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\n\nNo.\nNEIGHBOUR VISITING, PARTIES, ETC.\n\n1. In the last five years, how many houses were near enough to you for visiting?\n\nThere were plenty twenty or more, a dozen or less.\n\n2. How often did you usually visit neighbors?\n\nIn the winter once or twice a week.\n\n3. Did you usually visit on a Sunday, or other days?\n\nGenerally for the evening.\n\nWhat was the invitation to a meal served when people had come unexpectedly?\n\n(That is, was the term to state publicly used, or just some other expression common?)\n\nAlways welcome at any time.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\nUsually a lunch and tea or coffee.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\" generally the family.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nOne spring there was a neighbor in the district sick and had fast in sending time so about a dozen farmers made a bee and put his crop in for him. The \"bee\" was not treated like a rain and the others came tillled three days. The neighbor was John Lott and he had a wife and family.\n\nThis was back in 1911 or 1912.\n\n7. In the earliest years that you were here, were there any parties, drives or dances in homes? Describe.\n\nThere were dances and cards for those who did not care to dance in the homes that were large enough.\n\nWere these more frequent in later years? Give dates.\n\nThey were less in the homes after a hall was built in town and more central.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times; every two weeks once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire.) Give dates.\n\nTill the hall was built the school was used for all social events. The seats could be moved to seat large crowds. It was used for church, plays, box socials, lodges and all public meetings. It was built in the fall of 1905.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n   It was built about 1912 or 13.\n   What material was it made of? How large was it?\n   It is lumber construction with cement foundation. 30\" X 50\".\n   Who built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\nIt was built in town, in town and county, and township.\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n    Yes as far as I know.\n    How were babies and small children provided for?\n    There were always plenty of room.\n\n    How were horses sheltered and fed in the winter time at these parties?\n    The church built a shed (24 x 40) and they allowed it to be used at all times. At house parties in the county the farm stables were used. Schools all had stables.\n\n11. What card games were popular in the early days?\n    Pedro and Euphre.\n\n    Was there card playing for a prize?\n    Just small prizes as I remember.\n\n    What dances were popular?\n    Scotch, Square and Round dancing.\n\n    Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n    There may have been but none that I know of.\n\n    Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n    There may have been some but not of my knowledge.\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, \"Pioneer Days,\" etc.)\n\nTill the hall was built, the school was used for all social events. The seats could be moved to seat larger crowds. It was used for church, play, box socials, lodges and political meetings.\n\nIt was built in the fall of 1954.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nIt was built about 1921 or 1925.\n\nWhat material was used in the foundation? How large was it?\n\nIt is not known.\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nIt was built in town as a town hall, community and school house as a place for entertainment, dance, etc., but not for the school house as a place for school functions.\n\nFor what purpose was it built? (For example, if you lived in the country, did you have to travel to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nYou can refer to the question above.\n\nHow were babies and small children provided for?\n\nThere were always plenty of rooms.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nThe church built a stable (24 x 40) and they allowed it to be used at all times. At house parties in the country the term stables were used, although all had stables.\n\n11. What card games were popular in the early days?\n\nPedro and Parcheesi.\n\nJust small prizes as I remember.\n\nScotty, Square and Round Dancing.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nThere may have been but none that I know of.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings?\n\nThere may have been some but not at my knowledge.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? There were never any attempt to have an upper crust or the Four Hundred Club in this district.\n\n13. Was the chivaree known in your community? There were two that took place with the early settlers. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\nThe Modern Woodmen of America. The Loyal Orange Lodge.\nGive the date and reason for it being organized.\nWoodmen in 1907 as a large number belonged in the States and had to send their dues back home so it made it more convenient and a number of new members wanted to join. The Orangemen for the same reason. They were both strong organizations for a long time.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\nYes\nTell when it was organized, and what steps led to its organization.\nIt was organized in 1906 or 07. Was started for the betterment of the Sask. Farmers. We were about to lose our rights to ship our wheat direct to the head of the lakes. This was one and there were numerous grain trade tricks we had to combat and our only way was organize.\nApproximately what proportion of the farmers in the community belonged to it?\nI would think over eighty percent.\nHow many women belonged? How often did it meet?\nOnly a small number of ladies. Meetings were held twice a month in the winter season.\nWhat were some of the activities carried on by this organization?\nFor entertainment we had a series of debates and each took their turn when called upon.\n\n17. Was there a Homemakers' Club in your district?\nYes\nWhen was it organized?\nIn the early days but cannot give the year.\nApproximately how many women belonged to it?\nI would say perhaps forty at its peak of membership.\nDescribe what you remember of its activities and services.\n12. That attempt at formality, or \"snark,\" do you remember in small towns, such as Butler, or even calling visits, calling visits? Villagers visited occasionally.\n\nThere were two that took place with him early settlers, telling how common they were.\n\n13. Was there any other details of visiting parties etc., that you remember?\n\nTell us any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n14. What was the name of the first organization of any kind that you can remember being established in your community?\n\nThe Modera Woodmen of America.\n\nThe Loyal Orange Lodge.\n\nGive the date and reason for its being organized.\n\nWoodmen in 1907 as a large number belonged in the States and had to send their dues back home so it made it more convenient and a number of our members wanted to join. The Orange men for the same reason. They were both strong organizations for a long time.\n\n15. Was there a Basketmakers Grain Growers Local in your community?\n\nYes, Fall when it was organized, and what steps led to its organization.\n\nIt was organized in 1905 or 06 was started for the betterment of the local farmers. We were about to sell our rights direct to the head of the lake. This was one and there were numerous grain trade trouble we had to combat and our only way was organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nI would think over eighty percent.\n\nHow many women belonged?\n\nOnly a small number of ladies.\n\nMeetings were held twice a month in the winter season.\n\nWhat were some of the activities carried on by this organization?\n\nFor entertainment we had a series of debates and each took their turn when called upon.\n\n16. Was there a Homemakers Club in your district?\n\nYes.\n\nWhen was it organized?\n\nIn the early days but cannot give the year.\n\nApproximately how many women belonged to it?\n\nI would say perhaps forty to fifty.\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1920, giving the name of each, date when it was first organized, its activities and purposes (who benefited from it, who joined, how people felt), whether it included people only in one relatively small area (for example within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nI think it was in 1907 a Mr. Fisher from Regina came to Girvin and started a singing class. There was a couple lived in the district. They were from England and she was a trained singer and was instrumental in starting it. They chose a group from the class and trained them in a light Operetta, (The Bell of Barnstable,) which was a big success. We were invited all over where there was a hall and stage large enough to play it. There were about fifteen in the cast. Later years we had a dramatic club and would play nearly every winter. The twenty-fourth of May was our day for celebration and would finish the day with these plays. Some of the plays were The Private Secretary, Sallamy Trial, With in the Law, Smiling Through and several others. I have taken parts in a dozen plays.\n\nWhat means were commonly used by organizations for raising money?\n\nPlays like I have mentioned.\n\n19. Where did various organizations hold their meetings?\n\nWe used the school till the hall was built.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nNo.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nNo.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBaseball in the summer and skating and Hockey in the winter.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n4.\n\nName any other organizations that were in existence in your community before 1914, stating the name of each, (if known it was first organized), its activities, and property (if belonging to organization people), whether it had a district, or was centered in the town or village, and its relation to the surrounding community. (There is space in the church questionaire for organizations connected with the church, so they need not be included here).\n\nI think it was in 1907 Mr. Fiskar came to Olean and started a singing class. There was a couple lived in the district. They chose a group of children and she was trained there over where there was a hall and stage large enough to play in. There were about 15-20 in the class, and we had a great time. We went out on Elbow nearly every winter. The \"Country\" folk of May was also played. We had a great time. The players were the Pravda Senatery Balling Team, which is the only balling through and several others. I have taken part in a danceplaya.\n\nWhat games were commonly used by organizations for raising money?\n\nPlay like I have mentioned.\n\n19. Where did various organizations hold their meetings?\n\nWe used the school till the hall was built.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (smash-up, ball, marbles, fly kites, etc.)?\n\nBaseball in the summer and skating and Hockey in the winter.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Reel,\" \"Tinie,\" \"Alibarrel\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe first hockey club was organized in 1906. There were four teams in what was called the Northern Central League consisting of Lumsden, Craik, Davidson and Girvin. The Girvin team was Goal Clem. Reid, Defence Jack Young and Ed. Stewart, Rover H. Higgins, Center G. Vanstone, R. Wing Bert Vanstone and L. Wing Stan. Stewart. This team won the Hall Milling Co. Cup for three years in succession which gave them the right to keep it.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nHockey\n\nWhat year? How long did it continue?\n\n1906. Always have had a team.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nHad a football team and a baseball team who played in leagues and at sport days in towns around the country.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nOur first rink was built in 1906. Was used for skating and hockey. We had one of the best hockey teams in the early days. Curling rink was built in 1915 or 1916.\n\nWhen was the first indoor rink built, and what was it used for?\n\nWe never had a covered skating rink. Our curling rink was built after 1914.\n33. Describe any features of this place which you remember as outstanding.\n\n34. Name any different kinds of plants which you knew of in the early days, such as the large community plant, school or Sunday school plant, family plant, etc., tell about any differences in numbers attending, activities, food and drink, music, etc., etc.\n\n35. Give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe first hockey club was organized in 1906. There were four teams in the early days:\n\nNorthern Central League consisting of Leonard O'Grady, Davidson and Girton. The first team was Goal: Glen Reid, Defence: Jack Young, Rover: H. Miller, Quarterback: T. Smith, R. Ming, Bert Vandenbosch and L. Wilson. This team won the Hall Milling Cup, Cap for Terry's, for the second year running.\n\nHow long did it continue?\n\n1906.\n\n38. Name any other sports teams that were organized before 1910, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nHad a foot ball team and a base ball team who played in league and at sport days in town around the country.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nOur first rink was built in 1910, was used for skating and hockey. We had one of the best hockey teams in the early days. Our first indoor rink was built in 1915 or 1916.\n\nWe never had a covered skating rink. Our curling rink was built after 1914.\n40. When did an annual \"sports day\" become established in your community?\n   About 1909 or 10.\n   Did it grow out of or replace the earlier community picnic?\n   No.\n   Who was responsible for starting the first sports day?\n   The young men of the community.\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n   The twenty-fourth of May.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n   No.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n   Not that I know of. I never went to school or on the school board to have this information.\n\n48. Was there a school library? When was it begun?\n   There was a school library.\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" occur or established in your community?\n   (about 1920 or 1930)\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   The young man of the community held it? (what month, or any special day, such\n   as May 24th or July 4th)\n   The twenty-fourth of May.\n\n41. Are there any from your community who have become members of well-known\n    hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors if possible.) If not, tell as nearly as you can how many\n    books you brought, and what kind. (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n    What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any travelling library? Books in your community or elsewhere?\n    Give details and dates.\n    Not that I know of. I never went to school or on the school board to have this\n    information.\n\n48. Was there a school library?\n    When was it begun?\n    To what extent were books borrowed from the school library for adults to\n    read at home?\n\n49. Did parents ever use their children's school texts books as additional reading\n    material?\n50. Has there ever been a community library in your district or town?\n   Not that I know of,\n   When was it started? Who started it?\n\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   We have always had a daily paper since we came to this country. The first was The Manitoba Free Press for ten or twelve years. We then switched to the Regina Leader Post as it was called in those days, as it had Saskatchewan news and our home to be. We also took our old home paper (The Haldimand Advocate) for years till we did not know the people back there.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   No. Never heard of them.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   I still have an old Family Bible that belonged to my Grand Father on my Father's side. It is about 10 x 12 inches and three inches thick. Has the family records in it from his time on.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   No, I can not say we did as we always subscribed to Church papers and newspapers.\n50. Has there ever been a community library in your district or town? Who started it? When was it started?\n\nTo it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? We have always had a daily paper since we came to this country. The first was the Manitoba Free Press for ten or twelve years. We then subscribed to the Red River Advocate, which was called in those days, as it still is now, the Haldimand Advocate. For years till we did not know the people here.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No, never heard of them. Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? I still have an old Family Bible that belonged to my Grandfather on my Father's side. It is about 10 x 12 inches and three inches thick. Has the family records in it from his time on.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\nWe brought a Dominion piano with us and still have it and is in excellent condition.\n\n57. What instruments did any of your neighbors have?\nPianos and various instruments.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home-entertainment in early years in the West? Describe.\nI never played instrument myself but always enjoyed singing. I joined the first church choir in Girvin and the only one of the original one left. We had a large choir for years but has gradually faded away as the young people have not filled in the toll of the years.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nIn the early days the young people went in for singing more than they do today in the rural country. When we went to a dance there was always an hour of singing if there was a piano in the house. I think it was that there a young couple who loved music and singing and lead the bunch.\n\n60. What were some of the favorite songs in the home?\nAny of the old southern songs, The Scotch songs of Harry Lauder, Some of the old eastern songs and the latest hits as it is today.\n\nin the community?\n\nWould say the same as above.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\nYes.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\nNo.\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n57. What instruments did any of your neighbors have?\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your entertainments in early years in the West? Describe.\n\nIn Girvin and the only one of the original settlers who had a large choir for years but has gradually faded away as the young people have not filled in the toll of the year.\n\nIn the community? (were there musical concerts, was there group singing etc.)\n\nIn the early days the young people went in for singing more than they do today in the rural country. When we went to a dance there was always an hour of singing. If there was a piano in the house, I think it was that there was a young couple who loved music and singing and lead any of the old southern songs. The Scotch songs of Harry Landers. Some of the old eastern songs and the latest hit as it is today.\n\nIn the community?\n\nWould say the same as above.\n\n60. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nYes.\n\n61. Did you ever make up any of your own songs, or make up words to fit an old tune or a joke on somebody, or because of some special happening in the community? Explain.\n\n62. Was there a band in your community? Who started it? How long did it continue?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNo outstanding personalities.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusic is about the same but there was more singing in the early and pioneer days.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.?\n\nNo, my hobby was hard work and lots of it.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. In music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusical life about the same but there was more singing in the early and pioneer days.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, how many and lots of it?\n\nMy hobby was hard work and lots of it.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival, birds, blooming trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reaching music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2033.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 9431, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1244, 5], [1244, 1244, 6], [1244, 3703, 7], [3703, 5536, 8], [5536, 8017, 9], [8017, 10326, 10], [10326, 12694, 11], [12694, 14784, 12], [14784, 16971, 13], [16971, 18827, 14], [18827, 20082, 15], [20082, 21338, 16], [21338, 23388, 17], [23388, 25105, 18], [25105, 26603, 19], [26603, 28072, 20], [28072, 29703, 21], [29703, 31135, 22], [31135, 33148, 23], [33148, 34763, 24], [34763, 36042, 25], [36042, 37314, 26], [37314, 37402, 27], [37402, 37556, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]