[{"id": "45359b9baf0b353b1a4ecab6b92357841e0202f1", "text": "A word of explanation to the reader\n\nPreparing the questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences whereas may prove impossible for others so don't worry about leaving blank spaces.\n\nUse extra space or paper if there is not sufficient space to answer the question.\n\nDon't hesitate to give details or describe particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years at least four in his province or not.\n\nIt more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n() All questionnaires\n() Pioneer diet\n() Pioneer schools\n() Pioneer churches\n() Pioneer recreation and social life\n() Pioneer farming experiences\n() Pioneering in Saskatchewan\n() Pioneer health and housing\n\nPreservation of questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nMay 5, 1955\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer alcohol\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be prepared in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: [Name]\n2. Your address: [Address]\n3. Date: [Date]\n4. Where were you born? (Give name of place and country): [Place and Country]\n5. What was your father's name and occupation: [Occupation]\n6. When did you come to Saskatchewan? (Give month and Year): [Month Year]\n7. Mention any other places where you lived before coming to Saskatchewan:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child.\" If I am in my teens\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Radio or government information).\n\n[Handwritten text]\n\nThank you for your cooperation.\n\n[Signature]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing to your direction.\n\n1. Your full name: George Brown\n2. Your address: 2711 10th Ave\n3. Date: April 27, 1955\n4. Where were you born? (Give name of place and country): Wiltown\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year): January 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Winnipeg, Canada, Spring 1903 till May 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 at the time)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nGeorge Brown\n2711 10th Ave\nApril 27, 1955\n\nI would be inclined to say it was fate, and had no intention of coming west, until about a month before I came and intended to go to Australia. When I came to Western Canada, I was interested in reading about free homesteads in Western Canada.\n12. What did your friends and relatives think of your decision to come to West-\n\nern Canada?\n\nI don't know, but they were very enthusiastic\n\n13. What means of transportation did you use?\n\nBy myself\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nYes, meetings of the Journey West do you remember? People you met on the expedition, etc.\n\n14. What highlights of the Journey West do you remember? (People you met on the expedition, etc).\n\nAdding your reasoning exactly in suitable\n\nDid you ever consider moving away from your family to follow an adventure and when I told him he felt my friend to work I wouldn't move abroad it was\n\nhave asked it to know from the third the\n\ncame to finish a successful trip to town\n\nwould be easy to get yourself in town to start planning your\n\n16. Where did you settle or live up until\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you arrive at your final destination?\n\nHow, after you\n\nleft school and came from work at first\n\nattention for two summers, farming and road construction for the rest of the year attended only\n\ndecided though the winter the first two months,\n\nthen took to my hometown\n\nwork took to Winnipeg about the 1940s till spring 1945\n\nin the early decades of mid twenties for a summer\n\ntook to finish a successful and smooth deal for a summer\n\nafter living in my hometown and doing 36.96.80 acres\n\nnot any other places where you have lived since coming to Saskatchewan.\n\nwe\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you arrive at your final destination?\n\nHow, after you\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI don't know what they may have thought. I had never been there before.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nTrain from London to Scotland, then to Liverpool, England, boat to Quebec, train to Winnipeg.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, excitement, etc.)\n\nNothing very exciting except in Quebec when I met a man who was going and when I told him he felt my hand.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI came to South Qu'Appelle by train once then walked to Fort Qu'Appelle 18 miles hence to join my family.\n\n16. Where did you settle or take up land?\n\nThe Edgely district 9 miles from Qu'Appelle.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAfter filing on my homestead, I moved to Melfort, Saskatchewan about Nov. 1st, 1904 until May 1905.\n\n18. How did you earn money before coming to Western Canada?\n\nHow, after you left school when I was fourteen, worked at various stations for two summers, farming and road construction, the rest of the year attended day school through the winter the first two winters.\n\nAfter coming to W.O.B. worked in Ballyhoo in Saskatchewan.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sebastopol because of your recommendation? If so, please list names.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWriting was very important to the world had my uncle James Thomas and myself worked in 1849. This was the only year we could work for my father from morning until night. We started from San Francisco and went through Oregon and Idaho and then back to California. We arrived in Sebastopol in early December and then went to work for my father. I think we worked about two months and then returned to Sebastopol. We traveled by stagecoach, sailing, etc. How often have I been on these trips?\n\n24. Did you travel about much in the early years? For business, pleasure, or what?\n\nExcept a few trips with mom & dad\n\nNot very much just a few miles\n\nTraveling\n\n25. What was your life like in Sebastopol?\n\nAbout 1914 when mom began to get more common\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending school, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. How many miles from your home did you travel each year?\n25. When was the last car used in the community?\n\n26. If you owned a car before 1941, when did you buy it? What make?\n\n27. How far would you travel to work? How far from town?\n\n28. What was your traveling expense over that time?\n\n29. How often did you stop in the early days?\n\n30. What (if any) did people in your village like about going to work?\n\n31. What kind of recreation did you enjoy in those years? List three also what replacement of past travel purposes were by rail other than the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Beulah where was the first time you visited the town of Beulah?\n\n34. You make this statement. Do did you wake up your dad after trying it out? When did you make this declaration?\n\n35. As far as I know, not much of my mind yet. First I think it is obvious\n\n36. You said to yourself, \"I know how to handle the cold winter\n\n37. 1912 Ford Roadster from family\n25. What was the first car used in the community?\n\n1911\n\n26. Did you own a car before 1914 when did you buy it?\n\nFirst purchased 1913 model Ford T for $500.00 January 17.\n\n27. Where was your trading center (for time your home)\n\n28. Did you contribute to build school? (Indicate any changes due to new taxes especially better source of revenue, etc.)\n\n29. Have been trading in German since 1907\n\n30. How often did you shop at the early days?\n\nFirst three years I had no car then in the month and third to take an additional supply.\n\n31. How did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Tell us also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n1911 Last mountain Rural\n\n33. When you came to Rockingham the first time was it with the idea of staying permanently? If so did you make up your mind after trying it out? When did you make this decision?\n\nNo and I have not made up my mind yet. But I think it is about as good to phone as there when you learn how to handle the cold winter.\n34. Did any people move away from your district prior to 1947? What reasons\n\n35. Did many people move away during the 1930's? Did many return\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"effected\" to have or do something in the district mention it here listing dates whenever possible.\n\n38. Post offices, villages, railway stations, creeks, hills, etc., try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first time we heard of it (5) name as above in (1), (2), (3).\n\n39. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.)\n\n40. Any other comments in regard to our town (or village) in 1934.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes, a few moved some feet out to the city.\n\n35. Did many people move away during the 1930s? Did many return?\n\nA few moved but I don't remember anyone coming back soon enough to do better.\n\n36. If you or any member of your family have held public office, or have been active in any organization, mention it here giving dates wherever possible.\n\nI have been mainly interested in farm organizations, the C.C.F., and the Credit Union.\n\n37. If you or any of your family or friends were affiliated to any organization in the district mention it here giving dates whenever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nThe last something in our district was bought by Ed. Thompson (or neighbor) in 1936.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) date of its adoption (3) any changes in name since then.\n\nToby Thorewood School District organized in 1914\n\nIn 1914 Toby Thorewood School District organized in 1914\n\nDistrict named after a ridge of hills which could be seen from the district. Our Post Office has been named since 1909.\n99. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old newspapers, old photographs, minute books of community organizations, town, old newspapers, old photographs, written recollections and reminiscences (personal).\n\nI am giving the name of a neighbor who may be able to help.\n\nWould you or the person who owns this letter\n\n(1) be willing to lend them to the Provincial Archives for copying?...........\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan?\n\n........... (indicate your preference, if any) ........................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west\n\nSaskatoon, April 15th, 1963\n\nDear Mr. Johnson,\n\nThank you for your kind words.\n\nSincerely,\n\n[Signature]\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign and address below:\n\n[Signature]\n\n[Address]\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   letters, old photographs, written records of communities or families,\n   newspapers, etc., which may be of interest to others?\n\n   Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n       Assembly, Regina, or the Archives Office of the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\n    live and occupations.\n\n41. What do you think are the most important changes in your community since you\n    first came west?\n\n    *Yellowstone, Butter farms, better roads,\n    co-op organization and other organizations.\n    Butter producers of grain, the planting-west\n    killers and better line stock.*\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nGeorge Hilton, Emma's farm.\nCharles Thompson, Emma's farm.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here.\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_743.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4597, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1616, 5], [1616, 3138, 6], [3138, 3906, 7], [3906, 5190, 8], [5190, 6848, 9], [6848, 8279, 10], [8279, 9541, 11], [9541, 10280, 12], [10280, 11237, 13], [11237, 12459, 14], [12459, 13410, 15], [13410, 14758, 16], [14758, 16003, 17], [16003, 17195, 18], [17195, 17195, 19], [17195, 17347, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]