[{"id": "33b4c7862aca1e7d4d4ab69d827c36951ac93b63", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same experiences as many others. Some of them have not applied to your experiences and others may prove impossible for you to answer, so don't worry about leaving blank spaces or answers. If there is not sufficient space to answer the questions, please write to give details, or describe particular events. They help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1937, and may be answered by anyone who has personal experience of the pioneer years whether born in that province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches and social life\n- Pioneer recreation and experiences\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer history and biography\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... FERDER HANNAH FERDER\n2. Your address .............................................. WHITE BUTTE P.O. SASK.\n3. Date ......................................................... 1955\n4. Where were you born? (Give name of place and country).\n   VESTRE TOTEN, NORWAY\n5. What was your father's name and occupation?\n   OTTO SCHOW, FARMER\n6. When did you come to Saskatchewan? (Give month and Year).\n   JUNE 10, 1913\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   NORWAY, UNITED STATES,\n   1904-5, 1905-1913\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   9 yrs old.\n9. What were your reasons for coming West?\n   My parents reason for coming west, was to obtain land for themselves.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    From other people, who had come west.\n1. Your full name: Hannah Fender\n2. Your address: 918 N. 14th St., Saskatoon\n3. Date: 9/19/55\n4. Where were you born? (Give name of place and country): Vestre Toten, Norway\n5. What was your father's name and occupation: Otto Schoow Farmer\n6. When did you come to Saskatchewan? (Give month and Year): Jan. 10, 1913\n7. Mention any other places where you lived before coming to Saskatchewan:\n   Norway, United States, 1905-1913\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say I was a small child, \"I was in my teens,\" etc.): 9 yrs old\n9. What were your reasons for coming West? To obtain land for themselves.\n10. How did you learn about the West? (Through other people? Reading about it? Radio? Word or government information?): From other people who had come west.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought we had gone crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   No! With the family, including Father, Mother, 2 brother and myself.\n\n13. What means of transportation did you use?\n   Traveled by train & team from station, 10 mi out to where our friends lived.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At the home of friends.\n\n16. Where did you settle or take up land?\n   10 mi N.W. of Pelly, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Norquay, and now 17 mi of Allan Sask. near the Hamlet of White Birch.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   After I was grown up, I done homework until my marriage.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought we had gone crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNo, with the family, including father, mother, 2 brothers and myself.\n\n13. What means of transportation did you use?\n\nTravelled by train 4 times from Edmonton, 10 mi out to where our friends lived.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the farm of friends.\n\n16. Where did you settle or take up land?\n\nTo the N.W. of Pelly Creek.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoose Jaw, and now 17 mi of Assiniboia South near the Hamlet of W. Whitechurch.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nAfter I was grown up, I done farmwork until my marriage.\n19. How often did you write to relatives or friends in your old home?\n   At least once a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   BEN FERDER, SEPT. 22, 1921, at Yorkton, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   My oldest brother, who came west took up a homestead 12 mi north of Pelly, the same time as we did.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Yes, several.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Not too much. Either by team or walking. Distances varied from 2 to 10 miles.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Not too much. Either by team or walking.\n\nSaskatchewan covered from 3 to 10 miles.\n25. When was the first car used in the community? 1916\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Pelly 10 mi.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes.\n\n29. How often did you shop in the early days?\n   About once a month. Dad used to walk to Pelly for supplies.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   From our arrival in 1913, it was most commonly the custom to order clothing from either the T. Eaton Co. or Simpson's in Toronto. All clothing & shoes were purchased by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, if we could make a go of it. We intended to make Sack. our permanent home.\n25. When was the first car used in the community? 1916\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in this proportion or purchases made by mail order since the pioneer period.\n\nFrom our arrival in 1913, we were known for commonly the custom to order clothing from either the T. Eaton Co. or Simpson's in Toronto. All clothing, shoes were purchased by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIf yes, we could make a go of it. We intended to make Sask. our permanent home.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few\n\n35. Did many people move away during the 1930's? Did many return?\n\nNone\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur next Railway Station went, Morquay, was named after Sir John Morquay, named so by Mr. Hugh Wylie, who still resides at Morquay.\n34. Did any people move away during the 1920's? Did many return?\n\n35. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n36. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible (such as owning the first automobile, combining the first lodge, etc.).\n\n37. How did the places in your community get their names? (School districts, Post offices, villages, townships, stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any other facts of since the first name given, date and reason for change.\n\nOur first railroad station was named as by Mr. Hugh Smylie, who still resides at Morgan.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old poster and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nTwo children, 2 girls. Mrs. E. Hansen, Norquay, Sask.\nMrs. F. Gulekki, Waskada, Man. Bernard and Peter at home.\nAlso nine grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads, chiefly were thin were not even a foot path in 1913. Bridges were across streams had to be forded, or crossed by row boat or horseback. Even waded across when streams were shallow enough to do so.\nFarming has changed drastically from ox and horse power to steam, gas and diesel.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Hans Anderson, Norquay, Sask.\nMr. Hugh Wylie, Norquay, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of any old\n   letters, newspapers, old photographs, written recollections and reminiscences?\n   (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative\n   Library? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they\n    live and occupation.\n\n   Son: William J. Smith, Mrs. E. Hemmings, Anywhere, Sask.\n   Daughter: Mrs. W. Smith, Mrs. B. Smith, Anywhere, Sask.\n   Grandson: Mr. Smith, Mrs. Smith, Anywhere, Sask.\n\n41. What do you think are the most important changes in your community since you\n    first came West?\n\nRoads, churches, water, town hall, school, hospital, etc.\n\nIn 1913, bridges were built by new boats or ferries.\n\nFarmers have changed drastically from oxen and\nhorses to steam, gas and diesel.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nMr. John Anderson, Anywhere, Sask.\nMrs. Mary Smith, Anywhere, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1913_1220.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4595, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1665, 5], [1665, 3212, 6], [3212, 4632, 7], [4632, 5486, 8], [5486, 6528, 9], [6528, 7570, 10], [7570, 8524, 11], [8524, 9273, 12], [9273, 10631, 13], [10631, 11886, 14], [11886, 12996, 15], [12996, 13881, 16], [13881, 15396, 17], [15396, 16710, 18], [16710, 16710, 19], [16710, 16864, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]