[{"id": "dc886686d2c2b043f97785c49a09818bc61d3718", "text": "Please print name and address in capital letters.\n\nYour full name: JAMES ROBERT CRAWFORD\nPresent Address: Saskatoon, Sask.\nPioneer Address: Edgell School Dist.\nYear you came to Saskatchewan: 1902\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the QUESTIONNAIRE.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? We didn't mind driving 6 or 7 miles these days. How many of these were bachelor's homes? Around 6 or 7.\n\n2. How often did you usually visit neighbors? Once a year perhaps.\n\n3. Did you usually visit on a Sunday, or other days? Week days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Just when we took an interest. Everybody was welcome in those days.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Generally in the Afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? You would be very disappointed if you didn't stay for our meal.\n\nWas the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?) Everybody was glad to see anybody. The house was always filled back up.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? They would count an insult if you didn't stay for at least one meal.\n\n5. Did the whole family go, or did someone stay home to \"block after the places\"? Yes, but families were quite small in those days.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Sometimes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nQuilting bees as quilts were not any too plentiful in those times.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Yes, dances. I remember a surprise party came to our house in 1907 and there came up a blizzard so everybody stood until daylight next morning. Of course a suitable tally always brought lunch with them, the host provided tea & coffee every body welcomed. Were these more frequent in later years? Give dates. No\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times; - every two weeks, once a week, once a month, etc.? No only private meetings between close neighbors.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nBoy socials & Community dances, etc., whist drives\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? Where dances were held in the school\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Whist\n\nWas there card playing for a prize? Sometimes\n\nWhat dances were popular? Square usually\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. An odd one objected to dancing at first but later joined in\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Same as above but later joined in\n\nThe games\n8. Tell what was made of the school house (brick, stone, etc.), and other details (include all the school's furnishings, etc.). Give dates.\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. What was your first community hall built for? How large was it? What material was it made of? Who built it? Through what organization, etc.? Was it built in the village or town, or was it in a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings? (For example, if you lived in the country, did you use the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were across sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? What dances were popular?\n\nHas there card playing for a prize? Sometimes usually\n\nHas there ever any difference exist between dancing and non-dancing? Explain. An old dance of old days.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it either as an entertainment in the home, or for community gatherings? Explain. Some above but let's forget it.\n\nThe games\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? No\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. I never was at a chivaree as I thought it was an insult on the party who was just married.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3. What attempts at formality, or \"etiquette,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n12. Was the chivalry known in your community? No\n\nDescribe what you remember about chivalry, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of chivalry, parties, etc., that you remember, at parties and give approximate dates whenever you can; when none changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purpose, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Marbles & ball and some flew kites.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. What may other organizations that were in existence in your community before 1924, playing the same or similar roles when it was first organized? (If possible, within a school district, try to identify them by name.)\n\n19. Were any other organizations formed in the town or village and included the surrounding community? (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat methods were commonly used by organizations for raising money?\n\n20. Where did various organizations hold their meetings?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., marbles, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (e.g., jump rope, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. July 1st 1917\n\n26. Who organized it? The Gain Brothers\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Yes\n\n28. Was it the first picnic held in the community? I think it was about the first.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games & races\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? We spread table cloths on the grass & we all got around & everybody just helped themselves.\n\n31. What did you have to eat and drink? Tea & Coffee\n\n32. What time of the day did it start, and how long did it last? 1 O'clock in the afternoon & until 7 O'clock in the evening\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as Whist, Pinochle, \"whistling\" or Oblong; backgammon, checkers? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone unusually busy with some kind of work?\n\n24. Did children invent games connected with such things as buckrake horses, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPROMPTING AND SPURS.\n\n25. What was the date of the first picnic that you attended in Cashelhaven?\n\nGive year and month if possible.\n\n26. Who organized it? The Bain Brothers.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, gosse organization, etc.? Yes\n\nWas it the first picnic held in the community? I think it was about the first.\n\nIf not, do you know the date of the first one that had been held?\n\n28. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games & races.\n\n29. What arrangements were made for eating - was there a general lunch? \n\nFamilies and friends form smaller groups? We spread table cloths on the grass & we all got around & everybody just helped themselves.\n\n30. What did you have to eat and drink? Ice & Coffee.\n\n31. What time of the day did it start; and how long did it last? 1 O'clock in the afternoon until 7 O'clock in the evening.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n   What year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n13. Describe any features of this place which you remember as outstanding.\n\n14. Describe any different kinds of pictures which you have seen in the early days, such as newspapers, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n15. What changes have you noticed in pictures since the first years? If possible, give dates when changes became noticeable.\n\n16. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly).\n\n17. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n18. Name any other private teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities - played against teams from neighboring towns; played at local sports days; entered in competition in larger centers, etc.\n\n19. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n20. When was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? No When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n\n41. Did it grow out of or replace the earlier community games?\n\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (what month, or any special day, such as May 24th or July 4th)?\n\n42. Are there any from your community who have become members of well-known teams, hockey, ball or other teams? Give names, ages, etc.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors if possible—see 43.) If not, tell as nearly as you can how many books you brought, and what kind. (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? If so, when was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n8.\n\n50. Has there ever been a community library in your district or town? No\n\nWhen was it started? Who started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The Montreal weekly witness & The family herald, Weekly star, The brain growers guide.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We still take the same papers also the daily star Phoenix.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? I still have a book a diary that I kept just before coming west.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n8.\n\n50. Has there ever been a community library in your district or town? Yes\n\nWho started it? Mr. Smith\n\nWas it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who assisted an librarian, and what arrangements were made for borrowing books.\n\n51. Did newspapers or magazines did you subscribe to when you first came to this county? The Monthly Review, Weekly Times, The Family Record\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe still take the same papers also the daily Star Phoenix\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the seat with you do you still have?\n\nI still have a book a diary that I kept before coming here.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Autoharp\n\n57. What instruments did any of your neighbors have? Violin\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nBought an Organ in 1908 Paid $150.00 And Then We Bought a Piano in 1917 Paid $450.00 Bought both in Saskatoon\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instrument History:\n\n54. What musical instruments did you bring west with you? Violin.\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Olive dates, piano (if possible), and tell where you bought them.\n\n59. Bought an organ in 1908. Bought a piano in 1917. Bought both at Crawford.\n\n60. How long a part did singing and other forms of music play in your home or settlement in early years in the West?\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where it met, what uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nJust as important, I was always a lover of music & think there is nothing nicer than having music in a house. I am now 84 yrs old 6 months.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical arts? If so, name and date.\n\n65. In what area do you consider yourself most important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is known for any of these hobbies?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, or pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1973.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1128, 5], [1128, 1128, 6], [1128, 3403, 7], [3403, 3403, 8], [3403, 5268, 9], [5268, 6721, 10], [6721, 8147, 11], [8147, 9406, 12], [9406, 10683, 13], [10683, 11846, 14], [11846, 13352, 15], [13352, 14834, 16], [14834, 16064, 17], [16064, 17223, 18], [17223, 18485, 19], [18485, 19771, 20], [19771, 20923, 21], [20923, 22035, 22], [22035, 23335, 23], [23335, 24524, 24], [24524, 25789, 25], [25789, 26805, 26], [26805, 26805, 27], [26805, 26959, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]