[{"id": "69a330e1b1567be49502932867c5559f03366f8b", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Facts What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n(X) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nMarch 19 1952\nSASKATCHEWAN ARCHIVES\nIt is difficult to provide a general questionnaire in pioneer life because so much of what is asked is based on personal experience rather than on facts. It is also important to remember that the answers given will be used by the researcher to understand the pioneer experience.\n\nThis questionnaire is intended for persons who lived in Western Canada between 1870 and 1920. It covers both personal experiences of the pioneer family members and the history of the family.\n\nIf more than one member of the family can answer the questions, they should write them in separate entries or apply for a separate questionnaire.\n\nOther Questions:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneers' Life,\" is still being distributed. If you have not already answered this, and would be willing to do so, please put a copy here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be purchased at a later date, some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires ( )\n\nPlains health conditions\n\nPlains social life\n\nSports and recreation\n\nPlains housing\n\nPlains education and churches\n\nPlains farming experiences\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Albert Florent Remach\n2. Your address: 407 Lilliech St.\n3. Date: March 5th, 1932\n4. Where were you born? (Give name of place and country): Liege, Belgium\n5. What was your father's name and occupation?: Victor Remach, market gardener\n6. When did you come to Saskatchewan? (Give month and year): March 10th, 1914\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Lived in Belgium until coming to Canada.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   18 years old\n9. What were your reasons for coming West?\n   Dad hoping to make a better living took me whole family along\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Primarily through an acquaintance who had come here about three years previously.\n    Later through government and railroad companies Information Services.\n1. Your full name: Albert Edward Romach\n2. Your address: 1713 16th Ave., North\n3. Date: October 1948\n4. What was your family's name and occupation?\n   - Romach, market gardener\n5. When did you come to Saskatchewan? (Give month and year)\n   - March 28, 1919\n6. How old were you when you came to Saskatchewan?\n   - 18 years old\n7. What were your first jobs in Saskatchewan?\n   - First came to Western Canada. (You do not need to state your occupation.)\n8. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n   - Through other people\n9. Any family members who came before you?\n   - Yes, my father\n10. Any family members who came after you?\n    - No\n11. Any family members who came at the same time as you?\n    - No\n12. Any family members who came before you?\n    - Yes, my father\n\nHandwriting note:\n- Small writing & neat, a little heavy font & white\n- Family along\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome thought we were doing a wise thing mostly on account of rumors of want then prevalent, but most thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nJust our family\n\n13. What means of transportation did you use?\n\nBy rail through Belgium, Steamer from Antwerp to Southampton, then across England by rail to Bristol, and from there to Canada by Royal Lines steamship (the Royal George) from St. John, N.B., a whim of the railroad company sent us through Chicago, Milwaukee, and St. Paul on our way to Winnipeg and hence to Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nAs far as I remember my most vivid impression was that caused by the dirt and grime in the streets and buildings of St. John, N.B., and the icy streets of Winnipeg, which caused me to take a headlong fall on my first step out of Union Station with its rebuilt a badly strained leg, too, which spoiled the rest of the trip for me and which still bothers me occasionally.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Lestock Lake with the acquaintance mentioned in question 10.\n\n16. Where did you settle or take up land?\n\nAt Lestock.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nLegal residence has always been Lestock although I have worked at different times at Regina, Edmonton, Big River, Hudson Bay and Bowbush, Allan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHelping Dad with his farming. Since coming to the West, always on the farm except for three winters in the South.\n13. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome thought we were doing something very worthwhile.\n\n14. Did you travel by yourself or with a party (family, friends, or other group)?\n\nJust me family.\n\n15. What mode of transportation did you use?\n\nBy car (owned by myself) from Calgary & Vancouver.\n\n16. How long did it take you to get here?\n\nAbout 2 weeks.\n\n17. Mention any other places where you have lived since coming to Western Canada.\n\nNone.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nHelping dad with his farming, then coming to the farm except for the winter in the city.\n19. How often did you write to relatives or friends in your old home?\n\nFairly often at first and later probably not more than once or twice a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Mary Leonard of St. Hubert, Saskatchewan on the 3rd of July 1945.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAs stated before we all came together. My brother is settled about 3 miles from my place and my sister got married to a farmer of the Black Diamond district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe day of our arrival here is the one experience that I remember most vividly. In the snow up to knee, traveling 9 miles on a sleigh drawn by two poor old horses through a desolate looking country in which all we could see both and sloughs and only padding one small building's back in all that distance was a pretty discouraging experience to people coming from a big city.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nExcept for going to town for groceries (10 miles) and to church on Sunday (7 miles) by wagon at first and later by automobile we never did much traveling.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else move to Spokane County to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West about 3 miles from my place and my folks got married to a farmer of the Marshall district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far? By what means of travel?\n\n25. What was your occupation at this time?\n25. When was the first car used in the community? around 1920\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We had none.\n\n27. Where was your trading center? How far from your home?\n   Lestock, about 10 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes. While a new town was founded north of us around 1930 (Wichart) Lestock still is our closest town. The roads, according to those of course, improved a lot since pioneer days.\n\n29. How often did you shop in the early days?\n   About once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   As far as I remember, after the first Great War.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   As soon as we got here and the new neighbour got us acquainted with the various catalogues. We bought almost everything by mail, excepting groceries. The percentage of mail order purchases has greatly fallen since we started our own Co-Operative store in Lestock.\n\n32. When did you first have a telephone and what company provided it?\n   We have none yet but have been working for two years and hope to make it this summer.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   My Dad's intention was to stay about ten years by which time he was hoping to have enough money to go back. He died however before the ten years were up.\n   I never felt any inclination to go back except for a visit.\n25. When was the first car used in the community? [around 1930]\n\n26. If you owned a car before 1931, when did you buy it? What make?\n\n27. What was your traveling contact? How far from your house?\n\n28. Did you continue to ride horse? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. How far did people go to your district's first store to town regularly\n\non Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy by mail? Did you change any fraction of your total purchases were by mail? Other than any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Sasha, Montana, the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Why did it take so long to save enough money to go back to school?\n\n35. How much did it cost to go back except for a visit\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA large proportion of the settlers at that time were bachelors who having taken a homestead and obtained title, took a mortgage on their land and then left when unable or unwilling to pay.\n\n35. Did many people move away during the 1920's? Did many return?\n\nTaking the Lethbridge district as a whole quite a few left but none in our own neighbourhood very few came back.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was trustee of our local school board from 1928 to 1943. Also at different times served as chairman of Wheat Pool committee, S.S.F.C. local lodge and actually I am a director on the Co-op store board and secretary of Farm Bureau group also of the newly organized local lodge of Local Farmers Union.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nNot that I can remember.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nLethbridge, which first knew by the name of Burton, I think had its name changed around 1913 to that of surveyor who laid out the plan of the future village.\n\nMarlow School District was so named in honor of its first Secretary Mr. James Hackett's birthplace, Marlow-on-Thames (Eng.)\n32. Did any people move away from your district prior to 1924? If so, reasons why they left.\n\n33. Any particular settlement at that time other than Barbados?\n\n34. Having taken a homestead and obtained title, took a mortgage on this land and then sold when enough or unwilling to pay.\n\n35. Did any people move away during the 1929-1932? If so, reasons why.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI was teacher of our local school board from 1928 to 1932.\n\n37. If you or any member of your family ever served as chairman of school board, committee, or any other position connected with school matters, please give details.\n\n38. How did the places in your community get their names? (School district, post offices, villages, rail stations, creeks hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of the petition (4) any changes in names since the first naming and reasons for change (5) date and reason for change.\n\n39. What first knew by the name of Rainbow Albert Florentine?\n\n40. The name changed around 1925 to that of the village out the town of the same name in favor of Albert Florentine.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nNo.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.....\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nNone\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWe have passed from the tough pioneer days to that of a well settled community, where, although not rich we make a better and easier living both socially and economically.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI do not know of any, as most of the old timers have now passed away or have moved away.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n39. Questions regarding historical source materials:\nDo you have any personal or family letters, old photos, newspapers, written recollections, and reminiscences? (Specify)\n\nNo.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nWe have fallen from the tough pioneer days & that of a well settled community, when, although not rich we make a better and easier living both socially and economically.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nI do not know of any ad much of the old times have been passed away or have moved away.\n\nIf anyone else has filled in this questionnaire for you, please give name and address here:\n\n…………………………………………………………………………………………………\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1235.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4928, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1600, 5], [1600, 3108, 6], [3108, 4270, 7], [4270, 5194, 8], [5194, 7032, 9], [7032, 7698, 10], [7698, 9218, 11], [9218, 9941, 12], [9941, 11817, 13], [11817, 12935, 14], [12935, 14811, 15], [14811, 16099, 16], [16099, 17428, 17], [17428, 18594, 18], [18594, 18594, 19], [18594, 18748, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]