[{"id": "6f9fccfe50a3ad0eb6208f040ee5ff4a758597bc", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Dist: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n_____________________________________\n\nRECEIVED APRIL 17 1952\nFolley, Annetta\nDubuque,\nTo Sask., June, 1986.\n\nPIONEER SETTLEMENTS: A GENERAL QUESTIONNAIRE\n\nA SORT OF QUESTIONNAIRE TO THE PIONEER SETTLEMENTS IN SASKATCHEWAN\n\nIt is difficult to prepare a general questionnaire on pioneer life because some of the questions here will not apply to your experiences others may prove helpful. You may worry about leaving blank spaces, the best thing to do is to give details, or describe particular events, if they help to answer the questions. This questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experiences of the pioneer life there. If more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1 entitled \"Pioneer Days What Did You Do?\" is still being circulated. If you have not already answered it, and are willing to do so, please give a short reply.\n\nSome of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nCanada, etc.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ........................................... Annatta F. Alley\n2. Your address .............................................. Dubuque Sask.\n3. Date ......................... April 14th 1947\n4. Where were you born? (Give name of place and country) Cornwall England\n5. What was your father's name and occupation? Thomas Bawden Contractor (Colonel)\n6. When did you come to Saskatchewan? (Give month and year) 1886 June\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 14 years\n9. What were your reasons for coming West? My parents came to make a new beginning following a failure of the silver mines in Mexico\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). My parents heard glowing stories about how a fortune could be made by anyone who was not afraid of work and isolation\nFolley, Annette\n\nTo Sask. - June, 1955.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER KAFERLICHES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have it written, please say so. If you do not have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...........................................\n\n2. Your address ...........................................\n\n3. Date ...........................................\n\n4. Where were you born? (Give name of place and country) ...........................................\n\n5. What was your father's name and occupation? ...........................................\n\n6. When did you come to Saskatchewan? (Give month and year) ...........................................\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n\nMy parents came to make a new beginning following a failure of the silver mines in Mexico.\n\n10. How did you learn about the West? (through other people? Reading about it? Railroad or government information?)\n\nMy parents heard glowing stories about how a fortune could be made by anyone who was not afraid of work and toil.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought we were insane and daily expectations to hear of our success.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family of eight, the oldest boy about 20.\n\n13. What means of transportation did you use?\n\nShip - then Train to Brandon\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nHad been here four eighteen months, the last built a house twenty miles North of Brandon then returned to England to fetch us.\n\n16. Where did you settle or take up land?\n\n20 miles North of Brandon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived in the Butten district until 1929 when moved to Wapow for one year before moving to my present home in Dubuque.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nGrew a small attending school.\n\nAfter I came I lived on a farm near 1929.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy attempt was more intense and daily expectation to hear of our success.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWith my family of eight, the oldest boy about 26.\n\n13. What means of transportation did you use?\n\nShip - then Train to Brandon\n\n14. What incidents of the journey East do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nMy father had been here for eighteen months, he knew built a house twenty miles north of Brandon and returned to England to find us.\n\n16. Where did you settle or take up land?\n\n20 miles north of Brandon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived near the eastern district until 1929 when moved to Neepawa for one year before moving to my present home in Burke.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a child attending school after I came I tried on a farm until 1929.\nMy sisters and I were stolen by the Indians and rescued by my father after the rebellion. The Indians were very unfriendly then, and I got separated from everyone. I always needed in the old country but got up and all before we could replace them. Then we moved north and bought land near 100 acres by land.\nWe all came together.\n\nMy sisters and I were stolen by the Russians and arranged by my mother after the abolition of the slave trade. We were very unfriendly to each other. I got separated from my family and ended up in the city. I met someone who got me a job offer. They could replace them with a team of men and women who arrived and built into acres by acres.\n\nWe had our own school in the early years, attended church regularly (twice weekly). We had our own school system based on a primary and a college education since then about 1990 (and a more modern one since the school). (The school in cities in population)\n\nWe didn't get much of anything, my sisters and I worked to earn our living in different jobs. We also worked at farms and did so many.\n25. When was the first car used in the community? My husband used a car in 1912 for electioneering for the Conservative Party.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? My father went to town regularly to buy dry goods twice a year. Groceries came by mail about once a month in the summer.\n\n30. On Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1900 we began to order from Sherrard Brothers. We bought dry goods. About 1905 we ordered most of our dry goods from them. We have bought more and more from stores. Now standards and transportation have improved so much we do most of our shopping in the larger centers.\n\n32. When did you first have a telephone and what company provided it?\n\nAbout 1915 The Northern Electric Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes.\n25. When was the first car used in the community? My husband used a car in 1920 for a surveying party.\n\n26. If you owned a car before 1924, when did you buy it? What makes?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\n29. How often did you shop in the early days? My father went to Calgary\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases by mail order and any changes since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nOne or two families of Welsh people moved to be closer to a P.C. church.\n\n35. Did many people move away during the 1920s? Did many return?\n\n700\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was a member of the M. P. I. F. A. for 20 years and continued until 1929. He also served as the Secretary and Treasurer.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mentioned here (driving dates wherever possible, such as owning the first automobile, organizing the first lodge, etc.).\n\nMy husband offered to be the first automobile owner.\n\n38. How did the places in your community get their names? (School districts; post offices, villages, railway stations, areas, hills, etc.). Try to give (1) name and occupation of person registering place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first use was given date and reason for change.\n\nThe district, school and post office were all named after Cotton, a village in Bristol.\n34. Did any people move away from your district or live to 1914? What reasons did they have for moving?\n\nOne in two families of these people moved to the slower to a P.O. church.\n\n35. Did many people move away during the 1920s?\n\n36. If you or some member of your family have held public office, or have been active in any organization, please name it here, giving dates wherever possible.\n\nMy husband's career was as a teacher. He taught at the school for 20 years and continued until 1929. He also worked as a carpenter and a mechanic.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here. Bring dates wherever possible. (Such as owning the first automobile, owning the first telephone, etc.)\n\nMy husband often had the first automobile.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, places named after people, etc.) Try to give (1) date and reason for change, (2) date and reason for change, (3) date and reason for change. Only names of new names above in (1), (2), or (3).\n\nIn district, school and post office were all named after Cotton, a village in Bristol.\n6.\n\nQuestions relating to historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old pictures and portraits, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Library Building, or the Archives Office at the University in Saskatoon?\n\n(Indicate by your preference, if any) __________________________\n\n41. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nChildren - Margaret Ellen Caldwell - Ottawa, Ontario - age 30\nSybil Ann Mary Caldwell - North Vancouver, B.C. - age 24\nPhilip William Caldwell - San Francisco, California - age 21\nMary Louise Caldwell - Vancouver, B.C. - age 18\nLaura Dudley Caldwell - Calgary, Alberta - age 15\n\n42. What do you think are the most important changes in your community since you first came here?\n\nelectric lights, etc., number of farms, etc.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have that person give name and address here!\n5.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, Saskatchewan, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any) ...\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\nChildren:\nMargaret Ellen Caldwell\nCatherine\n\nPhilip William\nFrank William\n\n41. What do you think are the most important changes in your community since you first came here?\n\nHighways, electricity, modern conveniences in cities.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPlease give the names and addresses of other pioneers who would answer this question.\nChildren\n\nMargaret Olive Caldwell [Buddly former Cathie]\nArthur Lawrence Caldwell M.D.\nCullen John Hope Caldwell B.A.\nField Supervisor Gordon Robert McGregor\n\nSons\n\nPhilip Willmott [Willie] William Nicholson R.N. Butler\nCounty Manager [Amos] outstanding university\nFred Willmott Dubin - Alan Willmott former Cathie\nMichael Bruce North Vancouver - Harold Dunn R.N.\n\nTeddy Taylor (Sandy) Depart. Head - Brian Taylor - Band Chief, Butte City\n\nDoree Willmott Deputy Supervisors - Lee Anglin\nMary Murray Calgary - Bruce Murray (late husband)\nChildren\n\nMargaret & Lee Caldwell | Dudley former Cotton\nArchibald Lawrence Caldwell M.D.\nCecil | John Rogers Caldwell B.A.\nField Supervisor Gordon Parker\n\nSons\n\nPhilip Willharry | William Nicholson R.N. Sailor\nCounty Newcastle City | Overseas outstanding University\nFred Willharry Enlistee - Alan Willharry former Cotton\nMichael Bruce North Vancouver - Harold Dunn R.N.\nTodd Dwyer (Canada) Expert Boat - Brian Rigby - Royal Naval Cadet\nDerek Willharry Shipwright - Ian Anglin\nMary Murray Calgary - Brian Murray (attending)\n\nMrs. J.\nChildren:\nMargaret Olive Caldwell [Quilty farmer, Cotton]\nArthur Lawrence Caldwell M.A.\nCullen John Hayes Caldwell B.A.\nField Supervisor (Cattle Rancher)\n\nSons:\nAlmastry:\nNorth Vancouver [Winnie Nickerson R.M. Quilty]\nPhilippintry [Lorna]\nPoultry Rancher City [Dorina attending university]\nFred Willway [Allen Willway farmer Cotton]\n\nMabel Reece North Vancouver [Joan Willway nurse in training]\nTeddy Taylor (Quilty)\nDepart. South - Queen Taylor - Band Chief, Butte\n\nDoree Willway\nStephanie Supervisors - Los Angeles\nMary Munro - Calgary - Bruni Munro (attending school)\nChildren:\nMargaret Olive Caldwell [Saidly] Farmer, Cotton.\nArthur Laurence Caldwell M.A.\nCecil John Hayes Caldwell B.A.\n\nField Supervisor, Canada Packers (retired)\n\nMrs. Caldwell\n\nWinnie Nicholson R.H. Butler\n\nPhilip Willmott\nPoveshull, Rancher City\n\nDonna attending university\n\nFred Willmott\nDubuque - Allan Willmott Farmer Cotton\n\nMaud Alice North Vancouver\n\nTeddy Taylor (Deputy)\nDep't. Lead - Green Fields - Band C, Cattle\n\nDora Willmott\nSupervisor - Los Angeles\n\nMary Munro - Calgary - Bruni Munro (latterly)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1886_459.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5247, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2041, 5], [2041, 3617, 6], [3617, 5058, 7], [5058, 6569, 8], [6569, 7734, 9], [7734, 8908, 10], [8908, 9216, 11], [9216, 9974, 12], [9974, 11402, 13], [11402, 12364, 14], [12364, 13618, 15], [13618, 14826, 16], [14826, 16190, 17], [16190, 17285, 18], [17285, 17822, 19], [17822, 18355, 20], [18355, 18926, 21], [18926, 19440, 22], [19440, 19595, 23], [19595, 19749, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]