[{"id": "015210e45c5236b8fd2e9e22068b7df917db32fc", "text": "Pioneer Housing\n\n(Handwritten text)\n\nName: ____________________________\nAddress: _________________________\nPhone: ___________________________\nDate you came to Australia: _______\nCountry or place from which you came: __________________\n\nInstructions for Answering the Questionnaire\n\nSince early settlers could be in any advanced state of house, see one that is similar, and according to different circumstances, this questionnaire has been divided into three parts:\n\nPart I: The \"Discovery\" house, not yet built.\n- To include any early settlement using water or other means.\n\nPart II: The permanent house.\n- To include the latter house built after looking for a site (or perhaps national park), a common house style was adopted by the founders, even though any house was used to aid settlement as a permanent house.\n\nPart III: General.\n- Additional details applying to either Part I or Part II of the questionnaire.\n\nNote: All questions should be answered, even if blank, and please fill in all necessary blanks.\n\nKindly send your completed questionnaire to:\n\nAustralian Museum (1934)\nUniversity of Queensland,\nBrisbane, Queensland.\nPART I: THE \"TEMPORARY\" SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1893\n2. During what years did you live in it? 1893-1954\n   How long did you think you might live in it when you built it?\n3. What was the location? (township, range, and post office).\n4. Is it still in existence? Yes\n5. What material was it made of? Logs\n   How long did it take to build it? Built by my father\n6. How large was it, and how many rooms did it contain? 28x16.2 rooms\n   How were they arranged? Kitchen & living room both on main floor\n7. Who built it? My father\n8. How were the walls finished inside? (e.g., rough boards, mud plaster, painted etc.) Plaster on logs\n9. What kind of floors did you have? Logs & plastered floor\n   What covering did you have on the floor (rushes, linoleum etc.) None\n10. What expenses did you have connected with the building of the house? Windows\n11. Describe any special problems or unusual happenings connected with its building.\n12. How many people lived in the house when it was first built? 8 people\n    later? 9 people\n13. What means of heating did you have? Wood stoves\n14. What means of lighting did you use? Oil lamps\n15. Was there a cellar? No\n    Where was the door to the cellar? (in kitchen floor, other place?) In the living room floor\nPART I: THE TEMPORARY SHACK, SOD OR LOG HOUSE.\n\n1. What year was this house built? 1943\n\n2. During what years did you live in it? 1893-1954\n\nHow long did you think you might live in it when you built it?\n\n3. What was the location? (township, range, and post office).\n\n4. Is it still in existence?\n\n5. What material was it made of?\n\n6. How large was it, and how many rooms did it contain? 28x16\n\nHow were they arranged?\n\n7. Who built it?\n\n8. How were the walls finished inside? (e.g., rough boards, mud plastered etc.)\n\n9. What kind of floors did you have? What covering did you have on the floor (rugs, linoleum etc.)?\n\n10. What expenses did you have connected with the building of the house?\n\n11. Describe any special problems or unusual happenings connected with its building.\n\n12. How many people lived in the house when it was first built? 8\n\n13. What means of heating did you have? Wood stove\n\n14. What means of lighting did you use? Oil lamps\n\n15. Was there a cellar? Yes\n\nWhere was the door to the cellar? (in kitchen floor, other place?)\nPART II: THE PERMANENT HOME.\n\nNote: For some persons, this section may include a description of more than one house. If so, you may include answers for each, showing changes and differences from one house to another. If you wish, you may describe your first permanent house on this form, and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, and especially if they have been much the same type of house, you may wish to answer questions only about the first one or two (or perhaps an outstanding house in which you lived), and merely mention the others in question 16.\n\nIn all cases, be sure to make it plain which house you are writing about, using dates (and perhaps places) to identify each.\n\n16. Give the location (township, range, and post office), of the house, (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\n17. Who planned and built the house?\n\n18. What year was it built? 1923\n\n19. How long did it take to build it (if possible, give approximate dates when started and completed)?\n\n20. Does it still exist?\n\n21. What material was it made of?\n\n22. How large was it?\n\n23. Describe the arrangement of the rooms or, preferably, draw a floor plan of the house. (On a separate sheet if desired).\n\n24. What kind of foundation was under the house (wooden sills, stone, concrete)?\n\n25. What kind of a basement did you have (full size cement basement, dirt cellar, etc.)?\n\nWhere was the door to the basement (kitchen, outside, other room)?\nPART II: THE PERMANENT HOUSE.\n\nNotes: For some persons, this section may include a description of more than one house. If so, you may include answers for each dwelling changes and differences from one house to another. If you wish, you may describe or be your first permanent house on this form, and tell about others on a separate sheet (or other questionnaire forms will be sent to you upon request). If you have lived in several houses, and especially if they have been much the same type of house, you may wish to answer questions only about the first one or two (or perhaps an outstanding house in which you lived), and merely mention the others in question 16.\n\nIn all cases, be sure to make it plain which house you are writing about using dates and numbers to identify each.\n\n26. Give the location (township, range, and post office), of the house(s) (or houses) described in this part of the questionnaire, and the years you lived in it (or them). If you lived in other houses besides those you intend to describe in this questionnaire, give their location, and the years you lived in each.\n\nWhat previous experience did this person (or persons) have in building houses?\n\nWhere did he get his ideas as to the kind of house to build?\n\n18. What year was it built? / 1943\n\n19. How long did it take to build it? (If possible, give approximate dates when started and completed)? Most of the work was done in 1943.\n\n20. Does it still exist? Yes\n\n21. What material was it made of? Lumber\n\n22. How large was it?\n\n23. Describe the arrangement of the rooms of the house. (On a separate sheet if desired).\n\n24. Was there a back porch attached? If so, was it glassed in, screened or an open veranda?\n\n25. What kind of basement did you have (full size crawl space, dirt cellar, etc.)?\n\n26. Where was the door to the basement (attic, outside, other room)?\n26. What insulation was used?\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n\nDescribe any ornamentation on the exterior of the house (for example, \"gingerbread\" trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used?\n\n28. How were interior walls finished - (plaster, wood panel, wallpaper etc.)?\n\n29. How high were the ceilings?\n   How were they finished (plaster, beamed, moulded plaster)?\n\n30. What kind of wood were the floors made of?\n   What width board?\n   Were nails or dowels used?\n   Did you have any parquet (patterned inlay) flooring?\n\n31. Describe the windows as nearly as you can, giving size (length and width), size of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window? In what room?\nDid you have any colored or stained glass windows? Describe.\n\nDid you have shutters inside or outside?\nHow were window frames finished inside (painted, varnished)?\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panelled door, windows in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.)?\nDid you have a door knocker? Describe.\n\n33. Describe interior doors. - if panelled, type of hardware, or any other special features about them.\n\nDid you have any double doors, french doors or swinging doors?\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed? If open, what type of baluster and rail was used, and what kind of wood?\n3.\n\n26. What insulation was used?\n\n27. Describe the general exterior appearance of the house (square, rectangular, T or L shaped, sharply sloped roof, etc.)\n\nDescribe any ornamentation on the exterior of the house (for example, pilasters, trim, carved cornices etc.)\n\nWhat color was the house, and what color trim was used? (if any)\n\n28. How were interior walls finished? (plaster, wood paneling, wall paper etc.)\n\n29. How high were the ceilings?\n\nHow were they finished (plaster, beaded, moulded plaster)?\n\n30. What kind of wood were the floors made of?\n\nWhat width board?\n\nWere nails or dovetails used?\n\nDid you have any parquet (patterned inlay) flooring?\n\n31. Describe the windows as nearly as you can, giving size (length and width), sizes of panes, height from floor and distance from ceiling.\n\nHow were the windows arranged?\n\nDid you have a bay window?\n\nIn what room?\n\nDid you have any colored or stained glass windows?\n\nDescribe.\n\nDid you have shutters inside or outside?\n\nHow were window frames finished inside (painted, varnished)?\n\noutside (painted to contrast with house color)?\n\n32. Describe your front door (panellled door, windows in door, or around or above).\n\nWhat kind of hardware was used on the door - (iron, brass etc.)?\n\nDescribe.\n\nDid you have a door knocker?\n\n33. Describe interior doors - if panellled, type of hardware, or any other special features about them.\n\nDid you have any double doors, French doors or swinging doors?\n\nWhat material were door handles made of - brass, iron, porcelain (white or colored), glass?\n\n34. If you had an upstairs, was the stairway open or closed?\n\nIf open, what type of balusters and rail was used, and what kind of wood?\n35. Did you have any built in cupboards, bookcases, china storage or other similar built in storage or display space?\n\n36. What kind of a chimney did you have?\n\n37. If you had a fireplace, where was it located in the house?\n   What material was it made of - red brick (what size brick?), stone (state color) or other material?\n   How large was the fireplace?\n   What material was the mantle made of (wood, stone, brick)?\n\n38. Were there any built in gas lights or lamp brackets; or candle brackets?\n   Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible when changes occurred?\n\n40. Describe heating arrangements, in early years and later, giving dates of changes if possible.\n\n41. Did you have a cistern? What size and material?\n   Was the pump from it in the kitchen, basement or elsewhere?\n   Did you have a well in the basement? Outside near the House?\n\n42. Did you have plumbing in your house?\n   If so, what was the source of water?\n\n43. If you built the house described above, what was its cost?\n   If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n   Date of construction of house?\n\n44. If you borrowed money to finance building or purchase, what was the amount of the loan?\n   The source?\n   What was the interest rate?\n   What were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\n   Did you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n45. If you lived in a rented house, what rental did you pay? (give changes in rental and dates if possible).\n35. Did you have any built-in cupboards, bookcases, china storage or other similar built-in storage or display spaces?\n\n36. What kind of a chimney did you have?\n\n37. If you had a fireplace, where was it located in the house?\n   - What material was it made of - red brick (what else brick?),\n     stone (what color) or other material?\n   - How large was the fireplace?\n   - What material was the mantle made of (wood, stone, brick)?\n   - Were there any built-in gas lights or lamp brackets; or candle brackets?\n\n38. Was electrical wiring included?\n\n39. Describe the means of lighting provided when you first lived in the house, and changes made in later years, giving dates if possible. When changes occurred?\n\n40. Describe heating arrangements in early years and later, giving dates of changes if possible.\n\n41. Did you have a cistern?\n   - Was the pump from it in the kitchen, basement or elsewhere?\n   - Did you have a well in the basement?\n   - Outside near the House?\n\n42. Did you have plumbing in your house?\n   - If so, what was the source of water?\n   - If you built the house described above, what was its cost?\n   - If you purchased a house instead of building, what was the purchase price, and the date of purchase?\n   - Dates of construction of house?\n\n43. If you borrowed money to finance building or purchase, what was the amount of the loan?\n   - What was the interest rate?\n   - What were the terms of the loan (that is, the period of the loan, and the method and time of repayment)?\n   - Did you later think your method of financing was wise, or did you wish you had made other arrangements?\n\n44. If you lived in a rental house, what rental did you pay? (give)\n\n45. If you lived in a rental house, did you pay rent? (give)\nPART III: GENERAL.\n\nNote: As you may have more than one answer for questions in this section, as they apply to houses mentioned in either Part 1 or Part 2, please specify which house you are speaking of if your answer does not apply in both cases. Use extra sheets if necessary.\n\n46. What did you do to \"winterize\" your house in the fall (storm windows, doors, banking (with what?), other means)?\n   [Handwritten: We had storm windows]\n\n47. What additions were built to the house after its original construction?\n   [Handwritten: upstairs]\n   For what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats or other pets, baby chicks, sick animals or others).\n   [Handwritten: Cats and Dogs]\n\n49. As nearly as you can remember tell what furniture you had in each room in the house, (rugs, sofas, chairs, curtains, musical instruments, etc., etc.). If you lived at first in the \"shack\" or sod house, and later in a larger house, please tell what furniture you had in each place.\n   [Handwritten: Beds + table & chairs]\n\n50. How much of this furniture did you bring with you when you came and where was it made or purchased?\n   [Handwritten: N/A]\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or would seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it, from Eaton's etc.)\n   [Handwritten: N/A]\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your home, which you would be willing to loan or present to the Archives?\n   If requested to do so, would you be willing to co-operate in having pictures taken of any unusual or rare piece of furniture which you might possess?\nPART III: GENERAL\n\nNote: As you may have more than one answer for questions in this section, please specify which house is being discussed.\n\n46. What did you do to \"modernize\" your house in the fall (e.g., windows, doors, building (with what), other means)?\n\n47. What additions were built to the house after its original construction?\n\nFor what reasons?\n\n48. What animals were in the house at any time? (e.g., dogs, cats, or other pets, baby chicks, sick animals or others).\n\n49. As nearly as you can remember tell what furniture you had in each room in the house, (rugs, sofas, chairs, curtains, musical instruments, etc.) If you lived at first in the shack or sod house, and later in a larger house, please tell what furniture you had in each place.\n\nBush table & chairs\n\nHow much of this furniture did you bring with you when you came and where was it made or purchased?\n\nHow much of it do you still have today?\n\nDescribe any items of furniture which were outstanding, or seem strange in the modern home.\n\nHow did you get furniture during the first few years? (make it, from barter's etc.)\n\n50. Do you have any pictures of early pieces of furniture, or interior views of your house, which you would be willing to loan or present to the archives?\n\nIf requested to do so, would you be willing to cooperate in having pictures taken of any unusual or rare piece of furniture which you might possess?\n51. Did you or any of your neighbors have looms for weaving, or spinning wheels?\n\n52. Tell what furnishings were made for the home, for example, rugs, window curtains, table covers, items of furniture etc.\n\n53. When did you get your first radio? [93]\n\n   What kind was it? Viking\n\n   Where did you get it? Bates\n\n54. What use was made of the attic (as a sleeping room? for storage space? for ripening, drying, or storing vegetables?)?\n\n   Attic for storage\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of windbreak (trees, or a windbreak built to protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning changes in the form of protection throughout the years, giving dates if possible. (for example, fireguards, lightning rods, fire insurance).\n\n   Fire guards in early days later on fire insurance\n\n58. Describe any memorable incidents or features connected with any home in which you have lived, not already mentioned in your answers.\n51. Did you or any of your neighbors have loans for buying, or\nexploring wheelchairs?\n\n52. Tell what furnishings were made for the home, for example, rugs,\nwindow curtains, table covers, items of furniture etc.\n\n53. When did you get your first wallet (1931)\n\nWhat kind was it? Dining\n\nWhere did you get it? Dining\n\n54. What use was made of the attic (as a sleeping room for storage\nspace? for ripening, drying, or storing vegetables?)\n\nWhat windows or means of ventilation were provided in the attic?\n\n55. Did you have an indoor toilet?\n\n56. Did you have any kind of a windbreak (trees, or a windbreak built\nto protect the house or the door, and from what direction)?\n\n57. Tell what measures were taken for fire protection, mentioning\nchanges in the form of protection throughout the years, giving\ndates if possible. (for example, fireguards, lightning rods,\n\nfire insurance)\n\n58. Describe any memorable incidents or features connected with any\nhome in which you have lived, not already mentioned in your\nanswers.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3535.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5196, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1132, 5], [1132, 1132, 6], [1132, 2412, 7], [2412, 3458, 8], [3458, 5182, 9], [5182, 7032, 10], [7032, 8695, 11], [8695, 10377, 12], [10377, 12099, 13], [12099, 13838, 14], [13838, 15558, 15], [15558, 16957, 16], [16957, 18045, 17], [18045, 19059, 18], [19059, 19059, 19], [19059, 19213, 20]], "primary_language": ["None", "None", "None", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]