[{"id": "26a7e848301f8312cb5aae71f72fda2da18e64d7", "text": "1. Your full name: Robert John Young\n2. Your address: 3046 8th Ave\n3. Date: March 6, 1973\n4. Where were you born? (Give name of place and country) Owen Sound, Ontario\n5. What was your father's name and occupation? Edward Young\n6. When did you come to Saskatchewan? (Give month and year) September 18, 1899\n7. Mention any other places where you lived before coming to Saskatchewan, getting into whatever possible.\n   April 14, 1898 and came to Canada\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 at the time)\n9. What were your reasons for coming West?\n   To find work and opportunity\n10. How did you learn about the West? (Through other people? Reading about it?)\n    The railroad and government literature\n    Reading out newspapers and other literature at home\nPlease print all proper names and places names in capital letters. If you are not sure what name is correct, as you have given it, please say so.\n\n1. Your full name: Robert William Young, Esq.\n2. Your address: 3000 South Main Street, Chicago, Illinois\n3. Date: October 15, 1918\n4. Where were you born? (State name of place and country): Canada, Canada\n5. What was your father's name and occupation? Lawyer\n6. When did you come to South Dakota? (Give month and year): September 15, 1918\n7. Mention any other places where you lived before coming to South Dakota:\n   - Chicago, Illinois\n   - New York City\n   - Washington, D.C.\n8. How old were you when you first came to South Dakota? (Give age)\n9. What were your reasons for coming West? (Give at least two reasons)\n\n10. How did you learn about the North? (Through other people? Reading about it?)\n\nThe railroad and government literature convinced me to move out of the city at that time.\n11. What did your friends and relatives think of your decision to come to Canada? Will they be surprised or our sister came west the year before she married a bachelor at Hillarney, or also a older brother and write her?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled all alone.\n\n13. What means of transportation did you use? The CPR train took four days.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) Well there was only written excitement on the train only written adventure on the train but Rockport water as far as Jemelletsee when we left Winnipeg on a Tuesday we came into winter down over mountains and plains Carville and the Pecos were under water some of the swamps were flooded out but the town wasn't about 4 feet deep.\n\n15. Where did you first stay when you arrived in Saskatchewan? I stayed over night on a board with a farmer who always gave us a place to sleep.\n\n16. How did you settle or take up land? I bought my homestead in the settlement office.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I have lived in Greenfield since 1952.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on the farm until the month of August and went to the bush and cut wood and then went back to the farm. I came to Manitoba and got a job as a cook for a farmer in North Dakota. I worked for John and then for Mr. Kirby and then for Mr. Johnson.\n11. What did your friends and relatives think of your decision to come to Western Canada? Will they have visited us or our sister at Killarney, Ontario, who also married a bachelor?\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n13. What means of transportation did you use? I came out on the CPR train from Calgary.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) Well, there was only nothing exciting except the train only within an hour or so. I had booked with a friend in Winnipeg on a Tuesday we came into water down near Brandon and then the trees were under water some of the wires were flooded about two feet deep all around the town except along if we came through.\n\n15. Where did you first stay when you arrived in Saskatchewan? I stayed overnight in a boarding house with a farmer who already had a team of horses and a horse trailer.\n\n16. How did you settle in or take up land? I bought land at Bill Smith's place.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I started my homestead for land at what became known as \"Smith's\" and lived there until 1917. I started and lived on land bought in 1923 and since have lived at Brandon, Manitoba, then in 1953 to Calgary.\n\n18. How did you earn a living before coming to Western Canada? How about now? I worked on the farm and cut wood and went to school for farmers after a month when I came west. I worked for farmers after a month in Manitoba and also a month in Alberta and then I worked for John One Touch in Calgary and then some years in North Dakota.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west in 1899 and settled on homestead at Oxbow, also am I. George Young came west in 1900 and homesteaded at Stoughton in 1900. We had homesteaded at Oxbow.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n\n25. How often did you travel by horseback?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (Non-urban areas, attending church, visiting friends, etc.)\n\n25. How often did you travel by train or to arrange only next to church in short space or snow covered long since where snow was twenty miles away near the house back.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few people left from 1904 to 1914 except those who moved away because of work outside the district.\n\n35. Did many people move away during the 1920s? Did many return?\n\nDuring the 1920s, I was living at Hammond and quit a lot of people moved away or moved to other places, and very few returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\nI myself was elected town clerk of the Bayo New School district from 1904 until 1909 also trustee from 1915 until 1922. I was also councillor of the rural municipality of Bayo from 1915 until 1922.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible.\n\n(Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting name, (2) date of its adoption, (3) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Bayo New School district was named after the Bayo, which was an opening in the hills of the province about ten miles from the west end of the mountain about four miles from the nearest town. It was between two and three feet where only two other two homesteaded in 1899.\n34. Did any people move away from your district prior to 1924? What reasons?\n\nVery few people left here except for the death of Mr. Johnson in 1904. He moved away then. The town was very small at that time.\n\n35. Did many people move away during the 1920s? Did many return?\n\nDuring the 1890s, there were many people who moved away, but by the early 1900s, many returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention its name. Giving dates whenever possible.\n\nMy grandfather was the town clerk from 1904 until 1909. He was also the school board member from 1915 until 1922. I was also a member of the school board from 1915 until 1922.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates whenever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (A penny clippings book may help.)\n\nThe town of New Bedford didn't exist until after the Civil War. It was an opening in the hills of the area about ten miles from the west end of the town. It was named after the town of New Bedford in Massachusetts.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for anything?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think that machinery has been the biggest change all collectively.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here and return this questionnaire.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for anything?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFirst name West?\n\nI think that modernization has been the biggest change all collectively.\n\nPlease give the names and addresses of other pioneers who could answer this sheet.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1898_584.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 16, "total-input-tokens": 26560, "total-output-tokens": 3385, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 838, 5], [838, 1775, 6], [1775, 3372, 7], [3372, 5081, 8], [5081, 5849, 9], [5849, 6643, 10], [6643, 8270, 11], [8270, 9728, 12], [9728, 10768, 13], [10768, 11812, 14], [11812, 11967, 15], [11967, 12121, 16]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]