[{"id": "0f16869c7ad4a60164eafffaa2f13496f8c567b9", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the PIONEER\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best thing to do is to answer those questions which apply to you and leave the rest blank.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether or not they were born in this province or not.\n\nIf more than one member of the family own answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Westerbom Consider? Pioneer Saskatchewan\" is still being circulated. If you have not already answered this question, we would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer health conditions\nPioneer social life, sports and recreation\nPioneer housing\nPioneer education and employment\nPioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Branch Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\n[Stamp]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WISH OF INFORMATION TO THE PERSON\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The answers should be given as accurately or as closely as possible to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924 and may be answered by persons who have personal experience of the pioneer years whether or not they have been in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires—\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: That Old Western Canadian Pioneer Era,\" is still being circulated. If you have not already answered it, you will find it worthwhile to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 3, entitled \"Pioneer Life: That Old Western Canadian Pioneer Era,\" is still being circulated. If you have not already answered it, you will find it worthwhile to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires—\n\nAll questionnaires will be preserved in the Saskatchewan Archives branch offices at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: ALEXANDER CAMERON\n\n2. Your address: RAGANVILLE, SASK.\n\n3. Date: January 26th, 1953\n\n4. Where were you born? (Give name of place and country)\n   New York, USA\n\n5. What was your father's name and occupation?\n   James Cameron, Occupation Farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 5th, 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan giving dates whenever possible:\n   In the United States from July 1877 to April 1878 in Butte, Montana\n   In the United States from July 1877 to April 1878 in Butte, Montana\n   In the United States from July 1877 to April 1878 in Butte, Montana\n\n8. How old were you when you first came to live in Canada? (From so many years old)\n   It was in my teens\n\n9. What were your reasons for coming West?\n   To see if I could improve my health and work myself into employment\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    By reading about the country through the press and also by reading Railroads Government reports\n1. Your full name ... ALEXANDER R. CAMERON\n\n2. Your address ... RAGANVILLE, SASK.\n\n3. Date ... January 24, 1953\n\n4. Where were you born? (Give name of place and country) New Gillies, Alberta\n\n5. What was your father's name and occupation? JAMES CAMERON, Occupation Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) April 5, 1909\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How did you hear about the West? (This question is not necessary)\n\n9. What were your reasons for coming? To see if I could improve my condition and work myself into employment.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nBy reading about the country through the press and also by reading Railroad Government reports.\n11. What did your friends and relatives think of your decision to come to Western Canada? How after you came?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up residence?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. Attach a sketch of yourself.\n11. What did your friends and relatives think of your decision to come to the West?\n\n12. Did you travel by yourself or with a party (family), friends or other groups?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How did you earn a living before coming to Western Canada? How after you arrived?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you arrived?\n\n19. How did you earn a living before coming to Western Canada? How after you arrived?\n\n20. How did you earn a living before coming to Western Canada? How after you arrived?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your occupation?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? I was instrumental in getting several to come here, but my two sisters came to Saskatoon because of your recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nHad only one child, James Cameron who lives there.\n\nPurchased 80 acres in Homelton, Ontario 8 years ago.\n\nPart of 27 years.\n\n23. Is there any particular experiences of pioneer days that stands out in your memory which you would like to report?\n\nWhile on Construction work on R.R. M.P. arrived at our Camp with a warrant for the owner of our land, Mr. W. J. Smith.\n\nIn charge of the Office and the Camp for Mr. Smith.\n\nI went to his Bullen's and often on this trip I thought he was our Prince of the few names I knew.\n\nI was finally able to get a job at the Steamboat dinner.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTravelled in the new Railways (Canada) and by horseback.\n\nOn Half Time (working on the Canadian Pacific Railway).\n\nThe Company paid for our own Dinner Carries and every trip I applied for own Dinner Carries and every trip I took apply to all the trips. I travelled about 400 miles each trip.\n\nWe used to camp in the woods near the river.\n\nA week by canoe, then we came to camp by horseback.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? How long?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. When I came to Saskatchewan, I had got married and made up my mind to settle here. I decided to get married and make up my mind and after six years I try my luck out here.\n\n35. When did you first go to Prince Albert?\n25. When was the first car used in the community? 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? How far to town?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of purchases made by mail order since the appearance of the catalogue.\n\n33. When did you first have a telephone and what company?\n\n34. When did you first have a television and what make?\n\n35. When did you come to Saskatchewan the first time? Make up your mind after trying it out! When did you make this decision?\n\n36. When did you come to Saskatchewan? I had got married and needed a job.\n\n37. How long did you stay in Saskatchewan? It was only a year or two.\n\n38. How many years did you live in Canada?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nThey were very much interested in the future of the town. That was the main reason why they moved.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, two left in the 1930s as we have more people coming back now. In fact, we have had quite a few returns recently.\n\n36. If so, what organizations did they join?\n\nThey joined the local board, the school board, and various clubs such as the Lions Club and the Elks Club.\n\n37. If you or any of your family or friends were involved in any organizations, mention it here.\n\nI was a member of the Lions Club and the Elks Club, and I was also involved in the local school board.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, farms, etc.)\n\nThe town was named after the first settler, Mr. Johnson. The school district was named after the first teacher, Mrs. Smith. The post office was named after the first postmaster, Mr. Brown.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nThey went away but most of them returned.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThey moved away again as they thought that Baerwill was fading in Canada.\n\n36. If you or some members of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been a member of the local Board since 1930.\n\n37. If you or any of your family or friends were arrested to have or do something in the district mention it here, giving dates wherever possible (such as onlin).\n\nI was arrested in 1930 for selling liquor.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills etc.). Try to give: (1) name; (2) date and reason for change; (3) date of its first post office; (4) any other interesting facts about the name.\n\nBaerwill was named after Mr. Baer, who was born in Missouri and came to Canada to work at Morley Station in 1864 as an employee of the Canadian Pacific Railway Co. He purchased land in 1882 and built a homestead in this area. He died in 1900 and his family continued to live there. The name was changed from the present spelling \"Baerwill\" to \"Baerwill\" when the village was founded which means \"loose\" (in French). They also had a post office until this date.\n\nBaerwill was officially on a list until 1905.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI think I could procure Diary's from different people here and photos daily days. You would be sure to retain them as they are highly prized by the owners. We had our 50th anniversary of our farm on July 15, 1932 and had an old diary book where I got 160 signatures of persons who had been here for over 50 years. I have this in my possession.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes\n\n(indicate your preference, if any) ..................\n\n40. If you have children, or grandchildren, please give their names, where they live and occupations. Children, M. & L. L. Gibbons 125 Noble Ave Winnipeg, Mrs. Lee Wilson, Maplewood Sask., Mrs. Jean Cameron White Rock, Mrs. P. H. Forbes, 285 Victoria Ave Brandon, Archie Cameron 276 Union Ave Winnipeg, Berried M. & E. Johnston Stoney Creek. Grandchildren, Linda, Billy Gibbons Winnipeg, Myrna Cameron, Winnipeg, Helen Forbes Brandon, Marilyn and Bonnie Earl Neven, Mapleside and Cameron Johnston Stoney Creek.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe fine roads, the excellent buildings in both Village & Country, the production of our farms in livestock and grain and above all the community spirit of all our citizens which makes Rossville and district in my opinion the best place to live in Saskatchewan.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWalter Goodman, Robert Logan, J.J. Rushton, All of Rossville and also Mr. Johnson & Rossville who are all 1882 & 1890 Pioneers and who are all still going strong.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nI am very enthusiastic & hoping up the early history of this County and will be pleased to help you in any way I can.\n\nAlexander Cameron\nRossville, Sask.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs written recollections and reminiscences, old newspapers?\n\nIf so, please describe them.\n\n40. If you are willing to land them to the Provincial Archivist for copyright purposes, please indicate your preference:\n\n(1) be willing to land them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University of Saskatchewan.\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University of Saskatchewan.\n\n41. What do you think are the most important changes in your community since you moved here?\n\n42. If you have children or grandchildren, please give their names, ages, and occupations.\n\n43. If someone else has filled out this questionnaire for you, please have this person sign name and address here:\n\nAlexandra Cameron\n\nRosemilk, Saskatchewan\n\nI will be pleased to help you in any way I can.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_642.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4774, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1890, 5], [1890, 3618, 6], [3618, 4718, 7], [4718, 5568, 8], [5568, 6289, 9], [6289, 7167, 10], [7167, 7858, 11], [7858, 9498, 12], [9498, 10488, 13], [10488, 11574, 14], [11574, 12640, 15], [12640, 14134, 16], [14134, 16495, 17], [16495, 17634, 18], [17634, 17722, 19], [17722, 17876, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]