[{"id": "2284fe4d517fdf8a1b5de2961c71ae202ab0dce1", "text": "Because of family connections in Saskatchewan, I am studying in this history of my family. My three children and their families and direct descendents have been traced back to 1932. My own mother was Mrs. J.A. Morrison and her son are Galetown and his son Rev. Russell Monkman and his sisters Misses Ethel Monkman were present grand children of Mr. and Mrs. Monkman and they are a resident in Saskatoon and my sisters Misses Roberta Monkman and Ethel Monkman also descendants. Such are also brothers John James my mother's brother John James' family was from Chippewa Hill. Also a brother from all our families in Regina.\nBecause of family connections in Saskatoon, I am studying in the History of the Family Unit and George and his wife were direct descendents of their Irish couple who came to Canada in 1832. My own mother was Mrs. J.A. Morin and her son are Galetton and his son are Rev. Russell Monkman and his children were present grand children of a dentist in Saskatoon and his sisters also Robert Dana and Earle Saskatchewan, Sask.\nBecause of family connections in Saaleckton, I am writing in this history of the Jamaica Ford three families: Ford and George in a will uncle Albert descendants of this line. Compere was named Thomas in 1832. My own mother was their grand daughter Dr. J.A. Monkman and his son are Saaleckton and Rev. Russell Monkman and sister Miss Lydia Monkman were great grandparents. & Frank T. Suntage from this area in Saaleckton and his sisters Mrs. Palmer Dame Yealand. Such are also Descendents my mother Brother John James Jamaica was more than twice as big in Chicago. Up. Also Brother George Albert Jamaica a Doctor.\nBecause of family connections in South Carolina, I am writing in this history of the family. Fred and George are a well-liked uncle whose descendants are their great-great-grandchildren.\n\nIn 1832, my own mother was born. She had a son named Robert and a daughter named Sarah.\n\nRev. Russell's children were great-grandchildren of Frank N. Smith from South Carolina and his wife, Mrs. Robert Davis Earle. Sarah was also descended from my mother's brother John Green.\n\nJamaica was more than just a place; it was Chicago, IL. Also, there was a doctor named George Allen's family.\nof medicine in Buffalo, New York and also was a Baptist minister in a church in that city on Sundays. His address at that time was 575' atford Road, Buffalo, New York.\n\nYoungest brother was Harry Matheson, unmarried and the mill's greenman, and the youngest sisters added Parker Jameson was Dr. D. P. Jameson, who was a medical doctor in Newfane, New York, and Caroline Washington, Mrs. George Cole, where she died.\n\nHer husband and daughter, Mrs. Frank L. Weller and Miss Pauline Weller live at 763 Athene St., San Francisco, Calif.\nof Medicine in Buffalo New York and also was a Baptist minister in a church in that city on Sundays. His address at that time was 575 attorney Road Buffalo, New York.\n\nAnother Brother was a mathematician and the mill, wreeman, and the Young Ladies' Advice Parker family was Dr. P. Jennings brother who was a medical doctor in Kentucky, North Dakota and California where she died.\n\nPacoma, Cal., where she died.\n\nHer husband and daughter, Mrs. Frank L. Walker and Miss Pauline Walker live at 763 Athene St., San Francisco, Calif.\nHistory of the Jamison Family\n\nThey came to Canada in 1832 from the town of Pitties, County of Simcoe, Ontario.\n\nThe newspaper called the Buffalo Courier was purchased by Mr. James Jamison and published by Mr. Archie Jamison. It was a true story and was written by W.G. Jamison to his daughters.\n\nMr. Jamison is now deceased.\nHistory of the Jamison Family\n\nThey came to Canada in 1832 from the town of Petipec, County of Simcoe, Ontario.\n\nThe William Jamison family owned the newspaper called the Daily News. This newspaper was purchased by Mr. Bennett and published by Mr. Bennett himself. It was a true story and was written by W.G. Jamison to his daughters.\n\nMr. Jamison who was attending the Senate for the first time in Washington D.C., the capital of the United States.\n\nMr. Jamison is now deceased.\nBut his Daughter Miss Walter\nBill lives at 106 Randyashawa Rd\nOntario\nBut his Daughter Miss Walters\nBell lives at 106 Randy Ashmore Rd\nOntario\nStory of the Jamain Family\n\nPart 1\n\nMy father was born in Ireland in 1820. His father was James. That was your great-grandfather. He was born in Fethie County, Ireland. My great-grandmother's name was Catharine Beatty. Before she married my grand-father.\n\nIn 1832 when my father was 12 years old, his father and mother with two sisters and brothers left Ireland and came to Canada. Then they came to Montreal from Belfast, Ireland after many days on the way and came to Appinario.\nStory of the Jamain Family\n\nPart One\n\nMy father was born in Ireland in 1820. His father was James. That was your great-grandfather. He was born in Petties County, Armagh, Ireland. My great-great-grandmother's name was Catherine Beatty before she married my great-grandfather.\n\nIn 1832 when my father was 12 years old, his father and mother with two sisters and brothers left Ireland and came to Canada. Then they came to Montreal from Belfast, Ireland after many days on the way and came to Quebec.\nIce flows are great sheets of floating ice, often many feet thick and from a few yards to perhaps a mile in extent. When a vessel gets squeezed between two great fields of this floating ice they are very apt to be crushed and sink. Their vessel got caught in the ice and for three days and nights were held fast.\n\nThey saved their ship by pulling all the spare spars they had on board down the side of their ship, and the ice came against them and did no damage to their ship. Had they not put the spars down the ice would have chewed big holes in the ship's side.\nIce flows are great sheets of floating ice, often many feet thick and from a few yards to perhaps a mile in extent. When a vessel gets squeezed between two great fields of this floating ice they are very apt to be crushed and sink. Their vessel got caught in the ice and for three days and nights were held fast. They saved their ship by pulling all the spare spars they had on board down the sides of their ship, and the ice came against them and did no damage to their ship. Had they not put the spars down the ice would have chewed big holes in the ships side.\nand sunk her as it was the ice ground up\nthe Sparrow they were nearly used up and the people were beginning to fear\nthey could not save the ship when the ice parted and\nleft a channel or open water\nso that they were able to sail\nquickly away\nthen after the ice crowded\nthe ship so close that it tipped the ship up out of\nthe water, and then when they\nwere in the greatest danger\nfor if the ship had not lifted\nshe would have crushed\nher sides in like an egg shell.\nWhen the ice ripped her up the\nSparrow and some of the passengers\ngot out on the ice and made\nand sunk her as it was the ice ground up\nthe Sparrow until they were nearly wedged up and the people were beginning to fear\nthey could not save the ship when the ice parted and\nleft a channel of open water\nso that they were able to sail\nout and get away\nonce after another crowded\nthe ship so close that it tipped the ship up out of\nthe water, and then when they\nwere in the greatest danger\nfor if the ship had sunk\nshe would have crushed\nher sides in like an egg shell\nwhen the ice ripped her up the\nSparrow and some of the passengers\ngot out on the ice and made\nfoot with cables and anchors\nto the ice to keep the ship from\nfreezing over on her side.\nThey were\nkind and thankful when they\ngot out of the ice.\nThere was very little\nfor anyone on board until\nthe ships Captain held a\nThanksgiving service on\nboard for their preservation.\nIn good time without\nfurther mishap they reached\nMontreal. There they had to\nleave the ship and make\nother arrangements to go to\nLittle York, which afterward\nbecame Toronto. It was called\nlittle York after the Duke of York.\nIt more generally called muddy\nboat with cables and anchors\nto the ice to keep the ship from\nfreezing over on her side.\nThey were\nglad and thankful when they\ngot out of the ice.\nThere was very little\nfor anyone on board until\nthey were free and then\nthe ship's captain held a\nThanksgiving service on\nboard for their preservation.\nIn good time without\nfurther mishap they reached\nMontreal. There they had to\nleave the ship and make\nother arrangements to go to\nLittle York, which afterwards\nbecame Toronto. It was called\nlittle York after the Duke of York.\nIt more generally called Murray\nYork.\n\nBecause it was a very muddy place so the town was buried in a swampy and marshy place. You turned hard west at the time city they then from on the same ground.\n\n1832 is known to this day as the year of the enceinte epidemic. That was during that attacked people and they turned be dead in a few hours after they took ill.\n\nThousands of living people died that year and sometimes the disease would break out on ship board when crossing the ocean and very few would live to reach the land.\n\nWhen my father family reached Montreal they found the cholera\nYork.\n\nBecause it was a very muddy place so the town was built in a swampy and marshy place. You formed hardcover while other snow when you were at the same city they then grown on the same ground.\n\n1832 is known to this day as the year of the cholera epidemic. That was a disease that attacked people and they would be dead in a few hours after they took ill.\n\nAfterward, a young girl died that year and sometimes the disease would break out on ship board when crossing the ocean and very few would live to reach the land.\n\nWhen my father family reached Montreal they boarding the Cholera\nVery Bad and hundreds of people died from it. They were forced from homes and more than contracted the dread disease.\n\nIn those days there were no railroads in Canada and all families had to come up the St Lawrence river in small boats from Montreal.\n\nThe boats were called Durham boats. These Durham boats were open boats built entirely very strong and narrow and had to be propelled with oars and when they came to rapids they hitched a boat to a strong cable and all the men worked out on shore and pull the boat up the rapids. It was hard work and very slow and the trip took from\nVery Bad and hundreds\nof Rappes dead from it.\nThey were for many hours\nand none of them continued\nin their own countries.\nIn three days there were\nno rascals in Canada and\nall families had come\nup the St Lawrence river in\nsmall boats from Montreal.\nThe boats were called Brule\nboats. They Burnham wrote\nwere about four feet wide\nvery strong and narrow and\nhard to be propelled with oars\nand when they came to rapids\nthey hitched the boat to a strong\ncable and all the men\nwore out on shore and pull\nthe boat up the Rapids.\nIt was hard work and very\nslow and the trip wrote from\nThis was the way my grandpa and his family had to travel. They had to go by boat and had all their luggage ready to put on board, but when my grandmother saw her boat she refused to go in it. So they waited until the next day and went in another boat.\n\nThe day after they left Montreal they came up to the other boat. They up to the shore and every soul that had been aboard was dead from cholera; again it was a fortunate escape for our people and my grand-\nI went back to New Mexico to see my family. This was the way my grandpa and his family had to travel. They had all a boat to leave from and were ready to go on board, but when my grandmama saw her boat she refused to go in. So they waited until the next day and went in another boat.\n\nThe day after they left Montana they came up to the ocean boat. They up to the shore and every soul that had been aboard was dead from cholera again. It was a fortunate escape for me, because my grandpa was a keeper and my grand-\nfather always said he was thankful that his wife had refused to go up that year.\n\nThey reached Rutt (York) in safety and found that the cholera had reached them so they got away as quickly as possible.\n\nIn Toronto they met through some friends some people who were going to settle up land so they went in their company to a place near the village of Berlin about 30 miles west of Toronto.\n\nThey found land they thought would do and settled there.\n\nOf course the country was then a wilderness and they had to cut down the trees by hand.\nFather always said he was thankful that his wife had refused to go in that hour.\n\nThey reached River Hope (Toronto) in safety and found that the cholera had receded there so they got away as quickly as possible.\n\nIn Toronto they met through some friends some people who were going to settle up land so they went in their company to a place near the village of Berlin about 30 miles west of Toronto.\n\nThey found land they thought would do and settled there.\n\nOf course the country was then a wilderness and they had to cut down the trees before they could get a wigwam.\nRural or at home land\nto raise crops on. You may\nbe sure the men were very\nawkward at first at cutting\ndown trees because they had\nnever done that kind of work.\nThe neighbors helped them\nand then they learned\nquickly and in time. They\ngot to be very adept at\nhandling the ax. When my\nfather got to be a great\nwoodcutter he was very\nskilled and one brother and one\nsister often thought him\nand two brothers and three\nsisters from them himself\nwhen they found new land\na man, he worked for a little\nRural or as I am taught\nto raise crops on. You may\nbe sure the snow was very\nawkward at first at cutting\ndown trees because they had\nnever done that kind of work\nin Ireland.\n\nThe neighbors helped them\nand then they helped them\nback and in time they\ngot to be very adept at\nhandling the axe. When my\nfather got to be a great\ncook he always used the\naxe by the woodcutter.\n\nHe had one brother and one\nsister and two brothers\nand two sisters and three\nchildren. They raised them\nthemselves. They knew how\nto make a good fire and\ncook a meal, the world's best\nmeal.\nPeople went to school and money to educate him and then he went teaching school. He taught school for twenty-seven years and then the government of Ontario gave him a pension which helped him in his old age.\n\nNow, I have told you the story of their life until they found a home for them selves in the country of Peel, Ontario at the town of Bolton on the C.P.R. between Toronto and Owen Sound.\n\nA man named Bolton had built a grist mill for making flour and the village was called after him. The town grew up around the mill.\nPeople went to school until they were ten years old. The last school was built in 1875 when the government of Ontario gave them a teacher who helped them in his old age.\n\nNow, I have told you the story of their life until they found a home for their family in the country of Peel, Ontario at the town of Bolton on the C.P.R. Between Toronto and Owen Sound.\n\nA man named Bolton had built a nice farm near the village where he lived after him. The town grew up around the mill.\nHi. I was from New York from the town South Yarmouth where I make another story. I have a small relic which is a cloth in Kittery Point in 1832 by my grandfather when he died my grand mother gave it to me and I still have it. That is over 63 years ago.\n\nNow I will tell you about our life in the Bush Country up North at Yarmouth. But it was wild country and no town there where my family and friends. I Dorset, Maine and much of their first years in Canada.\nHi I was born in from the town South Town when I make another story I have a small relic which was in a cloth in Brum which was bought in Kitty York in 1832 by my grand father when he died my grand mother gave it to me and I still have it. That is one 63 years ago.\n\nNow I circled Ten years about our rise in the Beach country up North at Jaraqui. But it was wild country and no town there where my family two brothers named others. I Dorit known much of their lives years in Canada.\nI once knew they got along very well and had a comfortable life in Bellingham near Toronto.\n\nIt was while teaching school that my father met my mother. She was a pupil in his school and they fell in love and were married. They were married a little over a year when I was born. My mother lived only two weeks after that my grandmother took me to live with her and she took care of me until I was eight years old. In the meantime, my father had married again and took me home to live with them. I had one half brother and a sister.\nI only knew they got along very well and had a comfortable home in Bolton Village near Toronto.\n\nIt was while teaching school that my father met my mother. She was a pupil in his school and they fell in love and were married. They were married a little over a year when I was born. My mother lived only two weeks after that. My grandmother took me to live with her and she took care of me until I was eight years old. In the meantime, my father had married again and when I was eight he came and took me home to live with them. I had one half brother and 2 sisters.\nWhen I was three years old my grandfather, father, mother, and I came from Scotland to Canada and moved up into Bruce County, Ontario, where we lived in 1853.\n\nDo you know why they kept a very comfortable place for me in the Bruce County? For this time the country was pretty well settled up and a great deal of land cleared off by them and brick and prosperous farming and taken the place of its great lonely forests.\n\nI can remember some of the things that happened after we\nWhen I was three years old my grandfather family came into Ontario and then living in Bruce County Canada and moved up into Bruce County and there was in 1853.\n\nDo not worry they kept a very comfortable place for me in the Bruce County.\n\nFor this time the country was pretty well settled and cleared off by them and brick and plastering farming land taken the place of great lonely forests.\n\nI can remember some of the things that happened after we\nI went to Bruce county although I wasn't very good\nremembering the thrilling\nmachine coming to my\nfamily place. Please in the\nfact and remember my grand\nfather gathering the apples\nand peeling them in his\nin the attic to keep for the\nwinter.\n\nI can remember one or two\nincidents on the road to our\nnew home. We went there in March and\nthere was snow on the\nRoad. And one in the spring\nfurniture upright which\nthey were later with them.\n\nI can remember my aunt Kate\nhaving me on her knees for\nMonty the trip. She was very\nmarried.\nWe went to Bruce country although I wasn't very good at remembering the thrilling machine coming to my grand father's place in the fall and remembering my grand father gathering the apples and peeling them in his attic to keep for the winter.\n\nI can remember one or two incidents on the road to our new home. We went there in March and there was lots of snow on the Road and one of the Souths' furniture upset which they were carrying with them. I can remember my aunt Kate helping me on her knees from Montpelier trip. She was very warm.\nWe had a case of earache in our house at the Seigh where we sat. That was my aunt Rattle whom many you can't remember much at that time and in many cases they thought at a year or two before I had things fixed in any way around.\n\nRemember your great-aunt little boy and it was all new to everyone to me! We had a trip to town and before and after near the edge of a small creek the rain past the house along the width of a street away. Around us was a forest of dense trees. I can't remember how the fire might have come.\nI've had a case of earache in one ear near the Seigh where we sat. That was my aunt Rattle when name you Bear.\n\nYou carry remember much at that time and in spring rain they months at a year or two before I had things fixed in any own mind.\n\nRemember gums grow a little berg and it was all new & strange to me! We had a trip long hours ago before and it stood near the edge of a small creek the rain past the house away around width of a street away. There was a young boy there I can remember his name night after night came.\nIt was very bright moonlight night when we ended our trek across the creek and in seconds like gems they fired my aunt Rottie and two uncle (her brothers) were away from home. For the next few days I was very scarce and the house worked hard to keep us grumpy in our beds.\n\nGrandfather and my grand mother quite afraid the house was going to fall down so they replaced the furniture and bedding into the middle of the floor and we went over to my father's place and stepped for the remainder of the night.\nIt was very bright moonlight night when we ended there in South Carolina. We were being buried. My aunt (her brothers) were away from home for the winter and the house was very empty and lonely. We were worried about my grandpa and my grandpa's mother who appeared to know what was going to happen soon so they relocated all the furniture and bedding into the middle of the floor and we went over to my father's place and stayed for the remainder of the night.\n17 of the night, of course when they got home in the morning we found everything as we had left it. For the house was Slick Sandusky did not do my grandfather died early do he feel the cause and how my two uncles who were going men dry the cuttings down of the big hard wood trees they chopped the lumber down the trees to make homes to build it all had to be burned up for land for crops and pasture land for cattle acres horses a active stock also for winter feed which was for the most part hay or straw.\n17 of the night by course when\nthey got home in the morning\nwe found everything as we\nhad left it. For the house\nwas Skee Sealee's. But\nmy grandfather died and do\nthe heavy work away now. But\nhe had the cattle and hogs,\nmy two uncles who were going\nwith me to the country down\nin the big hard wood up\nThey chopped the wood down\nthe trees to make room to build\nit all had to be burned up\nfor land for crops and pasture\nland for cattle and horses\n& cattle store also for\nwinter feed which was for\nthe men & boys or slaves.\nWhen one day they cut down a large tree they found it hollow inside. But a Red Squirrel had stored buck nuts in it and my uncle brought them home and they were very good eating to a little boy. But I felt sorry for the poor Squirrel who had lost his winter food.\n\nI was very happy at my grandmother's. People were so sociable there and would visit each other often. They came in the morning and would stay till after supper and help quilt or sew or different kinds of work \"Bee\" with the men such as butchering meat &c etc.\n\nIn the summer they would\nWithin one day they came from a cottage near. They brought a Red Squirrel that stored nuts. Next in is a grey squirrel through their home and they were very good eating to a little boy. But I felt sorry for the poor squirrel who had lost his winter store.\n\nI was very happy at your grand mother. People were so sociable, then and always visit each other often. They came in the morning and would stay till after Supper and keep going or \"see you\" off. Nice words such as \"Butterfly\" and \"etc.\" In the Summer they would\nI leave before sundown and my aunt Lottie would go a piece of the way with them and take me along for a walk and when I got tired she would carry me on her back. I am afraid I got tired very often.\n\nThe friends of course brought their small children with them and that was a happy day for me as I had someone to play with. I had no playground at that time near us.\n\nLater on I had cousins living near me and we visited back and forth and I have many happy memories of their visits and our own visits to their homes.\nI came before sundown and my aunt Louise joined me at the way with dinner and called me along for a walk and when I got tired she would carry me on her back. I am afraid I got tired very often.\n\nThe friend, Emma brought their small children with them and that was a happy day for me as I had someone to play with. I had no playmate at that time near us.\n\nLater on I had cousins living near one and we visited twice a year and I have many happy memories of their visits and our own visits & visits.\nChristmas was a great day for me. My aunt would start to prepare for it a couple of weeks before and that was a great time for me. For she always gave me a taste of everything she made.\n\nThen there was always some of our friends that came to spend the day and then but not so often some of our own relatives from the \"farm\" as we called it at Bolton near Toronto. Even after I was married to Willie Harrison and we came to Carman Manitoba we always spoke of Tara, our old home, and then we had no other home but Carman.\n\nThe people who came from\nChristmas was a great day for me. My aunt would start to prepare for it a couple of weeks before and she was always very nice for me. She always gave me a taste of everything she made.\n\nThen other years always come your friends they came to spend the day and then our parents often some from the \"Yumi\" and we ended up at Bob's near Toronto. Even after I was married to Willie Harrison and we came to earn more money, we always spoke of those old times and then we had no other home but Canada.\n\nThe people who came from...\nThe \"front\" or Bollin always brought us apples for the farms in the Bush country was too new to have apple trees that bore fruit as yet. So after their apples were done we cut up them until the next growth the following year.\n\nThere were no railroads in that part of the country for many years after that and everything had to be hauled with teams & wagons, many of them hand made from Guelph a hundred miles away, as that was our nearest point on the Railroad. The women made our clothes and spun the wool forth.\n2/12 From \"at Boiling always\nthrough no apples for the\nseason in the Bush country was\ntwo new to have apples there\nthat Bore fruit as yet.\nSo after their apples were\ndone were all of them until\nthe next growth the following\nyear.\n\nThen were two railroads in\nthat part of the country for\nmany years after that and\neverything had to be hauled\nwith teams or wagons, many\nof them hand made from\ntrees a hundred miles\naway. As start was an\nevent in running on the Rail-\nroad. The women made and\nclothed and spun the wool for\nIt might be very interesting to tell you how the early settlers lived and the various make ships they had to use. Beds were made of wood and the bed ticks or mattresses were made of patch work pieces and filled with straw or hay. The bed slats were strong with rope and sometimes slats of wood would be used in place of rope then mattress laid on them. A rolling pin was whittled out of wood. Some had wooden boxes for butter & milk. Some made even wooden goules to handle hay. Rigs & wood fastened doors in place of nails as we have today.\n2. They be very interesting\nto see you how the savages\nsecured lives and the women\nmake ships they had to use.\nBeds were made of wood and\nthe Bed Feet or mattocks were\nmade to pat them until pieces\nand fixed with straw or\nhay. The Bed seats were strung\nwith rope and some times set\nin wood wound in wood in\ntrees. Ropes were used in\nknot on utility. Rolling Rock\nwas whitted out of wood.\nSome had wonder boxes for Butter\nor Milk. Some made wonder\ngadgets to handle hay. Rope\nwould prevent death in peace\nof walls so we hang 5 days.\nalso Benches and Chairs and Benches to sit on had this wooden pegs in place of nails.\n\nI forget to mention that my mother's name was Charlotte Scholescroft and you are called Charlotte or Lottie after her.\n\nSigned\nYour Loving Papa\nW. J. Jamison\nCahoon, Mass\nAlex Berrichon and Charlie and\nBenches to sit on had this\nwooden Repo in Peace & nails.\nI forgot to mention that\nmy mother named me\nCharlotte Selvatore and\nyou are called Charlotte or\nKatie after her.\n\nSigned\nYour loving Papa\nW. G. Jamison\nCarmel, IN\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Four with married couples. How many of these were bachelor's homes? 40 within a radius of 4 miles.\n\n2. How often did you usually visit neighbors? On Sunday.\n\n3. Did you usually visit on a Sunday, or other days? Yes.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Yes.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Not until 1909-1910.\n\nWhat about meals? Did you stay when not invited beforehand? Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?) Need to ask us to have a cup of tea which turned into a regular meal.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? None.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Some one stayed home in winter.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? To build.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. Sometimes a wood cutting bee. Most of the houses very small except our own which was 20 by 34 ft long.\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe. Only big girls in community. No dances until after the Plymouth school was built in 1908 by my father J.W. Anderson.\n\nWere these more frequent in later years? Give dates. We had very good concerts & dances every few weeks in the Plymouth School.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, as there were no fences and landmarks to speak of and farms were fenced and we had graded roads. Most of the traveling abroad was in daylight.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPioneer Recreation and Social Life\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough so you could visit back and forth? How many were married couples? How many of these were bachelor's houses? How many of these were bachelor's houses?\n\n2. How often did you usually visit on Sundays, or other days?\n\n3. Did you usually visit on Sundays, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? For instance, 179-1910.\n\n6. What about meals? Did you stay when not invited beforehand?\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (That is, was there a formal invitation used, or was some other expression common?)\n\n8. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n9. Tell what you remember about such gatherings giving dates if possible. Sometimes they were very quiet, and sometimes very noisy.\n\n10. In the earliest years that you were here, were there any parties, while still living in the community? If so, describe.\n\n11. Did you follow any kind of schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc.?\n\n12. No, so there were no parties and card games. We played cards and visited until dinner time.\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nWe held our Picnic July 12th at the Beach on Panton Lake 1908. We had a picnic every year on 24th May from 1907 on. We after 1924 in Allen's Grove.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nAll School Church meetings & Church Services held in Plymouth School, and Banquet, Council meeting held in homes of the Council Members.\n\n9. When was your first community hall built? Now. 1908 School was built.\n\nWhat material was it made of? Lumber. How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? My Father J. W. Henderson and Son Lorne R. Henderson built the School.\n\nWas it built in the village or town, or was it a country hall?\n\nCountry on main road to the lake.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\nThe community at Plymouth and Poplar Park, of which we were residents used School houses entirely. Poplar Park School was built in 1910.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes.\n\nHow were babies and small children provided for? Babies were held or put on a pile of chairs on platform.\n\nHow were horses sheltered and fed in the winter time at these parties? Put in the School barns or blankets in Bridge, Whirl, Tap, Boa, Tucker.\n\n11. What card games were popular in the early days? Bridge, Whirl, Tap, Boa, Tucker.\n\nWas there card playing for a prize? Just at White River.\n\nWhat dances were popular? Waltz, Two Step, Waltz Quadrille, Square Dance, Seven Step, Military Schottische.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nSome were against using the School on Regular Principals. But often came to Dance.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nSome were not in favor. But in a Community such as we were in with people from U.S.A., London England and Eastern Canada we had to have some amusement as we were 60 miles from Humboldt, our town.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Tell when it was organized, and what steps led to its organization. Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at formality, or \"visually,\" do you remember in small towns, such as cloaks and hats when calling, calling cards, visits breasted ceremonially in parlor, etc.? \n\n13. Any other customs known in your community? \n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\n16. Has there been a Saskatchewan Grain Growers' Club in your community?\n\n17. Was there a Homemakers' Club in your district?\n\n18. Approximately how many women belonged to it?\n\n19. What were some of the activities carried on by this organization?\n\n20. Describe what you remember of its activities and services.\n\nThey had papers on all sorts of subjects. Some of them on politics and farming. They also had a feature called Recipe or News.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purpose, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding economy. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nThrough the Homemakers we had several Ladies from Sask. University demonstrating Crocheting, Dress Making, Hat Making and various other affairs. Also had the Saskatoon Library traveling library and had exchange of Speakers, the Bergg & University, our own and various other Colleges. What means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? In the School houses only.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nThey had wonderful Debates on a very wide range of subjects from the rights of women to a Reality Show. Political Questions of the time then.\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides? None\n\nWhat were the slides about? None at all that I know of.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypes, ball, marbles, fly kites, etc.)?\n\nCricket, foot Ball mostly. Some wrestling, on very strict rules.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nI think most of them were kept busy at home in Chores. I was 17 when I came to Canada so I didn't see much of their games at school, as I didn't go to school in Canada at all. I went to a School...\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, its purpose, and the people who attended. For example:\n\n- Church of Christ\n- Masonic Lodge\n- Elks Club\n\n19. Where did various organizations hold their meetings?\n\n- Second Avenue only.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\n- Yes, we had lectures on various topics such as world events, science, and history.\n\n21. What games did boys play in summer? (Mumblety-peg, ball, marbles, fly kites, etc.)\n\n- Cricket, baseball, marbles, some wrestling.\n\n22. What games did girls play in summer? (Skipping rope, play house, etc.)?\n\n- Games like jump rope, hide-and-seek, and playing house.\n\n23. What was the most popular game among children in your community?\n\n- I think it was marbles, but I'm not sure.\n\n24. Did you have any special activities or events during the summer?\n\n- We had a picnic at the park and a dance at the community center.\n\n25. How did you spend your time during the summer?\n\n- I spent my time playing with friends, going to the movies, and reading books.\nin which there was a great deal of confusion and misunderstanding. It seemed as though we had been engaged in a battle for survival.\n\nWe were forced to adapt our plans to fit the circumstances. We had to be flexible, like a chameleon.\n\nIt was a hard road. We faced many challenges, but we also gained much in the way of experience. It was a study, a journey, a lesson.\n\nAnd so it goes. We find that our lives are filled with ups and downs, twists and turns. We must be prepared for anything.\n\nIn conclusion, I would say that life is a journey, a lesson, a study. We must be prepared for anything.\nIn Nacogdoches, Texas, where our principal and teacher was a very stern man, a graduate of Cornell University and Red School Normal College, Charles E. Powell was his name. We had half an hour's exercise every morning. Sang a song to begin the purpose. Then each boy had to recite a short quotation from a classic author such as Ben Jonson, Shakespeare, Lowell Longfellow, Keats, Shelley, Lord Byron, or many others. We also could tell the story of a book we had read. Such as \"The Tale of Two Cities,\" \"Little Women,\" \"Pride and Prejudice,\" or our \"Reluctant We were given credit on our report card for the participation in games to examine for the participation in games to the Recreation Room or story.\n\nMr. Powell joined the Canadian Mounted Police in 1906. He was sent on a detail and was last in a Sioux storm. He was killed in a gun battle and crashed in his house. His name became famous by the stunt himself. His house was burned and his family killed. A brave leader and a noble man. Referring to the circumstances.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nSkating on ponds near schools.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nThere was a bunny on gopher tails, a cat's ear so the troop took an interest in catching & killing them.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n24th May 1907\n\n26. Who organized it?  \nIn Albert House, a neighborhood picnic, all invited\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nFor the whole community\n\n28. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \nChildren's races, as we all attended Roman Catholics & Protestants & other nationality. Some one was chairman called the race etc.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \nWe all shared one long table spread on the grass.\n\n31. What did you have to eat and drink?  \nTea and coffee, meat & chickens, potatoes, salad, rice, cake, biscuits, cookies etc.\n\n32. What time of the day did it start, and how long did it last?  \nAbout ten 4:00 pm and lasted till about nine at night.\n22. What winter games were played outdoors? (e.g., hide-and-seek, tag, etc.)\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Old children's games connected with such things as buffalo bones, horns, hearts, etc., or other objects of animals, or games in the shape of animals.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. The organized activities included:\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did we all share our own food spread on the grass?\n\n31. What did you have to eat and drink? Tea and coffee, meat, chickens, potatoes, spread, etc.\n\n32. That time of the day did it start, and how long did it last? About nine o'clock and lasted until about nine at night.\n33. Describe any features of this picnic which you remember as outstanding.\n\nPeople came from various districts and all were made welcome. The food was delicious and the men had made a stand, we owned a big freezer and made ice cream, etc., etc.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAfter some of the first sisters left a new crop came in of strangers. They seemed different somehow, not so easy to get to know.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFoot Ball (association)\n\nWhat year? 1909-10 How long did it continue? Several years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nSkating & Hockey only\n\nWhen was the first indoor rink built, and what was it used for?\n\nNone\n32. Describe any features of this picnic which you remember as outstanding.\n\n33. Describe any differences in numbers attending, activities, food and drink, when held, etc.\n\n34. Describe any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1909-10\n\nHow long did it continue? Several years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competition in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n   about 500, most of Dickens, some B.\n   Shakesey, anything Hope, Stowe Edward White,\n   Wilkie Collins, S.R. Crockett, about History\n   Mark Eliza Ryan.\n\n   I had read most of Dickens before I was 12 y/o\n\n43. How many of your neighbors brought books with them? Not very many\n   What kind of books and how many? Do not know.\n   The Bachelors borrowed ours some were\n   returned some not.\n\n44. To what extent did you exchange books with neighbors? Never.\n\n45. Did you buy many books after you came west? Give details. No, But my\n   aunt sent us a boy by freight every year\n   from Pittsburgh Penna. U.S.A. all new books.\n\n46. What books were sent to you as gifts in early years?\n   another aunt sent Mr. Ladie's Home Journal\n   Saturday Evening Post & Country Gentleman for 3 years\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates. Yes after 1915 they had\n   the Saskatchewan Traveling Library at\n   Royal Park School.\n\n48. Was there a school library? No\n   When was it begun?\n\n   To what extent were books borrowed from the school library for adults to\n   read at home? None\n\n49. Did parents ever use their children's school text books as additional reading\n   material? I don't think so\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\nWas there any special day unusually held (what month, or any special day, such as May 24th or July 4th)?\nAre there any from your community who have become members of well-known teams, hockey, ball or other teams? (Give names, and places.)\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors.) If not, how many? (Has anyone ever given you any books you brought, and what kind?) (Has anyone ever given you any books you bought, and what kind?)\n\n43. How many of your neighbors brought books with them? (Give very many)\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. No, buying from Pittsburgh Press, all new books.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes.\n   When was it started? 2 years ago. Who started it? 2 years ago.\n   Is it still in existence? Yes.\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n   Mrs James Gibney was the last Librarian & former School teacher out of Watkins, now lives in town.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   We got the Home Paper from Nebraska South Dakota, The Chronicle and Family Herald & Weekly Star (Montreal).\n   In addition a friend who published the newspaper sent us bundles of Chicago Papers.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n   Lack of money perhaps or lack of interest in what they published.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   Ladies Home Journal, Saturday Evening Post and Woman's Home Companion, Lone Pine News, Little Okotoks Country Guide, Several R.R. Magazines.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   No, I had more than I could get read before I was old.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? 2 years ago. Who started it? 2 years ago.\n\nIs it still in existence? Yes.\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nMrs. James Gibney was the last librarian & former school teacher out of town, now lives in town.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? We got the Home Paper from Nebraska North Dakota, The Chronicles and Family Herald & Weekly Star (Montreal). In addition a friend who published the newspaper sent us bundles of Chicago Papers.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. Lack of money perhaps or lack of interest in what they published.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? Latin Home Journal, Saturday Evening Post and Woman's Home Companion. Also Maclean's & the Chatelaine Country Guide & Rural R.H. Magazines.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. No, I had more than I could get read before I was old.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Piano and\n\n57. What instruments did any of your neighbors have? Several.\n\nOne a beautiful Player on a flute, all\n\nClassical music nearly.\n\n58. What musical instruments have you bought since you came to the west? Give\ndates, prices if possible, and tell where you bought them.\n\nOur piano cost $450. Bought in\n\nWatrous 1915 after I was married.\n\n59. How large a part did singing and other forms of music play in your home en-\ntertainment in early years in the West? Describe.\n\nThe young folk gathered at our house on\nSunday eve, I played they sang until\n12 o'clock then had dinner. They went home.\n\nin the community? (were there musical concerts, was there group singing at\nparties, etc.) Describe.\n\nhome but in ours but at\n\npiano\n\n60. What were some of the favorite songs in the home?\n\nSteamer River, Carry me Back to Old Virginia\nTen weary years since I left England's shore, Some\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your\nhome or community? Explain.\n\nNot particularly just music\nand the ability to sing was enough we weren't\npartial to any one or kind of music.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old\ntune as a joke on somebody, or because of some special happening in the\ncommunity? Explain.\n\nat Watrous, Sack\n\n63. Was there a band in your community? When was it started? about 1912\n\nWho started it? Tom Bjornstad\n\nHow long did it continue? Several years\n\nHow many were in it? Tom Burke Leddally\n\nWho was bandmaster? Mr. McVeigh\n\nWhat instruments were included? Home Bass Drum Snare\n\nTell what you remember of its activities, how often practice was held, where,\nif members had uniforms, what events the band played for.\n\nBand Practice was held in Watrous\nTown Hall, they played for Sports Days\nin Watrous & at Manitou Beach and\nLaugan Sports Days & have come to\nCastlewood Lately. Had nice uniforms.\nMusical Instruments\n\n56. What musical instruments did you bring with you?\n57. What instruments do you have now?\n58. What musical instruments have you bought since then?\n\nMusical Activities\n\n59. How large a part did singing and other forms of music play in your life?\n60. What were some of the favorite songs in the home?\n61. Was there a band in your community? If so, who was the leader?\n62. Did you ever make up any of your own songs, or make up words to an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nMusical Events\n\n63. Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n6a. The aspect from your community becomes well known or famous in the nation itself. Give names and dates and places of public appearance.\n\n6b. In what way do you think important in your community now as compared with the early days? What is the reason for this change?\n\nINTERESTS AND SPECIAL INTERESTS.\n\n6c. Do you have any collections, such as stamps, stones, paintings, signatures, etc.? Explain.\n\n6d. Give details of your collection, telling when you started it, how you became interested in it, how you maintain it, events connected with it, and a description of the collection.\n\n6e. Did you make note of the weather, time of arrival of birds, blooming time, etc.? Explain.\n\n6f. Describe other hobbies or special interests of yours not already mentioned.\n\n6g. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n7a. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(use back of page, or extra sheets if necessary).\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906Q-Z_2077.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 88, "total-input-tokens": 146080, "total-output-tokens": 16274, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 622, 5], [622, 1042, 6], [1042, 1655, 7], [1655, 2231, 8], [2231, 2765, 9], [2765, 3294, 10], [3294, 3620, 11], [3620, 4100, 12], [4100, 4100, 13], [4100, 4100, 14], [4100, 4170, 15], [4170, 4243, 16], [4243, 4724, 17], [4724, 5223, 18], [5223, 5788, 19], [5788, 6352, 20], [6352, 6911, 21], [6911, 7475, 22], [7475, 8004, 23], [8004, 8560, 24], [8560, 9118, 25], [9118, 9708, 26], [9708, 10293, 27], [10293, 10871, 28], [10871, 11330, 29], [11330, 11845, 30], [11845, 12381, 31], [12381, 12950, 32], [12950, 13447, 33], [13447, 14009, 34], [14009, 14535, 35], [14535, 15011, 36], [15011, 15470, 37], [15470, 15954, 38], [15954, 16485, 39], [16485, 17051, 40], [17051, 17528, 41], [17528, 17977, 42], [17977, 18507, 43], [18507, 19046, 44], [19046, 19568, 45], [19568, 20094, 46], [20094, 20600, 47], [20600, 21061, 48], [21061, 21569, 49], [21569, 22090, 50], [22090, 22640, 51], [22640, 23159, 52], [23159, 23675, 53], [23675, 24173, 54], [24173, 24719, 55], [24719, 25243, 56], [25243, 25757, 57], [25757, 26277, 58], [26277, 26818, 59], [26818, 27350, 60], [27350, 27608, 61], [27608, 27859, 62], [27859, 27859, 63], [27859, 27859, 64], [27859, 30049, 65], [30049, 31564, 66], [31564, 34322, 67], [34322, 34322, 68], [34322, 35547, 69], [35547, 36413, 70], [36413, 38414, 71], [38414, 39548, 72], [39548, 40145, 73], [40145, 41171, 74], [41171, 42992, 75], [42992, 44195, 76], [44195, 45799, 77], [45799, 46963, 78], [46963, 48884, 79], [48884, 50211, 80], [50211, 51765, 81], [51765, 53288, 82], [53288, 55267, 83], [55267, 55979, 84], [55979, 57099, 85], [57099, 58213, 86], [58213, 58213, 87], [58213, 58365, 88]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]