[{"id": "baeefa0cea7c2fcb66165375be7d2fe77d1c985c", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. J.W. Maclean\nAddress: Beaver Lake, Sask.\nBirthplace: Prince Albert, Sask.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1910\nWhere did you set up housekeeping? At Beaver Lake, Sask.\nWhere had you been living before that? In Medicine Hat, Alta., and Calgary, Alta.\nFor how many people did you prepare meals? Two or three - then more\nHow far was it to your nearest store? At first, 30 miles; later, 15 miles\nHow often could a visit be made to the store? Every two months or so\nWhat groceries did you usually buy in those earliest years? The usual - flour, sugar, rice, dried fruits, syrup, jam, canned vegetables, home-grown butter, canned milk.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nIn what quantities did you buy it? 100 lbs.; taken in 25 lbs. at a time\nWhat was the usual price per hundred pounds of white flour? $1.50\nHow much did you use groats flour? Not much - used whole ground wheat\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? 75¢\nWhat other grain products did you use? Oatmeal\nCornmeal? 6 lbs. 25¢\nWhole wheat? Ground our own\nFarina?\nOther?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a chaffing mill\n\nReceived Sept. 16/51\n1. INCENDARY INCIDENTS\n\nThat year did you start housekeeping in [illegible]?\n\nWhere did you set up housekeeping? [illegible]\n\nHow far had you been living before that? [illegible]\n\nFor how many people did you prepare food? [illegible]\n\nHow far was it to your nearest store? [illegible]\n\nHow often could a visit be made to the store? [illegible]\n\nWhat groceries did you usually buy in those days? [illegible]\n\n2. FOOD AND THEIR GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [illegible]\n\nIn what quantities did you buy? [illegible]\n\nThat was the usual price per hundred pounds of white flour? [illegible]\n\nHow much did you use each month? [illegible]\n\nWhat other grain products did you use? [illegible]\n\nDid you make your own bread? [illegible]\n\nDid you grind it? [illegible]\n\n[Signature]\n\n[Date]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lbs. 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $0.50\n\nWhat brand of golden corn syrup did you use? Armstrong's\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price? $0.50\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Had a cow\n\nButter? Yes\n\nDid you make butter? Yes\n\nDid you make cheese? Yes\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Salt cured pork at first\n\nHow did you get fresh meat? Only once in a while in summer\n\nHow often did you get fresh meat? Not often\n\nHow did you preserve meat? As stated above\n\nWas there a \"beef ring\" in your neighborhood? Yes\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nFor how long? 1910-1920\n\nWhat part did fish play in the family diet? Not available here\n\nWas the fish fresh, cured, or canned? Fresh, canned, salmon\n\nKinds? Salmon, cod, halibut, salmon\n6. BEVERAGES\n\nWhat kind of tea did you buy? (Red River Blue River) At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) Hot, cold, instant.\nPrice? $2.50 per lb. What other beverages were used? Coffee, chocolate, soda water, lemonade, lime juice, mineral water.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n$2.50 per bushel. Could you get potatoes at the store? ...................\nIf not, where from? .............................................................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1911, Cabbage 1911, Carrots 1911, Onions 1911,\nTurnips 1911, Beets 1911.\n\nIn what quantities did you buy white navy beans? 5 lbs. 10 lbs.\nHow did you buy prunes, (in bulk or by the box)? By box.\nWhat weight? 20 lbs. How did the grocer handle prunes (by box)? Yes.\nWhat was the price of prunes? ...................\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\nPeas? ........... corn? Yes ....... beans? .......... Saskatoons? ...........\nOther foods? ........................................................................\nWhat year did you first preserve fruit by canning? 1913.\nWhat year did you first preserve vegetables by canning? 1923-1924.\nWhat year did you first preserve meat by canning? 1924.\nDo you still preserve foods by canning or drying? Canning.\nTo what extent? Mostly, sometimes, rarely.\nDid you make your own vinegar? Yes.\n6. What kind of tea did you buy? (Tea, Coffee, etc.) What price?\n\n7. VEGETABLES\n\n   a) What was the price of potatoes and apples on the market in your town last fall?\n\n   b) Could you get potatoes at the store?\n\n   c) If not, where from?\n\n   d) What year did you first grow your own supply for the winter or spring?\n\n   e) Potatoes $1.25/lb. Carrots $1.00/lb.\n\n   f) Turnips $1.00/lb. Beets $1.00/lb.\n\n   g) In what quantities did you buy white navy beans?\n\n   h) How did you buy prunes, (in bulk or by the box)? Price?\n\n   i) What weight? 2 lbs.\n\n   j) How did the grocer handle prunes (by box)?\n\n   k) What other dried fruits did you use in the earliest days? (apricots, peaches, apricots, pears, raisins, currants or others)?\n\n8. CANNING\n\n   a) In the early years did you preserve any foods by canning?\n\n   b) Other foods?\n\n   c) What year did you first preserve fruit by canning?\n\n   d) What year did you first preserve vegetables by canning?\n\n   e) What year did you first preserve meat by canning?\n\n   f) Do you still preserve foods by canning or drying?\n\n   g) To what extent? (mostly, some, little)\n\n   h) Did you make your own vinegar? Yes\n9. PLEASE FILL IN THE FOLLOWING ON THIS PAGE OF THIS QUESTIONNAIRE\n\n| FOOD                        | How was it sold? - In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------------|-----------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               | Always                                               | Buy.                               | 3¢ 6½¢              |\n| Macaroni                    |                                                     |                                    |                     |\n| Graham flour                | In small lots                                       |                                    |                     |\n| Brown sugar                 | Always - about 2¢ per lb.                            |                                    |                     |\n| Molasses                    | 5½ lbs. - about 6¢ - 10¢ lbs.                        |                                    |                     |\n| Table salt                  | 4 lbs. for 5¢                                         |                                    |                     |\n| Common salt                 | 5 lbs. - 9¢                                          |                                    |                     |\n| Lily white syrup            |                                                     |                                    |                     |\n| Toilet soap                 | 12½ lbs. 40¢ - Luke Daphne 9½ lbs. 40¢              |                                    |                     |\n| Baking powder               | 2½¢ per lb.                                         |                                    |                     |\n| Baking soda                 | 10¢ per lb.                                         |                                    |                     |\n| Dried peas                  | 10 lbs. - Canister - 6 lbs. 25¢                      |                                    |                     |\n| Dried corn                  | Canned corn - 10¢ per can                           |                                    |                     |\n| Vinegar                     |                                                     |                                    |                     |\n| Raisins - seeded            | 2 lbs. - 25¢                                         |                                    |                     |\n|                             | Seedless                                             |                                    |                     |\n| Rice                        | 5 lbs. for 25¢                                       |                                    |                     |\n| Currents                    |                                                     |                                    |                     |\n| Store Jan - kinds?          | Sold some lot                                        |                                    |                     |\n| Cheese (Cheddar or store cheese) | Only a little lot.                                |                                    |                     |\n| Vanilla                     | Small bottle - 25¢                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cake\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? A little\n\nBaking soda? Yes\n\nCream of tartar? No\n\nDid you make your own baking powder? No\n| Item                  | Price |\n|----------------------|-------|\n| Soda biscuit         |       |\n| Sugar                |       |\n| Graham flour        |       |\n| Brown sugar          |       |\n| Yeast                 |       |\n| Baking soda          |       |\n| Dried yeast          |       |\n| Bread crumbs         |       |\n| Yeast                 |       |\n| Roll cake            |       |\n| Raisins              |       |\n| Currants             |       |\n| Store jars           |       |\n| Cheese (Cheddar)     |       |\n| or other cheese      |       |\n| Vanilla              |       |\n\nID. TAKING\n\nWhat type of yeast did you use? ________ Yeast Cake\nDid you make yeast for your own use? ________ Using starter?\nYeast hops? ________ Salt rising? ________\nDid you buy baking powder? ________ Baking soda? ________\nCakes or tart? ________ Did you bake your own baking powder? ________\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR KNOWLEDGE:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               | Better grade.                                   |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n|                             |                                        |                               |                                                 |\n| Bananas - after 1912 or 13  |                                        |                               |                                                 |\n| Grapefruit                  |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Minuto tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ____________________________\n\nHow far was this water from your home? ____________________________\n\nHow was it brought to the house? (pail, barrel, tank) ____________________________\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n11. **FRUIT**\n\n| Item          | Price |\n|---------------|-------|\n| Apples - fresh | 7.5¢ per pound |\n| Apples - dried | 8.5¢ per pound |\n| Lettuce       | 25¢ per head |\n| Tomatoes      | 12.5¢ per pound |\n| Bananas       | 19.12¢ each |\n| Lemons        | 5 cents each |\n| Oranges        | 50¢ per dozen |\n| Corn Flakes    | 10¢ per box |\n| Other prepared vegetables | 5¢ per pound |\n\n**Other Prepared Vegetables**\n\n- Peas\n- Spinach\n- Beets\n- Carrots\n\n**Fruits**\n\n- Pineapple\n- Guava\n- Dates\n- Melons\n- Ice cream\n\n12. **WATER SUPPLY**\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nFor how long have you used this water from your house?\n\nHow was it brought to the house (pail, barrel, tank)\n\nIf earthing water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? Yes... used ash? No... what kinds of laundry soap did you use? (Specify brand, etc.)\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (Specify wood, gas, etc.) Where did you get your fuel? (Specify source) Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nSome now use propane. We have no electricity as yet.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Specify maker) What year was it purchased? (Specify year) What types of utensils did you use? (Iron, copper, tin, homemade) For preparing food? (chimney, earthenware, wooden bowls, other)\n\nWhen did you first use enamel ware? 1916 - plus age Aluminum? 1914-1915 Bat.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nPaper, Tin, cardboard, wooden cases.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast - (1) Porridge, milk, cream, bread, toast, eggs & fruit\n(2) Pancakes, toast, eggs, fruit\n\nDinner - Meat (where available), potatoes, vegetables, various desserts - such as pie & pudding or fruit\n\nSupper - Soups, meat, potatoes, salads, fruit, bread, cake.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? _________. Give the menu. List those present and give their approximate ages at that time.\n\nMenu - Chicken & trimmings, vegetables, cranberry sauce, pudding & cake, fruits, candy & nuts etc.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo - only as an emergency in winter when trains could not get through.\n1. Give a typical day's name (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate number of the family or number.\n\nBreakfast - (1) Pancakes, bacon and eggs. (2) Toast, tea and bread.\n\nDinner - (usually available) potatoes, roast beef, rice pudding or fruit.\n\nSupper - (usually) potatoes, pie, bread, fruit.\n\n2. What was the food like in your home town? Describe the food in detail.\n\n3. How much money would you need to obtain starting capital for your own business? Give details.\n\n4. Would you produce foods? Give details.\n\n5. As early as our ancestors in earlier centuries...\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nWith most folk, much the same, only buy more bread, cakes, cookies and canned meats & vegetables, and more fresh fruits. Some have refrigeration.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nThe last few years where help is not obtainable.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nIn early years everyone depended on T. Eaton Co. Mail orders and sent them very large orders for supplies.\n\nThis is compiled by:\n\nMrs. J.W. Maclean\n& Effie S. Copeland both of Dewar Lake\n\nand is much the same as experienced by most of our neighbors.\n21. Should you begin to rely on prepared foods and purchased foods instead of home-prepared foods? (Give as many details and dates as possible.)\n\nThe last few years where help is not available.\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in other ways during pioneer days in Montana Territory.\n\nInclude items not mentioned above; quality, methods of preparation, prices, problems of storage, shortages until other details.\n\nPage 11 more space is needed.\n\nIn early years everything depended on what was available.\n\nYours and your aunt and uncle,\n\nMrs. J.W. Meacham\n\nof Effie N. Copeland and family, Denver, Colo.\n\nand is much the same as experienced by many of our ancestors.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910A-M_281.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4919, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1592, 3], [1592, 2414, 4], [2414, 3380, 5], [3380, 3380, 6], [3380, 5011, 7], [5011, 6160, 8], [6160, 9853, 9], [9853, 10746, 10], [10746, 14757, 11], [14757, 15626, 12], [15626, 16624, 13], [16624, 16624, 14], [16624, 17777, 15], [17777, 18470, 16], [18470, 19515, 17], [19515, 20244, 18], [20244, 20399, 19], [20399, 20553, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]