[{"id": "b4f4e4717b5864c6670c3b36a1eeedb6f5fd9e1e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXTREME GRATITUDE TO THE PERSON WHO COMPLETES THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life, because no individual who is asked to answer it has exactly the same experiences to report. Some of the questions here will not apply to you; others may be answered in more than one way. If there are sufficient reasons to answer the questionnaires, it is best to answer them accurately or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1946 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one person of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plans: What Did You Do?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nAnd one will be sent to you.\n\nA later date, some of these are listed below. Please mark the ones you will be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health facilities\n- Pioneer health services\n- Pioneer housing and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Section Office at the University of Saskatchewan as part of the provincial record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ N. L. L. A. M. H. D. R. S. E. N. M. A. L. L. O. L. M.\n\n2. Your address .............................................................. K. R. T. M. M. A. K. R. A.\n\n3. Date ................................................................. 9/7/1914\n\n4. Where were you born? (Give name of place and country) .................................................. Woodstock Ontario Canada\n\n5. What was your father's name and occupation? .......................................................... Francis Scott Malcolm\n\n6. When did you come to Saskatchewan? (Give month and year) ........................................ April 1914\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .................................................. Blairmore Alberta Nov 1906 to April 1914 London Ont before that\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). .................................................. 91 years old\n\n9. What were your reasons for coming West? .................................................. To get some cheap land and so farming\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). .................................................. Through other people in school reading etc\nMalcolm W. Anderson,\nNorth Bokem.\n\nTo Sask. - April 12, 1914.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Malcolm William Anderson, M.A.S.C.C.H.M.\n\n2. Your address: 4447 19th Ave., North Bokem.\n\n3. Date: March 12, 1914.\n\n4. Where were you born? (Give name of place and country): Ontario, Canada.\n\n5. What was your father's name and occupation?: Thomas Scott, M.A.S.C.C.H.M.\n\n6. When did you come to Saskatchewan? (Give month and year): April 12, 1914.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario, Canada; Alberta; April 1904 to April 1914.\n\n8. How old were you when you first came to western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.) I was in my teens.\n\n9. What were your reasons for coming West?: To get away from the land and see something new.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    Through other people - others reading me.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWe were in favor of it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nRailroad CPR, Hanover, Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nVery ordinary harvest, dry season trips, no typhoid.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nChester.\n\n16. Where did you settle or take up land?\n\nIn the Meadow Lake district now known as Makwa Point.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI put in seven years working for others and logging contracts on my own in the Crows Nest Pass mostly in Blairmore.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on farms and saw mills in Ontario, logging mostly in the Crows Nest and worked on farms in Saskatchewan homestead.\n12. What means of transportation did you use?\n\nRailroad / P.R. Railroad - typew.\n\n13. What incidents of the journey best do you remember? (People you met on the way! Meeting with Indians, adventures on the journey, accidents or other excitement etc.)\n\nStory ordinary farmer - typew.\n\n14. Where did you first stay when you arrived in Saskatchewan?\n\nSherwood\n\n15. Where did you settle or take up land?\n\nFor the Meadows\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nSaskatoon\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on farms and mills\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on farms and mills\n19. How often did you write to relatives or friends in your old home?\n   Not relatives frequently (citizens seldom)\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\n   Married at Malvern Nov. 15 - 1943\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   I doubt it.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   There is not any particular incident that stands out at first it was about 75 miles of bush tracks to Post Office or store as this country settled up. The distance became less until today there are 3 miles from the Sand. Malvern Hamlet and 30 miles by rail head at Mudan Lake.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Not a great deal and until 1928 all by horses and wagon. Used to go out to the Prairies thrice in the fall until about 1924 when we began to have sufficient crops to carry on with.\n20. If you are married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\n22. Include numbers of your family (brothers, sisters, etc.) cause list.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to share?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n25. What was your first deal and when did it occur?\n\n26. Would you go back all by horse or wagon? Would you go by rail?\n\n27. To the Prairies through? When? The year? To\n\n28. Will a trip to 1924 when the Organ W\n\nHave any family go to carry on with\n25. When was the first car used in the community?\n   Answer: 1927\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Answer: 1910\n\n27. Where was your trading center? How far from your home?\n   Answer: St. Walburg, Will 1932 - Windsor Lake Office\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Conditions gradually improved as stated, trade got better, car travel was possible after about 1926.\n\n29. How often did you shop in the early days?\n   Answer: Every 3 or 4 months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Answer: They knew how to do that in those parts right, but I don't know.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We started buying from mail orders about 1914 and still buy towels and clothes and things about 50% of our clothes are bought that way. Local stores have never carried a very full line.\n\n32. When did you first have a telephone and what company provided it?\n   Answer: Not yet\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I did not intend to stay at first, it was my intention to go to the Grand Trunk Pacific then go down to Prince Rupert and so on, but by the time I was ready and when I went there and I decided to stay here.\n25. When was the first car used in the community? \n   March 1926\n\n26. Did you own a car before 1914, when did you buy it? \n   No\n\n27. What was your traveling conveyance? How far from your house?\n   St. Walburg, Mo. 1932. I didn't have a vehicle.\n\n28. Did you continue to travel by horse (indicate any changes due to new forms of transportation, better means of travel, etc.)?\n\nConditions gradually improved as stated, we got better cars. Travel was preferable after about 1926.\n\n29. How often did you shop in the early days?\n   Every 3 or 4 weeks\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Every few months that's when parking was available.\n\n31. Then (if ever) did you begin to buy through the mail order catalogues?\n   We started buying from mail order about 1914 and still buy underwear and clothes and things around 80% of our purchases are through the mail order catalogues.\n\nClothes are very good - that way great stores have never carried a very full line.\n\n32. When did you first have a telephone and what company provided it?\n   Not yet\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   I decided to stay the first time I was there and go back to my old job.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThis district's first settler started here in what year and was followed by that full by 8774 more of us and we are all here now.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThis country's big settlement was in the 30s and they started till about '35 and started moving out and I would estimate that '60 or '70 moved out by 1944.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI was elected to this for 12 years: 1925 - 37\nPresident Modern Home Co-op Postage Stamp Co. 1891\nMakwa Roadmen for 10 years\nDirector South Porage Co-op Creamery for last 10 years\nProgram Committee Member last 2\nWas connected with Audit Office at B Makwa\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI do not know that we were first in any\nWe had these certainly among the first\nSmall 4-H club organized a lodge\nJamboree 1925 Combined 1942\nBrotherhood started 1935\nWork on homestead 1921\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give facts of new name as above in (1), (2), (3).\n\nMakwa is Ojibway for Bear and another\nTown or Makwa Union flows just south\nWe when we picked a name for the Post Office that was selected at a meeting about\n30 settlers here at that time about 1950\nand the name still is used; though there are\n2 Post Offices now North and South Makwa\nThe other names Rabbit River, Horsehead river\nwould have been named by the Indians as they\nwere in common use when I arrived\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNo. Anything in that line I had was burned in my house in 1942.\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.....\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPov Nielson - Edmonton\nMary Della - 4\n\n41. What do you think are the most important changes in your community since you first came West?\n\nImagine roads caused the most important changes here. That and the employment people from the south during the drought period certainly had more to do with opening up this north country than anything else.\nOf course the roads followed the people and the new farms around.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\n✓ Walter Warner\n✓ Jim Horn Webster\n✓ Pov E Dupray\n✓ H.E. Allis\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n___________________________\n___________________________\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archivist Bureau of the Legislative Library, Regina, or the Archivist Office at the University of Saskatchewan?\n\n(Indicate your preferences, if any)\n\nTwo children - William Paul - 7 years old\nMary Sheila - 4\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nMalcolm William Anderson\nSault Ste. Marie\n\nWilliam William Anderson\nRegina\n\nWilliam William Anderson\nRegina\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1914_1234.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4917, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1954, 5], [1954, 3745, 6], [3745, 5601, 7], [5601, 6959, 8], [6959, 8057, 9], [8057, 8790, 10], [8790, 10018, 11], [10018, 10783, 12], [10783, 12483, 13], [12483, 13840, 14], [13840, 15912, 15], [15912, 15912, 16], [15912, 17435, 17], [17435, 18302, 18], [18302, 18302, 19], [18302, 18456, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]