[{"id": "b190696858367ef36cb4b8cac42fa2d7f2a618fa", "text": "S-X2\n563. Keyser Kathleen Ruth (Mrs. John Thomas)\nMENU\n\nPlow, Ox tail Soup\n\nSouth Branch gold eyes\n\nBeef (He died in harness)\nSit down hungry, get up tired\n\nPork with blackshaws - A la Bill Bate\n\nChicken, such as the Doctor didn't raise\n\nanother old timer - the spud\n(or anything else that's loose)\n\nSaskatoon Berry Pie\n\nThe cups that never failed me,\nor coffee if you like\n\nCampfire comfort, a pipe smoke.\n\nDINNER FOR THE\n'83 BOYS\n\nKing George Hotel\nSaskatoon\nOctober 3rd 1912\n\nGiven by Mr. Gerald Willoughby\n\nWho were present?\nLook inside.\nMENU\n\nPlow, or talk down\nSouth Branch gold eyes\nBeef (He said in Kansas)\nSir-down hungry, get up third\nPork with blackstrap - a la Bill Butt\nBikini, such as the Doctor didn't\nanother old timer - the grand\n(something else that's gone)\nSaskatoon Berry Pie\nThe Bun that never failed me,\nor coffee if you like\nCampus comfort, a pipe smoke.\n\nDINNER FOR THE\n83 Boys\nKing George Hotel\nSaskatoon\nOctober 3rd 1912\nGiven by Mr. Gerald Willoughby\n\nWho were present?\nLook inside.\nMENU\n\nPlow, Ox tail soup.\n\nSouth Branch gold eyes\n\nBeef (He died in harness)\nSit down hungry, get up tired\n\nPork with blackstrap - a la Bill Bat\n\nChicken, such as the Doctor didn't raise\n\nanother old timer - the Spend\n(or anything else that's loved)\n\nSaskatoon Berry Pie\n\nThe Cup that never failed me,\nor Coffee if you like\n\nCampbell's Comfort, a pipe apiece.\n\nDINNER FOR THE\n'83 BOYS\n\nKING GEORGE HOTEL\nSASKATOON\n\nOCTOBER 3rd 1912\n\nGIVEN BY MR. GERALD WILLOUGHBY\n\nWHO WERE PRESENT?\nLOOK INSIDE.\nGeorge T. Clements - 1885\nE. W. Garrison - 1885\nD. W. Landin - 1884\nGerald Willoughby - 1883\nAda Banks - 1884\nE. W. Garrison - 1883\nRussell Wilson - 1883\nR. R. Chatham - 1883\nA. E. St. Lawrence - 1891\nJohn Baima - 1910\nJames Q. Heart - 1887\nWilliam P. Batt - 1886\nJ. W. Walker - 1910\nJ. D. Macdonald - 1906\nFrank Gougeon - 1884\nJ. H. Willoughby - 1883\nWallace Murray - 1908\n\nJames R. Wilson - 1883\nRobert Bateman - 1886\nGeo. W. Stephenson - 1883\nC. S. Brown (Acting) - 1884\nTimon Dulmage - 1883\nR. W. Garwood - 1883\nGeorge T. Clements — 1885\nE. W. Garrison — 1885\nD. W. Lasher — 1884\nGerald Willoughby — 1883\nWes Clarke — 1884\nJ. W. Garrison — 1883\nRussell Wilson — 1883\nG. R. Chisholm — 1910\nA. C. St. Laurent — 1891\nJohn Cairns — 1910\nJames W. Hood — 1887\nWilliam P. Bate — 1886\nJ. W. Walker — 1910\nJ. D. Macdonald — 1906\nTravis Gougeon — 1884\nJ. H. Willoughby — 1883\nWallace Murray — 1908\n\nJames R. Wilson — 1883\nRobert Bateman — 1912\nGeo. W. Stephenson — 1886\nA. S. Brown (arch) — 1883\nLincoln Dulmage — 1884\nR. W. Caswell — 1883\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n(X) Pioneer social life, sports and recreation\n(X) Pioneer housing\n(X) Pioneer education and churchwork\n(X) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ... Kathleen Ruth Kuyan ...\n2. Your address ... 131-75 St., Saskatoon, Sask.\n3. Date ... April 9th, 1952 ...\n4. Where were you born? (Give name of place and country) ... Saskatoon, Sask.\n5. What was your father's name and occupation? ... Geo. Wm. Stephenson. He came from Ontario with the new settlers in 1887 to 1900. He was a rancher from 1887 to 1900. He then took up farming east of the city.\n6. When did you come to Saskatchewan? (Give month and year) ... October 1894 when I was born.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ... I was born here.\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ... By personal experience, and of the earlier days, through my Father and Mother.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Kathleen Ruth Keyser\n2. Your address: 151-72 St. Joseph Avenue, Saskatoon, Saskatchewan\n3. Date: October 9, 1952\n4. Where were you born? (Give name of place and country)\n   - Son of Mr. Stephen Keyser\n   - Born in Saskatchewan\n5. What was your father's name and occupation?\n   - Father's name: Stephen Keyser\n   - Occupation: Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   - October 1894 when I was born\n7. Mention any other places where you lived before coming to Saskatoon, listing dates whenever possible.\n   - Never been here\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   - I was 10 years old\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - By personal experiences and of the endless days through my father and mother\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   The first means of transportation in my time were horses and wagons or for style the top buggy or Democrat.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   My Mother often mentioned the friendliness and hospitality of the people, even if there was no one home you were expected to go into the house and make yourself a meal, or whatever accommodation you required. She also marveled at the fact that no one ever locked a door at any time of the day or night. She also mentioned looking up to find Indians watching them through the windows. She came here in 1887.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\nThe first means of transportation in any time was horse and wagon or on foot.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nMy mother often mentioned the friendliness and hospitality of the people, even if they were not always very kind to us. All horses and riders also remembered the fact that we were looked after at every stage of the journey. We also remembered bringing up to find Indians watching them through the windows. The Army Day in 1887.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nI have four sisters, one in California, one in Manitoba, one in the Sutherland district, one here in Saskatchewan, also three brothers, one in Ontario, one in California, one here on the home farm. All were born here in this district, as our parents resided here continuously after arriving here in 1886 and 1887 respectively.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI remember when I was a small child, at two story terrifying prairie fires, and having to help put them out by wetting potato sacks to beat out a back fire from about 5 am. One of the times my father was away, my mother hitched a horse to the walking plow and placed a fire guard around our buildings four furrows deep. I believe the regulation was along with the width of a tree. The flames were approximately eight feet high and rolled in like the waves of the sea, licking up all before them. I also remember the kindness of the people and how they shared and helped each other in everything. The community spirit was something to be desired. The men who came to exchange work at the long parade was something an event in our childhood. Oliver had a mill long the road and formed a little bond between us.\n\n24. Did you travel about much in the early years? (for business, visiting friends, church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe attended church regularly in the summer time, but it was a bit difficult to continue doing so in the winter, on account of the heavy snow we used to have those years. I can remember our one storey log house being covered in, as were the barns and granaries. My father had to dig tunnels in order to get the stock from the barns to the well and also to enable to get the feed from the granary, for the horses must have their oats.\n\nWaiting was quite a regular event, and the main source of pleasure, when we would pull stuff to have a game of cards.\n\nWe used to start to Wundurn to visit an aunt and uncle in the fall. McCordick live or three times in a summer, when it would be an all day trip and we would picnic halfway for a rest from riding. This was truly an event for us children.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife, along with the date and place of marriage.\n\n21. Did anyone else come to Sandusky because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In what way did you help your neighbors? For example, did you help them plant their crops, build fences, or perform other tasks?\n\n24. Did you travel much in the early years? If so, how far did you go?\n\n25. What was the most difficult thing about living here? How did you overcome these difficulties?\n\n26. What do you miss most about your old home?\n\n27. What do you like best about your new home?\n\n28. How has your life changed since moving here?\n\n29. What advice would you give to someone who is considering moving here?\n\n30. Any other comments or observations?\n25. When was the first car used in the community?\nThe first car that I remember in Saskatchewan was owned by Mr. Fred Engen.\n\n26. If you owned a car before 1910, when did you buy it? What make?\nMy father bought our first car about 1912 and it was a Model T Ford.\n\n27. Where was your trading center? How far from your home?\nIn my time we were able to buy our groceries here, but we usually got our clothing and staples from a small storehouse until the town became a village which was about 1918. I believe that my parents used to take from three to five times a year.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nIt was the custom as long as I can remember.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nMy mother used to send (for us children) twice a year, for the full compliment of clothing for the coming season, coats, shoes and other necessary clothing. If I remember correctly, the order usually came by freight, being quite a sizable one for a large family. This also was an event, to see what we had got and if it was stylish enough. It was almost as if there were three Christmases in the year.\n\n32. When did you first have a telephone and what company provided it?\nI cannot remember exactly, but about 1920, we got the first rural telephone line in this part of the country. However, according to the records, there were some telephones in the town of Willow Bunch.\n\n33. Why did you come to Saskatchewan the first time was it with the idea of staying still permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIt happened to be C.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Husband has been active in many organizations such as the Liberal Club, Poultry Association, Carpet Bowling and Lawn Bowling. I have also been active in Lawn Bowling since my work. Red Cross work, and was in everything in the block system during the war, up to arrest. Block leader. Have assisted in political work. Also was quite active in J.O.B.A. work at one time, but never held any position where public speaking was necessary, nor would I be able to make a speech.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy Father and Mother were charter members of the Royal Orange Lodge, and Ladies Orange Breastwork association respectively. My Father's grandfather had the contract and helped to build the first frame church. My grandfather's name was William Stephenson. My Mother who was Belle Edgett at that time, also helped in this project by going about the country with a horse and buggy collecting from the different farms contributions to make this work possible.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI remember that what is now called Buttena was the original Saskatoon, and how upset the Buttena people were when the North side of the River took the name and gave the South side the name of Saskatoon. I believe that was in the fall of 1899. I know the name of Saskatoon was taken from the Saskatoon berry, but I really don't know the origin of Buttena, only more than it is an Indian name.\n\nThe village of Sutherland was named after the Hon. W.G. Sutherland by popular vote by the people residing there at that time. He was a well respected farmer, sound mind, hard worker, of which he had many beautiful sons. South Saskatoon on the G.T.P. used to be called Earl, as the names came alphabetically, and this one happened to be E.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI am enclosing a copy of the first Banquet the Pioneer Men held at the King George Hotel. I do not have the original menu but thought you might like to have the names.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have 1 daughter Mrs. Edwin Smith of Montgomery Place, Saskatoon and she lives there. She has a daughter Eleanor M. Smith. We also have 1 son John George Keyser who is also married to Hilda \"née Roberts\", they have three children, John James, Lynne Roberta, and Thomas William, who also live in Saskatoon.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThat would be very difficult to answer as when I first remember it there was Walmar's store & Police Office, which stood on tenth street facing south, the Johnson house stood there then, and is now known as Barclays store. The old police barracks stood about where that electric refrigerator repair shop stands, near 11th St. Then I remember Mr. Stewart's house on the opposite side of the river, and the old ferry that used to carry coal and sand across the river. There also was the change from the horse & buggy to the street car & Automobile, and I will never forget the evening I listened to the first crystal set and see what news is new. All they get electric lights in my time, and want to build the airplane and many Please give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Ernest Thorpe, Then there was a Mr. Tucker that still spends some time in Saskatoon but I only know his nick-name, but Mr. Thorpe could tell you. Mrs. Freeman Rolfe could give you quite a bit of information.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nKathleen R. Keyser\n131-7th St. Saskatoon.\n6.\n\n93. Questions regarding historical source materials:\n\nDo you have any photographs or do you know the whereabouts of diaries, old letters, old posters and pictures? If so, please describe them and their locations (if applicable).\n\n9. Copy of the poem \"Bangor the Pioneer\"\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Senate, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names and where they live and occupations.\n\nWe also send a copy of \"Bangor the Pioneer,\" John Thomas, back to you. We also send a copy of \"Bangor the Pioneer,\" John Thomas, back to you.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThey would be very difficult to describe. After the war, the town was very prosperous, and there was a great deal of activity.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nKathleen N. Kayser\n\n13/1/74 Mr. Saskatchewan.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI am enclosing a copy of the first Banquet the Pioneer Women Held at the King George Hotel. I do not have the original menu but thought you might like to have the names.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have 1 daughter, Mrs. Edwin Smith of Montgomery Place, Saskatoon and also have a son, John George Keyser, who is also married to Hilda Sue Roberts. They have three children, John James, Lynne Roberta, and Thomas William, who also live in Saskatoon.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThat would be very difficult to answer, as when I first remember there was Walmar's Drug Store & Police Office, which stood on Third Street facing north, the Garrison House stood there then, and in new known as Barclays store. The old police Barracks stood about where that electric & refrigerator repair shop stands near 11th St. Then I remember Mr. Stewart's house on the opposite side of the river, and the old ferry boat used to carry all and sundry across the river. There also was the change from the horse & buggy to the street car & Automobiles, and I will never forget the evening I listened to the first crystal set and see what radio was made. All they got before that time and not to forget the airplane and many lights in my time and not to forget the airplanes including dills.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Ernest Thayer, then there was a Mr. Tucker that still spends some time in Saskatoon but I only know his nick-name, but Mr. Thayer could tell you. Mrs. Freeman Rolfe could give you quite a lot of information.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nKathleen R. Keyser\n\n13/7/55 Saskatoon.\n6. Questions regarding historical materials:\n   Do you have any photographs or do you know the whereabouts of old letters, old posters and programs, minute books of organizations, old pamphlets, old newspapers, written recollections and reminiscences? (Describe)\n\n9. Are you interested in any of the four Bannock Brothers?\n\nWill you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nIf so, could you provide more information?\n\nIf anyone else has filled in this questionnaire for you, please have this person sign and address here:\n\n[Signature]\n[Address]\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_563.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6876, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 50, 4], [50, 50, 5], [50, 542, 6], [542, 1010, 7], [1010, 1506, 8], [1506, 2022, 9], [2022, 2540, 10], [2540, 4514, 11], [4514, 4514, 12], [4514, 5674, 13], [5674, 6685, 14], [6685, 7869, 15], [7869, 8935, 16], [8935, 11542, 17], [11542, 12513, 18], [12513, 14565, 19], [14565, 14565, 20], [14565, 17188, 21], [17188, 17188, 22], [17188, 19677, 23], [19677, 20825, 24], [20825, 23321, 25], [23321, 24313, 26], [24313, 24449, 27], [24449, 24603, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]