[{"id": "1bcef3d5de5193084d1845d6ffc1305eeeba7324", "text": "Please print name and address in capital letters.\n\nYour full name: Robert John Young\n\nPresent Address: Stoughton\n\nPioneer Address: Gap View & New Hope\n\nYear you came to Saskatchewan: 1899\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1912, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPlease print name and address in capital letters.\n\nYour full name ____________________________\n\nPresent Address ____________________________\n\nPioneer Address ____________________________\n\nYear you came to Saskatchewan ________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. What led you to the particular district in which you settled?\n   There were no more good homesteads where older brothers had located.\n\n   Through whom was information about it obtained? Land Office, Alameda.\n\n   What was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming? Worked on farms as youth in Ontario and also after I came west.\n\n   If none, under what circumstances did you learn?\n\n3. Did you homestead? Yes\n\n   If so, give description of the land (Township, range, distance from the railway).\n   M.W. 1/4 of Sec. 20 Tp & Rge 8 Wst 2 mer at that time 6 miles from Alameda Land Office.\n\n   When, where, and how did you file your homestead entry? Took a load of wheat to Alameda for John Morrow and filed myself on the 6 day of Dec. 1899.\n\n   How much information did you have about the land when you filed your entry? I had went and located it also looked it over.\n\n4. Did you obtain a pre-emption? No\n\n5. What other land did you purchase?\n\n6. Was any of it Hudson Bay Company land, C.P.R. land, or school land?\n\n   What was the purchase price per acre? Land at that time was worth about three dollars an acre.\n\n   What was the largest amount you possessed at one time? (Give date). 3/4 acre\nPioneer Farming Experience\n\n1. What led you to the particular district in which you settled? There were no more good homesteads where older settlers had located.\n\nThrough whom was information about it obtained? Land Office, Alberta.\n\nWhat was the extent of this information and what alternatives did you consider?\n\n2. What was your previous experience in farming? Worked on farms as youth in Ontario and also after I came west.\n\nIf none, under what circumstances did you learn?\n\n3. Did you homestead? Yes.\n\nIf so, give description of the land (township, range, distance from the rail yard). Sec. W1/4 of Sec. 20 Tp 8 Rge 8 west of meridian at that time 96 miles from homestead land office. Then, there, and how did you file your homestead entry? Took a loaded ox cart of the homestead for three or four weeks and filed myself on the 6 day before 1899.\n\nHow much information did you have about the land when you filled your entry? I had never seen it nor looked over it.\n\n4. Did you obtain a pre-emption?\n\n5. What other land did you purchase?\n\n6. Has any of it Hudson Bay Company land, C. P. R., land, or school land?\n\n7. What was the purchase price per acre? Land at that time was worth about three dollars an acre.\n\nWhat was the largest amount you possessed at one time? (Give date) 3/4 acre.\n7. Did you retain the original homestead? No. If you moved, tell where and for what reasons. \n   *P. G. Rye 7.*\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of general interest:\n   How did you finance your original purchase of land?\n\n   How long was it before you had completely paid for your land?\n   Did you at any time mortgage your property or obtain loans?\n   What interest rates did you pay?\n\n9. What were your first buildings? (Give dates). \n   *First house log and barn of sod 1902.*\n   \n   What material was used and where was it obtained? \n   *Logs were hauled from Smokey Mountain.*\n\n10. What type of farming did you engage in, originally and later? (Grain, livestock, mixed, etc.). \n    *Wheat, oats, mainly horses*\n\n11. How many acres did you break the first year? \n    *10 acres 1900*\n    \n    The second? \n    *1901 broke 10 acres*\n    \n    The third? \n    *1912 broke 35 acres*\n    \n    Did you use oxen, horses, or steam power for breaking? \n    *I used horses*\n\n12. What breaking crop did you grow?\n    What other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?).\n7. Did you retain the original homestead? If so, how? For what reasons?\n\n8. You may not wish to answer questions about how you financed early farming operations. However, if you care to, answers to the following would be of great interest:\n\n   - How did you finance your original purchase of land?\n   - How long was it before you had completely paid for your land?\n   - Did you at any time mortgage your property or obtain loans?\n   - What interest rates did you pay?\n\n9. What were your first buildings? (Give dates). First house, shop, and barn of said 1902.\n\nWhat material was used and where was it obtained?\n\n10. What type of farming did you engage in, originally and later? (Grain, Wheat)\n\nLivestock, hogs, etc.\n\nOats, corn, hay, potatoes\n\n11. How many acres did you break the first year? 1900\n\nThe second? 1901\n\nThe third? 1902\n\nDid you own oxen, horses, or steam power for breaking? I used horses\n\n12. What breaking crop did you grow?\n\nWhat other grains did you grow?\n\n13. What kinds and breeds of livestock did you raise? (Give dates at which you started each. If discontinued, when?)\n14. If you used oxen, how many did you have? Just had two kept them.\n\nWhen and where did you obtain them? Six months bought them from my oldest brother.\n\nDid you have any memorable experiences with them? Bought them fall of 1900 left them with second bro for winter he turned them out on the sand hills and in spring were that poor could hardly walk so decided to take them where I was working went after them with ten horses had to go about 15 miles before I got home they got tired and came back all off of rock.\n\n15. When did you first use horses for motive power? 1902 I had worked out and bought them.\n\nWhere did you obtain them?\n\nWhat was the largest number of horses you kept? About twenty.\n\n16. With what machinery did you start farming? Walking plough and binder also harrows and wagons.\n\n17. What was the first tractor you used and when?\n\nWas it used for belt power or for field power?\n\nIf this was not the first tractor in your district, do you remember the first? Give details.\n\n18. To what extent did other members of the family assist in farming operations?\n\nWhat was the first hired help you had? 1905\n\nWhat wages were paid? Twenty dollars a month\n\nTo what extent did you make use of hired help during your farming career?\n\n19. Do you recall examples of informal co-operative efforts in your district, such as neighbours working together, \"bees\", etc.?\n\nWe used to get together to cut fire wood which was hauled from Moose Mountain in the poles also remember going one time to breaking bee on farm of Walter Salisbury used three horses & sulky plough.\n14. If you used oxen, how many did you have? How did you obtain them?\n\n15. Did you have any memorable experiences with them?\n\n16. With what machinery did you start farming? What was the largest number of horses you kept?\n\n17. What was the first tractor you used and when?\n\n18. To what extent did other members of the family assist in farming operations?\n\n19. Do you recall examples of informal co-operative efforts in your district, such as neighbours working together, \"hoes\", etc.?\n20. Did you follow the practice of summerfallowing to begin with? Yes\n   If not, when did you begin?\n\n21. What rotation of crops did you practise?\n\n22. Where did you obtain your original seed?\n   What was the variety?\n   The price?\n\n23. What was the earliest date of seeding you recall? (Give year). March 14/1910\n   The latest?\n   What was the earliest date of harvesting you recall?\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details\n   such as dates, severity, damage, methods of control, with respect to the\n   following: hail, frost, wind and dust, blizzards, floods, drought, prairie\n   fires, rust, smut, grasshoppers, cutworms, sawflies, caterpillars,\n   mosquitoes, hawks, gophers, coyotes.\n\n1907 was bad for me; lost all my crop\n20. Did you follow the practice of summerfallowing to begin with? Yes\n\n21. What rotation of crops did you practise?\n\n22. Where did you obtain your original seed?\n   What was the variety?\n   The price?\n\n23. What was the earliest date of seeding you recall? (Give year). March 14/1910\n   The latest?\n   What was the earliest date of harvesting you recall?\n   The latest?\n\n24. What hazards or difficulties did you experience? You might give details such as dates, severity, damage, methods of control, with respect to the following hazards: frost, wind and hail, blizzards, floods, drought, prairie fires, rust, army, grasshoppers, cutworms, sunflower caterpillars, nematodes, borer, leafhopper, etc.\n\n1907 was a bad year for corn. Lost all my corn.\n25. What weeds were present in your district when you first arrived and which were most common?\n   *yellow mustard, tansy mustard, wheat, buckwheat, stink weed.*\n\n26. What new varieties of weeds appeared after you settled? (Give date of appearance if possible).\n\n27. What method of harvesting and threshing grain did you first use?\n   *Binder & thresher we used portable steam also had a horse power machine with case agitator separator.*\n   \n   How many men were required in these operations? *10 + 12 men respectively.*\n\n28. When did you first market grain, livestock, or other produce from your farm? *1904*\n   \n   How did you haul grain to market? *Team and wagon*\n\n   Was most of your grain hauled in the fall, or did you do winter hauling with team and sleigh?\n   *fall & winter*\n\n   To what point? *from homestead to Stoughton from bought land*\n   \n   How far? *to Forget 8 miles.*\n\n   What prices did you receive? *wheat was pretty steady at 65 cents a bushel oats about 35.*\n\n29. Was the flat warehouse ever used for loading grain in your district? (Give dates).\n\n   In what year was the first grain elevator constructed in your district? *about*\n   \n   By what company? *1904*\n25. What crops were present in your district when you first arrived and which were most common?\n\n26. What new varieties of seeds appeared after you settled? (Give date of appearance if possible).\n\n27. What method of harvesting and threshing grain did you use? (Describe)\n\n28. When did you first market grain, livestock, or other produce from your farm? 1904\n\n29. Was the first grain elevator constructed in your district about 1904?\n\nBy what company?\n30. What variations do you recall in prices for your produce? the highest? the lowest?\n\n31. Did you engage in ranching?\n   If so, give details as to kind and number of cattle in the early years of the ranch, number of men employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by procuring registered seed, purchased livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs?\n   Indicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry? used to keep about a dozen hens\n   Was this for household use or for market? for household use\n   When did you first buy chicks from hatcheries?\n\n36. When did you commence gardening? when I started farming\n   What garden crops were then grown? vegetables for the house\n29. What variations do you recall in prices for your produce? the lowest?\n\n31. Did you engage in marketing?\nIf so, give details as to kind and number of cattle in the early years of this ranch, number of rent employed, brands, etc.\n\n32. What was done by you or others in your district to improve crops and livestock by purchasing registered seed, purchased livestock, etc.?\n\n33. Did you participate in any exhibitions or fairs?\nIndicate the nature of your exhibits and the prizes won.\n\n34. What agricultural organizations did you join? Tell when and for how long.\n\n35. Did you raise poultry?\nWas this for household use or for market?\n\nWhen did you first buy chickens from hatcheries?\n\n36. When did you commence gardening?\nWhat garden crops were then grown?\n\nWhen I started farming vegetables for the house\nWhere were seeds obtained? at the stores\n\nWhat were some of the varieties planted? mostly onions radish carrots beets and lettuce including rutabaga\n\n37. Did you have native trees about your farmstead? no\n\nWhen did you first plant trees, if any? in 1905\n\nWhat kinds? maple or ash.\n\nAre they still living, or did they die out after a period of time? some are living yet\n\nIf so, any special cause? what died out were killed by wind blowing and covering them up\n\n38. When did you fence any significant part of your land?\n\nWhat was your reason for so doing?\n\nWhat type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator?\n\nWhat kind of churn did you use?\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? both mostly trade\n\nHow much was the market price for butter and eggs?\n37. Did you have native trees about your farmstead? Our\n\nWhen did you first plant trees, if any? In 1905.\n\nWhat kind? Maple and ash.\n\nAre they still living, or did they die out after a period of time?\n\nSpecial causes? No special causes.\n\n38. When did you fence any significant part of your land?\n\nWhat was your reason for so doing?\n\nWhat type of fencing was used?\n\n39. Did you ever attempt to irrigate gardens or crops?\n\nTo what extent? (Give dates).\n\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator?\n\nWhat kind of churn did you use?\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants?\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator?\n\nWhat kind of churn did you use?\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? Both.\n40. How was milk kept and cream saved?\n\nWhen did you get a cream separator?\nWhat kind of churn did you use?\n\nWhat quantities of butter were made?\n\n41. Were butter and eggs sold for cash or taken in trade by local merchants? Both\n\n[Handwritten note]\nMaking to farmers at lonely house and post office.\nWhen I came to back I worked out as I didn't have enough to start on in 1902. I bought some horses, plough, wagon, and some gear and started for the homestead when I got to what was called the Gap. I found that Moose Creek was in full flood. My eldest boy went down to it but could not get across as some places it was half a mile wide. We got stuck in the mud and had to carry everything out to high ground on our backs. While I helped him seed his land and he was to help me break about three weeks later we started out again and still the crossing places was full when we got to a place called Mat's Crossing. Crossing it was full to the top of the banks there were three or four men sitting on the south bank. They were going to the river for wood but there was a wagon bogged between two bushes on our side and they couldn't get through and when they looked closer there was the hind wheels of a wagon in the bottom of the creek somebody's wagon box had floated off and they had to tie it to the bushes well one of them had a long rope so I swam out tied it to one wheel and they dragged it out but they would not come through. We went through but had to swim for it and I went on west to Stoughton or New Hope as it was called then to the homestead so much for one episode. On the return trip my second boy was taking back with him a seeder with four horses when they came to the top of the creek one horse balked the other three went in he was standing on the top of the seeder and he went in over his head and the other horses swung round and came out again the same side.\nWhen I came to work I worked out any exhibit\nthat enough to start on in 1902 I bought and visited\nfor the last time. Instead of them I got to visit was called\nthe year I found that there was no way I could\nfind our plant but I went down to it but could\nnot get there so we had to go back to the end and\nhad to carry everything out to high ground on our\nback. We'll help him seed him and send him\nover to help our friend and still the crown place.\nwe started out again and still the crown place.\nwere full when we got to a place called most.\npromising enough it was full to the top of the\ntrees and there was a wagon boy named to\nthe word that there was a wagon boy named to\nsome bushes or run side and they couldn't\nget through and when they looked closer there\nwas the head of wheels of a wagon in the bottom\nof the creek somebody's wagon boy had flooded it\nand they went to tie it up the bushes well\nit then had a long rope so I wasn't sure\nit would come through if it went through\nbut had to wait for it and I went own\nwest to straighten a man Hope as it was\ncalled then to the housestead on another\nfor one episode on its return trip my\nown horse walked the other three west\nweek our horse walked the top of the road and\nhe was standing on his head and the other horses\nwere running around and came not again the same ride.\n42. Did you keep bees, or do you remember anyone else keeping bees in your district?\nHow were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\n44. Was there ever an extra large or \"bonanza\" farm in your district? Yes, our farm.\nIf so, what was its size and who was the owner? James Barr and America had 1920 bought about 1905 sold 1925 on account of owner being deceased.\nWhen was it established and what was the reason for its breaking up, if it no longer exists? Bought in 1905 paid in 1925 on account of owner being deceased.\n\n45. Whom do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, most helpful to newcomers, contributing most to the public life and development of the community.\nLowry Hanna and wife\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your completed questionnaire?\n1900 was the hottest and driest year we ever had not a drop of rain from April until September then we had two hail storms inside of two weeks then 1901 it rained every sunday all summer.\n1902 was the coldest and most stormy winter I have ever seen would blow three days from north west then turn south east and east it lasts for about five months and forty and forty five below zero.\n42. Did you keep bees, or do you remember anyone else keeping bees in your district? How were they originally procured and at what date?\n\n43. Do you recall members of the North West Mounted Police calling at your farm to see how you were getting along? Give any details about the frequency of these visits, names of policemen, dates.\n\n44. Was there ever an extra large or \"boomerang\" farm in your district? If so, describe its size and who was the owner?\n\n45. Who do you consider to have been the outstanding pioneer farmers of your district? Give some reasons for your choice, such as the earliest, most successful, and best fitted to contribute most to the public life and development of this community.\n\n46. If you have had interesting experiences in connection with early farming which have not been touched upon by the above questions, would you add them to your questionnaire?\n\n1900 was the hottest and driest year we ever had and a drop of rain in April till September then we had two hail storms inside of two weeks then 1901 it rained every day all summer. 1902 was the coldest and worst winter I have ever seen. Then turn south east and west for about five months and forty and twenty-five below zero.\nI came from Owen Sound in Ontario in March 1898 and stayed one year in Manitoba north of Killarney. We then came west to Sask or North West Territories in 1899. On April 4-1899 father was to arrive in Alameda so my second bro. & I took a long sleigh about 16 ft. and went to meet him. He came all right so we unloaded the settler car that night next morning. We started out with two cows and it was a fine spring morning but the snow was still about four feet deep. It began to thaw they took the hens, pigs, and some other stuff and asked to follow me and we were to have dinner at what was called the big hill well. It thawed so much he got stuck in a ravine about three miles out of Alameda and had to get a farmer to pull him out so I never seen him anymore that day. The cows didn't want to go so just ran back forth across the road and when I got to the halfway house as it was called it was just getting dark. I had to go two miles further and when I got there I was so tired & hungry from walking in slush & snow up to my waist I just climbed on a chair & went to sleep my bro. didn't get there until the next morning. He stayed in the halfway place barn all night. He had passed the halfway place fast but it had thawed that much he thought he had got lost and run into a lake so he turned back and stayed in the barn.\nI came from Owen Sound in Ontario in March 1878 and stayed on Yan in Orillia until April 1899.\n\nOn April 4-1899, I started westward toward the town of Owen Sound at my own pace. I took a can of apple butter with me and walked out with two cows and a few sheep.\n\nIt was all right as we started out with two cows and a few sheep. We arrived at the settlement that night and continued our journey.\n\nWe traveled on the road and when we got there, I was very tired and hungry. I went to sleep in a chair until the next morning.\n\nI heard a noise but I didn't get up. Instead, I turned back and played in the barn.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3474.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6518, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1127, 5], [1127, 2293, 6], [2293, 3565, 7], [3565, 4859, 8], [4859, 6135, 9], [6135, 7227, 10], [7227, 8794, 11], [8794, 9278, 12], [9278, 10058, 13], [10058, 10805, 14], [10805, 11992, 15], [11992, 12443, 16], [12443, 13319, 17], [13319, 14125, 18], [14125, 15094, 19], [15094, 15771, 20], [15771, 16002, 21], [16002, 16302, 22], [16302, 17883, 23], [17883, 19211, 24], [19211, 20786, 25], [20786, 21998, 26], [21998, 23326, 27], [23326, 23933, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]