[{"id": "a11b1349fc5786378c9841f42f50f87408c44382", "text": "Please print name and address in capital letters.\n\nYour full name: CHAS. B. RILEY\nPresent Address: MAIR SASK\nPioneer Address: ROSE PLAIN\n\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. In the first few years, how many houses were near enough to you for visiting back and forth? 14\n\n2. How often did you usually visit neighbors? Weekly\n\n3. Did you usually visit on a Sunday, or other days? Sundays\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Many times\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? Afternoon\n\nWhat about meals? Did you stay when not invited beforehand? Yes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) No\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? Sometimes coffee\n\n5. Did the whole family go, or did someone stay home to look after the place? All went\n\n6. Did you ever have \"teas\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, stating dates if possible, telling what the teas were for, and how often they occurred.\n\nOnce a year for our dance, probably my 18th birthday\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nThere were quite a few dances in the house until we moved to a larger house on 11th Street. I remember one 11th Street dance, a lot of young ladies. I remember one 11th Street dance, a lot of young ladies. I remember one 11th Street dance, a lot of young ladies.\n\nWere these more frequent in later years? Give dates.\n\nYes\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many houses were near enough to you for visiting back and forth? How many of these were bachelor's houses?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go—in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"make potlucks\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n6. Did you ever have \"meets\" when groups of neighbors came together to put up a building, make quilts, or other such activities?\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes?\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas trees, promiscuous etc., if you have not described these on the School Questionnaire.)\n\n9. When was your first community hall built? 1928\n\nWhat material was it made of? wood\n\nWho built it - the community through special funds, the municipality, some organization, etc.? community\n\nWas it built in the village or town, or was it a country hall? country\n\nTo what extent did it take the place of houses or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local schoolhouse for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 3), how, and why, did the entire family attend?\n\nHow were babies and small children provided for? They were left outside.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Very popular\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, Picnics, etc.)\n\n9. How much of your social life was centered around the school, and within the school district? Describe.\n\n10. What material was it made of? How large was it? 30x66\n\n11. Who built it - the community through special funds, the municipality, some organization, etc.? \n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? If so, how often? If not, why not?\n\nDid you continue to use the hall for other functions after the school closed? If so, what were they?\n\n12. When parties, dances, etc., were held in houses, school houses or halls (as referred to by question 3, 9, and 11) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n13. What card games were popular in the early days?\n\nWas there card playing for prizes?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n3.\n\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? School reunions with formal dinner, followed by a dance, and the small trip and promenade.\n\n13. Was the chivalry known in your community? Describe what you remember about chivalry, telling how common they were, any incidents connected with them, etc., and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? Give the date and reason for its being organized.\n\n16. Was there a Shriners' Club in your community? When was it organized, and what steps led to its organization?\n\nApproximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nHandwritten notes:\n\n- Year 1909 organized Homemakers Club 1912.\n- Start 1911\n- Year 1912\n- Need a library Community Christmas dinner organized. This was our in 1912 and more.\n12. What attempts at formality, or \"swanky,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? School conducted little formal ceremony.\n\n13. Was the church known in your community? Yes\n\nDescribe what you remember about churches, telling how communities were connected with them, etc.: Church was central to community life.\n\nFollowed by a church, school, and town hall.\n\n14. Describe any other details of meetings, parties, etc., that you remember, telling at parties and give approximate dates whenever you can when some changes in visiting or social life's became noticeable.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The Homemakers Club.\n\nGive the date and purpose for its being organized.\n\nJune 1909 organized Homemakers Club.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nAbout 1911\n\nApproximately what proportion of the farmers in the community belonged to it?\n\n90%\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nPeople's Bank, credit union, old timers' club, 1912.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nHad a library Community Christmas dinner organized. This was our in 1912 and others.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town, village, or county. Mention all organizations connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? [Handwritten]\n\n20. Were you accustomed to having several information lectures, talks on foreign lands, etc.? [Handwritten]\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? [Handwritten]\n\nGive dates if possible. 1909\n\nWho provided the lantern and the slides? [Handwritten]\n\nThat were the slides about? [Handwritten]\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, play house, etc.)? [Handwritten]\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? [Handwritten]\n18. Name any other organizations that were in existence in your community before this, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included only children or only adults, whether it was religious, charitable, educational, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to hearing special information lectures, talks on foreign lands, etc.? If so, what were they about? Who gave them? How often were they attended? Any other details you remember?\n\n21. What games did boys play in summer? (Baseball, marbles, etc.)\n\n22. What games did girls play in summer? (Skating, etc.)\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" checkers or other games? \n\nDid the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nExplain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, etc., or other objects or animals or games in the snow? \n\nDescribe them.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\n10 o'clock, 8, 9 at night\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Mushers,\" or others? \n\nDid the whole family join in such games, or only the children? \n\nDid anyone usually play with some kind of work? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, stones, or other objects? \n\nPIONEERS AND SPORTS \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? \n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups' aground dinner? \n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\n10 o'clock to 9 at night\n33. Describe any features of this place which you remember as outstanding.\n\n34. Describe any different kinds of activities which you knew of in the early days, such as skating parties, skating races, etc. Tell about all the activities, family food and drink, when held, etc.\n\nThe only thing was the community picnic. It was held yearly.\n\n35. What changes have you noticed in pioneer times since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n40. When was the first indoor rink built, and what was it used for?\n\nMarch built around the 10 mile\n33. Describe any features of this place which you remember as outstanding.\n\nThe only feature was the community picnic. It was held every year.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the school, town, or club picnic.\n\nThere were no changes.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThere were no changes.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people), how they were played, etc.\n\nYoung people played baseball, basketball, and football. The men played hockey and curling.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFootball (women)\n\nWhat year?\n\n1907\n\nHow long did it continue?\n\n1913\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\nThe Eagle Town Hall team. They had an organized team to play for a couple of years and won all games. They also had a curling team.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nMen built over the 18 mile...\n7.\n\n10. When did an annual \"sports day\" become established in your community? 1914\n\nDid it grow out of or replace the earlier community picnic? Yes\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st). July 4th\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. No\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nTom Hur. Tom Hur. Tom Hur. Tom Hur.\n\nPaul Clifford Paul Clifford Paul Clifford Paul Clifford\n\n43. How many of your neighbors brought books with them? All\n\nWhat kind of books and how many? A community library was started about 1911 but has not been distributed.\n\n44. To what extent did you exchange books with neighbors? Occasionally\n\n45. Did you buy many books after you came west? Give details. Yes, I purchased\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes\n\nGive details and dates: The travelling library from the province of Ontario was sent by the government of Ontario to the school district of\n\n48. Was there a school library? Yes\n\nWhen was it begun? 1906\n\nTo what extent were books borrowed from the school library for adults to read at home? Not much\n\n49. Did parents ever use their children's school text books as additional reading material? Not much\n10. When did an annual \"sports day\" become established in your community? 1914\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   Then was the sports day usually held what month, or any special day, such as May 24th or July 4th?\n\n41. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible; if not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? all\n    What kind of books and how many? One book, about 1911 but has been here since then.\n\n44. To what extent did you exchange books with neighbors? extensively\n\n45. Did you buy many books after you came west? Give details. Yes, I bought\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n    When was it begun? 1906\n    To what extent were books borrowed from the school library for adults to read at home? Not much\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? 1911\n\nWho started it? Mr. H.\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why? 1925 and moved\n\nGive any other details which you can about the library - how many books it contained, how many people used it, who it was kept by, who acted as librarian, how much money was raised for borrowing books, etc.\n\nAbout 30 books. Mrs. H. Patten (Poveshell), was librarian.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nOklahoma Farmer\nSouth Dakota Farmer\nWestern Home Monthly\nMr. West Texas\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nI have quite a few books on history on the 1700s.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nOn our way west and back every Sunday in summer which was also a social gathering and well attended.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? About 1911\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why? 1925 and moved\n\nGive any other data (in which you can show how many books it contained, how many people used it, how much money was raised for borrowing books), who acted as librarian, and what arrangements were made for borrowing books.\n\nAbout 30 books. Mrs. N. Bath, (President), was librarian.\n\n51. Have newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. On the way to go\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Piano, and about 608\n\n57. What instruments did any of your neighbors have? Violin, lot of it.\n\n58. What musical instruments have you bought since you came to the west? Give dates, places if possible, and tell where you bought them.\n\n9 October 1910 - 1913 - 1915 - Flute\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe. There was a piano.\n\n60. What were some of the favorite songs in the home? Red River Valley, Old Folks at Home\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. No, there was a musical band here.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody? Because of some special happening in the community? Explain. Yes, I made up a song on our new school building.\n\n63. Was there a band in your community? Yes, when it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you? Piano, and about 6-8\n\n57. What instruments did any of your neighbors have? Guitar, grand piano, organ, violin, etc.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n9 October 1910 - 910 - 1913 $55 - How much?\n\n59. How large a part did skating and other forms of music play in your house entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? Red Wing, After All, etc.\n\n61. Was \"Cock music,\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody? Because of some special happening in the community?\n\n63. Was there a band in your community? Who started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is there an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, how many and what are they?\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is there an important or less important event in your community now as compared with the early days? What is the reason for this change?\n\n66. Have you any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Please describe them briefly.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1905N-Z_2046.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7284, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1106, 5], [1106, 1106, 6], [1106, 2852, 7], [2852, 4039, 8], [4039, 5550, 9], [5550, 6982, 10], [6982, 8660, 11], [8660, 10260, 12], [10260, 11530, 13], [11530, 12237, 14], [12237, 13501, 15], [13501, 14777, 16], [14777, 16003, 17], [16003, 17517, 18], [17517, 19156, 19], [19156, 20537, 20], [20537, 21795, 21], [21795, 22840, 22], [22840, 24112, 23], [24112, 25242, 24], [25242, 26404, 25], [26404, 27344, 26], [27344, 27499, 27], [27499, 27653, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]