[{"id": "0a18b695546c10b47d9537e55cfde67288d898ce", "text": "It was the spring of the Lewis Reil Rebellion that we came west.\n\nWe were to start very early in May.\n\nMy brothers who were already up here heard the Indians & half breeds were coming up by back & knew my younger brother when bringing a car of settlers off to be with trouble on the way.\n\nThey were afraid they might meet one of them decided to water & go down our coming to delay our meeting.\n\nA distance of 30 miles on foot a distance of 50 miles on horseback when snow was found thrown after.\n\nReil-Neil was captured instead of a lone course in June instead of May.\n\nPeter Peace.\nIt was the spring of the Lewis Reil Rebellion that we came here. We were to start back early in May.\n\nMy brothers who were already up here heard the Indians & half breeds were coming up by blockade & knew my young brother when bringing a car of settlers about. They were afraid of the might need of trouble but the way they were decided to send a telegraph to delay our coming till things were settled. A distance of 30 miles on part of where furious war breaking up. But Reil was captured soon after & we came in June instead of May.\n\nYour Yrs.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nRECEIVED MAY 28 1952\nTeese, Mrs. Harry\nLemberg,\nTo Sask. - 1885.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. TITLE OF SETTLEMENT ON THE PIONEER\n\nIt is difficult to prepare a satisfactory questionnaire on pioneer life because some of the questions have not been answered by the pioneers themselves. It is impossible for you to answer, so don't worry about answering them. You may have to give details or descriptive particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1931, and may be answered by anyone who has personal experiences of the pioneer years whether born in his province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days: What Did I Do?\" will also be distributed. If you are interested, please fill out a short form (enclosed) and mail it back to us.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n- Pioneer local institutions\n- Pioneer community sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Office at the University of Saskatchewan and the Provincial Archives Office. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Harry Luce\n\n2. Your address: Lumberjack\n\n3. Date: May 16, 1952\n\n4. Where were you born? (Give name of place and country): Stratford, Ont.\n\n5. What was your father's name and occupation? William Dixon, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): June 1884-85\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Muckoka, Ont., from the summer of 1871 till June 1884-85\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   16 years old\n\n9. What were your reasons for coming West?\n   My parents, brothers & sisters came too\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    From reading newspapers & receiving pamphlets of information on the country.\nTecce, Mrs. Harry\nLombard\n\nTo Santa - 1884.\n\nSASKATCHEWAN ARCHIVES\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so, or you rather have someone else do the writing at your direction; this is acceptable.\n\n1. Your Full Name: Mrs. Harry Tecce\n2. Your Address:\n3. Date: January 16, 1895\n4. Where were you born? (Give name of place and country) Brookfield, England\n5. What was your Father's name and occupation? William Farmer\n6. When did you come to Saskatchewan? (Give month and year) February 1896\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" if you were 14 years old, etc.) 16 Years Old\n9. What were your reasons for coming West?\n\nMy Parents, Brother & Sisters came here.\n\n10. How did you learn about the West? (Through other people's reading about it, newspapers & magazines, pamphlets of information, etc.)\n\nFrom reading newspapers & magazines.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nTwo Brothers & 2 married sisters had came 2 years previously.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith my parents\n\n13. What means of transportation did you use?\nBy R.R. train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nOn the night we arrived at Indian Head at 12 o'clock at night, my Brother had arranged for Livery man to meet us, take us to his home for the night, but he didn't know just where he would drive, so that evening went to a party at Fearless Plains, so has we did not know were to go. Camped on station floor, it was a heavy forest & I felt pretty cold, the stable man came with kerosene.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIndian Head (this was our experience)\n\n16. Where did you settle or take up land?\nAbout 12 miles East of Fearless Plains, that is my Father & Brothers did, we have lived in that district ever since.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nFarming\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nTwo brothers & I married fairly hard\n\nCome 2 years previously\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my parents\n\n13. What means of transportation did you use?\n\nBy train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nThe night we arrived at Badham\n\nWe had our beloved wife & my brother had arranged for their mom to meet us. Take us to his place for the night but he didn't know what to do so we went to the train station.\n\nWe didn't have any heavy gear except for bedrolls, blankets, the stable gear came with Redhead.\n\nThis was our experience, the only work of roadhouses and farmers. We came from the west side of the prairies.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nRedhead\n\n16. How did you earn a living before coming to Western Canada? How often you harvest?\n\nFarming\n19. How often did you write to relatives or friends in your old home?\n\njust occasionally\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMary Teece 1890\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nmy brother wives relatives\ncame some years later\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nthe coming of the CPR train and the\ndeveloping of Lemberg town 4½ miles\nfrom here the telephone\n& now the power line being installed\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nnot much for several years one of our\nneighbors & my brother held church\nservice in their homes all winter Sunday\nthen later we had a school built & had\nservice & any other entertainments in\ntown then later when Lemberg developed\nthere were churches there, at present\ntime\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n---\n\nThe coming of the 60 mile Klym and Alex\n\nDevelopment of teaching power 4½ weeks\n\nfrom head of the school—place being included\n\n& new the power & black—being included\n\nnot willing for several years one of our\n\nneighbors & my brother—held church\n\nservice in the house almost everyday\n\nthen later we had a school building—a hall\n\n& any other entertainments in\n\nthat time there were churches there, in different\n\ntime\n25. When was the first car used in the community? about 1912\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   about 1914\n\n27. Where was your trading center? How far from your home?\n   Sintaluta, about 18 or 20 miles until Lemberg started.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? about once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   When Lemberg started up.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   about 1890 at Garlands, Postage La Prairie, dry goods chiefly later at Eaton's, but now chiefly at our local stores.\n\n32. When did you first have a telephone and what company provided it?\n   Western Electric about 1912 or 13.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   permanently.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes it\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new forms of transport, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy? In this way indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the time recorded.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Salt Lake City, the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nQuite a number for various reasons\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nOne of my sons have been Cops Director & one a Bee keepers Honey producers Association Director. My Husband was school teacher years ago.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur first P.O. was named Chilten by the owner of the farm near it was kept by the owner of the farm near it was kept in the memory of the locality because it came from England. Our school was called Chilten School. Our town is Lemberg. I believe it was named by an official who had something to do with laying out the town, who came from Lemberg Germany. Present Creek is first about 1/2 mile north of here. Present Hills about 5 miles.\n34. Did any people move away from your district? If so, why did they leave? What reasons did they have for moving?\n\nQuilt-making for survival\n\n35. Did anyone become a member of any organization during the 1920s or 1930s? If so, what was it?\n\n36. If you or someone in your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nOur family has been involved in beekeeping for many years.\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the district's mission (for example, buying a car, joining the military, etc.), explain the reason.\n\n38. How did the names in your community get their names? (School, streets, etc.)\n\n39. How did the first post office in your town get its name?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI think Mr. A.J. Loveage has a copy of the Grenfell book.\n\nIf so, what was called the Methodist Colloquy? Presently, that is all been abandoned now, but I think you might get a copy if you wrote to Mr. Loveage.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy family are all grown up.\n\n& Grand children to numerous to mention & scattered far and wide, and occupations various.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAgricultural improvements general\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. A.J. Loveage\nGrenfell, Sask.\n\nis one of the oldest I know. I am interested in this period of history.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6. Questions regarding historical source materials:\n\n32. Do you have in your possession, or do you know the whereabouts of diaries, old letters, old papers and programs, written recollections and reminiscences? (Quarries)\n\n33. Would you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n34. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy family are all grown up & scattered\n\n8 Grand children - to numerous to mention\n\n& and wives - and occupations\n\nbusiness\n\n40. What do you think are the most important changes in your community since you first came West?\n\nAgricultural improvements general\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1885_455.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5159, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 583, 5], [583, 1129, 6], [1129, 3126, 7], [3126, 4830, 8], [4830, 6133, 9], [6133, 7347, 10], [7347, 8650, 11], [8650, 9709, 12], [9709, 10873, 13], [10873, 11954, 14], [11954, 13242, 15], [13242, 14232, 16], [14232, 15806, 17], [15806, 16591, 18], [16591, 18097, 19], [18097, 19144, 20], [19144, 19144, 21], [19144, 19298, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]