[{"id": "ec95df9c157c364ebe39acdfd14d1db6a810b605", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by anyone else; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of caution to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by others, so don't worry about answering them all.\n\nUse extra sheets of paper if necessary, but don't worry about running out of space.\n\nDon't hesitate to give details, or describe personal experiences, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1974, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer life\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, as you have given it, please say so. It is quite acceptable to have someone else do the writing at your direction.\n\n1. Your full name: MRS. LENORA COWEN (MRS. CHARLES)\n2. Your address: SILTAN, SASK.\n3. Date: JAN. 4, 1955.\n4. Where were you born? (Give name of place and country): OTTAWA, ONT.\n5. What was your father's name and occupation?: G.N. SWANNSTON, Mechanic.\n6. When did you come to Saskatchewan? (Give month and Year): April 1887.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: OTTAWA, ONT.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you say \"I was a small child\", \"I was in my teens\", etc).: 10 years old.\n9. What were your reasons for coming West?: Came with the family.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government Information?): My Father learned of it from Mr. Ellis. He appelle land agent.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct, or if you also forget it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your direction.\n\n1. Your full name: MRS. LENORA COWEN (MRS. CHARLES)\n\n2. Your address: SILTON, SASK.\n\n3. Date: JAN. 4, 1955\n\n4. Where were you born? (Give name of place and country): OTTAWA, ONT.\n\n5. What was your father's name and occupation?: SWANSTON\n\n6. When did you come to Saskatchewan? (Give month and year): APRIL 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible: OTTAWA, ONT.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you say \"I was a small child\", I WAS IN MY TEENS, etc): 10 YEARS OLD\n\n9. What were your reasons for coming West?\n\nCome with the family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?): My father learned of it from Mr. Till.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and try changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? About 1918\n\n33. When you came to Saskatoon, the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMy family came with the idea of staying.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFirst bought by mail order from Sterling Mill & Co., Hamilton, at 1896.\n\n32. When did you first have a telephone and what company provided it? About 1918\n\n33. When you came to Hamilton, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nMy family came with the idea of staying.\n5.\n\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and connection of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy mother Mrs. C. H. Sherrill was the first to teach painting in Pagosa Springs, Colorado. She taught there for several years. Her students included Mr. R.B. Riggs, Miss Anna Martin, and Bella Ross.\n\nMr. Charles Bergfield named Selma from Selma, England.\n34. Did any people move away from your district prior to 1914? What reasons did they have for leaving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were active to have or do something in the district mention it here, giving dates wherever possible (such as owning the first automobile, combining, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMr. Charles Bensonfield named Sutton from Sutton in England.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, atlases, books of community organization, clippings, old newspapers, old photographs, written recollections and records? (Describe)\n\nPEWUMTINKEY, GRENFELL, NS, Canada\n\nMrs. M. M. Swanson, 739-142nd Ave., SW, Minneapolis, MN\n\nMay have a diary or pictures.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend these to the Provincial Archivist for copying and the\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan?\n\nIndicate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSON JOSEPH N. COWEN, farmer, Sutton\n\nSON FRED A. COWEN, co-op oil, Sutton\n\nSON CHARLES N. COWEN, farmer, Sutton\n\nGranddaughter DOREEN E. COWEN, nurse at General Hospital, Regina\n\n41. What do you think are the most important changes in your community since you\n\nmoved there?\n\nFirst came West? decidedly the wind!\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address below.\n\nMrs. M. M. Cowen\n\nfor Mrs. M. M. Cowen\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, family books or community organization records? (Describe) Yes\n\nREMEMBER GRENFELL TO HIS FAMILY\n\nTHOUGHTFUL TO HIS FAMILY\n\nW. SWANSTON, 783-142ND AVENUE\n\nMay I have a diary or pictures?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying and the...\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan?\n\n******** (Indicate your preferences, if any)\n\n10. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSON JOSEPH N. COWEN, Farmer, Sitter\n\nSON FRED A. COWEN, Co-op Oil Station\n\nSON CHARLES N. COWEN, Farmer, Sitter\n\nGranddaughter DOREEN, Housewife at Grandfather's Troptel, Regina\n\n11. What do you think are the most important changes in your community since you first came West? (Describe the change)\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. Same as question 10\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address below:\n\nMRS. M. COWEN\n\nfor Mrs. M. Cowen\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_485.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4267, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1618, 5], [1618, 3166, 6], [3166, 4332, 7], [4332, 5465, 8], [5465, 6129, 9], [6129, 6792, 10], [6792, 7462, 11], [7462, 8132, 12], [8132, 9166, 13], [9166, 10257, 14], [10257, 11482, 15], [11482, 12505, 16], [12505, 13892, 17], [13892, 15229, 18], [15229, 15384, 19], [15384, 15538, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]