[{"id": "e32aec7a6c106f3394f3239fd80c80f9f76e3b2e", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer so don't worry about leaving blank spaces. The best thing to do is to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered it and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA TEST OF EXPLANATION TO THE PIONEER EXPERIENCE IN THE WESTERN PROVINCE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer so don't worry about answering all of them. If there is space, describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Past: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and furnishings\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dinner table, this is quite acceptable.\n\n1. Your full name ...........................................\n2. Your address ...........................................\n3. Date .......................................................\n4. Where were you born? (Give name of place and country) ...........................................\n5. What was your father's name and occupation? ..............................................................\n6. When did you come to Saskatchewan? (Give month and year) ..........................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n8. How old were you when you first came to western Canada? You do not need to fill in this question if you would rather not or you may use \"I was a small child.\"\n9. Was there a person responsible for looking after you?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?)\nMoodie, Allan MacCouley\nEast End, Sask.\n\nSASKATCHEWAN APARTNENTS QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you rather have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name ..............................................................\n2. Your address ..............................................................\n3. Date ..............................................................\n4. Where were you born? (Give name of place and country) ..............................................................\n5. What was your father's name and occupation? ..............................................................\n6. When did you come to Saskatchewan? (Give month and year) ..............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible. ..............................................................\n\nMention how old you were when you first came to Western Canada? (You do not need to list every little question if you would rather not or you may use if I was a small child)\n\nCan you remember your parents' names? They were ____________________________\n\nThat was our closest relative.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you not married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In any particular experience of pioneer days that stand out in your memory, describe it.\n\n24. What was the first thing you did when you arrived in Saskatchewan?\n\n25. How long did you stay in Saskatchewan before moving to another place?\n\n26. What was the most difficult part of settling in Saskatchewan?\n\n27. What was the most enjoyable part of settling in Saskatchewan?\n\n28. What was the most challenging aspect of living in Saskatchewan?\n\n29. What was the most rewarding aspect of living in Saskatchewan?\n\n30. What was the most memorable event in your time in Saskatchewan?\n\n31. What was the most memorable person you met in Saskatchewan?\n\n32. What was the most memorable place you visited in Saskatchewan?\n\n33. What was the most memorable activity you participated in while living in Saskatchewan?\n\n34. What was the most memorable accomplishment you achieved while living in Saskatchewan?\n\n35. What was the most memorable lesson you learned while living in Saskatchewan?\n\n36. What was the most memorable moment you experienced while living in Saskatchewan?\n\n37. What was the most memorable memory you have from your time in Saskatchewan?\n\n38. What was the most memorable experience you had while living in Saskatchewan?\n\n39. What was the most memorable adventure you had while living in Saskatchewan?\n\n40. What was the most memorable surprise you had while living in Saskatchewan?\n\n41. What was the most memorable gift you received while living in Saskatchewan?\n\n42. What was the most memorable gift you gave while living in Saskatchewan?\n\n43. What was the most memorable moment you shared with your family while living in Saskatchewan?\n\n44. What was the most memorable moment you shared with your friends while living in Saskatchewan?\n\n45. What was the most memorable moment you shared with strangers while living in Saskatchewan?\n\n46. What was the most memorable moment you shared with nature while living in Saskatchewan?\n\n47. What was the most memorable moment you shared with animals while living in Saskatchewan?\n\n48. What was the most memorable moment you shared with the environment while living in Saskatchewan?\n\n49. What was the most memorable moment you shared with the community while living in Saskatchewan?\n\n50. What was the most memorable moment you shared with the world while living in Saskatchewan?\n25. When was the first car used in the community? — 1903 —\n\n26. If you owned a car before 1934, then did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear)\n\n29. How often did you shop in the early days?\n\n30. When did you first begin to buy through the mail order catalogues?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after trying to go back? When did you make this decision?\n25. When was the first car used in the community? — 1903 —\n\n26. If you owned a car before 1934, then did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases here by mail order and any changes in the proportion of purchases made by mail order since the pioneer days.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first thing raised its with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nSome moved to B.C. (Retired) some moved.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, very few returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Father, Mr. W. M. MacCoulley, was a member of the P. N. W. M. R. F. (Stations)\n\n37. If you or any of your family or friends were \"influenced\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) date and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe early days of the Express\n\nHill - also Police Station Waterford Hill\n\nOld 1st Post Office - Indian Chief School Creek\n\non account of the creek, growth of Saw River\n\nGrew, changed to Bone Creek\n5. Did any people move away from your district prior to 1934? What reasons did they have for moving?\n\nSome moved to B.C. (retiring) some moved.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Halli. Sig. W. N. W. M. R. Stearns\n\nIn P.E.I. Riggs. G. H. Had Rosalie Jones\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, listing dates wherever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (school district, post name, settlement villages, railway stations, creeks, hills, etc.) Try to give: (1) the name and meaning of the place-name; (2) the date and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change. Give facts of new name as above in (2), (3), (4).\n\nEast Bay was named by Mr. Epperson\n\nHill - also Police Station Waterhouse Hill\n\nPost Office - Post Office Creek\n\nIndian Chief - Indian Chief School Creek\n\non account of creek. Worth Fork Swy. (correct)\n\nCreek, Changed to Bone Creek\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1890_505.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3830, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1870, 5], [1870, 3722, 6], [3722, 5021, 7], [5021, 6305, 8], [6305, 6967, 9], [6967, 7630, 10], [7630, 7630, 11], [7630, 10345, 12], [10345, 11211, 13], [11211, 12083, 14], [12083, 13393, 15], [13393, 14684, 16], [14684, 14839, 17], [14839, 14993, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]