[{"id": "a64a57caaf58e24b05d7460b723fae1a11b42322", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to everyone; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give answers, even if they are insufficient; most of them will help to describe the particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate pages or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark those ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer life\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Pioneers in Saskatchewan\n( ) Pioneer health and housing\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the reader.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; others may prove impossible for you to answer, but don't hesitate to answer those which do. The extra effort of doing all these will be much appreciated by those who have to answer the questions.\n\nDon't hesitate to give additional or detailed particulars even if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years. Whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer childhood\n( ) Pioneer education\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Pioneers in Saskatchewan\n( ) Pioneers health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nMAY 21 1953\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your election.\n\n1. Your full name: Laura Welsh, Laura Welsh (signature)\n2. Your address: New Argenteuil\n3. Date: January 16, 1943\n4. Where were you born? (Give name of place and country): Hugh E. Smith, Grandfather\n5. What was your father's name and occupation?: Hugh E. Smith, Farmer\n6. When did you come to Saskatchewan? (Give month and Year): April 1905\n7. Mention any other places where you lived before coming to Saskatchewan: about 1878, after April 1905, when a baby\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, I was in my teens, etc.): eight years old\n9. What were your reasons for coming West?: my father wanted to better himself\n10. How did you learn about the West? (Through other people? Reading about it? My brother's letters made me curious, I was going to the Todale district. His stories of the country influenced my father.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If they are not given in the name list, please give any other information which may be acceptable to have included.\n\n1. Your full name: Laura Violet, Grandfather (signature)\n\n2. Your address: [illegible]\n\n3. Date: [illegible]\n\n4. Where were you born? [illegible]\n\n5. What was your father's name and occupation? [illegible]\n\n6. When did you come to Saskatchewan? (Give month and year): April 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use a small child, I was in my teens, etc.)\n\n9. What were your reasons for coming West?\n\nmy father worked at little family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or Government Information?)\n\nmy mother's brother wrote me a story about going in the Wichita district. She also told me about the country and influenced my father.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe traveled by train as a family.\n\n13. What means of transportation did you use?\n\nTrain\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, etc.)\n\nJust arrived in Winnipeg came to camp.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt a boarding house run by the minister's family.\n\nThen worked at local lumber mill for a month.\n\n16. Where did you settle or take up land?\n\nSettled on homestead at New Poplar.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived for about 4 years in M. S. N.\n\nBetween 1923 to 1927.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? \n\n13. What means of transportation did you use? \n\nTrain\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the Journey, accidents or other experiences, etc.)\n\nOur arrival family came on same train from Hamilton to Joliette.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt a boarding house, then they had no family.\n\n16. Where did you settle or take up land?\n\nLived on homestead at New Argyle.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBetween 1923 to 1927 I lived for about 4 years in New Argyle.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who and why?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nSlipped at new Osgoode (Woodlynne) before going to town. We had a piano. My father mostly walked. We had no horses, only oxen.\n25. When was the first car used in the community?\n   1917. model T Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Troddle 30 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   about 1916 traded at Goldthwaite about 12 mile distant)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   1940's\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?  \n1917\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nTrudell, 30 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nAbout 1916 traded at Selkirk about 15 miles distant.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n1940s\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion purchased by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n1917\n\n33. When you came to Seabrook the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nYes, we came with the idea of making a home.\n34. Did any people move away from your district prior to 1926? What reasons?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or been active in any organizations, mention it here (dates wherever possible).\n\nMy father, Hughie, was one of the first members of the First Federal Credit Union. He served as its president until 1977.\n\n37. If you or any of your family or friends were involved in any community activities in the district mentioned here, give dates whenever possible.\n\nMy father, Hughie, was one of the first members of the First Federal Credit Union. He served as its president until 1977.\n\n38. How did the places in your community get their names? (Schools, streets, parks, etc.)\n\n(1) Old names, still used today (e.g., Main Street)\n(2) Names given by early settlers (e.g., Smithville)\n(3) Names given by later settlers (e.g., Johnsonville)\n\nWhen district was named by the district president.\n\nThere were no names, just names from early settlers.\n\nThe names were originally chosen by New Orleans.\n\n(3) Oldest 1910s.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\n35. Did many people in your district move away during World War I?\n\n36. If you or some member of your family have held public office, or been active in any organizations, mention all names, offices, dates, and places.\n\nMy father's name was Henry V. He was elected to the first school board in 1917.\n\n37. If you or any of your family or friends were victims to have or do something in the district section (for example, giving dates, driving cars, etc.), please describe what happened.\n\n38. How old were children in your community when their parents died? (School attendance, age, etc.)\n\n(1) Some of them were very young; (2) Others were older; (3) All of them were very young.\n\n(1) Our school was closed by the death of our teacher.\n\n(2) We were very young; (3) Some of us were very young.\n\n(4) About 1910.\n39. Questions regarding historical source material:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_836.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4178, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1606, 5], [1606, 3228, 6], [3228, 4445, 7], [4445, 5547, 8], [5547, 6470, 9], [6470, 7354, 10], [7354, 8022, 11], [8022, 8824, 12], [8824, 9860, 13], [9860, 10965, 14], [10965, 12077, 15], [12077, 12987, 16], [12987, 13982, 17], [13982, 14988, 18], [14988, 15143, 19], [15143, 15295, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]