[{"id": "db764b4680410646c23b392f51bf1f049c9c4ee9", "text": "Please print name and address in capital letters.\n\nYour full name: HERBERT GORDON GALLAWAY\nPresent address: ESTEVAN SASK.\nPioneer address: SAME\n\nYear you came to Saskatchewan: 1892\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Half dozen\n\nHow many of these were bachelor's homes? None\n\n2. How often did you usually visit neighbors? Once in 2 mos.\n\n3. Did you usually visit on a Sunday, or other days? Other days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? \n\nWhat about meals? Did you stay when not invited beforehand? No\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) It wasn't much but we liked it.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Tea and biscuits, cookies\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Someone stayed home\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? No\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nNo, the homes weren't large enough\n\nThere were few musicians and many didn't believe in dances\n\nWere these more frequent in later years? Give dates.\n\nYes, from 1908 social evenings, skating dancing etc. increased\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No\nPIONEER RESERVATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? What was the reason for these visits?\n\n3. Did you usually visit on a Sunday, or other days? What was the purpose of these visits?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? What about meals? Did you stay when not invited beforehand?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" where groups of neighbors came together to put up a building, make quilting, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\nThere were few musicians and many did not believe in dancing. The dances were large meetings. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, bonfires, etc., if you have not described these on the School Questionnaire). Give dates.\n\nUp until 1910 all outdoor gatherings, such as socials to Ymas trees and church services were held in the school. In this particular district we had a fine grave for funerals at the river.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nAll. There were no other public places until a private hall was opened about 1908.\n\n9. When was your first community hall built?\n\nWhat material was it made of? Brick\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The Town\n\nWas it built in the village or town, or was it a country hall? In Town\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nSocials and entertainments of local interest were held in the school. Some school boards would allow dances to be removed for dances and some would not. Most dances were in town after 1912.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? No\n\nHow were babies and small children provided for?\n\nSome were kept them at home.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nSchools had small barns and some were left outside. Some times 2-3 families came together to save from the rain. This was a very barn.\n\n11. What card games were popular in the early days? Whist, Bridge, Rummy\n\nWas there card playing for a prize? No\n\nWhat dances were popular?\n\nWaltz and two step\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNot much. The non-dancers didn't attend the dances.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nIt was generally accepted but generally the regular deck cards were avoided.\nTell what was made of the school house for community purposes, box socials, etc.\n\nIf you have not described these on the school questionnaire, give details.\n\nWhat was the school used for? What activities were held in the school?\n\nDescribe the school district.\n\nDescribe all the things which were done in the school district.\n\nWhen was your first community hall built?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of house or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the school house for district gatherings, etc., or move into the hall for all gatherings, etc.? )\n\nHow were babies and small children provided for?\n\nWhat card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWas there any disagreement between dancing and non-dancing residents in the community?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings?\n\nThe regular deck cards were approved.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nVery little swank was practiced except by a few of the upper crust. Usually better educated, or perhaps financially able to socialize at nights.\n\n13. Was the chivaree known in your community? Rarely\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nOn one occasion a group of people had no cats and demanded both cats and money. They got none and went away. Some nuts confessedly ate. Occasionally they either invited the couple to a neighbor's and entertained there or brought lunch materials and arrived in another.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nHigh rate parties were the chief entertainment, usually winding up somewhere for lunch.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Churches, lodges.\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nAbout 1912, mostly unfair practices of grain buyers and non-grading.\n\nApproximately what proportion of the farmers in the community belonged to it? 25%\n\nHow many women belonged? How often did it meet? Sporadically\n\nWhat were some of the activities carried on by this organization?\n\nBox socials, dances, debates, speeches, sports of annual convention.\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3.\n\n12. What attempts at \"formalizing\" or \"awakening\" do you remember in small towns, such as Clover, etc.? Describe what you remember about chivalry, telling how common they were.\n\n13. Were the chivalrous known in your community? If so, describe what you remember about chivalry, telling how common they were.\n\n14. Describe any other details of visiting parties, etc., that you remember.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nReceiving society 1912, adults meetings held in town in school-house.\n\nWhat means were commonly used by organizations for raising money?\n\nPlate collections or memberships\n\n19. Where did various organizations hold their meetings?\n\nTown hall, some were free afternoon meeting might cost 5¢. Evening meeting 1¢.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No Give dates if possible. About 1912.\n\nWho provided the lantern and the slides? Church organization or local Co-op elevators etc.\n\nWhat were the slides about? Foreign lands, grain handling, etc.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nMarbles, kites, ball, pump pump pullaway, more logs to the well, leapfrog, horse shoe tennis, croquet.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nAnti Jover, skipping, Tennis, marbles.\nThere may be other organizations that were in existence in your community before 1865, carrying the name of early date when it was first organized, its activities, aims and purposes, who belonged (men, women, young people), whether it included all people only in one relatively small area (for example, a parish or town district) or was centered in the town or village and included the entire community (these it arose in the church, these it included here).\n\nWhat were commonly held in town in schoolhouse.\n\nPlate or pictures of members.\n\nWhat meetings were common?\n\nWhat were the advantages of afternoon meetings?\n\nWhere did various organizations hold their meetings?\n\nWere you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have night lantern shows? Give dates if possible.\n\nCHILDREN'S GAMES\n\nWhat games did boys play in summer (sandlot type, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nWhat were the slides about? Foreign lands, grand handling, etc.\n22. What winter games were played outside - fox and hounds, skating, etc.? Yes\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Yes\n\nDid the whole family join in such games, or only the children? Explain.\n\nUsually, the whole family\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nIn summer everyone was busy. In winter games, reading and homework were customary.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nMostly snow games or making snow men\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nMay 24, 1898\n\n26. Who organized it?\n\nA Trim committee\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nEntire Community\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\nYes\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nFoot races, tug-of-war, horse races, ball games, band\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nFamilies or groups lunched\n\n31. What did you have to eat and drink?\n\nSandwiches, cake, lemonade\n\n32. What time of the day did it start, and how long did it last?\n\n11 AM to 4 PM\n23. What winter games were played? (e.g., football, hockey, etc.)\n\n24. Usually, how was the weather?\n\n25. Was there much time for games, or was everyone usually busy with some kind of work?\n\n26. Who organized it? (e.g., town committee)\n\n27. Was it for the entire community, or for a smaller group, such as a school district?\n\n28. Was it the first picnic held in the community?\n\n29. What were the arrangements at the picnic you attended? (e.g., games, races, band, etc.)\n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nSchool children's march and drill with flags.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nMost picnics were Sunday School picnics at the river. Everybody attended, mostly races, lunch was provided and spread on the grass, for dinner with lemonade for drinks and peanuts galore. There was a refreshment booth where the race money could be spent and it usually was.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAdults don't attend unless it's a political rally. Change occurred during first world war.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nFootball, baseball, cricket, croquet, horseshoe. Mostly young people took part.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFootball\n\nWhat year? 1912\n\nHow long did it continue? About 5 yrs.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nIn 1918 a skating rink for skating only.\n\nIn 1921 a skating rink and a curling rink.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of plants which you know of in the early days such as the large community plant, school or Sunday School, planters, family picnics, etc., tell about any differences in numbers attending, food and drinks, men held, etc.\n\nThe main meetings were attended mostly by races, church areas varied and spread over the grounds for dinner which demanded far more and peanuts game they were a refreshment both when the rain money could be applied and obviously wins.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (and, women, mostly young people), baseball, cricket, football, soccer, basketball, volleyball, tennis, running, purple team, pace.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1912\n\nHow long did it continue? 1912-1913\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nIn 1918 a skating rink for skating my\n\nIn 1921 a skating rink and a curling rink\n40. When did an annual \"sports day\" become established in your community?  \n1898  \nDid it grow out of or replace the earlier community picnic?  \nWho was responsible for starting the first sports day?  \nTown committee  \nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).  \nMay 24th  \n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.  \nNo  \n\nREADING  \n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.)  \nBibles, school books, Fairy tales, David Copperfield, Ivanhoe, etc.  \n\n43. How many of your neighbors brought books with them?  \nNot many  \nWhat kind of books and how many?  \n\n44. To what extent did you exchange books with neighbors?  \nLittle  \n\n45. Did you buy many books after you came west? Give details.  \nNo  \n\n46. What books were sent to you as gifts in early years?  \nFew. People didn't have money for purchasing much but a bare living.  \n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.  \nYes but not until the 20's  \n\n48. Was there a school library?  \nNo  \nWhen was it begun?  \nTo what extent were books borrowed from the school library for adults to read at home?  \n\n49. Did parents ever use their children's school text books as additional reading material?  \nNaturally\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plant?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held (what month, or any special day, such as May 24th or July 4th)?\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, sell them nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nNimble, Albert Dutton, Fairy Tales, David Copperfield\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? About 1916\n\nWho started it? The Town\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe town has a librarian, a fee is charged per yr a lot of people patronize it.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? None in the hungry nineties\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? Very few\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo. We didn't have many problems and there weren't farm periodicals and the Family Herald didn't vitally affect our needs.\n8.\n\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? October 1916\n\nWho started it? Mr. Trim\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThe library had a librarian, a few changed every year.\n\na very popular pastime.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nNow in The Surveying Monthly\n\n52. Describe later changes in your subscriptions, tell if any new ones were added or dropped.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nVery few\n\n55. Did you find a lack of reading material or sources of information in your early days in the west; a hardship? Explain.\n\nNo. We didn't have many periodicals and the family Herald didn't vitally affect our needs.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   *harmonica organ and a Jew's harp.*\n\n57. What instruments did any of your neighbors have?\n   *violin*\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   *Piano 1910 price $475.00*\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   *Less than today*\n\n   In the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   *Not so much*\n\n60. What were some of the favorite songs in the home?\n   *mostly hymns*\n\n   In the community? *Wild Sang Syne, Old Black Joe... There's no place like home. He's a jolly good fellow.*\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   *No*\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   *Perhaps at a young couple gathering or a farewell*\n\n63. Was there a band in your community? When was it started?\n   *Not in early years.* Who started it? How long did it continue?\n\n   How many were in it? Who was bandmaster?\n\n   What instruments were included?\n\n   Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instruments\n\n56. What musical instruments did you bring west with you? (List.)\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? (Give dates, prices, if possible, and tell where you bought them.\n\nDate: 1910 Price: $25.00\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community? Would \"Song April\" and \"Black Jack\" be familiar to anyone who lived here then? How about \"Gathering of the Old Folks\"?\n\n61. Was \"Old Music\" or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Has there been in your community? (Who started it? How long did it continue?)\n\nHow many were in it? Who was the chairman?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where,\n\nIf members had uniforms, what events the band played for,\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNo\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMore important now; more people study music, more own photographs, and radio supplies new material to be rehashed.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNo\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nGive more important music more fuller study music more run photography, and make supply new material to be released.\n\nHOBBIES AND SPECIAL INTERESTS:\n\n66. Do you have any collections, such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer ways not already mentioned.\n\n(use back of page) or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1892_1943.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7812, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1113, 5], [1113, 1113, 6], [1113, 2871, 7], [2871, 4219, 8], [4219, 6678, 9], [6678, 7823, 10], [7823, 9846, 11], [9846, 10929, 12], [10929, 12606, 13], [12606, 13857, 14], [13857, 15447, 15], [15447, 16145, 16], [16145, 17983, 17], [17983, 19629, 18], [19629, 21139, 19], [21139, 22475, 20], [22475, 23680, 21], [23680, 24840, 22], [24840, 26341, 23], [26341, 27645, 24], [27645, 28897, 25], [28897, 30140, 26], [30140, 30276, 27], [30276, 30430, 28]], "primary_language": ["None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]