[{"id": "b1cb71d5988cca9aab4dd7693cc8c527e735ba8c", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Provincial Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to answer even if there is not sufficient space to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the question, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Policemen in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: MARTIN WILLIAM BEERS\n\n2. Your address: M.T.U.N.A. in A.R.C.H. 2nd\n\n3. Date: \n\n4. Where were you born? (Give name of place and country): Ballydesland, Northern Ireland\n\n5. What was your father's name and occupation: Samuel Martin Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan giving dates wherever possible: Toronto from May 1903 until 6th of March 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) Twenty-two years\n\n9. What were your reasons for coming West? To get back to farming and to improve my conditions by earn self employed\n\n10. How did you learn about the West? (Through other people? Reading about it? Hall read or government information?) From a old Irish Goldir who travelled this country during the Fen Rebellion\n1. Your full name: MARTIN WILLIAM BEEVERS\n\n2. Your address: 7 RUNA, IN A.R.C.H. 2nd\n\n3. Date: \n\n4. Where were you born? (Give name of place and country): Ballydesland, Northern Ireland\n\n5. What was your father's name and occupation?: Samuel Martin Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, \"I was in my teens,\" etc.) Twenty-two years\n\n9. What were your reasons for coming West? To get back to farming and to improve my conditions by earn self employed\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) From a old Irish Soldier who travelled this country during the Fenian Rebellion\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   I never acquainted them of going west.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    With a Brother\n\n13. What means of transportation did you use?\n    Railroad to Balcarres\n    Livery team the balance of the way\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Lived in a tent for 3 months until we cut logs and built a shack on the present farm\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n    None\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n    One year working with the Grand Trunk Railroad and 10 months employed with the Toronto Electric Light Co.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   I never acquiesced them of going west.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n    With a brother\n\n13. What means of transportation did you use?\n    Railroad to Balcarres\n    Livery team the balance of the way\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n    One year working with the Grand Trunk Railroad and 10 months unemployed with the Toronto Electric Light Co.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n    Lived in a tent for 3 months until we built a shack on the present farm\n\n16. Where did you settle or take up land?\n    None\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?\n    How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\nAbout two letters a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRichard Martin 25th July 1911 Toronto Ontario\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nMy two brothers came later\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo Brothers came west May 1904 Settled right beside us\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI think it was the day the first passenger train arrived here from Winnipeg\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nDid not travel much occasionally to visit other settlers sometimes walking other times by horseback\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nMy two Brothers came later\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nTwo Brothers came west May 1904\nSettled right beside us\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI think it was the day the first passenger train arrived here from Winnipeg\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDid not travel much occasionally to visit other settlers sometimes to walking other times by pony-trough\n25. When was the first car used in the community in the year 1912?\n\n26. If you owned a car before 1914, when did you buy it? What make? No Car\n\n27. How far from your home was your trading center? How far from your nearest settlement?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Almost every 2 or 3 months.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and that company provided it?\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you make this decision? It was permanently right from the start.\n25. When was the first car used in the community in the year 1912?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling contact? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing by better means of travel, etc.)\n\n29. How often did you shop in the early days? about every 2 or 3 months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and that company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nIf you permanently right from the start\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes because many of them was not farmers they just merely homesteaded mortgaged and got out.\n\n35. Did many people move away during the 1930s? Did many return?\n\nForm word was I some moved back later\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI am a member of the A.F.A.M. Lodge\n\nNov 1924 and now a life member\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates whenever possible.\n\nSuch as owning the first automobile, combining the organizing first lodge, etc.\n\nI was present at the organization of a F.A.O.S. at Yuma in Oct. 1919.\n\nI had the first Combining in the District in 1949 and I am the first Settler in the Yuma district.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change.\n\nOur School district Beaver Hill derived its name from the Beavertails which adjoins it to the South. W. Grant & Co. Station was named by J. W. Grant discarded.\n34. Did any people move away from your district prior to 1924? What reason did they have for moving?\n\nYes, occasional marriages of the young men and women who came in were not successful. They went \"unmarried\" homesteaded, married and got out.\n\n35. Did many people move away during the 1900s? Did many return?\n\nSome moved away and some moved back later.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nI am a member of the Ed. F. A. M. Lodge.\n\nNov. 1924 and now a life member.\n\n37. If you or any of your family or friends were active in any organization, mention it here, giving dates whenever possible.\n\nI was present at the organization of a F.A.O. at Utica in September 1928.\n\nI had the first settlement in the Utica district in 1944 and I am the first settler in the Utica district.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as shown in (1), (2), (3).\n\nOur school district Beaverkill changed its name from the Beaverkill school district to the Beaverkill school district adjacent to the Schoharie W. Grant School.\n\nIt was named by J. W. Grant, deceased.\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old posters and programs, minute books of community organiza-\n   tions, old pamphlets, old photographs, written recollections and reminisc-\n   ences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they\nlive and occupations.\n\n41. What do you think are the most important changes in your community since you\n\nPlease give the names and addresses of other pioneers who could answer this ques-\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here:\n\nMr. Morton Rayner Stuma Barlow\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_674.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4306, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1530, 5], [1530, 3141, 6], [3141, 4139, 7], [4139, 5092, 8], [5092, 6089, 9], [6089, 7080, 10], [7080, 8080, 11], [8080, 9020, 12], [9020, 10020, 13], [10020, 11015, 14], [11015, 12455, 15], [12455, 13961, 16], [13961, 14953, 17], [14953, 15912, 18], [15912, 16067, 19], [16067, 16221, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]