[{"id": "f979aef972d3aa0a55e0e72f10186034b8b45e4f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan ____________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1924, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? \n   How many of these were bachelor's homes? \n\n2. How often did you usually visit neighbors? \n\n3. Did you usually visit on a Sunday, or other days? \n\n4. Were you often invited to other homes, or was most visiting done without an invitation? \n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? \n   What about meals? Did you stay when not invited beforehand? \n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? \n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? \n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. \n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. \n   Were these more frequent in later years? Give dates. \n\n8. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 5\n\nPlainer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Usually.\n\n2. How often did you usually visit neighbors? Usually.\n\n3. Did you usually visit on a Sunday, or other days? Usually.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Usually.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? In the afternoon.\n\nWhat about meals? Did you stay when not invited by the host?\n\nHow was the invitation to a meal worded when people had none unexpectedly? (That is, was the term to take politeness used, or was there any other expression connected?)\n\nIf no meal, what other refreshment might be offered to visitors who had not expected it?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"neigh\" or groups of neighbors come together to put up a building? Make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"neighs\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nDescribe more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.?\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\nNo.\n\n13. Was the chivaree known in your community?\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nNot practical, a very little.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nChanges during the last 10 years, because the people have automobiles; do not provide their own local amusement. In the depression year people were forced to.\n\nORGANIZATIONS AND MEETINGS,\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGrain Growers.\n\nGive the date and reason for it being organized.\n\nOrganization was growing through lack.\n\n16. Was there a Saskatchewan Grain Growers local in your community? 1907.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nNearly all.\n\nHow many women belonged? How often did it meet?\n\nAs many almost a man Twice a month.\n\nWhat were some of the activities carried on by this organization?\n\nActivities were in connection with railway, business services, feeding of grain, prices of new meat, etc.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as groves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nNo.\n\n13. Was the saloon known in your community? \nDescribe what you remember about saloons, telling how common they were, any incidents connected with them, etc.\n\nNot pictured, a very little.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when these changes in visiting or social life became noticeable.\n\nChanges during the last 10 years because the habits have actually changed.\n\nAs far as I know, they are least amount. In the depression years people were forced to.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\nOrganization: Young Farmers Club.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? \nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? \nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a homemakers' club in your district? \nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\n*Pre 1914*\n\nWhat means were commonly used by organizations for raising money?\n\n*Fairs, dances*\n\n19. Where did various organizations hold their meetings?\n\n*In private homes*\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\n*Alden*\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n*Weekly religious*\n\nDid you often have magic lantern shows? — Give dates if possible.\n\nWho provided the lantern and the slides?\n\n*The teacher*\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\n*Ball*\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\n*At school, Ball also.*\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included old or young people only, in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. There is space in the church questionnaire for organizations connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. What did various organizations hold their meetings at?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-skipping rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *Shooting or sleighs.*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *Cards, checkers, etc.*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *This depended on the type of people. The radios were more...*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *In very early days, time was available in winter.*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *None that I know of.*\n\n**PIGNICS AND SPORTS.**\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \n   *Give year and month if possible.*\n\n26. Who organized it?  \n   *Vahaps 1911*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *For the entire community.*\n\n28. Was it the first picnic held in the community?  \n   *Yes*\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   *Ball games, races for children.*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *Lunches brought - often eaten in one large group.*\n\n31. What did you have to eat and drink?  \n   *Sandwiches, cake. To drink lemonade - perhaps tea.*\n\n32. What time of the day did it start, and how long did it last?  \n   *Afternoon ended about 6 or 7 P.M.*\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat winter games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", or others, checkers or other games? \n\nCards, checkers, etc.\n\nDid the whole family join in such games, or only the children? Explain.\n\nThe children joined in the games. The adults were busy with other things.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nThere wasn't much time for games.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nYes, they did.\n\nPICTURES AND SPORTS\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\nJuly 1911\n\n26. Who organized it?\n\nTed Taylor\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nIn the entire community.\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the arrangements at the picnic you attended (ball games, races, band, etc.)?\n\nPicnic games, races, a children's race.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nLunches brought by families.\n\n31. What did you have to eat and drink?\n\nSandwiches, cake. No lunch, lemonade, perhaps tea.\n\n32. What time of the day did it start, and how long did it last?\n\nAfternoon, lasted about 6-7 P.M.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThese picnics were usually small affairs, where everybody attended.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nLarge picnics are now organized by organizations. Baseball players, etc., often address the crowd.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nGreat changes began to take place after the first great war. The railroad was through this area, bringing new attractions like ice cream, candy, etc.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBasketball, football, soccer.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nIt was organized in 1914.\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nProbably in 1920.\n\nWhen was the first indoor rink built, and what was it used for?\n\nNone exists to date.\n33. Describe any features of this plant which you remember as outstanding.\n\nMy favorite was the tall grass, and everything else.\n\n34. Describe how different kinds of plants which you know of in the early days, such as the large community planter box or hanging school plants, family food and drink, when held, etc.\n\nLarge flower box or hanging box. School plants, flowers, etc.\n\n35. What changes have you noticed in planning since the first years? If possible, give dates when changes became noticeable.\n\nJust change began to take place after the war years. We realized we needed the new things such as low-cost, inside jobs.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly).\n\nBasketball, football, etc.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThe organized team began in 1911.\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1920, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nPovesh in 1920.\n\nWhen was the first indoor rink built, and what was it used for?\n\nPlans, etc., etc.\n40. When did an annual \"sports day\" become established in your community? \n   Did it grow out of or replace the earlier community picnic? Since 1919.\n\nWho was responsible for starting the first sports day?\n   A group in the local village of Harmony.\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n   In July or August.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n   [Names not legible]\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n   [Names not legible]\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n   [Names not legible]\n\n44. To what extent did you exchange books with neighbors?\n   A good deal of this was done.\n\n45. Did you buy many books after you came west? Give details.\n   Few books bought. I recall my library was after 1919.\n\n46. What books were sent to you as gifts in early years?\n   Occasionally\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n   Yes, since 1920. Library kept in the home by my mother or often Elda School District for many years.\n\n48. Was there a school library? Always. When was it begun? School building + school\n   To what extent were books borrowed from the school library for adults to read at home?\n   A good deal of this was done & encouraged by most teachers.\n\n49. Did parents ever use their children's school text books as additional reading material?\n   Sometimes, but not often done.\n7. When did an annual \"sports day\" become established in your community? (1919)\n\n8. Did it grow out of or replace the earlier community picnic?\n\n9. Who was responsible for starting the first sports day?\n\n10. What was the sports day usually held? (What month, or any special day, such as May 24th or July 4th?)\n\n11. Are there any from your community who have become members of well-known teams? (Give names, and dates.)\n\n12. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, you may say how many books you brought, and what kind.)\n\n13. How many of your neighbors brought books with them?\n\n14. What kind of books did they bring?\n\n15. To what extent did you exchange books with neighbors?\n\n16. Did you buy many books after you came west? Give details.\n\n17. Have you ever had any \"travelling library\" books in your community or school?\n\n18. Was there a school library? (Always)\n\n19. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started?  \n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n   *The Free Press* (Way)\n   *Family Herald*, *Montreal Ate*.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n   *Newspapers were still taken by me, with others added.*\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n   *No.*\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n   *Few. Two volumes of short stories on Great Subjects, [school pages]*\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n   *Yes. The papers were read much more thoroughly than in new towns. As mention before, books were borrowed.*\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers do you regularly read? How long have you subscribed to them?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None\n\n57. What instruments did any of your neighbors have? Harmonica mostly\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nSinging did not play a very great part.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nThe group singing was enjoyed mostly by American Russians (Lubkows)\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nA limited number - Scottish - English - French songs\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo\n\n63. Was there a band in your community? Yes When was it started?\n\nWho started it? In January soon after the end of the first term 1919\n\nHow long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included? Cansel bag\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nNo information.\n56. What musical instruments did you bring with you?\n\n57a. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the new town?\n\n59a. How large a part did singing and other forms of music play in your home entertainment in early years in the West?\n\nIn the community there musical concerts, was there group singing at parties, etc.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was there music or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the organization? Explain.\n\n63. Was there a band in your community? If so, when was it started? How long did it continue? Who started it? How many were in it? What instruments were included? Tell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nAn information\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNone\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nMusic more now than in early days\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nUnrelated by children\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nI did not, but records have been kept.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nPhotography, pictures developed in the home\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nThere is not as much visiting. People meet in the local village, a few men in their car or truck for a few minutes every day. Rural population has declined in the past 10 years, and in other parts.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? (Attach a list.)\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nPhotography, nature, birding at his home.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? (Use back of page, or extra sheets if necessary.)\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days; not already mentioned.\n\nThis is not as much writing. People met in the local village, a few men, so they could find for a few minutes any day. Rural population. Ke declined to the party deck, and attacked.\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2032.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7003, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1272, 5], [1272, 1272, 6], [1272, 2498, 7], [2498, 4035, 8], [4035, 4035, 9], [4035, 4035, 10], [4035, 5776, 11], [5776, 7340, 12], [7340, 8712, 13], [8712, 9841, 14], [9841, 11572, 15], [11572, 13190, 16], [13190, 14838, 17], [14838, 16311, 18], [16311, 18068, 19], [18068, 19099, 20], [19099, 20365, 21], [20365, 21292, 22], [21292, 22741, 23], [22741, 23801, 24], [23801, 25271, 25], [25271, 26618, 26], [26618, 26706, 27], [26706, 26860, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]