[{"id": "520774ff878bfbefcb167818c78e7617eba4b063", "text": "McClure, O.F., Glen Williams, Ont.\n1900, Prescerville.\n\nAdditional Notes enclosed.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire:\n\nIt is difficult to measure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the Permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMcClure, O.F., Glen Williams, Ont.\n1900. Presseville.\n\nAdditional Notes enclosed.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WAY OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life. It is impossible for the questions here to answer all experiences as known by each individual who has lived in pioneer life. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOTHER QUESTIONNAIRES\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here ( ).\n\nand we will be sent to you.\n\nSaskatchewan Archives Questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n{ } All questionnaires\n\n{ } Pioneer health conditions\n\n{ } Pioneer social life, sports and recreation\n\n{ } Pioneer housing and churchwork\n\n{ } Pioneer education and churchwork\n\n{ } Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nMcClure, O.F., Glen Williams, Ont.\n1920, Presseville.\n\nAdditional Notes enclosed.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper nouns and place names in capital letters. If you are not sure the name is correct or you have given it, please say so. Rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name\n2. Your address\n3. Date\n4. There were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was a baby\" etc.)\n9. What were your reasons for coming west?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nGlen Williams, Ont.\n\nNovember 6th 1900\n\nnear Melita, Manitoba from 1889 to 1890\n\nuntil Nov. 6th 1900\n\nAmblerly, Bruce County, Ontario\n\nSamuel Andrew Peskit\n\nSamuel, 70 months builder,\n\nAbout 4 years of age came with my parents\n\nto a prairie homestead, build part-in-a-\n\nwood house, later a grain house was built.\n\nWe thus children acquired measles on it farm\n\nCommune from Oct., which caused a month delay\n\nin homesteading.\n\nAs 65 where we went My Father paid came to Manitoba\n\nin 1880 or 1879 worked on a farm some where\n\nnear Williraine, later he took a homestead 6\n\nmiles north of the new town of Melita, where\n\nmy 99 other and we three children from them\n\nat following spring, 1910, my father and I\n\nlived in a blacksmith, James Charles, second\n\nin the ranching country near dear park\n\nYorkton Sask. I don't remember how dear park\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct or if you have given it to the wrong person, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name: Glenn Williams, Ont.\n2. Your address: 613. McClure (Mrs. J.A.)\n\nAdditional Notes enclosed:\n\nGlenn O.F., Glenn Williams, Ont.\n1920, Princeville.\n\nAmbly, Bruce County, Ontario\n\nSamuel Andrew Presley\n\nPromised 8th of 1900\n\nnear Melita, Manitoba from 1889 to 1890\n\nuntil Nov. 8th, 1900\n\nAbout 4 years ago came with my parents\n\nto a prairie homestead hotel first-in-a\n\nprairie house, later a grain house was built.\n\nWe thus children acquired measles on attics\n\nin Delaware, before coming to homestead.\n\nHow did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nIn 1887 or 1879, worked on a farm somewhere near Delaware, later he built a homestead 6 miles north of the new town of Melita, where my mother and we three children joined him\n\nat promising spring. My father secured land for a blacksmith. James Charles, read by\n\nmyself in the ranching country road of\n\nYorkton. Since I don't remember how far south\nQuestion 10 continued - they came to their attention, they drove with a team and buggy to a place about 75 north of Yorkton where they purchased two ranches or rather they purchased the ranch buildings and the right to cut hay in certain meadows. The land was not yet surveyed and could not be bought by anyone but the builders could claim \"squatters rights\" these rights were purchased from Mr. Livingstone and from his father Ronald Livingstone who in turn had got it (our ranch) from the original builder, Mr. Cunningham, an Englishman then living near Beaver Lake (now Good Spirit Lake).\n\nI helped until I was 18 years old on a homestead claim and helped in the house.\nQuestion (continued) - Jack came to their attention, they drove with a team and buggy to a place about 75 north of Yorkton where they purchased two ranches or rather they purchased the ranch buildings and the right to cut hay in certain meadows. The land was not yet surveyed and could not be bought by anyone but the builders could claim squatter's rights. These rights were purchased from Mr. Livingston and from his father Donald Livingston who in turn had got it (our ranch) from the original builder, Mr. Cunningham, an Englishman then living near Devils Lake (now Good Spirit Lake).\nquestion (continued) of last came in their attention, they drove with a team and puppy to a field about 75 north of Yorkton where they purchased two ranches or rather they purchased the ranch buildings and the right to cut hay on certain meadows. The land was not yet surveyed and could not be bought by anyone but the hidden circle. Louis \"Youngboy\" Regillo these meadows were purchased from Mr. Cunningham and from his father Donald Cunningham who in turn had got it (our ranch) from the original builder a Mr. Cunningham an Englishman then living near Yorkton Lake (now Gordon Springs Lake).\nQuestion (continued) of Sack came to their attention, they drove with a team and buggy to a place about 75 north of Yorkton, where they purchased two ranches or rather they purchased the ranch buildings and the right to cut hay in certain meadows, the land was not yet surveyed and could not be bought by anyone but the builders could claim \"Squatters Rights\" these 'rights' were purchased from Livingston and from his father Ronald Livingston who in turn had got it (our ranch) from the original builder a Mr. Cunningham, an Englishman then living near Devils Lake (now Good Spirit Lake).\n11. What did your friends and relatives think of your decision to come to Western Canada? From what I gathered by listening to conversation between my parents, their people in the East thought they were going to the \"ends of the Earth\" and would probably never be heard from again.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My Father, Mother and Brother drove with teams (wagons) from Melita Man. to the ranch. I came late by train to Edmonton, continuing by team to the ranch.\n\n13. What means of transportation did you use? My Father hired a heavy team and driver from Ball, Livingstone. We left Lytton about 9 a.m., after driving some distance, the driver put his feet on the dashboard of the buckboard and shook his lines and said \"Go on Boys.\" The \"Boys\" went on and on and on over poor, rough frozen roads.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). It was November but very little snow; it was just a trail not a road, we reached \"Home\" about 8 p.m. having stopped for dinner at Devils Lake at Barton making the journey of what was recorded to be 75 miles between 9 a.m. and 8 p.m., some team there Boys.\n\nQuestion 14, nothing unusual I guess, after leaving Melita Hotel, so it was all strange and new to me.\n\n15. Where did you first stay when you arrived in Saskatchewan? I'm not sure if I stopped for the night at the home of Mr. Meredith who was cattle buyer for the north country.\n\n16. Where did you settle or take up land? Our range was about a mile from the present town of Precious Lake.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. My Brother filed on the first homestead taken over district in 1903 (think). My Father also had a purchased homestead later (he had already homesteaded in Man.) I lived on all three so can say I homesteaded 3 times. My family moved often but never more than 15 miles distant from our original home on the Assiniboine River.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI helped with the cattle and horses, keeping track of where they were in summer, spent a great deal of time on a horse's back, and of course helped in the house.\n11. What did your friends and relatives think of your decision to come to Western Canada? From what I gathered by talking to them, they thought it was a good move.\n\n12. What means of transportation did you use? We left by train from Regina to Prince Albert, then by boat to Edmonton.\n\n13. What happened during your journey? We encountered many challenges, including bad weather and difficult terrain.\n\n14. How did you earn a living before coming to Western Canada? We started by working on a homestead and then moved to a town.\n\n15. How did you earn a living after you came? We worked on a farm and then moved to a town.\n\n16. Where did you settle or take up land? We settled in a small town near Edmonton.\n\n17. Mention any other places where you have lived since coming to Western Canada. We lived in Regina, Prince Albert, and Edmonton.\n\n18. How did you earn a living after you came? We worked on a farm and then moved to a town.\n\n19. How did you earn a living before coming to Western Canada? We started by working on a homestead and then moved to a town.\n\n20. How did you earn a living after you came? We worked on a farm and then moved to a town.\n19. How often did you write to relatives or friends in your old home?\n\nFrom my parents point of view, I think lack of news from home added to the hardships of pioneer life. Those who moved from East to West didn't have much to worry about except their struggles and they were often too proud to complain.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried in Sept. 1911 to J. A. McClure of Plateau Lake.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy Dad always said \"encourage anyone coming West unless, as he put it, they were 'money hawks'! Otherwise they might be disappointed and blame the person who recommended they come. However an honest deal comes and takes an honest.\"\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nTraveling in the early years was limited to occasional trips to the nearest town or to the necessary moving about in connection with the business of earning a living. Neighbors were few and far between, so were visits. Some times we gathered for a dance if a musician could be found. As the country settled schools were built; then Church Service was held in the school before that service was held in the homes, whenever it was possible for the minister to get around. He had a large field. Even in the first years we were in back a large field.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI have answered Question 24 in 23rd stall.\n\nYears of actual school attendance\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. How did you travel to the nearest town? How far was it from your home?\n\n21. Did you ever go to school? If so, where?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI have answered Question 29 in 23rd stall.\n25. When was the first car used in the community?\nAbout 1910 James Kelley of Canora had the first car within\n30. If you owned a car before 1914, when did you buy it? What make?\nDidn't have one, but we did have a good horse and a buggy.\n\nQuestion 23\nIn answering this question, there were so many happenings in pioneer life that it is difficult\nto decide on which particular one to relate.\n\nA. To most difficulties of\nC. and promptly for\nS. my memory con\nC. more named \"C\"\nAs our second wind\nce of range horses\nfall and became\nwe were wintering for\nso yolked for supper\nevening and rep\nbank and he was\nby Albert - I went with\na the animal to a\n18 (17) thought she wo\nEape got to her feet,\nvery quickly, get rope s\nlot after several atten\nan more on her feet,\n3 to get her finger in t\nalso hurt she went to\nme with the animal\nIt was now ap\nI supper were li\nMother's finger bo\nFather returned me\nrecorded and all a\nHow\nwith my family, it had been suggested that\nI remain in Manitoba and continue my education.\nThat idea didn't appeal to me much so my\nEducation was finished at 14 years of about 32\nyears of actual school attendance.\nQuestion 19 continued\n\nAmericans left behind in the East were often very poor correspondents, so busy with their own affairs they neglected or forgot to send a message of cheer to those who were so sadly in need of encouragement.\n\nLack of interest from the East was probably the beginning of the distrust and resentment that at one time (and probably still does) existed between West and East.\n\n---\n\n25. Than was the first car used in the community?\n\nAbout 1910 James Kelly of Carson had a Ford.\n\n30. What year did you own a car before 1924, when did you buy it? That makes?\n\nDidn't have one, but we do have a buggy.\n\n---\n\nC. Question 23\n\nExperiences in families which included one or more\n\nA. To decide on which members are to travel\n\nB. As most difficultly\n\nC. As my memory\n\nD. A new second wife\n\nE. A new house\n\nF. We were working hard\n\nG. For exercise and to unwind\n\nH. All that I went well\n\nI. (17) Although old\n\nJ. (18) To see kids\n\nK. Family life was better\n\nL. I felt myself improve after\n\nM. I was more on the feet\n\nN. To get the fingers in\n\nO. Also hurt the waist\n\nP. Now with the amount of\n\nQ. My parents' feelings\n\nR. Father returned me\n\nS. Recovered and see a\n\n---\n\nHim, my family, d. Had been suggested that\n\nyou remain in Manitoba and continue my education\n\nThat idea didn't appeal to me much so and\n\nEducation was practical work at 35\nQuestion 19 continued\n\nPueblos kept behind in the East were often very poor correspondents, as busy with their trade affairs they neglected or forgot to send a message to those who were so badly in need of encouragement.\n\nOne line (and properly well done) existed between West and East.\nQuestion 19 continued\n\nFriends left behind in the East were often very poor correspondents, so busy with their own affairs they neglected or forgot to send a message of cheer to those who were so badly in need of encouragement. Lack of interest from the East was probably the beginning of the distrust and resentment that at one time (and probably still does) existed between West and East.\nQuestion 23\n\nIn answering this question, there were so many happenings in pioneer life that it is difficult to decide on which particular one to relate most difficulties of the day we took \"in our stride\" and promptly forgot. One that stands out in my memory concerns a chocolate-colored mare named \"Cocoa\" and happened during our second winter in Sask. We had a bunch of range horses bought from Montana the previous fall and because they were new on the range were wintering poorly. My Father had gone to Yorkton for supplies, my brother came in near evening and reported a horse down in a snow bank and he was unable to help her to her feet.\n\nAlbert - I went with team and stone boat, dragged the animal to a shed near the stables. Albert (17) thought she would pull through if she could be got to her feet, so we proceeded to fasten a pulley, get roped ed; Mother came to help, finally after several attempts we did manage to get the mare on her feet, just then Mother in the excitement got her finger on the pulley and it was badly hurt she went to the house, Albert finished with the animal then we too went to the house. It was now after 9 p.m., we had had no supper - were tired and cold, the sight of Mother's finger was too much for me, I bawled. Father returned next day, Mother's finger healed, \"Cocoa\" recovered, and all was well - until something else occurred.\nQuestion 13\n\nIn answering this question, there were too many happenings in former life that it is difficult to decide on which particular one to relate. Many difficulties of the day we both in our youth and promptly forget. Upon that occasion our my memory concerning a chocolate-colored horse named \"Corona\" and I happened down to our second winter in South Dakota. We had a third range horse brought from Montana the previous fall and became they were near on the range were willing horses. Papa had gone to Yorkton for supplies, my further came in near evening and reported a horse down in a snowstorm and he was unable to go to the range.\n\nAlbert - I went with him and where horses dropped out running to a shed near the station, Albert a\n\n(1) Although we would have been through if we could have got supplies each other came to help, finally after several attempts we did manage to get the move on the road, and then Mother in the meantime got her horse on the range and if we had been hurt she would be there. Although finished with the animal than me his work by the time\n\nIf we were now plan 9 p.m., but hard had no purpose - were tired and cold, the night by\n\nMy horse being worse hit much for me, I saw God.\n\nPapa returned next day, Miller being healed. Corona\n\nreturned and we were well - until something happened.\nSunday School Supper made a yearly visit to old gentlemen, Mr. Ludlow, and his wife Mrs. Ludlow.\n\nWe had a happy united meal and parents were but sorry.\n\nBrother and I preferred to work there back, we used to have and catch as much in our days and that ill-received the valued way to get from place to place.\n\nI have made a mistake putting amount $184 on the place reserved for Quailm, so 23 will be in 240 state.\nSunday School Sup. made a yearly visit—an old gentleman, Mr. Sutherland, and his son's horse \"Charlie.\" We had a buggy which my parents used, but my Brother and I preferred to ride horseback; we used the horse and saddle so much in our daily work that it seemed the natural way to get from place to place.\n\nI have made a mistake, putting answer to 24 on the place reserved for Question 23, so 23 will be in 24's stall.\n25. When was the first car used in the community?\n\nOctober 1910\n\n26. If you owned a car before 1914, when did you buy it?\n\nWhat makes\n\nDid not have one — but we did have a good\n\n27. How far from your home? When we first\n\ncame here, we lived about 25 miles distant.\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\nAfter the C.H.R. came through on its way West Canada\n\nC.P.R. came from Strathcona after a few more years\n\nStrathcona was with Inglewood after a few more years\n\nC.P.R. connected Canada and Strathcona\n\nAbout how many people in the district first started going to town regularly\n\non Saturdays?\n\n30. When (if ever) did people in your district start buying things by mail order?\n\nFarm store trade? But arm came up, department stores began\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since then?\n\nMy earliest recollection of shopping by mail was 18\n\na schoolteacher who traveled at one time but\n\n1875 to 1876 a new retail store for the growing town\n\nand when railroad came in, November, 1876\n\nwinter we sent 5 Colonists on Trains for a few weeks\n\nlate fall Cataloochee, 1876-77 at least 2 weeks some time\n\n3½ and some got an order back from Zoumle, when\n\nthey were located in Winnipeg. Regina, orders came\n\nmuch more quickly. I would have been able to purchase\n\nmany things closer to home had I had a carded store.\n\n32. When did you first have a telephone and what company provided it?\n\nJuly 1910 The Yamnuska Rural Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nHadn't much choice in the matter so I came\n\nwith my family. I had been well paid that\n\nyear in Manitoba and convinced my education\n\nthat idea didn't appeal to me much so my\n\nEduard always was practical about it.\n25. When was the first car used in the community? \n\nAbout 1910. \n\n26. If you owned a car before 1914, when did you buy it? \n\nDid not have one — but we did have a great deal of work and a family. \n\n27. How far from your home? \n\nWhen we first came to town, there was one near us. \n\n28. Did you continue to raise them? (Indicate any changes due to new towns apart.) \n\nLeft better means of travel, etc., \n\n29. How often did you shop it? \n\nOnce a month. \n\n30. What kind of articles did you buy in this way? \n\nFurniture, clothes, groceries, etc. \n\n31. What kind of articles did you buy by mail order? \n\nBooks, newspapers, magazines, etc. \n\n32. When did you first have a telephone and what company provided it? \n\nJuly 1918. The Telephone Rural Telephone Co. \n\n33. Where you come to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then all you had to do was move. \n\nHadn't much choice in the matter as I came with my family. We had been very well treated in Manitoba and couldn't see why we should be treated so unfairly. \n\nEducation was forced at 19 years old.\nQuestion 28 continued\n\n- was only three miles, still later, on that same line a store - Post Office and Elevator were\n- River at Haasten, only one mile away, barns\n- every day, mail, just like living in a city - maybe\n- Roads became roads not just trails the wagon\n- and Buckboards were exchanged for top buggies and\n- Later to cars - but the saddle horse still held\n- an important place\nQuestion 28 continued\n\n— was only three miles, still later on that same line a store — Post Office and Elevator were built at Hassan, only one mile away. Trains every day, mail, just like living in a city — maybe Roads became Roads not just trails, the wagon and Buckboard were exchanged for top buggies and later to cars — but the Saddle horse still held an important place\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few of the early pioneer settlers moved to more settled and older districts. I think in several cases it was the impracticability of securing medical care for their wives and families that caused them to move closer to towns where such services could be found.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, there was no unusual movement; our district was a fortunate one, the land always gave good returns for those who would work it well; there was always some crop failure, but each return was another story.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy public offices were very minor affairs & I believe I was once President of our local \"Lodge Aid.\"\n\nIn the days of \"Local Improvement Districts\" my father was an interested member, and was often in charge of road repair gangs. He was also head of the school board and school trustees. The Wilson-Farley were in charge of Platina Post Office for some years 1910-11-12.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI believe my brother bought the first horseless vehicle in about 1908 (Albert Speer). My husband had the first tractor in our neighborhood 1915.\n\nThe First Farmers Union Building and Bank was built at Todmorden about 1924 all volunteer labor and material.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the last name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur School District - Corning, was suggested by Pat O'Brien who said it was a place in Mayo, Ireland. It was later thought to be his birthplace in Ireland. Many towns, villages, school districts etc., were named by people for the place they previously lived. Sturgis is an example, named by Fred Brooks for Sturgis Michigan. Eden Valley School is another, the old Whitebank Post Office kept by Mr. Paul, was suggested by Whitebank. They a group of people near by, the town of Peaceville was named for the Peace family in whose homestead the town is located.\nA few of the early pioneers settled in the area around 1824. That remains true.\n\nThey have been saying:\n\n\"Who will ever believe it? Impossible! I swear it! What can be done?\"\n\nBut there was a family who did believe it. They came from England and settled here.\n\nNo, they were not unusual people; they were always quiet and hardworking.\n\nMy parents, Mr. and Mrs. Smith, were very active in their community.\n\nIn the days of town meetings and public affairs, they were always present.\n\nAnd when the town hall burned down, they were there to help rebuild.\n\nOur school district was named after them.\n\nPost Office history is another story. It was established in 1877 by Mr. and Mrs. Smith.\n\nPost Office history is another story. It was established in 1877 by Mr. and Mrs. Smith.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few of the early pioneer settlers moved to more settled and older districts. I think in several cases it was the impossibility of securing medical care for their wives and families that caused the ranchers to move closer to towns where such services could be provided.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, there was no unusual movement; our district was a fortunate one, the land always gave back returns for those who would work it well. There was always some crop failure, but each return was another story.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy public offices were very minor affairs. I believe I was once President of our local \"Lodge Aid.\" In the days of \"Local Improvement Districts,\" my father was an interested member, and was often in charge of road repair gangs. He was also Secretary of the School and School Trustee. My mother and father were in charge of Platina Post Office for some years, 1910-11-12.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI believe my brother was the first homesteader within 80 miles in about 1902 (Albert Specht). My husband had the first tractor in our neighborhood, 1918.\n\nThe first Farmers Union Building in town was built at Todmore about 1924 all volunteer labor and material.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur School District - Cooper, was suggested by Pat O'Brien who said it was a place in Mayo. It was later thought to be his birthplace in Ireland. Many towns, villages, school districts, etc., were named by people for the places they previously lived. Sherry is an example, named by Fred Brooks for Sherry, Michigan. Eden Valley District is another, the old White Hawk Post Office kept by Mr. Peel, was suggested by White Hawk's wife, a grove of poplars near by, the town of Preciville was named for the Peace family, on whose Homestead the town is located.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nA few of the early pioneer settlers moved to mine.\n\nSettled and other districts, I think in normal cases it was the unprofitability & securing. Blackhead case for them were not homesteads, that caused the families to move closer to town or other small towns earlier.\n\n5. Did many people move away during the 1930's? Did many return permanently?\n\nNo, there were no unusual movements. Our district was a farming area, the land always gave good returns. In this area, work was hard, there were always some early settlers who died due to the harsh conditions and climate.\n\nMy public offices were very minor offices and my father was an active member and was often in charge of the town hall. In the days of former superintendents and trustees, my father was also the town clerk and treasurer.\n\n37. If you or any of your family members were interested to have or do something in the district mention it here giving date whenever possible. (Such as owning the first automobiles, organizing the first Ladies etc.)\n\nI believe my family was interested in the first automobiles, organizing the first Ladies etc.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, ranches, stations, creeks, hills, etc.) Try to give (1) name, (2) origin and meaning of place name, (3) date and reason for change, (4) date and reason for change, (5) date and reason for change.\n\nOur School District was named by Pat O'Brien who said if we were a place in Ireland it was called \"Ballybreen,\" which means \"many brown valleys,\" where they presumably lived. So we named our school district \"Ballybreen.\"\nQuestion 36 continued\n\nMy husband was most everything known locally.\n\nIn the local school he became a member of the Provincial Legislative Assembly. From 1925-1929, he also served on Municipal Council, was Secretary of the Local Board, President of Telephone Co., and was on Board of Farmers Union.\n\nHe had been organizer, also Battle Organizers and Machinery Co-op. He went to church Conference. He was a strong man in the cause.\nQuestion 36 continued\n\nMy husband was most everything from trustee of the local store to member of the Provincial Legislative Assembly. From 1925-1929, he also served on Municipal Council, was Secretary of the School Board, President of Telephone Co., and was on Board of Farmers Union. Wheat Pool organizer, Machinery Co-op, Layman to Church Conferences. He was a busy man in those days.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nA fire in our home destroyed all articles of that nature.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter [Hester Lois] Mrs Henry Carnwell, former living near Cheltenham Plains,\n\n2 children, Thomas and Robert\n\nDaughter [Alberta Jane McElwee], teacher in Victoria School, Yorkton, Sask.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt is difficult to determine what caused the greatest change in our community; change was so gradual. I suppose Power Machinery was most important in changing the habits of farmers and their wives. I sometimes questioned if it was always a change for the better. We were told by our husbands that no field work could be done much more quickly by \"Power\" than would be done before.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nTime for everyone. In the days of the \"Horse\" era, supper when the chores were done, there was usually a lot of time for gardening, visiting etc., but after the advent of \"Power,\" field work continued until dark and if someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nAfter lights were established in Yorkton, most of the night then of course the men must buy more land in order to support a family. One was supposed four cattle, hogs and one sheep as it was a large place.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nA few in our home destroyed all articles by fire nature\n\nHold you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter Alberta Jane Spellman, teacher in Victoria School\n\nWife Mrs. Henry Carnewell, farmer\n\nChildren, Norman and Robert\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt is difficult to determine what caused the greatest change in our community, change was so gradual. I suppose the machinery was most important in changing the habits of farmers and then bringing some kind of mechanized system along for the better. We were kept by our husbands that as field work could be done much more quickly by \"power\" than by hand the more farming.\n\nPlease give the names and addresses of other persons living in your community.\n\nFor everyone, in the days of the \"House\" era when the chores were done, the house was very clean and tidy. It was a great help to have someone else do the work. The men would go out and catch fish and bring them back to the house.\nThe first horses were not the steam train. Mother had always been a 6-day man, but now she was anxious to travel. She thought the horses were fine, but 5 or 6 days in a horse-drawn cart was just too much work.\n\nAnd the cart was worse. Can't even the cause of many delays. Then there was the general near neighbor who did not visit us often. Sunday drive but we did not visit his place. It was nice to see new places, we could visit near home in winter. Since we left the farm, Hydro has come into the district, that will be another change.\nA straight-grain farm might be different. The first harvests were not the steam binder, rather two affairs today, more was not accomplished in handling them than harvests were often a 'headache,' but to do 'power' justice it did cut down my field work time and the land was worked better.\n\nCars too were the cause of many changes, after their use became general, near neighbors did not visit so often. Sunday drives took us many miles away, it was nice to see new places, we could visit nearer home in winter. Since we left the farm, Hydro has come into the district, that will be another change.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_613.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 40, "total-input-tokens": 66400, "total-output-tokens": 10578, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2042, 5], [2042, 4067, 6], [4067, 5966, 7], [5966, 7294, 8], [7294, 7967, 9], [7967, 8556, 10], [8556, 9151, 11], [9151, 9741, 12], [9741, 12063, 13], [12063, 13214, 14], [13214, 15036, 15], [15036, 15676, 16], [15676, 16806, 17], [16806, 18157, 18], [18157, 18444, 19], [18444, 18835, 20], [18835, 20211, 21], [20211, 21537, 22], [21537, 21951, 23], [21951, 22370, 24], [22370, 24422, 25], [24422, 25551, 26], [25551, 25939, 27], [25939, 26314, 28], [26314, 28935, 29], [28935, 29707, 30], [29707, 32343, 31], [32343, 34068, 32], [34068, 34499, 33], [34499, 34888, 34], [34888, 36973, 35], [36973, 38597, 36], [38597, 39137, 37], [39137, 39734, 38], [39734, 39889, 39], [39889, 40051, 40]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]