[{"id": "68b2e52e8a025af371a236a3a5cd07d90c4edbef", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: Mrs. Margaret A. Scambler\n\nPresent Address: Clair\n\nPioneer Address: Clair\n\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?  \n   Around 18.\n\n2. How often did you usually visit neighbors?  \n   Not too often\n\n3. Did you usually visit on a Sunday, or other days?  \n   Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?  \n   Without invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.?  \n   Afternoon\n\nWhat about meals? Did you stay when not invited beforehand?  \n   Yes.\n\nHow was the invitation to a meal worded when people had come unexpectedly?  \n   (that is, was the term to \"take potluck\" used, or was some other expression common?)  \n   Just an invitation to stay and take potluck.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?  \n   Lunch - cup of tea & food.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?  \n   Both methods\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?  \n   Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.  \n   We had social evenings once a week held in the different married settler's homes. Dances were held in schools and homes with one or two boys playing violins & an organ provided. Were these more frequent in later years? Give dates.  \n   No.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.?  \n   Yes. For the social evenings, dances not so frequent. Had to drive at times 80 miles in order to have enough folk for a good dance.\nPIONEER RECREATION AND SOCIAL LIFE\n\nMEMBER-FAMILY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes? How often did you usually visit neighbors?\n\n2. Did you usually visit on a Sunday, or other days? What time of the day did you go? In the morning and spend the day? Or in the afternoon, etc.? That about meal? Did you stay when not invited beforehand?\n\n3. How was the invitation to a meal worded when people had come unexpectedly? (That is, has the term to \"have排污\" been used, or was some other expression employed?) Great or small? Or did someone stay home to \"look after the place\"?\n\n4. Did the whole family go, or did someone stay home to \"look after the place\"? Did you ever have meals when groups of neighbors came together to put up a quilting, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n5. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. If you have not described these on the School Questionnaire). Give dates.\n\nChristmas trees held at Xmas time.\nBox social about once a year to raise funds for children's Christmas tree. Any committee meeting was held in the school.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\nWhat material was it made of? How large was it?\nWho built it - the community through special funds, the municipality, some organization, etc.? The Community by selling shares.\n\nWas it built in the village or town, or was it a country hall? Village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nAlmost all the original social activities and meetings were held in the hall after completion.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? Usually the best of the situation, fitting them sleep where they could.\n\nHow were horses sheltered and fed in the winter time at these parties? Stables.\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize?\n\nWhat dances were popular? Square, waltz, polka, two step, schottische.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No, the ones who did not dance did not attend.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nYes, some were not in favor of cards.\n9. When was your first community hall built?  \nWhat material was it made of?  \nWas it built in the village or town, or was it a country hall?  \nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings and come to the hall in town for other festivities, or were you close enough to make use of the hall for all gatherings?)\n\n10. What parties, dances, etc., were held in houses, school houses or halls (as referred to in question 9)? Did the entire family attend?\n\nHow were babies and small children provided for during the party?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home or for community gatherings? Explain.\n\nIn favor of cards.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? \n   Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\n   In our district we had a literary society which afforded very good evenings. Lunch was always served at any social gathering.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n   Give the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n   Tell when it was organized, and what steps led to its organization.\n   Approximately what proportion of the farmers in the community belonged to it?\n   How many women belonged? How often did it meet?\n   What were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n   When was it organized?\n   Approximately how many women belonged to it?\n   Describe what you remember of its activities and services.\n12. What attempts at formality, or \"snawk,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the obituary known in your community? \nDescribe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, especially casual and more approximate ideas whenever you can when some changes in visiting or social life became noticeable.\n\nIn our district we had a \n\"friendly society\" which would get \ngood evenings. And was always \npresent at any social gathering.\n\nORGANIZATIONS AND GREETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? \nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? \nTell when it was organized, and what steps led to its organization. \nApproximately what proportion of the farmers in the community belonged to it? \nHow many women belonged? \nHow often did it meet? \nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? \nWhen was it organized? \nApproximately how many women belonged to it? \nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nraffling or dances and socials\n\n19. Where did various organizations hold their meetings?\n\nIn the school - then hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Yes\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the names of such, the dates when it was started, its purpose, and its location (if known). In one relatively small area (for example, within a school district), or if not, enter in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? (On the church, in the hall, etc.)\n\n20. Have you accustomed to having general information lectures, talks on foreign lands, etc.? Describe telling who gave them (local ministers or teachers, special lecturers, etc.), how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-jumping rope, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   *skating & snow forts*\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   *ap*\n\nDid the whole family join in such games, or only the children? Explain.  \n   *Whole family.*\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   *The only time for games was after the chores and homework was done.*\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   *In the snow they would build forts & then have a royal battle with crown balls to take the other fort.*\n\n**PICNICS AND SPORTS.**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   *June 1965*\n\n26. Who organized it?  \n   *Members of the district.*\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   *for the entire community.*\n\n28. Was it the first picnic held in the community?  \n   *Yes.*\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?  \n   *Ball games & races & contests of various kinds, etc.*\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \n   *All the family brought lunches & tables were set.*\n\n31. What did you have to eat and drink?  \n   *Sandwiches, cookies, cake, pie, tea and coffee - milk & water - homemade ice cream*\n\n32. What time of the day did it start, and how long did it last?  \n   *Late A.M. and lasted till close time on the farm.*\n22. What winter games were played outside? (e.g., hockey, skating, etc.)\n\n23. Were games played indoors in winter—card games such as Whist, Pinochle, Rummy or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children learn games connected with such things as buffalo bones, arrowheads, rocks, or other objects or animals, or games in the early days?\n\nIn the snow they could build forts and have a royal battle until both sides were too cold to take the other side.\n\nPIONEERS AND SPORTS.\n\n25. What was the date of the first plow that you attended in Saskatchewan?\n\nGive year and month, if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first plow held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the plow you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\nAll the family brought their own food.\n\nTables were set.\n\n31. What did you have to eat and drink?\n\nSandwiches, cake, pie, tea, coffee—Orville's water—how much?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nIn those good old days we had real community picnics where every family would gather with huge lunch baskets at tables set up all over. Amusements were tall games races contests horse racing Indians joined games races races were done I remember being in the house races team races one I remember being in a race dressed in green with an umbrella on a block ox.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nNow it is all tall games & gambling booths and no real fun.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBasketball and baseball boys and girls played both.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBasketball - Clair & Carneige\n\nWhat year? 1987 How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nBaseball with town Mill Lake Pasquie & Wadena.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nOpen rink, skating and hockey\n\nWhen was the first indoor rink built, and what was it used for?\n\n1946 for curling\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community day, school or Sunday school picnic, family food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in these various games and sports (men, women, mostly young people), basketball, ball and baseball, boys and girls played both.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\n38. Name any other sports teams that were organized before 1914, flying date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n\n1946 for curling\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic? replace\n   Who was responsible for starting the first sports day?\n\n   When was the sports day usually held? (what month, or any special day, such\n   as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known\n   hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the\n   names and authors if possible. If not, tell as nearly as you can how many\n   books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? Whenever possible.\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school text books as additional reading\n   material? Yes.\n7.\n\nA1. Then did an annual sports day become established in your community? Yes\n\nA2. If so, how was it arranged? (Give details)\n\nA3. Was there a special day or event for starting the first sports day?\n\nA4. Are there any from your community who have been members of well-known teams?\n\nREADING\n\nA5. How many of your neighbors brought books with them?\n\nA6. What kind of books did they bring?\n\nA7. Did you buy any books after you came here? Give details.\n\nA8. Were books sent to you by gifts in early years?\n\nA9. Have you ever had any \"travelling library\" books in your community or school?\n\nB1. Was there a school library? Yes\n\nB2. To what extent were books borrowed from the school library for study at home?\n\nB3. Did parents ever use their children's school texts as additional reading material? Yes\n50. Has there ever been a community library in your district or town?  \n   When was it started?  \n   Who started it?  \n   Is it still in existence?  \n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \n   Weekly Free Press  \n   Winnipeg  \n   Grain Growers Guide\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library — how many books it contains, how many people used it, where it was kept, who acted as librarian, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to [place name]?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? \n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nOften had gatherings of young folk who sang solo, duet, and quartets, choirs, etc., in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nOld Kentucky home\nand all the old songs\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Yes. When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? (Give dates, prices if possible, and tell where you bought them.)\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\nWas \"folk music\" or music of the country you came from, popular in your home or community? Explain.\n\n61. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n62. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. In music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in outstanding events connected with it, and a description of the collection.\n\n67. Did you have notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, readings, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1905N-Z_2048.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7227, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1221, 5], [1221, 1221, 6], [1221, 3169, 7], [3169, 4355, 8], [4355, 6504, 9], [6504, 7724, 10], [7724, 9202, 11], [9202, 10589, 12], [10589, 11901, 13], [11901, 13096, 14], [13096, 14948, 15], [14948, 16404, 16], [16404, 18241, 17], [18241, 19431, 18], [19431, 20758, 19], [20758, 21557, 20], [21557, 22571, 21], [22571, 23468, 22], [23468, 24769, 23], [24769, 25766, 24], [25766, 26885, 25], [26885, 27959, 26], [27959, 27959, 27], [27959, 28111, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]