[{"id": "39e14224eac5338abfcee766b4820eb788c2c028", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n_________________________\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA note of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If, for example, there is not sufficient space to answer the question, don't hesitate to give details or describe the particular event. If they are difficult to answer, write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing experience\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... Mrs. Sarah Reaville .......................\n2. Your address ... Racamville ..................................\n3. Date .... May 2nd ... 1952 ......\n4. Where were you born? (Give name of place and country) Township Medora, County Simcoe, Ontario, Canada\n5. What was your father's name and occupation?\n   John Kinghorn, farmer & carpenter\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   17 years\n\n9. What were your reasons for coming West?\n   My sister and her husband were out here, and we came to make a home here\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    We learned through my sister's family.\n1. Your full name: Mrs. Sarah Reavis\n\n2. Your address: Brandonville\n\n3. Date: May 8th\n\n4. Where were you born? County of Simcoe, Ontario, Canada\n\n5. What was your father's name? John Kingham, farmer and carpenter\n\n6. When did you come to Saskatchewan? April 1888\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West? My sister and her husband went out there, and we came to make a home here.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railhead or government information?) We learned through my sister's family.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   My father and mother and sister & brother and myself.\n\n13. What means of transportation did you use?\n   We came by train to Moosomin and we had our implements & our cattle and we had to freight by horses the 20 mile to Rocanville district.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   It was very quiet.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We stayed at Moosomin overnight and hitched up next day to come out.\n\n16. Where did you settle or take up land?\n   We took up land six miles West of Rocanville.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   I worked out a little and my mother went out nursing.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy father and mother and sister & brother\n\n13. What means of transportation did you use?\n\nWe came by train to Moosemin and we had our compliments & our cattle and we had to freight by horse the 20 mile to Rosterville district.\n\n14. First incidents of the journey (lost do you remember? People you met on the way; meetings with Indians, adventures on the journey, etc.).\n\nIt was very quiet\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at Moosemin overnight and hitched up next day to come out and took up land\n\n16. Where did you settle or take up land?\n\nSix miles west of Rosterville\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked out a little and my mother went out nursing.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote quite often to an aunt, my father's sister in Ontario.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was Colin Reavie. We were married on our farm.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nInto a few people.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nWe came together except for my older sister.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI can remember my young man had go to fight to put down the Riel rebellion and he came back safely. The pigs were scraping around the fence and knocked out our yeast off and I had to walk 4 miles to get yeast. I remember the first meal in our new home when we got out of the tent - we had new potatoes and butter and mother's good bread.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe attended everything that went on. We travelled by team and buggy. We used to go at least 7 miles to church. We used to sometimes walk there.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was Colin Reavie. We were married on our farm.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? Just a few people.\n\nWe came together except for my older sister.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI can remember my young man had to fight to put down the Riot Rebellion and he came back safely.\n\nThe pigs were escaping around the fence and knocked out our yeast off and I had to walk 4 miles to get yeast. I remember the first meal in our new home when we got out of the tent - we had new potatoes and butter and mother's good bread.\n\nWe attended everything that went on.\n\nWe traveled by team and buggy. We used to go at least 7 miles to church. We used to sometimes walk there.\n25. When was the first car used in the community?\n   A delivery car.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   About 1912, a Ford.\n\n27. Where was your trading center? How far from your home?\n   Mosomin, 28 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   We traded there for some time after Rockville town began.\n\n29. How often did you shop in the early days?\n   We shopped once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About the time the cars began.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   I haven't started yet.\n\n32. When did you first have a telephone and what company provided it?\n   About 1910.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we brought everything with us at first.\n25. When was the first car used in the community?\n\nAbout 1912, a Ford.\n\n26. If you owned a car before 1934, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\nMissouri, 28 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\nWe traded there for some time after\n\nPrairiville town began.\n\n29. How often did you shop in the early days?\n\nWe shopped once a week.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\nAbout the time the cow began\n\nI haven't started yet.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\nAbout 1910.\n\n33. When you came to Saskatchewan the first time was it with the idea of settling\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nYes, we thought everything with so much fear.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nThey all stayed.\n\n35. Did many people move away during the 1930's? Did many return?\n\nWe had good back bone, and we stayed with what we had.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy husband's brother Jack Reavie was a member of the first Orange lodge in our district and helped build it. We owned the first automobile in our neighborhood.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (2); (2), (3).\n\nOur local post office was named Rocanville after Mr Henry Rocan Bastien who drove the mail from Moosomin to Redpath those days. Mr. Bastien had partly studied for a doctor and taught his wife a half-breed so she went out nursing. Mr. Bastien originally worked for the Hudson Bay company and was a Frenchman.\nThey all stayed.\n\nMy husband's brother Jack Reavil (Reavil) was a member of the first Orange Lodge in our district and helped build it.\n\nWe owned the first automobile in our neighborhood.\n\nOur local post office was named Reaville after Mr Henry Reavil who drove the mail from Miramichi to Redpath three days. The Reavil had partly studied for a doctor and taught his wife a half-breed, so she went out nursing. Mr. Reavil originally worked for the Hudson Bay company and was a gunsmith.\nOur district or neighborhood belongs to the first Homemakers club in Rock. Mrs. Sherman Harrison is secretary. Roanville Club. We have a number of old members today but keep them.\n\n(1) We would lend them to the Historical Association for anything.\n(2) We would lend them to the Archives Division of the Legislative Library, Raleigh, or the Archives Office at the University in Greensboro.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Annie Loomby Wilson\nRoanville, N.C.\n\nFor an interesting account please write.\nOur district or neighborhood belongs\n\nto the first Homemakers club in church.\n\nMrs. William Newman is honorary\n\nKearneyville hostess at a summer\n\nmeeting.\n\nA. Johnson - (signature) also\n\nfilled the position.\n\nMrs. Ed. (signature) was\n\npresident.\n\nJust after the war, there was a great\n\nmovement toward\n\nthe church, new members,\n\ntelephone and now the Kepler\n\nis coming.\n\n---\n\nI want a few photos I wanted to be\n\nwilling to lend if needed. Thanks, many of them\n\nwere through Kearney\n\nMrs. Annie Kearney Wilson\n\nKearneyville school\n\n---\n\nGet our interesting account please.\nMy experience on the Homestead\n\nOne experience I remember distinctly was when my youngest son, aged 2 1/2 years fell into a 14 foot well and the only circle was in the centre. He dropped the pail and rope in and I had nothing but the box on top of the well to hold on to. I held on with my two hands and kicked but I could not find that circle. Then I let go of one hand, my toe touched the circle and I had courage enough to let go with both hands and I felt I was getting from somewhere and I landed on that circle and turned my face around with my face to the water where my baby was floating. The water was up to my knees as the circle was below water. I held him with his little head down and worked his arms, calling for help. When help came from the far field, I handed up my baby which went in a little lump pile on the grass, then my husband lifted me at 3 P.M and it was 6 P.M when he breathed. He went to the war in 1914-1918. Came home safely and married Miss Constance Dryden Legore, men with me and raised 4 fine teacher Allan that was boarding with me and raised 4 fine boys. They are all farming here in the Roconville District. Their names are as follows at this date May 3/52.\n\n(Jack) John Reavie\nWilford Colin Reavie\nDonald Reavie\nBrian Reavie\nOne experience I remember distinctly was when my youngest son aged 2 & ½ years fell into a 14 foot well and the only circle was in the centre. He dropped the pail and rope in and I had nothing but the box on top of the well to hold on to. I held on with my two hands and strained but could not find that circle. Then I let go of one hand, my toe touched the circle and I had courage enough to let go with both hands and felt I was getting firm somewhere and I landed on that circle and turned, my face around with my feet to the water, where my baby was floating. The water was up to my knees so the well was below water. I held him with his little head down and worked his arms calling for help. When help came from the far field, I handed up my baby which went in a bulk lump pile on the grass, then my husband lifted me at 3 P.M and it was 6 P.M when he breathed. He went to the war in 1914-1918 Camps, hospital and married the teacher. He was a good worker and raised 4 fine boys. They are all farming here in the Rockville District. Their names are as follows:\n\nJack John Reavey\nDonald Colin Reavey\nBrian Reavey", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_417.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4871, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2002, 5], [2002, 3664, 6], [3664, 5021, 7], [5021, 5831, 8], [5831, 6898, 9], [6898, 7910, 10], [7910, 9260, 11], [9260, 10392, 12], [10392, 11650, 13], [11650, 12819, 14], [12819, 14323, 15], [14323, 14810, 16], [14810, 15394, 17], [15394, 15966, 18], [15966, 17229, 19], [17229, 18345, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]