[{"id": "fadb40f5c31f5362cde0ebfb7da68a4979db7d32", "text": "S-X2\n408. Lee (Mrs. John Smith)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions will apply to most everyone; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaires.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n☐ All questionnaires\n☐ Pioneer diet\n☐ Pioneer schools\n☐ Pioneer churches\n☐ Pioneer recreation and social life\n☐ Pioneer farming experiences\n☐ Folklore in Saskatchewan\n☐ Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as others. Some of the questions can here be answered by anyone, but others may prove impossible for you to answer, so don't worry about leaving blank spaces. Don't hesitate to give details, or describe particularly memorable experiences.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. JOHN SMITH LEE\n\n2. Your address: HAZEL COLLEGE\n\n3. Date: 1/19/46\n\n4. Where were you born? (Give name of place and country): JOHNSON GLASGOW SCOTLAND\n\n5. What was your father's name and occupation?: MILL MANAGER\n\n6. When did you come to Saskatchewan? (Give month and year): 1885 MAY\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): I was 10 years old\n\n9. What were your reasons for coming West?: My family had quota a large family of children living in Canada from Scotland.\n\n10. How did you learn about the West? (Through other people? Reading about it? Rail road or government information?): Of old and new world stories.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: MRS. JOHN SMITH, A.S.S.\n2. Your address: HAZEL COLLEGE.\n3. Date: October 1, 1954.\n4. Where were you born? (Give name of place and country): JOHNSTON, GLASGOW, SCOTLAND.\n5. What was your father's name and occupation?: FLOCK MILL MANAGER, John Smith.\n6. When did you come to Saskatchewan? (Give month and year): 1885 MAY.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates and duration of stay: [Handwritten text not legible].\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" etc.). I was nine years old.\n\n9. What were your reasons for coming West? [Handwritten text not legible].\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)? [Handwritten text not legible].\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nFARMING\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nOur own family\n\n13. What means of transportation did you use?\n\nBy rail\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNone\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nGriffiths, Weyburn\n\n16. Where did you settle or take up land?\n\nMeadow City, Saskatchewan\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n\n---\n\nMy father was presented with a very good first gun before becoming a bachelor & we fished among your fish lake & chicken dinners\n\nWe had our church by own faith & even though we did arrive our neighbors...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n---\n\n**Handwritten Notes:**\n\n- **19.** How often did you write to relatives or friends in your old home?\n  \n  *Staid at home at first till our Grandparents passed on.*\n\n- **20.** If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n  *John Smith. She died April 1900 at home.*\n\n- **21.** Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n  *A uncle owned a large farm.*\n\n- **22.** If other members of your family (brothers, sisters, parents, etc.) came West when they came and where they settled.\n\n- **23.** Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n  *My mother was presented with a very good shirt just before becoming ill and we thought it amazing you could make a chicken dinner.*\n\n- **24.** Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n  *We could not travel far with oxen and we had our church by our faith alone enough we did arrive. Our neighbors...*\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make? From whom?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy by this way? Indicate also what proportion of your total purchases were by mail order, and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make? From what land?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Sibley County? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return? People did not\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates where possible (such as owning the first automobile, constructing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person who gave place-name; (2) origin and meaning of the name; (3) date of adoption; (4) any changes in names since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n\nLittle Owl Creek School District is close by\n\nMr. Little Owl Creek\n\nOld Owl Creek Post Office got its name from the owl hills on them. I'm sure I'm wrong with that. But Mr. Little Owl Creek who had the Post Office in his home gave it its name over fifty years ago.\n24. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return? People did not\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends are still taking in the district mentioned (such as owning the K.I.T. property), etc., please note.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting name; (2) origin and meaning of the name; (3) date of the name; (4) any changes in name since the first name was given; (5) charge. Give facts of new name as above in (1), (2), (3).\n\nLittle Oak Creek School District is close by.\n\nOakland City Post Office got its name from the rich hills on which it stands. The land was owned by Mr. Oakland who had the post office named after him. It was originally named after him.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, or the Archives Office of the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n39. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries,\n   old letters, old photos and programs, minute books of organizations,\n   old photographs, written recollections and reminiscences? (describe).\n\n40. Would you or the person who owns them either:\n   (1) be willing to lend them to the Provincial Archivist for copying?\n   (2) be willing to present them to the Archives Division of the Legislative\n       Library, Regina; or the Archives Office at the University of Saskatchewan?\n\n41. If you have children or grandchildren, please give their names, where they\n   live and occupations.\n\n42. What do you think are the most important changes in your community by\n    first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person\ngive name and address here!\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_408.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4321, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 32, 4], [32, 1634, 5], [1634, 3148, 6], [3148, 4356, 7], [4356, 5565, 8], [5565, 6238, 9], [6238, 6994, 10], [6994, 7878, 11], [7878, 9665, 12], [9665, 10662, 13], [10662, 11526, 14], [11526, 12747, 15], [12747, 13850, 16], [13850, 14804, 17], [14804, 15761, 18], [15761, 15914, 19], [15914, 16065, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]