[{"id": "2732b7aa98d1c1bdbe78f2ed6b20096f9c1dfb3c", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; other may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES; A GENEAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Cayford Guy H.\n2. Your address: Neikburg, Sask.\n3. Date: Oct. 10th, 1962.\n4. Where were you born? (Give name of place and country): Minnesota, U.S.A.\n5. In what year was your father's name and occupation? Howard H. Cayford.\n   He was a farmer, rancher, and a railroad engineer.\n6. When did you come to Saskatchewan? (Give month and year): August 1903.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: 30 miles away Medicine Hat on the Bow River.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? (If you could not have answered this question had you not been compelled by a few years and the urge a lot of adventure in the U.S.A about the wonderful County west of Manitoba called the North West Territories of Canada, so my Dad took a few land entries off the town of MINEAPOLIS in 1902 & 1904.)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWith whom we left the River County in 1905:\n\nJoe Went to school by Wagon Train, and our main source of information was taken from a book published in Ottawa called \"Down of Canada Surveyors Notes.\" It gave a good description of the County, the lay of the land, lakes and rivers, and of course, named a river named Palliser.\n\nPalouse Tryangle.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Cayford Guy H.\n2. Your address: Meikburg, SASK.\n3. Date: Oct. 10th, 1962.\n4. Where were you born? (Give name of place and country): Minnesota, U.S.A.\n5. In what year was your father's name and occupation? Howard H. Cayford.\n6. When did you come to Saskatchewan? (Give month and year): August 1905.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: 80 miles west of Medicine Hat on the Bow River.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? (What will you find in Canada? From U.S.A. in 1904)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWith whom did you travel to the New River County in 1905?\n\nTo the West to school by Wagon Train, and our main streets information was taken from a book published in Ottawa called \"Down to Canada\" by Mr. Guy, the top of the land label and discipline of the country, the top of the land label and trees, and of course.\n\nPalmer Tinyangle.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy Dad and I thought we came up to 50 miles from the town of Delta, BC.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nYes, we traveled with my Dad and I.\n\n13. What means of transportation did you use?\n\nWagon and saddle horse.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe met many people along the way, but we had to be friendly.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAbout 12 miles south of Waskamino.\n\n16. Where did you settle or take up land?\n\nOn the west side of the river.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo other permanent residence just liquid and Calgary.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nDad worked on the railroad. He also farmed and homesteaded in Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy Dad and Mother came via train. We traveled by train.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nWe traveled by train.\n\n13. What means of transportation did you use?\n\nTrain\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe trip was very long and tiring. We met many interesting people along the way.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAbout 12 miles south of Wadena, Saskatchewan.\n\n16. Where did you settle or take up land?\n\nS.W. 1/4 of the 34-49-26 W4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAbout 1 mile from Edmonton, Alberta, and Calgary.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nDad worked on the railroad. He also farmed and raised cattle.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe 350 mile trail by wagon train\n\nThe Hard Winter of 1904-05\n\nThe Big Rainy Year of 1905\n\nThe Organizing of the First School District\n\nThe first schoolhouses and its local Improvement District\n\nThe organizing of the Protestant Miners' Aid Society\n\nTravelling by wagon, buggy or horse back or on foot.\n19. How often did you write to relatives or friends in your old home?\n\nLittle Glen, Mother was a school teacher.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried, Gloria Mitchell, at Las Huesos.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\nYes, we would stay there too.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nWe all came to settle there in 1904 and we paid our arrival and then we bought land by 1910.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe 350 Mile Trail by Wagon Train\n\nThe Hard Winter of 1904-05\n\nThe City Butte Fire of 1905\n\nThe Organizing of 5th First School District\n\nThe first cornfields and the local Improvement District\n\nThe organizing of the irrigation movement in 1906\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur nearest town was 20 miles, but traveled there about once a week, more than a radius of about 40 miles to visit or go to church, actually about 10 miles and we traveled by wagon, buggy or horse back or on foot.\n25. When was the first car used in the community? about 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? KASHBAIRN, 2 mi.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo, not after 1923, when the CPR came in from Wilkie to Lily Lake.\n\n29. How often did you shop in the early days? From the 1905-6, 1949 housed\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? about 1923, when the CPR came along.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe bought from The Eaton Co.\n\nFrom 1905 till the present day, the Eaton's Catalogue was the only way the\n\n32. When did you first have a telephone and what company provided it? Telephone Panel to be installed by 1919 + 20.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe intended to stay but were tired of travelling.\n25. When was the first car used in the community? About 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? K.A.S.H. Baur N. 20 M.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo, not after 1923, when the CPR came\n\n29. How often did you shop in the early days? (Has the 1905-6 1907 heard\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAbout 1923 when the CPR came\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nWe bought from The T. Eaton Co.\n\nFrom 1904 till the present day they\n\nThe Eaton's catalogue was the only way the\n\nCustomers in the early days could do their\n\nown shopping, although they clothing and shoes\n\nwould probably rely more on Mail Order\n\nConvenience\n\n32. When did you first have a telephone and what company provided it?\n\nThe National Canada Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe intended to stay but were tired of travelling\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, there were many who moved away.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo, they moved away.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a local post office clerk from 1942 to 1955.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nMy dad helped to organize the first Melton District, being WELLS School No. 1496 in the year 1906.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nNEIL BURGE got the name of Neilson Burge. He had a little store in the spring of 1905; he landed his supplies from Butteville. He called his place NEILBURGE and Selma District was called Mulberry and New Town of Millburg.\n5. Did any people move away from your district prior to 1947? What reasons did they have for moving?\n\nYes, there were several who moved away.\n\n6. Did many people move away during the 1930s? Did many return?\n\nNo, this seemed to be a period of decline.\n\n7. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a local post master from 1942 to till about 1955.\n\n8. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new names above in (1), (2), (3).\n\nNEILBURG got its name from a homestead by the name of Neil Burdick. He had a little store in the spring of 1905; he bought his supplies from Bettlesford. He called his store NEILBURG and joined the Town of Milburg.\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nYes, old records in local school district.\n\n1907. Newly born our first child my name was\n\nQuintus James Hill. (Signature)\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and their occupations.\n\nMy brother and his wife lived here by Wayne and Louise. They were married to boys and girls. There is two boys left in this district now living in Montana, one lives in Hamilton and one girl in the city of Regina. We moved out in 1943 and 4. The CPR coming to the district and West?\n\nLi Fulfillment\n\nThe automobile.\n\nHigh Power Liberal Unit\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Williams, NEIL BURG, Tom Shy and NEIL BURG.\n\nVERNON MEAGHER, Lloydminster, Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(I indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905A-F_830.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4978, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1620, 5], [1620, 3239, 6], [3239, 5065, 7], [5065, 6544, 8], [6544, 7600, 9], [7600, 8624, 10], [8624, 9598, 11], [9598, 10942, 12], [10942, 12290, 13], [12290, 13747, 14], [13747, 15146, 15], [15146, 16232, 16], [16232, 17686, 17], [17686, 18673, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]