[{"id": "a339bedcd799111c07c5a05b0efb0805dcb6b33e", "text": "It is difficult to prepare a general questionnaire in pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra sheet of paper if there is not sufficient space to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire for pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces or writing extra sheets of paper. If there is not sufficient space to answer the questions, hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1942, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Expect?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1892. Standen, Mr. John Ronald\n1222 Pandora Avenue, Victoria, B.C.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: JOHN RONALD STANDEN\n2. Your address: 1222 PANDORA AVE., VICTORIA, B.C.\n3. Date: February 19th, 1954\n4. Where were you born? (Give name of place and country)\n   MINESING, ONTARIO, CANADA\n5. What was your father's name and occupation?\n   WILLIAM JOHN STANDEN\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens,\" etc.)\n   I was in my teens.\n\n9. What were your reasons for coming West?\n\nIn the fall of 1898 we purchased land near the townsite of Saskatoon, Saskatchewan. We moved there in 1898 and in 1899 we built our house and started farming. We had a good harvest in 1899 and 1900 and a home.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nIn the fall of 1898 we purchased land near the townsite of Saskatoon, Saskatchewan. We moved there in 1898 and in 1899 we built our house and started farming. We had a good harvest in 1899 and 1900 and a home.\n\n11. Did you have any difficulties in settling? How did you overcome them?\n\nWe had a hard time at first because of the harsh weather conditions. However, we persevered and eventually became successful farmers.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: JOHN RONALD STANDEN\n2. Your address: 1222 PANDORA AVE., VICTORIA, B.C.\n3. Date: February 19th, 1954\n4. Where were you born? MINNESOTA, U.S.A.\n5. What was your father's name and occupation? WILLIAM JOHN STANDEN\n6. When did you come to Saskatchewan? (Give month and year) 8/9/99\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n\"I was in my teens\"\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n11. Railroads at government invitation, family moved to Redcliff.\n11. What did your friends and relatives think of your decision to come to Eastern Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? We traveled with the family.\n\n13. What means of transportation did you use? The CPR train.\n\n14. What incidents of the journey West do you remember? People you met on the train, meetings with Indians, accidents or other events.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? Weyburn, Assiniboia\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Our family moved back to Ontario for one year.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n19. How many families moved to Canada in 1856 and 1865 and arrived in Weyburn? Six families moved to Weyburn in 1856 and five families moved there in 1865.\n\n20. Were any of your family members married at the time? Yes, our parents were married.\n\n21. After later moved to Abagab Bath.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought that was a good idea - Aunt was looking for a quiet place and I didn't have a job.\n\n12. Did you travel by yourself or with a party (family, friends or other people)? Yes, we traveled with a group of friends.\n\n13. What means of transportation did you use? We used a horse-drawn carriage.\n\n14. What incidents of the journey do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other exciting events).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. There did you settle or take up land? We settled in Assiniboia.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Our family came from Ontario, then back to Canada for a year. We then came back to Ontario on the Regina - Brandon line. The railway was graded last fall.\n\n18. How did you earn a living before coming to Western Canada? How after you came? We were farmers with a housekeeper and 5 acres until we were married. Then we moved to a homestead near Weyburn. After that, we moved to Obago Bash.\n19. How often did you write to relatives or friends in your old home?\n\nEvery 3 weeks, usually.\n\n20. If you got married, give the name of your husband, or wife along with the date:\n\nMay 8, 1917\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\nMy brother and my mother, and my aunt's husband came to Kindersley Park, and my uncle's family came to Kindersley Park, and my aunt's family came to Kindersley Park, and my uncle's family came to Kindersley Park.\n\n22. Tell when they came and where they settled.\n\nMy younger brother moved there in 1907 and my wife's brother arrived in 1907.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOur food was very scarce during the first year, but we had enough to eat. We had no meat, but our potatoes were very good and we had plenty of fish. The weather was very cold and we had to build a fire and cook our food outside. We also had to get wood for fuel and heat our homes.\n\n24. What was the most difficult part of your life in the early days?\n\nThe most difficult part of our lives was getting enough food to eat and keeping warm during the winter months.\n\n25. Did you travel about much in these early years? (For business, attending church, visiting friends, etc.)\n\nYes, I traveled quite a bit. I visited friends and attended church regularly.\n\n26. What was the most important thing you learned from your experiences?\n\nThe most important thing I learned was to be resourceful and to work hard to provide for my family.\n\n27. What do you think has changed since then?\n\nSince then, technology has improved and transportation has become easier.\n19. How often did you write to relatives or friends in your old home?\n\nAnswer: Occasionally.\n\n20. If you got married, give the name of your husband or wife along with the date:\n\nMarriage date: [Date]\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nName(s): [Names]\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west:\n\nTell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n\n[Description of experience]\nand drew the country for their choice of land.\n\nWe remained particularly at our hard rowing back\nwith a flatboat partly full. They had found\nthe block was not badly swollen and we could not\nmake a crossing that day. We had been there before.\n\nActing to us in those early days, who saw the thing\nhad a right to differ from us and if I was taken\nin the future, I had to see if they repented of their\npioneer days and that old rule should never\nbe in the Sarah Archives.\n\nA great difficulty was finding well water\nafter digging through the first 12 feet of yellow\nclay a 6-inch, nut-berry black or dark chocolate\nclay was encountered and if water was not found\non examining by this, we could dig another 50 or 60\nfeet before coming to a layer of sand which\nought to be quite dry. Above water, we generally\nencountered a shortage of breath and scarcely\ntried to change places with the man\nat the top of the hill. We did not know or realize\nthat this way caused by the gas in the hole all the\nwe knew that ours had been their lives.\n\nThe similarity from gas in wells.\nand never the curiosity for their choice of land.\n\nWe remained here particularly one hardy company back\nwith a few block off. They had found\nthe block was half buried—therefore fearing that the\nsand would not be able to hold up and we could not\nstay there. We decided that if we had been forced to\nstay there in those early days, who knew the thing\nwould have been done by now. The thing\nhad a chance to die out after forty years it was taken\nto the States. I heard in one of my reports of those\npioneer days and they will all be remembered.\n\nAs... The Sand Archives\n\nA great difficulty was finding well water\nafter digging through the first 12 feet of yellow\nclay a tough, muddy black or dark chocolate\nclay was encountered and if water was not found\non burying it. This we only did another 50 or 60\nfeet before coming to a layer of sand which\ncaught our attention—have water! We previously\nthought at that point a depth, a difficulty of\nworking was a shortage of breath and finally\nfinding no way to change places with the man\nat the top of the hill. We did not know an answer\nthat way caused by the gas in the hole all the\nwe knew was that once the horse lives\nin the boundary from gas in wells.\n25. When was the first car used in the community? 1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Estimate the total fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order subsequent to your decision.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision? I came with the intention of staying\n\nas I found out later there was a certainty in the\n\nfuture.\n25. When was the first car used in the community? 1909\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better roads or travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. That kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Have you had any trouble with the authorities regarding your activities as recorded at this place over a certain period of time?\n\n35. When did you first have a telephone and what company provided it?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some members of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any friends were members of any clubs, societies, associations, etc., give details.\n\n38. How did the phrase in your community get its name? (School districts, post offices, villages, etc.)\n\n39. Why was the school named after the prominent person?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nI had my young family left back in 1913 as I was anxious to live in a milder climate. We came to British Columbia via Kelowna in the Okanagan Valley and engaged in fruit farming. We stayed there 8 years when we came to Victoria to retire from active work at the age of 76.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI and my neighbors, Mrs. W. Gibson, formed the West Weyburn School District. I was chairman and secretary but do not recall any details. When we moved to Orange in 1905 I held the same positions there, where the village and surrounding district built their first school and I was a member in having a windbreak planted surrounding the first automobile, combine, organizing the first lodge, etc.\n\nThe acre of ground I also planted a windbreak on C.P.R. grounds adjacent to the station. The remains are probably there yet as well as the school windbreak. It was a fine first winter and a justice of the peace and, as we had formed a\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n\"Local Option\" district. I had lots of trouble in trying bootleggers and co-operating with the R.C.M.P.\n\nOne hotel man at Fillmore in my district broke the liquor laws & I fined him. Later he brought a case against a neighbor. I asked him if he would prefer another magistrate (Justice of the Peace); he replied \"No, I got Justice last time & you'll see I get it now!\"\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, old books of community organizations and reminiscences? (Describe.)\n\nIncluded in this package of materials from J. R. Standon (Neville) of Victoria, B.C.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any) ………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne son \"St. Columb Washington Standen,\" b. 1890, Pittsburgh, Pa., 2 daughters \"Shirley Standen,\" b. 1892, Pittsburgh, Pa., 2 daughters \"Beulah Standen,\" b. 1895, Pittsburgh, Pa.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n6. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections, etc., which would be of interest to the Provincial Archivist? If so, please provide details.\n\nWould you or the person who owns them be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes\n(2) No\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nOne son, \"Sr. Calvin Washington Brandt,\" age 89, Pittsburgh, Pa.; 3 daughters, Shirley, Shirley, Shirley, and Shirley, age 89, Pittsburgh, Pa.; and Beverly, age 89, Pittsburgh, Pa.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1899_598.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5506, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1777, 5], [1777, 3673, 6], [3673, 5464, 7], [5464, 6292, 8], [6292, 7348, 9], [7348, 8508, 10], [8508, 10205, 11], [10205, 10784, 12], [10784, 11847, 13], [11847, 13046, 14], [13046, 14147, 15], [14147, 15261, 16], [15261, 15850, 17], [15850, 17861, 18], [17861, 19152, 19], [19152, 20134, 20], [20134, 20289, 21], [20289, 20443, 22]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]