[{"id": "e0a9d8c4fea17f3ad40f9b33b91a5e70d3c769bb", "text": "WHAT DID EARLY CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. L. Stratford\nAddress: Ridgedale, Sask.\nBirthplace: Ontario, Canada\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in eastern Canada? 1918\nWhere did you set up housekeeping? 24 miles north of Star City\nWhere had you been living before that? Montana\nFor how many people did you prepare meals? 10 and varied at times\nHow far was it to your nearest store? 3/4 mile\nHow often could a visit be made to the store? Every 2 or 3 weeks or so\nWhat groceries did you usually buy in those earliest years? Flour, sugar, salt, Royal Yeast Cakes, evaporated fruit, soda, corn starch, corn meal, tea, baking powder, oatmeal, coffee, soda crackers, cocoa\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Radium\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? 5¢\nHow much did you use graham flour? 10 lbs\nWhole wheat flour? No\nWas flour milled locally? No\nHow far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? about 40¢\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? Yes\nFarina? Yes\nOther? Oatmeal\nDid you grind your own wheat for porridge? Yes\nHow did you grind it?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 25 lb. bag.\n\nWhat was the price for a ten pound sack of white sugar? $1.45.\n\nWhat brand of golden corn syrup did you use? None.\n\nWhat size of tin of syrup did you usually buy? 1 lb., 2 lb., 4 lb.\n\nAt what price? $1.00, $1.50, $2.00.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From cows.\n\nDid you have cows? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? No.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork or bought.\n\nHow did you get fresh meat? Butchered and kept in summer.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? In brine or dry salt.\n\nWas there a \"beef ring\" in your neighborhood? Not until in the 1930s.\n\nIf so what year was it organized?\n\nDid you use game? Some.\n\nWhat kinds? Turkey, a little.\n\nFor how long?\n\nWhat part did fish play in the family diet? Didn't have any.\n\nWas the fish fresh, cured, or canned? Cured.\n\nKinds? Herring mostly.\n3. **BUTTER AND BUTTER PRODUCTS**\n\nIn what quantity did you buy butter? (Give number of pounds.) \n\nWhat was the price per pound? \n\nWhat kind of butter did you usually buy? \n\nAs what percent? \n\n4. **BUTTER PRODUCTS**\n\nFor did you get a supply of fresh milk in the early hours? \n\nDid you buy butter? \n\nThat was the price of butter? \n\nDid you pay extra for butter? \n\nDid you make butter? \n\nWhat kind of cheese? \n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early hours? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"meat\" place in your neighborhood? \n\nDid you use meat? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, canned, or smoked? \n\nKilogram...\n6. BEVERAGES\n\nWhat kind of tea did you buy? ......................... At what price? 25¢ black.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Gold nearly beans.\n\nPrice? 40¢ per lb. That other beverages were used? None.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 25¢\n\nCould you get potatoes at the store? ................. If not, where from? Neighbors'.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1912. Cabbage bright. Carrots 1912. Onions ...........\n\nTurnips 1912. Beets 1912.\n\nIn what quantities did you buy white navy beans? 1/2 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By box.\n\nWhat weight? 2 lbs. How did the grocer handle prunes (by box)? Yes.\n\nWhat was the price of prunes? 1.3¢ a lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas? ........... corn? .......... beans? .......... Saskatoons? .......... other foods?\n\nWhat year did you first preserve fruit by canning? 1912.\n\nWhat year did you first preserve vegetables by canning? .............\n\nWhat year did you first preserve meat by canning? .............\n\nDo you still preserve foods by canning or drying? Yes - by canning\n\nTo what extent? Not much now.\n\nDid you make your own vinegar? No.\n6. **BEANS**\n\nWhat kind of beans did you buy?\n\nThat kind of beans did you buy? (beans or peas)\n\n**Answer:** Beans\n\n7. **VEGETABLES AND DRIED FRUITS**\n\nWhat was the price of potatoes per bushel when you last bought them at the store?\n\n25¢\n\nCould you get potatoes at the store?\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes: 1912\n\nCabbages: 1912\n\nTurnips: 1912\n\nBeets: 1912\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes? (in bulk or by the box)?\n\nWhat was the price of prunes?\n\nThat was the price of prunes.\n\nWhat other dried fruits did you use in the simplest form (apricots, peaches, loganberries, raisins, currants, etc.)?\n\n8. **PRESERVING**\n\nIn the early years did you preserve any foods by:\n\npeas?\n\ncorn?\n\nother foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n9. Please fill in the following by the day of each week:\n\n| Food                  | First time seen in store | How was it sold? - In bulk, 10 lb., can, etc. | Amount you usually bought at one time | Price of this amount |\n|-----------------------|--------------------------|-----------------------------------------------|--------------------------------------|---------------------|\n| Soda biscuits         |                          |                                               |                                      |                     |\n| Macaroni              |                          |                                               |                                      |                     |\n| Graham flour          |                          |                                               |                                      |                     |\n| Brown sugar           |                          |                                               |                                      |                     |\n| Molasses              |                          |                                               |                                      |                     |\n| Table salt            |                          |                                               |                                      |                     |\n| Common salt           |                          |                                               |                                      |                     |\n| Lily white syrup      |                          |                                               |                                      |                     |\n| Toilet soap           |                          |                                               |                                      |                     |\n| Baking powder         |                          |                                               |                                      |                     |\n| Baking soda           |                          |                                               |                                      |                     |\n| Dried peas            |                          |                                               |                                      |                     |\n| Dried corn            |                          |                                               |                                      |                     |\n| Vinegar               |                          |                                               |                                      |                     |\n| Raisins - seeded      |                          |                                               |                                      |                     |\n|                       |                          |                                               |                                      |                     |\n| Rice                  |                          |                                               |                                      |                     |\n| Currents              |                          |                                               |                                      |                     |\n| Store jam - kinds?    |                          |                                               |                                      |                     |\n| Cheese (Cheddar or store cheese) | |                                               |                                      |                     |\n| Vanilla               |                          |                                               |                                      |                     |\n\n10. Baking\n\nWhat type of yeast did you use? Royal Cake\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n| Item                  | Price |\n|----------------------|-------|\n| Soda Water           |       |\n| Horseradish          |       |\n| Graham Flour         |       |\n| Brown Sugar          |       |\n| Molasses             |       |\n| Table Salt           |       |\n| Common Salt          |       |\n| Lily White Starch    | 80¢   |\n| Yeast                 |       |\n| Baking Powder        |       |\n| Yeast Food           |       |\n| Bread Pan            |       |\n| Bread Pan Liner      |       |\n| Yeast                |       |\n| Raisins              |       |\n| Raisins - Seedless   |       |\n| Rice                 |       |\n| Currants             |       |\n| Store Jam - Kitchen  |       |\n| Cheese (Cheddar or    |       |\n| Store Chopped)       |       |\n| Vanilla              |       |\n\n**Q. BAKING**\n\nWhat type of yeast did you use? **Dry Yeast**\n\nDid you make yeast for your own use? **No**\n\nUsing starter? **Yes**\n\nUsing hops? **Yes**\n\nSalt raising? **Yes**\n\nDid you buy baking powder? **Yes**\n\nDid you make your own baking powder? **Yes**\n\nOwn of texture? **Yes**\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                              |                                                |\n| Canned sardines             |                                        |                              |                                                |\n| Other canned fish that appear early - give names |          |                              |                                                |\n| Apples - fresh              |                                        |                              |                                                |\n|                             | dried                                  |                              |                                                |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                 | 1906                         |                                                |\n|                             |                                        | 10¢ can                      |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |          |                              |                                                |\n| Pearl tapioca               |                                        | 1900 or earlier              |                                                |\n| Minute tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Walnuts                     |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...................................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nLater we dug deep wells but water was hard and unpleasant taste but lots of it.\n\nLater years we had ice from river for drinking purposes. Lots of rainwater always.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, cistern, dugout)\n\nIf so far was this water from your house? (not far, fairly far, quite far)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nWas any filtering or other treatment necessary?\n\nFirst start local housekeeping, either at sea where possible.\n\nLater we dug deep wells but lots of it and unpleasant taste but lots of it.\n\nLater we had ice from river and rainwater for drinking purposes. Lots of rainwater always.\n13. SOAP\n\nDid you buy laundry soap or make your own? Bought or made at times.\n\nIf you made your own, did you use lye? Yes.\n\nWhat kinds of laundry soap did the grocer handle? Sunlight, Pearl.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Lots of wood.\n\nWhere did you get your fuel? Land covered with it.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. We still have plenty of wood but you can hardly get anyone to get it out.\n\nPrice is $8.00 to $10.00 a cord when they do.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ??\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ??\n\nBy whom was your first cook stove made? Bought from Eaton's, later we had a malleable iron made in USA bought about 1920 much better.\n\nWhat year was it purchased? 1919. Price? $25.00.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron and iron also I think granite ware or enamel.\n\nFor preparing food? (china, earthenware, wooden bowls, other) China, Earthenware.\n\nWhen did you first see enamel ware? Aluminum? Still have, bought in 1913 but may have seen it before that.\n13. STAPLES\n\nDid you buy laundry soap or make your own? (Describe method if so)\n\nIf you used radio, how did you get it? (Describe method)\n\nWhat kind of laundry soap did you use?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (Describe method)\n\nHave you ever used any other fuels? (Describe method)\n\nHave you ever used any other fuels? (Describe method)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or back oven? (Give dates)\n\nBy whom was your first cook stove made? (Describe method)\n\nWhat year was it purchased? (Describe method)\n\nThat type of utensils did you use?\n\nFor preparing food? (Describe method)\n\nChores: (Describe method)\n\nAluminum? (Describe method)\n\nBut may have been it if you did.\n16. **Shopping and Containers**\n   Mention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n---\n\n**Myself and Husband**\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1910\n**Breakfast:** Oatmeal, Porridge, eggs and toast, butter, fruit, potatoes when hired man.\n**Dinner:** Meat & Potatoes, vegetable, pudding, Bread & Butter or Pie.\n**Supper:** Meat or eggs and Potatoes, fruit, stewed Bread & Butter, cake or cookies sometimes soup instead of meat.\n\n---\n\n18. What year did you serve your first Christmas dinner in eastern Canada?\n   ...1910........... Give the menu. List those present and give their approximate ages at that time.\n\n   We were only two weeks married, & alone.\n   Roast chicken and dressing.\n   Potatoes, gravy.\n   Christmas pudding & sauce.\n\n---\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n   No, but we had neighbors who came from Chicago and after two or three years their money running out. Man, wife, 2 small children, she told me they only bought four things—flour, salt, soda and coffee. They raised Rabbits for meat, and Moose in winter. Had some hens and a cow, and a garden of course.\n\n   This was homestead land being taken up from 1905 until 1912. The roads were very bad, impassable some places and still not good. Although the best of land;\nMyself and husband\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give dates when possible.\n\n18. What year did you serve your first Christian dinner in [western Montana]?\n\n19. Have you ever refused to accept starvation level living on one or two locally produced foods? Give details.\n\nWe were only two weeks married, 2 days.\n\nChristmas pudding & sauce\n\nPotatoes, gravy & dressing\n\nThroat chicken and dressing\n\nChristmas pudding & sauce\n\nThis was homestead land being taken up from 1905 until 1912. The crops were very bad, invariably somewhere and only not good although the best of land!\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nWe kept a small store in 1912 and 1913 and I have found some counter check books where I got prices but not always names of articles. As we had to bring things from Star City with horses they may seem a little higher in price. I am giving prices at which we sold.\n\nSugar is only put down at $1.00 or 50¢ so I am not sure of the amount.\n\nPrices as taken from Book see below:\nWe paid 30¢ for butter & eggs fall and winter of 1913. Sold same price.\nWe held a small store in 1912 and 1913 and\nI have a friend from county creek who\ngot prices but not always\nas we had to bring things from the city\nwith horses they may seem a little\nhigher in price. I am giving prices or\nwhat we sold.\n\nSugar is only half down at $1.00 or $0.50 per\nnot sure of the amount.\n\nFlour as taken from Borek (seller)\nThe flour 30c per bushel & eggs fall and\nwinter of 1913. Sold same prices.\nfingering yarn 60¢\noveralls 1.50 and 4/25¢\nshorts 90¢\nsmocks 90¢\nunion flannel yd .15¢\nsocks 30¢ 80¢\nflannelette yd 1¢\n\ntop yeast, Royal 5¢\n2 lb. card 65¢\nrolled oats 65¢ 85¢\nbaking powder 20¢ 25¢\nsalt 50¢-lb 75¢\ntea 35¢\nplum jam 60¢\ncorn starch 10¢ 20¢\nmaro syrup 65¢\nlily white 75¢\n\nhorsehide pullovers 1.25¢\nraw leaf tobacco lb 2.5¢\ntacks 5¢\nnails 4¢ to lb. 5¢\ntar paper Roll 1.25¢\nlamp glass 10 oz .15¢\nbroom 40¢\ncoal oil gal 30¢ 40¢\nwash board 25¢\nlye 15¢\naxe and handle 1.20¢\ncassino tobacco 25¢\nsnuff box 10¢\nspool thread 300yd 5¢\n22 rifle shells 25¢\nshot gun shells 70¢\nPunging Gates, etc.\n\nOveralls 1/20 and 4/25\nShirt 90\nBrim Flannel Yd. 1/3\nStaple 3/6\nAlmamette Yd. 2\n\nby Year, Royal 5\n20-0-11 Carol 65\n20-0-11 Rolled Quilt 85\nBathing Powder 20 8 25\nSalt 50c\nTea 35c\nPlum Jam 60\nCorn Starch 10c\nWhite Sugar 65\nPotato 75\nNew England Butter 1.25\nTobacco 5c\nRails 4c\nFarmer Roll 1.25\nTemple Glass 10c\nButter 40\nCandle Oil gal. 30c\nWash Board 25\nLye 15\nAxes and handle 1.20\nCarving Knife 25\nSnuff 10\nYard Thread 30yd 5\n25 Rifle Shells 25\nShot Gun Shells 20\nfingering yarn 60¢\noveralls 1.00 and $1.25\nshirt 90¢\nsmock .90¢\nunion flannel yd .75¢\nsacks 30¢ 50¢\nflannelette yd 1¢\n\ntop yeast, Royal 5¢\no-lb. card 65¢\nrolled oats 45¢ to 85¢\nbaking powder 20¢ to 25¢\nsalt 5¢-6¢ 75¢\ntea 35¢\nrum jam .60¢\ncorn starch 15¢-6¢ 20¢\nkaro syrup 65¢\nlily white 75¢\n\nhorseshoe pullers 1.25¢\nraw leaf tobacco lb 25¢\ntacks 5¢\nnails 4¢ to lb. 15¢\ntar paper - roll 125¢\nlamp glass 10 oz .75¢\nbroom 40¢\ncoal oil gal 35¢ 40¢\nwash board 25¢\nlye .15¢\naxe and handle 1.20¢\ncigar tobacco .25¢\nsnuff 10¢\nspool thread 300yd .5¢\n.22 rifle shells 25¢\nshot gun shells 70¢\nYarn and Yarn Co.\n\nCotton 1/2 oz. 5/12 5\nShirt\nTweed\nPoveshell Flannel 1 yd. 90\nLinen 3/4 yd. 50\nFlannelette 1 yd. 2\n\nBoy's Coat, Royal 5\n20 oz. Lard 6\nTobacco Powder 20 oz. 25\nSalt 5 oz. 35\n\nTea\nPlum Jam 10 oz. 6\nCorn Flakes 10 oz. 6\nWhite Syrup 10 oz. 75\nButter 1 lb. 25\n\nAlcoholide Pillarbox 1/2 oz.\nHair-Like Tobacco 1/2 oz.\n\nTobacco 5\nNails - 4c 5c 6c\nFarmer Paper Roll - 1 2 5\nTin Cup Glass 10 oz. 15\nBiscuits - 40\nCoal Oil gal. 30c 40\nWash Brand 35\n\nTyre 15\nAce and Handle 1 2 0\nCarving Tobacco 25\nSnuff 10\nSmoof Thread 300 yd. 5\n22 Rifle Shells 25\nShot Gun Shells 20\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1910N-Z_292.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6267, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1445, 3], [1445, 1445, 4], [1445, 2443, 5], [2443, 3202, 6], [3202, 4652, 7], [4652, 5712, 8], [5712, 9748, 9], [9748, 10825, 10], [10825, 14894, 11], [14894, 15409, 12], [15409, 16676, 13], [16676, 17512, 14], [17512, 19118, 15], [19118, 19760, 16], [19760, 20804, 17], [20804, 21221, 18], [21221, 21799, 19], [21799, 22285, 20], [22285, 22867, 21], [22867, 23442, 22], [23442, 23530, 23], [23530, 23684, 24]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]