[{"id": "14d880bd9bd484e6dc3d6a27c702ae8b3741677a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\nYour full name LEWIS FLETCHER\nPresent Address MAJOR SASK\nPioneer Address DERRICK SASK\nYear you came to Saskatchewan 1905\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 8\n\nHow many of these were bachelor's homes? 4\n\n2. How often did you usually visit neighbors? Once in 2 weeks in summer, once a week in winter.\n\n3. Did you usually visit on a Sunday, or other days? Mostly on other days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly without an invitation.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Mostly at night.\n\nWhat about meals? Did you stay when not invited beforehand? Not usually except with bachelors.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) You better stay & have a bite to eat.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? None in early days.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? I was a bachelor, so some stayed home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? There were quilting bees after the bachelors got married and just quilting bees.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. None. Dances came later when the women came in. The people in this community in the early days leaned to the Methodist religion and did not believe in dancing.\n\nWere these more frequent in later years? Give dates. Yes, from 1913 on.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No.\nPIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days? Usually on other days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\n5. What time of the day did you go—in the morning and spend the day, or in the afternoon, etc.? Usually in the morning.\n\n6. What about meals? Did you stay when not invited beforehand? Not usually except with the host family.\n\n7. Did you ever have \"tea\" then groups of neighbors came together to put up a knitting, make quilts, or other such activity? Yes, we used to gather after the wedding and make quilts.\n\n8. Tell what you remember about such gatherings, giving dates if possible, telling what the reasons were for, and how often they occurred.\n\n9. In the earliest years that you were here, were there any parties, whilst drives or dances in homes? Describe.\n\n10. Did you follow any kind of informal schedule, such as going by car from one home to another at definite times, every two weeks, once a month, etc.? No.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nSchool was built in 1913. All dances, box socials & picnics were held in the school after it was built, none in private houses. Christmas concert was held at school too.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nPractically all except social calls. Before the school was built some dances were held in private houses but not many.\n\n9. When was your first community hall built? 1921\n\nWhat material was it made of? Lumber How large was it? 26 x 60\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community\n\nWas it built in the village or town, or was it a country hall? In village\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) We continued to use the school house for dances and some other functions especially Christmas concerts and practicing softball on the grounds. Used the hall for\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? Babies covered up in corner.\n\nHow were horses sheltered and fed in the winter time at these parties? In school barn\n\n11. What card games were popular in the early days? Encore! Whist Pedro\n\nWas there card playing for a prize? No\n\nWhat dances were popular? Both round & square dances\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. I do not think so\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. A few frowned, some did not dance.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, Christmas parties, etc.)\n\nIf you have not described these on the school questionnaire, give dates.\n\nSchool was built in 1913. First dance was held there in 1921.\n\n9. How much of your social life was centered around the school, and within the school district?\n\nDescribe.\n\nBasically all except social calls were held in private homes.\n\nAfter the school was built, some dances were held in private homes.\n\nWhat material was it made of? Lumber\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community.\n\nWas it built in the village or town, or was it a country hall? In village.\n\nHow large was it? 26 x 60\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nWe continued to use the school house for dances and various other functions especially Christmas parties and for practicing basketball on the grounds, until the hall for an old barn.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 9), did the entire family attend?\n\nHow were tables and chairs provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Euchre, Whist\n\nWas there card playing for a prize?\n\nWhat dances were popular? Round and square dances\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. A few frowned, some did not dance.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nChivarees were not common. This is a dry thinly settled county with very few weddings in the early days. Most weddings were in winter with a social evening afterward. Most chivarees like in Ontario, too cold to stay outside.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nSask Grain Growers Association\n\nGive the date and reason for it being organized. 1913. At first just for a social time, then to get fruit and vegetables cheaper. 1914 was a very dry year.\n\n16. Was there a Saskatchewan Grain Growers local in your community? yes\n\nTell when it was organized, and what steps led to its organization. 1913 sociality + education at first - not many members. 1914, dry year, shipped in fruit vegetables - most & settlers going. Approximately what proportion of the farmers in the community belonged to it? practically all\n\nHow many women belonged? none How often did it meet? monthly at first\n\nWhat were some of the activities carried on by this organization? discussions on economic questions, debates, dances, picnics.\n\nNow this did not take place in our own school but a neighboring school.\n\n17. Was there a Homemakers' Club in your district? yes\n\nWhen was it organized? 1915\n\nApproximately how many women belonged to it? about 12 at first\n\nDescribe what you remember of its activities and services.\n\nThis other school - Derrick was built earlier than Summit Park and was used as a centre for the Grain Growers' Organization to meet. All Summit Park people went there in the early days.\n12. What attempts at formalized or \"social\" do you remember in small towns such as Glovers and Harts when calling cards, visiting cards, etc.,?\n\n13. Was the obituary known in your community? Describe what you remember about obituaries, telling how common they were, any influences connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any plans or arrangements not already mentioned that were popular in visiting or social life.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Association in your community? If so, when did it begin? How many members were there?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n\nThis other school—Dawson's—was built earlier than Summit Park and was used as a centre for the Grain Growers' Organization to meet. The Summit Park people went there in the early days.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nNone\n\nWhat means were commonly used by organizations for raising money? Box socials\n\n19. Where did various organizations hold their meetings? In the school, either Summit Park or Derrick. The Homemakers held their meetings in the homes at first. Later in the town hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Sometimes in October year. Give dates if possible.\n\nWho provided the lantern and the slides? James Mowry, a farmer owned a moving picture machine. He used sunlight & mirror in the daytime, and gas light at night.\n\nWhat were the slides about? I forget, a mixture of pictures - these were moving pictures.\n\nThe slides were provided by the church & were missionary pictures.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Basketball & softball\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Girls very often played with the boys. They also skipped rope and played in a playhouse.\n18. Name any other organizations that were in existence in your community before 1914. Mention the name of each, date when it was first organized, its purpose, its size (large or small), who belonged (men, women, young people, etc.), within a school district only or not, connected in any way with the church, and included the surrounding community. (There are appended a blank sheet questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? In the school, town hall, church, etc.? What was the name of the building? When was it built? For what purpose?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc., etc.?\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? (Name魔幻灯机的提供者) He used a magic lantern projector. What were the slides about? (描述幻灯片的内容)\n\n22. What games did boys play in summer? (列举夏季男孩常玩的游戏)\n\n23. What games did girls play in summer? (列举夏季女孩常玩的游戏)\n\nGirls very often played with the boys. They also skated.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Fox and hounds, some skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   Crokinole, checkers, Authors & other card\n\nDid the whole family join in such games, or only the children? Explain.  \n   All the family\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   Lots of time\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   No\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \n   Give year and month if possible. 1913 July\n\n26. Who organized it? Sask Grain Growers Associa\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   Ball games, different races, horse races, etc.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Formed family groups at first\n\n31. What did you have to eat and drink?  \n   Practically everything to eat, ice cream, lemonade etc.\n\n32. What time of the day did it start, and how long did it last?  \n   Started 2 P.M., ended 5 O'Clock A.M. danced all night.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with animals, things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Families formed groups\n\nat bird\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nStarted 2 P.M., ended 5 O'Clock A.M. lasted all night.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThere was a band at the fire pie, and the moving pictures in the daytime by sunlight through the use of mirror. This fire pie was held at Derrick school.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nIn the early days there were a lot more people than later on. There was no railroad or town within 20 miles. Sunday School picnics came later, put only United Church fewer people. They sat off shelter something placed on the ground and all the people got around this. This was never done at a large community fire pie.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nChanges in manner of making arrangements to eat 1915.\n\nOther activities were introduced such as merry-go-round (the merry-go-round was introduced by Macleod brothers and was free bronco-busting, Rodeo).\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball, horse races & different kinds of foot racing by men, women, children. All took part, even old men.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball\n\nWhat year? 1915\n\nHow long did it continue? For about 15 years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nNone\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n1914 Hockey\n\nWhen was the first indoor rink built, and what was it used for? 1949 Curling\n33. Describe any features or this place which you remember as outstanding.\n\nThere was a band at the fair nice and the morning.\n\n34. Describe any different kinds of plants which you knew of in the early days, such as the large community plant, school, church, Sunday School, local family, food and drink, when held, etc.\n\nIn the early days there were a lot more people than today.\n\n35. What changes have you noticed in plants since then? Give data when changes become noticeable.\n\nOther activities were introduced such as mostly around town.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, young people).\n\nBasketball became a different kind of foot racing by men, women, children.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1915 - baseball\n\n38. Name any other sports teams that were organized before 1912, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). 1914 - hockey\n\nWhen was the first indoor rink built, and what was it used for? 1946 - curling\n40. When did an annual \"sports day\" become established in your community? 1915\nDid it grow out of or replace the earlier community picnic? Yes\nWho was responsible for starting the first sports day? Sask. Grain Growers' Assoc.\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July or later, no special day\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. No\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (use extra sheets if necessary)\nI went west to Montana in 1897 and from there drifted up to Sedute county in 1902. From there to my present home site. The only books I held on to in my wanderings was the Bible, a dictionary (The Concise Imperial) & Shakespeare's plays. All the other books were dropped one place or another.\n\n43. How many of your neighbors brought books with them? Some did\nWhat kind of books and how many? As far as I remember the books brought in were novels\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. Not many\nI got books from Wheat Pool Library\n\n46. What books were sent to you as gifts in early years? None\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\nYes! Summit Park School had one 1941\nMajor Homemakers had one in Major & community 1936-48\n\n48. Was there a school library? Yes\nWhen was it begun? 1913\nTo what extent were books borrowed from the school library for adults to read at home? Very little\n\n49. Did parents ever use their children's school text books as additional reading material? Not very much\n40. When did an annual \"sports day\" become established in your community? 1913\n\nDid it grow out of or replace the earlier community picnic?\n\nWho was responsible for starting the first sports day? (Give name, date)\n\nWhen was the sports day usually held? (What month, or any special day, such as May 25th or July 4th)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, tell how many you brought, and what kind.) (Use extra sheets if necessary)\n\nI went out to Montana in 1897 and often there drifted off to Butte county in 1902 from there to my friend's home. The only book I liked on to me was my wanderings with the Bible, a dictionary (The Concise Imperial) of Shakespeare's plays.\n\nAll the other books were shipped over place or another.\n\n43. How many of your neighbors brought books with them? (Give details)\n\nWhat kind of books and how many? As far as I remember the book budget in our records.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? (Give details)\n\n47. Have you ever had any \"travelling library\" books in your community or school? (Give details and dates)\n\nYes! Summit Park School had one called \"Grosset Hornsmakers had one in Mogollon community\"\n\n48. Was there a school library? Yes\n\nWhen was it begun? 1913\n\nTo what extent were books borrowed from the school library for adults to read at home? Very little.\n\n49. Did parents ever use their children's school text books as additional reading material? Not very much\n50. Has there ever been a community library in your district or town? No\n\nWhen was it started? Who started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nSometimes the travelling library was well patronized, at other times very few books were taken out.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nNorth West Farmer\nFarm Crops\nFarmers Advocate\nFamily Herald\nHamilton Spectator\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nFarmers Advocate quit printing in West Kildonan\nStock Growers Guide, Free Press & Family Herald\nI quit Hamilton Spectator\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nI still have the Bible & Dictionary & Shakespeare\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo. In summer I worked till I was tired, cooked my meals to eat, then slept. Winter - I went out to work first 2 winters. Later I always had reading enough out of papers and magazines & odd books.\n50. Have there ever been a community library in your district or town? Yes\n\nWhen was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nSometimes the travelling library was well patronized at other times very few books were taken out.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nNorth West Farmer\n\nHamilton Advocate\n\nFamily Advocate\n\nHamilton Spectator\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nHammer's Advocate quit printing in North Platte\n\nNorth Brown Grower's Guide, Blue Cross & Family News\n\nI quit Hamilton Spectator\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west will you do you still have?\n\nI still have The Bible & Dictionary\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nSummer - I was tired, cooked my meals, ate then slept\n\nWinter - I went out to work first 2 winters, later I always had reading enough out of newspapers and magazines & old books.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? No\n\n57. What instruments did any of your neighbors have? Violin in early days\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nPiano after I got married 1921\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe. There was some singing at parties not being musical, I did not take much interest in it.\n\n60. What were some of the favorite songs in the home? Hello Grey, Old Folks at Home, Hymns and parodies on other songs\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. No\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. Yes, The songs were mostly on the nature of the land in which the different sections lived\n\n63. Was there a band in your community? Yes When was it started? 1912\n\nWho started it? F.P. Saunders How long did it continue? about 4 year\n\nHow many were in it? 10 Who was bandmaster? F.P. Saunders\n\nWhat instruments were included? Large drum, kettle drum, clarinet, trombone + others\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nPlayed for picnics & entertainments, etc., practice was held once in two weeks at Mr. Saunders home no uniforms\nMusical Entertainment\n\n56. What musical instruments did you bring with you?\n57. Did any of your neighbors have musical instruments?\n58. Have you bought since you came to the west? If so,\nwhat, if any, and tell where you bought them.\n\n59. How long did you play and other forms of music in your home entertainments in early years in the West? Describe.\n\nIn the community? Were there musical concerts, parties, etc.? Describe.\n\n60. What were some of the favorite songs in the home? Hymns, hymnals, old songs at home, hymns and favorites or other songs?\n\nIn the community?\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs? Or take up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? Who was bandleader? What instruments were included? How often was practice held? Tell what you remember of its activities, how often practice was held, what uniforms members had, what events the band played for.\n\nPlayed for picnics, entertainments, etc. Practice was held once in two weeks at Mr. Saunders' home.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nThere are more people here now who know music and can take the lead.\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give name and place of public appearances.\n\n65. Is music an important or less important in your community now as compared with the early days? What is the reason for this change?\n\nThere are more people here now who know music and can take the lead.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Explain.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, after-teatime, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2035.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8578, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1182, 5], [1182, 1182, 6], [1182, 3233, 7], [3233, 4402, 8], [4402, 6690, 9], [6690, 8781, 10], [8781, 10993, 11], [10993, 12183, 12], [12183, 13966, 13], [13966, 15152, 14], [15152, 16798, 15], [16798, 17965, 16], [17965, 20049, 17], [20049, 21440, 18], [21440, 23300, 19], [23300, 25067, 20], [25067, 26558, 21], [26558, 28015, 22], [28015, 29711, 23], [29711, 30945, 24], [30945, 32136, 25], [32136, 33334, 26], [33334, 33422, 27], [33422, 33576, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]