[{"id": "43ef6e2f01b0a6615bb4b9ced3261ed8ed3520f4", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name: William Albert Cadman\nPresent Address: 323-7th Ave., Saskatoon\nPioneer Address: Macario, Sask.\nYear you came to Saskatchewan: 1904\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER RECOLLECTIONS AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years how many hours were near enough to you for visiting back and forth? How often did you usually visit neighbors' homes?\n\n2. How often did you usually visit neighbors' homes? How often did you usually visit on Sundays or other days?\n\n3. Did you usually visit on Sundays or other days?\n\n4. Were you often invited to other homes? Or was most visiting done without an invitation? What time of the day did you go—morning, noon, or afternoon?\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?)\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n9. Did you ever have \"sewing\" where groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"reasons\" were for, and how often they occurred.\n\n10. In the earliest years that you were here, were there many parties, what drives or dances in homes? How often were these held?\n\n11. Were these more frequent in later years? Give dates. Did any country dances take place?\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a month, etc.? Did these ever hold parties in the villages or towns?\n1. In the first ten years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors' homes? Did you make a special arrangement?\n\n3. Did you usually visit on a Sunday, or other days of the week?\n\n4. Were you often invited to other people's homes? Or was most visiting done without an invitation? If so, what was the reason?\n\n5. What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"please join us\" used, or was there another expression?)\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n8. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n9. Did you ever have these \"open house\" gatherings together to put up a billiards, make quilts, or other such activity?\n\n10. Tell what you remember about such gatherings, giving dates if possible, telling what the \"guesse\" were for, and how often they occurred.\n\n11. In the earliest years that you were here, were there many parties, \"play drives\" or dances in homes? Describe.\n\n12. Were there more frequent in later years? Give dates. Why?\n\n13. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times—every two weeks, once a month, etc.? Where and how often?\n6. Tell what was made of the school house for community games, box socials, etc., if you have not heard that there was no school house. Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built after the R.R. came to [town]? How large was it? Who built it? How large was it? Who built it? How large was it? Who built it?\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were tables and small children provided for?\n\nWhat card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n\nSome residents did not approve of card playing.\n6. Tell what use was made of the schoolhouse for community dances, box socials, etc., other activities. (Include also the school children's parties, birthday parties, etc.)\n\n7. How much of your social life was centered around the school, and within the school district? Describe.\n\n8. What material was it made of? (Describe.)\n\n9. When was your first community hall built? (Describe.)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community or were there some who frowned upon it, either as an entertainment in the house, or for community gatherings? Explain.\n\nSome residents did not approve of card playing.\n12. What attempts at \"formality\" or \"rampant\" do you remember in small towns, such as places like this when calling, calling back, visiting, treated seriously in public, etc.? \n\n13. Was the obverse known in your community? \nDescribe what you remember about obverses, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments already mentioned that were popular at parties or other social gatherings at that time so you can whom some obverses in visiting or social life because noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? \nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? \nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\n17. Was there a Homemakers Club in your district? \nWhen was it organized? \nApproximately how many women belonged to it? \nDescribe what you remember of its activities and services.\n12. What attempts at Forming, or \"working\" do you remember in small towns, such as those mentioned above? Tell what was done, who started it, when, etc.\n\n13. Are the churches known in your community? Describe what you remember about churches, telling how common they were and any influences connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular at parties and similar entertainments (not suitable for visiting or social life because of lewdness).\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the Civic organization of any kind that you remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? If so, describe its organization, and what stage led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nWhat were some of the activities carried on by this organization?\n\nThey organized a trading disbursement and sold local grown foods after their harvest and many other things at cost.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Have any other organizations that were in existence in your community before 1941, either groups who belonged to the church (for example, women's groups), whether it included people only in one particular family area (for example, within a school district), or was centered in the town or village and included the surrounding community? (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nWhat means were commonly used by organizations for raising money?\n\nDid you often have magic lantern shows? Olive dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving their names, location (can mean town or village), size (whether 4th, 5th, etc.), people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\n19. What names were commonly used by organizations for raising money?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. Did you often have magic lantern shows? Give dates if possible.\n\n22. Who provided the lantern and the slides?\n\n23. What were the slides about?\n\nCHILDREN'S GAMES\n\n24. What games did boys play in summer (e.g., marbles, fly kites, etc.)?\n\n25. What games did girls play in summer (e.g., birdhouses, etc.)?\n22. What winter games were played outdoors - fox and hounds, skating, etc.? What games were played indoors in winter - card games such as \"Happy Family,\" \"whist,\" \"parcheesi\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, popcorn or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? A Community Picnic at Mrs. John Faup's home on Broadfield in 1918. Picnic in March.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, game organization, etc.? This was for the Community.\n\n28. Was it the first picnic held in the community? The first I can remember.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? There were boat rides on the slough, and races and jumping and other sports.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? It started at 4:00 and afternoon affair.\n22. What winter games were played outside - fox and hounds, skating, etc.? \nThat games were played indoors in winter - such as \"Happy Family,\" \"Mushrooms or others,\" checkers or other? \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? Describe.\n\nPASTimes AND SPORTS.\n\n25. What was the date of the first platoon that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? A Community Platoon at Mrs. John Fergusson's.\n\n27. Was it for the entire community or for a smaller group, such as a school district? (Young school) young families only?\n\n28. Was it the first platoon held in the community? If so, when?\n\n29. What were the arrangements at the platoon you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics; school or Sunday School picnics; family picnics; etc.; tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (boys, women only).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1908\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities—played against teams from neighboring towns, played in competitions in larger centers, etc.\n\nIn Muncie, there was a good football team in these early years.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.). When was a second rink built, and what was it used for?\n\nWhen was the first indoor rink built, and what was it used for?\n\nA large indoor rink was built in 1928 and used for skating, hockey and curling.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1908\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n\nA large indoor rink was built in 1928 and used for skating, hockey and curling.\n7.\n\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known\n    associations? (Give names, and dates.)\n\n42. What books did you bring with you when you came west? (Give a list of the\n    names and authors of the books, if not too long.) As nearly as you can, how many\n    books you brought, and what kind?)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to\n   read at home?\n\n49. Did parents ever use their children's school texts as additional reading\n    material?\n7.\n\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community plans?\nWho was responsible for starting the first sports day?\n\n41. Are there any from your community who have become members of well-known teams or clubs? Give names and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible; if not, tell so nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library?\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   If so, when was it started?\n   In what location?\n   If not, why?\n\nGive any other details which you can about the library - how many books it contains, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFor years I took the Family Herald and Weekly Pictorial and the New West Farmer, also the Idaho Statesman and the St. Paul Pioneer Press.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Have you ever been a community library in your district or town? What was its start date?\n\nIn its initial existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, who acted as librarian, etc.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFor years I took the Family Herald and Weekly Star of Montana and the New West Farmer, also the Helena Independent.\n\nDescribe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n52. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n53. What books or papers that you brought to the west with you do you still have?\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n9.\n\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainments in early years in the West? Describe.\n\nIn the community (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community?\n\nWho started it?\n\nHow many were in it?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Instruments\n\n56. What musical instruments did you have when you were young?\n57. What instruments did any of your neighbors have?\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the west? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the house?\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, who started it? How long did it continue? How many were in it? Who was the conductor? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community been well known or famous in the musical world? Give their names and dates and places of public appearances.\n\n65. If music is important or less important in your community now as compared with the early days? What is the reason for such change?\n\nBUSINESS AND SOCIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how big it is, what is included in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you take notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or luxuries of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\n64. Has anyone from your community been well known or famous in the past? If so, please list their names and dates.\n\n65. Is there an important or less important historical event that has occurred within the last few years? Please list the reasons for this change.\n\nHobbies and Special Interests:\n\n66. Do you have any collections, such as stamps, coins, paintings, signatures?\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? If so, please describe.\n\n68. Describe other hobbies or special interests not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies or for others such as photography, bird-watching, etc.?\n\nGENERAL:\n\n70. Describe any outstanding features or incidents of social life, family entertainments, parties, reunions, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary)\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1904_2005.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6665, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1240, 5], [1240, 1240, 6], [1240, 2867, 7], [2867, 4297, 8], [4297, 5396, 9], [5396, 6403, 10], [6403, 7582, 11], [7582, 8975, 12], [8975, 10163, 13], [10163, 11283, 14], [11283, 12792, 15], [12792, 14012, 16], [14012, 15405, 17], [15405, 16719, 18], [16719, 17863, 19], [17863, 19002, 20], [19002, 20032, 21], [20032, 21011, 22], [21011, 22118, 23], [22118, 23278, 24], [23278, 24408, 25], [24408, 25330, 26], [25330, 25485, 27], [25485, 25636, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]