[{"id": "c5125bbacffa33406246252e134e631d6e7bd18f", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of those are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nHayter, Frederick Allen\nAlameda,\n\nTo Sask., April, 1863.\n\nPIONEER INTERVIEW: A GENERAL QUESTIONNAIRE\n\nA NEED OF INFORMATION TO THE DEPARTMENT OF STATISTICS\n\nIt is difficult to imagine a situation where a general questionnaire on pioneer life has been so widely discussed. It is said to be the most exacting of its kind ever attempted. The questions are numerous and varied, covering every aspect of pioneer life. The answers will not only provide valuable information but also help to preserve the history of our ancestors.\n\nThis questionnaire is intended for persons who have lived in Western Canada for more than five years. If you are interested in answering these questions, please complete the attached form.\n\nIf you are unable to complete the form, please contact the Department of Statistics for assistance.\n\nThank you for your cooperation.\n\nSincerely,\n\n[Signature]\n\nWestern Canadian Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did You Discover?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (V).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nPlease complete the following:\n\nAll Questionnaires\n\n| Questionnaire Title | Description |\n|---------------------|-------------|\n| Pioneer health conditions | |\n| Pioneer social life, sports and recreation | |\n| Pioneer housing | |\n| Pioneer education and churchwork | |\n| Pioneer farming experience | |\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Collection. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nDepartment of Statistics,\nGovernment House,\nSaskatoon, SK.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: FREDERICK ALLEN HAYTER\n2. Your address: A.L.A.M.E.D.A.\n3. Date: 4th April\n4. Where were you born? (Give name of place and country): PETERBOROUGH ONT\n5. What was your father's name and occupation? WILLIAM HAYTER Farmer\n6. When did you come to Saskatchewan? (Give month and year): APRIL 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: PETERBOROUGH County Dec 1869 April 1883\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 13 years\n9. What were your reasons for coming West? To get more land\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Reading\nHayter Frederick Allen\nAlameda.\nTo Sask. - April 1, 1883.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: J. FREDERICK ALLEY HAYTER\n2. Your address: A.L.A.M.E.D.A.\n3. Date: 4th April\n4. Where were you born? (Give name of place and country) PETERBOROUGH ON\n5. What was your father's name and occupation? WILLIAM HAYTER Farmer\n6. When did you come to Saskatchewan? (Give month and year) APRIL 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. PETERBOROUGH County Dec 19th April 1883\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age at that time.) I was 18 years old.\n\n9. What were your reasons for coming West? To get more land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Reading\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   I traveled with family.\n\n13. What means of transportation did you use?\n   Part railway, part with horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan? My father arrived a year ahead of the family & built a sod house.\n\n16. Where did you settle or take up land? Near what is now Alameda.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   From 1878 to 1885 in Winnipeg.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Farming.\n2. What did your friends and relatives think of your decision to come to America?\n\n3a. Did you travel by yourself or in a party (family, friends or other groups)?\n\n3b. What mode of transportation did you use? Rail, road, or boat?\n\n4. What hardships did you experience during your journey? (Describe any difficulties or challenges you faced.)\n\n5. Where did you first stay when you arrived in Pennsylvania? (Describe your initial accommodations.)\n\n6. How did you settle or take up land? (Describe how you obtained land.)\n\n7. Mention any other places where you have lived since coming to Pennsylvania.\n\n8. From 1818 to 1835 in Wisconsin.\n\n9. How did you earn a living before coming to Wisconsin? (Describe your occupation.)\n19. How often did you write to relatives or friends in your old home?\n   About monthly\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage. Married 2nd January 1901 & Evelyn Williams\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came Best\n    tell when they came and where they settled.\n    My parents & some brothers & sisters came at the same time\n\n23. Is there any particular experience of pioneer days that stand out in your\n    memory which you would like to record?\n    Our nearest market & railway station was Morden, 100 miles North. Some years there were horses, then we came from North Dakota. Got our flour milled at Souris, Manitoba 125 miles from Gladstone.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? by what means of travel?\n    We did not have far to go to church or to visit by travelling with horses & waggon\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Dakota during the time of your residence there? If so, please list them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came here, tell when they came and where they settled.\n\nMy parents + some brothers & sisters came off the coast.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOur nearest market + railroad Station (Lan Manomin)\n\nOur nearest North, some years back was Horse, then came from 100 miles North. Got our flour milled at Souris, Manitoba\n\nNow in Dakota, got our own flour mill.\n\nHas grown from (spelled)\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe did not have fun to get church or to visit\n\nMy traveling with horses or wagons\n25. When was the first car used in the community? 1912.\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Watcher Brothers store 3 miles from the farm\n\n28. Did you continue to trade there? (Indicate any changes due to new forms appearing, better means of travel, etc.)\n   The Railroads came to Ontario in 1891\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   We always went to the Post Office on Saturday\n\n31. When (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   1897 - Dry Goods\n\n32. When did you first have a telephone and what company provided it?\n   Bell Telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Came with intention of staying\n19/12\n\n25. When was the first car used in the community?\n\n26. If so, when did it come?\n\n27. What was the name of the store in the town?\n\n28. Is there any information about the history of the town?\n\n29. How many people lived in the town?\n\n30. Was there any industry in the town?\n\n31. What was the name of the main street?\n\n32. How many schools were there?\n\n33. What was the main occupation of the town's population?\n\n34. Were there any churches or religious organizations in the town?\n\n35. How many businesses were there in the town?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes, have not returned\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nA name named by Mr. Troyer who came to Alameda in California—the meaning of the Spanish word is \"group of trees\". Or how got that name because the Souris River bends the shape of an Oxford. We located here to be near the Souris Coal field and the Souris River.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, union, or other group, please list positions.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, combining organizations, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person responsible for name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) any reason for change.\n\nShape O'neal named by Mr. Jorgensen who came to Hammond in California—The meaning of the Spanish word is \"Shape\" or \"Oval.\"\n\nOr how got that name below the Souris River bends like\n\nShape O'neal located here & near the Souris (Coldfield)\n\nand the Souris River\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nyes, have not returned\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nA name I named by Mr. Troyer who came from Alameda in California—the meaning of the Spanish word is \"group of trees.\"\n\nOn Low got that name because the Souris River bends the shape of an Oxbow.\n\nWe located here to be near the Souris Coal field and the Souris River.\n35. Did many people move away during the 1920s? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNo\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (e.g., first to organize the first lodge, etc.).\n\nShape Our Own\n\nWe created here & near the Souris Coal field\n\nAnd the Souris River\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .....\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren - Mrs Ray D Deyell and F.W. Hayter M.D.\nDonald Hayter\nRobert Hayter\nBrian Hayter\nGrandsons\n451 Bowerley St\nWinnipeg\nMan.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe coming of the railway was an important change.\nOur family lived here 9 years before the railway came.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nErnst Bishop\nOsborne Post Office\nSask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6.\n\n30. Questions regarding historical records materials:\nDo you have in your possession or do you know the whereabouts of hand-written old letters, old photos and negatives, minute books of companies or organizations? (Questionnaire)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live:\n\nChildren - Miss Ray D. Dayal and Mrs. Hayter\n\nGrandchildren - Donald Hayter\n\n451 Woodmere Avenue\n\nOur family lived here 9 years before the railway came.\n\nPlease give the names and addresses of other persons who could answer these questions.\n\nErnest B. Bishop\nOxley Post Office\n\nS-X2\n400. Hayter Frederick Allen\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883D-L_400.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4922, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1921, 5], [1921, 3724, 6], [3724, 4898, 7], [4898, 6078, 8], [6078, 6975, 9], [6975, 7696, 10], [7696, 8794, 11], [8794, 9850, 12], [9850, 11047, 13], [11047, 11580, 14], [11580, 12830, 15], [12830, 13983, 16], [13983, 15238, 17], [15238, 15717, 18], [15717, 17053, 19], [17053, 17949, 20], [17949, 17949, 21], [17949, 18103, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]