[{"id": "2770cadf5b7b17ed6a739e96695651692af0f5fd", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the READER\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked will have exactly the same experiences as another. Some of the questions here will not apply to exactly the same experiences as others. It is impossible for you to answer all of them, so don't worry about leaving blank spaces where they don't apply.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write their answers separately.\n\nOther Questionnaires\n\nSaskatchewan Archives has prepared a questionnaire No. 1, entitled \"Pioneer Tales: What Did Saskatchewan Pioneers Eat?\" It is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives has prepared questionnaires on other subjects which you would be willing to answer:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Saskatchewan can answer all questions. Some of the questions have been answered by others, but not necessarily in the same manner. It is impossible for you to answer them all, so don't worry about answering every question. If there is a question that you cannot answer, simply leave it blank.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1945, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write their answers separately using a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 2, entitled \"Pioneer Life: What Did You Do?\" will be sent to you if you have not already answered it, and would be willing to do so. Please put a check mark next to each question that you have answered.\n\nWestern Canadian Archives Questionnaire No. 3, entitled \"Pioneer Life: What Did You Do?\" will be sent to you if you have not already answered it, and would be willing to do so. Please put a check mark next to each question that you have answered.\n\nInstructions for Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the provincial record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nKeys, Mrs. Jos.\nLaystowm. 1886\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Jos. Keys\n2. Your address: 461. Keys (Mrs. Joseph)\n3. Date: April 1982\n4. Where were you born? (Give name of place and country) Pleasant Valley, Pierson County, now South Dakota.\n5. What was your father's name and occupation? Alexander Sutherland, farmer.\n6. When did you come to Saskatchewan? (Give month and year) Came to Assiniboia in April 1886.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nThe writer has made only two moves in her life:\nFirst from N.J. to Wolseley, Assiniboia, W.M. in 1886.\nSecond from Wolseley to Assiniboia, W.M. in 1898.\n\n8. How old were you when you first came to Western Canada? (You do not need to give your age at present.)\n9. How many children did you have? (Give ages and names of each child.)\n10. How many children did you have? (Give ages and names of each child.)\n\nMy parents learned about the Sioux from a person, the same name, but no relation, who was returning to Norway.\n\nOn the farm is getting small, it would not be proper to not mention the Indian troubles which was one of the highlights of the early days in the Great. No allotment was completed with the Indians doing their part, and...\n\nYour make-up work will be very...\n1. Your full name: Mrs. Mrs. Keys\n2. Your address: Pleasant Valley\n3. Date: April 1984\n4. Where were you born? (Give name of place and country): Pleasant Valley\n5. What was your father's name and occupation?: Alexander Sutherland, farmer\n6. When did you come to Saskatchewan? (Give month and year): Came to Assiniboia in April 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - The writer, how much land owned in her life: She wrote, \"I have never owned any land in my life.\"\n   - Until from N.S. to Wetaskiwin, Alberta, 1884-1898\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years old or you may use your age.)\n   - I was 18 years old when I came to Western Canada.\n9. What were your reasons for coming west?\n   - To find work and opportunity for my family.\n   - To be left behind at all family belonging to here, we were coming west.\n\n---\n\n20. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n   - My parents learned about the West from me, the same as me, but no relatives who were returning to Montana.\n\n---\n\nOn the topic of getting small, it would not be proper to not mention the Indian Reserves which was one of the highlights of the early days. The Great, no celebration was complete without the Indians doing their part.\n11. What did your friends and relatives think of your decision to come to Western Canada? \n\nOn the family all came together. Some of us were too young to attend. All children all came well at the same time. She traveled by train.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? \n\nWe traveled by ourselves.\n\n13. What means of transportation did you use? \n\nOn the C.P.R.\n\n14. What incidents of the journey best do you remember? (People you met on the way, etc.)\n\nThe journey had no very exciting incidents as the train was slow and we were all day in Winnipeg on Easter Sunday in 1876, and remembered all of all being crowded together and sleeping on the floor in a floored compartment. After we reached our destination we became anxious about the future and worried about the circumstances of having a wife and children.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in a small town called Whitelaw.\n\n16. How did you settle or take up land?\n\nWe settled on the homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoved from N.B. to Wabamun, Alta. in 1916, then moved from Strathcona to Prince in 1918.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy living was fairly well supplied on the farm until I could purchase up until 1899 when school teaching came into the picture, and after January 1900 as a farmer's wife.\n11. What did your parents and relatives think or say about coming to Canada?\n\nOn the family all came together, some of us were too young to attend school.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nWe traveled by train.\n\n13. What means of transportation did you use?\n\nThe train.\n\n14. What memories of the journey do you remember? (People you met on the way, etc.)\n\nThe journey had many exciting incidents. We were all day in Greenup on Easter Sunday in 1886, and remembered well of all being excited together and cheering on the train in all places.\n\n15. What did you first see when you arrived in Saskatchewan?\n\nI saw the prairie and the trees.\n\n16. How did you feel when you arrived?\n\nI felt very happy.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoved from Prince Albert to Regina in 1918.\n\n18. How did you earn a living before coming to Western Canada?\n\nMy husband was fairly well supplied with the land he could purchase up until 1918 when we started teaching our children and after January 1900 as a farmer's wife.\n\n19. How old were you when you came to Canada?\n\nI was 18 years old.\n\n20. What was your occupation before coming to Canada?\n\nI was a housewife.\n\n21. What was your occupation after coming to Canada?\n\nI became a homemaker.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOn the family all came together, some of us were too young to think of relations.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nAn entire family and 4 children all came West at the same time.\n\n13. What means of transportation did you use?\n\nBy the C.P.R.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nThe journey was very exciting incident.\n\nAs the trails they did not know on Monday we were all day in sunshine on Easter Sunday in 1886 and remember well of all being crowded together and sleeping on the floor in a large homestead shed. When we reached our destination and friendly greeted, there was always a hand wash, wash and marking and smiling, the circumstances of our homes were always a delight.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWhen we arrived in Assiniboia, we had our first meal was in a private home in the back end of Wolseley.\n\nThis house was built by Mr. and Mrs. Wolseley.\n\n16. Where did you settle or take up land?\n\nS.E. of Wolseley\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMoved from N.S. to Wolseley Area in 1886, then moved from Wolseley to Prince in 1898.\n\nThat was the only move the writer ever made.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy living was pretty well supplied in those early years, to gather with the bit of help the writer could furnish up until 1898 when school teaching came into the picture and after January 1900 as a farmers wife.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nOn the family all came together, some of us were too young to attend any religious services.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nAll entire family at the same time. She traveled by train on the C.P.R.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nThe journey was very exciting indeed! We were all day in Greenhopper on Easter Sunday in 1886 and remember well of all things crowded together and sleeping on the floor in a house.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe arrived in Assiniboia on April 7th and stayed in a private home in the back end of a house for a short time before moving into a house near the railroad.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\n\nMinnedifton, N.W.T., Waskesiu, Assiniboia, and finally Saskatoon.\n\n17. How did you earn a living before coming to Western Canada? How long did you work there?\n\nMy living was pretty well settled out there easily years, gathered with the help of help the writer could furnish up until 1898 when school teaching came into the picture and after January 1900 as a farmess wife.\n\nYour make-up seems rather...\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It would be hard to state whether anyone else came to Saskatchewan because of the writer's recommendation. It was a place to live, but no one has ever heard the writer discouraging this country.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first tell when they came and where they settled.\n\nThe writing in these first early years was done by the oldest ones of the family.\n\nMarried to Joseph Keys of Prince, at North Bay Jan 17th 1940\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nMany and varied were the experiences of those early days...hailed hail, dried hail, frozen hail, but the never-to-be-forgotten were the prairie fires. By day the air was filled with smoke and the fire burned the wool, and when night would come, the fire would be seen miles and miles away. Our fires were mostly South West, the direction of the wind. Sometimes where the fires very often originated, there was nothing to stop them but the C.P.R., which they did not burn.\n\nContinued from question 23\n\nOur means of travel in the early years was horse and buggy, and our young folks were as was taught, and we family would be with pleasure as one of today and we attended church. A late model car today and we attended church. It was more. He always managed to attend church.\n\nIf you have any questions, please feel free to ask.\n\nIn the last years there has been much worry over the happenings where as from time to time the greatest drawback you could think of would be handled to you with the wind blowing. We thought about it and got a tune to move you from town and get a tune to move you from town.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n---\n\nMarried to Joseph Keys at Prince Albert, May 17th, 1886.\n\nIt was hard to decide whether anyone else came to Saskatchewan because of the writer's recommendation. It was a place to live, but no one has ever heard the writer encouraging this country.\n\nMy family all came West at the same time and settled at Strathley in April 1886.\n\n---\n\nContinued from question 23.\n25. When was the first car used in the community? April 1911\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Initiate also what fraction of your total purchases were by mail order since the pioneer period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently or did you make up your mind after trying it out?\n\n35. Where the world came to the West, there was no other thought of anything but getting it off the ground and she has never been continually faithful.\n\n36. If you came from Nova Scotia with Hiram and Sarah, did not come quite prepared to learn the English language, yet the family learned to say \"How do you make up?\" before Gaelic needed to say \"How do you make up?\"\n25. When was the first car used in the community? April-1911\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order.\n\n33. When did you come to Saskatchewan? The first line was it with the idea of settling permanently or did you make up your mind after trying it out? Make this decision?\n\n34. Where the writer came to the West there was no other thought of anything only staying here and she has never regretted it. She was eight to eighteen years old when she came from England to Canada with her parents. They came from Nova Scotia with her mother and father.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome moved away to try and make a living elsewhere as the crops were not good and the buffalos bones were getting harder to collect. Still bones furnished the ready cash supply.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, many moved away but quite a number returned after finding out that other places were no better.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nThe writer was never important enough to hold any offices other than being Secretary of the Church for over twenty years, teaching in Sunday School etc.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nThe family who had their mother in the early 30's went to Church land to teach our daughter in the early 30's. They graduated from Grey Pines School and the words thirty say pupils pupil say ended talk English. A young girl graduated from Grey Pines School and will go another graduate would still be in school now closer than Kansas to Canada where they carried on almost.\n\n38. How did the places in your community get their names? (School districts, Post Offices, Villages, Railway stations, creeks, hills, etc.) Try to give (1) an origin and meaning of the name and occupation or person suggesting place-name; (2) date of its adoption; (3) date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nGlenwood was named after the first settlers who took up land there about six miles north of Reese.\n\n1883 There were six boys brothers all homesteaded near the townsite, the land from the town being bought from Adam Slaps. The first elevators were built in June 1911 and about then the Railroad was put through. The old homestead of the father was known far and wide as \"Slaps.\" He and his sons were homesteading from about 1885.\n\nCurrent in 1905.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome moved away to try and make a living.\n\nThe where, as the crops were not too good and the cattle were getting harder to collect. They found themselves in the ready cash supply.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes, many moved away but quite a number returned after finding out that other places were no better.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here giving dates wherever possible.\n\nMy wife was never employed enough to hold any office other than being Vice President of the Church for over thirty years teaching in Sunday School etc.\n\n37. If you or any of your family or friends were first to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nThe family like their mother were never very important.\n\nOne daughter in the early 30s went to Chordelands to finish school and the words \"Thirty say pupils pupils say enroll\" call back a young daughter graduated from Grey Pines and will another graduate would still be attending classes there.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) an origin and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given.\n\nData and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSkaggs Town was named after the first settlers who took up land there about six miles north of Reese.\n\nThere were six Skaggs brothers all homes located near the townsite, the land for the town being bought from Adam Skaggs. The first elevator was built in June 1911 and about then the railroad was put through. The old homestead of the father was sold through. He died at the age of 36. His sons were known far and wide as \"Skaggs.\"\n\nHe died at Marshalltown, Iowa when he was seventy-five years old.\n\nBuried in 1885.\n39. Questions regarding historical photos (continued):\n\nDo you have any photos or slides from the early days of the town? If so, please describe them.\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\nThere are three children: John Smith, age 12; Jane Doe, age 10; and Robert Johnson, age 8.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThere are many changes, such as coming great time for better and more not so good. The telephone, radio, and car have been added. The are among the better changes, whereas the places where church services and Sunday school used to be held are now used at the local grounds. On the early days the people both time to live and be neighbors, which is not the case now.\n\nPlease give the name and address of other persons who would answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nThank you.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know of any materials of diaries, letters, old photos and pictures, estate records, or other materials relating to the history of the town? If so, please describe them.\n\n40. If you have children or grandchildren, please give their names, ages, and occupations.\n\nThere are six children; three girls and three boys.\n\nAll married. Ward, Sherrill, Johnson, Young, Smith, and Davis.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nThere are many changes, some coming about for better and some not so good.\n\nThe telephone, radio, and air ambulance are among the better changes whereas the places where church service and Sunday school used to be held are now used for half a century. On the early days the people had to travel and be neighbors, which was nice. The town has many fine people who are the P.R. huge machines—go see how much they do.\n\n42. If anyone else has filled in this questionnaire for you, please leave their name and address here.\n\nFilled in by myself.\n\nDate: [Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1886_461.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6217, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1599, 5], [1599, 3186, 6], [3186, 4520, 7], [4520, 5954, 8], [5954, 7414, 9], [7414, 8735, 10], [8735, 10479, 11], [10479, 11921, 12], [11921, 13861, 13], [13861, 14744, 14], [14744, 16018, 15], [16018, 17123, 16], [17123, 19286, 17], [19286, 21501, 18], [21501, 22503, 19], [22503, 23636, 20], [23636, 23791, 21], [23791, 23945, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]