[{"id": "cb4a9a5fd8e996f8fc610fd8f0bc2a950c2ad313", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\nElizabeth E. Webster\nBalcarres\nBox 333\nSask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA scale of emphasis is given to the questions generally.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences. Some questions may not apply to your particular experience; however, they may provide information which will help others to understand the pioneer life in Saskatchewan. It is suggested that you try to answer all questions. If there is not enough space to answer the questions, please write on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did You Do?\", is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Elizabeth Emma Webster\n\n2. Your address: Balcarres, Saskatchewan\n\n3. Date: October 1, 1954\n\n4. Where were you born? (Give name of place and country): Haliburton, Ontario\n\n5. What was your father's name and occupation?: John Balbour, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): On June 18, 1954\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): I was three years old coming over in Aug.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Elizabeth Emma Webster\n2. Your address: Box 335, Balcarres, Sask.\n3. Date: January 1954\n4. Where were you born? (Give name of place and country): Ontario\n5. What was your father's name and occupation?: John Baggott, Farmer\n6. When did you come to Saskatchewan? (Give month and year): June 1884\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - New York\n   - Canada\n   - England\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it if you have a small child):\n   - It was in my teens, yes.\n9. What were your reasons for coming West?\n   - I was three years old coming from England.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?):\n\n---\n\n[Stamp] Approved July 1, 1954\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy parents' relatives and friends thought they were just coming west to be eaten up by wolves and shot by Indians. The revolution was brewing then.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith my family.\n\n13. What means of transportation did you use?\n\nC.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Sandia Head in Bill Boyd's hotel over night.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded at Balcarres, Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFor six years at Milestone.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy parents advised me to come to Western Canada because they thought it would be a good opportunity for me to learn more about the world.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\nWith my family.\n\n13. What means of transportation did you use?\n\nP.R.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, accidents, or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Indian Head in Bill Boyd's Hotel one night.\n\n16. Where did you settle or take up land?\n\nMy brother came straight at Balcarres, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nSaskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nI was married to Harold Webster on Nov 23, 1904.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy brothers and sisters came West at the same time; two stayed off at Portage la Prairie, the others came on to Balcarres homesteaded, some later went into other vocations.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nPerhaps education and religious experiences all experiences stand clearly in my memory.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nHorses and buggies, wagons, sleighs, autos etc. My parents attended church services, visited friends, attended to business. We were happy leading a normal life.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy brothers and sisters came West at the same time two stayed off at Regina, the others came on to Batoche.\n\n23. In times of particular experience of pioneer days that stand out in your memory, perhaps education and religious experiences all memories stand clearly in my memory.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur family attended church services, visited friends, attended business meetings, we were happily leading a normal life.\n25. When was the first car used in the community?\n   On 1911 or 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   My husband bought a Ford car about 1920.\n\n27. Where was your trading center? How far from your home?\n   Port-à-la-Croix, Indian Head, 1st named \"Ames\"\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Balcarres town and several other towns sprung up with the coming of the CPR, a branch line from Waskada in 1903.\n\n29. How often did you shop in the early days?\n   Whenever provisions were needed.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In 1903.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Nothing was bought through mail order catalogues except some articles of clothing and bedding.\n\n32. When did you first have a telephone and what company provided it?\n   On 1907, I think it was the Bell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   My family, the Balfours certainly came to Saskatchewan, or N.W.T., as it was then called, with the idea of staying which they did.\n25. When was the first car used in the community?\nOn 1911 or 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make?\nMy husband bought a Ford around 1920.\n\n27. Where was your trading center? How far from your home?\nSouth of Appalochian Road, Shamrock, Texas.\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nYes, with the opening of the 1919, a branch store from Wichita Falls in 1903.\n\n29. How often did you shop in the early days?\nWhen our neighbors were muddy.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\nOn 1903.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\nWhat kind of articles did you buy in this manner? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since this time period.\n\nNothing was bought through mail order catalogues except some articles of clothing and bedding.\n\n32. When did you first have a telephone and what company provided it?\nOn 1907, think it was the Bell Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nMy family, the Balloons, certainly came to Gleichen, Alberta, as it was then called, with the idea of staying which they did.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI can not recollect any except the Leach family in the 90's, why I do not know.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo one moved away, they stuck to it and won out as a consequence.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was largely responsible for organizing the Baleares School District No. 87 and was a trustee of the same and also for many years also in the building of the Methodist Church, the second in Bash. My brother Harold Baldwin was a charter member of the Mason Lodge, was the master when installed with the first in 1915.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nMy husband Harold J. Webster owned the first combine in the Baleares district.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nBaleares was called after a place in Scotland by that name by Robert Grayford the pioneer post-master in Indialantic Head in the early 80's.\n34. Did any people move away from your district prior to 1923? What reasons did they have for moving?\n\n35. Did many farmers own land during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here.\n\nMy father was largely responsible for organizing the Baleares School District No. 97 and was a trustee of the same and also served as a member of the school board in the building of the new schoolhouse. He was also a member of the Baleares Church Board of Directors.\n\n37. If you had any family living outside the district at any time, give their names and addresses.\n\nMy husband Harold was called to the pastorate in the Baleares district.\n\n38. How did the places in your community get their names? (School district, Post Office, Villages, etc.)\n\nBaleares was named by Robert Brown and the pioneer Methodists in the early 1800s.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have none.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have three children living, a son who is a graduate in science from Sask. University, George S. Webster, at present managing his late father's estate. A daughter Alice, a school teacher, an R.S.T.M., now married to the manager of the Royal Bank in Bull River. Have a grandson named Mr. Regina.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nHospitalization, electrification, good roads, educational facilities, religious advantages and mechanized farming.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n29. Questions regarding historical sources materials:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ...........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nName three children living, a son who is a graduate in science and a daughter who is a student at the University of Saskatchewan. The other two children are married to the man and woman who own the farm in Bull River, where a school district No. 37 was located.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst: Education. Better facilities, religious advantages and mechanized farming.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_441.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4920, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2033, 5], [2033, 3958, 6], [3958, 5133, 7], [5133, 6319, 8], [6319, 7278, 9], [7278, 8202, 10], [8202, 9346, 11], [9346, 10290, 12], [10290, 11833, 13], [11833, 13302, 14], [13302, 14958, 15], [14958, 15882, 16], [15882, 17339, 17], [17339, 18480, 18], [18480, 18627, 19], [18627, 18781, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]