[{"id": "c721e8a3edbe940a4add250db78966f28acb7d62", "text": "It is difficult to prepare a general questionnaire in place like because no individual who is asked to answer it has exactly the same experience as another. Some of the questions here will not apply to your experiences or vice versa.\n\nThis questionnaire is intended for persons who lived in Eastern Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nThis questionnaire is divided into two parts. The first part contains questions which are designed to give details, or describe particular events, if they help to answer the questions.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pioneers East\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nExplorer health conditions\nExplorer social life, sports and recreation\nExplorer housing\nExplorer education and employment\nExplorer farming experience\n\nExpressation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Plots: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). \n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Plots: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nJULY 1964\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA list of questions relating to the pioneer experiences in Western Canada.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be used by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than two members of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Days,\" was distributed by the Saskatchewan Provincial Archives and will be prepared by the Archives staff.\n\nSome of these are listed below. Please mark the ones you will be willing to answer.\n\nAll questionnaires must be returned to the Saskatchewan Archives Board.\n\nProvincial Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A QUIZ FOR EVERYONE\n\nNOTE: Please print all proper names and places in capital letters. If you are not sure the name is correct, ask someone else to do the writing at your desk. If you have someone else do the writing, this is your responsibility.\n\n1. Your full name: JOHN COWELL\n2. Your address: 823 Ave. S., South, Saskatoon, Sask.\n3. Date: MAY 20, 1954\n4. Where were you born? (Give name of place and country): ASHTON-IN-WINKERFIELD, ENGLAND\n5. What was your father's name and occupation? T. W. COWELL FARMING\n6. When did you come to Saskatchewan? (Give month and year): NOVEMBER 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: FILE, LA-PORTE, LA-PRAIRIE (APRIL 1903)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming west? I CAME WITH THE INTENTION OF TAKING UP ONE OF THESE 1/4 ACRES FREE AS DAD SAID HE WOULD HELP ME, BUT WHEN I ARRIVED IN WINNIPEG WAS ADVISED TO WORK OUT FOR A YEAR.\n\nGOVERNMENT INFORMATION\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n1. Your full name: John Cowell\n\n2. Your address: 823 Avenue I South, Saskatoon, Saskatchewan\n\n3. Date: May 4th, 1954\n\n4. Where were you born? (City, town or place and country): Ashton-in-Makerfield, Lancashire, England\n\n5. What was your father's name and occupation? T.W. Cowell, farming\n\n6. When did you come to Saskatchewan? (Give month and year): November 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Portage-la-Prairie (April 1903)\n\n8. How old were you when you first came to Western Canada? (You do not need to give this in my terms, etc.)\n\n9. That were your reasons for coming West? I came with the intention of taking up one of these 160-acre free as dad said he would help me, but when I arrived in Winnipeg, was advised to work out for a year.\n\n---\n\nGovernment Information\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n---\n\nSaskatchewan Archives Questionnaire\n\nPioneer Experiences: A General Questionnaire\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. Did you know a living person in Canada? If so, what was their name?\n\n14. How did you get to Canada? By train, boat, car, or plane?\n\n15. What were your first impressions of Canada when you arrived?\n\n16. What was your first job in Canada?\n\n17. What was your first home in Canada?\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? GH, CO AND SOON WE WILL COME\n\n12. Did you travel by yourself or with a party (family, friends or other group)? DID NOT KNOW A LIVING PERSON IN CANADA IF I CAME WITH A PARTY CALLED RUMSEY'S PARTY OF FARMERS BUT WE NEVER SAW THIS RUMSEY\n\n13. How many of us went on the trip? ABOUT 60 OF US BUT WE NEVER SAW THIS RUMSEY\n\n14. What was the name of the town we came from? ON THE TUNISIAN WE WERE ON THE ATLANTIC THE SAME TIME AS THE BATLKE LAKE MANITOBA WHICH WAS CARRYING THE BARR COLONY\n\n15. What incidents of the journey West do you remember? (People you met on the trip, meetings with Indians, adventures on the journey, accidents or other experiences)\n\nWE WERE THOUSANDS LIKE ME AND WE HAD A LONG WAIT IN WINNIPEG AND FINALLY WE GOT AWAY ABOUT 15 OF US ALL GOING TO THE SAME PLACE FARM WE THOUGHT TO A FELLOW NAMED SEXMETH J. BELIEVE IT WAS AT HIGH BLUFF MAN BUT WE SOON FOUND OUT IT WAS NO FARM BUT IT WAS THE POST OFFICE AND WE WERE DUMPED THERE TO LOOK FOR WORK OURSELVES MOST OF US WALKED AROUND FOR 2 WEEKS AND MOST OF THEM TOOK JOBS AT PRATCE GREEK 3 DOLLARS A MONTH. FINALLY GOT ONE AT 15 BUT AT SNIDERS/FARM\n\n16. Where did you first stay when you arrived in Saskatchewan? WE HOSTED AROUND FOR A HOMESTEAD IN THE SUMMER OF 1906 WE WERE AT NUT MOUNTAIN PULL LANE AND F. NAVY WATSON AND ALL AROUND THESE PLACES AND F. NAVY\n\n17. Mention any other places where you have lived since coming to Saskatchewan. WE MOVED FROM JANSEN MAR 1929 AND SETTLED AT MULLINGAR WE TOOK A CAR OF SETTLERS EFFECTS AND IT WAS THE FASTEST CAR TO ARRIVE IN MULLINGAR MARCH 1929\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI LEARNED CARPENTRY WHEN I WAS 14 BUT ALWAYS WORKED ON A FARM TOOK UP A SECOND HOMESTEAD ADJOINING MEETING LAKE AND RENTED A SEC OF LAND 3/4 MILES NORTH OF MULLINGAR FOR 3 YEARS AND STARTED A GENERAL STORE AND GARAGE ALSO LUMBER, GRAIN, WOOD & BUSINESS\n13. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband and wife along with the place and date of marriage.\n\n21. Did anyone else come to Sackett's Bay because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West at the same time and worked for Dad, but went back after a short time, please list them.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Only for church and community club meetings where held in the larger houses we had oxen and our means of transportation was oxen on a stone boat the first year after that we had a horse and buggy.\n19. How soon did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband/wife and place of marriage.\n\n21. Did anyone else come to Saskatchewan before you? If so, when and where?\n\n22. If other members of your family came to Canada, when and where?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of transportation?\n\n25. Only for church and community club meetings\n\n26. Where held in the larger houses\n\n27. We had oxen and our means of transportation was oxen on a stone boat the first years after that we had a horse and buggy\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? We had a P.O. called Prairrie Rose Station 28 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\nJansen Town started to build in 1909 and that was our trading town and the Prairrie Rose store and post office were moved to Jansen.\n\n29. How often did you shop in the early days? Once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1907 we that is most of us took Saturday off some played baseball and other games.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nVery little mail orders in them days.\n\n(telephone) Prairrie Rose\n\nWe according to my records were getting about half of our groceries and most clothing from Eaton's in 1917 we did this from 1917 to 1929.\n\nRecords lost before 1917.\n\n32. When did you first have a telephone and what company provided it?\n\nPrairrie Rose Tel Co was formed in 1917.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYes. 1903\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? That makes\n\n27. Where was your trading center? How far from your home? We had a P.O.\n\ncalled Prairie Rose 2 mile and got mail once a week\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\nJansen Town started to build in 1909 and that\n\nwas our trading town and the Prairie Rose store\n\nand post office were moved to Jansen\n\n29. How often did you shop in the early days? Once a week\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays? 1907 we that is most of us took sat afternoon\n\noff some played baseball and other games\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWas kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order either the same or increased.\n\nvery little mail orders in them days\n\n(telephone) Prairie Rose\n\nwe according to my records were getting\n\nabout half of our groceries and most clothing\n\nfrom Eaton's in 1917 we did this from 1917 to 1929\n\nrecords lost before 1917\n\n32. Then did you first have a telephone and what company provided it?\n\nPrairie Rose Tel Co was formed in 1917\n\n33. When you came to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? When did you\n\nmake this decision?\n\nyes 1903\n35. Did many people move away during the 1930-40's? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and origin, (2) meaning of place name, (3) date of its adoption. Give facts or new name since above in (1), (2), (3).\n\nVILLAGE OF JANSEN FROM AN EARLY SETTLER\n\nSENATOR JANSEN AND HIS BROTHER STARTED A RANCH BEFORE MY TIME THEY CAME FROM USA.\n35. Did many people move away during the 1930s? If so, how many returned?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention its name here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having something done in the district mentioned here, give details of what was done (e.g., organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School district, Post Office, Villages, Railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person buying land; (2) origin and meaning of the name; (3) date of its adoption (4) any change in name since the first name was given, date and reason for change.\n\nVILLAGE OF JANSEN FROM AN EARLY SETTLER\n\nSENATOR JANSEN AND HIS BROTHER STARTED A RANCH BEFORE MY TIME THEY CAME FROM U.S.A.\n| Assessment Number | Number of Acres | Valuation |\n|-------------------|-----------------|-----------|\n|                   |                 |           |\n\n| Part of Section | Section | Township | Range | W. of Meridian |\n|-----------------|---------|----------|-------|---------------|\n\n| CURRENT TAXES | Mills on the Dollar |\n|---------------|---------------------|\n| Municipal     |                     |\n| School        |                     |\n| Telephone     |                     |\n| Public Revenue|                     |\n| Wild Lands    |                     |\n| Hail Insurance|                     |\n| Supplementary Revenue |       |\n\n| Total Current | Arraignment and Penalties | Costs of Advertising, if any |\n|---------------|---------------------------|------------------------------|\n|               |                           |                              |\n\nTotal to Pay $\n### TAX NOTICE\n\n**RURAL MUNICIPALITY OF PRAIRIE ROSE**\n\n**No. 309**\n\nTo Mr. Jansen\n\n---\n\n| Assessment Number | Number of Acres | Valuation |\n|-------------------|-----------------|-----------|\n|                   |                 |           |\n\n| Part of Section   | Section        | Township  |\n|-------------------|---------------|-----------|\n|                   |               |           |\n\n| Range             | W. of Meridian |\n|-------------------|---------------|\n|                   |               |\n\n---\n\n**CURRENT TAXES**\n\n| Description       | Rate/Mill on the Dollar |\n|-------------------|-------------------------|\n| Municipal         |                         |\n| School            |                         |\n| Telephone         |                         |\n| Public Revenue    |                         |\n| Wild Lands        |                         |\n| Hail Insurance    |                         |\n| Supplementary Revenue |                     |\n\n---\n\n**Total Current**\n\n| Description       | Amount |\n|-------------------|--------|\n| Arrarant and Penalties | $      |\n| Costs of Advertising, if any | $      |\n\n---\n\n**Total To Pay**\n\n$666.66\n\n---\n\nThe above amount is payable at par until December 31st next; after that date 5% penalty is added to all arrears unpaid, except for Hall assessments.\n\nThe above amount is payable at par until December 31st next; after that date 5% penalty is added to all arrears unpaid, except for Hall assessments.\n\n---\n\n**PAYMENT OF TAXES MUST BE MADE WITHIN 30 DAYS FROM THE DATE OF THIS NOTICE**, failing which the amount due may be collected by tax sale or other legal proceedings.\n\n---\n\n**PRODUCE THIS NOTICE WHEN PAYING TAXES**\n\n---\n\n**JANSEN**\n| Assessment Number | 1042 |\n|-------------------|------|\n| Number of Acres   | 100 |\n| Valuation         | $1050 |\n| Part of Section   | 8E |\n| Section           | 24 |\n| Township          | 33 |\n| Range             | 20 |\n| W. of Meridian    | $2 |\n\n**CURRENT TAXES**\n\n- Municipal: 6 Mills on the Dollar = $13.65\n- School: 5 Mills on the Dollar = $9.75\n- Telephone: 2 Mills on the Dollar = $10.90\n- Public Revenue: 10 Mills on the Dollar = $39.00\n- Wild Lands: 4 cents per acre = $6.40\n- Hail Insurance: 4 cents per acre = $1.60\n- Supplementary Revenue: / cent per acre = $\n\n**Total Current**: $46.20\n\n**Arrears and Penalties**: $50.44\n\n**Costs of Advertising, if any**: $0\n\n**Total to Pay**: $96.64\n| Assessment Number | Number of Acres | Valuation | Part of Section | Section | Township | Range | W. of Meridian |\n|-------------------|-----------------|-----------|----------------|--------|----------|-------|---------------|\n|                   |                 |           |                |        |          |       |               |\n\n**CURRENT TAXES**\n\n- Municipal: $13.65\n- School: $9.45\n- Telephone: $10.90\n- Public Revenue: $3.90\n- Wild Lands: $10\n- Hail Insurance: $6.40\n- Supplementary Revenue: $1.60\n- Total Current: $46.20\n\n**Arrears and Penalties**\n\n- Costs of Advertising, if any: $50.44\n\n**Total to Pay**: $96.64\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, photo albums, books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nMy diaries were lost when moving to Saskatoon. I have a lot of photos of oxen sod houses etc., which you are welcome to. Photos is my hobby and I will give you any photos I may want also.\n\nWould you or the person who owns them either lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nOur eldest son W. Cowell is business manager of Weyburn City Hospital, our second son is farming in Mollin Car District, our only daughter is married to Mr. W. W. Paterson, principle of Netherhill School. Our third son, flying officer J. W. Cowell is stationed with the R.C.A.F. at Ottawa. Our youngest son is with Teaton.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nYoung people is not satisfied to stay on farm. They seem to want to get to city. I ask some of them why. Oh more pleasures in the city. I think this is a drawback for the farmer especially the mixed as it is almost impossible to get a man to milk cows feed pigs pick stones etc.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Waithman Sutherland\n\nMr. E. Moore Le Roy\n\nMr. A. H. McLeod\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nQuestion regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and newspapers, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (Genealogy).\n\nMy diaries were lost when moving to Saskatoon. I have a lot of photos of oxen sod houses etc., which you are welcome to.\n\nPhotos is my hobby and I will give you any photos if you may want also.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any.)\n\nIf so, please give photos.\n\n4c. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur eldest son W. Cowell is business manager of Weyburn City Hospital, our second son is farming in Weyburn near district, our only daughter is married to Mr. W. M. Paterson, principal of Netherhill School. Our third son flying officer J. W. Cowell is stationed with the R.C.A.F. at Ottawa our youngest son is with Teaton.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nYoung people is not satisfied to stay on farm. They seem to want to get to city, I ask some of them why. Oh more pleasures in the city. I think this is a drawback for the farmer especially the mixed. As it is almost impossible to get a man to milk cows feed pigs pick stones etc.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Waithman Sutherland\n\nMr. E. Moore Le Roy\n\nMr. A. H. McLeod\n\nIf someone else has filled in this questionnaire for you, please have this person sign name and address here:\nJohn Cowell\n823 Ave. J South\nSaskatoon\n\nJuly 12, 1954\nJohn Cowell\n823 Ave J South\nSaskatoon\n\nJuly 12, 1954\nDear Sir,\n\nExcuse delay as I had to get some information on account of my business.\n\nLost from 1903 to 1914.\n\nI have the obligation of all photos and will gladly send any of them to anyone interested. I have between 1000 and 2000 from my touring England 1903 to the present.\n\nEvery information I have given in my reply I am well pleased.\n\nYours faithfully,\n\nY. Bowell\n\n823 Chester Youth\n\nSeyboldtown\nDear Sir,\n\n923 Chelmsford\n\nExcuse delay as I had to get some information on cheques of my business being lost from 1903 to 1914.\n\nI fear the obligations of all photos and will gladly lend any of them to anyone interested. I have between 1000 and 2000 from my leaving England 1903 to the present.\n\nIf any information I have given is not correct I am well aware. Kindly inform me if you require any further information.\n\nYours faithfully,\n\nY. Cowell\n\n923 Chelmsford\n\nSuffolk\nOlly Howell with our first cow\nOtto & Howell with our first cow\nEllen G. Howard 1908\nshe cut all the crops\nthat year with 3 oxen\nx@ wmn\nEllen G. Howard 1908\nshe cut all the crops\nthat year with 3 cows\nx @ well\n1918\n\nKids at play\nOur family just before going to Fort Reif from left to right:\n\n- Cowell, Weyburn\n- Cowell, Hamilton\n- Cowell, Saskatchewan\n- Cowell, Ottawa\n\nJ W Cowell, Ottawa\nMrs. Paterson Netherhill\n\nAll our sons and son-in-law were through the war and all alive today.\nOur family just before going to Fort Reif from left to right: myself Conwell, Weyburn chief of Conwell Garmentoon CM - Chilham MT - Sashatoon Slim - Two Lower J W Conwell, Ottawa Mrs R Paterson Netherhill All our sons and son-in-law were all through the war and all alive today\nour family just before going to York R.E.H.P.\nfrom left to r\nmyself Cowell, Weyburn\nclergy Cowell, Hartleton\nM.T. - Millington\nslim - Sashatoon\nwomen two\nJ.W. Cowell, Ottawa\nMrs. Paterson Netherhill\n\nall our sons and son-in-law were all through the war and all alive today\nour family just before going to York Redford from left to r\nmyself Cowell, Weyburn\ncharly Cowell, Hartleton\ncm - Millington\nmt - Sashamton\nslen - Sashamton\nwomen two\nJ W Cowell, Ottawa\nmasr Paterson Netherhill\n\nall our sons and\nson-in-law were\nall through the\nwar and all alive today\nMr. O'Connell 1947\nhouse in Mullingar\nstruct 1912\nMr Carroll 147\ntown in Mullingar\ndistrict 1912\nWill Cowell first house in Jansen district\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_899.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 74, "total-input-tokens": 122840, "total-output-tokens": 8565, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1640, 5], [1640, 2618, 6], [2618, 3506, 7], [3506, 3506, 8], [3506, 4809, 9], [4809, 6071, 10], [6071, 6610, 11], [6610, 8596, 12], [8596, 9510, 13], [9510, 10300, 14], [10300, 11805, 15], [11805, 13380, 16], [13380, 14239, 17], [14239, 15136, 18], [15136, 16027, 19], [16027, 17735, 20], [17735, 18437, 21], [18437, 19069, 22], [19069, 20968, 23], [20968, 22849, 24], [22849, 22903, 25], [22903, 22956, 26], [22956, 23356, 27], [23356, 23829, 28], [23829, 23829, 29], [23829, 23829, 30], [23829, 23829, 31], [23829, 23829, 32], [23829, 23829, 33], [23829, 23829, 34], [23829, 23829, 35], [23829, 23829, 36], [23829, 23860, 37], [23860, 23893, 38], [23893, 23893, 39], [23893, 23893, 40], [23893, 23893, 41], [23893, 23893, 42], [23893, 23965, 43], [23965, 24039, 44], [24039, 24039, 45], [24039, 24039, 46], [24039, 24039, 47], [24039, 24039, 48], [24039, 24058, 49], [24058, 24058, 50], [24058, 24058, 51], [24058, 24058, 52], [24058, 24058, 53], [24058, 24058, 54], [24058, 24314, 55], [24314, 24592, 56], [24592, 24592, 57], [24592, 24592, 58], [24592, 24865, 59], [24865, 25149, 60], [25149, 25199, 61], [25199, 25246, 62], [25246, 25246, 63], [25246, 25246, 64], [25246, 25246, 65], [25246, 25246, 66], [25246, 25246, 67], [25246, 25246, 68], [25246, 25289, 69], [25289, 25289, 70], [25289, 25289, 71], [25289, 25289, 72], [25289, 25289, 73], [25289, 25289, 74]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "en", "None", "None", "None", "None", "en", "None", "None", "None", "None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "en", "None", "None", "None", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]