[{"id": "c4943ac8346848c80013c4e44b9da561a775f4f2", "text": "S-X2\n664. Schmidt Myrtle G. (Mrs. E.H.)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Stats: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Myrtle G. Schmidt\n\n2. Your address: 106 E. Saskatchewan Ave.\n\n3. Date: January 23, 1952\n\n4. Where were you born? (Give name of place and country): Beaver Dam, Wise, U.S.A.\n\n5. What was your father's name and occupation?: P.O. Sommerfeld, farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 8th, 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Wisconsin, Minnesota moving to Wisconsin in Oct. 1895\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): I was 13 that year\n\n9. What were your reasons for coming West?: We were a family of six children, four boys, land was cheaper, cold out on farms in Maine, and bought more land for a growing family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Government information\nS-X2\n664. Schmidt Myrtle G. (Mrs. E.H.)\n\nSchmidt, Myrtle G.,\n1000 Dufferin Ave., Saskatoon.\n\nTo Sask. - April, 1902\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Myrtle G. Schmidt\n2. Your address: 1100 Dufferin Ave., Saskatoon\n3. Date: June 2, 1952\n4. Where were you born? Prince Albert, Saskatchewan\n5. What was your father's name and occupation?\n   Mr. Schmidt, farmer\n6. When did you come to Saskatoon? April 8th, 1902\n7. Mention any other places where you lived before coming to Saskatoon, giving dates wherever possible.\n   Moved from Wascana in Oct. 1895\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming to Western Canada?\n\nMy parents took trips, heard wonderful stories about the prairies, and thought we could find more land for a growing family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought my Dad was crazy and had the wanderlust again so he had moved from Wisconsin.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Traveled in a group my father, mother & children all came with us. We had 80 stock cars with two passenger cars. All the families.\n\n13. What means of transportation did you use? Railroad\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). Just one place Indians were a bit hostile, other wise the most excitement seemed to get off the train and get food for all these people and we got some of the nicest beef I have ever smelled or tasted since, for recreation on the train one ride one car got up a program and entertained the other then we had a good trip and enjoyed it very much. We also had musicians and some very nice women.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed in the car on the coast, on the way to Saskatoon until we got there. We moved right into that land and built a granary and we moved right into that.\n\n16. Where did you settle or take up land? My Dad took his land up where the Lutheran Seminary now stands.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. I have always lived on the farm close to Saskatoon until 11 years ago when we retired and moved to town.\n\n18. How did you earn a living before coming to Western Canada? How after you came? We lived on a farm in Minnesota, also here, there were other industries done but mostly farming, such as a lumber yard where C.H. Wentz now operates.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought my dad was crazy to go there.\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)? Traveled with a group, my mother, mother-in-law, and four families.\n\n13. What means of transportation did you use? Railroad\n\n14. What incidents of the journey West do you remember? People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.\n\n15. How much did we spend on the trip? Very much, we spent $100.\n\n16. Where did you live in the early years? Saskatchewan.\n\n17. How did you earn a living before coming to Western Canada? How often did you come?\n\nWe lived on a farm near Minneola, Alberta. There were other industries done by mostly farming, such as a lumber yard where C.K. Whitney runs operations.\n19. How often did you write to relatives or friends in your old home?\nquite often at first and then dwindled until now we are only in touch with two or three.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nmy husband E.H. Schmidt\nmarried March 9th 1910\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nyes Relations my fathers sister H. Richards\nmothers sister Mrs. John Dahl O. Zimmerman\nmothers sister there all had families. Also friend Carl & Casper Johnson, G. Shultz, P. Heggie\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nWe were a young family four boys and two girls, all came with our parents.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nI think most particular experience and fear was prairie fire and blizzards in the winter there were no roads just trails and if there was a blizzard and one got off the trail they were soon lost. My Dad went all the way to Beaver creek to get our wood, it was a long way with horses and often a blizzard would come up during the day.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nyes we were only a mile from Saskatoon usually got there a couple times a week to get the mail when ever there wasn't train the first winter we were as long as 8 weeks without a train and then they brought sugar, sugar - um roasted coffee, I guess the Easterners must have thought we didn't know anything so what things should be.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a pleasure to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How often? How far?\n\n25. We were only a mile from Saskatoon, usually got the mail twice a week to get the dried winter we were using as fuel. With such a heavy load as we had, we could not have made it without help.\n25. When was the first car used in the community? We think Fred Kerr was the first one we remember.\n\n26. If you owned a car before 1914, when did you buy it? What make? We got our first car 1911, a Ford.\n\n27. Where was your trading center? How far from your home? Saskatoon 1 mile\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) always have lived near Saskatoon\n\n29. How often did you shop in the early days? every week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? As long as I can remember, we made butter and peddled at every fair.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. We have done very little catalogue buying; rather see our purchases.\n\n32. When did you first have a telephone and what company provided it? I think we got our first phone in 1911, \"Northern Bell.\"\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My father came in 1901 and bought expecting to stay, moved the family in the spring of 1902 and we all liked it. We had a good time making our own fun by forming literary society and kitchen dances, + card parties.\n25. When was the first car used in the community? We think it was summer of 1911.\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.) Always have lived near trading center.\n\n29. How often did you shop in the early days? Every week.\n\n30. Then (if ever) did people in your district first start going to town regularly\n\non Saturdays and/or every summer? We never had a regular store.\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of catalogues did you buy in this way? Indicate also what proportion of\n\nyour total purchases were by mail order and changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nWe have done very little Catalogue buying; rather at own purchase.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you come to Saskatchewan the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? Then did you\n\nmake this decision in 1911?\n\nMy Father came in 1911 and thought\n\nexpecting it start moved the Family an,\n\nthe spring of 1912 and we all liked\n\nit we had a great time making our home\n\nplace by family living only with Mother\n\nhaving to work part-time.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? I don't think many of any moved away quite a number started moving into the city and leaving the younger ones on the farm.\n\n35. Did many people move away during the 1930's? Did many return? Yes, some have returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. My father was on the public school board also city council also town as member of parliament & my oldest brother H. H. Sommerfeld is president of the Dairy Producers Co-op municipality on medical health board and a number of other public offices.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.). My father was the first milk delivery in Saskatoon, owned and operated from his own farm and produced by his own cows.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI only know Saskatoon was on the north side of the river and Montana south and is still known as such.\n34. Did any people move away from your district prior to 1941? If so, what reasons did they have for moving?\n\nMy father was in the public office as mayor and city councilman as well as my uncle. He was elected to serve on the Board of Directors of the Chamber of Commerce.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, some have returned.\n\n36. If you or some members of your family have held public offices, or have been active in any organization, please mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the history of your community, please give details wherever possible. (Such as owning the first automobile, building, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railroads, stations, creeks, hills, etc.) Try to give the name and location of person suggesting place-name (2) origin and meaning (3) date of its adoption (4) any changes in names since the first time was given (5) data and reason for change.\n\nI only know that the river was named South and is still known as such.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nI am sorry we didn't keep a diary.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have two children G. P. Schmidt - rural Saskatoon + one daughter Mrs. T. J. Kehle North Battleford her husband is a W. Star oil manager. We have two Grand children Alan H. Schmidt + Darren Peter both attending school in city.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads, improved farms and farm conditions and the wonderful expansion of our beautiful city.\n\nFrank Brady, Grandora Sask.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n\n__________________________\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ...........................................\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have two children, Mr. Schmidt and Mrs. Smith. Our only daughter was Mrs. Taylor.\n\nWhat do you think are the most important changes in your community since the first came here? Please give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nYour signature: __________________________\n\nYour name: __________________________\n\nYour address: __________________________\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_664.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4759, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 40, 4], [40, 1906, 5], [1906, 1906, 6], [1906, 3029, 7], [3029, 4073, 8], [4073, 5839, 9], [5839, 6711, 10], [6711, 8439, 11], [8439, 9286, 12], [9286, 10825, 13], [10825, 12325, 14], [12325, 13903, 15], [13903, 15090, 16], [15090, 16565, 17], [16565, 17509, 18], [17509, 17645, 19], [17645, 17799, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]