[{"id": "3fa1071d99af3f7e5477451315592faaf49d02ba", "text": "Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Edith Edward\nAddress: Box 12, A.A. Post Office Box\nBirthplace: Stanley, Pincher Creek County, Sask.\n\n1. INTRODUCTORY HISTORY\n   What year did you start housekeeping in Eastern Canada? 1892\n   Where did you get your housekeeping? Ashton, Sask.\n   Where had you been living before that? England\n   For how many people did you prepare meals? 6\n   How far was it to your nearest store? 3 miles\n   How often could a visit be made to the store? Twice monthly\n   What groceries did you usually buy in those earliest years? Flour, sugar, salt, tea, fruit, vegetables\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years?\n   In what quantities did you buy it? 100 lbs\n   What was the usual price per hundred pounds of white flour?\n   How much did you use Graham flour?\n   Whole wheat flour?\n   Was flour milled locally? Yes\n   How far away? 30 mi\n   What was the price for a twenty pound bag of rolled oats?\n   What other grain products did you use?\n   Cornmeal? Yes\n   Whole wheat? Yes\n   Farina? No\n   Other? No\n   Did you grind your own wheat for porridge? Yes\n   How did you grind it? With the old stone grinder or an ordinary meat grinder.\nDear Mr. Wilson,\n\nI am writing to express my gratitude for your kind assistance in the recent project. Your expertise and dedication have been invaluable throughout the process.\n\nThank you once again for your support.\n\nSincerely,\n\n[Your Name]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...........................................\nWhat was the price for a ten pound sack of white sugar? .......................\nWhat brand of golden corn syrup did you use? ..................................\nWhat size of tin of syrup did you usually buy? ..................................\nAt what price? ...................................................................................\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Bought\nfrom a cow and milked her.\nButter? Made it from cream.\nEggs? Purchased them.\nWhat was the price of butter? .......... of eggs? .........\nDid you pack eggs for winter? Not at first, but then packed\nthem in ice.\nDid you make butter? Yes\nCheese? Butter\nWhat kind of cheese? Something like soft cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Rabbit\nChickens (wild), Pheasant, chickens\nHow did you get fresh meat? A few people had\nfarms.\nHow often did you get fresh meat? In winter.\nHow did you preserve meat? Salted for summer.\nHas there a \"beef ring\" in your neighborhood? No\nIf so what year was it organized?\nDid you use game? Yes\nWhat kinds? Rabbits\nFor how long? About 1898\nWhat part did fish play in the family diet? A few were\ncaught in the woods, then they ice & salted\nWas the fish fresh, cured, or canned? Salted fresh or whole\nKinds? Buckeye fish\n3. Shopping and Recipes\n\nIn what quantity did you buy? (e.g., 10 pounds)\n\nWhat was the price per pound? (e.g., $2.50)\n\nWhat brand of food did you buy? (e.g., Heinz)\n\nWhat size of the item did you buy? (e.g., 16 oz.)\n\n4. Daily Expenses\n\nHow did you pay? (e.g., cash, credit card)\n\nDid you use any coupons? (e.g., yes, no)\n\nDid you pack your own lunch? (e.g., yes, no)\n\nDid you take butter? (e.g., yes, no)\n\nDid you make cheese? (e.g., yes, no)\n\n5. Meat and Fish\n\nWas your meat supply in the family? (e.g., yes, no)\n\nFor how long? (e.g., 1 year)\n\nHow often did you eat fresh meat? (e.g., daily)\n\nHow did you prepare the meat? (e.g., roasted, baked)\n\nWas there a fisher plant in your neighborhood? (e.g., yes, no)\n\nIf so, what year was it organized? (e.g., 1978)\n\nDid you use fish? (e.g., yes, no)\n\nFor how long? (e.g., 1 year)\n\nWas the fish fresh, cured, or canned? (e.g., fresh)\n6. BEVERAGES\n\nWhat kind of tea did you buy? \nAt what price? \n\nWhat kind of coffee did you buy? (beans or ground) \nPrice? \nWhat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of:\nPotatoes \nCabbage \nCarrots \nOnions \nTurnips \nBeets \nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? \nWhat weight? \nHow did the grocer handle prunes (by box)? \nWhat was the price of prunes? \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)? \n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \npeas? \ncorn? \nbeans? \nSaskatoons? \nother foods? \n\nWhat year did you first preserve fruit by canning? \nWhat year did you first preserve vegetables by canning? \nWhat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \nTo what extent? \nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING ON THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                    |                     |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           |                                               |                                                   |                                    |                     |\n| Molasses              | about 1900                                     | (bulk jug)                                        |                                    | 10¢                 |\n| Table salt            | 1897-98                                        | sack, small sack                                 |                                    | 10¢                 |\n| Common salt           | 1892                                           |                                                   |                                    | 10¢                 |\n| Lily white syrup      | early 1910's bulk jug                          |                                                   |                                    |                     |\n| Toilet soap           | early 1900's                                   |                                                   |                                    |                     |\n| Baking powder         | 1896                                           |                                                   |                                    |                     |\n| Baking soda           | 1892                                           |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               | early 1900's bulk jug                          |                                                   |                                    | 10¢                 |\n| Raisins - seeded      | 1895-6                                         |                                                   |                                    | 1#                  |\n|                      | seedless                                       |                                                   |                                    | 1#                  |\n| Rice                  | 1907                                           |                                                   |                                    | 1#                  |\n| Currants              | 1895-6                                         |                                                   |                                    | 1#                  |\n| Store jam - kinds?    | can't tell or in the 1900's                    |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) | after 1900                                      |                                                   |                                    |                     |\n| Vanilla               | \" 1900                                         |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Home made starter\nDid you make yeast for your own use? Yes\nUsing starter? Yes\nUsing hops? Yes\nSalt rising? Yes\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you bake your own baking powder? Yes mixed with tartar water\n10. Baking\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing starter? \nSalt rising? \nDid you buy baking powder? \nDid you make your own baking powder? \n\nyes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product in 1947-57 |\n|-----------------------------|-----------------------------------------|------------------------------|---------------------------------------------------|\n| Canned salmon               | early 1900's                            |                              |                                                   |\n| Canned sardines             |                                         |                              |                                                   |\n| Other canned fish that appeared early - give names |                     |                              |                                                   |\n| Apples - fresh              |                                         |                              |                                                   |\n|                             | dried                                   | 1897                         | darker                                            |\n| Lettuce                     |                                         |                              |                                                   |\n| Tomatoes - fresh            |                                         |                              |                                                   |\n|                             | canned                                  |                              |                                                   |\n| Bananas                     |                                         |                              |                                                   |\n| Lemons                      |                                         |                              |                                                   |\n| Oranges                     |                                         | 1897                         |                                                   |\n| Cornflakes                  |                                         | 1910-11                      |                                                   |\n| Other prepared breakfast cereals - give names |                     |                              |                                                   |\n| Pearl tapioca               |                                         | early 1900's                 |                                                   |\n| Minute tapioca              |                                         | 1925-30                      |                                                   |\n| Sago                        |                                         | 1896-7                       |                                                   |\n| Dates                       |                                         | early 1900's                 |                                                   |\n| Walnuts                     |                                         |                              |                                                   |\n| Icing sugar                 |                                         | 1910-11                      |                                                   |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) ... through (bottled water) ...\n\nHow far was this water from your home? ... 1 mile ...\n\nHow was it brought to the home? (pail, barrel, tank) ... tank ...\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nbored a well in 1905 then drilled me in 1911 or 12\nSurvey 1900\n\n11. Please tell us how much water you used in the past.\n\n| Item          | Year       |\n|---------------|------------|\n| Corn meal     | 1897       |\n| Tomatoes      | 1897       |\n| Other prepared vegetables - plate | 1897-11 |\n| Pearl tapioca | early 1900s |\n| Lima tapioca  | 1925-30    |\n| Sugar         | 1896-7     |\n| D. tea        | early 1900s |\n| Salt water    |           |\n| Iodine sugar  | 1910-11    |\n\n12. Water Supply\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your home?\n\nWas it brought to the house? (well, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nI found a well in 1900. They drilled me in 1911.\n13. SOAP\n\nDid you buy laundry soap or make your own? ____________________________\nIf you made your own, did you use lye? ________________ wood ashes? ___________\nWhat kinds of laundry soap did the grocer handle? ____________________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ____________________________\nWhere did you get your fuel? ____________________________\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nThere are electric ranges now as far back as maybe 25 yrs and now oil is used extensively and propane gas.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) _______________________________________________________\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ________________\n\nBy whom was your first cook stove made? ____________________________\nWhat year was it purchased? _______ Price? ____________________________\nWhat types of utensils did you use? (Iron, copper, tin, homemade) __________\n______________________________________________________________\n\nFor preparing food? (china, earthenware, wooden bowls, other) __________\n______________________________________________________________\n\nWhen did you first see enamel ware? ____________________________\nAluminum? ____________________________\n13. S-X2\n54 Wilson, (Mrs. Robert Edward)\n\n13. S-X2\n54 Wilson, (Mrs. Robert Edward)\n\n14. FULL\nThat fuel did you use in the winter at home? (Give details)\nHave you not your fuel?\nHave you not your fuel?\n\n14. FULL\nThat fuel did you use in the winter at home? (Give details)\nHave you not your fuel?\nHave you not your fuel?\n\n15. FULL\nFor cooking, did you use an indoor fireplace or open hearth in the last year?\nDid you use an outdoor fireplace or back porch? (Give details)\nBy what was your first stove made?\nWhat year was it purchased? (Iron, copper, tin, homemade)\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\nFor preparing food (chili, barbecue, roast beef, other)\nWhen did you first use natural gas?\nAluminum?\n16. **Wrappings and Containers**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? _______Give the menu. List those present and give their approximate ages at that time.\n\nMaybe beef, mother, father and myself 25 28\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNot at home but my father was an Anglican clergyman & I used to go with him thru the country & met some pretty slim means. Remember once it was a sort of porridge made of flour & water.\nMay be they, mother, father\nand myself.\n\nAnd at home but my father was\nan Anglican clergyman & I went to\ngo with him then the curiosity & not gone\nparty slim mercury, remained ours if ever\na any g promise made? flaw & well.\n11. Mention any substantial differences in the preparation of meals in the wilderness days as compared with today.\n\nThere just wasn't any variety.\n\n12. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI still do all my baking except bread. I buy my butter and live in town (for a year). I also buy own chickens and eggs. Buy some breakfast cereals, cornflakes, flour, shredded wheat, cheese, peanut butter. Which by the way came in about 1918-19. We had an old man from the States with us for us and he was always talking about it. We asked our guests and he asked\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThis traveller and finally got us some. We didn't like it but have acquired the taste since. I can and dry corn & corn peas beans etc.\n\nIn the really early days we didn't know anything concerning it. We didn't get much till the Americans began to come up from the better farming ports. The U.S. I learned from an American. There was very little livestock and stock was kept for them & heifers & cows till we built up a little surplus. The houses were hard with earth floors and if we got a very hard floor it was very rough but spoken of also with more respect than\nhardwood nowadays. They were mostly one room, blue houses where we used to stay and hold services had the well water right in the kitchen, so we were going out in the winter when housekeeping needed water, since we had to use while someone else used her rope to pull up the water.\n\nWhen potatoes were first grown the farmers gave a banquet and invited the neighbors. Here Potatoes!!!\n\nThen came the electric power both on the farm and on the roads. Our family drove an ox and a cow and he could give the children a drink of milk.\n\nThere was no railway into Canada and supplies had to be hauled in from Carlingford Manor, Missouri.\n\nThere was very little furniture mostly beds built of poles and straw ticks. We kept a piano the only one for years. Then Dad had a small folding organ that was after 1900. He used to put it in a case he made and strap it on the back of the buggy and how it was appreciated at the various houses we stopped at.\n\nHis parish was from Estevan to Gainsborough, Postal to Carlingford Manor. Everyone came to church and it was held just wherever he was, I don't know how the word got around but it did. We got an occasional paper from England.\n\n[Signature]\nThey were not used mostly in town, but horses were used at a stage and hotel service. And the well water was used in the kitchen to save getting out water from the well. William needed water, so he held the pipe until Emma came back with her hopes to pull up the water.\n\nWhen potatoes were first grown by farmers, they grew a few and saved them for the winter. When potatoes were saved, they were stored in the cellar. The family would then eat them during the winter months.\n\nThe children had a chance to milk cows when there was no railway into Canada and supplies had to be hauled in from Cambridge.\n\nThere was only little furniture bought, such as chairs, tables, and chairs. The house was only one story high.\n\nPaul had a small growing organization in his garden after 1900. He used to put it in a box to move and ship it on the train. He bought various flowers in a shop at this time.\n\nThis period was from 1875 to 1890. Everyone came to school, but there were few people who attended. It was very hard to keep the school going around that time.\n\nIt was an occasional trip from England.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1892_54.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5024, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1352, 5], [1352, 1595, 6], [1595, 3008, 7], [3008, 3886, 8], [3886, 5032, 9], [5032, 5032, 10], [5032, 9666, 11], [9666, 9850, 12], [9850, 13656, 13], [13656, 14464, 14], [14464, 15885, 15], [15885, 16616, 16], [16616, 17524, 17], [17524, 17748, 18], [17748, 19311, 19], [19311, 19311, 20], [19311, 20493, 21], [20493, 21586, 22], [21586, 21586, 23], [21586, 21586, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]