[{"id": "3ff99debb89f22eec4142fbe731c32cd1b5a388c", "text": "What did women in Canada find out?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mrs. J. B. Hickey\nAddress: Box 121, Bethune, Sask.\nBirthplace: Allonby, Northumberland, England\n\n1. INDUSTRIAL HISTORY\n\nWhat year did you start housekeeping in Eastern Canada? 1912\nWhere did you set up housekeeping? Bethune, Sask.\nWhere had you been living before that? Henry, England\nFor how many people did you prepare meals? Sixteen or fewer\nHow far was it to your nearest store? About two miles\nHow often could a visit be made to the store? At least once a week\nWhat groceries did you usually buy in those earliest years? Flour, sugar, tea, rolled oats, prunes, macaroni, lard, sugar syrup, m. beans, rice, small items like spices etc., salt, pepper & mustard\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Royal Household\nIn what quantities did you buy it? About 30 lbs. for a year\nWhat was the usual price per hundred pounds of white flour? 25¢\nHow much did you use graham flour? A small quantity occasionally\nWhole wheat flour?\nWas flour milled locally? No\nHow far away? 37½ miles\nWhat was the price for a twenty pound bag of rolled oats? 96¢\nWhat other grain products did you use?\nCornmeal? Yes\nWhole wheat? Yes\nFarina? Yes\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it? With a hand mill, bought in 50 lb bags\n1912. Hickey, Mrs. J.B.\nBox 21, Bethune, Canada\n\nInterview Questions:\n\n1. What year did you start living in Bethune?\n   - Answer: [Blank]\n   - Where did you move from before that?\n   - Answer: [Blank]\n   - For how many people did you live there?\n   - Answer: [Blank]\n   - How far was it to your nearest store?\n   - Answer: [Blank]\n   - How often could a visit be made to the store?\n   - Answer: [Blank]\n   - What crops did you usually grow?\n   - Answer: [Blank]\n   - What animals did you keep?\n   - Answer: [Blank]\n   - What was your main source of income?\n   - Answer: [Blank]\n\n2. Flour and Other Grain Products:\n   - What brand of flour did you use in the early years?\n   - Answer: [Blank]\n   - How much did you buy each year?\n   - Answer: [Blank]\n   - In what quantities did you buy?\n   - Answer: [Blank]\n   - What was the usual price per hundred pounds at that time?\n   - Answer: [Blank]\n   - How much did you use regular flour?\n   - Answer: [Blank]\n   - How much did you use whole wheat flour?\n   - Answer: [Blank]\n   - Was flour milled locally?\n   - Answer: [Blank]\n   - How far away was the mill?\n   - Answer: [Blank]\n   - What was the price for a twenty-pound bag of rolled oats?\n   - Answer: [Blank]\n   - What other grain products did you use?\n   - Answer: [Blank]\n   - How much did you use?\n   - Answer: [Blank]\n   - Did you grow your own wheat for personal use?\n   - Answer: [Blank]\n   - How did you grind it?\n   - Answer: [Blank]\n3. **BEVERAGES**\n\nIn what quantity did you buy milk? (in lbs.)\n\nThat was the price for a ten pound box of whole milk?\n\nWhat brand of milk did you usually buy?\n\nWhat size of tin or cup did you usually use?\n\nAt what prices?\n\n4. **DAIRY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you make butter?\n\nDid you make cheese?\n\nWhat kind of cheese?\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days?\n\nDid you eat fish?\n\nHow often did you eat fish?\n\nDid you purchase meat?\n\nWas there a meat market in your neighborhood?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or preserved?\n\nKind of fish?\n3. **BEANS AND STUFFS**\n   - In what quantity did you buy \"Allie beans\"? (in lbs.)\n     - This was the price for a ten pound sack of whole beans?\n     - Brand of beans came from? Did you use it?\n     - Size of tin or syrup did you usually buy at that price?\n\n4. **DAIRY PRODUCTS**\n   - How did you get a supply of fresh milk in the early days?\n     - Butter made locally\n     - That was two quarts of butter?\n     - Did you make your own?\n     - Did you make butter?\n     - What kind of cheese?\n\n5. **MEAT AND FISH**\n   - What was your meat supply in the early days?\n     - How did you get fresh meat?\n     - How often did you eat fresh meat?\n     - How did you preserve meat?\n     - Was there a \"meat shop\" in your neighborhood?\n     - If so what year was it organized?\n     - Did you use meat?\n     - For how long?\n     - What was the main meat in the family diet?\n     - Was the fish fresh, canned, or smoked?\n     - Kind of fish\n6. Buyings:\n   - What kind of tea did you buy? (black, green)\n   - At what price?\n   - What kind of coffee did you buy? (ground or cream)\n   - Price?\n   - Other beverages used?\n\n7. Vegetables and Fruits:\n   - What was the price of potatoes per bushel when you bought them?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter?\n   - Potatoes:\n     - Turnips:\n     - Carrots:\n     - Cabbages:\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes? (in bulk or by the box)?\n   - What weights?\n   - How did the grocer handle prunes?\n   - What other dried fruits did you use in the winter?\n   - Apples, pears, apricots, peaches, lemons, raisins, currants or oranges?\n\n8. Preserving:\n   - In the early years did you preserve any foods by drying?\n   - Pass?\n   - Beans?\n   - Other foods?\n   - That year did you first preserve fruit by canning?\n   - What year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make your own vinegar?\n6. **BEVERAGES**\n   - What kind of tea did you buy? [Blank]\n   - What kind of coffee did you buy? (beans or ground) [Blank]\n   - Retailer [Blank]\n\n7. **VEGETABLES AND FRUITS**\n   - What was the price of potatoes per bushel? [Blank]\n   - Could you get potatoes at the store? [Blank]\n   - If not, where from? [Blank]\n   - What year did you first grow your own supply for the winter? [Blank]\n   - Potatoes [Blank]\n   - Turnips [Blank]\n   - In what quantities did you buy white navy beans? [Blank]\n   - How did you buy potatoes? (in bulk or by the box)? [Blank]\n   - What weights? [Blank]\n   - How did the grocer handle onions (by brick)? [Blank]\n   - What other dried fruits did you use in the summer days? (apricots, peaches, apricots, pears, raisins, currants, or others)? [Blank]\n\n8. **PRESERVES**\n   - In the early years did you preserve any foods by drying? [Blank]\n   - Other [Blank]\n   - Beans? [Blank]\n   - Satisfactory? [Blank]\n   - That year did you first preserve fruits by canning? [Blank]\n   - That year did you first preserve vegetables by canning? [Blank]\n   - Do you still preserve foods by canning or drying? [Blank]\n   - To that extent? [Blank]\n   - Did you make your own preserves? [Blank]\n| Item                  | Price |\n|-----------------------|-------|\n| Soda bicarbonate      | 10 lbs|\n| Brown sugar           | 5 lbs |\n| Table salt            | 50 lbs|\n| Lily white syrup      |       |\n| Toilet soap           |       |\n| Baking powder         |       |\n| Salt                   |       |\n| Bread mix             |       |\n| Flour                  |       |\n| Raisins               |       |\n| Rice                  |       |\n| Currants              |       |\n| Store jam             |       |\n| Cheese                |       |\n| Vanilla               |       |\n\n9. Please fill in the following on the reverse side.\n\n10. Baking\n\nWhat type of yeast did you use? [Blank]\nDid you make yeast for your own use? [Blank]\nUsing starter? [Blank]\nUsing hops? [Blank]\nDid you buy baking powder? [Blank]\nBaking soda? [Blank]\nDid you make your own baking powder? [Blank]\n| Item                  | Price |\n|-----------------------|-------|\n| Soda biscuit          | 10 lb.|\n| Sugar                 | 5 lb. |\n| Flour                 | 2 lb. |\n| Brown sugar           | 5 lb. |\n| Molasses              | 1 lb. |\n| Table salt            | 50 lb.|\n| Cream salt            |       |\n| Lily white syrup      |       |\n| Toilet soap           |       |\n| Baking powder         |       |\n| Baking soda           |       |\n| Bread mix             |       |\n| Dried corn            |       |\n| Vinegar               |       |\n| Raisins               |       |\n| Nuts                  |       |\n| Currants              |       |\n| Store jam - ketchup   |       |\n| Cheese (Cheddar or any) |     |\n| Vanilla               |       |\n\n10. Did you make your own yeast? Yes\n\nDid you make your own salt rising? Yes\n\nDid you make your own baking soda? Yes\n\nDid you make your own baking powder? Yes\n| Item                  | Quantity | Price |\n|-----------------------|----------|-------|\n| Canned salmon         |          |       |\n| Other canned fish    |          |       |\n| Fish that was previously cooked |          |       |\n| Apples - fresh        |          |       |\n| Apples - dried        |          |       |\n| Lettuce               |          |       |\n| Tomatoes - fresh      |          |       |\n| Tomatoes - canned     |          |       |\n| Bananas               |          |       |\n| Lemons                |          |       |\n| Tomatoes              |          |       |\n| Cornflakes            |          |       |\n| Other canned vegetables |          |       |\n| Pearled tapioca       |          |       |\n| Malted tapioca        |          |       |\n| Sugar                 |          |       |\n| Dates                 |          |       |\n| Walnuts               |          |       |\n| Icing sugar           |          |       |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, dugout)\n\nIf so, was this water from your house?\n\nHow was it brought to the house? (Well, barrel, tank)\n\nHas any change been made in the water supply since you first started homesteading, giving dates where possible.\n13. SMS\n\nDid you buy laundry soap or make your own? If so, how?\n\nIf you make your own, did you use lye? If so, how much?\n\nDid you use any other substances in the wash water? If so, what?\n\n14. FUEL\n\nCoal\n\nThat fuel did you use in the fall at 50°? If so, how much?\n\nThere did you not your fuel? If so, why?\n\nRation any chances in the use of fuel which have taken place since you first started housekeeping, stating dates where possible.\n\nTook you use wood or coal? If so, why?\n\nCharged this year to a boiler furnace using a small coal (either coal)\n\n15. IMPELERS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) If so, when?\n\nDid you use an outdoor fireplace or bake oven? (Give dates) If so, when?\n\nBy whom was your first cook stove made? (Name) Price?\n\nWhat year was it purchased? (Give date)\n\nThat type of utensils did you use? (Iron, copper, tin, earthenware)\n\nFor preparing food? (Glass, earthenware, wooden bowls, other)\n\nWhen did you first use metal pans? (Give date)\n\nAluminum?\n13. USING\n\nDid you buy laundry goods in any store? Yes or No.\n\nIf so, what store? Yes or No.\n\nWhat kind of laundry soap did you use? Yes or No.\n\nThere was no such thing as \"laundry soap\" then.\n\n14. FUEL\n\nThat fuel did you use in the earliest days? Yes or No.\n\nThere was no such thing as \"fuel\" then.\n\nMention any changes in the use of fuel which have taken place since you lived there.\n\n15. HEATING AND COOLING METHODS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? Yes or No.\n\nDid you use an outdoor fireplace or bake oven? Yes or No.\n\nBy whom was your first book stove made? Yes or No.\n\nNext year was it purchased by whom? Yes or No.\n\nWhat type of material did you use? Yes or No.\n\nFor preserving food (canning, pickling, etc.) what vessels, tools?\n\nWhen did you first use metal vessels? Yes or No.\n\nAluminum?\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate monthly cost, winter or summer.\n\n1912. Breakfast: oatmeal, bacon & eggs.\n\nMy husband & his children: April 30th, 1912.\n\nMyself: April 28th, 1912.\n\nDinner: canned meat, rice, pickled fruit.\n\nSoup: macaroni & cheese.\n\nWhat year did you serve your first Christmas dinner in eastern Canada?\n\n1913. My husband & I had a baby boy (Hugh) of 1 year.\n\nChristmas dinner: ham, potatoes, cranberry sauce, pie.\n\nLocally produced foods? Give details.\n\n19. Have you ever refused to accept starvation level living on any occasion?\n\nYes.\n\nWe killed beef & pork in the fall; fall was very short. We pickled & dried & kept some for spring use. We also had a little in storage. We also canned chicken & fruit if available.\n15. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n17. Breakfast: rolled oats, bacon & eggs\n\nMy husband, his birthday, April 28th, 1918.\n\nMyself, 28th April, 1918.\n\nThat year did you serve your first Christmas dinner in Canada? 1918.\n\nMy husband, 31st, his birthday, August 14th.\n\nQuestion: If a baby boy, what would you name him?\n\nGrape, cranberry sauce, prune, molasses pudding & mincemeat.\n\n19. Have you ever resorted to almost starvation level living on one or two locally produced foods? Give details.\n\nQuo:\n\nWe killed beef & pork in the fall; fell some hams we pickled & dried, kept some fresh in the fall; also had a lot of flour, sugar, molasses, applesauce, etc.\n\nWe also canned chicken & fruit if available.\nWe often had our own bacon beef.\n\nIn 1916 we started to order fruit from\n\nB. C. a school district would club together\n\nand regularly a fruit would be shipped an\n\nalfred, the fruit was perfect & quite\n\ndifferent to the fruit shipped in its local\n\narea. We still make our own butter, cannot\n\nafford fruit if possible & make bread.\n\nWe used to buy a large order from one of\n\nthe big wholesale houses, its quality was\n\nbetter & fresher, buying in quantities\n\nthe prices were better, I cannot think\n\nof those days, but it was a\n\nterrible difference I know from the funeral\n\nday if they're anything else you will\n\nnot know, it will arrive. Isn't that\n\nhow we anymore human here in our\n\nhome. So nice apr. 27th\nWe started our own creamery in 1916. We started to sell cream & eggs to the creamery. We always took our own bread, made our own cakes, brownies, etc., which were quite a big order during harvest time. Today we can buy necessary bread, cakes, etc., from the store.\n\nIn 1916 we started to order fruit from B.C. a school district around us together. We send together a friend to collect the apples and pears. The fruit was perfect & quite different to the fruit shipped in to the local stores. We also make our own butter, canned apples & fruit if possible & make bread.\n\nPlants and other details free. Your early cooperation of buying generous orders will be appreciated. We are further pleased to have in our community a wholesale grocer of sterling quality, methods of merchandising, the best of prices and service. It is our privilege to serve you.\n\nWe used to buy a large order from one of the big wholesale houses, its quality was better & fresher & buying in quantities. We prefer our own butters, canned fruits & other things, but it wasn't a terrible difference if bought from the farmer's market in anything else. You said you'd like to know, if we'll answer. I don't think so, any more. Please write soon.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12954_1912_1203.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4795, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1517, 5], [1517, 2959, 6], [2959, 3634, 7], [3634, 4567, 8], [4567, 5739, 9], [5739, 6945, 10], [6945, 7821, 11], [7821, 8729, 12], [8729, 9988, 13], [9988, 9988, 14], [9988, 11052, 15], [11052, 11900, 16], [11900, 12802, 17], [12802, 13700, 18], [13700, 14404, 19], [14404, 15619, 20], [15619, 15774, 21], [15774, 15928, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]