[{"id": "91b05c21a17008d7632ce0004a919d03d9db3398", "text": "Legislative Library\nArchives Division\nM. E. G. Drake\n\nDear Sir,\n\nYours of May 8th is read. In regard to the special questions in regard to the \"Demos\" I will like replies.\n\nM. L. Mrs. Duplex who was a working partner in the \"Demos\" married and decided to join B.C. as financial returns from the paper were very small.\n\nM. 2. Before my father died my eldest brother Douglas worked in the office with father. He enlisted with Lord Strathcona's Horse and went to South Africa returning in 1903. Then he went to Red Deer, Edmonton, Zacora and finally to Vancouver B.C. Then he lives in the Province until he retired - died in 1956. After Duplex left for the Pacific coast over and worked a couple years with the Esquimalt.\nDear Mr. MacKinnon,\n\nI am writing to you in May 1953. I am interested in applying for the position of Special Assistant in the Department of Finance and Planning in B.C., as per attached application form.\n\nNo. 1. I am a single man, aged 28 years, residing at 123 Main Street, Vancouver, B.C.\n\nNo. 2. Before my marriage, I worked as an accountant in the Office of the Auditor General of British Columbia.\n\nI am enclosing my resume and references.\n\nSincerely,\n\n[Signature]\n\n[Address]\n2. Brother Harry—then when I was in 1901 my sister Ethel went into the office and carried on—we were all practical printers while Ethel was running the paper after Father died in his old age young and Lewis alone.\n\n3. You father made the living for our family nine children out of the paper—this is where our outside interests—were very luxurious living—myself added—our life was simpler in those days—Mother worked hard and we who worked in the office just for the chance to work and share what she had.\n\n4. Father gathered the news also delivered the paper locally—we had a horse and buggy and the paper was taken to the east end called Coaster in the AM and to the west end in the afternoon (upto Emmanuel College and St. Mary's Church) the closing corner for their papers was near the press.\n\n5. We knew P.G. Lame of the Battleford Hall at least Father knew him personally and his son Robert worked on our paper for a number of years—Robert became an active protestant minister—the paper becoming the missionary's largest school—then ended the paper and as its collapse my father bought up the plant.\nBrother Henry - dear Sir,\n\nMy mother died very suddenly on the 23rd of April\nand carried on - we lost all practical knowledge\nhere in the house - owing to my old father\nbeing ill - his cold is getting worse.\n\n1906.\n\n2. You both make the living for our family.\n3. Your children are of the proper - that is healthy\nand obedient nature - make a very successful\nliving - may it last - we try our best to\nchoose things, Mr. Smith has been kind and we\nhave visited the office for the advance in home and\nplane work (it) near\n\n4. Father purchased the house also delivered it proper\n5. Family - he had a house and happy and the\nproper house to the ever and caller church\nin the a.m. until to the house paid in full (signature)\nCapt. Emmett College (signature)\n\nThe other names for this purpose are not visible.\n\nWe have been here since the Battleford War\non perfect terms or on paper for a special\nRobert Johnson is a retired professional\nMarie (signature) is the owner of the property\nlast year (signature) was paid by the owner\nof the property.\nand at that time changed the name of the paper from the \"Poveshell County News\" to the \"Staunton Valley News.\"\n\n6. I don't remember where the border plate etc. if any was used. I have the last copy of the first issue published before my father died and that was the \"Patent Mail\" at the time.\n\n7. The circulation was about 600 or 700 and it was widely circulated. It was nearly all the towns including Ripina and North Farm - very remote places at that time - but a few copies. A large number of Eastern papers exchanged and some copies went to England.\n\n8. The paper called the (Critic) was just a little sheet almost twice the size of this page and was not edited by Andrew Stewart as he died too soon in P.A. until a late date - around 1894 or so. Would you have heard of the paper? (I believe it was in PA in 1822 and October.)\n\n9. The Times had a staff around 1895 - four men more than any other paper in the county because leader & news mainly affairs - police and two of the family for the most part.\n(2) and at close times charged the house.\n\nA. Paper written by \"Poveshell Davies.\"\n\nB. Don't remember if it was the broken pencil.\n\nC. I am not sure what it was.\n\nD. The house was filled with smoke.\n\nE. The house was filled with smoke.\n\nF. The house was filled with smoke.\n\nG. The house was filled with smoke.\n\nH. The house was filled with smoke.\n\nI. The house was filled with smoke.\n\nJ. The house was filled with smoke.\n\nK. The house was filled with smoke.\n\nL. The house was filled with smoke.\n\nM. The house was filled with smoke.\n\nN. The house was filled with smoke.\n\nO. The house was filled with smoke.\n\nP. The house was filled with smoke.\n\nQ. The house was filled with smoke.\n\nR. The house was filled with smoke.\n\nS. The house was filled with smoke.\n\nT. The house was filled with smoke.\n\nU. The house was filled with smoke.\n\nV. The house was filled with smoke.\n\nW. The house was filled with smoke.\n\nX. The house was filled with smoke.\n\nY. The house was filled with smoke.\n\nZ. The house was filled with smoke.\nThe policy of the family was always to uphold the government of the day. For John & Macdonalds during the rebellion and further him supported the volunteers and organized defense during the rebellion. He was a Fenian Raid Veteran (I have his medal here) and had attended Military College in Kingston so was better qualified than most to organize defenses. During the rebellion many people opened their homes to farmers in the district and had in several months alone ten people protected or them in our home and the property. One was used as sleeping quarters in the patrol. People add most disastrous effects to the experience in my year late we will had the P.I.O. Round and occasionally calling for some necessary type. I might add here that when people were asked to make statements of their rebellion losses my father put in for very nominal sum - about $200 - albeit the paper had been suspended for several months and he had fed such a large house hold and suffered much discomfor, he contended he had only done his duty in\nThe precise nature of the accusations made against the defendant during the investigation and proceedings of the court remains unclear due to the destruction of the original documents.\n\nHe was a former naval veteran who had attended military college in Kingston upon Hull (not listed separately).\n\nWhen questioned regarding his involvement in the case, he claimed that he had never been present at the scene of the alleged offense.\n\nThe prosecution presented evidence that he had been seen near the location of the crime several months prior to its occurrence.\n\nThe defense argued that he had been away from the area during the relevant time frame.\n\nFurther investigation revealed that he had indeed been present at the scene of the crime, but he claimed he had been there for a different purpose.\n\nThe court found him guilty of the charges brought against him.\nMaking such efforts to defend his home. Unfortunately many others did not share this belief and several fortresses were founded on inflated hopes and dreams.\n\nHope this is along the line you want. I have no wish to see the early days recorded or remembered because I feel that in the early days the foundations were laid. What we have now is a magnificent superstructure far surpassing the dreams of those early adventurers. Isn't it a super structure so what of the foundation? We should not forget that—and I think it was well and truly laid by those men who let my father looked for nothing more than to make this a country to live in. A newspaper in the early days had many difficulties—but was of inestimable benefit to the country it served. Father, James Oliver, Melton Ford Davis and others helped—\n\nSincerely,\n\nDr. Gertrude Smith\nHope this is along ok. Love ya\nmuch. I have no history to see the early\ndays recorded or remembered because\nI feel that in the early days the foundations\nwere laid. What we knew would be a magnificent\nupper structure for prosperity & advance\nthose early adventures. The J. is a\nhuge structure on Water & the Foundation?\nwe obtained our hopes. Was ever I think I\nwas well and truly laid by those men who\nleft my father forever for nothing more\nthan to make this a Country & Win in.\nA homesteader in the early days faced many\ndifficulties; this was in extremely difficult\nconditions & several factors, however,\nStard Barn and other? keep.\n\nJr. Samuel Druck\nArchives Division\n\nMay 8th, 1953.\n\nMrs. Allison Smith,\n234-6th Street,\nMEDICINE HAT, Alta.\n\nDear Mrs. Smith:\n\nYour letter of April 28th, 1953, offering to complete an Archives Questionnaire, has been received. This offer is very welcome indeed, as your father was a very prominent pioneer, and any information which you can shed on the early experiences of your family will be valuable. General Questionnaire #2 is enclosed herewith.\n\nThere are also a number of special questions regarding the Times which you may be able to answer, in order to supplement the data which we already have regarding this paper:\n\n1. Why did Thos. Spink decide to give up his partnership in the Times in 1884?\n2. What members of your family were connected with the publishing of the paper both before and after your father's death?\n3. Was your father able to earn a living from the newspaper and job printing business alone, in the early days?\n4. Who gathered the Prince Albert town news?\n5. Did you have personal relations with any of the other early editors, such as Laurie at Battleford or Robt. Jardine of the Saskatchewan (Prince Albert)?\n6. From where did your 'boiler plate' or 'Patent insides' come from and how expensive was it?\n7. How large was the paper's circulation and in what areas did it circulate outside Prince Albert itself?\n8. Do you know anything about rival papers published in Prince Albert, called the Critic (1886-89) edited by Alex Stewart, or the Farratt (1881) edited by T. O. Davis?\n9. How large a staff did the Times have, and did the number increase or decrease through the years?\n10. Do you recall what your father's editorial policy was with respect to the Louis Riel agitation in 1884?\nArchives Division\n\nMay 8th, 1953.\n\nMrs. Allison Smith,\n234-6th Street,\nMontreal, P.Q., Canada.\n\nDear Mrs. Smith:\n\nYour letter of April 28th, 1953, referring to complete an archives questionnaire, has been received. This offer is very welcome indeed, as your father was a very prominent pioneer, and any information which you can send on the early experiences of your family will be valuable.\n\nGeneral Questionnaire #2 is enclosed herewith.\n\nThere are also a number of special questions regarding the Times which you may be able to answer in order to supplement the data given we already have regarding this paper:\n\n1. Why did Thomas Spink decide to give up his partnership in the Times in 1884?\n2. What members of your family were connected with the publishing of the paper both before and after your father's death?\n3. Was your father able to earn a living from the newspaper and job printing business alone, in the early days?\n4. Also gathered the Prince Albert town news?\n5. Did you have personal relations with any of the other early editors, such as Laurier at Battleford or Robb, Jardine of the Saskatchewan (Prince Albert)?\n6. From where did your \"hotter plates\" or \"Patent Linotype\" come from and how expensive was it?\n7. How large was the paper's circulation and in what areas did it circulate outside Prince Albert itself?\n8. Do you know anything about rival papers published in Prince Albert, called the Critic (1886-99) edited by Alex Stewart, or the Patriot (1881) edited by T.O. Davis?\n9. How large a store did the Times have, and did the number increase or decrease through the years?\n10. Do you recall what your father's editorial policy was with respect to the Louis Riel agitation in 1884?\nDear Mr. -\n\nI read in the recent copy of the Calgary Herald that you were collecting data on pioneers of Saskatchewan. Roy Fulton, the late John D. Macleay started a paper in Prince Albert, Sask., in 1882 and our family grew up there and were educated in the schools etc. I was not young age when we went there - but have many recollections nearly deep (left there when I moved in 1901) and would be glad to fill out a questionnaire.\n\nM. Gertrude Macleay Smith\n\nMrs. Alison Smith, 284-6 & 8\nMedicine Hat\nDear Mr. Andrews,\n\nI need to be assisted by the Calgary Herald.\n\nFor your assistance in doing so, please contact me at the following address:\n\nDr. Alison Smith\nDentist\n\n2841-6th Ave\nMedicine Hat, Alberta\n\nApril 28, 1953\n\nMrs. Alison Smith, 2841-6th Ave\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (✓) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n(✓) Pioneer social life, sports and recreation\n(✓) Pioneer housing\n(✓) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible. Can you remember so that you worry about leaving blank spaces? The object is to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires requested\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer housing\n\nPioneer religion and churchwork\n\nPioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Margaret Gertrude Mauve T.Y. Smith\n2. Your address: 284-64 Street, Medicine Hat\n3. Date: May 14, 1953\n4. Where were you born? (Give name of place and country): Toronto ON.\n5. What was your father's name and occupation?: John David Mauve T.Y., printer and publisher.\n6. When did you come to Saskatchewan? (Give month and year): October - 1872\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Born in Toronto June 1850\n   Winnipeg Jan 82\n   Two years old when I came to provincial\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n   My parents came to this land then\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    By living in it.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Margaret Smith\n2. Your address: 64 Main Street, Medicine Hat, Alta.\n3. Date: May 15, 1953\n4. Where were you born? (Give name of place and country)\n   Born in York June 1868\n5. What was your father's name and occupation?\n   John Smith, farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   July 1870\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   \"I was in my teens\", etc.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\".\n9. What were your reasons for coming West?\n   My parents came to help me\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nBy living in it\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy mother and her people were very much opposed to her coming with her children to the west.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nWith the family - father, Lord, John, and two sisters early in '42 and moved on to the Prairies.\n\n13. What means of transportation did you use?\nWe came from Toronto by rail to St. Paul and proceeded north by stage by railway.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nThese are incidents from our journey as I was told by my parents. We kept Emerson Man as soon as navigation opened (May) after having collected provisions, equipment, and supplies. We went on the boat to Amblerland where they were entertained for a couple days by H.B.C. Factor Blanger who was very kind. Later on in the journey, the whale became too cold for the steamboat, and the family and equipment were loaded into your boat which proceeded to Fort Ed Come. Then fallen through a broken board and lean, and drove the last 48 miles to P.A.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe rented a house from George MacKay. The family lived upstairs and the lower floor was used as an office.\n\n16. Where did you settle or take up land?\nWe never did take up land and always lived in P.A.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nMy husband and I came to Medicine Hat in March 1903. Came in 1922 to pursue practice of his profession (dentistry) in Medicine Hat until he retired in 1948.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nFather was on the Toronto Telegram for several years - previous to that he worked on the Kingston Post Office. He was born in Kingston (in 1838) as was my mother.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy mother said she thought it was a good idea.\n\n12. Did you travel by train or by car?\n\nWe traveled by train from Toronto to Winnipeg, then by car to our children's home.\n\n13. What means of transportation did you use?\n\nWe came from Toronto by rail in 9 panels and proceeded north by CPR - by railways.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other incidents, etc.)\n\nThere are memories of my journey as we traveled by rail, having cattle, purchasing equipment and supplies near Old Hespell, Saskatchewan. We met new acquaintances along the way, including a family who provided us with food and shelter until we arrived in Saskatchewan.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at a farm for several weeks before going on to our homestead.\n\n16. Where did you settle or take up land?\n\nWe settled and started land in P.A.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy husband and I came to Medicine Hat in 1908. Later in 1922 we moved to Medicine Hat until we retired in 1947.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked as a telegrapher in Calgary, Alberta, and later as a housewife in Medicine Hat.\n19. How often did you write to relatives or friends in your old home?\n\nVery frequently.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband, Dr. Allan Smith, in H. Albert Church.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo, they knew I didn't know anything about farming, and they never came.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nExcept my older brother and my very dear mother, the seven other members of the family—three brothers and four sisters—were born in Prince Albert.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI remember starting school with my mother when I was very small and going to Mrs. Baker, a Presbyterian mission teacher—a year or so later we got a man teacher, Mr. J.A. Stull. He always thrilled us by telling us he was related to Laura Secord. Although until about 1895—Colin became postmaster, a very fine man. By 1895 he had an east end school, a room, next to the school, a room, back, a Presbyterian academy, a convent, and Emmanuel College—where we educated!!!\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur family did not travel much—railroad came in 1899 and later there was an occasional trip—father went to Legislative opening in Regina. Mother went to visit her mother in Toronto in 1906—Colin removed to Toronto in 1913—died there in 1928.\n19. How often did you write to relatives or friends in your old home?\n\nVery frequently.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband is Allan Smith.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nNo, there was no one else.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nEscape my older brother and myself. We were the only members of the family who came here.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI remember starting school with my brother when I was very young and going to Owen Barrie's poetry lesson. I also remember a year or two later he got a man named Mr. J. A. O'Neil. He always talked about Kansas and Nebraska, but we never went there until along 1895-1896 because production was very poor then.\n\nIn 1895 he had an ear and looked 20 years but, two months before he came back to a nearby town, he died.\n\nAnd Samuel Colly, because he educated me.\n\n24. Did you travel about much in the early years? (For business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nOur family did not travel much because we lived in a small town and didn't have enough money to travel.\n\n25. What was your occupation at this time?\n\nI worked as a teacher in Regina, Saskatchewan.\n\n26. When did you move to Canada?\n\nI moved to Canada in 1906.\n\n27. When did you die?\n\nI died in 1928.\n25. When was the first car used in the community? \n   *About 1908. U-Was owned by Judge T. McGurk.*\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   *My husband and I came to Medicine Hat and arrived in 1903. Bought a M. Longley car in 1914.*\n\n27. Where was your trading center? How far from your home?\n   *In Prince Albert. The trading was done at local stores (H.B.C., Loblaw, J.E. Barge and T.O. Davis).*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *As early as I can remember, it was possible to buy a good variety of goods in P.A. The H.B.C. was always wonderfully stocked. Fresh fruit was not what we had—like in apple season, etc.—until after the train came in in 1899.*\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *I don't remember exactly how often. We were always living in town.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n   *I remember Eaton's Catalogue coming out. It was quite small—likely 1892 or 93—and we did buy quite freely as goods, especially fancy items, were so much cheaper. Likely nearly half of our clothing was purchased that way. No ready-made clothing except knit underwear. Most made even the boys' clothes.*\n\n32. When did you first have a telephone and what company provided it?\n   *First telephones began in 1895. Then U.W. Bell phone.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *We never came to Saskatchewan in the early days with the intention of staying. It was to make some money and go back east—and a lot did too. We stayed because we were anchored. One did not move easily in newspaper business.*\n25. When was the first car used in the community? (Indicate year, make, model, owner, etc.)\n\n26. If you owned a car before 1914, what did you buy it for? What made it?\n\n27. How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new taxes, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogs? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order after the appearance of the telephone.)\n\n32. When did you first begin to buy through the mail order catalogs?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision?\n\n34. Did you ever consider moving to another place?\n\n35. Did you ever consider buying a newspaper here?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nFalker was president of Board of Trade - 1891-2\nSec and Chairman of school Board 1890-1895\nVestry man in St. Andrews Church - 1895-96\nSecretary of Temperance Lodge and 1890 to\n1900 Sec. D.O.T. lodge - all prior to 1902\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nFalker was the first Secretary of the\nI.O.O.F. lodge established in Prince\nAlbert sometime around 1890\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or any member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here (giving dates wherever possible). (Such as owning the first automobile, organizing the first automobile club, etc.)\n\n38. How did the places in your community get their names? (School district; Post Office; Villages; Railways; Institutions; creeks, hills, etc.). Try to state (1) the date and reason for change; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change; (6) place of new name above in (1) to (5).\n\n39. What reasons did you have for moving?\n38. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n49. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have five children - all married:\nGertude Davidson - graduate in law - married in Toronto\nPhyllis McNaughton - graduate teacher and nurse - married Bryan\nCecil Allan - married - real estate owner - married lives in Calgary\nPatricia Phipps - teacher - secretary - married lives in Winnipeg\nLenore Garrett - graduate nurse - married lives in New Mexico\nGrandchildren: Harold McNaughton, Peter Bryan and Linda Smith\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI cannot tell all the ways how developed marvellously. I remember Prince Albert was a beautiful modern city, Saskatoon (remember when it had about 3 buildings) a lovely and growing city. Regina just a little town as far as I know. Now a beautiful and thriving city.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Margaret Garland\nSaskatoon, Alta.\nB.C.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n__________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and negatives, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives Office at the University of Saskatchewan?\n\n40. If you have children or grandchildren, please give their names, where they live.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pilgrims who could answer this questionnaire.\n\nV. M. Margaret Gertrude\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\nLive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_379MargaretSmith.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 9092, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 719, 5], [719, 1201, 6], [1201, 2306, 7], [2306, 3345, 8], [3345, 4353, 9], [4353, 5366, 10], [5366, 6397, 11], [6397, 7259, 12], [7259, 8098, 13], [8098, 8753, 14], [8753, 10452, 15], [10452, 12160, 16], [12160, 12664, 17], [12664, 12917, 18], [12917, 14892, 19], [14892, 16758, 20], [16758, 18059, 21], [18059, 19229, 22], [19229, 21187, 23], [21187, 22606, 24], [22606, 24278, 25], [24278, 25860, 26], [25860, 27976, 27], [27976, 28998, 28], [28998, 30282, 29], [30282, 31167, 30], [31167, 32979, 31], [32979, 33904, 32], [33904, 34059, 33], [34059, 34213, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]