[{"id": "6bbe837302d2baa1d0ffae417087b92634159c5c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because so little of the pioneer is asked to answer it has exactly the same experience as another. Because of the questions here will not apply to your experience; others may apply to yours.\n\nIt is impossible for you to answer, so don't worry about leaving blank any questions. Don't hesitate to give details, or describe particular events, if they help you to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945. It may be answered by anyone who has personal experience of the pioneer years another born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diets: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer school life\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan, as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, SASK.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: MRS. L. (L. A. A.) ROBERTA WICK\n\n2. Your address: E. S. H. M. S. L. A. K. 5, SASK.\n\n3. Date: June 29, 1891\n\n4. Where were you born? (Give name of place and country): At Mulla, Man. Can.\n\n5. What was your father's name and occupation? Mr. John Toulemon\n\n6. When did you come to Saskatchewan? (Give month and year): You not know.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\").\n\n\"I was in my teens,\" etc.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nSASKATCHEWAN ARCHITECTS ASSOCIATION\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. L. A. L. A. N. ROBERTA WICK\n\n2. Your address: FISHAM SASK.\n\n3. Date: 27th 1916\n\n4. Where were you born? (Give name of place and country): At Mullita, Man. Can.\n\n5. What was your father's name and occupation? Mr. John Touchenta\n\n6. When did you come to Saskatchewan? (Give month and year): Not know\n\n7. Mention any other places where you lived before coming to Saskatchewan: England\n\n8. How old were you when you first came to Western Canada? (You do not need to fill in)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel solo or with a party (family, friends or other group)?\n\n13. What route of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell them their case and share they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nMy grandfather, the Rev. John Brown (Longue-Pointe) was one of the first ministers in Touchwood Park.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\nTeam & buggy or wagon were the means of travel.\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Shaker Village because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came East, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which would lead you to believe that times have changed since then?\n\nMy brother Lyman married Emma Win\n\ntown at Canaanville.\n\nMy grandfather, the Rev. John Brown (Longport, New Jersey) wrote one of the first minstrels in southern\n\nI am a buggy or wagon ride\n\nthe means of travel.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1924, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to Armour's on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nPersonally not till after the year 1910 when I went on my own as a housewife bought most of my clothing through catalogues only.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Ashland, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI was just two years old.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, what did you buy it for? What make?\n\n27. Where was your traveling started? How far from your house?\n\n28. Did you continue to travel there? (Initiate any charges due to new terms appear-\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\nPersonally not till after the\n\nyear 1910 when I was living\n\nin a house bought near\n\nmy clothing through catalog\n\nshop.\n\nWhen did you first have a telephone and what company provided it?\n\nAt my father's house in 1910\n\nWhen did you first go out to work? The first time was it with the idea of staying\n\npermanent? If so, do you make of your work after trying it out? When did you\n\nmake child resilient?\n\nI was just two years old.\n34. Did any people move away from your district prior to 1918? What reasons did they have for moving?\n\nMy parents moved away from 1918.\n\nOn till the present I do not know just how many moved away but I know some would try to get their families.\n\n35. Did many people move away during the 1920's? Did many return?\n\nMy parents always worked in the bus line.\n\n36. If you or some member of your family have held public office, or have been active in any organizations mention it here, giving dates whenever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts; Post offices; villages; railway stations; streets; etc.) State (1) name and occupation of person responsible; (2) date and place of the name was given; (3) date of the garrison; (4) buy change of the name; (5) give source of the name as above in (1), (2), (3).\n\nI do not know how they got their name.\n5. Did any people move away from your district prior to 1918? What reasons did they have for moving?\n\nOn the run? I do not know.\n\nJust how many moved away—just know some wanted to try something new.\n\nMy family was always a热闹\n\n36. If you or any member of your family have held public offices, or have been elected to any office, please state which offices, (such as county, state, etc.)\n\n37. If you or any member of your family or friends were in the first automobile club, or organized the first automobile club, or were members of any automobile club, please give name of club and date of organization.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(a) date of adoption\n\n(b) reason for change\n\n(c) name of person who gave name\n\nI cannot remember how they got their names.\n6.\n\n33. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, old newspapers, old minute books, old community organization (describe).\n\nI have some old photographs\n\nWould you or another person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOur children are Arnold Murray Wick\nMrs. Gladys Murray Wick\nMr. J. W. Wick\nMr. J. W. Wick Jr.\nMrs. J. W. Wick\n\n41. What big changes have taken place in your community since you\n\nBrown farming\nElectricity\nButte Butteburg\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nMrs. Charles Beliveau\nMr. College Hilgarten\nMr. Adena Wick\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nfilled in myself\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old pamphlets, old photographs, old postcards, old minute books of community organizations, old letters, old posters and programs, old newspapers, old pamphlets, old photographs, old postcards, old minute books of community organizations?\n\nI have some old photographs.\n\nWould you be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What organizations are the most important to you in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n\nThank you.\n\n[Signature]\n\n[Signature]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_551.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3794, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1923, 5], [1923, 1923, 6], [1923, 2777, 7], [2777, 3767, 8], [3767, 4430, 9], [4430, 5086, 10], [5086, 5805, 11], [5805, 6492, 12], [6492, 7577, 13], [7577, 8719, 14], [8719, 9840, 15], [9840, 10722, 16], [10722, 11907, 17], [11907, 13181, 18], [13181, 13336, 19], [13336, 13490, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]