[{"id": "98610e592bcd78b201996313d8bd1cb60a07f416", "text": "PHOTO ONLY\n\nFrom\nTHAMES STUDIOS\nThames Building\nNew York, N.Y.\n\nCaroline Anderson\n\nNewman\n\nvia Fort Pelly\n\nNOTICE\nThe Photo is rolled in tube\nRemove carefully and press flat\nDO NOT rub\n\nSask.\nCanada\nPHOTO ONLY\n\nFrom\nTHAMES STUDIOS\nThames Building\nNew York, N.Y.\n\nCaroline Anderson\n\nNewman\n\nvia Fort Riley\n\nNOTICE\nThe photo is rolled in tube\nRemove carefully and press flat\nDO NOT rub\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces in the sheets of paper. If there is not sufficient space left to answer all the questions, please state to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Enjoy?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA list of questions is given to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Ole Mikal Anderson\n2. Your address: Nokway, S.A.S.M.\n3. Date: [Handwritten date not legible]\n4. Where were you born? (Give name of place and country) Saskatchewan\n5. What was your father's name and occupation? Farmer\n6. When did you come to Saskatchewan? (Give month and year) July, 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" in its place by tearing off this line.)\n9. What were your reasons for coming West?\n   - My father had 4 acres and I was only 10 years old.\n   - We needed more land and my brothers wanted to homestead so we came to the plains.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThe circular and advertisements:\n- The circulars that came to Canada and abroad of our friends and relatives were a good piece of advice.\n- What home over 160 acres of hillside seemed like a lot of land to settle on.\n1. Your full name: Ole E. Mikal Anderson\n2. Your address: Norquay, S.A.S.M.\n3. Date: \n4. Where were you born? (Give name of place and country): Norway\n5. What was your father's name and occupation? Farmer\n6. When did you come to Saskatchewan? (Give month and year): You - 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   My father had 4 acres and in order to expand my own acre I had to go to the land office to homestead so I could go to the land office.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThe reasons and advertisements:\n\nMy oldest brother came to Canada and told me there was a good place to settle. Someone at what time owns 160 acres of land. We would like a lot of land to live on.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThe relatives seemed to think it was OK for my brothers to go and homestead but what dad was mad to sell his home and go.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWe came by train to far as Kamloops\n\n13. What means of transportation did you use?\n\nTrain and horse and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nThe only incident was the long waits we had between trains. Some places we had to wait from one day to one day and a half for a train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at Kamloops then drove to our homestead. The next day Dad had to homestead for us.\n\n16. Where did you settle or take up land?\n\nMearns Rd., which is 30 miles north of Kamloops.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI have lived Kelowna twice. My last three years I've lived at Mearns Road at Mearns Road and still in very good condition around Norquay and still in very good condition.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWhen a child and until I went to work in a sawmill machinery, brought grain, worked in a garage. Alone carpentry and now I farm again and am a carpenter.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThe relatives seemed to think it was OK for my brothers to go and homesteaded.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\nWe came by train, the fare to Kamloops as a family was very expensive.\n\n13. What means of transportation did you use?\n\nTrain and horse and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\nThe only incident was the long waits we had between trains. Some places we had to wait from one day to one day and a half for a train.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at the homestead Kamloops then.\n\n16. Where did you settle? Take up land at what date?\n\nNearest town which is 30 miles north of Kamloops.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n5-hour drive to Edmonton, back on White Rock Slough, back on property, the place where we homesteaded at, property, the place where we homesteaded at, property, and still in very good condition around property.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWhen a child and until 2 weeks to world war I worked on dad's farm, since I have farmed solo machinery, bought grain, worked in a garage, alone carpentry, and now I farm again and earn a carpentry.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe next summer Dad built his house with all the hands and I am sure we helped fell a hundred people who came and looked for land. I often wondered how much was able to feed all these people. There was no money but how could she have been so hospitable and most grateful. We all thought it was wonderful at Buttenhausen where we lived and I remember very fondly.\n\nMy mother wrote quite often to build and that is why we all our relatives came.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe next summer Dad built his house with little stands and I am sure we hardly fell a hundred people who came and looked for land. I often wondered how much was all to feed all these people. Here was my money but how could she have been so hospitable and meet go (works) so he nothing show would at Butte Montana where we lived and everybody hangry.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. We don't know how we moved 30 miles for provisions when several moved together. The church services were once a month. We never went further than our homes or any farther.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new forms appear-\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportions of purchases made by mail order since then.\n\n32. In what year did you first have a telephone and what company provided it?\n\n33. Then you came to Sandithaven the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWe intended to stay permanently.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? (Indicate any changes due to new towns appearing)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nThat kind of articles did you buy in this way? Indicate also what proportion or your total purchases were by mail order and any changes in the proportion of purchases made by mail order.\n\n32. Think 1910-1911 I knew a man who\n\nold Simpson catalogue 1912. Same kind of\n\nthings were little money and could not\n\nsee for many things we had to trade\n\negg and butter for supplies he must\n\nas possible.\n\nwe had farms for anything here.\n\n33. When did you first have a telephone and what company provided it?\n\n34. In 1916 the farmers bought the phone lines but\n\nwere unable to get the electric line that connected right past\n\nwhen we came here. We came here in 1916.\nWire lay on the ground. This wire was pulled up and used for many a homesteader's pasture fences. There is still a lot of this wire on pasture fences in this district. I don't know where it went but since we live near Fort Livingston I presume it went from Fort Livingston to western points or ports.\nWhen they got here, they were forced up and away from many a homestead pasture fence. There is still a lot of this line on pasture fences in this district. I don't know where it went but there were lines near Fort Laramie. Apparently it went from Fort Laramie to western point on Porto.\nwere bury on the ground. This was\ntrue, I believe, but I do not know\nfor certain. It seems to me\nthat a homesteader purchased land\nto start a lot of this time on purpose\nbecause in this district, I don't know\nwhere it went but there are lines near\nFort Livingston. Apparently it went from\nFort Livingston to western points or forts.\nWire lay on the ground. This wire was pooled up and used for many a homestead's pasture fences. There is still a lot of this wire on pasture fences in this district. I don't know where it went but since we live near Fort Livingston I presume it went from Fort Livingston to western points or postal.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany people homesteaders stayed on the homesteads a short time then left. Most of them were bachelors. I think they were homesick or homesick. The most families proved up the homestead before they left.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNone moved out, but oh how many moved in. They came by wagon, by train, or car. They walked and most of them are still here. Some left during the war and came back again.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy brother Hans Anderson, 1916-17, 18, 19 about and 1942-43-44-45 was a municipal councillor about.\n\nMy wife President of the Lutheran Ladies for 3 years. 1938-1943\n\nI was a school trustee.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI owned the first automobile a 1914 Ford.\n\nMy dad was the first settler in Norway district.\n\nOle Johnson built the 1st church.\n\nMcPherson built the 1st store.\n\nPranteburg school was the 1st school.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school was named Pranteburg as we came from Pranteburg. Built 1907.\n\nOur town Norway was named after John Norway our P.O. was named but when our town was built it was closed.\n\nOur railroad is the Thunder Hill branch of the C.M.R. because we live near Thunder Hill.\n\nWe live near Buffalo Jump a hill that looks like a buffalo neck.\n\nSnake creek because of its thousands of snakes.\n\nThis is near Fort Levington.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving away?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, origin and meaning of the name; (2) date of any changes in names since the first name was given; (3) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school was named Grandview because we live near Buffalo. We had to make a trip to town to buy supplies of any kind. This is near Fort Schuyler.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have in my possession the minutes of the first Lutheran ladies aid, and old photos of the picnic taken July 4, 1907.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Indicate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children: Mrs. Elyse Johnson, Robert Scott, Dairy Pool\nMrs. Mae Setlock, Norquay, Saskatchewan\nOlive Anderson, 1136 Ave J North, Saskatoon, Carpenter\nMrs. Dorothy Reid, 1134 Ave J North, Saskatoon, Dairy Pool\nLaura Anderson, 660-8th E Prince Albert, Lone Star Auto Electric\nGrandchildren: Dale & Gary Johnson, Robert Scott\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe roads. More elevators so there's competition, our creamery, and hospital, and more fields, and now we own a car and a tractor. Better types of grain, our old seed were mostly a longer season grain, and with the opening of the country, we have less frosts.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nI have in my possession the minutes of the first settlement meeting held at the old church on June 4th, 1907.\n\nWe bought furniture for our church.\n\nWould you or the person who owns them allow:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any:\n\nIf you have children or grandchildren, please give their names, where they live, and occupations:\n\nMrs. Mrs. Elizabeth Johnson (former)\n\nMrs. Dorothy Reid\n\nGrandchildren: Donald Johnson, Kenneth Johnson, Dennis Allwood, Nancy Smith\n\nWhat do you think are the most important changes in your community since you first came here?\n\nThe weather... More elevators so there's competition for creamery and hospital. And more fields, and now we are owning a cow and a tractor. Better crops of grain, our old seed was mostly a foreign variety, and with the opening of the country, we have been flooded.\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_670.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 6003, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 199, 9], [199, 384, 10], [384, 384, 11], [384, 384, 12], [384, 384, 13], [384, 384, 14], [384, 2325, 15], [2325, 4197, 16], [4197, 5334, 17], [5334, 6375, 18], [6375, 7832, 19], [7832, 9328, 20], [9328, 10445, 21], [10445, 11634, 22], [11634, 12593, 23], [12593, 13771, 24], [13771, 14072, 25], [14072, 14359, 26], [14359, 14692, 27], [14692, 14992, 28], [14992, 17134, 29], [17134, 18105, 30], [18105, 19839, 31], [19839, 21080, 32], [21080, 21216, 33], [21216, 21370, 34]], "primary_language": ["None", "None", "None", "None", "None", "None", "None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]