[{"id": "c291514610470752c7466b64acb647bb2e14cba2", "text": "Name: James McLean\nAddress: R.R.1, Shaunavon\nBirthplace: Douglas, Lanark, Scotland\n\n1. INTRODUCTORY QUESTIONS\n   What year did you start homesteading in eastern Canada? 1923\n   Where did you settle homesteading? Shaunavon, Saskatchewan\n   Where had you been living before that? Scotland\n   For how many people did you prepare meals? 6\n   How far was it to your nearest store? 25 miles\n   How often could a visit be made to the store? when we could\n   What groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Willard's\n   In what quantities did you buy it? 10 lb. bag\n   What was the usual price per hundred pounds of white flour? $3.75\n   How much did you use Graham flour?\n   Whole wheat flour?\n   Was flour milled locally? Yes\n   How far away? 40 miles\n   What year? 1926\n   What was the price for a twenty pound bag of rolled oats? 75 cents\n   What other grain products did you use? Cornmeal\n   Whole wheat? Purina?\n   Other?\n   Did you grind your own wheat for porridge? Sometimes\n   How did you grind it? Electric mill\n\n[Signature]\nAug. 15/51\n1. FAMILY HISTORY\n\nWhat year did you start homesteading in eastern Canada? 1903\n\nWhere did you settle before that? Newfane, Vermont\n\nHow many people did you bring with you? 6\n\nHow far was it to your nearest store? 25 miles\n\nHow often could a visit be made to the store? 3 times a year\n\nWhat provisions did you usually buy in those earlier years?\n\n2. FLOUR AND THEIR GALL PRODUCERS\n\nWhat breed of white flour did you use in the early years?\n\nIn what quantities did you buy? 100 lbs.\n\nWas this the usual price per hundred pounds of white flour? Yes\n\nHow much did you use red flour?\n\nWas flour milled locally? Yes\n\nWas the price for a twenty pound bag of rolled oats $.74 cents\n\nWhat other grain products did you use?\n\nOats?\n\nCorn?\n\nDid you grind your own wheat or purchased?\n\nFor did you grind it? By hand\n\nBy hand.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 lb.\n\nWhat was the price for a ten pound sack of white sugar? $5.00\n\nWhat brand of golden corn syrup did you use? Edwardburg\n\nWhat size of tin of syrup did you usually buy? 10 lb.\n\nAt what price? $1.00\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes\n\nEggs? Yes\n\nWhat was the price of butter? $0.50\n\nDid you pack eggs for winter? Yes\n\nDid you make butter? Yes\n\nCheese? Yes\n\nWhat kind of cheese? For home use\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Rabbits, game\n\nHow did you get fresh meat? Purchased\n\nHow often did you get fresh meat? Weekly\n\nHow did you preserve meat? Salted pork\n\nWas there a \"beef ring\" in your neighborhood? None until later\n\nIf so what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds? Chicken\n\nWhat part did fish play in the family diet? None\n\nWas the fish fresh, cured, or canned?\n\nKinds?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ...20 lb.\n\nWhat was the price for a ten pound sack of white sugar? $8.50\n\nWhat brand of refined corn syrup did you use? ...Edgewood\n\nWhat size of tin of syrup did you usually buy? ...10 lbs.\n\nAt what prices? ...$3.50\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter?\n\nThat was the price of butter?\n\nDid you pack eggs for market?\n\nDid you make butter?\n\nThat kind of cheese?\n\n5. MEAT AND FISH\n\nThat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow did you preserve meat?\n\nHas there a \"meat ring\" in your neighborhood?\n\nIf so, what was it organized?\n\nDid you use pans?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, canned, or cured?\n\nKind?\n6. BEVERAGES\n\nWhat kind of tea did you buy? ... Home ... At what price? ... \nWhat kind of coffee did you buy? (beans or ground) ... Ground ... \nPrice? ... \nWhat other beverages were used? ... \n... Gold Standard, Canada, A. Roll, etc., 1 dollar ...\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? \nCould you get potatoes at the store? \nIf not, where from? \nWhat year did you first grow your own supply for the winter of? \nPotatoes ... Cabbage ... Carrots ... Onions ... \nTurnips ... Beets ... \nIn what quantities did you buy white navy beans? \nHow did you buy prunes, (in bulk or by the box)? ... Green Swan Brand ... \nWhat weight? ... How did the grocer handle prunes (by box)? ... \nWhat was the price of prunes? ... \nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? \nPeas? ... Corn? ... Beans? ... Saskatoons? ... \nOther foods? ... \nWhat year did you first preserve fruit by canning? ... Later years ... \nWhat year did you first preserve vegetables by canning? ... \nWhat year did you first preserve meat by canning? ... \nDo you still preserve foods by canning or drying? ... \nTo what extent? ... Wild fruits, Black Currant, from the garden. \nDid you make your own vinegar? ...\n6. **Vegetables**\n\n   - What kind of vegetables did you buy? (name or general)\n     - Turnips\n     - Potatoes\n     - Cabbage\n     - Carrots\n     - Beets\n\n   - How much did you buy?\n     - Turnips: 10 lbs.\n     - Potatoes: 25 lbs.\n     - Cabbage: 10 lbs.\n     - Carrots: 5 lbs.\n     - Beets: 3 lbs.\n\n   - Where did you get these vegetables from?\n     - Turnips: Local market\n     - Potatoes: Local market\n     - Cabbage: Local market\n     - Carrots: Local market\n     - Beets: Local market\n\n7. **Fruits**\n\n   - What kind of fruits did you buy?\n     - Apples\n     - Oranges\n     - Bananas\n     - Grapes\n     - Pears\n\n   - How much did you buy?\n     - Apples: 10 lbs.\n     - Oranges: 5 lbs.\n     - Bananas: 3 lbs.\n     - Grapes: 2 lbs.\n     - Pears: 1 lb.\n\n   - Where did you get these fruits from?\n     - Apples: Local market\n     - Oranges: Local market\n     - Bananas: Local market\n     - Grapes: Local market\n     - Pears: Local market\n\n8. **Preserving**\n\n   - In the early years, did you preserve any foods by canning or drying?\n     - Yes\n     - No\n\n   - If yes, what foods did you preserve?\n     - Apples\n     - Oranges\n     - Bananas\n     - Grapes\n     - Pears\n\n   - How did you preserve these foods?\n     - Canning\n     - Drying\n\n   - Do you still preserve foods by canning or drying?\n     - Yes\n     - No\n\n   - To what extent? (wild fruits, black currants, from the garden)\n\n   - Did you make your own preserves?\n3. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., sack, can etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|----------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                    |                                   |                     |\n| Macaroni              |                                               |                                                    |                                   |                     |\n| Graham flour          |                                               |                                                    |                                   |                     |\n| Brown sugar           |                                               |                                                    |                                   |                     |\n| Molasses              |                                               |                                                    |                                   |                     |\n| Table salt            |                                               |                                                    |                                   |                     |\n| Common salt           |                                               |                                                    |                                   |                     |\n| Lily white syrup      |                                               |                                                    |                                   |                     |\n| Toilet soap           |                                               |                                                    |                                   |                     |\n| Baking powder         | Blue Ribbon                                   |                                                    |                                   |                     |\n| Baking soda           | Cow brand                                     |                                                    |                                   |                     |\n| Dried peas            |                                               |                                                    |                                   |                     |\n| Dried corn            |                                               |                                                    |                                   |                     |\n| Vinorar               |                                               |                                                    |                                   |                     |\n| Raisins - seeded      | yes                                           |                                                    |                                   |                     |\n|                       | seedless                                      |                                                    |                                   |                     |\n| Rice                  | yes                                           |                                                    |                                   |                     |\n| Currants              |                                               |                                                    |                                   |                     |\n| Store jam - kinds     | Smith's Brand                                 |                                                    |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                    |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ..........................................................\n\nDid you make yeast for your own use? .......... Using starter? ..............\n\nUsing hops? .......... Salt rising? ........................\n\nDid you buy baking powder? .......... Baking soda? .......... Cream of tartar? .......... Did you make your own baking powder? ..........\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                              |                                                |\n| Canned sardines             |                                        |                              |                                                |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                              |                                                |\n|                             | dried                                   |                              |                                                |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                  |                              |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give rolled oats names. | | | |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Walnuts                     |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) **Wells**.\n\nHow far was this water from your home? **300 yards**.\n\nHow was it brought to the home? (pail, barrel, tank) **tank**.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn the early years, **pulled water from well one mile**.\n11. Please fill in the following:\n\n| Item          | Quantity | Unit Price | Total Price |\n|---------------|----------|------------|-------------|\n| Corned salmon | 1        | $2.50      | $2.50       |\n| Clamato       | 4        | $1.50      | $6.00       |\n| Other canned  | 1        | $3.00      | $3.00       |\n| Fish that rip-| 1        | $4.00      | $4.00       |\n| -poised away   |          |            |             |\n| -gave names    |          |            |             |\n\nApples - Fresh 70¢/lb\nLettuce\nTomatoes - Fresh 4\ncorned\nBananas\nLemons\nCrackers\nCorn Flakes\n\nOther prepared breakfast cereals - five packets\n\nPorrl taploca\n\"Huuto taploca\nSugo\nDitas\nWalnuts\nIcing sugar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream)\n\nIf so far was this water from your home? 30 yards\n\nHow was it brought to the house? (well, barrel, tank)\n\nWas any other water supply, mention any others which have taken place since you first started homesteading? (Specify dates where possible.)\n\nWith early grown plants, please tell me with\n13. SOAP\n\nDid you buy laundry soap or make your own? ...........................................\n\nIf you made your own, did you use lye? Yes, wood ashes? No.\n\nWhat kinds of laundry soap did the grocer handle? Sunlight.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the farm lot.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Red.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Red.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? Second hand.\n\nWhat year was it purchased? 1922. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron & Tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware? A long time later.\n\nAluminum?\n13. **FUEL**\n\n   Did you buy laundry soap or make your own? Yes\n\n   If so, how much did it cost?\n\n   Did you use your own laundry soap? Yes\n\n   Did you get your fuel from the farm? Yes\n\n   Did you use any changes in the use of fuel which have taken place since you first started housekeeping, giving reasons where possible? No\n\n14. **FIREPLACE**\n\n   For cooking, did you use an outdoor fireplace or bake oven? (Give dates) No\n\n   Did you use an outdoor fireplace or bake oven? (Give dates) No\n\n   What was your first cook stove made of? Steel\n\n   What year was it purchased? 1925\n\n   What type of utensils did you use? Iron, copper, steel, homemade\n\n   For preparing food? (china, earthenware, wooden bowls, other)\n\n   When did you first see animal waste? After aluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nAt the store goods were weighted. I used paper bags gradually they began to come weighed & wrapped from the wholesale.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nPorridge Potatoes Bread Butter Jam.\n1904 to 96 Parents, 2 girls, 2 boys.\nAdults 6 in 1904.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada? Give the menu. List those present and give their approximate ages at that time.\n\nChristmas dinners in the early years were the same as the usual ones.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo, hardly.\n\nSelf grown. Baking lots of bread.\n15. What was your favorite food at Christmas? (Give details here.)\n\nAt the first growth years we would have fried potatoes, gravy, and ham.\n\n16. Give a typical day's menu (breakfast, dinner, etc.) for the earliest years you can remember. Give the date, time, and location of the family gathering or event.\n\nBreakfast: Fried potatoes, gravy, ham.\n\nDinner: Turkey, mashed potatoes, cranberry sauce, green beans, cornbread.\n\n17. What year did you serve your first Christmas dinner in eastern Canada?\n\n18. Give the menu. List dishes present and give their approximate cost at that time.\n\nChristmas dinner in the early years was the same as the usual one.\n\n19. Were you ever reduced to almost starvation level by locally purchased foods? Give details.\n\nYes, rarely.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nFor More Variety, More Convenience\nMuch Better Equipment.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nNot yet.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThe store is much closer to the farm,\nand of course money is more plentiful,\nin the early days!\nThe grocer was nearly always: Flour, tea, Sugar,\nSalt, Yeast, Baking Soda & Powdered Rolled Oats!\n20. Better and outstanding information in the preparation of meals in the\n    smaller days an everyday with today.\n\n    More variety, more convenience.\n\n    Much better equipment.\n\n    But yet.\n\n21. Should the food be purchased on purchase? (Give as many details as\n    possible.)\n\n22. Please all other details from your early experiences of buying groceries\n    and gathering foods in their stores in your pioneer days in eastern Canada.\n    Include items not mentioned above, quality, methods of merchandising,\n    prices, etc.\n\n    The store is much closer to the farm,\n    and of course money is more plentiful,\n    in the early days!\n\n    Sugar\n    the grocer who nearly always shows top.\n\n    Salt, yeast, baking soda & powdered rolled oats!\nwe all built log houses. I am still living in it yet.\n\nI think the answers given here are as near correct as can be remembered.\n\nalso I think they would catch every one who homesteaded\n\nin this district in the years 1903-4-5.\nwe all built log houses. I am still living in it yet\nI think, the answers given here, are as near correct, as I can\nremember.\nalso I think they would catch, every one who homesteaded\nin this district in the years 1903-4-5.\n\n[signature]\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_117.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5027, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1147, 5], [1147, 1961, 6], [1961, 2917, 7], [2917, 3716, 8], [3716, 5112, 9], [5112, 6532, 10], [6532, 11096, 11], [11096, 11096, 12], [11096, 14625, 13], [14625, 15701, 14], [15701, 16684, 15], [16684, 17456, 16], [17456, 18452, 17], [18452, 19213, 18], [19213, 20074, 19], [20074, 20822, 20], [20822, 21048, 21], [21048, 21284, 22], [21284, 21284, 23], [21284, 21284, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false]}}]