[{"id": "9115109d33f8b46bcea87baec0f51b48c829aebc", "text": "Barker, J.W.\nKisbey,\nTo Sask. - June, 1902.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure that name is correct or you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name\n   J.W. BARKER\n\n2. Your address\n   Kisbey, Sask.\n\n3. Date\n   May 17/1912\n\n4. Where were you born? (Give name of place and country)\n   Sunderland\n\n5. What was your father's name and occupation?\n   Aaron J. Barker\n\n6. When did you come to Saskatchewan? (Give month and year)\n   June 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Ontario, Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   13 years old\n\n9. What were your reasons for coming West?\n   To better our economic condition\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Government literature\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ........................................ J. W. BARKER\n2. Your address ........................................ Kisbey, Sask.\n3. Date ...................................................... May 17, 1942\n4. Where were you born? (Give name of place and country) ........................................... Canada\n5. What was your father's name and occupation? ........................................... James Barker\n6. When did you come to Saskatchewan? (Give month and year) .................................... June 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. .................................... Ontario 1892-1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) .................................... 13 years old\n9. What were your reasons for coming West? .................................... To better our circumstances\n10. How did you learn about the West? (through other people? Reading about it? Railroad or government information?) .................................... Government literature\n2.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWished me well\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith family\n\n13. What means of transportation did you use?\n\nCPR\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents etc.)\n\nPov into a ditch 7 degrees and 35 degrees at midnight at 10 o'clock at night. Spent 4 days in morgue bed in Regina. Waiting for twin to be born. Hot's conduct. Leaving home in October 14 miles west of Prince Albert.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nPrince Albert\n\n16. Where did you settle or take up land?\n\nNot sure\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNot sure\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nNot sure\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWished me well\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself\n\n13. What means of transportation did you use?\n\nCar\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents etc.)\n\nPov into a ditch. I regained my horse and\n\nBothered in March 1874\n\n35. Miles per day in spring, fall, and winter\n\nSpecial 4 days in spring, fall, and winter\n\nWaiting for train to start\n\nWaiting for family\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nHeading House in Dewela\n\n16. Where did you settle or take up land?\n\n14 miles S.W. of Dewela\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNile\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n[Signature]\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried March 29, 1911. Mabel Wain\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAfter some time March 1892\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n5 day blizzard March 1904\n\nWife left Max & Ellen Homestead until 9 new\n\nNiiglen near Qu'Appelle 1907. Baffin here about 9 inches at\n\nNiiglen in winter & early in spring. No trees or wind to blow snow\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWork & homestead fair and summer 1903-1905\n\nTo Ontario in 1915\n\n16 miles\n12. How often did you write to relatives or friends in your old home?\n\nPretty often and still keep up inquiries.\n\n13. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried March 29, 1911 - Mahal Wain\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes\n\n22. If other members of your family (brothers, sisters, parents, etc.) came to Canada, when did they arrive?\n\nAll at same time - January 1892\n\n23. In these early particular experiences of pioneer days that stand out in your memory what do you particularly like to recount?\n\n5-day Blizzard March 1904\n\nWife's name Mrs. Ellen. Homesteaded until 9 men\n\nMay 1907 - October 1907. Helped her about 9 months at\n\nmaybe 6 months in total. She had her own house\n\nwife and no taxes or work from her own land\n\nlanded\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nWorked Brandon Fair and summer 1903-04-05-06\n\nTo Alberta in 1915\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make? 1914\n\n27. Where was your trading center? How far from your home? 4 miles\n\n28. Did you continue to travel here? (Indicate any changes due to new towns appearing, better means of travel, etc.). Same\n\n29. How often did you shop in the early days? Annually\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1900\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? 1920\n\n32. What kind of articles did you buy in this way? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since they knew you). 1920\n\n33. When did you first have a telephone and what company provided it? 1911\n\n34. When did you come to Saskatchewan the first time? Was it with the idea of staying permanently? Or did you make up your mind after touring it once? When did you make this decision? Yes\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, then did you buy it? What makes? One well\n\n27. Where was your trading center? How far from your home? Hubby 4 miles\n\n28. Did you continue to ride horses? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.) Same\n\n29. How often did you shop in the early days? Annually\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1961\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Did it also affect your total purchases made by mail order since the time you began buying?\n\n32. When did you first have a telephone and what company provided it? 1911\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? What did you make this decision?\n5. Did any people move away from your district prior to 1914? If so, why?\n\n34. Did many people move away during the 1920s? Did many return?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having or doing something in the district, mention it here, giving details wherever possible (such as owning the first automobile, combining, organizing the first league, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, townships, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name; (2) date and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change. Give facts of new name as above in (1) to (2); (3).\n\nSchool Officer\n\n[Signature]\n\n[Signature]\n\n[Signature]\n5.\n\n34. Did any people move away from your district prior to 1917/18? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"Irish\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nSchool Officer\n\nNathan H. O.\n\nPoveshell, Iowa\n\nClerk for County from\n\nFrank Swanson\n\nCounty Clerk\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Region, or the Archives Office at the University in Saskatoon?\n\n(Initiate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nInitiate your preferences, if any.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since my first came west?\n\nRoads & Electricity\n\nPlease give the names and addresses of other persons who shall answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_637.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3543, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1195, 5], [1195, 2440, 6], [2440, 3382, 7], [3382, 4326, 8], [4326, 5335, 9], [5335, 6394, 10], [6394, 7443, 11], [7443, 8410, 12], [8410, 9476, 13], [9476, 10136, 14], [10136, 10865, 15], [10865, 11712, 16], [11712, 11867, 17], [11867, 12021, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]