[{"id": "aa6bf8b541529251a6d0069f68c01881fbfedd0a", "text": "19. How often did you write to relatives or friends in your old home?\nMy parents wrote regularly to relatives in Stafford.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\nBeatri Ann Barri 14 May 1901 Moose Jaw.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nSome did + settled in Manitoba.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n1884 Moose Jaw\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nJuly 1886 crop got a price & started my July. Turned & had to do my crop division up, head mow flooded, found myself stuck with soft land, hit the plains, crack so large young chickens & turkeys also young pigs this lot down these cracks & have seen wagons wheel 8 ship down & would have to be piled onto the ground together with pick or crow bar to release, wheel rather than take a chance of breaking some part. While living on hills ranching on the prairie & had a horse killed, one day an Asian came in & had knocked riders right over, rode off & I was determined at a rock & decided he could put my gun there.\n\nDid you travel about much in the early years? (for business, attending church, some visiting friends, etc.) How often? How far? By what means of travel?\n\nTo make villages in that land scarce. Later horses + men, oxen, stock came away 2 Indians killed 2 Signers came out looking for food. Livingston Gunnel & told them to come to the church about sundown & wanted a house. He gathered up some used clothes (mine) I waited until 4 o'clock and Indians walked out side our fence to see us this Buck's Head Belcher left & said our savages they came out ordered supper then sharpened & loaded knives both on my bed they stood there wanted to play cards & did not make it get into a same with them, they were acting very surly demanding you see I had known those Indians for some year. Strauss younger than they this year seven I had been persuaded to go back to the States years after leaving.\n13. How often did you write to relatives or friends? In your old home?\n\n14. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n15. Did anyone else come to Saskatchewan because of your recommendation? If so, please list their names.\n\n16. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that sticks out in your memory which you would like to recount?", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 6, "total-input-tokens": 9960, "total-output-tokens": 804, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2161, 5], [2161, 2690, 6]], "primary_language": ["en", "None", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false]}}]