[{"id": "c82d2daf344665fb90ac2cd52d2e4f6c2cae45ba", "text": "S-X2\n382. Pook Alice Jane (Mrs. George Samuel)\nS-X2\n382. Pook Alice Jane (Mrs. George Samuel)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your complete questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPook, Mrs. A.J.\nCarlton.\n\nTo Sask., - Spring, 1882.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON RESPONDING TO THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your particular experiences; others may prove impossible for you to answer, so don't worry about answering all the questions. If there is nothing else you can add to answer the questions, feel free to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already sent one back, we would be willing to send you another.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer mental life\n- Pioneer recreation\n- Pioneer homestead and churchwork\n- Pioneer farming experience\n\nDistribution of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Alice Jane Pook\n\n2. Your address: Charlton, Sask.\n\n3. Date: June 23rd, 1952\n\n4. Where were you born? (Give name of place and country)\n   On a farm in the County of Northumberland, Ontario\n\n5. What was your father's name and occupation?\n   My father's name was John Shearer; he was a farmer.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   In the spring & summer of 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   We lived in the Township of Percy from 1870 till 1882\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Father had a brother out here that praised it up as well as many others, our farm in Percy was very stoney, and father was troubled with ague, had poor health, and lots of hard work picking stones\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    From people & reading\nPook, Mrs. A.J., Carlton.\n\nTo Sask., Spring, 1922.\n\nSASKATCHEWAN ARCHITECTS QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, pass it by or, if you rather have someone else do the writing at your district, that is quite acceptable.\n\n1. Your full name: Smith, Alice Jane (Mrs. George Samuel)\n\n2. Your address: 601 Carlton Ave.\n\n3. Date: June 23rd, 1952\n\n4. Where were you born? (Give name of place and country): On a farm in the Township of Northumberland, Ontario\n\n5. What was your father's name and occupation?: My father's name was John Shearman, he was a farmer\n\n6. When did you come to Saskatoon? (Give month and year): In the Spring of 1882\n\n7. Mention any other places where you lived before coming to Saskatoon, giving dates wherever possible: We lived in the Township of Carlingford\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use a small child)\n\n9. What were your reasons for coming West? (Your answer will be very short)\n\n10. How did you learn about the West? (Through other people's Reading about it, Railroad or government Information): From purple it heading\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Some one way and some another\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   We traveled by our selves through the states part of the way by train till Brandon and the rest of the\n\n13. What means of transportation did you use?\n   Way 2 oxen and a pony hitched to 2 wheeled carts if I remember right, I remember when we came to Regina, I was sick of bones creek mostly Indians there.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   We met mostly natives, Indians and trappers carrying store goods out in carts or going back for more, some times Hudson Bay officials missionaries or Dr's the Indians were friendly thank us to the North West Mounted Police we had a favorable country much more so than down in the states still Real started the rebellion in 1885 then there was lots of trouble when Fort Carlton burnt down the people left for Prince Albert we left our farm 3 miles away and went to P.A. two\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We went to Prince Albert and father had a look around but he decided to go back to where we camped near Carlton plenty of good water at creek running into the river.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Get logs for building I married a N.W. Mounted Policeman George S. Poole when I was 19 years old we went to Prince Albert in 1889, he tried farming but decided to go back in the Police force, we were there till he was transferred to Flin Flon in 1903, his heart was injured in an accident.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   My oldest son Thomas was killed in the first world war 1914, my son John was wounded in the same war, he still carries a German bullet in his left side the Dr. said he would live longer without it than if he took it out. My oldest daughter was married & the other 2 teaching school my health was very poor, I came out to the quiet of the country mean my health\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What mode of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Western Canada?\n\n18. How did you earn a living before coming to Western Canada?\n\n19. How old was your oldest daughter when she came out to the prairie?\n19. How often did you write to relatives or friends in your old home? quite often\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. [Name not visible] Samuel [Date not visible]\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? I do not remember any, if they did, they did not come to live here.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n   Lots of hardships and the misgivings were terrible, mother and I both wished we had not come; it was lonely out here two.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n   No, only when father had to make a long trip to Prince Albert or a shorter one to Duck Lake for something we needed. There was no church near here for years, and very few friends to visit; our neighbor was old French. When we traveled to P.A., we drove with horse and wagon.\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWe were married at the church in England.\n\n21. Did anyone else come to Saskatchewan because of your recommendation?\n\nNo, so we came here to find work.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first or all when they came did they settle here?\n\nDid not come to live here.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nLots of hardships and the migration was terrible.\n\nBrother and I both wished we had not come it was lonely without two.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nOnly when Nathan had to make a long trip to Prince Albert for a birthday celebration.\n\nAnd then we went to church near our homestead.\n\n25. How far from town to our neighbors' homesteads?\n\nWhen we traveled to P.A., we drove with horse and wagon.\n25. When was the first car used in the community? I do not remember.\n\n26. If you owned a car before 1914, when did you buy it? What make? We did not.\n\n27. Where was your trading center? How far from your home? Pi A., about 30 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). When I came out here to live, we go to Barton now. It is about 5 miles from here. Lots of cars & trucks now, but they're not any. I am an old woman 83 years old, living alone since my youngest son went in the Bank years ago. His dad was burned down.\n\n29. How often did you shop in the early days? Not very often after Fort Barton was burned down.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? I do not know.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. As near as I can remember we always bought some cloth or clothing through the mail order catalogues.\n\n32. When did you first have a telephone and what company provided it? I forget, I am getting to be very forgetful, not very strong.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? It was to stay permanently.\n25. When was the first car used in the community? I do not remember.\n\n26. If you owned a car before 1914, when did you buy it? What make? We did not.\n\n27. Where was your traveling center? How far from your home? (P.O., about 30 miles)\n\n28. Did you continue to travel there? (Indicate any changes due to new terms appearing, better means of travel, etc.) When I came out here to live, we went to Hamilton, Ontario, which was about 30 miles from here. We traveled by bus and train. Our living arrangements were quite simple at first. We lived in a small house with a few rooms. We had to go to town for supplies.\n\n29. How often did you shop in the early days? (Indicate how often after 1914.)\n\n30. When (if ever) did you first begin to buy through the mail order catalogue? As soon as I came here, we always bought lumber, cloth or clothing through the local order catalogue.\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it? For a long time, I was getting by without any telephone and very strong.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nStuart today permanently!\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI am too forgetful to answer the above getting too old, and I live very close at home, not out around much. I have a good garden but I get very tired looking after it & buy other work. I have to lay down and rest quite often. Home is the best place.\n35. Did any people move away during the 1920-1947 Dietanny return?\n\n36. If so, name member(s) of your family who held public office; or have been active in any organization or association, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as erecting the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, Villages, Military stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) etymology and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given.\n\nDate and reason for change. Give facts of new name as above in (1), (2), (3).\n\nI am to forgetful to remember the above.\n\nGetting too old and I live very close at home, out in the country but not very far from town. I haven't a good garden but I get my food by hunting after it. It's only about twenty-five miles from here.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy oldest daughter Mrs. P.E. Routledge lives in Red Deer Alberta her husband is a Banker. My second daughter Mrs. Grace Oldham is teaching school since her husband died he was a Banker my third daughter Mrs. H.G. Hudson lives in Vancouver her husband is the manager of a large firm.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nI think the cars & trucks & phones & radios\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI think you have them I heard the names of a lot of the old timers on the radio, I think from now folks. I am so old and forget full and my hands shaky so bad, I can hardly write with a pen but there is no\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n6. Questions regarding historical sources materials:\n\nDo you have any personal or do you know the whereabouts of diaries, old letters, old photos and postcards, minute books of community organizations, old pamphlets, old photographs, written proclamations and resolutions (Declarations).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library (Heritage), or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy oldest daughter Mrs. E. B. Smith lives in Redfish Alberta her husband Mr. David Smith, my second daughter Mrs. M. Smith her husband Mr. Donald Smith, my third daughter Mrs. J. Smith her husband Mr. John Smith, my fourth daughter Mrs. L. Smith her husband Mr. Leonard Smith, my fifth daughter Mrs. K. Smith her husband Mr. Kenneth Smith, my sixth daughter Mrs. P. Smith her husband Mr. Peter Smith, my seventh daughter Mrs. Q. Smith her husband Mr. Quincy Smith, my eighth daughter Mrs. R. Smith her husband Mr. Robert Smith, my ninth daughter Mrs. S. Smith her husband Mr. Samuel Smith, my tenth daughter Mrs. T. Smith her husband Mr. Thomas Smith, my eleventh daughter Mrs. U. Smith her husband Mr. Uriah Smith, my twelfth daughter Mrs. V. Smith her husband Mr. Victor Smith, my thirteenth daughter Mrs. W. Smith her husband Mr. William Smith, my fourteenth daughter Mrs. X. Smith her husband Mr. Xerxes Smith, my fifteenth daughter Mrs. Y. Smith her husband Mr. Yorick Smith, my sixteenth daughter Mrs. Z. Smith her husband Mr. Zachary Smith.\n\n41. What do you think are the most important changes in your community since 1914?\n\nFirst name please?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nI think you have thrown away the names of a lot of the old timers on the radio, though from what I've heard, I am too old and forgetful and only hear about two or three good gems hardly worth writing with a pencil but then it's fun.\n\nIf someone else has filled in this questionnaire for you, please have this person give his name and address here!\nOxford\n\nNO. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_382AlicePook.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5582, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 47, 3], [47, 94, 4], [94, 2069, 5], [2069, 3955, 6], [3955, 5443, 7], [5443, 6706, 8], [6706, 8965, 9], [8965, 9681, 10], [9681, 10878, 11], [10878, 11885, 12], [11885, 13429, 13], [13429, 14867, 14], [14867, 16078, 15], [16078, 17187, 16], [17187, 18777, 17], [18777, 21067, 18], [21067, 21222, 19], [21222, 21376, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]