[{"id": "15c98590b8f8776e840e60cc00dceafde924b1b2", "text": "Mann, Mrs. S.A.\n\n1. REMEMBERING TIMES\n\nThat year did you start housekeeping? In October 2 and 3.\n\nWhere did you set up housekeeping? At 4000.\n\nWhat did you bring living before that? (signature)\n\nFor how many people did you provide meals?\n\nHow far was it to your nearest store?\n\nHow often could a visit be made to the store?\n\nWhat groceries did you usually buy in those earliest years?\n\nfruits, sugar, cornmeal, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early days?\n\nIn what quantities did you buy it?\n\nWas there any difference in price per pound of white flour?\n\nHow much did you pay per pound?\n\nWas flour milled locally?\n\nWhat other grain products did you use?\n\nCornmeal?\n\nDid you grind your own?\n\nDid you raise your own?\n\nHow did you keep them?\n\nchopped meat products, etc.\n1. Remembering Questions\n\n   What year did you start homesteading in eastern Kansas?\n   Where did you set up housekeeping?\n   How long have you been living there?\n   For how many people did you prepare meals?\n   How often did you visit the store?\n\n2. Flour and Other Grain Products\n\n   Name brands of mills flour did you use in the early years?\n\n   In what quantities did you buy it? (in pounds)\n\n   What was the usual price per hundred pounds of white flour?\n\n   How much did you pay per pound?\n\n   What was the price for a twenty-pound bag of rolled oats?\n\n   What other grain products did you use?\n\n   Did you raise your own wheat for porridge?\n\n   Did you trade for the chipped wood from the fence?\n3. SUGAR AND SUGAR PRODUCTS\n\nIn what quantity did you buy this sugar?\n\nWhat was the price for a ton of sugar?\n\nWhat brand of sugar did you buy?\n\nWhat size of tin or bag did you buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get milk in the early days?\n\nButter? (Was it fresh?)\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. USE OF CLAY\n\nWhat was your main source of fuel?\n\nWas there a \"meal ring\" in your community?\n\nIf so, what year was it organized?\n\nDid you use flour?\n\nFor how long?\n\nWas the flour fresh, curdled, or cornmeal?\n\nKindly?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy table sugar? [Blank]\nWhat was the price? For a ten pound sack of white sugar? [Blank]\nThat brand of golden syrup did you use? [Blank]\nWhat size of tin of syrup did you usually buy? [Blank]\nAt what price? [Blank]\n\n4. DUTY PAID\n\nFor did you pay a supply or farm rent in the early days? [Blank]\nWas there any other tax? [Blank]\nDid you make butter? [Blank]\nBut kind of cheese? [Blank]\n\n5. MEAT AND FISH\n\nHow did you get fresh meat? [Blank]\nHow often did you get fresh meat? [Blank]\nHow often did you get fish? [Blank]\nWas there a \"meat ring\" in your neighborhood? [Blank]\nIf so what year was it organized? [Blank]\nDid you use game? [Blank]\nFor how long? [Blank]\nWhat part did fish play in the family diet? [Blank]\nWas the fish fresh, canned, or smoked? [Blank]\n6. **BUYING**\n   - What kind of tea did you buy? [Signature]\n   - At what price? [Signature]\n   - What kind of coffee did you buy? (beans or ground) [Signature]\n   - At what price? [Signature]\n   - What other beverages did you purchase? [Signature]\n\n7. **VEGETABLES AND FRUIT**\n   - What was the price of potatoes and bushels of vegetables? [Signature]\n   - Could you get potatoes at the store? [Signature]\n   - If not, where from? [Signature]\n   - That year did you first grow your own supply for the winter of? [Signature]\n   - Potatoes [Signature]\n   - Cabbage [Signature]\n   - Turnips [Signature]\n   - Radishes [Signature]\n   - Carrots [Signature]\n   - Onions [Signature]\n   - In what quantities did you buy white navy beans? [Signature]\n   - How did you buy prunes? (in bulk or by the box)? [Signature]\n   - What weight? [Signature]\n   - How did the grocer handle prunes (by box)? [Signature]\n   - What other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or otherwise)? [Signature]\n\n8. **PRESERVING**\n   - In the early years did you preserve any foods by freezing? [Signature]\n   - Pass? [Signature]\n   - Beans? [Signature]\n   - Other? [Signature]\n   - Did you first preserve fruit by canning? [Signature]\n   - That year did you first preserve vegetables by canning? [Signature]\n   - That year did you first preserve meat by canning? [Signature]\n   - Do you still preserve foods by canning or drying? [Signature]\n   - To what extent? [Signature]\n   - Did you make your own vinegar? [Signature]\n6. What kind of tea did you buy? \n   - Green tea \n   - Black tea \n   - Other (specify) \n\n7. What kind of coffee did you buy? \n   - Ground coffee \n   - Whole beans \n   - Other (specify) \n\n8. In what quantities did you buy white navy beans? \n   - 25 lbs \n   - 50 lbs \n   - Other (specify) \n\n9. How did you buy groceries? \n   - In bulk or by the box \n   - By the piece \n   - Other (specify) \n\n10. What was the name of the store? \n    - [Name of store] \n\n11. What was the name of the grocer? \n    - [Name of grocer] \n\n12. What other dried fruits did you use in the earliest days? \n    - Apples \n    - Raisins \n    - Cranberries \n    - Other (specify) \n\n13. In the early years did you preserve any foods by freezing? \n    - Yes \n    - No \n\n14. What year did you first preserve fruits by canning? \n    - [Year] \n\n15. What year did you first preserve vegetables by canning? \n    - [Year] \n\n16. Do you still preserve foods by canning or drying? \n    - Yes \n    - No \n\n17. To what extent? \n    - [Extent] \n\n18. Did you make your own vinegar? \n    - Yes \n    - No\nFOOD\n\nFood you liked best:\n- Bread\n- Cereal\n- Graham flour\n- Green sugar\n- Tomatoes\n- Table salt\n- White flour\n- Corn meal\n- Lily white sugar\n- Yeast\n- Baking soda\n- Dried peas\n- Prunes\n- Vinegar\n- Raisins\n- Sesame seeds\n- Rice\n- Currents\n- Store jam\n- Cheese (Cheddar or store cheese)\n- Vanilla\n\n10. BAKING\n\nWhat type of yeast did you use?\n- Bread dough - Baker's Yeast\n- Did you make yeast for your own use? Yes\n- Using hops? No\n- Did you buy baking powder? Yes\n- Cream of tartar? Yes\n\nDid you make your own baking powder? No\n10. Baking\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing hops? \nDid you buy baking powder? \nBaking soda? \nCream of tartar? \n\nYes Yes Yes Yes Yes Yes\n| Year | Event Description |\n|------|-------------------|\n| 1903 | Cotton ginning |\n|      | Cotton ginning |\n|      | Cotton ginning |\n|      | Cotton ginning |\n\n**Notes:**\n- Cotton ginning\n- Cotton ginning\n- Cotton ginning\n\n**Additional Notes:**\n- Built in 1918\n- Waters will be used\n- April\n1903\n\n1926\n\n1904\n\n1905\n\n1945\n\n1940\n\n1905\n\nApril\n13. STAYS\n\nDid you buy laundry detergent? Yes? What brand?\n\nIf not, how do you wash clothes?\n\nbut Maria or Laundry mops did the cleaning.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (Give dates)\n\nWhere did you get your fuel?\n\nDescribe any changes in the use of fuels which have taken place since you first started housekeeping, either due to shortage or other reasons.\n\nFirst started housekeeping in 1908. During 1932 prices began to drop and from the surrounding hills. As we live in a windy county and hard to keep fires going for fuel. In hot weather we have found it easier to make provisions store for meal preparation in hot weather.\n\n15. UTILITY\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use outdoor fireplaces or bake ovens? (Give dates)\n\nBy whom was your first cook stove purchased?\n\nWhat year was it purchased?\n\nThat type of utensils did you use? (Iron, copper, tin, homesteader)\n\nCooking tools? (chips, earthenware, wood)\n\nWhen did you first use metal ware?\n\nAbout when?\n\nWhen the salesman brought them over in a wagon he simply dumped it out. They would immediately lose their flavor. I used some salve and then they would be fine.\n\nThe automatic stove here would burn our pile too.\n\nThe salesman said about 250 lbs. It was and does drop down. It would work up to two doors and furnaces didn't show that they were different.\n13. Did you buy laundry soap or make your own? If so, what was it made from?\n\n14. What fuel did you use in your earliest home? If you didn't have a stove, did you have a fireplace?\n\n15. Did you use an outdoor fireplace or bake oven? (Give dates)\n\n16. By whom was it purchased? That year was it purchased? For preparing food (chili, earthenware, wooden bowls, other) Then did you first use it?\n\n17. When did you first use it?\n\n18. How did you dispose of it?\n17. Give a typical day's name (breakfast, dinner) and from what part of the country it came. Include the date, place, and who prepared it.\n\nBreakfast\n- Bread\n- Coffee\n\nDinner\n- Roast Beef\n- Potatoes\n- Gravy\n- Rolls\n- Salad\n\nSupper\n- Cold beef\n- Potatoes\n- Gravy\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Give the menu, list the dishes prepared, and give their approximate ages at that time.\n\n19. How did you prepare the turkey? Toasted or roasted? Details, please!\n\n20. My hail damaged the garden badly in 1901 but we had enough to eat if most vegetables.\n1. Give a typical day's menu (breakfast, dinner & supper) for the pioneer family.\n\n2. What did you serve your first Christmas dinner in western Canada?\n\n3. How did you produce food? Give details.\n\nMy family had enough to eat if we worked hard.\n20. Insertion may be made in all directions in the preparation of meals in the\nearliest days. All ingredients are used in the\npreparation of meals. A hearty meal was usually a dish\nconsisting of meat, vegetables, bread, and milk. The\nmeal would include potatoes, turnips, carrots, and other\nvegetables cooked together. A hearty meal would also\ninclude meat, fish, or fowl. The meal would also\ninclude milk, soup, and dessert.\n\n21. When making a hearty meal, it is important to\nconsider the nutritional value of each ingredient.\nThe meal should provide a balance of protein,\ncarbohydrates, and fats.\n\n22. Please add other details from your family's recipes\nand traditions. Use the book of recipes if more space is needed.\n\nThe flour was not ground at home, but was purchased\nfrom the store. The recipe for the pie crust was\ninherited from my grandmother. She always used\nthe same recipe for her pies.\n\nMy mother's father was a gardener. In his garden, he grew\nblack, red, and white currants, raspberries, and many\nflowers as well as most garden\nstuff. He planted an apple tree in his yard.\n20. Mention any outstanding circumstances in connection with the marriage or family life of the deceased.\n\n21. What was your relationship to the deceased? How did you meet them?\n\n22. Please add other details from your family's experiences of buying, growing, and selling foods in other ways, such as purchasing from neighbors, friends, or relatives. Include items not mentioned above, quantities, prices, problems or stories, characteristics, etc., even if more space is needed.\n\nThe following pages contain personal information given by my husband who was born June 1895, and I have compiled this mostly from his memories.\n\nIn 1892, his mother, Sarah Abbott, died. His father, James, then moved to New Hampshire where he earned a living as a laborer. In his later years, he had a small garden and raised vegetables and fruit. He also kept bees and raised chickens.\nButter was also in short supply. Mrs. Murray made up to 200 pounds a year. She worked half by hand. She was shipped as far as East End, Maple Creek and Guelph Lake. Major looked at each one and approved. The district inspectors visited all the farms. The farmers were paid for their work.\n\nThis report has been gathered from memory and some of it is rather hazy. There are authenticated facts in the catalogue for 1905-06 which prove the character of the farmers for three years.\nButter was also in short supply. Mrs. Murray made up two much and two gallons in a year. She worked till bedtime. She was obliged to work for two months past June, added to still further.\n\nBurn now the step from between Maple Creek and East End mill & the gardens at one time steps. My husband & myself planted trees at East End. We have a very fine stand of trees now.\n\nThey closed thirty mile from Maple Creek. After we moved there a year for provisions, I went west forty-eight miles to the mail carriers started.\n\nThis report has been gathered from memory and some of no other part. It is an extra edition in authentic print. Please be sure to share your story and friends for three years.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1892_51.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 4000, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 820, 7], [820, 1523, 8], [1523, 2070, 9], [2070, 2879, 10], [2879, 4446, 11], [4446, 5500, 12], [5500, 6028, 13], [6028, 6209, 14], [6209, 6503, 15], [6503, 6551, 16], [6551, 7962, 17], [7962, 8419, 18], [8419, 9009, 19], [9009, 9253, 20], [9253, 10342, 21], [10342, 11208, 22], [11208, 11688, 23], [11688, 12382, 24], [12382, 12382, 25], [12382, 12382, 26]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]