[{"id": "0de381a14d67dba3c4cf8b5805419c104decdcc9", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................ Charles Mycroft\n\n2. Your address ........................................... Russell, W. - 8-100a\n\n3. Date ......................................................... April 35\n\n4. Where were you born? (Give name of place and country) Higham, Derbyshire, England\n\n5. What was your father's name and occupation? Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year) April 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 20 years\n\n9. What were your reasons for coming West?\n\n   A strong disposition, adventure.\n   Interested in farming.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n\n    Through a friend who had spent a short time in Canada.\n\n11. How did you earn a living before coming to Western Canada? (If you have answered this question elsewhere, you need not answer it again)\n\n    Farming\n1. Your full name: Charles Mycroft\n\n2. Your address: 411 South Street\n\n3. Date: April 25, 1955\n\n4. Where were you born? (Give name of place and country): Afghanistan\n\n5. What was your father's name and occupation? Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 1908\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use I was a small child, etc.) If yes in my teens, etc., 20 years\n\n9. What were your reasons for coming West? A strong desire for adventure, interested in farming.\n\n10. How did you learn about the West? (Through other people, reading about it?) Through a friend who had spent a short time in Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Generally accepted as a sporting proposition.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Alone.\n\n13. What means of transportation did you use?\n   Traveled by boat from Liverpool to New York, left the day after the Base Hospital,\n   arrived Saskatoon 6 days ahead of them.\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n   meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   My journey from New York to Ottawa was marked by the extreme friendliness of the other passengers.\n   Stop over at Kingston, in the station waiting room was a superior or hutton situated almost center.\n   There laymen seats around waiting room occupied chiefly by men, an oil lamp on wall.\n   It was an amazing exhibition which I had never before witnessed.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   In a tent.\n\n16. Where did you settle or take up land?\n   S.W. ¼ 24-31 W. 3rd meridian.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None. Resided 4½ years on the homestead.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGenerally accepted as a good decision.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nAlone\n\n13. What means of transportation did you use?\n\nTravelled by train from Liverpool to New York. Took the day after the train arrived in Western Canada.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nMy family came from New York to Western Canada via the Canadian Pacific Railway. We stayed at a hotel in Edmonton, Alberta, before settling in our new home near Calgary. We encountered many challenges along the way, including harsh weather conditions and difficult terrain.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFor a short time\n\n16. Where did you settle or take up land?\n\nSaskatoon\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nPhone: Resided in Saskatoon for two years\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nFarming\n19. How often did you write to relatives or friends in your old home? Frequently\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Kate Brad, Delaware, England\nMarried St. James Church, Montana, June, 1910.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOne sister in 1910, married & settled on farm in the Glebow District.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nFor many, but of no particular importance.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nHave traveled beyond Saskatoon.\nRegular church attendance.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Have traveled beyond Saskatoon?\n\n26. Popular places all winter.\n25. When was the first car used in the community?  \n   Around 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?  \n   Clinton 2½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).  \n   Yes, Railway & P.R. built 1908. Frequent visits to Saskatoon.\n\n29. How often did you shop in the early days?  \n   We traveled by horse & wagon, consequently trips infrequent.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?  \n   As soon as the Town was built.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.  \n   Mail order catalogues arrived after railroads built. Household necessities, dry goods etc.\n\n32. When did you first have a telephone and what company provided it?  \n   1911\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?  \n   When I first came I didn't know what to expect. The life here made a strong appeal to me & have never left Saskatchewan except for a visit to my birthplace. I am very proud of our province & its many accomplishments & contributions & development during the last 50 years.\n25. When was the first car used in the community? Around 1911\n\n26. If you owned a car before 1914, whom did you buy it from? What make?\n\n27. Where was your trading center? How far from your home? 12½ miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? We knew what we wanted.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in bills and installments? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen you came, I didn't want to accept a farm house half barbed wire fence, a small lot, no many advantages. Only way around our farm was to many advantages.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes, three families, all English, left for B.C., still residing there.\n\n35. Did many people move away during the 1930s? Did many return?\n\nSome of our earlier settlers, chiefly American, left during the depression & failed to return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWheat Pool delegate, Taylor (Chairman of Board), President of Union Bank, 1930.\n\nCandidate in 1934 for Farmer Labor Group, Western Labor Candidate 1944 for B.C. Federal Position.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe town of course was named after the author of Pilgrim's Progress.\n\n[Signature]\n\n[Signature]\nYou true families, all together, help for B & B.\n\nStill needing more.\n\nNot suitable for farming.\n\nPersons of our earlier better days by American life.\n\nDuring the depression or period of crisis.\n\nCandidate (name) for B & B or Federal Position.\n\n31. If you or any of your family or friends were willing to have or do some-\n\nthing in the district museum it here giving dates whenever possible,\n\n(both as owning the first nationally, county, organizing the first lodge,\n\netc.)\n\n32. How did the places in your community get their names? (school), districts,\n\nforts, villages, railway stations, creeks, hills, etc., try to\n\ngive (1) name and occupation of person creating place-name; (2) date\n\nof naming of the same; (3) date of its adoption (if any changes in names\n\nsince then); store in (1), (2), (3).\n\n33. Of course areas named after the\n\nchild-places of John Bunyan, no author of\n\nPilgrim's Progress\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n[Handwritten text not legible]\n\n41. What do you think are the most important changes in your community since you first came West?\n1. The influence created by the development of farm organization handling grain by large elevators, etc., later with pools, etc.\n2. Development of growth in consumer goods.\n3. There in turn gave birth to a new political party.\n4. The importance of these developments have a great stabilizing effect on our agricultural economy.\n5. The introduction of modern farm machinery.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n[Handwritten text not legible]\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for appraisal?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (Indicate your profession, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nHouse 3 children: Barbara, William & Gordon, daughters\n\nBarbara, age 45, living in Regina, married, 2 children\n\nWilliam, age 49, living in Regina, married, 2 children\n\nGordon, age 30, resides in Regina, single, 1 daughter\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below.\n\nSignature: [Signature]\n\nDate: [Date]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_716.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4513, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3222, 6], [3222, 4732, 7], [4732, 5570, 8], [5570, 6889, 9], [6889, 8056, 10], [8056, 9003, 11], [9003, 9742, 12], [9742, 11317, 13], [11317, 12524, 14], [12524, 13927, 15], [13927, 14827, 16], [14827, 16291, 17], [16291, 17150, 18], [17150, 17150, 19], [17150, 17304, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]