[{"id": "3220e8e613930d5128d3efdc192f0d0511eec349", "text": "Jacobs urges methods of large dep’t stores\n\nNo public notice on work deals\nJacobs urges methods of large dept't stores\n\nNo public notice on park deals\nJacobs urges methods of large dept't stores\n\nNo public notice on Park deals\nJacobs urges methods of large dep't stores\n\nTo rural municipalities\n\nMr. Jacobs urged methods of large dep't stores\n\nNo public notice on Erik deals\n\nBetter than any gargle for sore throat\n\nRAW Sore Throat\n\nNEW VICKS THROAT LOZENGES\npaid not to blame\n\nMr. Johnson's introduction into our local newspapers has been general coverage of mining activities in the area. We have heard much about the North West Adjustment Board, which has been established to provide a fair and impartial method of settling disputes between employers and employees. The board has been very successful in its first year of operation.\n\nThe situation today regarding the North West Adjustment Board is that it has organized the necessary for the adjustment of disputes between employers and employees. It has been very successful in its first year of operation.\n\nThe following question was raised at the meeting: \"What is the difference between living as a tenant and owning property?\" The answer given was that living as a tenant is more expensive than owning property because tenants do not own the property they live in.\n\nSUBSTANTIATE CHARGES\n\nThe Editor: In a report in the recent issue of the Saskatchewan News, Mr. Jacobs, deputy minister of municipal affairs, said that he had received complaints from citizens regarding the North West Adjustment Board. He stated that these complaints were unfounded and that the board was doing a good job.\n\nMr. Jacobs, may I have the space to expand on the hardship faced by the poor farmer? The government has been criticized for not doing enough to help farmers who live on the land. They argue that the government should provide more assistance to farmers who live on the land.\n\nThere is a guarantee that the North West Adjustment Board will be elected next year. Last year our town council members were elected by a large margin. This year we expect a similar result.\n\nIn conclusion, the North West Adjustment Board has been very successful in its first year of operation. It has provided a fair and impartial method of settling disputes between employers and employees. We look forward to seeing what the board will accomplish in the future.\npaid not to blame\naid not to blame\n\nThe above question naturally brings up your county's condition. I nearly had my ear cut off when I told him we had got our councilor to attend. When he heard that we had organized the necessary for the annual meeting to be held in the evening at Goye. When he heard that we had appointed someone to attend, he started to say before trying to explain that he could get after your councilor. When he heard that we had appointed someone to attend, he started to say before trying to explain that he could get after your councilor.\n\nThe following question was asked by Mr. W. A. Gifford:\n\nSUBSTANTIATE CHARGES\n\nThe Editor: In a report of the difference between living as an instrument (and other ex-\n\nThe above question naturally brings up your county's condition. I nearly had my ear cut off when I told him we had got our councilor to attend. When he heard that we had organized the necessary for the annual meeting to be held in the evening at Goye. When he heard that we had appointed someone to attend, he started to say before trying to explain that he could get after your councilor.\n\nThe following question was asked by Mr. W. A. Gifford:\n\nSUBSTANTIATE CHARGES\n\nThe Editor: In a report of the difference between living as an instrument (and other ex-\naid not to blame\n\nThe above naturally brings up the question—What is having acquired girders (West-\n\nern Instrument) and other er-\n\nratic thought.\n\nSUBSTANTIATE CHARGES\n\nThe Editor: In a report of the difference between living an honest life and doing something which is not honest, I have found myself in a situation where I must choose between two options: either to continue living an honest life or to engage in dishonest practices. After careful consideration, I have decided to continue living an honest life.\n\nI am aware that some people may view my decision as naive or idealistic, but I believe that honesty is the best policy. I am confident that by living an honest life, I will be able to achieve my goals and make a positive impact on the world.\n\nIn conclusion, I urge everyone to consider the importance of honesty in their lives. By living an honest life, we can build trust and earn the respect of others.\nPlease print name and address in capital letters.\n\nYour full name: T. W. BENNETT\nPresent address: WILLIAM BURTON, SASK.\nPioneer address:\nYear you came to Saskatchewan: 1909\n\nNote to Persons Answering the Local Government Questionnaire:\n\nThis questionnaire is divided into four parts:\n\nPART I: Statute Labour Districts and Local Improvement Districts\nPART II: Rural Township Local Improvement Districts and Rural Municipalities after 1908.\nPART III: Villages and Cities.\nPART IV: Towns and Cities.\n\nYou may answer the parts dealing with the types of local government under which you have lived, and disregard the other sections. For example, if you came to Saskatchewan after 1908 and have always lived in a rural municipality you will only Part II; if you came to a rural area before 1908 and in later years moved to a town, you probably will be able to answer Parts I, II, and IV.\n\nSome of the questions are repeated in more than one part. In each case, which it is included, and you may therefore need to answer the same question more than once, as it applies to different forms of local government under which you have lived.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nLocal Government\n\nPlease print name and address in capital letters.\n\nYour full name: T. W. BENNETT\nPresent address: Willow Bunch, Sask.\nPioneer address:\nYear you came to Saskatchewan: 1909\n\nNote to Persons Answering the Local Government Questionnaire:\n\nThis questionnaire is divided into four parts:\n\nPART I: Statute Labour Districts and Local Improvement Districts\nPART II: Rive-Township Local Improvement Districts and Rural Municipalities after 1908\nPART III: Villages\nPART IV: Towns and Cities\n\nYou may answer the parts dealing with the types of local government under which you have lived, and disregard the other sections. For example, if you came to Saskatchewan after 1908 and have always lived in a rural municipality you will answer only Part II; if you came to a rural area before 1908 and in later years moved to a town, you probably will be able to answer Parts I, 2 and 4.\n\nSome of the questions are repeated in more than one part. In each case, which it is included, and you may therefore need to answer the same question more than once, as it applies to different forms of local government under which you have lived.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPART II: STATUTE LABOUR DISTRICTS AND LOCAL IMPROVEMENT DISTRICTS BEFORE 1908.\n\n1. In which of these (and during what years) did you live?\n   - Statute Labour Districts (1 township in size, before 1903).\n\n2. If you remember when the organization of district was on a voluntary basis, tell whether they were popular or unpopular?\n   For what reasons?\n\n3. Was the decision to make them compulsory popular with the residents?\n\n4. What arguments were used to justify the compulsion?\n\n5. What objections to compulsion were raised?\n\n6. Ratepayers meetings:\n   - how many usually attended?\n   - what took place, and what was the order of business?\n\n7. Overseer:\n   - was there much competition for this position?\n   - what was the regular occupation of the overseer?\n   - was he considered efficient?\n   - was he given a free hand in supervising district affairs?\n   - did he do much of the work himself?\n\n8. Activities:\n   - what were considered the most important activities of the district (list in order of importance).\n   - was there general agreement that these activities be carried on?\n   - what equipment did the district own?\n   - was it ever loaned to individuals?\n   - if so, did this cause any difficulties?\nSAS LANCHESTER ARCHIVES QUESTIONNAIRE.\n\nNo. 10\n\nLocal Government.\n\nPART I: STATUTES, LABOUR DISTRICTS AND LOCAL IMPROVEMENT DISTRICTS BEFORE 1908.\n\n1. In which of these (and during what years) did you live?\n\n   Statute Labour Districts (1 township in size, before 1903).\n\n2. If you remember where the organization of districts was on a voluntary basis, tell whether they were popular or unpopular.\n\n   For what reasons?\n\n3. Was the decision to make them compulsory popular with the residents?\n\n4. What arguments were used to justify the compulsion?\n\n5. What objections to compulsion were raised?\n\n6. Ratepayers meetings:\n\n   - how many usually attended?\n   - what took place, and what was the order of business?\n\n   - was there much discussion or argument? on what subjects?\n\n7. Overseers:\n\n   - was there much competition for this position?\n   - what was the regular occupation of the overseer?\n   - was he considered efficient?\n   - was he given a free hand in supervising district affairs?\n   - did he do much of the work himself?\n\n8. Activities:\n\n   - was there general agreement that these activities be carried on?\n   - what equipment did the district own?\n   - was it ever loaned to individuals?\n   - if so, did this cause any difficulties?\n9. Taxes:\n   - were they considered heavy?\n   - were they considered fair as a means of raising funds?\n   - was there any difficulty in collecting taxes?\n\n10. Statute Labour:\n    - was this popular?\n    - was the labour involved efficient?\n\nFour Townships to Statute Labour Districts (after 1933):\n   - was the increase in size popular at first?\n   - what arguments were given for the change?\n   - was there any opposition?\n   - on what grounds?\n\n   - after people became accustomed to the change in size, what advantages or disadvantages did they think the four township unit had over the one township unit?\n\n12. What were the ratepayers meetings like?\n\n13. Was there much competition for the position of councillor?\n\n14. Did candidates engage in \"electioneering\"? Explain.\n\n15. Was there a good turnout of voters for elections?\n\n16. How frequently did council meet?\n\n17. Describe procedure at council meetings (if you are familiar with it).\n\n18. Were relations between the council and the secretary-treasurer usually good? If not, what were the causes of difficulty?\n\n19. What was the general opinion about the secretary-treasurer?\n    - on what grounds?\n\n20. What other persons were employed by the council?\n9. Taxes:\n   - were they considered heavy?\n   - were they considered fair as a means of raising funds?\n   - was there any difficulty in collecting taxes?\n\n10. Statute Labour:\n    - was this popular?\n    - was the labour involved efficient?\n\n11. Townships, Statute Labour Districts (after 1903):\n    - was the increase in size popular at first?\n    - what arguments were given for the change?\n    - was there any opposition?\n    - on what grounds?\n    - after people became accustomed to the change in size, what advantages or disadvantages did they think the four township unit had over the one township unit?\n\n12. What were the ratepayers meetings like?\n\n13. Was there much competition for the position of councillor?\n\n14. Did candidates engage in \"electioneering\"?\n    Explain.\n\n15. Was there a good turnout of voters for elections?\n\n16. How frequently did council meet?\n\n17. Describe procedure at council meetings (if you are familiar with it).\n\n18. Were relations between the council and the secretary-treasurer usually good? If not, what were the causes of difficulty?\n\n19. What was the general opinion about the secretary-treasurer?\n    - on what grounds?\n\n20. What other persons were employed by the council?\nPART II: RURAL-TOWNSHIP LOCAL IMPROVEMENT DISTRICTS AND RURAL MUNICIPALITIES\n\n1. During what years did you live in a rural township L.I.D.? (Give numbers or names)\n\n2. Did the people in your community like this form of organization better than the smaller units in existence before 1908? For what reasons?\n\n3. Describe ratepayers meetings, telling how many attended, what took place at meetings, what subjects caused the most discussion, and any differences noted from meetings of earlier years.\n\n4. Was there much competition for election to positions of reeve and councillor? Were they regarded as positions of some honor, or just a chore that someone had to do?\n\n5. Were people generally satisfied with the way local affairs were managed by the reeve and council? If not, for what reasons?\n\nDid people think that relatives and friends of council members received special favors?\nPART II: RURAL-TOWNSHIP LOCAL IMPROVEMENT DISTRICTS AND RURAL MUNICIPALITIES\n\n1. During what years did you live in a rural township? (List numbers or names)\n\n2. Did the people in your community like this form of organization better than the smaller units in existence before 1909?\n\nFor that reason?\n\n3. Describe meetings held by the district, telling how many attended, what took place at meetings, which subjects caused the most discussion, and any differences noted from meetings of earlier years.\n\n4. Was there much competition for election to positions of reeve and councillor?\n\n5. Were people generally satisfied with the way local affairs were managed by the reeve and council?\n\nIf not, for what reasons?\n\nDid people think that relatives and friends of council members received favors? If so, of what kind?\n\nThis condition should tell itself five years ago.\n6. Describe differences in activities and duties of the 9 township L.I.D.'s or R.M.'s as compared with the 4 township units before 1908?\n\nDid people think the L.I.D. (or R.M.) should do more?\n\n7. What equipment did the L.I.D. (or R.M.) own? Very little early\n\nYes it loaned to individuals or kept only for municipal (or district) work?\n\nNo\n\nWas there much complaint about the taxes levied for municipal purposes?\n\nIf so, on what grounds? (that is, because they were too heavy, or not fairly distributed, etc.)\n\nWhat suggestions did people have for ways of raising revenue other than taxes on land?\n\n9. Were people in the L.I.D. anxious to have it formed into a R.M.? Why or why not?\n\n10. Was it customary to permit a person to work off his taxes by cutting bush on the road allowances or by roadwork with team and scraper?\n\nCan you remember during what years this was allowed?\n\n1909 - 1914 or 16.\n\nGradually my Connolly paid last year.\n\nI'm glad to admit that Mr. H. forwarded his bill to me and I paid it.\n6. Describe differences in activities and duties of the 9 township L.I.D.'s or R.M.'s as compared with the 4 township units before 1908?\n\nDid people think the L.I.D. (or R.M.) should do more?\n\n7. What equipment did the L.I.D. (or R.M.) own? Why?\n\nWas it leased to individuals or kept only for municipal (or district) purposes?\n\n8. Was there much complaint about the taxes levied for municipal purposes?\n\nIf so, on what grounds? (that is, because they were too heavy, or not fairly distributed, etc.)\n\nWhat suggestions did people have for ways of raising revenue other than taxes on land?\n\n9. Were people in the L.I.D., anxious to have it formed into a R.M.?\n\nWhy or why not?\n\n10. Was it customary to permit a person to work off his taxes by cutting bush on the road allowances or by roadwork within town and scrapers?\n\nCan you remember during what years this was allowed?\n\nGreatly will my curiosity be satisfied if you will forward this bulletin at once. Bennett, Thomas William\n\n1909 - 1914 - 16.\n\nRed has not got a clear mandate yet.\nPART III: VILLAGES.\n\n1. In what villages (and during what years) have you lived?\n\n2. Do you recall the formation of the village?\n   If not, was there much excitement among the people over its formation or any particular notice given to their event?\n\n3. If you lived in a R.M., or L.I.D., before moving to the village, what differences did you notice in the management of affairs?\n\n4. Was there much competition for the position of councillor?\n   Was there usually a good turnout of voters for election of councillors?\n   Was it generally considered that the council did a good job?\n   Was there any custom followed in the selection of overseer by council members (i.e., by rotation etc.)?\n\n5. In the conduct of village affairs, how did the importance of the overseer compare with that of the other councillors?\n\n6. What were the most important activities of the village council?\n   (List in order of importance).\n\n7. Were these duties well performed?\n   Did property owners in the village think they were taxed unfairly compared with people living in the surrounding district and making use of village facilities?\n   Describe any efforts made in the village for the adoption of the single tax.\n   How successful were these efforts?\n\n8. Has there ever been much agitation or desire to have the village established as a town?\nPART III: VILLAGES.\n\n1. In what villages (and during what years) have you lived?\n\n2. Do you recall the formation of the village? If so, was there much excitement among the people over its formation or any particular notion given to this event?\n\n3. If you lived in a R.M. or L.I.D. before moving to the village, what difference did you notice in the management of village affairs?\n\n4. Was there much competition for the position of councillor?\n   Was there usually a good turnout of voters for election of councillors?\n   Was it generally considered that the council did a good job?\n   Was there any custom followed in the selection of overseer by councillor meetings (i.e., by rotation etc.)?\n\n5. In the conduct of village affairs, how did the importance of the overseer compare with that of the other councillors?\n\n6. What were the most important activities of the village council?\n   (List in order of importance).\n\n7. Were these duties well performed?\n   Did property owners in the village think they were taxed unfairly?\n   Did people living in the surrounding district and outlying areas use village facilities?\n   Describe any efforts made in the village for the adoption of the single tax.\n\n8. How successful were these efforts?\n\n9. Has there ever been much agitation or desire to have the village established as a town?\nPART IV: TOWNS AND CITIES.\n\n1. In what towns or cities (and during what years) have you lived?\n\n2. If you remember its establishment as a town (or city), tell what you recall of any special notice given to the event.\n\n3. What differences in the management of local affairs did you notice particularly compared with where you had lived previously?\n\n4. Was there much competition for the position of mayor?\n\n5. What differences have you noticed in the services performed by the town (or city) recently as compared with earlier years?\n\nDo you think the changes are an improvement, or not?\n\n6. Has there ever been much complaint from property owners in the town (or city) that they were taxed unfairly compared with people living in the surrounding district and making use of town (or city) facilities?\n\nDescribe any efforts made for the adoption of the single tax.\n\nHow successful were these efforts?\nPART IV: TOWNS AND CITIES.\n\n1. In what towns or cities (and during what years) have you lived?\n\n2. If you remember its establishment as a town (or city), tell what you recall of any special notice given to the event.\n\n3. What differences in the management of local affairs did you notice particularly compared with where you had lived previously?\n\n4. Was there much competition for the position of mayor?\n\n5. What differences have you noticed in the services performed by the town (or city) recently as compared with earlier years?\n\nDo you think the changes are an improvement, or not?\n\n6. Has there ever been much complaint from property owners in the town (or city) that they were taxed unfairly compared with people living in the surrounding district and making use of town (or city) facilities?\n\nDescribe any efforts made for the adoption of the single tax.\n\nHow successful were those efforts?\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3470.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 5611, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 75, 5], [75, 75, 6], [75, 75, 7], [75, 151, 8], [151, 227, 9], [227, 227, 10], [227, 227, 11], [227, 459, 12], [459, 459, 13], [459, 459, 14], [459, 2390, 15], [2390, 2408, 16], [2408, 3681, 17], [3681, 4603, 18], [4603, 5862, 19], [5862, 7126, 20], [7126, 8340, 21], [8340, 9588, 22], [9588, 10799, 23], [10799, 12015, 24], [12015, 12897, 25], [12897, 13761, 26], [13761, 14768, 27], [14768, 15804, 28], [15804, 17128, 29], [17128, 18456, 30], [18456, 19354, 31], [19354, 20252, 32], [20252, 20407, 33], [20407, 20561, 34]], "primary_language": ["None", "None", "None", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]