[{"id": "f86024ec9f9c143eb21b5dce131cc416c9bd0c2c", "text": "PIONEER HEALTH\n\nPlease print name and address in capital letters.\n\nYour full name: ARTHUR R. DOHLEN\nPresent address: EARL GREY\nYear of arrival in Saskatchewan: 1905\nAge at that time: 14\nPioneer Address: EARL GREY\nAt what other places did you live in Saskatchewan prior to 1947? (Saskatchewan means the area which is now Saskatchewan)\n\nPLEASE NOTE\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, although information for later years may be included.\nIf you cannot answer a question, skip it. We realize that any one person will not be able to answer all questions.\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire is greatly appreciated. All questionnaires are preserved in the Saskatchewan Archives.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER HEALTH\n\nPlease write name and address in capital letters.\n\nYour full name: ARTHUR R. DOHLEN\nPresent address: EARL GREY\nYear of arrival in Saskatchewan: 1900\nAge at that time: 14\nPioneer Address: EARL GREY\nAt what other places did you live in Saskatchewan prior to 1947? (Saskatchewan seems the area which is now Saskatchewan).\n\nPLEASE NOTE:\nThis questionnaire is intended for persons who came to Saskatchewan before 1947, although information for later years may be included.\nIf you cannot answer a question, skip it. We realize that any one person will not be able to answer all questions.\nThe extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire is greatly appreciated. All questionnaires are preserved in the Saskatchewan Archives.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Services of a Doctor\n\n   1. How far were you from the nearest doctor at first? (24 miles in London)\n\n   2. Was there any closer settlement nearby? (Explain the circumstances)\n\n   3. What was your opinion of the competence of the pioneer doctor in your district? (a good physician? a good surgeon? Explain why.)\n\n   4. Was it customary to go to the same (or family) doctor in all situations, or did it depend on the nature of the illness?\n\n   5. Was the doctor consulted at his office or called to your house? (Explain the circumstances)\n\n   6. What conditions were usually treated without reference to a doctor, and which were of a nature that led to consultation?\n\n   7. Do you recall how much you paid for doctors' calls or services?\n\n   8. What did this amount to annually for yourself? (for your family?)\n\n   9. If you have preserved accounts for medical services, would you supply a record of payments for specific illnesses, operations, etc.? Did costs ever deter you from consulting a doctor?\n\n   10. Were farm products or other services exchanged for treatment received? Give examples.\nServices of a Doctor\n\n1. How far was you from the nearest doctor at first? (Explain the circumstances)\n\n2. Was there any closer at time went by? (Explain the circumstances)\n\n3. What was your opinion of the competence of the pioneer doctor in your district? (a good physician? a good surgeon? Explain why.)\n\n4. Was it customary to go to the same (or family) doctor in all situations; or did it depend on the nature of the illness?\n\n5. Was the doctor consulted at his office or called to your house? (Explain the circumstances)\n\n6. What conditions were usually treated without reference to a doctor, and which were of a nature that led to consultation?\n\n7. Do you recall how much you paid for doctors' calls or services?\n\nWhat did this amount to annually for yourself? (Or your family?)\n\n(If you have preserved accounts for medical services, would you supply a record of payments for specific illnesses, operations, etc.)\n\nDid costs ever deter you from consulting a doctor?\n\nWe've farm products or other services exchanged for treatment received?\n\nGive example:\nII. Hospital Services\n\n8. Where was your nearest hospital? How far away was this? Who organized it and how was it supported?\n\nHow many beds did it have? How large was its staff?\n\nDid you feel that patients received good care in it?\n\n9. For what illnesses did members of your family enter hospital?\n\nMy mother had a tumor removed from her lip. She was treated in Regina Hospital.\n\n10. Do you recall how much was charged for hospitalization on these occasions? $60\n\n11. For what illnesses were members of your family confined to bed at home?\n\nI had influenza—shut myself up when I was 18 years old.\n\n12. Did other members of the family look after the sick person?\n\nWas there a registered nurse or other person in the district who assisted on these occasions?\n\n13. In the case of contagious diseases, were sick members isolated from the rest of the family?\n\n14. Were children born at home or did the mother go to hospital?\n\nIf the mother remained at home, was there a doctor, midwife, nurse, or another woman who assisted and which was preferred?\nII. Hospital Services\n\n8. Where was your nearest hospital? [Redacted]\n   How far away was this hospital?\n   Who organized it and how was it supported?\n\n9. For what illnesses did members of your family enter hospital?\n   [Redacted]\n\n10. Do you recall how much was charged for hospitalization on these occasions? [Redacted]\n\n11. For what illnesses were members of your family confined to bed at home?\n    [Redacted]\n\n12. Did other members of the family look after the sick person?\n    Was there a registered nurse or other person in the district who assisted on these occasions?\n\n13. In the case of contagious diseases, were sick members isolated from the rest of the family?\n    How was this carried out?\n\n14. Were children born at home or did the mother go to hospital?\n    If the mother remained at home, was there a doctor, midwife, nurse, or another woman who assisted and which was preferred?\nIII. Home Remedies:\n\n15. What home remedies did you use for various illnesses? (Specify)\n\n16. How did you learn of these remedies? (Specify the remedy and state if it was learned from a book, friend, television, etc.)\n\n17. What patient modalities were customarily used in your family and for what conditions?\n\n18. What serious accidents (burns, sprains, fractures, etc.) were experienced by members of your family and what treatment was given?\n\n19. What was done about securing such aids for the household as crutches, wheelchairs, etc.?\n\n20. Do you recall home remedies being used to circumstances other than for specific illnesses? (Specify)\n21. Did you have a \"doctor booklet\" to diagnose illnesses? To what extent was it used?\n\nConsulted for remedies?\n\nIV. Public Health Problems\n\n22. Were members of your family vaccinated or inoculated against contagious diseases? (State diseases and dates.)\n\nWas this done by the family doctor at his suggestion or at the family's request, or was there a definite campaign carried on in the district with arrangements made for immunization of the children and/or adults at one time?\n\n23. Do you recall epidemics in your district in which quarantine was enforced? Upon whose orders was this carried out?\n\n(Give details of the epidemic)\n\n24. Was there ever an outbreak of typhoid fever in your community? (Describe.) What was considered to be the source of infection and what steps were taken to remedy the situation?\n\n25. Was it ever found necessary to close your local school because of an epidemic? (Specify the occasion.)\n21. Did you have a doctor book you to diagnose illness? To what extent was it used?\n\nConsulted for remedies?\n\nIV. Public Health Problems\n\n22. Were members of your family vaccinated or inoculated against communicable diseases? (State disease and dates.)\n\nWas this done by the family doctor at his suggestion or at the family's request, or was there a definite campaign carried on in the district with arrangements made for immunization of the children and/or adults at one time?\n\n23. Do you recall epidemics in your district in which quarantine was enforced? (Upon whose orders was this carried out?)\n\n24. Was there ever an outbreak of typhoid fever in your community? (Describe.) What was considered to be the source of infection and what steps were taken to remedy the situation?\n\n25. Was it ever found necessary to close your local school because of an epidemic? (Specify the occasion).\n26. Were there occasions when children with mild contagious diseases such as measles, chicken pox, etc., continued at school because of their prevalence in the district?\n\n27. Do you recall any infectious eye diseases in the district (pink eye, trachoma)? Among what groups did these occur? What treatment was given and what steps were taken to prevent their spread?\n\n28. Were there any cases of tuberculosis in your district, or was it ever contracted by a member of your family? What treatment was undertaken and was this prescribed by a doctor?\n\nHas the patient sent to hospital? Do you recall steps being taken in your community in keeping with the movement for sanatoria in the province (i.e., informal discussions, public meetings, petitions, visiting speakers)?\n\nV. Dental Services\n\n29. How far was it to the nearest dentist?\n\n30. How often did you see him? When very regularly?\n\n31. What dental conditions led to your seeing him (fillings, extractions)?\n\n32. Was it customary to have fillings?\n\n33. Were there instances when simple extractions were carried out at home?\n26. Were there occasions when children with mild contagious diseases such as measles, chicken pox, etc., continued at school because of their prevalence in the district?\n\n27. Do you recall any infectious eye diseases in the district (e.g., eye, trachoma)? Among what groups did these occur? What treatment was given and what steps were taken to prevent their spread?\n\n28. Were there any cases of tuberculosis in your district, or was it ever contracted by a member of your family? What treatment was undertaken and was this prescribed by a doctor?\n\nWas the patient sent to hospital?\n\nDo you recall steps being taken in your community in keeping with the movement for sanitation in the province (i.e., informal discussions, public meetings, petitions, visiting speakers)?\n\nV. Dental Services\n\n29. How far was it to the nearest dentist? How often did you see him? When very necessary?\n\n31. What dental conditions led to your seeking him (fillings, extractions)?\n\n32. Was it customary to have fillings? Yes\n\n33. Were there instances when simple extractions were carried out at home?\n34. What was charged for the various dental services?\n\nDid costs deter you from visiting a dentist?\n\nVI.\n\n35. List personal (or non-communicable) diseases deemed to be most frequent in your district in the pioneer period?\n\nWhat communicable diseases?\n\nWhat accidents?\n\n36. In connection with any of these diseases do you recall a feeling of helplessness on your part and/or others in face of the lack of facilities for treatment?\n\nWhat did you think should be done about the situation?\n\n37. What efforts were taken in your community toward an improvement of the situation in public meetings, enforcing quarantine, immunization, municipal doctor, union hospital? (Give details).\n\n38. Add any personal experiences, recollections or observations related to this topic which have not been touched in the questionnaire. (Use back of page or extra sheets if necessary).\n34. What was charged for the various dental services?\n\nDid costs deter you from visiting a dentist?\n\nVI.\n\n35. What personal (or non-communicable) diseases seemed to be most frequent in your district in the pioneer period?\n\nWhat communicable diseases?\n\nWhat accidents?\n\n36. In connection with any of these diseases do you recall a feeling of helplessness on your part, and if others in lieu of the lack of facilities for treatment?\n\nWhat did you think should be done about the situation?\n\n37. What steps were taken in your community toward an improvement of the situation? (Public meetings, organizing committees, municipal, county, union hospital?) (Give details).\n\n38. Add any personal experiences, recollections or observations related to this topic which have not been included in the questionnaire.\n\n(Use back of page or extra sheets if necessary).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3493.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3382, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 941, 5], [941, 1883, 6], [1883, 2980, 7], [2980, 4040, 8], [4040, 5084, 9], [5084, 5981, 10], [5981, 6625, 11], [6625, 6625, 12], [6625, 7546, 13], [7546, 8435, 14], [8435, 9512, 15], [9512, 10592, 16], [10592, 11456, 17], [11456, 12309, 18], [12309, 12464, 19], [12464, 12618, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]