[{"id": "27544a7cf2b64a77a88eecc5d266026957d9a35c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name WILLIAM ARTHUR HARRISON\nPresent Address BOX 212 KELVINGTON SASK\nPioneer Address MEADOW BANK SASK\nYear you came to Saskatchewan 1906\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nI still reside in Meadow Bank District but the\nPLEASE NOTE Post Office was discontinued in 1919\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Homes were closer than now but travelling more difficult. How many of these were bachelor's homes? Most of them.\n\n2. How often did you usually visit neighbors? Very irregularly.\n\n3. Did you usually visit on a Sunday, or other days? Usually Sundays unless combining business (borrowing) with pleasure.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Invitations were general, not particular or necessary.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Most of the day was spent travelling back and forth occasionally we stayed overnight.\n\nWhat about meals? Did you stay when not invited beforehand? Have no recollection of eating without one or more meals.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) The word sounds familiar.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Usually the place was left to care for itself.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe commonest Bees were in preparing ground for picnics but there were bees for house raising, shingling, woodcutting & stocking hay that had been raised in those.\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe.\n\nYes. People traveled many miles to attend them and found small accommodation when they arrived but seemed to enjoy it nevertheless.\n\nWere these more frequent in later years? Give dates.\n\nThey became more so when buildings were erected.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, twice a month, etc.?\n\nIt appeared to happen in waves. Periods of keen activity. Other periods of apathy. Both of which are difficult to explain.\nREGULARLY VISITING, FAMILIES, ETC.\n\n1. In the first five years, how many times have you visited neighbors? How often did you usually visit neighbors? How many of these visits were formal or informal?\n\n2. How often did you usually visit neighbors? How many of these visits were formal or informal?\n\n3. Did you usually visit on Sundays or other days? How many of these visits were formal or informal?\n\n4. How often did you usually visit neighbors? How many of these visits were formal or informal?\n\n5. Did the whole family go out or did someone stay home to look after the house?\n\n6. Did you ever have \"tea\" than groups of neighbors came together to put up a building, make quilts, or other such activities?\n\n7. Tell what you remember about such gatherings, giving dates if possible, telling what the events were for, and how often they occurred.\n\nThe commonest reasons were for picnics, but they were also for house raising, churning, woodcutting, carding, hay making, etc.\n\n8. People generally met many mills to attend them and found small areas of land when they arrived but seemed to enjoy it nevertheless.\n\n9. They became more so when buildings were erected.\n\n10. It appeared to happen in winter, possibly because of the weather.\n\n11. Other reasons of activity.\n\nBoth of which are difficult to explain.\nQuestion No. 9\n\nRe Meadow Bank Community Hall (1)\n\nNW corner of Lot 15 - th 36-09-12 W2wpa\n\nThis hall was first built in 1916 under the auspices of Meadow Bank Grain Growers' Association by the people of Meadow Bank and surrounding district under the leadership and assistance of Mr John Waddell, pioneer farmer and carpenter of Meadow Bank.\n\nFunds were raised by donations and small loans. Voluntary labour was used in its erection.\n\nLocal ash and lumber was mainly used but finishing was of good British Columbian cedar and fir.\n\nWhen the Meadow Bank Grain Growers' Association ceased to function the people of Meadow Bank took over the building as already provided for in the Constitution.\n\nIn 1927 the Hall was moved to a more convenient site where it now stands as indicated above.\nQuestion No. 9\n\nRe Meadow Bank Community Hall (1)\n\nN.W. corner of Lee 15th St., 36-09-12 W2 m.p.\n\nThis hall was first built in 1916 under the auspices of Meadow Bank Grain Growers' Association by the people of Meadow Bank and surrounding districts under the leadership and assistance of Mr. John Waddell, pioneer farmer and carpenter of Meadow Bank.\n\nFunds were raised by donations and small loans. Voluntary labour was used in its erection.\n\nLocal ash and fir lumber was mainly used but finishing was of good British Columbian cedar and fir.\n\nWhen the Meadow Bank Grain Growers' Association ceased to function the people of Meadow Bank took over the building as already provided for in the Constitution.\n\nIn 1927 the Hall was moved to a more convenient site where it now stands as indicated above.\nQuestion No. 9\n\nIt was placed on a cement foundation and enlarged from its original dimension of 22 feet by 36 feet to 22 feet by 60 feet including kitchen.\n\nSubsequently, it was sided and ceiled with good quality lumber and an excellent floor laid which is still in use.\n\nThe management is in the hands of a President and Board of Directors elected annually by the Local Community.\n\nIt is still the centre of Social activity including Community Dances, Wedding Celebrations (not ceremonies), Bridal Showers, Public Meetings of all kinds, Elections, Municipal, Provincial & Federal as well as Religious Services and occasionally Funeral Services.\n\nA carved oak Memorial to the original builder Mr John Waddell was placed in the Hall in 1930 after his death. It quotes his own words at the opening: \"Built for the Social and Moral and Spiritual uplift of the people.\"\nIt was placed on a cement foundation and enlarged from its original dimensions of 22 feet by 36 feet to 28 feet by 60 feet including kitchen. Subsequently, it was raised and re-tilted with good quality lumber and an excellent floor. Land rent is still in use.\n\nThe management is in the hands of a President and Board of Directors elected annually by the Local Community.\n\nIt is still the centre of social activity including Community Dances, Weddings, Celebrations (not ceremonies), Bridal Showers, Public Meetings (not ceremonies), Provincial & Federal Elections, Municipal, Religious Services and occasionally Funeral Services.\n\nA carved oak memorial to the original builder Mr John Waddell was placed in the Hall in 1930 after his death.\n\nIt quotes his own words at the opening:\n\n\"Equal for the Social and Moral and Spiritual uplift of the people.\"\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nIn this district the Schoolhouse was used only for strictly School purposes\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nChristmas Trees & Christmas Concerts were not in vogue in early days as school closed in winter\n\n9. When was your first community hall built? 1916\n\nWhat material was it made of? Spruce lumber How large was it? 22 x 36\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Meadow Bank Grain Growers Association\n\nWas it built in the village or town, or was it a country hall? 18 miles from Wadena the nearest town\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\nThe Hall took the place of homes for all gatherings except please see attached sheet referring to Question 9\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nLittle often the whole family attended\n\nHow were babies and small children provided for? Piled on beds in old homes or on benches in the halls with care taken that they were not sat on.\n\nHow were horses sheltered and fed in the winter time at these parties? Cows were turned out to make room for heated teams\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular? Squares most popular but Minuet, Schottise, Polka & Waltz also\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNot sufficient to cause open friction here\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nThe objection appears to have gradually died down but is still in existence\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, picnics, etc.) If you have not described these on the School Questionnaire, give dates.\n\nIn this district, the Schoolhouse was used only for strictly School purposes.\n\nChristmas Trees & Holiday Concerts were not in vogue in early days or school closed in winter.\n\n9. When was your first community hall built? 1916\n\nWhat was its name? Stone Lumber, how large was it? 22 x 36\n\nWho built it? The community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\nThe stage took the place of home and provided gathering place and entertainment.\n\n10. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nMinnestoa, Schottas, Polka & Waltz also\n\nNot sufficient to cause Ken Frickton here\n\nThe objection appears to have gradually died down but is still in existence\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.?\n\nNo opportunity existed for this.\n\n13. Was the chivaree known in your community?\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nMainly used to annoy newly married couples. Never very popular here.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nThe period of 1914 to 1918 created great activity in raising funds for Red Cross and other charities. These often took the form of \"charge dances\" etc.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nMeadow Bank Grain Growers Association\n\nGive the date and reason for it being organized.\n\nAccording to the Minute Book\nRe-Organized Jan 12 1915\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization. 1914\n\nMr Waddell the President was the main organizer\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nMost of the farmers joined for a while\n\nHow many women belonged? Several How often did it meet? Monthly\n\nWhat were some of the activities carried on by this organization?\n\nIt sponsored many charitable and patriotic activities\nBox Socials, Christmas Trees The first Santa Claus\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at \"formality\" or \"snobbery\" do you remember in small towns, such as gloved and hats when calling, calling cards, visiting treated ceremonially?\n\nNo Montgomery existed for this.\n\n13. Was the obituary known in your community? Describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\nMainly used & among newly married couples. Never very popular here.\n\nThe period of 1914 to 1918 created great activity in raising funds for Red Cross and other charities. Recreation (not to form of change dances) etc.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nMeadow Ranch Grain Growers Association\n\nAccording to the Minute Book\n\nRe-organized Jan 12, 1915\n\n16. Was there a Homemakers Club in your district? When was it organized? Approximately how many women belonged to it?\n\nYes\n\nWas there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nBox Socials were most common. Collections at Picnics covered only expenses for shorts.\n\n19. Where did various organizations hold their meetings?\nMr Waddell's, Mr Ahl's & Mr Walter's homes until the Hall was built.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nWe had a lecture on Dairying by Mr L.C. Wirtz of Wadena at Chington Post Office in 1914. Also attended lecture on Potatoes by Dean of Agriculture.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Not till after 1916\n\nPool Elevators & United Church Minister\n\nWhat were the slides about?\nCo-Operation & Missionary work\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nBoo Socials were most common.\n\nCollections at Picnics covered only expenses for shorts.\n\n19. Where did various organizations hold their meetings?\n\nOn Waddely's, Muhl's & Mr. Walter's homes until the Hall was built.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nWe had a lecture on Dairying by Mr. L.C. Wirtz of Wadena at Chington Post Office in 1914.\n\nAlso attended lecture on Potatoes by Dean of Agriculture.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides? Not till after 1916.\n\nPool Elevators & United Church Minister\n\nWhat were the slides about?\n\nCo-Operation & Missionary work\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \nMost people considered work more important than games.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIONICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it? July 1907 at Wadena. Everybody attended it for miles.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nIt included horse racing and baseball.\n\n28. Was it the first picnic held in the community? September 1909, first Meadow Bank Picnic.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \nFoot races, jumping etc., in which all took part including women.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \nBoard tables were laid and full meals served under the trees.\n\n31. What did you have to eat and drink? Salads & cooked meals with tea & coffee.\n\n32. What time of the day did it start, and how long did it last?  \nStarted at noon & the dance lasted all night.\n22. What winter games were played outdoors - fox and knuckles, etc.? \nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Ludlow\" or others, checkers or other games? \nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children attend races connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? Describe.\n\n**PICTURES AND SPORTS**\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \nGive year and month or possibly day.\n\n26. Who organized it?\n\n27. Was it for the entire community, for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community? \n\n29. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups?\n\n30. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nStarted at noon & the dance lasted all night.\n33. Describe any features of this picnic which you remember as outstanding.\n\nTwo of our handy men built a boat which gave the young folks \"the time of their lives\" on Meadow Bank Lake. Two boats would have been better as it would have induced competition.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nEvery district had its Pic Nic and people visited from other districts. The home district provided refreshments. The visitors contributed to a collection.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe advent of cars around 1917 or '18 made considerable change. People became more independent in their habits and provided their own meals or taxis for them.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nIn the early years children & old people were scarce so everybody took part in foot races, jump & ball games.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first indoor rink was built, and what was it used for!\n40. When did an annual \"sports day\" become established in your community? 1940\nDid it grow out of or replace the earlier community picnics? Yes\nWho was responsible for starting the first sports day? The local School teacher\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\nDecided annually\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nThe poems of Burns, Tennyson, Browning Longfellow\nMany of the works of Charles Dickens\nAlso of James Barrie. \"Jan MacLaren\" Didn't Hagg\n\n43. How many of your neighbors brought books with them? not very many\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\nBorrowed Black Rock Doctor of Crowsnest\n& The Man from Glengarry by Ralph Connor\n\n45. Did you buy many books after you came west? Give details. No\n\n46. What books were sent to you as gifts in early years?\nHarmsworth's History of the World by Arthur Mee\nRobert Falconer by George MacDonald\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\nIt was there in 1916\n\n48. Was there a school library? Yes\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\nI am afraid not.\n7. When did an annual \"sports day\" become established in your community? 1940\n\n40. Did it grow out of or replace the earlier community plan? Yes\n\nWho was responsible for starting the first sports day? The local school teacher.\n\nWhen was the sports day usually held (what month, or any special day, such as May 25th or July 4th)? Decided annually.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nThe poetry of Burns, Tennyson, Browning, Longfellow.\n\nMany of the works of Charles Dickens and Addy of James Bonnie. Van Maroon's \"Ridiculous.\"\n\n43. How many of your neighbors brought books with them? Not very many.\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\nBorrowed \"Black Rock\" by Oliver of Brownwood.\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n\"Homeward Bound\" by Robert Falconer.\n\n47. Have you ever had any \"travelling library\" come to your community or school? Give details and dates.\n\n48. Was there a school library? Yes\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? I am afraid not.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it\n   contained, how many people used it, where it was kept, who acted as librarian,\n   and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to\n    the west?\n    Winnipeg Free Press (Weekly)\n    Family Herald & Weekly Star\n    Nor West Farmer\n\n52. Describe later changes in your subscriptions, telling why you stopped cer-\n    tain subscriptions and added others.\n    Dropped the Family Herald considering\n    its agricultural articles unsuited to the West.\n    Did not like its politics\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading\n    material?\n    Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n    Some have gone astray\n\n55. Did you find a lack of reading material or sources of information in your\n    early days in the west a hardship? Explain.\n    No I had all I had time to read.\n8. Have there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other data which you can about the library - how many books it owns, how many people used it, where it was kept, who acted as librarian, what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nFamily Herald & Weekly Star\nNor West Farmer\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nBrotherhood of the Family Herald concerning its agricultural activities compared to the West.\n\nDid not like it so decided to stop it.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nSome have gone away\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo I had all I had time to read.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\nThere were several violins & mouth organs, some harps and a few organs.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\nHouse organ bought from neighbour 1928\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment:\n\n56. What musical instruments did you bring with you?\n\n57. Did you have any of your neighbors have?\n\n58. How large a part did singing and other forms of music play in your house entertainment? In early years in the West? Describe.\n\n59. What were some of the favorite songs in the home?\n\n60. In the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities; how often practice was held, where, if members had uniforms, what events the band played for.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2062.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 8267, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1325, 3], [1325, 1325, 4], [1325, 3680, 5], [3680, 4986, 6], [4986, 5773, 7], [5773, 6572, 8], [6572, 7439, 9], [7439, 8291, 10], [8291, 10693, 11], [10693, 12083, 12], [12083, 13984, 13], [13984, 15112, 14], [15112, 16752, 15], [16752, 18398, 16], [18398, 20067, 17], [20067, 21290, 18], [21290, 23125, 19], [23125, 24070, 20], [24070, 25741, 21], [25741, 27305, 22], [27305, 28544, 23], [28544, 29707, 24], [29707, 30988, 25], [30988, 31994, 26], [31994, 31994, 27], [31994, 31994, 28], [31994, 32141, 29], [32141, 32292, 30]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]