[{"id": "608e103f6da3bb4d80025074376102739d52872c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Miss Mollie P. Jones\n\n2. Your address: 2259 Albert Street, Regina, Sask.\n\n3. Date: March 5th, 1903\n\n4. Where were you born? (Give name of place and country): Marshall, Saline Co., Mo., U.S.A.\n\n5. What was your father's name and occupation?: John E. Aldridge, Implement Dealer\n\n6. When did you come to Saskatchewan? (Give month and year): Early fall of 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Butte, Overhedge and Whitehall, Montana.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 3 years\n\n9. What were your reasons for coming West?: E.C. Jones, my husband's father, filled on a homestead for us.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through E.C. Jones and family.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Mollie P. Jones\n2. Your address: 2259 Albert Street, Regina, Sask.\n3. Date: March 5th, 1908\n4. Where were you born? (Give name of place and country)\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were under 18 years of age.)\n9. That were your reasons for coming here?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nE.C. Jones, my husband's father, filled out the home sheet for us.\n\nOther E.C. from our family.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy father & mother came with us.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nMy family came here by covered wagon.\n\n13. What means of transportation did you use?\nCovered wagon and demovolt - horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIn home of E.C. Jones\n\n16. Where did you settle or take up land? S.E. 4 of 12-14-20-W2\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nOpportunity, Washi Kec., 1918 - March 1931\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nSmall hardware and tin smith shop.\nOn farm\nJones, Mrs. Mollie P.\n2299 Albert Street,\nRegina, Sask.\n\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy family came here by casual wagon.\n\n12. Did you travel by yourself or with a family?\nMy brother & mother came with me.\n\n13. What means of transportation did you use?\nCrowd wagons and driving horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, etc.)\nMeeting with Indians, adventures on the journey, accidents, etc.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nThe home of E. G. Jones\n\n16. Where did you settle or take up land?\n88.47 acres - 12-14-20-11/2\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nOpportunity Wells, Nov. 1918 - March 1931\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nSmall business and farming.\n19. How often did you write to relatives or friends in your old home?\n\nFrequently\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHorace P. Jones and married at Butte, Mont., Sept. 26, 1899\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNot to my knowledge\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy parents, J. T. and M. E. Allredge came with us and homesteaded on the N.W. 4 of 12-14-20-W.R.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nDuring the winter months we traveled in a cutter or dog sleigh. Summer months we used the buggy. Visited friends often; Methodist Church service in Buck Lake Church; Christian Church services in our home stead house. The early Methodist ministers often guests in our home, I think especially of Mr. Ball and Mr. Cameron. Mr. Ball played the violin but when sickness came unexpectedly he could put on an apron and perform a meal.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone come to Salt Lake City? If so, who and when?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell where they came from and where they settled.\n\nMy brothers, J. H. and M. E., all came from\n\nScottish, Ill., and came to St. George on the N.W.T.\n\nof 18-14-20-00 P.M.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. During the winter months, was your family on a\n\ncattle or hog droppings\n\nsummer months, was your family on a\n\nQuaker Friends' Meeting, Christian Church, The\n\nin Buck Lake Church, St. Mark's Church, The\n\nMethodist Church, Wesleyan Church, The\n\nearly Methodist meetings, The Wesleyan Church, The\n\nNew Bible Church, The Baptist Church, The\n\nthe latter church was closed at first\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Bought a Buick; steering wheel on right-hand side of car\n\n27. Where was your trading center? How far from your home? Wilson, times\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   The car often took me to Regina\n\n29. How often did you shop in the early days? Almost weekly\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Went there\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period:\n   My mail order catalogue was usually for clothing, toys for the children\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Staying permanently\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, then did you use it? Yes/No\n\n27. What was your trading center? How far from your home? Wilby, Iowa\n\n28. Did you continue to travel there? (Indicate any changes due to new transportation, better roads, etc.)\n\n29. How often did you shop in the early days? Almost weekly.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. Then (or ever) did you begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out when did you make this decision?\n\nMy mail order catalogue was actually for clothing, toys for the children.\n\nStaying permanently\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband, president of Wilcox rural telephone Co., I was Sec'y for Yankee Ridge School district for several years. I was President of the \"Sun Shirt\" Club also. President of Yankee Ridge Community Club.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nWhen our school district was formed it was named \"Yankee Ridge\" because the settlers were almost all from the States. The school is still the Yankee Ridge school on the N.W. corner of our farm.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was president of Wilcox rural telephone co., I was secy for Yankee Ridge School district for several years. I was President of the \"Sunshine\" Club also President of Yankee Ridge Community Club.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nWhen our school district was formed it was named \"Yankee Ridge\" because the settlers were almost all from the States. The school is still the Yankee Ridge School on the N.W. corner of our farm.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nAlberta Attison, worker, Spokane, Wash.\nReginald T. Jones, Colfax, Washington, sells International farm machinery, trucks etc.\nHerbert E. Jones, Regina; works for C.N.R. Express office\n\n41. What do you think are the most important changes in your community since you first came West?\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n__________________________\n39. Question regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and pictures, minute books of community organizations, old pamphlets, old photographs, recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the name and addresses of other persons who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_701.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 3931, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1316, 5], [1316, 2391, 6], [2391, 3292, 7], [3292, 4190, 8], [4190, 5481, 9], [5481, 6624, 10], [6624, 7842, 11], [7842, 8709, 12], [8709, 10071, 13], [10071, 11433, 14], [11433, 12702, 15], [12702, 13682, 16], [13682, 13770, 17], [13770, 13924, 18]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]