[{"id": "5ceba7fa658294bd692d78b71e7e3d868608f1e9", "text": "Please print name and address in capital letters.\n\nYour full name: [Name]\nPresent address: [Address]\nPioneer address: [Address]\n\nDo you come to Sandstone? [Yes/No]\n\nThroughout the questionnaire, \"Sandstone\" means the area which is now Sandstone.\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Sandstone before 1932, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on this questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Sandstone archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSandstone Archives Office,\nUniversity of Sandstone,\nSandstone, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Only one. The first year, 4 miles away.\n\nHow many of these were bachelor's homes? In 1886 we had a family half a mile away, 3 or 4 families, one had his sister to help care for the children.\n\n2. How often did you usually visit neighbors? We visited each other quite often, especially in the summer months.\n\n3. Did you usually visit on a Sunday, or other days? Yes, when there was a religious service, or other social event.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? No invitation as a rule.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Usually late afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? Not unless we were on a long drive or were asked to stay for our safety.\n\nWas the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?)\n\nWhy to another part of the country while my husband was still teaching or farming work be made, whether at the day or not?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A cup of tea in the afternoon was offered, but I don't think it was a common practice.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Someone stayed home especially on visits.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, that was the common practice for a new comer, but we couldn't have anybody come over to help us.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nMaking a bee was the only way a man could raise the walls of a log house or put on a roof. Sometimes it was just a meeting of help for a few days, putting up a stable or grainery.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. No\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, instead, we kept making a living or just getting along, but we didn't have parties on certain occasions when young fellows left for the town or to see their fortunes elsewhere.\n\nAfter 1914 we had young people come in for a meal once a week to stay for a baseball game, sometimes we joined by others for square dancing till late in the night.\nSAUKA TOWNSHIP LOCAL HISTORY QUESTIONNAIRE\n\nNo. 5\n\nPlainer Recreation and Social Life\n\nNEIGHBOR VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Only on Sundays or other holidays?\n\n2. How often did you usually visit on a Sunday or other holiday?\n\n3. Did you usually visit in the evening or in the afternoon?\n\n4. What time of the day did you go in the morning and again at night?\n\n5. Did you ever have parties when not invited beforehand?\n\n6. Did you ever have parties when groups of neighbors came together to put up quilts, make quilts, or other such activity?\n\n7. In the earliest years that you were here, were there any parties, whilst it was up in homes?\n\nMore than more frequent in later years! Give dates.\n\nDid you follow any kind of informal schedule, such as going by two times a month, etc.? We ended our visits every two weeks, once a week, etc.\n\nIn 1914 we had many people come for a visit, but during the winter months, we rarely visited.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? 1936\n\nWhat material was it made of? Frame\n\nHow large was it? About 20 by 60\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Church organization\n\nWas it built in the village or town, or was it a country hall? Close to church\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) School hall was not far apart but were used, but schools were easier to warm up in wintertime.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? Babies were kept close together, babies were wrapped up to keep them warm.\n\nHow were horses sheltered and fed in the winter time at these parties? They were blankets & given hay until school started working.\n\n11. What card games were popular in the early days? Ring Pothole, Euchre, Whist\n\nHas there card playing for a prize? Yes, when card parties were given to raise money for the church, etc.\n\nWhat dances were popular? Square dances, waltzes & polkas\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nThe church didn't want to get money from dancing parties, so folks had their own instead.\n\nWas card playing accepted by all residents in the community, or were there those who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Card playing was always frowned upon.\n\nAt all times, we only played cards to raise money by betting, for the good reason that money was needed for the farm.\n8. Tell what was made of the school house for community dances, but not told what other activities. (Include also the school district name, town, etc.)\n\n9. When was your first community hall built? 1936\n\nWhat material was it made of? Brick\n\nNew large was 117 feet long by 40 feet wide.\n\nChurch age—1875\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions?)\n\nWas there a hall for all gatherings, and was it used enough to make use of the hall for all gatherings?\n\n10. When parties, dances, etc., were held in houses, school houses or halls as referred to in question 8, 9, and 20, did the entire family attend?\n\nHow were babies and small children provided for at these parties?\n\nWere there any dances popular in the early days?\n\n11. What card games were popular?\n\nWhat dances were popular?\n\nWas there card playing for a prize? Yes, when each party was given a chance to win prizes.\n\nWhat was the prize?\n\nHas there ever been any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings?\n\nIn conclusion, we always found card playing, whether in our own homes or in the hall, to be very enjoyable.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? None at all in a new settlement.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. Chivarees were favored only when the married couple left in a hurry for their honeymoon without giving a party or dance. When they got back they got a real warm reception, such as surrounding the house by the couple was in, yelling, beating drums, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. One Christmas party given by Mr. W. Frost in 1886, we had games such as singing John Brown's body, adding one word at a time, adding drums for each verse, also guessing games such as What is it? Word or motion, hunt out the article in question on a person in the room or on well, they were given points if the answer didn't come right, one was the Post Office. It was an occasion for great delight. We had some ORGANIZATIONS AND MEETINGS\n\nLet this next was a story told by Mrs. Olive Foster\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Each year the name of an article in the story, this one was about a man driving a harvest hay, & no matter who was chosen, he had chosen the harness, each give the date and reason for it being organized, had a part of the harness, in the story, the title used an article of the harness thus if something happened the traces, the hitches, the bit, etc.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Blind as an any part as it, the one who had been given the name Tell when it was organized, and what steps led to its organization. This showed he had taken notice of what had to get up, This showed he had taken notice of what was said, & also knew the part of a harness if he failed Approximately what proportion of the farmers in the community belonged to it? How many women belonged? How often did it meet? Named, then went pay a forfeit.\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formalizing or organizing clubs, societies, or associations did you make in your community?\n\n13. Has the club been known in your community? Describe what you remember about it.\n\n14. Describe any other details of the club, such as its name, purpose, activities, etc., that you remember.\n\n15. What was the name of the club? Describe its purpose and activities.\n\n16. Was there a Homemakers' Club in your community? If so, describe its purpose and activities.\n\n17. Was there an organization? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes. Give dates if possible. In 1886\n\nWho provided the lantern and the slides? Can't remember but we all went to Mr. Bussing's house to see it. The man kept talking using big words.\n\nWhat were the slides about? Can't remember but it was quite a diversion for us kids, better than a lesson at school.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nRope skipping was our favorite, easy to get at.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activity, who belonged (men, women, young people?), whether it included children only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible. In 1886 we provided the lantern and the slides. We didn't have enough to use for the main light tally. What were the slides about? Can't remember but it was quite a discovery for us kids, little things a lesson to think about.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-numbletype, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nNote: Skipping was our favorite & very popular.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nSkating when weather wasn't too cold.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Days were shorter in the winter but we could tell the children stories, play cards, etc., after supper. We also had parties for family members who were visiting from other places which were helpful in keeping children amused.\n\nDid the whole family join in such games, or only the children? Explain.\n\nOnly around Christmas, when presents of rubber balloons blowing them around was a sort of game kept everyone occupied.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nMaking snow houses to snowmen in the early spring.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nIn 1886, we had our first picnic over Crooked Lake in beautiful valley on July 4th.\n\n26. Who organized it?\n\nMy Elsie Kendrick, who came back from her travels to Yorkton so she had experience at outdoor events.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? As many as could come were welcome, Indian pow wows, Horses carrying weights for men, running, tug-of-war, potato races on the grass, we had to make sure even then.\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? The people from as far as Yorkton but brought tents to sleep overnight. After dark we all went to large bonfire close by, we danced to the music played by the brass band, harmonica, accordion, lights were from lanterns.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Changed for general lunch by joining my Kendrick sisters in bringing what was most needed in the food line, the ladies had cooked plenty of wild ducks, also sliced ham.\n\n31. What did you have to eat and drink? Nothing very fancy on account of the distance to carry things, homemade to think made on the spot in large crocks, no charge. No doubt the ladies had provided for that as it was for a small crowd.\n\n32. What time of the day did it start, and how long did it last? We all got there for the midday meal, we who had come about 15 PM. Kendrick we left with them to the Yorkton crowd the next morning. Then left after the dance at night. It was a 50 mile drive to Yorkton, about 10 miles to Kendrickview, that's the town where Mrs. Kendrick had gone for her goods.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo house, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\n26. Give year and month, if possible.\n\n27. Who organized it?\n\n28. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Do you remember what was done at this picnic?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating? Was there a general lunch, or did each family bring something?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? How did you get there?\n\n33. How far from town? The journey would take two hours.\n\n34. How late at night? It was about 10 miles to Brandon, Metz drive to Jordan, then to Kendal, Red River, then back to town.\n33. Describe any features of this picnic which you remember as outstanding.\n\nSleeping in the largest tent, being bitten by fleas and other insects, laughing and crying like children at play until all hours of the night. The feet of the sand, making cliffs, it was an adventure never to be forgotten. Now,反射，our parents had stayed home to do the chores, so we young girls had no one to look after our well-being, such as knitting or crafts.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe next one was held at Cotham—name of our settlement—in 1885 but I couldn't describe it for I didn't live there any more, being married to a school teacher. For Indian Reserve—had been moved around once already, arriving late to this picnic, close to Butten's Bay Cottage, I saw Percy Hocken being thrown from his horse very, but he wasn't much hurt, from broadcast that day.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nNo more picnics for us till we settled at Mt. Hubert. Then we came at Summerberry but among the rising, a family I couldn't attend, our children of school age went to school some Sundays, etc., a twist towards feeding the hungry crowd, School Rides for their parents.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this photo which you remember as outstanding.\n\n34. Describe the different kinds of dances which you knew of in the early days, such as the large community picnic, school or Sunday School parties, family picnics, etc., tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger counties, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for.\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nSleeping in the largest tent, being bitten by flies rather than insects, laughing and crying like cyclones of bullets till all hours of the night. The feel of the early morning chill, it was an experience never to be forgotten. Now, my parents had stayed home to look after the chores, so we young girls had no one to look after our well-being, such as buttering our wraps.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe next one was held at Coteau, name of our settlement in 1885 but I couldn't describe it. Food didn't have any name, being served to the school teachers. On Indian Reserve, we'd been moved around once already, arriving late to this picnic, close to getting by cottages. I saw Percy Thorburn being thrown from his racing pony, but he wasn't much hurt, there must have been a few from Broadway that day.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nNo more picnics for us till we moved at St. Hubert. Then we came at Summerberry but among the young, a family I couldn't stand, our children of school age went to school some sandstone, as a half-truck feeding the horses. School kids, their parents.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n6.\n\nDescribe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drinks, etc., held at Cottonwood Park.\n\n35. What changes have you noticed in your community in the early years, telling what took place in the various games and sports (men, women, mostly).\n\n37. For what reason was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day? When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nI brought my school books from Gardner, Texas, being barely 15 years of age, Father was taking Ta Rees from Montreal, I got hold of a French book for an American dime,\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\nMostly newspapers, magazines, etc., which they lent me, my older brothers had no time to read.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home? Only by the school children, those who taught local classes, borrowed books from their libraries.\n\n49. Did parents ever use their children's school text books as additional reading material?\n12. What books did you bring with you when you came here? (Give a list of the books you brought, and how many.)\n\n13. How many schoolbooks have you read since you came here?\n\n14. To what extent did you exchange books with neighbors?\n\n15. Did you buy any books after you came here? Give details.\n\n16. What books were sent to you as gifts in early years?\n\n17. Have you ever had any \"travelling library\" books in your community or school?\n\n18. Was there a school library when you were a student? If so, describe it.\n\n19. Did parents ever use their children's school texts books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Family Herald from Hartland, ever since 1894\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We added The Great West Farmer in 1897, followed by The Guide a Winnipeg farm magazine. The Farmer's Home Journal was very decent from 1887. It was a handsome copy size on a weekly basis that was the time the Indian Reserve school closed so we changed for a farming lot at the because in Canada. We also had the free monthly Lady Aberdeen packages of reading material.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them. In 1897 and 18 when at our Summerberry farm\n\n54. What books or papers that you brought to the west with you do you still have?\n   Too many to mention as we bought new ones, sales, some were never read, except Dickens' Works & Scotts.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes, we always managed somehow. Our days were always just there to read fairy tales to our children before they went to bed. The reading of the family lasted from 1886 to 1893 when last one left public school, being a girl she went to a convent as a Boarder.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   In it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the town?\n\n52. Describe later changes in your subscriptions telling why you stopped certain ones, taking subscriptions and added others.\n\nIn 1897, \"Halloway\" by Mrs. Gaskell, a biography of Mrs. Gaskell's life, was published. This book was very popular at the time.\n\n53. Did you ever obtain the free monthly Early American packages of reading material?\n\nGive dates and tell how and where you got them. In 1897 but when at anunciary farm\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Family Herald from Montana, ever since 1894\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We added The Great West Farmer in 1897, followed by The Guide and Winnebago Journal magazine. The Farmer's Journal was very favorite from 1887. It was a personal copy and for a while, for that was the time the Indian Reserve school closed and we changed for a farming job at this house in Montana.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them. In 1897 and when at Sun Summerberry farm\n\n54. What books or papers that you brought to the west with you do you still have?\n   Too many to mention as we bought new ones also. Some were never read except during winter season.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Not always managed somehow our days were always full even to reading fairy tales to our children before they went to bed. This was during the family lasted from 1887 to 1930 when last one left public school being a girl she went to a convent as a teacher.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, who it was kept by, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the Cree family Lady Aberdeen's magazine of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nWe bought an old church organ from Wesley Church in 1901 at Silverthorne, the children played tunes by ear almost at once.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nStarting with school songs, later on adding church tunes\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nSome at St. Hubert\n\n60. What were some of the favorite songs in the home? You sang the king of Canada because other patriotic songs, beside what our parents had taught us, such as folk songs from India or America from the States, such as my country 'tis of thee.\n\nin the community? Quite a few from France\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nMostly in our home from children who learned them at school\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo, but I can't say a lot of them in heaven or from any parents, they were a lovely bunch!\n\n63. Was there a band in your community? No When was it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. If there was no such entertainment in the community, describe.\n\n60. What were some of the favorite songs in the home? (Old songs, hymns, etc.)\n\n61. Was folk music or music of the country you came from popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune so as to make it more suitable for your community? Explain.\n\n63. Has there been a band in your community? Who started it? When was it started? How long did it continue?\n\nHow many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n10.\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important or less important part of your community now as compared with the early days? What is the reason for this change?\n\n66. Do you have any \"collecting\" hobby, such as stamps, stones, paintings, signatures, arrowheads, etc.? Tell about it.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\nOxford.\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1MB", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1884_1915.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 9788, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1077, 5], [1077, 1077, 6], [1077, 3890, 7], [3890, 4912, 8], [4912, 7229, 9], [7229, 8830, 10], [8830, 11457, 11], [11457, 12070, 12], [12070, 13568, 13], [13568, 15002, 14], [15002, 17931, 15], [17931, 19089, 16], [19089, 21327, 17], [21327, 22533, 18], [22533, 24791, 19], [24791, 25890, 20], [25890, 27512, 21], [27512, 28118, 22], [28118, 29884, 23], [29884, 30982, 24], [30982, 32664, 25], [32664, 33596, 26], [33596, 35342, 27], [35342, 36434, 28], [36434, 37557, 29], [37557, 38678, 30], [38678, 38678, 31], [38678, 38830, 32]], "primary_language": ["None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]