[{"id": "453fc0fe7b6e881df573aeaf2f48a6a04fff0c7a", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use every chance of help if there is not enough space to answer the question. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). One will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. A word of explanation to the person submitting this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by anyone else; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The best thing to do is to answer all questions to the best of your ability. If there is not enough space for your answers, use additional sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pilot,\" will be sent to you if you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Pilot,\" will be sent to you if you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Quebec.\n\nJAN 3 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ............................................................ J.A.M.E.S. (K.E.R.R.)\n\n2. Your address Box 156, T.N.D.I.A.M., H.E.A.B., S.A.S.K.\n\n3. Date ................................................................. 30/1/1954\n\n4. Where were you born? (Give name of place and country) ........................................... Teckwidge, Alta\n\n5. What was your father's name and occupation? ...................................................... Peter Kerr (coal miner)\n\n6. When did you come to Saskatchewan? (Give month and year) ........................................... Oct. 1889\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) ........................................... I was in Alberta\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: JAMES (K.E.R.R.)\n\n2. Your address: Box 156, T.N.D.I.A.M., H.E.A.B., SASK.\n\n3. Date: 3.0.4/1954\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year) Oct. 1889.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). I was in my teens.\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan? Indian Head\n\n16. Where did you settle or take up land? S.E./S.W. 10-17-13.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nParents on May 24/1882\n\nWilliam on Nov. 1882\n\nRobert born on the homestead.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nAs a small boy I was very afraid of the Indians who were quite numerous here at that time. I used to watch on a pony and herd cattle in my spare time and school our mode of transportation was horses buggy or team and wagon shopping centre 9 miles church 1 mile school 2 miles.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nParents on May 24/1882\n\nWilliam on Nov.\n\nRobert, born on the homestead.\n\n23. Is there any particular experience of pioneer days that stands out in your mind? Followed up by a question.\n\nAs a small boy I was very afraid of the Indians who were quite numerous here at that time. I used to watch on a pony and herd a cattle in my spare time and school. Our mode of transportation was horses buggy or team and wagon shopping centre 9 miles church 1 mile school 2 miles\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) After Macdonald\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the purchase of the automobile.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time were you with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nFlat away\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\nVery few from here.\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been a member of The Council\n\nR.M. 156 Indian Head from 1920-1940. The\n\nChairman of the Board of Education and\n\nas Chairman, and as Chairman of the School\n\nboard (Bunny Board) (161) since 1920.\n\nChairman since 1940-1954.\n\n37. If you or any of your family or friends were interested in having or doing something\n\nin the district mention it here, giving dates wherever possible, such as owning\n\nthe first automobile, combining organizing the first lodge, etc., etc.\n\nThe Junior School was organized\n\nin 1898 and the present school is still\n\ngoing.\n\n38. How did the places in your community get their names? (School districts, Post\n\noffices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(1) name\n\nand occupation of person suggesting place-name (2) origin and meaning of the\n\nname\n\n(3) date of its adoption (4) any changes in name since then\n\ndate and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nVery few from here\n\n35. Did many people move away during the 1920's? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\nI have been a member of the Council\n\nR.M. M. Indiana Head from 1920-1940. The Deep Lake Co. 1915-1934 as director and chairman, and as chairman of the School Board (Bunny Beach) since 1920.\n\nChairman since 1940-1954.\n\n37. If you or any of your family or friends were afraid to have or do something in the district mention it here, giving dates whenever possible. (Such as owning the first automobile, combining organizing the first lake, etc.)\n\nThe Sunny Beach School was organized in 1898, and the present school is still going.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and origin of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first known date and reason for change. Give facts of new name as above in (1), (2), (3),\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, old books, old newspapers, old pamphlets, old newspapers, old recollections, and reminiscences? (Describe).\n\nWe have an old school record of the time.\n\nThe old regulations also the financial statement by the Indian Head P.M., 1894.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n40. If you have children or grandchildren, please give their names, where they live.\n\nAlice Jane Brownman (Kun) who has lived in Qu'Appelle since my daughter in Maton & the family Union after Bible.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere has been great changes in farming. Prairies, mechanized farming, new combines used harvesting to some extent. The use of commercial fertilizers also the half summer fallow and now we have the prairie mowed in 1953.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nThe old regulations also file financial statements.\n\nBy the Indian Act R.M.S. 1894.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library Registry or the Archives Office at the University in Saskatoon?\n\nIndicate your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThere has been great changes in farming.\n\nPractically everything farming was by combines used for plowing, to some extent the use of commercial fertilizers, also the half summer fallow and now we have the power mated in 1953.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here.\n\n_________________________\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_491.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4584, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1910, 5], [1910, 3656, 6], [3656, 5116, 7], [5116, 6220, 8], [6220, 6883, 9], [6883, 7580, 10], [7580, 8606, 11], [8606, 9623, 12], [9623, 10391, 13], [10391, 11419, 14], [11419, 12709, 15], [12709, 13976, 16], [13976, 15472, 17], [15472, 16719, 18], [16719, 16866, 19], [16866, 17020, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]