[{"id": "77a23c5c8f48830f829578e75fb1ba7a06cc8432", "text": "PIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All Questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as anyone else. Some of the questions here will not apply to your experience; others may prove impossible for you to convey so don't worry about leaving blank spaces.\n\nDon't be afraid to give details or describe particular events if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nGatineau, Saskatchewan.\n\nJULY 27 1955\n1. Your full name: John J. Andres\n2. Your address: Box 333, Rosser, Sask.\n3. Date: July 4, 1955\n4. Where were you born? (Give name of place and country): South Dakota\n5. What was your father's name and occupation? John Andres, Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 24, 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: (Handwritten text not legible)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 18\n9. What were your reasons for coming West? (Handwritten text not legible)\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): (Handwritten text not legible)\n1. Your full name: John J. Andres\n2. Your address: 759x, 333 Northern, Sask.\n3. Date: July 4, 1955\n4. Where were you born? (Give name of place and country): South France\n5. What was your father's name and occupation?: John Andres\n6. When did you come to Saskatchewan? (Give month and year): April 24, 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - South Dakota, 1891-1892\n   - Montana, 1892-1893\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 18\n9. What were your reasons for coming West?\n   - To earn money and provide for family\n   - To find work and opportunity\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    - Through word of mouth from friends\n    - Reading newspapers\n    - Government publications\n    - Information from the CPR\n    - Information from friends who had visited the West\n    - Information from books\n    - Information from newspapers\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family), friends or other group?\n\n13. What means of transportation did you use?\n\n14. What accidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places that you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you...\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\noff which we moved in October, sending\nno a company and took up a position\nand finally\noff which recorded in London covering\nso a company and then to a collection\nand further\nfor any you see a trip postcard copy of Western Canada How I felt You\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please list them.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory that you would like to record?\n\n24. Did you/your family work in the early years? For what reasons, etc.?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was the first schoolhouse built in your district? (Specify)\n\n26. What was the first car used in your district? (Specify)\n\n27. What was the first radio used in your district? (Specify)\n25. When was the first car used in the community? (Answer by yr. & month)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Note: Foodstuffs, clothing, shoes, etc.)\n\n30. When (if ever) did people in your district first start going to town for\n\n31. What kind of articles did you first begin to buy through the mail order? (Indicate also what proportion of your total purchases were by mail order and why changes in the proportion of purchasers made by mail order occurred)\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sebastopol for the first time, was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\n34. How many years have you lived here?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing; better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time and why did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1917? What reasons\n\n35. Did many people move away during the 1930's? Did many return\n\n36. If you or some member of your family have held public office, or have been\nactive in any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"fitter\" to have or do some-\nthing in the district mention it here giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts,\npost offices, villages, railway stations, creeks, hills, etc.). Try to\ngive (1) name and composition of person suggesting name (2) origin\nand meaning of the name (3) date of its adoption (4) any changes in names\nsince the first name was given (5) date and reason for change. Give facts of\nnew name as above in (1), (2), (3).\n\nExplanation (detailed answers desired) - answers in essay\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were affiliated to have or do something in the district, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and meaning of the name (2) date of its adoption (3) any changes in name since the first name was given, date and reason for change. Give facts of origin (date, person, place, etc.)\n\ne.g.: Capital, Maryland, named after home\n\nWaltham - gomen, meaning forest home\n39. Questions regarding historical source materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, town, old newspapers, old photographs, written recollections and records?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly, Regina, or the Archives Office at the University of Saskatchewan (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nNellie (nee Ann Evans) ____________________________ ________________\n\nHenry ____________________________ ________________\n\nDave ____________________________ ________________\n\nMarilyn ____________________________ ________________\n\nHilda ____________________________ ________________\n\nEvelyn ____________________________ ________________\n\nOtto ____________________________ ________________\n\n41. What do you think are the most important changes in your community since you first came west?\n\n42. Give the names and addresses of other pioneers who could answer this ques-\n\ntions.\nQuestions regarding historical source materials:\n\n39. Do you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify or the Archives Office at the University in Edmonton)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\nNettie (7th child)\nHenry\nDave\nMark\nHilda\nOtto\nEsther\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nP.S. If someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892A-G_522.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4001, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1622, 7], [1622, 3185, 8], [3185, 4048, 9], [4048, 5189, 10], [5189, 5849, 11], [5849, 6513, 12], [6513, 6600, 13], [6600, 6758, 14], [6758, 7346, 15], [7346, 8219, 16], [8219, 9229, 17], [9229, 10076, 18], [10076, 10986, 19], [10986, 11889, 20], [11889, 13172, 21], [13172, 14190, 22], [14190, 14190, 23], [14190, 14344, 24]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]