[{"id": "1566ce0b882f834d58ebd5a9a1daeead21645a6f", "text": "WHAT DID WESTERN CANADIAN PIONEERS EAT?\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Miss M. Curry\nAddress: Brown, Sask.\nBirthplace: Basingstoke, Cambridge, England.\n\n1. HOUSEHOLD QUESTIONS\nWhat year did you start housekeeping in Eastern Canada? 1887\nWhere did you set up housekeeping? Brown district east Whitewood\nWhere had you been living before that? Dan. Lanes, Canada\nFor how many people did you prepare meals? 8\nHow far was it to your nearest store? 5 miles\nHow often could a visit be made to the store? Once a month or less\nWhat groceries did you usually buy in those earliest years?\nTea, sugar, dried apples, syrup, legs, soda\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? Strong Bakers\nIn what quantities did you buy it? 50 lbs. at a time\nWhat was the usual price per hundred pounds of white flour? $1.98\nHow much did you use graham flour? Whole wheat flour?\nWas flour milled locally? Yes\nHow far away? 5 miles what year? 1887\nWhat was the price for a twenty pound bag of rolled oats? 10¢\nWhat other grain products did you use? Cornmeal, whole wheat, flour\nDid you grind your own wheat for porridge? No\nHow did you grind it? Didn't grind it to my knowledge\nName: Anna M. Curry\nAddress: 123 Main Street, Cambridge, Ohio\n\n1. What year did you start homesteading in Nebraska? 1875\n   Where did you set up housekeeping? Nebraska\n   How many people did you have before that? 3\n   For how many years did you live there? 10\n   How far was it to your nearest store? 1 mile\n   How often would a visit be made to the store? Once a month\n   What provisions did you usually buy in those earliest years?\n   Coffee, sugar, dried apples, applesauce, eggs, soda\n\n2. Flour and other grain products\n   In what quantities did you buy flour? 100 lbs\n   How much did you pay per hundred pounds of white flour? $1.25\n   How much did you pay per hundred pounds of whole wheat flour? $1.25\n   How much did you pay for a twenty pound bag of rolled oats? $0.50\n   What other grain products did you use? Cornmeal, buckwheat flour\n   Did you grind your own flour? Yes\n   How much did you grind? 100 lbs\n\n3. Livestock\n   What animals did you keep? Cows, chickens\n   How many cows did you have? 2\n   How many chickens did you have? 100\n   Did you raise any vegetables? Yes\n   What vegetables did you grow? Corn, potatoes, beans\n\n4. Other\n   Did you have any pets? Yes\n   What pets did you have? Dog, cat\n   Did you have any hobbies? Yes\n   What hobbies did you have? Reading, gardening\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 20 pounds on average.\n\nWhat was the price for a ten pound sack of white sugar? About $1.50 per lb.\n\nWhat brand of golden corn syrup did you use? No particular brand.\n\nWhat size of tin of syrup did you usually buy? One gallon size.\n\nAt what price? Didn't remember.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Everyone had a cow or a number of cows, milked by hand.\n\nDid you make butter? Yes, made butter.\n\nWhat was the price of butter? 1 cent per lb.\n\nDid you pack eggs for winter? Yes, how? Guarded and stored packed in common salt.\n\nDid you make butter? Yes, cheese? But little more than late.\n\nWhat kind of cheese? Cheddar.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef and pork, wild ducks, prairie chickens and tame chickens.\n\nHow did you get fresh meat? It was always fresh when it was killed. Purchased from local stores.\n\nHow often did you get fresh meat? Once or twice a week.\n\nHow did you preserve meat? By salt and brine cure.\n\nWas there a \"beef ring\" in your neighborhood? Not till 1915.\n\nIf so what year was it organized?\n\nDid you use game? Yes, what kinds? Ducks and prairie chickens mostly.\n\nFor how long? When we could get them.\n\nWhat part did fish play in the family diet? Not much.\n\nWas the fish fresh, cured, or canned? Fresh and salted.\n\nKinds? When we could buy cod, catfish, salmon.\n3. SUGARS AND STARCHES\n\nIn what quantity did you buy white sugar? What brand was it?\n\nWhat was the price for a ten pound sack of white sugar? What brand was it?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you buy? At what price?\n\n4. DIY PROJECTS\n\nHow did you get a supply of fresh milk in the early days?\n\nDid you make butter?\n\nWhat was the price of butter?\n\nDid you keep eggs for hatching?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. EAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you eat canned meat?\n\nFor how long?\n\nWas there a \"fish fry\" in your town?\n\nIf so what year was it organized?\n\nDid you use game?\n\nWhat kind of fish did you catch?\n\nThat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKind of fish?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. At what price? $1.50.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? $3.00 per lb.\n\nWhat other beverages were used? None.\n\nAnd water.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $1.00.\n\nShould you get potatoes at the store? Yes.\n\nIf not, where from? The early settlers got their supply from Brandon.\n\nWhat year did you first grow your own supply for the winter of? The first year.\n\nPotatoes Cabbage Carrots Onions\n\nTurnips Beets\n\nIn what quantities did you buy white navy beans? Didn't have them at all.\n\nHow did you buy prunes, (in bulk or by the box)? Both ways.\n\nWhat weight? 10 lbs.\n\nHow did the grocer handle prunes (by box)? ...\n\nReplied: Prunes.\n\nWhat was the price of prunes? $1.50.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nApples, raisins, and currants.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\n\nPeas corn beans Saskatoons\n\nOther foods? Some perishable dairy products.\n\nThat year did you first preserve fruit by canning? 1920.\n\nWhat year did you first preserve vegetables by canning? 1920.\n\nWhat year did you first preserve meat by canning? 1925.\n\nDo you still preserve foods by canning or drying? Yes.\n\nMainly preserving by canning, not drying.\n\nTo what extent? Not to any great extent.\n\nDid you make your own vinegar? No, but some people did.\n6. Beverages:\n   - What kind of tea did you buy?\n   - At what price?\n   - What kind of coffee did you buy? (beans or ground)?\n   - Price?\n\n7. Vegetables and Dried Fruits:\n   - What was the price of potatoes per bushel when you last bought them?\n   - If so, where from?\n   - What year did you first grow your own supply for the winter?\n   - Potatoes\n   - Turnips\n   - Carrots\n   - Cabbages\n   - Beets\n   - Onions\n\n8. Preserving:\n   - In the early years, did you ever can any foods by yourself?\n   - Peas?\n   - Beans?\n   - Other foods?\n   - That year did you first purchase canned food?\n   - That year did you first purchase canned vegetables?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? In bulk, 10 lb., sack, can etc. | Ant. you usually bought at one time | Price |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|------------------------------------|-------|\n| Soda biscuits         | 1898                                          | 2 lb. box                                         |                                   | 25c   |\n| Macaroni              | 1905                                          | don't remember                                    |                                   |       |\n| Graham flour          | 1896                                          | 10 lb bag                                         |                                   |       |\n| Brown sugar           |                                               | always had brown sugar                            |                                   |       |\n| Molasses              |                                               | from earliest days                                |                                   |       |\n| Table salt            | 1910                                          | Small bag                                        |                                   |       |\n| Common salt           |                                               | always by the barrel or pound                     |                                   |       |\n| Lily white syrup      | 1910                                          | 1/2 pail                                          |                                   |       |\n| Toilet soap           | 1890                                          | by cake                                          |                                   |       |\n| Baking powder         | 1888                                          | 1/2 pail                                          |                                   |       |\n| Baking soda           |                                               | always                                            |                                   |       |\n| Dried peas            |                                               | don't remember                                    |                                   |       |\n| Dried corn            |                                               | time to my knowledge                              |                                   |       |\n| Vinegar               |                                               | always                                            |                                   |       |\n| Raisins - seeded      | 1885                                          | 1/2 pound                                         |                                   |       |\n|                       | 1890                                          |                                                  |                                   |       |\n| Rice                  | 1885                                          |                                                  |                                   |       |\n| Currants              | 1885                                          |                                                  |                                   |       |\n| Store jam - kinds?    | 1893-1894                                     | in wooden pails                                   |                                   |       |\n| Cheese (Cheddar or store cheese) | 1890 | by the pound                                    |                                   |       |\n| Vanilla               |                                               | don't remember                                    |                                   |       |\n\n10. BAKING\n\nWhat type of yeast did you use? Home made\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? Yes\n\nSalt rising? Some did\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n9. **Flour**\n\n| Item                  | Price |\n|-----------------------|-------|\n| Soda Biscuit          | $2.88 |\n| Macaroni              | $1.90 |\n| Graham Flour          | $1.89 |\n| Brown Sugar           | $1.89 |\n| Table Salt            | $1.90 |\n| Conserve Salt         | $1.90 |\n| Lily White Syrup      | $1.89 |\n| Toilet Soap           | $1.89 |\n| Cake Powder           | $1.89 |\n| Zealite Soap          | $1.89 |\n| Bread Mix             | $1.89 |\n| Whole Wheat Flour     | $1.89 |\n| Raisins               | $1.89 |\n| Oats                  | $1.89 |\n| Currants              | $1.89 |\n| Store Tan - Kindles   | $1.89 |\n| Cheese (Cheddar or Store Cheese) | $1.89 |\n| Vanilla               | $1.89 |\n\n10. **Baking**\n\n- What type of yeast did you use? Yeast\n- Did you make yeast for your own use? Yes\n- Using hops? No\n- Salt rising? Yes\n- Baking soda? Yes\n- Did you buy baking powder? Yes\n- Cream of tartar? Yes\n\nDid you take your own baking powder? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               | Before 1895                           | 10 cents per can             | It was very much better. They were good.       |\n| Canned sardines             | 1890                                  | 6 cents a tin                |                                                |\n| Other canned fish that appeared early - give names |                          |                              | Remember other brands appearing early.          |\n| Apples - fresh              | Before 1890 & 1895                     |                              |                                                |\n| dried                       | From earliest days                    |                              |                                                |\n| Lettuce                     | Not till very much later, perhaps 1920 |                              |                                                |\n| Tomatoes - fresh            | The same as lettuce                    |                              |                                                |\n| canned                      | 1895                                  | 10 cents a tin               | Just as good.                                  |\n| Bananas                     | 1895                                  | 25 cents a bag               |                                                |\n| Lemons                      | Before 1890                            |                              |                                                |\n| Oranges                     |                                         |                              |                                                |\n| Cornflakes                  |                                         |                              |                                                |\n| Other prepared breakfast cereals - give names |                          |                              |                                                |\n| Pearl tapioca               | More or less recent                    |                              |                                                |\n| Minuto tapioca              | We had tapioca quite early            |                              |                                                |\n| Sago                        | Sago was an early product             |                              |                                                |\n| Dates                       | Almost 1900 10 cents per pound        | They were in bulk            |                                                |\n| Walnuts                     | 1900                                  | 50 cents                     |                                                |\n| Icing sugar                 | Perhaps 1895 10 cents around           |                              |                                                |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...From well..............................................................\n\nHow far was this water from your home? ...Quartermile south...........\n\nHow was it brought to the house? (pail, barrel, tank) ...Barrel............\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWells are a mile closer to the house and the water is pumped now instead of being drawn up by cup and pail.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nIf on your farm this water from your house? (pail, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nBuilds are built all around & do have a good supply of living streams & the upland past.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bath.\n\nIf you made your own, did you use lye? .......... good ashes?\n\nWhat kinds of laundry soap did the grocer handle? Royal Brand.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the church near by.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nNow people still use wood, some times pine coal is used. There are also buckets. Some oil lamps, and a number of gas lamps are used now.\n\nThese latter two are recent in the past four years. We always had the wood coal.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) 1852.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? A. Borden Co., St. Louis.\n\nWhat year was it purchased? 1852. Price? Don't know.\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron pans and tin utensils. They were not homemade.\n\nFor preparing food? (china, earthenware, wooden bowls, other) earthenware.\n\nWhen did you first see enamel ware? Sometime around 1860.\n\nAluminum? About 1875. Not sure.\n13. STAPLES\n\nDid you buy laundry soap or make your own? If so, what did you use?\n\n14. FUEL\n\nWhat fuel did you use in the early days? Where did you get your fuel?\n\n15. UTENSILS\n\nFor cooking, did you use an outdoor fireplace or bake oven? What types of utensils did you use? For preparing food? When did you first see a lumberjack?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nEverything was put in paper bags by the storekeeper. Later on cardboard boxes. A number of things were always in tins when they came, so I don't know what the people who delivered them have packed. Any that are left were just buried in 1857 when this district was first settled.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Tea or coffee\nPorridge - fried potatoes\nfried eggs and cured pork/food\nbread & butter\n\nDinner: Tea\nBoiled potato, bread, pork/buffalo\nBoiled cabbage, bread, pudding\nbread & butter occasionally\n\nSupper: Tea\nfried potatoes, green peas, radish, carrots\nBiscuits, homemade\nfried applesauce or pie\n\n18. What year did you serve your first Christmas dinner in western Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\nCan't answer this.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nTo\n16. **FRAPPEURS AND CONCILIERS**\n\n   Mention any changes which you recall in the organization or policies received with the food you purchased. (Give dates, names, etc.)\n\n   *Excluded early, gained popularity.*\n\n   *Always met when needed, and if the people came in the daytime, they would be there.*\n\n   *Began in 1952 when this idea was used.*\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the enlisted year you can remember. Give the year and list the numbers of the really tall chairs ages at the time. State the approximate month, etc., winter or summer.\n\n   *Breakfast: Coffee, bread, eggs, milk*\n\n   *Lunch: Sandwiches, salad, fruit, juice*\n\n   *Dinner: Meat, vegetables, potatoes, dessert*\n\n18. That year did you serve your first Christmas dinner in [Eastern Canada]? Approached by area at that time?\n\n   *(Signed)*\n\n19. Were you ever reduced to almost starvation level? If so, give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere are so many differences. I could not go into detail here.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nI still depend on home grown foods to a very great extent, as I live on a farm.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThis questionnaire should have been in many years ago.\n\nWhen people grew potatoes they always made sure to harvest. Newcomers got their seed from the earlier settlers. Many times people were short of things due to starving diet but just short of some things. We could always grow good gardens here and did. Rhubarb was very good, even in the making up as pie and as fruit.\n\nPeople always made a place called a root house, in the ground for potatoes, turnips, carrots, parsnips and cabbage for winter storage. There was also separate from the cellar under the house.\n20. Mention any outstanding differences in the preparation of beans in the earliest days and compare with today.\n\nThere are a great many differences. \n\n- Beans were not grown in detail here.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home preserved foods? (Give as many details and dates as possible).\n\nI started depending on store grown foods to a\n\nvery great extent, as & also on a farm.\n\n22. Please add other details from your early experiences of buying groceries and scouting foods in other parts of the state or even in eastern Canada.\n\nInclude items not mentioned above, quality, methods of purchasing, etc.\n\nUse both of\n\nreceipts of stores from if card.\n\nThis questionnaire should have been\n\nin my own words and\n\nwhile people grew potatoes they always made\n\nsure to harvest them early and from the\n\nearliest date. People knew exactly what\n\nto do to ensure a good crop.\n\nPeople always made a place called a\n\nPoveshell, in the ground for storage\n\nbeans, beans and cabbage for storage.\n\nThere was also a great many potatoes stored there.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThere are a great many differences. I could not go into detail here.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI still depend on home grown foods to a very great extent, as I live on a farm.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nThis questionnaire should have been in many years ago.\n\nWhen people grew potatoes they always made sure to harvest them. We came up with seed from the earlier settlers. Many times people were short of things due to starving diet but just about every thing we could always grow good gardens here and did. Wheat was very good there in the making. We used to make root beer, in the ground for potato storage, carrots, parsnips, and cabbage for winter storage. There was also applesauce from the cellar under the house.\n21. When did you begin to rely on purchased foods and preserved foods instead of home grown and home preserved foods? (Give us many details and dates)\n\n22. Please add other details from your life and family memories.\n\nThis questionnaire should have been completed in many years ago.\n\nThe answers made me realize how much I knew about my grandparents' lives and what they went through during their time.\n\nThey always made a place called a garden for their own use and enjoyment.\n\nThere was also a great emphasis on family and community.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1888_40.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5973, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1357, 3], [1357, 2656, 4], [2656, 4082, 5], [4082, 4919, 6], [4919, 6445, 7], [6445, 7199, 8], [7199, 11404, 9], [11404, 12362, 10], [12362, 16217, 11], [16217, 16665, 12], [16665, 17941, 13], [17941, 18271, 14], [18271, 19568, 15], [19568, 20486, 16], [20486, 21796, 17], [21796, 22891, 18], [22891, 24156, 19], [24156, 24692, 20], [24692, 24692, 21], [24692, 24692, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]