[{"id": "313c367aa95397048b8424ec71e56f9af2e5e5a9", "text": "Please print name and address in capital letters.\n\nYour full name: FRED BAINES\nPresent address: 814 STOCKWELL AVENUE, NELOWNA, BC.\nPioneer address: CRESCENT LAKE\nYear you came to Saskatchewan: 1883\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1921, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About ten.\n\nHow many of these were bachelor's homes? Practically none.\n\n2. How often did you usually visit neighbors? Several times during the year.\n\n3. Did you usually visit on a Sunday, or other days? Usually on Sundays to religious services, meeting many friends thereat.\n\n4. Were you often invited to other homes? Or was most visiting done without an invitation? Welcomed at all times.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Owing to distance, often most of the day.\n\nWhat about meals? Did you stay when not invited beforehand? Meals always served - distance made it necessary.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Yes - stay to dinner. Eat as we eat.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? We always stayed for meals - always made welcome.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Generally the whole family.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Bees often held for the building - never heard of fulfilling debts in those days - no materials! Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. We all enjoyed a general get-together, usually winding up with a party and dancing fiddle, mouth organ, & banjo.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Not many - transportation too tedious, mostly oxen.\n\nWere these more frequent in later years? Give dates. Yes, as transportation speeded up - ponies - later cars.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No - only casually.\nPIONEER BARRACKS AND SOCIAL LIFE.\n\n1. In the first few years, how many houses were near enough to you for visiting back and forth about ten times?\n\n2. How often did you usually visit neighbors? Occasionally or rarely?\n\n3. Did you usually visit on Sundays or other days? Generally or occasionally?\n\n4. Were you often invited to other homes? Yes - always served - distance made it necessary.\n\n5. What time of the day did you go? - in the morning and evening, the day, or in the afternoon, etc.? What about meals? Did you stay when not invited beforehand?\n\n6. How was the invitation to a meal worded when people had some unexpected company? (That is, was the term used to \"make polite\" used, or was some other expression common?)\n\n7. If no meal, what other refreshment might be offered to visitors who had dropped in unexpectedly?\n\n8. Did you ever have \"dinner parties\"? Did anyone ever come together to put up a building, make quilts, or other such projects?\n\n9. Did you ever have \"family reunions\"? Did anyone ever gather at lakes if possible, tall-\n\n10. We all enjoyed a general get-together, usually winding up with a party and dancing.\n\n11. Not many - transportation too tedious mostly over.\n\n12. Have there been frequent in later years? Give dates.\n\n13. Did you follow any kind of informal schedule, such as going by turn, once a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire.) Give dates.\n\nPicnics usually held at Lake side. Christmas trees, concerts, box socials and dances invariably held at school houses.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nThe greater part of it, political meetings, etc.\n\n9. When was your first community hall built? When, the first school house was built. What material was it made of? Lumber. How large was it? 18 x 24 ft.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Wm Eakin. By deputations.\n\nWas it built in the village or town, or was it a country hall?\n\nSchool built in center of school district.\n\nTo what extent did you take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nGatherings held both in school and town, as cars came in general use.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nNot always.\n\nHow were babies and small children provided for?\n\nIn corners by elderly ladies.\n\nHow were houses sheltered and fed in the winter time at these parties?\n\nAt sheds provided.\n\n11. What card games were popular in the early days?\n\nPoker, Euchre and several other types of card games.\n\nWas there card playing for a prize? They used to gamble frequently.\n\nWhat dances were popular? Waltzes, Square dances, Folks, Shottisches, Highland Fling, Red River jig, Step dancing.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Yes, revival meetings preached against dancing.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Card playing and dancing were frequently tabooed.\n2. Tell what use was made of the school house for community dances, box socials, etc., and other entertainments held at the school. Christmas tree, plantation, etc.\n\nPianos usually held at school parties. Christmas parties, box socials and dances invariably held at school houses.\n\nThe greater part of it. Political meetings, etc.\n\n9. How was your school community hall built? When, by whom, by what method?\n\nWas built in the village of town. It was a community hall. It was built by the town. It was built by the school board. It was built by the community through special funds. The municipality, some organization, etc.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in questions 9, 9, and 10) did the entire family attend?\n\nYes, always. No, only children attended. Sometimes, yes; sometimes, no.\n\n11. What card games were popular in the early days?\n\nPoker, Euchre, and several other types of card games. What dances were popular? Waltzes, square dances, jigs, schottisches, highland spring, quadrille, etc.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Card playing and dancing were frequently refused.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nVery little ceremony attended early gatherings.\n\n13. Was the chivaree known in your community? Yes, occasionally.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThey often got out of hand and damage was caused.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nHorse-throwing was popular. Bronco Busting and athletic jumping contests.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Farmers' Union, later the Grain Growers, later the Co-operative Association.\n\nGive the date and reason for its being organized.\n\nFrom 1902 to 1912 or 1914. To break monopoly and oppression by the grain magnates who gouged the (agriculturalists)\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nThe above answers this query.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nPractically all of them.\n\nHow many women belonged? Various. How often did it meet? Whenever necessary.\n\nWhat were some of the activities carried on by this organization?\n\nSocial gatherings, questionnaires, explanations, subscriptions for delegates to conventions, etc.\n\n17. Was there a Homemakers' Club in your district? No\n\nWhen was it organized? X\n\nApproximately how many women belonged to it? X\n\nDescribe what you remember of its activities and services. X\n12. What attempts at formality or \"nawaka\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting cards used ceremonially in parlor, etc.? \n\nVery little ceremony attended early gatherings.\n\n13. Was the shivaree known in your community? Yes, occasionally.\n\nDescribe what you remember about shivarees, telling how common they were, any incidents connected with them, etc.\n\nThey often got out of hand and damaged property.\n\n14. Describe any other details of visiting, parties, etc., that you remember.\n\nIn visiting or social life, boomerang was used. You could throw it and then catch it.\n\nBoomerang was popular. Brooches, buttons, and necklaces were popular.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nThe Homemakers' Club was organized in 1916 by Mrs. Smith.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community?\n\nYes, there was a Saskatchewan Grain Growers' Club in your community.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHere was a strong organization.\n\nSocial gatherings, fund-raising, educational meetings, etc.\n\n17. Was there a Homemakers' Club in your district?\n\nYes, there was a Homemakers' Club in your district.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n22. What winter games were played outside - fox and hounds, skating, etc.? \nIn our district of Crescent Lake, owing to its scattered population and difficult means of transportation very little \nsport was played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Cards, Authors, \ncheckers, dominoes, music and dancing.\n\nDid the whole family join in such games, or only the children? Explain.\nYes - Everyone.\n\n23. Was there much time for games, or was everyone usually busy with some kind \nof work? Explain.\nThe problem of keeping the homes supplied with fuel consumed a great deal of their spare time. \nWood was rarely used.\n\n24. Did children invent games connected with such things as buffalo bones, arrow \nheads, gophers or other objects or animals, or games in the snow? Describe.\nFrank Baines was the local collector of natural curiosities and his collection of such was and is \nof considerable interest. The only one worthwhile record, N.S. Some extensive egg collections received \nspecial mention from the zoological societies.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\nGive year and month if possible. Swanport, 1884, at present \nLake.\n\n26. Who organized it?\nMr. W.M. Earle (later Speaker of Legislative Assembly) of Sask.\n\n27. Was it for the entire community, or for a smaller group, such as a school \ndistrict, Sunday school, some organization, etc.?\nJust settlers - no schools active.\n\n28. Was it the first picnic held in the community? Yes.\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, \netc.)?\nJust a get-together - lunch etc., and water \npolice.\n\n30. What arrangements were made for eating - was there a general lunch, or did \nfamilies and friends form smaller groups?\nAll together (a free for all).\n\n31. What did you have to eat and drink?\nRoast wild fowl, Saskatoon, gooseberries wild \ncherries / black currants. Tea, only - no coffee in \nthose days, no spirituous liquids.\n\n32. What time of the day did it start, and how long did it last?\nAll afternoon until the mosquitoes took charge.\nII. Describe any features of this picnic which you consider outstanding.\n\nThe atmosphere of good will, the hope for the future, plans discussed for church and social services.\n\nIII. Describe any different kinds of picnics which you know of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell also any differences in matters attending, activities, games, etc., held, etc.\n\nSome subsequent picnics included in athletic sports, horse racing, winding up with the inevitable dance, some liquor appearing.\n\nIV. What changes have you noticed in picnics since the first picnic? If possible, give dates when changes became noticeable.\n\nFrom the nineties on, picnics became events of large attendance. Baseball, horse racing, midways and merry-go-rounds, featured extensively.\n\nV. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nAnswered above.\n\nVI. For what game was the first team organized in your community to play against neighboring teams?\n\nBaseball.\n\nWhat year? From the records, how long did it continue? Until the present day.\n\nVII. Were any other sports teams that were organized before 1912, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger meetings, etc.\n\nYes, hockey creates universal competition, curling gets equal recognition.\n\nVIII. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n\nAround 1902 for hockey and skating.\n\nWhen was the first indoor rink built, and what was it used for?\n\nAnswered above.\n40. When did an annual \"sports day\" become established in your community? 1889\n\nDid it grow out of or replace the earlier community picnic? To a certain extent it did.\n\nWho was responsible for starting the first sports day? The leading citizens; many new dead and gone.\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names and dates.\n\nNo very outstanding individuals, some local celebrities.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nA few English schoolbooks until Elementary text books became obligatory.\n\n43. How many of your neighbors brought books with them? Not many.\n\nWhat kind of books and how many? Largely Bibles, hymn books, a few historical classics.\n\n44. To what extent did you exchange books with neighbors? Considerably.\n\n45. Did you buy many books after you came west? Give details.\n\nNo, not many—cash very scarce.\n\n46. What books were sent to you as gifts in early years? Subscriptions to periodicals and weekly newspapers.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nYes, several attempts, dating from 1888.\n\n48. Was there a school library? No.\n\nWhen was it begun? No.\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\nVery little, if any.\n\n49. Did parents ever use their children's school texts as additional reading material?\n\nYes, surely.\n40. When did an annual \"report day\" become established in your community? In 1899.\n\n41. How many newspapers did you have? The leading newspaper was the \"Daily News.\"\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors.)\n\n43. How many of your neighbors brought books with them? Not many.\n\n44. Did you buy any books after you came west? Give details.\n\n45. Have you ever had any \"traveling library\" books in your community or school? Yes, several attempts dating from 1886.\n\n46. Was there a school library? Yes.\n\n47. Did parents ever use their children's school text books as additional reading material? Yes, very little, if any.\n50. Has there ever been a community library in your district or town? **NO**\n   When was it started? **NO**\n   Who started it? **NO**\n   Is it still in existence? **NO**\n   If not, when was it discontinued, and why? *(an insignificant school library existed)*\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n*The United church had a small collection, members helped them selves.*\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n*The Family Herald and Weekly Star.*\n*Weekly Free Press and Tribune, later Yorkton Enterprise, Saltcoats Siftings.*\n*Church Papers - Home and School, Outlook, and one or two others.*\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n*The daily papers gradually superseded the weeklies, as people became more prosperous.*\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? **not to my knowledge**\n\nGive dates and tell how and where you got them. X\n\n54. What books or papers that you brought to the west with you do you still have?\n\n*none*\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n*a great hardship and deprivation.*\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? 1893\n\nWas it still in existence? Yes\n\nIf not, when was it discontinued, and why? (Can't remember)\n\nThe United Church had a small collection, members helped them select.\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald and Weekly Star.\n\nWeekly Press Review and Western Watch.\n\nVoracious Enterprise—Home and School, Continued.\n\nChurch Papers—Home and School, Continued.\n\nAnd one or two others.\n\n52. Describe later changes in your subscriptions, telling why you subscribed to newspapers and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Not to my recollection.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nNone.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nA great hardship and deprivation.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\nOur own vocal musical accomplishments (ie singing)\n\n57. What instruments did any of your neighbors have? We used violins,\nguitars, banjos, concertinas and harmonicas.\n\n58. What musical instruments have you bought since you came to the west? Give\ndates, prices if possible, and tell where you bought them.\nBanjo - $2.00\n1900 Banjo - $2.00 Piano - 1921 - $40.00\n1903 Organ - $18.00\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the West? Describe.\nThe principal most entertaining part.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\nYes - musical concerts, individual and community singing of great interests.\n\n60. What were some of the favorite songs in the home? The old Ontario Songs - negro melodies, sacred songs and Western songs. Cowboy Laments - House on the Range.\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\nnot in particular.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\nYes - some local composers did so, with telling effect.\n\n63. Was there a band in your community? Yes. When was it started? 1889.\nWho started it? New name dead and gone, names forgotten.\nHow long did it continue? A member of years.\nHow many were in it? About 15 Who was bandmaster? In later years S. Bruner.\nWhat instruments were included? A full set of band instruments purchased by the town of Salt Lake.\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nPractice held twice weekly, usually in town hall. Uniforms - played at all leading events, holidays and political gatherings.\nMusical Entertainment.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have? (list)\n\n58. What musical instruments have you bought since you came to the West? (list)\n\n59. How large a part did singing and other forms of music play in your recreation and entertainment in early years in the West? Describe.\n\nMusical Concerts, Individual and Community Singing of Great Interest.\n\n60. What were some of the favorite songs in the home? The old Ontario songs—negro melodies, sacred songs, and cowboy songs.\n\nIn the community:\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Make there a band in your community? If so, who started it? How many members? How long did it continue? What was its name? Who was conductor? How many were in it? What instruments were included? What uniforms were worn? What activities, how often practiced? What events the band played for.\n\nPractice held three times weekly, usually at town hall, uniformed at all occasions, event, holiday and political gathering.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nYes. Frank Baines of Saltcoats has become a musician of high standing and favorably known as an artist of exceptional ability.\n\nIs music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nSaltcoats, Sask., has also become notable as a center of vocal and composition studies—K.L. Baines, head of Saltcoats' music school, has won distinction by winning the first prize in the international competition for the composition of a new folk song.\n\nFrank Baines of Saltcoats has a very valuable collection of Indian artifacts, including arrowheads, paintings, etc.\n\nDescribe other hobbies or special interests of yours not already mentioned.\n\nHaving been a collector since the early nineteen-hundreds, exhibit is of exceptional interest.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nFrank Baines of Saltcoats has considerable data regarding events of past years and kept governmental records of weather conditions for many years, which supplied much information of interest.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nFrank Baines of Saltcoats as local naturalist.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nNothing out of ordinary.\n64. Has anyone from your community become well known or famous in the natural world? Give names and dates of places or events associated with such individuals.\n\n65. What is the reason for this change? How do you feel about this change?\n\n66. Give details of this collection, telling when you started and what you've accomplished so far.\n\n67. Describe other hobbies or special interests of yours not already mentioned.\n\n68. Frank Baines of Saltworth is a local naturalist.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, meetings, music, etc., not already mentioned.\n\n(Use back of page, if extra space is necessary.)\n\nNothing out of ordinary!\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nYes—Fraser Horley of Saltcoats has become a musician of note, and is well and favorably known as an artist of exceptional merit.\n\nIs music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nWith headquarters in Boston, Mass., John Arthur Baines of Saltcoats, Sask., has also become notable as a director of vocal accomplishments. K.L. Baines, late of Saltcoats, now of Tisdale, has won distinction by winning the First Prize for two years in succession at the British Empire Award for the production of songs.\n\nHobbies and Special Interests\n\nDo you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes, Frank Baines of Saltcoats has a very creditable collection of Indian curios, arrowheads and fur and bone.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHaving been a collector since the early nineteen-hundreds, his exhibit is of exceptional interest.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nFrank Baines of Saltcoats also has considerable data as regards events of past years and kept governmental records of weather conditions for many years, which supplied much information of general interest.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nYes—Frank Baines of Saltcoats has become a musician of note and is well and favorably known as an artist of exceptional merit.\n\nIs music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nWith headquarters in Boston, Mass.—John Arthur Baines of Saltcoats, Sask., has also become notable as a director of vocal accomplishments—K.L. Baines, late of Saltcoats, now of Idaho, has won distinction by winning the First Prize for two years in succession at the British Empire Exhibition for the production of songs.\n\nHobbies and Special Interests\n\n65. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes—Frank Baines of Saltcoats has a very creditable collection of Indian curios, arrowheads and stones.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHaving been a collector since the early nineteen-hundreds, exhibit is of exceptional interest.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nFrank Baines of Saltcoats also has considerable data as regards events of past years and kept governmental records of weather conditions, which has supplied much information of interest.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nYes—Frank Bailey of Saltcoats has become a musician of note, and is well and favorably known as an artist of exceptional merit.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nWith headquarters in Boston, Mass., John Arthur Baines of Saltcoats, Sask., has also become notable as a director of vocal accomplishments. K.S. Baines, late of Saltcoats, now of Idaho, has won distinction by winning the first prize for two years in succession of the British Empire award for the production of honey.\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes, Frank Bailey of Saltcoats has a very considerable collection of Indian curiosities, arrowheads, and other items.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHaving been a collector since the early nineteen hundreds, exhibit of exceptional interest.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nFrank Bailey of Saltcoats also has considerable data regarding events of past years and kept governmental records of weather conditions for many years—has supplied much information of interest.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nYes—Frank Baines of Saltcoats has become a musician of note, and is well and favorably known as an artist of exceptional merit.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nWith headquarters in Boston, Mass., John Arthur Baines of Saltcoats, Sask., has also become notable as a director of vocal accomplishments. K.S. Baines, late of Saltcoats, now of Pictou, has won distinction by winning the first prize for two years in succession at the British Empire Exhibition for the production of songs.\n\nHobbies and Special Interests:\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Frank Baines of Saltcoats has a very considerable collection of Indian curios, arrowheads, and personal items.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nHaving been a collector since the early nineteen-hundreds, exhibit is of exceptional interest.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nFrank Baines of Saltcoats also has considerable data regarding events of past years and kept governmental records of weather conditions for many years, has supplied much information of general interest.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\nTo those it may concern,\n\nFred Baines, late of Saltcoats, Sask., now of the above address,\nkindly forward the latest statistical statement forwarded from\nSaltcoats to me at Kelowna, B.C. These records have caused much\nsearching of reminiscences, and are such as I can reasonably\nprovide, and I apologize accordingly.\n\nI am now permanently located in B.C., having lived in\nSaskatchewan since the year 1863. August of that year,\nas an immigrant from Manchester, England. I have lived\nnearly 70 years in Canadian West, 64 of them in the province\nof Assiniboia, later Saskatchewan, and have noted the many\nprogressions to the present civilizations.\n\nMy memory of earlier years is still fresh on my mind,\nand I can see the future of the Canadian West looming\nup as a brilliant future of great things to come.\n\nIf more is required of me, address all communications to\nthe above address, and I have left Saltcoats for good.\n\nYours truly — Fred S. Baines\n814 Stockwell Avenue\nKelowna, B.C.\nTo those of my Concern,\n\nFred Baines, late of Saltcoats, Sask., now of the above address,\n\nreally forward the latest statistical statement forwarded from Saltcoats & Co. at Kelowna, B.C. These records have caused much searching of reminiscence, and not such as I can reasonably\n\nbelieve, and I apologize accordingly. In B.C., having lived in\n\nSaskatchewan since the year 1868, August of that year.\n\nAs an immigrant from Manchester, England, I have lived\n\nreally 70 years in Canadian West by far oftentimes in the province\n\nof Assiniboia, later Saskatchewan, and have noted the many\n\nprogressions & the present civilizations.\n\nMy memory of earlier years is still fresh on my mind,\n\nand I can see the future of the Canadian West looming\n\nup as a brilliant future of great things to come.\n\nIf more is required of me, add me all communications.\n\nThe above address, as I have left Saltcoats for good.\n\nYours Truly — Fred A. Baines\n\n614 Stockwell Avenue\nKelowna, B.C.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883A-L_1893.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 8689, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1130, 5], [1130, 1130, 6], [1130, 3279, 7], [3279, 4625, 8], [4625, 6977, 9], [6977, 8263, 10], [8263, 10179, 11], [10179, 11670, 12], [11670, 13864, 13], [13864, 13864, 14], [13864, 15656, 15], [15656, 15656, 16], [15656, 17374, 17], [17374, 18047, 18], [18047, 19476, 19], [19476, 20697, 20], [20697, 22653, 21], [22653, 23930, 22], [23930, 25678, 23], [25678, 26509, 24], [26509, 28058, 25], [28058, 29580, 26], [29580, 31204, 27], [31204, 32839, 28], [32839, 33821, 29], [33821, 34782, 30]], "primary_language": ["None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]