[{"id": "6040dbc3115c2a21a4b6490068923343768ee983", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF APPRECIATION TO THE PERSON RESPONDING TO THIS QUESTIONNAIRE\n\nIt is difficult to compress a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. Do not worry about leaving blank spaces. The purpose of these questions is not to collect information, but to assure that questions are included to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1905, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: West 1870-1920\" Western Canadian Pioneers' Battalion is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nA later date. One of these are listed below. Please mark the ones you will be willing to answer:\n\nAll questionnaires\n\nPioneer health conditions\n\nPioneer social life, sports and recreation\n\nPioneer housing\n\nPioneer education and churchwork\n\nPioneer farming experience\n\nInstructions of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of its permanent record of the Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\n\nUniversity of Saskatchewan,\n\nSaskatoon, Sask.\n1. Your full name: Thomas William Burns\n2. Your address: 206 Seventh St., Nanaimo, B.C.\n3. Date: January 24, 1952\n4. Where were you born? (Give name of place and country)\n   - Married in Canada, Prince Edward Island\n5. What was your father's name and occupation?\n   - Thomas Burns, Refrigerator repairman, wagon etc.\n6. When did you come to Saskatchewan? (Give month and year)\n   - March 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - Was in my teens, etc.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   - I was in my teens, etc.\n9. What were your reasons for coming West?\n   - To make a living, get a better education, and I decided to earn a little about farming and went and got a homestead.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - From all these answers at that time men (especially young men) were flocking to western Canada Prairie from all parts of our young people for summer work. In the fall, they moved for winter work $20 and $10 per month.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Thomas William Burns\n2. Your address: 306, Seventh St., Namao, B.C.\n3. Date: January 24, 1952\n4. Where were you born? (Give name of place and country)\n   - Married in Alberta, Canada\n5. What was your father's name and occupation?\n   - Thomas Burns, Refrigerating tugboat, wagon etc.\n6. When did you come to Saskatchewan? (Give month and year)\n   - March, 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n   - Was in my teens, 1875 and some\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   - I was in my teens, 1875 and some\n9. What were your reasons for coming here?\n   - To make a living, get a home, and earn a little money for myself and family\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - From all these sources, at that time\n11. How many years did you live in Saskatchewan?\n    - Ten years\n2. What did your friends and relatives think of your decision to come to Western Canada?\n\nI was the first in my family to come to Western Canada. My parents came five years earlier, so it would have been easier for them.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith two others.\n\n13. What means of transportation did you use?\n\nC.P.R.\n\n24. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitements etc.)\n\nI remember meeting relatives at Athabasca, but I don't recall their names. We also met a man named Mr. Smith who was very kind to us.\n\n14. How long did it take you to reach your destination?\n\nIt took us about six weeks to reach our destination.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at a small tent and then moved into a house near the town.\n\n16. Where did you settle or take up land?\n\nWe settled in the town of Weyburn.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nFrom 1900 to 1922 we lived in Brandon, Manitoba. From 1922 to 1932 we lived in Prince Albert, Saskatchewan. From 1932 to 1947 we lived in Weyburn, Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFrom age 14 to 16 I worked as a farmhand in Brandon, Manitoba. From 1922 to 1932 I worked in Prince Albert, Saskatchewan. After arriving in Western Canada, I worked as a laborer in Weyburn, Saskatchewan.\n21. What did your friends and relatives think of your decision to come to Western Canada?\n\nA was the first to come to Western Canada. My parents came five years later, and my children and I would follow.\n\n22. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith two others.\n\n23. What means of transportation did you use?\n\nC.P.R.\n\n24. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nRemembering my trip to Alberta, I had never been there before. We went on to Regina, then to Prince Albert, and finally to Edmonton. We traveled in a covered wagon and there always three of us. We got there after about 14 miles from Regina (Saskatchewan) to Edmonton. We traveled in a covered wagon and there were three of us. We got there after about 14 miles from Regina (Saskatchewan) to Edmonton.\n\n25. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at a small town called Edmonton. We stayed there for about two weeks.\n\n26. Where did you settle or take up land?\n\n8.04 acres. T8.R8.West 2nd (I used to own it)\n\n27. Mention any other places where you have lived since coming to Saskatchewan.\n\nFrom 1900 to 1922 I lived in Edmonton. From 1922 to 1932 I lived in Prince Albert. From 1932 to 1947 I lived in Prince Albert. During the two years away I lived in Grande Prairie. Calgary. 8.0 acres.\n\n28. How long did you live before coming to Western Canada? How long have you lived in Canada?\n\nI came age 14 to 20 and lived in Canada for many years. At that time the Y.E.A. was very strong about itself. A church and where I worked was in the same field. After coming I went working on farms at fifteen years old.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nIn 1900 I had a good time in the early years. For business and attending church, we had to travel 15-20 miles. In 1906 I built a good house for my family. We lived in it for six years. In 1907 we moved to Regina and bought a farm. In 1908 we sold our farm and moved to Regina again. In 1909 we moved back to Regina. In 1910 we moved back to Regina again. In 1911 we moved back to Regina once more. In 1912 we moved back to Regina for the last time.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your pioneering? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell where they came from and when they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n24. When was the first car used in the community?\n\n25. If you owned a car before 1911, when did you buy it? What makes\n\n26. Where was your trading center? How far from your home?\n\n27. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n28. How often did you shop in the early days?\n\n29. What kind of articles did you buy in your district first start going to town regularly\n\non Saturdays? (Indicate what kind of stores)\n\n30. When (if ever) did people in your district first start buying through the mail order catalogs?\n\n31. What kind of articles did you buy in this way? Indicate also what kind of stores\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first have a radio and what company provided it?\n\n34. When did you first have a television and what company provided it?\n\n35. When did you first have a car and what company provided it?\n\n36. When did you first have a house and what company provided it?\n\n37. When did you first have a permanent home?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Were there any trading centers here five years ago? (Include any changes due to new town appear-\n\ning, better means of travel, etc.)\n\n28. Did you continue to trade there? (Include any changes due to new town appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays? (If ever)\n\n31. What kind of articles did you buy in this way? Indicate what they were in the\n\npurchase made by mail order since the volume expanded.\n\n32. When did you first have a telephone and what company installed it?\n\n33. When did you make up your mind after trying it out? What did you\n\nmake this decision?\n\n34. When did you first have a television set and what company installed it?\n\n35. When did you make up your mind after trying it out? What did you\n\nmake this decision?\n\n36. When did you first have a permanent home?\nThe first day we met was very fine. After breakfast, prior to 10 A.M., they arranged for us to\n\nquite a few people to meet with the idea\n\nof having an open day at the hospital.\n\nBy 10 A.M., the trip to another hospital\n\nwas made by car.\n\nYou drive with guides - not off the district in\n\nthe 1930s.\n\nIf you or any member of your family have held public offices, or have been\n\nactive in any organizations, mention it here, giving dates wherever possible.\n\nIn the district, mention its name, giving dates whenever possible.\n\nFor example: Secretary, Board of Education, (name of town), (year).\n\nIf you or any member of your family or friends were victims to have or do something\n\nin the district, mention its name, giving dates whenever possible.\n\nFor example: Victim of crime, (name of town), (year).\n\nI'm called Watson, Robert. After the name I'm called\n\nTavern (a. o. w. l. e. n.) who financed the end of the hill\n\nbefore the war. The Post Office closed (name of town), (year)\n\nif the name mentioned here\n\nbefore the name mentioned here\n\nfrom a CPR official\n\nfor the name mentioned here\n\nof that name.\nI am writing a letter to my friend in Canada.\n\nI am planning to visit them soon.\n\nThey lives in Toronto and have a large garden there.\n\nIt is very nice to be there and enjoy the fresh air.\n\nI will bring some photos of the garden when I go back.\n\nI hope they will be able to see those photos and be interested in visiting again.\n\nI'm really looking forward to seeing them again!\n\nTake care and send my regards to everyone.\n\nBest regards,\n\n[Your Name]\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________________________________________\n6. Questions regarding historical source materials:\n\nDo you have any documents or do you know the whereabouts of diaries, old letters, old papers and photographs, minute books of community organizations, old pamphlets, old photographs, written records, old newspapers? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preferences, if any) ……………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst, the telephone, electricity, power, and the city itself.\n\nSecond, it is a good town with lots of good farms, and a mainline railway for a large division.\n\nWe have electric lighting and accommodation. The town claims and the Regina to York and also daily service to Regina in morning and back night.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nI have filled in your form to the best of my recollection and turned it into the hands of Mr. Smith. One experience I had is worth the time to quote here.\n\nOn making my first trip to Montana for fuel to keep my house warm, I stopped to inquire at a farm house where I could get water. My owner said they had not had a drink all day. I was told I would find along the road near the trail after traveling what seemed quite a long way. I knew some water not far from trail and needed my own. Toward the end of the journey I heard footsteps. The men being followed for drink made a race for the water but on account of thin heads found it was white ahead and the water was probably 25° of fever. They immediately they were into the mud right up to their knees. I jumped to the front of the wagon gear and yelled and shouted the trip and they came running around and out. They had been down in mud at least three feet. A neighbor of mine took a team of horses the same way home. Time later the good Lord was surely with me for if not I got out very safely.\nI have filled in questionnaires to the best of my recollection and trust it will be of some help to your poems. One experience I had is worth the trouble to quote here.\n\nOn making my first trip to Montana for the purpose of homesteading, I stopped to inquire at a farm house where I could get water. My host was very kind and offered me a drink all day long. I was told I would find plenty of water near the trail. After travelling what seemed quite a long way, I came upon water not far from trail and headed my oxen towards it. Through some accident, however, the oxen being frightened for drink made a race for the water first on discovery of their heads. It was white ash, mud, and the water was probably not fit for anything immediately they were into the mud right up to their bodies. I jumped to the front of the wagon gear and yelled and shouted the whole way down the trail. They have been down in mud at least three feet deep. A neighbor of mine took a team of horses the same way some time later. The ground was very muddy with me for a fellow. I got out very dirty.\nI would have gone down also.\n\nThe summer of 1900 was extremely dry and no snow the previous winter. About Aug. 5th it started raining and every other night for weeks there was a heavy thunderstorm.\n\nThat summer settlers further east came long distances looking for hay to cut. Some had hay cut and coiled in the very deep sloughs very soon the water covered the hay.\n\nThere was only one slough for miles around where all settlers watered their animals and I was fortunate enough to live within half a mile of it. For drinking water I dug a hole in center of a very deep slough close by and got some soakage water. (This was early spring)\n\nI might state I was one of the pioneer growers of grass for seed. In 1907 I sold my first Western rye seed to McKenzie Seed Co. Brandon. After that I increased my acreage every year and cleaned and petalled my seed and there was very few towns or prairies that I didn't ship seed to. Mr. Pearson of the Dom Seed branch at back has been at my farm a great many times inspecting my brown seed of later years.\n\nYours very truly,\n\nL.W. Burns\nI would have gone down also.\n\nThe summer of 1900 was extremely dry and no snow the previous winter. About Aug. 1st it started raining and every other night for weeks there was a heavy thunder storm.\n\nThat summer settlers further east came long distances looking for hay to cut. Some had hay cut and coiled in the very deep sloughs very soon the water covered the hay.\n\nThere was only one slough for miles around where all settlers watered their animals and I was fortunate enough to live within half a mile of it. For drinking water I dug a hole in center of a very deep slough close by and got some drainage water. (This was early spring)\n\nI might state I was one of the pioneer growers of grass for seed. In 1907 I sold my first Western rye seed to McKenzie Seed Co. Brandon. After that I increased my acreage every year and cleaned and patented my seed and there was very few towns or prairies that I did not ship seed to. Mr. Pearson of the Dom Red brand at back has been at my farm a great many times inspecting my home seed of later years.\n\nYours very truly,\n\nL.W. Burns\nA sun-set in Sockatshawan\nAs hard rain pours a Prairie City\nJust as the sun goes down\nI feel really missed a Heavenly Night\nA grandeur night dear me in Kefund\nIts Javelins red, blue, pink and gold\nWith two and tints named not the names\nFor trying to paint a scene like this\nMans art at best is only shamed.\n\nSometimes upon the western trim\nThis color scheme we see\nSome other purple night o'knight\nIt spreads out a vast canopy\nNo poem like this can be compared\nTo what of world I've traveled round\nIf we but really Gods former\nIf then we will stand on holy ground.\n\nP.S. I composed this little poem five years ago when on a trip back to Kingston and after witnessing a beautiful sunset. Should perhaps you might think fit for the archives.\nA poem in Sonnet form\n\nAs the last rays peer a Prairie sky\nJust as the sun goes down\nPainted really mimic a heavenly sight\nA garden's plight seen in profound\nIts jewels red, blue, pink and gold\nWith hues and tints named not to named\nFor trying to paint a scene like this\nMans art at best is only shamed.\n\nSometimes upon the western rim\nThis calm scheme we see\nSome other paints night o'knight\nIt spreads out a vast canopy\nTwo poems like this can be compared\nIn what of world has traveled round\nIf we but realize Gods former\nIf then we will stand on holy ground.\n\nP.S.\nI composed this little poem five years ago\nWhen on a trip back to Arizona and after witnessing a beautiful sunset. I thought perhaps\nyou might check for the archives.\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_605.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5837, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1871, 5], [1871, 1871, 6], [1871, 3094, 7], [3094, 4452, 8], [4452, 5991, 9], [5991, 7756, 10], [7756, 8714, 11], [8714, 9228, 12], [9228, 10422, 13], [10422, 11475, 14], [11475, 12576, 15], [12576, 13026, 16], [13026, 14102, 17], [14102, 15398, 18], [15398, 16450, 19], [16450, 17528, 20], [17528, 18605, 21], [18605, 19682, 22], [19682, 20422, 23], [20422, 21157, 24], [21157, 21157, 25], [21157, 21309, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]