[{"id": "d3ac1253117e4b791f6328903667d746cdbaab55", "text": "Please print name and address in capital letters.\n\nYour full name: Frank Michael Kusch\n\nPresent Address: 105 Ave. O South\n\nPioneer Address:\n\nYear you came to Saskatchewan: 1883\n\n(Drawing by Richard Greburn)\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nYOUR EXPERIENCE OF EARLY SCHOOL ACTIVITY\n\n1. Persons answering this questionnaire will have learned of school life in the early days in Saskatchewan in different ways, and in order that your answers may be of the most value, please put a check mark beside each of the following which apply to you, giving dates wherever possible:\n\n   Dates\n\n   You went to school in Saskatchewan: 1887\n   Your children attended school: 1915\n   You taught school: 1923\n   You were a school trustee: 1945\n   Other (ratepayer or resident): 1960\n   School inspector: 1970\n   Other: 1975\n\n   Explain and give dates.\n\nIf your experience in different capacities took you into more than one community (for example, if you taught in various districts, or taught in one place, then moved to another part of the province), make it clear in your answers which place and time you are referring to in each question, or explain here which of these you intend to deal with in this questionnaire. (If you would like separate questionnaires for different roles which you played, please ask for another copy.)\n\nBUILDING AND EQUIPMENT\n\n2. Was school held in your district before a school building was erected? If so, describe the arrangements, telling where school was held, how many pupils attended, who the teacher was, how long this system continued, as well as any other details which you may remember.\n\n3. When was the school in your district built?\n\n4. Who designed and built the building?\n\n5. What material was the school made of (logs, lumber, stone, etc.)?\n\n6. What was the size of the building?\n\n7. Were there classrooms for coats, or were they hung at the back of the classroom?\n\n8. Did the school have a basement? If yes, what use was made of it?\n\n9. If the building included any other rooms besides those mentioned in this question, tell what they were used for, and their sizes.\nYOUR EXPERIENCE OF EARLY SCHOOL ACTIVITY\n\n1. Persons answering this questionnaire will have learned of school life in the early days in Saskatchewan in different ways, and in order that your answers may be of the most value, please put a check mark beside each of the following which apply to you, giving dates wherever possible:\n\n   You went to school in Saskatchewan _______ (dates)\n\n   Your children attended school _______ (dates)\n\n   You taught school _______ (dates)\n\n   You were a school trustee _______ (dates)\n\n   Other _______ (dates)\n\n   etc., etc.\n\n   Explain and give dates _______ (dates)\n\nIf your experiences in different capacities took you into more than one community (for example, if you taught in various districts, or taught in one place, then married and lived in another part of the province), make it clear in your answers which place and time you are referring to in each question, or explain here which of these you intend to deal with in this questionnaire. (If you would like separate questionnaires for different roles which you played, please ask for another copy.)\n\nFarm in Snowberry till 1960\n\nBUILDING AND EQUIPMENT\n\n2. Was school held in your district before a school building was erected? _______ (dates)\n\n3. When was the school in your district built? _______ (dates)\n\n4. Who designed and built the building? _______\n\n5. What material was the school made of? _______\n\n6. What was the size of the building? _______\n\n7. Or the classroom? _______\n\n8. Were there classrooms for boys, or were they hung at the back of the classroom? _______\n\n9. Did the school have a basement? _______\n\n10. If yes, what was made of it? _______\n\n11. If the building included any other rooms besides those mentioned in this question, tell what they were used for, and their sizes. _______\n7. Were there any additions or major alterations in the school later? If so, explain what these changes were, giving sizes, and explain the reason, (that is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed). \n\n8. Is this first school building still in use? If not, give the reason, (burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started? How many children of school age were there in the school?\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n\nHe saw the devil under the table and fainted.\n7. Were there any additions or major alterations in the school later? None\n\nIf so, explain what these changes were, giving dates, and explain the reason (that is, was it because of increase in number of pupils; or for extra convenience, such as adding a porch or coal stove).\n\n8. Is this first school building still in use? It is now located at the University.\n\nIf not, give the reason. (Burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible.\n\nThe Victoria School now stands at the Stone Location.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc.\n\nThe old school still stands at the University.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain.\n\nOil oil lamps were used only at dinner.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc.\n\nI have 4 deaf at my house farm at Kenmore.\n\nIt is a medium size about 10 year old.\n\nAbout 4 families lived in town but a dozen or more lived on farms.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age so young were active in getting the first school started? 10 or more families attended.\n\nHow many children of school age were there in the school?\n\nHow many teachers or others in the district helped in establishing the school? Explain.\n\nMy father built a brick house hall for the single folk. He needed all the wood for his own house. They were mostly preachers and farmers.\n\nWas there any opposition within the community towards the idea of starting a school? Explain.\n\nAnd were inviting a preacher when one of them (did) want to name him imaginary.\n\nHe saw the devil under the table and fainted.\n12. Describe the steps taken towards the starting of the school.\n\n13. What was the name and number of the school district?\n   Who suggested the name?\n   Who or what was the district named after?\n\n   Was there any difficulty or disagreement over choosing this name?\n\n14. How many women, if any, were on the first trustee board set up?\n   How many women have served on boards since? Give dates if possible.\n\n   How many bachelors were on the first board; all trustees?\n\n15. Was it difficult to get people to act as trustees? Explain.\n\n16. Were school trustees usually parents with children going to school?\n   Was it thought that the teacher \"favoured\" the children of trustees?\n   Did the trustees try to do their best for the school, or were they mainly interested in keeping down expenses? Explain.\n\n17. Were the ratepayers' annual meetings well attended?\n\n18. How long did teachers usually stay at your school - a year less than a year, for several years?\n\n19. Did the teacher \"board around\" from one place to another, have a regular boarding place, a teacherage, etc.? Explain.\n\n20. How much was charged for board?\n\n21. How did the teacher get to school?\n\n22. How far did he or she have to go?\n\n23. In choosing a teacher, was preference shown to either sex?\n\n24. Did a man receive a higher salary?\n\n25. Was a preference shown to any nationality or religion? Explain.\n12. Describe the steps taken towards the starting of the school.\n\n13. What was the name and number of the school district?\n   Who suggested the name?\n   Who or what was the district named after?\n\nWas there any difficulty or disagreement over choosing this name?\n\n14. How many women, if any, were on the first trustees board set up?\n   How many women have served on boards since? Give dates if possible.\n\n15. Was it difficult to get people to act as trustees? Explain.\n\n16. Were school trustees usually parents with children going to school?\n   Was it thought that the teacher \"favoured\" the children of trustees?\n   Did the trustees try to do their best for the school, or were they mainly interested in keeping down expenses? Explain.\n\n17. Were the ratepayers' annual meetings well attended?\n\n18. How long did teachers usually stay at your school - a year, less than a year, for several years?\n\n19. Did the teacher \"board around\" from one place to another, have a regular boarding place, a teacherage, etc.? Explain.\n\nHow much was charged for board?\n\n20. How did the teacher get to school? Walk\n\nHow far did he or she have to go? About 1 mile\n\n21. In choosing a teacher, was preference shown to either sex?\n\nDid a man receive a higher salary? No\n\nHas a preference been shown to any nationality or religion? No\n22. What was the approximate age of most teachers in your school? In choosing a teacher, was preference given to any particular age group? Explain.\n\nWhat were the teachers like—mix with people in the district, take part in community activities, etc.? How much did older pupils help the teacher with smaller ones at school? Tell whether it was a regular custom, or only once in a while, and what they did to help—mark arithmetic questions, hear reading, give spelling, etc.\n\n23. How many of the teachers marry someone in the district? We had only a few teachers stay all year. For years we had only a few teachers stay all year.\n\n24. Were report cards sent to parents? How often? Each year.\n\nWere any other means used to let parents know how their children were doing in school? Explain.\n\n25. How often did the school inspector visit the school? Once a year.\n\nWhat means of travel did he use? He used the bus.\n\nHere his visits considered of benefit to the school? Explain.\n\nWas the character of the inspector such that he was respected by trustees, teachers and others in the district? Explain.\n\nHe was well liked. He won an English literature award.\n\n26. Who did the janitor work and lit the fires? Who looked after the fire during the day?\n\nWhat kind of a stove or furnace was used? Box stove about 3 feet long.\n\nWhat fuel was used? Wood. Where was fuel kept (a separate building, in school building, etc.)?\n\nDuring cold weather, was the school always warm enough in the morning to start school on time? Yes.\n\nIf not, what did the pupils do to keep warm (play running games, etc.)?\n\n27. Did school always start at 9 a.m., and close at 3 p.m.? If not tell what changes were made, and reasons. (For example, if opening time in winter was 9:30 a.m., etc.)\n\nSchool started 9 a.m. in summer and 9:30 a.m. in winter.\n22. What was the approximate age of most teachers in your school? In choosing a teacher, was preference given to any particular age group?\n\nWithin the batch, we were treated fairly well.\n\nWhat were the teachers like—sex with people in the district, take part in community activities, etc.?\n\nOlder teachers were needed to mix in the community no trouble at all.\n\nDid many of the teachers marry someone in the district?\n\nWe had only a few teachers who all stayed for years.\n\n23. How much did older teachers help the teacher with smaller ones at school? Tell whether it was a regular routine or only once in a while, and what they did to help—mark arithmetic questions, hear reading, give spelling, etc.\n\nNone\n\n24. Were report cards sent to parents? Yes. How often? Each year.\n\nWere any other means used to let parents know how their children were doing in school? Explain.\n\nThe Parent-Teacher Association was used to cause new interest.\n\n25. How often did the school inspector visit the school? Once a year.\n\nWhat means of travel did he use? Car.\n\nWere his visits considered of benefit to the school? Explain.\n\nHe asked the pupils a few questions and discussed school.\n\nWas the character of the inspector such that he was respected by trustees, teachers, and others in the district? Explain.\n\nHe was well liked. He was an English immigrant.\n\n26. Who did the janitor work and lit the fires? (Name)\n\nWhat kind of a stove or furnace was used? Wood stove, about 3 ft long.\n\nWhat fuel was used? Wood. Where was fuel kept (a separate building, in school building, etc.)?\n\nDuring cold weather, was the school always warm enough in the morning to start school on time? Yes.\n\nIf not, what did the pupils do to keep warm (play running games, etc.)?\n\n27. Did school always start at 9 a.m., and close at 3 p.m.? If not, tell what changes were made, and reasons. (For example, if opening time in winter was 9 a.m., etc.)\n\nSchool started again in summer and fall on the winter schedule.\n28. To what extent did the school board buy text books to supply free to the pupils? None\n\nDid the school board supply pupils with scribblers, pencils, or other school supplies? Explain.\n\nIf each family bought their own books and supplies for school, where did they usually buy them? At the local store, send away for them, teacher send for them?\n\nSCHOOL ATTENDANCE.\n\n29. How many pupils attended your school? 27630\n\n30. How far were you from school? 1/2 mile\n\nHow did most of the children in the district get to school (walking, riding horseback, etc.) in summer? walked\n\nin winter? walked\n\nWas there a barn for the horses? Yes how large? 16' x 36'\n\nDo you remember the pupils ever having to stay at school all night because of a blizzard, spring time floods or other such conditions? No\n\nDescribe the circumstances. The Purple of Seabrook was all prepared to make room for the kids when a storm was in progress.\n\n32. Was it the custom to have the school closed during the winter months? No explain, no except Saturday Sundays\n\nIn the fall or other time so children could help with work at home?\n\n33. Was the school ever closed because of epidemics of diseases? No\n\nTell what diseases, and give dates and length of time school was closed.\n\n34. How much did pupils have to miss school to help with work at home? Very few because of bad weather. The same\n28. To what extent did the school board buy text books to supply free to the pupils? \n\nDid the school board supply pupils with scribblers, pencils, or other school supplies? Explain.\n\nIf each family bought their own books and supplies for school, where did they usually buy them—(at the local store, send away for them, teacher send for them)? \n\nSCHOOL ATTENDANCE.\n\n29. How many pupils attended your school? \n\n30. How far were you from school? \n\nHow did most of the children in the district get to school (walking, riding horseback, etc.) in summer? In winter?\n\nWas there a barn for the horses? \n\n31. Do you remember the pupils ever having to stay at school all night because of a blizzard, spring time flood or other such conditions? \n\nDescribe the circumstances. \n\n32. Was it the custom to have the school closed during the winter months? \n\nIn the fall or other time so children could help with work at home? \n\n33. Was the school ever closed because of epidemics of diseases? \n\nTell what diseases, and give dates and length of time school was closed.\n\n34. How much did pupils have to miss school to help with work at home? \n\nBecause of bad weather?\n35. What was the attitude of most of the children towards going to school (dislike it, like it because of teachers, other pupils, got away from work at home, learning to read books, etc.)? Explain.\n\n36. Were any children in your district taught at home instead of coming to school? Why (distance, weather, not wish children to associate with others, etc.)?\n\nCLASSROOM ACTIVITIES\n\n37. Did the subjects, reading, writing, and arithmetic, make up most of the school program? Explain.\n\n38. Was reading taught mostly by \"sounds\", or by some other method? Explain.\n\n39. How large a part did oral reading play in school work (how often did pupils continued did pupils ever read aloud from other readers besides their readers, did pupils in higher public school grades ever read aloud, and from what books, etc.)?\n\n40. Were pupils given much memory work to learn from their readers or from other books? Explain.\n\nDid the teacher usually ask pupils to recite memory work, or write it on the blackboard, or in exercise books, etc.?\n\n41. Describe the nature of writing lessons and practice—were they from copy books, from the readers, writing so many lines of a certain letter, etc.?\n\nHow much was printing used in the primary grades instead of writing?\n\n42. Describe any particular features of arithmetic classes which you remember.\n\n(For example, were questions written on the blackboard or were books used, was adding, subtracting, multiplying and dividing of extremely large numbers required, was much use made of practical, everyday problems in arithmetic?)\n35. What was the attitude of most of the children towards going to school (dislike it, like it, because of teacher's other pupils, get away from work at home, learning to read books, etc.)? Explain.\n\n36. Were any children in your district taught at home instead of coming to school? Why (distance, weather, not able to attend classes with others, etc.)?\n\n37. Did the subjects' reading, writing, and arithmetic make up most of the school program? Explain.\n\n38. Was reading taught mostly by \"sounds\", or by some other method? Explain.\n\n39. How large a part did oral reading play in school work (how often did pupils read aloud from their readers, in what grade was this done—outdoors, did pupils ever read aloud from other books besides their readers, did pupils in higher public school grades ever read aloud, and from what books, etc.)?\n\n40. Were pupils given much \"memory work\" to learn from their readers or from other books? Explain.\n\n41. Describe the nature of writing lessons and practice—were they from copy books, from the readers, writing so many lines at a certain letter, etc.?\n43. Did you have much formal grammar (parsing words, picking out subject, predicate, etc.)? Yes a lot\n\n44. Describe any activities designed to improve the manner of speaking and writing of the pupils such as written exercises in the use of the correct word, or attempts of the teacher to improve the spoken English of the pupils.\n\nThe teachers all wanted to the grammar used by pupils\n\n45. Were pupils very often asked to write compositions, and how important a part did this activity play in school? Yes, had a lot of composition\n\n46. Did any of the teachers encourage pupils to write poetry? No\n\n47. Did pupils do much speaking before the rest of the school, such as telling stories, giving talks, holding debates, etc.? Yes, gave a lot\n\n48. Was any language besides English taught in any of the public school grades? Give details. Only Latin\n\nWhat proportion of the children, if any, could not speak English when they started school? We knew\n\nWere they given special instruction to help them learn English, or were they left alone to \"pick it up\" from the other children?\n\nThey were all helped\n\n49. As nearly as you can remember, tell how much the following subjects were taught, whether they were taught regularly, not taught at all, or only once in a while if a teacher was transferred in that subject. Add any details you can remember as to how they were taught, and what activities were carried on in connection with these subjects:\n\nHistory mostly\n\nGeography through my favorite\n\nNature Science a lot\n\nLiterature enough\n\nArt a lot\n\nMusic a lot\n\nPhysical Training Enough\n43. Did you have much formal grammar (paralinguistic words, picking out subject, predicate, object, etc.)? Yes, a lot.\n\n44. Describe any activities designed to improve the mastery of spoken and written English. Every pupil in the class was encouraged to improve his spoken English by writing exercises in which he had to use nouns, verbs, adjectives, etc., in context. The emphasis was on improving the spoken English of the pupils.\n\n45. Were pupils very often asked to write compositions, and how important a part did this activity play in school? We found a lot of composition.\n\n46. Did any of the teachers encourage pupils to write poetry? No.\n\n47. Did pupils do much speaking before the rest of the school, such as telling stories, giving talks, holding debates, etc.? Yes, quite a lot.\n\n48. Was any language besides English taught in any of the public school grades? Yes, Latin.\n\nWhat proportion of the children, if any, could not speak English when they started school? We don't know.\n\nWere they given special instruction to help them learn English, or were they just left alone to \"pick it up\" from the other children? They were all helped.\n\n49. As nearly as you can remember, tell how much the following subjects were taught, whether they were taught regularly or not, and what activities were carried on in connection with these subjects:\n\nHistory mostly\n\nGeography enough my favorite\n\nNature Science a lot\n\nLiterature enough\n\nArt a lot\n\nMusic a lot\n\nPhysical Training Enough\n50. Tell about any other subjects studied at school, or activities carried on in connection with school work, which have not already been mentioned.\n\n51. Were slates ever used in your school? If so, when was their use discontinued?\n\n52. What were the usual punishments for misbehavior?\n\nHow much did teachers make pupils learn memory work as a punishment?\n\nWere they very often required to write lines as a punishment?\n\nWere there any incidents in which parents objected to the form of punishment given by the teacher? What was done about it?\n\n53. What religious observance was carried on in school, such as opening school with Lord's prayer, hymn, etc.?\n\n54. What arrangements were made for eating the noon lunch? (Did pupils sit in the hall, go outside, etc.? In summer? In winter?)\n\n55. Did pupils wash their hands before eating? Describe the washing arrangements.\n\n56. What foods were brought in school lunches? Better than now\n\n57. Were pupils allowed to eat part of their lunch at recess time?\n\n58. Was there always drinking water at school? Where was water secured for the school? Who carried it?\n\n59. Tell what toilet accommodation there was (outside toilets, separate ones) for boys and girls?\n50. Tell about any other subjects studied at school, or activities carried on in connection with school work, which have not already been mentioned.\n\n51. Were slates ever used in your school? If so, when was their use discontinued?\n\n52. What were the usual punishments for misbehavior?\n\nHow much did teachers make pupils learn memory work as a punishment?\n\nWere they very often required to write lines as a punishment?\n\nWere there any incidents in which parents objected to the form of punishment given by the teacher?\n\n53. What religious observances were carried on in school such as opening school with Lord's prayer, hymn, etc.? Hymn at close of School\n\n54. What arrangements were made for eating the noon lunch? (Did pupils sit in the II seats, in cattle, etc.?)\n\n55. Did pupils wash their hands before eating? Describe the washing arrangements.\n\n56. What foods were brought in school lunches? Better than now\n\n57. Were pupils allowed to eat part of their lunch at recess time?\n\n58. Was there always drinking water at school? Where was water secured for the school? Who carried it?\n\n59. Tell what toilet accommodation there was (outside toilets, separate ones) for boys and girls? I toilets back of the school\nSCHOOL GROUNDS, GAMES AND ENTERTAINMENT\n\n60. How large was the school yard? Was it fenced?\nDescribe any efforts at improvement of the school yard, such as planting trees, flowers, gardens, etc. Give dates if possible.\n\n61. What games did the pupils usually play in cold or rainy weather?\n\nIn good weather?\n\nWhat equipment did they have for games, and how was it secured?\n\n62. Were any school teams organized before 1914 to play against teams from neighboring schools?\n\nFor what game or games?\n\nDescribe any details you remember about arrangements for such games.\n\n63. Were there divisions or \"sides\" taken among the pupils because of racial differences, or were some children \"picked on\" because of that or other reasons?\n\n64. Tell what you remember about the school library, as to number and kind of books ever taken home a day.\n\nHow much use did the pupils make of the library during school hours?\n\nOut of school hours?\n\n65. Was Friday afternoon, or some other time, usually used for special activities, such as spelling, arithmetic or geography matches, meetings of a social, society or other activities? Explain.\n\n66. When did the annual Christmas concert and tree become an established custom in your school, and in neighboring schools?\n\nAs early as possible can remember.\n\nHow was money secured for the expenses of the concert, and for gifts and treats for the children? If these were provided?\n\nEvery one shipped in and no child was left out.\nSCHOOL GROUNDS, GAMES AND ENTERTAINMENT\n\n60. How large was the school yard? Was it fenced?\nDescribe any efforts at improvement of the school yard, such as planting trees, flower gardens, etc. Give dates if possible.\n\n61. What games did the pupils usually play in cold or rainy weather?\nIn good weather?\n\nWhat equipment did they have for games, and how was it secured?\n\n62. Were any school teams organized before 1914 to play against teams from neighboring schools?\nFor what games or games?\nDescribe any details you remember about arrangements for such games.\n\n63. Were there divisions or \"miles\" taken among the pupils because of racial differences, or were some children placed on because of this or other reasons?\n\n64. Tell what you remember about the school library, as to number and kind of books, how often they were used, and how much use did the pupils make of the library during school hours?\n\n65. Was Friday afternoon, or some other time, usually used for special activities, such as spelling, arithmetic or geography exercises, meetings of a school society or other activities? Explain.\n\nDISTRICT SOCIAL LIFE\n\n66. When did the annual Christmas concert and tree become an established custom in your school, and in neighboring schools?\n\nDescribe any community activities for the children (if these were provided)?\nHow was money secured for the expenses of the concerts, and for gifts and treats for the children (if these were provided)?\n\nEvery one chipped in and no child was left out.\n67. Tell what you remember of the Christmas concerts, type of program, when it was held, if a platform was erected for it, and other incidents connected with it.\n\nWe always had a raised platform in front.\n\nTo what extent was the teacher's ability as a teacher judged by the success or her Christmas concert? Give details.\n\nWas there much neighborhood rivalry as to which school could put on the best concert? Explain.\n\n68. Tell about any other parties or special events held on particular days, which were a part of the school activities, such as Valentine or Halloween parties, parents visiting the school, etc.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\n70. Was the school yard used for school or community picnics, ball games, etc.? Describe.\n\nPart of the yard was used and we had acres of open field north of school.\n\nGENERAL\n\n71. What differences were there in the way the school was conducted in the first years you were here as compared with the country you came from?\n\nNearly the same.\n\n72. What do you think of the school system today as compared with that in the pioneer days?\n\nNo better.\n\nP.S. He held the funeral service for his Washington a Catholic.\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (Use back of page or extra sheets if necessary.)\n\nGeorge Horn this best teacher in Canada area also the handy man any one did he always acted as a ordained minister. He held the spiritual service for him.\n67. Tell what you remember of the Christmas concerts, type of program, when it was held, if a platform was erected for it, and other incidents connected with it.\n\nWe always had a raised platform in front.\n\nTo what extent was the teacher's ability as a teacher judged by the success of her Christmas concert? Give details.\n\nWas there much neighborhood rivalry as to which school could put on the best concert? Explain.\n\n68. Tell about any other parties or special events held on particular days, which were a part of the school activity, such as Valentine or Halloween parties; parents visiting the school, etc.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\n70. Was the school yard used for school or community picnics, ball games, etc.? Describe.\n\nPart of the yard was used and we had acres of open field north of School.\n\nGENERAL\n\n71. What differences were there in the way the school was conducted in the first years you were here as compared with the country you came from?\n\nNearly the same.\n\n72. That do you think of the school system today as compared with that in the pioneer days?\n\nNo better.\n\nP.S. He held the funeral service for his brother.\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (See back of page or extra sheets if necessary.)\n\n75. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (See back of page or extra sheets if necessary.)\n\nGeorge How this local teacher in Canada also the handy man anyone did he always acted as a ordained minister. Hamilton a particular army for him\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3511.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7864, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1036, 5], [1036, 1036, 6], [1036, 2892, 7], [2892, 4693, 8], [4693, 5733, 9], [5733, 7543, 10], [7543, 8913, 11], [8913, 10224, 12], [10224, 12036, 13], [12036, 14007, 14], [14007, 15361, 15], [15361, 16512, 16], [16512, 18064, 17], [18064, 19152, 18], [19152, 20730, 19], [20730, 22215, 20], [22215, 23418, 21], [23418, 24632, 22], [24632, 26082, 23], [26082, 27577, 24], [27577, 29326, 25], [29326, 31233, 26], [31233, 31385, 27], [31385, 31536, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]