[{"id": "d26f54b8bb8eb1dc484b77d45b806da7cf3c4e05", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Joseph Leander Wegren\n2. Your address: 630 West 8th Ave., Saskatoon\n3. Date: March 1, 1952\n4. Where were you born? (Give name of place and country): Geneseo, Illinois, U.S.A.\n5. What was your father's name and occupation?: John Wegren, Farmer\n6. When did you come to Saskatchewan? (Give month and year): May 27, 1907\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Came directly to Saskatchewan from Geneseo, Ills.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 14 years old\n9. What were your reasons for going West?: Came with my parents.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): My father wrote to a government agent in Chicago.\n12. What did your friends and relatives think of your decision to come to Western Canada? I thought we were crazy, but a friend of our family also came along and brought his family.\n\n13. Did you travel by yourself or with a party (family, friends or other groups)? The two families came together.\n\n14. What means of transportation did you use? We brought a carload of stock and landed in Dundurn. The women and children came as passengers and the men came with the stock in the freight cars.\n\n15. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.) We stopped at 3 towns on a Minneapolis transfer yard, 13 days at South and North Portal and 12 weeks at Redden. They had been a patch out at Dundurn so we put up a tent, took the animals out to pasture and waited at Dundurn along with the other 47 cars till we could continue. At Dundurn the train went slower than a man could walk.\n\n16. Where did you first stay when you arrived in Saskatchewan? At Dundurn. It was May 27th and we had to shovel out a snow drift before we could unload the car.\n\n17. Where did you settle or take up land? My father settled at 33-2-W of 3d, section 14, Cyrus Post Office, but had to haul all supplies from Dundurn, 20 mi.\n\n18. Mention any other places where you have lived since coming to Saskatchewan. I married in 1911 and settled at section 14 - 33 - 2 - W of 3d, and have lived here ever since. With the Grand Trunk running through our post office was at Allan, then miles away. We have now changed to Bradwell, also some away.\n\n19. How did you earn a living before coming to Western Canada? How after you came? We were farmers in Illinois and worked during the summer vacations. We threshed all fall around Dundurn. Dug potatoes or earned a dollar whenever possible. We had cattle and another gold butter. We hauled wood from the bush, 20 mi. My folks' first house was made of these logs.\n19. How often did you write to relatives or friends in your old home?\n   Fairly regular.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I married Florence M. Carlson of Moline, Illinois. We were married at Winnipeg, August 1st, 1911.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n    Yes.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n    The eldest is living near me. The next younger is Royal Bank Manager at Abernethy, Alta. The youngest son died and farmed the homestead after my father's death.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n    Landcheaters were frequent visitors at mother for dinners, also squatters and the Homestead Inspector.\n    Once while milking the cows on horseback, I was followed by a timber wolf and joined a couple until the last two years the coyotes have come right up to the farm.\n    The once Indians were always friendly and became personal friends when they worked for my father for 5 years. They are still living at the North Reserve west of Dundurn.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n    In the early days we walked 20 mi to Dundurn to thresh for $1.25 a day. We threshed 42 days in 1904 and slept 2 nights under a roof, the rest of the time in a straw pile or under a hay rack.\n    We often walked 10 mi to a dance or a ball game.\n    The oldest school in the district, Deerfield, built in 1905, was the scene of suppers, church services, picnics, etc.\n    We joined the church in Allan which was built in 1907. The wife and I drove in a buggy with a dog sled and horse all summer. Nine miles. That was about 1915, however.\n25. When was the first car used in the community? In about 1911 or '12, by the bank manager.\n\n26. If you owned a car before 1914, when did you buy it? What make? We bought our first one in 1916.\n\n27. Where was your trading center? How far from your home? At Dundurn, some miles north of Allan, 10 mi. away.\n\n28. Did you continue to trade there? (Indicates any changes due to new towns appearing, better means of travel, etc.). Yes. But with the car we often went to Saskatoon, some 30 mi., that is several times a summer.\n\n29. How often did you shop in the early days? Perhaps once a month, less in the winter time.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? After we bought the car, about 1916.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. About 1910, we all the C.M.R. came through. We sent for clothes, groceries, small tools and household goods. Most groceries were bought at the store. Although we still use the mail order, we go to the city by truck and bring home purchases.\n\n32. When did you first have a telephone and what company provided it? Allan General Telephone Co. installed the system in 1910 by charges from subscribers.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? The family intended to stay; but, after our marriage we just stayed on and are still here on the same quarter - with more added.\n\ngavea Indians.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nTheir reasons, I don't know.\n\n35. Did many people move away during the 1930s? Did many return?\n\nNone, not around here.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates where possible.\n\nFather was Councillor for the Local Improvement District prior to 1910, also one of the organizers of the Telephone Co., and one of the Directors who built the Deerfield School in 1905.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI was one of the two men who had the first combine in the district 1929. I was one of the first who had a small farm tractor 1915.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur first post office, held on a homestead by Mr. Bradwell from England, was called Curzon from Lord Curzon. It was discontinued when the town of Allan was settled in 1909. The Grand Trunk alphabetically named the towns.\n\nOur Lost River Municipality was named from a deep ravine caused by an old river. A large hill, almost round with a quarter-section of flat land on top, situated about two miles south of Bradwell is known by all of us relatives as the \"Big Hill,\" but on the maps is called \"Thunder Hill,\" named by the Indians.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n1. Son, John, farmer, Bradwell. Wife and daughters Marlene, Florence and twins Edna and Iris.\n2. Son Robert, farmer & garage employee at O.J. Wills & Co., two daughters, Ethel & Marie.\n3. Daughter, Dorothy, husband D.H. McLeod, telegraphist in C.P.R. at Saskatoon.\n4. Son Dale, wife, farmer, Bradwell.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter roads and the radio.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. Gilman Moore, Bradwell, came in 1906.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Joseph L. Wegren\nBradwell, Sask.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_812.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2748, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1018, 3], [1018, 3007, 4], [3007, 4962, 5], [4962, 6726, 6], [6726, 8583, 7], [8583, 10025, 8], [10025, 10025, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]