[{"id": "cff36305bcad7b8c868ad070f0204af91ccd3ca9", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE,\nNo. 5\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\nYour full name MRS. MAGGIE M. WHYTE,\nPresent Address CAWSTON, B.C.\nPioneer Address INDIAN HEAD, SASK.\nYear you came to Saskatchewan 1883.\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? The village was very small but close enough to visit. How many of these were bachelor's houses? A few married men whose families had not joined them batched till they came.\n\n2. How often did you usually visit neighbors? Mother was a busy woman with her family but she would make time to visit the picker new comers.\n\n3. Did you usually visit on Sundays or other days? Often Sunday afternoon Father would drive us to the country to visit friends.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? You were always made to feel welcome at any time and never waited for a special bid.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? If very far we went in the morning but it was not seldom.\n\nWhat about meals? Did you stay when not invited beforehand? Sometimes mother would put up a lunch and we would return on the way to visit the friends and return.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take potluck\" used, or was some other expression common?) \"Take potluck\" was a very common expression.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in? A cup of tea to the elders and a glass of milk with cookies to the children.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes the two older brothers remained at home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nIf a farmer had the accident or sickness been unable to cultivate his ground or put his seed in the neighbors gathered and did the women taking the food to feed them. Women had quilting bees.\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe. There were parties but playing cards were unknown then. The card games were Loo, Pheer, Snap, Authors and others. Games such as charades, siebers, Pass the Buttons, etc., Forget, checkers, dominoes, Fish Pond, Crokinole, etc.\n\nWere these more frequent in later years? Give dates.\n\nIn 1897 I saw my father dance at my cousin's wedding but dances were not plentiful in those days.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? In later years when we were in our teens we used to go in flesh league to some home in the country about once a month.\n8. Tell what use was made of the school house for community purposes, but exclude social activities. (Include also the school Christmas tree, skating, etc.)\n\n9. What was your first community hall built? About 1895\n\nWhat material was it made of? Lumber\n\nHow large was it? About 40' x 60'\n\nWho built it? The community through special funds, the municipality, organization, etc.\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall only when for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\nIt was used for dances, dinners, bazaars, Christmas parties, Methodist and Anglican services, etc. They got their own churches built, outside talent put on plays, etc.\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as mentioned in question 8, 9, and 10) did the entire family attend?\n\nChristmas trees, only the older ones attended.\n\nHow were babies and small children provided for?\n\n11. What card games were popular in the early days? (Answered on question 7)\n\nLater playing cards came in.\n\nBut there card playing for a private game, whist, bridge, etc.\n\nWhat games were popular? Whist, Polka, quadrille, and always popular quadrille.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nSometimes, as the Methodists did not believe in dancing, they did not like their children doing it.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nAt first but gradually gave in and young people who played away from home were told by their parents to bring their friends to their own home to play.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nA lot of the ladies had their day for callers once a month. Calling ladies left their card with their name on it and two of their husband's cards. Hats and gloves were a necessity for all occasions.\n\n13. Was the chivaree known in your community? Yes.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. There was always a chivaree when the bride and groom returned. One almost proved fatal when the old mother of the groom shot a pistol into the crowd taking off the collars, button off the main shirt and nicking the hair. The crowd soon got out of there thankful no one was hurt.\n\n14. Describe any other details of visiting, parties, etc. that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it? The most of the farmers.\n\nHow many women belonged? How often did it meet? Monthly\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? If so:\n\nToll when it was organized; and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? If so:\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nbard parties, dances, socials etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBaseball, football, marbles, fly kites, hide and seek, kick the stick.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping, play house, with dolls, hide & seek, Blind Man's Buff, It, Pump, pump, pull away, Hide the Button.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, whether it was closed and people only in one relatively small area (for example, within a school district), or was centered in the town itself and included the surrounding community. (There is space in the church column that included the surrounding connected with the church, so they need not be summarized here.)\n\nWhat names were commonly used by organizations for raising money?\n\nBoard parties, dances, socials, etc.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe telling who gave them (local ministers or teachers, itinerant lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (marbles, tops, ball, marbles, fly kites, etc.)? Baseball, football, marbles, fly kites, and races.\n\nHide and seek, race the police.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nSkipping rope, play house, with dolls, hide and seek, pull away birds, etc.\n22. What winter games were played outside - fox and hounds, skating, etc.?  \nSkating, sleigh riding, hockey, building snowmen and houses.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \nAuthors, dominoes, checkers, crokinole, fish pond.\n\nDid the whole family join in such games, or only the children? Explain.  \nMostly the children but in the winter often the parents joined in the fun.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \nEvery child old enough had his or her chores to do and would hurry to get through to go out to play or have fun in the house.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \nIn the winter two sides were chosen and each side built a fort from snow, then had a real snow ball battle.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?  \nGive year and month if possible. May 24th,\n\n26. Who organized it? Our parents\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \nSome of us youngsters wanted to go to Lake Katipawa, 13 miles north of Indian Head so our parents planned a picnic.\n\n28. Was it the first picnic held in the community? There had been other picnics which we had not attended.  \nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? We played on the shore, throwing sticks and stones in the water. Took off our shoes & stockings and waded in.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?  \nTable cloths were spread on the ground and all the food put out for the general picnic.\n\n31. What did you have to eat and drink? Lots of sandwiches, cookies and cake. Lemonade for the children and tea for the adults.\n\n32. What time of the day did it start, and how long did it last?  \nWe would leave home about 9 A.M. If after lunch was over there was still sufficient we would eat again about 5 P.M. Then return home as it took about two hours with horse and buggy.\n22. What winter games were played outdoors—fox and hounds, skating, etc.? \n\n23. Did the whole family join in such games, or only the children? \n\n24. Did children invent games connected with things in the house? \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. What were the games played at the picnic? \n\n29. What were the arrangements made for eating? \n\n30. What did you have to eat and drink? \n\n31. What time of the day did it start, and how long did it last? \n\n32. How would you have liked it to be different?\n33. Describe any features of this picnic which you remember as outstanding.\n\nW.M. Crawford, an Indian Head bachelor, then had built a small steamboat so most of us had a ride on the lake.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nWhen the Experimental Farm got going nicely, Mr. Angus McKay, the Superintendent, let the Sunday School have its annual picnic there. Tables were set up in the loft of the big barn, also swings were put up there. Earlier in the afternoon the kids boys & girls picked raspberries for our lunch. Games were also given for them. Radio games were held outside.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nAt first everyone joined in a general picnic. Then gradually small groups went off by themselves breaking the community spirit which had been so enjoyable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball, football, cricket, lacrosse, hockey, polo, tennis. The ladies played in tennis & croquet. The English were very fond of cricket and polo. Waters were hidden in the loch.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nOur outdoor rink was a pond where we skated as long as ice could be kept clean and if not too cold. When was the first indoor rink built, and what was it used for? About 1891. The curlers had two sheets of ice in the centre and we skated around it.\n35. Describe any features of this picnic which you remember as outstanding.\n\n36. Describe any different kinds of plants which you knew of in those early days, such as the large community plants (trees), shrubs, flowers, etc., food and drinks when held, etc.\n\n37. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n38. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n39. For what year was the first team organized in your community to play against neighboring teams?\n\n40. Name any other sports teams that were organized before 1911, playing date of organization, if possible, and tell something of their activities—played against whom, won or lost, played at local sports days, entered in competitions in larger centers, etc.\n\n41. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, skating, etc.).\n\n42. Tell where we played our curling matches and if there was an ice house built, and what was it used for about 1891.\n\n43. We had two clubs around us, and we played around us.\n40. When did an annual \"sports day\" become established in your community? July 1st, 1903.\n\nDid it grow out of or replace the earlier community picnic? No.\n\nWho was responsible for starting the first sports day? Those with a yen for race horses and ball games.\n\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st.) July 1st.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years? Jane Eyre, Ingleside, Four Girls of Chautauqua, East Lynne, The Wandering, The Prairie Wife, The Prairie Mother, The Prairie Child.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Can remember none before 1914.\n\n48. Was there a school library? Yes. When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? By July 1963.\n\n41. Did it grow out of or replace the earlier community picnic? No\n\n42. Was it responsible for starting the first sports day? Yes\n\n43. Was there any from your community who have been members of well-known teams? Ball or other teams? Give names and dates.\n\nREADING\n\n44. What books did you bring with you when you came here? (Give a list of the names and authors if possible. If not, tell as many as you can how many books you brought, and what kind.) (See extra sheet if necessary)\n\n45. How many of your neighbors bought books with them?\n\n46. What kind of books and how many?\n\n47. To what extent did you exchange books with neighbors?\n\n48. Did you buy any books after you came here? Give details.\n\n49. Have you ever had any traveling library books in your community or school? Give details and dates.\n\n50. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   This was its purpose.\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n51. What newspapers or magazines did you subscribe to when you first came to the area?\n\n52. Describe later changes in your subscriptions, telling why you changed over.\n\n53. Did you ever obtain the free monthly Lady Western packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the seat with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started?\nWho started it? How long did it continue?\nHow many were in it? Who was bandmaster?\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883M-Z_1909.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6376, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1197, 5], [1197, 1197, 6], [1197, 4002, 7], [4002, 4002, 8], [4002, 6031, 9], [6031, 6031, 10], [6031, 7881, 11], [7881, 8611, 12], [8611, 10073, 13], [10073, 11455, 14], [11455, 13809, 15], [13809, 14511, 16], [14511, 16732, 17], [16732, 17941, 18], [17941, 19451, 19], [19451, 20433, 20], [20433, 21375, 21], [21375, 22056, 22], [22056, 23226, 23], [23226, 23226, 24], [23226, 24347, 25], [24347, 24347, 26], [24347, 24347, 27], [24347, 24347, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]