[{"id": "bf77c3f635cfc35d73a402f353f1bd1ff4e19e27", "text": "My Very hearty Good Wishes for a Merry Christmas and a Very Happy New Year.\n\nCommissioner and Mrs. S. C. Allomb\n218 Queen Street West,\nBrantford, Ontario\nMany Hearty Good Wishes\nfor a\nMerry Christmas\nand a\nVery Happy New Year.\n\n[Redacted] Commissioner and Mrs. S. T. Wood\n\n238 Buena Vista Road,\nRichcliffe, Ontario\nIn Account with\n\nWilliamson & Fleming,\n\nGeneral Merchandise, Flour and Feed, Etc.\n\n| Item                  | Quantity | Unit Price | Total |\n|-----------------------|----------|------------|-------|\n| 3 Cans Powder        |          |            |       |\n| 9 Cans Corn           |          |            |       |\n| 10 Pounds Flour Powder|          |            |       |\n| 5 Cans Salt           |          |            |       |\n| 10 Pounds Sugar       |          |            |       |\n| 200 Lbs Bacon         |          |            |       |\n| 300 Lbs Flour         |          |            |       |\n| 200 Lbs Flour         |          |            |       |\n| 200 Lbs Flour         |          |            |       |\n\nTotal: $81.62\nIn Account with\n\nWilliamson & Fleming,\n\nGeneral Merchandise, Flour and Feed, Etc.\n\n| Item Description | Quantity | Price |\n|------------------|----------|-------|\n| 2 x 10 lb. Sugar |          |       |\n| 3 x 10 lb. Flour |          |       |\n| 2 x 5 lb. Coffee |          |       |\n| 1 x 10 lb. Tea   |          |       |\n| 2 x 1 lb. Butter |          |       |\n| 2 x 1 lb. Cheese |          |       |\n| 1 x 1 lb. Lard   |          |       |\n| 1 x 1 lb. Lard   |          |       |\n| 1 x 1 lb. Lard   |          |       |\n| 1 x 1 lb. Lard   |          |       |\n\nTotal: $81.00\n| Item Description | Quantity | Unit Price | Total |\n|------------------|----------|------------|-------|\n| 2 Sacks Flour    |          |            |       |\n| 3 Lbs Candy Glass|          |            |       |\n| 8 lbs Salt       |          |            |       |\n| 1/2 lb Sugar     |          |            |       |\n| 1/2 lb Coffee    |          |            |       |\n| 1/2 lb Tea       |          |            |       |\n| 1/2 lb Coffee    |          |            |       |\n| 1/2 lb Tea       |          |            |       |\n| 1/2 lb Coffee    |          |            |       |\n| 1/2 lb Tea       |          |            |       |\n\nTotal Amount: $53.77\n| Description                  | Quantity | Unit Price | Total |\n|------------------------------|----------|------------|-------|\n| 3 Can Quaker Oats            |          |            |       |\n| 9 x Corned Beef              |          |            |       |\n| Paul's Choice Clam & Scallop |          |            |       |\n| 2 Pint Pudding               |          |            |       |\n| 5 Can #13 Brunswick          |          |            |       |\n| 10 lb Rice                   |          |            |       |\n| 10 yd Tape                   |          |            |       |\n| 20 yd 1/8 Barren             |          |            |       |\n| 30 yd 5/8 Barren             |          |            |       |\n| 2 Pint Butter                |          |            |       |\n| 2 Jimmy Plaid                |          |            |       |\n| 2 Mammoth Fork               |          |            |       |\n| 20 yd 200 Copper             |          |            |       |\n| 2 Art Appliance              |          |            |       |\n| 2 Box Matches                |          |            |       |\n| 2 Dozen Cards                |          |            |       |\n| 3 Pkg Envelopes              |          |            |       |\n\nTotal: $68.52\n| Description                        | Quantity | Unit Price | Total |\n|------------------------------------|----------|------------|-------|\n| 3 Can Cider & Powder               |          |            |       |\n| 9 @ Corned Beef                    |          |            |       |\n| Paul Neff's Choice                  |          |            |       |\n| 2 \" Minn. Pecans                   |          |            |       |\n| 5 Can O & P Cranberries             |          |            |       |\n| 10 @ Bees                          |          |            |       |\n| 10 @ Sappo                         |          |            |       |\n| 30 @ 5 lb. Raisins                 |          |            |       |\n| 1 @ Green Peppers                  |          |            |       |\n| 1 @ Candy Platter                  |          |            |       |\n| 1 @ Marmalade                      |          |            |       |\n| 2 @ Bay Leaves                     |          |            |       |\n| 2 @ T. Fleming                     |          |            |       |\n| 2 @ Mrs. Franklin                  |          |            |       |\n| 2 @ Mrs. Macintosh                 |          |            |       |\n| 2 @ Lillian Reed                   |          |            |       |\n| 2 @ Peggy Smith                    |          |            |       |\n\nTotal: $18\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Patron\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may prove impossible for you to answer, so don't worry about answering blank spaces. The experience of others or of those who have lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Pioneers: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ). And one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.,\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the Person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Impossible for you to answer, so don't worry about getting all the answers. The only thing we need is your personal experience. We want to hear what you did.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether or not they were born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did Western Canadian Pioneers Know?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life: What Would You Like to Know?\" will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan\nSaskatoon, Sask., S7N 5E6\n1. Your full name: Spencer, P.H.S.\n\n2. Your address: 18448 Hornsby Street, Victoria, B.C.\n\n3. Date: July 19th, 1958\n\n4. Where were you born? (Give name of place and country) St. Bottegall, England\n\n5. What was your father's name and occupation? Dr. Arthur Parrot, M.D.\n\n6. When did you come to Saskatchewan? (Give month and year) Sep. November, 1912\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. At Picton, Ontario, 1856 in Gordon St., 1871-1872.\n\nI've lived over Edmonton, Alberta, in year 1872, in Alberta.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it as a small talker.)\n\nI was 22 years old.\n\n9. What were your reasons for coming West?\n\nIn order to make a living.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThrough my friends and my own interest in reading.\n1. Your full name: Spencer, P.H.Y.S.\n\n2. Your address: 1448 Broomfield Street, Sudbury, P.E.\n\n3. Date: July 19th, 1958\n\n4. Where were you born? (Give name of place and country) At Botesdale, Suffolk, England\n\n5. What was your father's name and occupation? Dr. Henry Parry M.D.\n\n6. When did you come to Saskatchewan? (Give month and year) Sep. November / 1872\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. At Picton Lake, P.S.C. in Ontario, 1871-1872\n\n8. How old were you when you first came to Bannock County? (You do not need to answer this question if you were under 18 years of age at that time)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nMy own initiative in reading about the country.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were well contented and gave their testimony at the meeting.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? With a brother.\n\n13. What means of transportation did you use? Steamship, train, and horse stage during the latter part of the journey from Spence Butte, B.C., to Ogden, Idaho.\n\nII. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nWe used steamship and horseback for the accommodation. We stopped at the town and temporary hotel at Spokane, Washington, B.C., while the arrangements for the immigrants of our company were made. All passengers of Spencer Butte were situated on C.P.R. some saying they were afraid of the Indians.\n\n14. How did you earn a living before coming to Western Canada? How after you came?\n\nThere was no opportunity to do so. By living in Canada he was obliged to dependant on the kindness of cattle and horses.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were well contented and gave their testimony at the meeting.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? With a brother.\n\n13. What means of transportation did you use? Steamship, Train, and Horse stage coach. The latter part of the journey from Spence Bridge, BC to Regina, Saskatchewan.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). We used 5 ton oxen and horses for the accommodation. We stopped at the town and two more hotels at Spence Bridge, BC, where we had accommodations for the accommodation. Of course, there were places still further west.\n\nSpence's Bridge is situated on C.P.R., some saying builder silent of Hamilton.\n\n15. Where did you first stay when you arrived in Saskatchewan? At Regina.\n\n16. Where did you settle or take up land? North of the present day town of Assiniboia.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nThere was no opportunity to do so.\n\nBy driving in Canada he always had employment on the raising of cattle and horses.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage:\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What was your first occupation? Also a description of your work at that time.\n\n26. Any other comments or observations you would like to make?\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. What kind of games or pastimes did you engage in?\n25. When was the first car used in the community? [Answer: 1905]\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to raise there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy by this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. When did you first have a telephone and who provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? Then did you make this decision?\n25. When was the first car used in the community? [March 1905]\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? [Trade Center]\n\n28. Did you continue to use them? (Indicate any changes due to new forms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? [Bi-weekly in summer]\n\n30. When (if ever) did people in your district start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy? In this way indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you cease to subscribe to newspapers? The first time was it with the idea of staying\n\npermanent? Or did you make up your mind after trying it out? How did you\n\nmake this decision?\n\n[Signature]\n34. Did any people who came from your district prior to 1917 settle in your district? If so, when did they come?\n\n35. Did any family members live in the 1820s or earlier? If so, where did they live?\n\n36. If you or any member of your family have held public office, mention it here, giving dates wherever possible.\n\n37. If you or any member of your family were involved in any organizations, mention it here, giving dates wherever possible.\n\n38. How old is the town of Southfield? What is its origin?\n35. Did many people move away from your district prior to 1914? Did many return?\n\n36. If you or some member of your family have held public offices, give dates whenever possible.\n\n37. If you or any of your family or friends were forced to have or do something in the district mention it here. Give dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) origin, and meaning of the name, (3) date of its adoption, (4) change in name since the first name was given, (5) date and reason for change. Give facts of new names as above in (1), (2), (3).\n\n39. Turn a Southern School into a sound school of self-supporting pupils.\n34. Did any people move away from your district prior to 1911? What reasons did they have for moving?\n\n35. Did any members of your family have held public offices or have been active in any organizations? Mention it here, giving dates wherever possible.\n\n36. If you or any member of your family were killed in battle, mention it here, giving dates wherever possible. (Such as casualty lists.)\n\n37. If you or any member of your family were killed in battle, mention it here, giving dates wherever possible. (Such as casualty lists.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) origin of name, (3) date of adoption, (4) any changes in names since the first name was given, (5) date and reason for change.\n\nThe Town of Sandford, so called from Sandford Hall at the east end of the Cotswold Hills, a distance of 20 miles southwest of the Great National Boundary marker located by Mr. Smith, 40 feet west of the boundary line between Worcestershire and Herefordshire. The town was named after Sandford Hall, which was built in 1892 by Sir Richard Burton, who was born there.\n\nFrom Sandford Hall, 1 mile.\nDo you have any questions regarding historical materials?\n\nIf so, please list them below:\n\n1. Are there any photographs or documents related to your research?\n2. Do you need assistance with any specific tasks?\n3. Would you like to attend any upcoming events or workshops?\n\nPlease provide your contact information:\n\nName:\nEmail:\nPhone:\nAddress:\n\nThank you for your cooperation!\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archives for temporary use?\n\n(2) be willing to present them to the Archives either in their original condition or in a condition that would make them more useful to researchers?\n\nIf so, please provide the following information:\n\nName:\nAddress:\nPhone number:\nEmail address:\n\nIf not, please explain why.\n\nPlease give the names and addresses of other persons who could serve as witnesses.\n\nWitnesses:\n\nSignature:\nDate:\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nSignature:\nDate:\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nIf so, please provide the following information:\n\nName:\nAddress:\nPhone number:\nEmail address:\n\nIf not, please explain why.\n\nPlease give the names and addresses of other persons who could serve as witnesses.\n\nWitnesses:\n\nSignature:\nDate:\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nSignature:\nDate:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892H-Z_542.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 42, "total-input-tokens": 69720, "total-output-tokens": 6158, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 0, 7], [0, 0, 8], [0, 154, 9], [154, 315, 10], [315, 315, 11], [315, 315, 12], [315, 315, 13], [315, 315, 14], [315, 315, 15], [315, 315, 16], [315, 315, 17], [315, 315, 18], [315, 1050, 19], [1050, 1628, 20], [1628, 2286, 21], [2286, 2286, 22], [2286, 3536, 23], [3536, 4899, 24], [4899, 6587, 25], [6587, 8403, 26], [8403, 9363, 27], [9363, 10198, 28], [10198, 11289, 29], [11289, 12628, 30], [12628, 13452, 31], [13452, 14167, 32], [14167, 15141, 33], [15141, 16174, 34], [16174, 16674, 35], [16674, 17432, 36], [17432, 18654, 37], [18654, 18654, 38], [18654, 19031, 39], [19031, 20101, 40], [20101, 20256, 41], [20256, 20410, 42]], "primary_language": ["None", "None", "None", "None", "None", "None", "None", "None", "en", "en", "None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, true, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]