[{"id": "f2083f8f15ea44ef2d276ec59e90c2ca214de62e", "text": "S-X2\n602. Wilson Annie F. (Mrs. George)\nS-X2\n602. Wilson Annie F. (Mrs. George)\nWilson, Mrs. Annie F.,\nRooanville.\n\nTo Sask. - April, 1892\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person submitting his questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experience; others may be impossible for you to answer, so don't worry if they seem to you to be irrelevant. If there is something in particular that you would like to say about your experiences, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for separate questionnaires.\n\nOther Questionnaires:\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nWestern Saskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaire:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nWilson, Mrs. Annie F.\nRoognville.\n\nTo Sask. - April, 1892\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNo. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\nA brief explanation of the Fragen\nANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences and may seem impossible for you to answer, so don't worry about answering every statement. Don't let absence of detail affect your answers; if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Really Think?\" still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires X\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nWilson, Mrs. Annie F.\nHoogerville.\n\nTo Sask., April 13, 1899\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNo. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ...............................................................\n2. Your address ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to western Canada? (If under sixteen years of age, give age.) ...............................................................\n9. What were your reasons for coming West? ...............................................................\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) ...............................................................\n\nI answered an advertisement in a newspaper.\nWilson, Mrs. Annie F.\nRouynville.\n\nTo date - April 1959\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have it written, please say so. If you rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name ... Mrs. Annie F. Wilson\n2. Your address ... Rouynville, Ont.\n3. Date ... April 1959\n4. Where were you born? (Give name of place and country) Ontario, Canada\n5. What was your father's name and occupation? George Wilson\n6. When did you come to Saskatchewan? (Give month and year) April 1899\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you are under 18 years of age.\n9. What were your reasons for coming West? To earn a living.\n10. How did you learn about the West? Through advertisements in newspapers.\n\nI answered an advertisement in a newspaper.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were opposed to my coming.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? I traveled by myself.\n\n13. What means of transportation did you use? I came on the C.P.R. to Moose Jaw, from there by train and homestead cutter with a neighbor from a nearby district.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nI remember distinctly nothing off the train at Moose Jaw at about 8 a.m., and inquiring if there was anyone from Regina district to meet me. A Mr. Smith then editor of \"The World Spectator,\" a former teacher and his wife took me to Queen's Hotel for the night. He found a ride for me to Regina next day. I think he was Mr. Smith afterwards a member of parliament.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI boarded at the house of Mr. Smith.\n\n16. Where did you settle or take up land?\n\nI went back to Ontario the first winter returning in spring.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a teacher and I taught school for two summers in Regina district. School was closed in the winter then.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were opposed to my coming.\n\n12. Did you travel by yourself or with a party (family, friends or others)?\n\n13. What means of transportation did you use? CPR to Moose Jaw, from there by train and homestead cutter with a neighbor from a nearby district.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the trail, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI was a teacher and I taught school for two summers in Preeceville district. School was closed in the winter then. I went back to Ontario the first winter returning in spring.\n19. How often did you write to relatives or friends at your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nMy brother came but went back\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOnce event stands out particularly\n\nA lady neighbor and I and my little son went to Wapella one fall day to do some shopping. We had only Indian trail or roads then. Coming from our house a trusty driver, became frightened by the sight of the dark miles from home where turned up about dark miles from home where an upright family kept us all night and started us on the right road next day.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far?\n\nWe were 15 miles from Wapella our nearest town. We shopped about once a month in summer and in winter my husband did most of the shopping—our strawberries did not need to send out dozens' worth. Mr. Hanson used to send us a very nice gift when we were married! You often visited neighbors even in winter. Sometimes our neighbor with\n19. How often did you write to relatives or friends at your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy brother came back.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n\nTell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOne event stands out distinctly.\n\nA lady neighbor and I and my little son went to Wapella one fall day to do some shopping. We had only Indian family in town then. Coming from our house, a trusty driver, became frightened of some ship and took the wrong turn. We turned up about dark miles from home where an orphan family slept all night and started us on the right road next day.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nHow far? By what means of travel?\n\nWe were 15 miles from Wapella our nearest town. We shopped about once a month in summer and in winter my husband did most of the shopping—our storekeeper Mr. Guancho used to send out dairies' skirts so for me to choose. This same Mr. Guancho sent us a very nice gift when we were married. We often visited neighbors even in winter. Sometimes we walked with\n25. If you owned a car before 1914, when did you buy it? What make?\n\n26. If you think it was almost 1914, A. Pic Sacklin\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n\n29. How often did you shop in the early days? About once or twice a month\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of settling permanently? Or did you make up your mind after trying it out? I thought about 1914.\n\nI did not intend to stay in Saskatchewan.\n25. If you owned a car before 1914, when did you buy it? That makes?\n\n26. Think it was almost 1914. A year back.\n\n27. Where was your trading center? How far from your home?\n\n28. Did you own land to go there? (Indicate any changes due to new terms appear-\n\ning, better means of travel, etc.).\n\n29. How often did you shop in the early days? About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also who provided\n\nyour total purchases were by mail order or any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of stay-\n\ning permanently? Or did you make up your mind after trying it out? When all the\n\nthoughts about 1914\n\nI did not intend to stay in\n\nSaskatchewan.\n5.\n\n34. Did any people move away from your district prior to 1916? What reasons did they have for moving?\n\n35. Did anyone move away during 1916? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was secretary for our Mormon Missionary Society of the Baptist church for two years about 1916.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) origin and meaning of the name; (2) date of its adoption; (3) date and reason for change. Give facts of her name or after its first victory.\n\nOur school district was named after Mr. Brown and the town was called after Mr. Brown's son. The first post office was called Brownville; the first school was called Brownville and our district is still Brownville. Our first school was built in the province. It is 3½ miles from the town.\n35. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nJuras auxiliary for our Moravian Missionary Society of the Presbyterian church for two years about 1916.\n\n36. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to state if the name was given at the time of settlement, or if there were any changes in names since then. Give date and reason for change. Use only one line for each place name.\n\nOur school district was named after Mr. Roan and the town was called after Mr. Roan Bastin; the first Post master so Roanville; the first school was called Roanville No. 2; one of our district is still Roanville No. 2; one of the first schools in the province; the school is 3½ miles from the town.\n39. Questions regarding historical source materials:\nDo you have any historical materials such as diaries, old letters, old photographs, written recollections, or reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any) ………………\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n1. The improvement in roads\n2. The telephone\n3. The hydro\n4. The automobiles\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. Lawrence Kelly, Rostamville Ranch\n6. Questions regarding historical source materials:\n   Do you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n   (Indicate your preference, if any) ……………………..\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. That do you think are the most important changes in your community since you first came here?\n\n1. The improvement in roads\n2. The telephone\n3. The hydro\n4. The automobiles\n\nPlease give the names and addresses of other persons who may be able to assist us in this questionnaire. For your convenience, please have this question answered by Mr. Lawrence Kelly, Rosamills, Saskatchewan.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_602.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4786, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 40, 3], [40, 80, 4], [80, 2047, 5], [2047, 3974, 6], [3974, 5563, 7], [5563, 6685, 8], [6685, 8094, 9], [8094, 9027, 10], [9027, 10438, 11], [10438, 11855, 12], [11855, 12661, 13], [12661, 13706, 14], [13706, 14939, 15], [14939, 16157, 16], [16157, 17062, 17], [17062, 18158, 18], [18158, 18313, 19], [18313, 18467, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]