[{"id": "18043a2696dc2e8ce6286389a5050557f5acd7c2", "text": "Instructions: Fill in as much of this questionnaire as you can and will it be submitted to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Saskatchewan.\n\nName: Mrs. Emma H. Becker\nAddress: Broadwell, Saskatchewan\nBirthplace: Crystal City, Missouri\n\n1. INTRODUCTION\n\nWhat year did you start housekeeping in eastern Canada? 1907\nWhere did you set up housekeeping? In Manitoba\nWhere had you been living before that? In Manitoba\nFor how many people did you prepare meals? From two to twenty\nHow far was it to your nearest store? Small store, two miles\nHow often could a visit be made to the store? Occasionally\nWhat groceries did you usually buy in those earliest years? Only those needed. Bread, flour, cornmeal, rolled oats, sugar, salt, the bare necessities.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Lake & The Woods Flour, Ogden's Royal Household\nIn what quantities did you buy it? From 100 lbs. each to 100 lbs.\nWhat was the usual price per hundred pounds of white flour? About $1.35\nHow much did you use groats flour? Very little\nWhole wheat flour? Very little\nWas flour milled locally? Yes, how far away? 1 mile that year? 1917\nWhat was the price for a twenty pound bag of rolled oats? ?\nWhat other grain products did you use?\nCornmeal? Yes, Whole wheat? Farina?\nOther?\nDid you grind your own oatmeal for porridge? Yes\nHow did you grind it? With the chopper we used to chop grain for stock. It was put through the chopper two or three times, to make it fine enough.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? From 5 lbs. to 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 58¢ per lb.\n\nWhat brand of golden corn syrup did you use? Rogers Edwardsburg.\n\nWhat size of tin of syrup did you usually buy? From 6 oz. to 2 lb.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? We had our own cows.\n\nButter? Made our own.\n\nEggs? Had our own hens.\n\nWhat was the price of butter? 15¢ per lb.\n\nDid you pack eggs for winter? Yes, always.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\nWhat kind of cheese? Cheddar cheese, also years old.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, pork, and fowl.\n\nHow did you get fresh meat? There were butchers who came through the country selling fresh beef and pork.\n\nHow often did you get fresh meat? About once a week.\n\nHow did you preserve meat? By the salt and sugar way, and by freezing during putting in glass vats, canning.\n\nWas there a \"beef ring\" in your neighborhood? Sometimes.\n\nIf so what year was it organized? About 1917.\n\nDid you use game? No.\n\nFor how long?\n\nThat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned? Some fresh, some canned.\n\nKinds? Canned salmon, fresh white fish, pickled fish, smoked.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) Both ways. Price? .............. What other beverages were used? .................\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? .............. Could you get potatoes at the store? ..............\nIf not, where from? ...............................................................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1917. Cabbage .......... Carrots .......... Onions ......\nTurnips .......... Beets ..........\nIn what quantities did you buy white navy beans? ..............\nHow did you buy prunes, (in bulk or by the box)? Both ways.\nWhat weight? .......... How did the grocer handle prunes (by box)? Box.\nWhat was the price of prunes? ..............\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\nWe used all these when they could be had, but in small quantities.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes.\nPeas? Yes. Corn? Yes. Beans? Yes. Saskatoons? ..............\nOther foods? ...............................................................\nWhat year did you first preserve fruit by canning? ..............\nWhat year did you first preserve vegetables by canning? ..............\nWhat year did you first preserve meat by canning? ..............\nDo you still preserve foods by canning or drying? Yes.\nTo what extent? For our own use.\nDid you make your own vinegar? Yes.\n6. **BUYING**\n\n   - What kind of tea did you buy?  \n     - Red Rose  \n     - Black Tea  \n     - Other (specify)  \n\n   - At what price?  \n     - $1.50 per lb.  \n     - $2.00 per lb.  \n     - Other (specify)  \n\n   - How much did you buy?  \n     - 1 lb.  \n     - 2 lbs.  \n     - Other (specify)  \n\n7. **VEGETABLES AND DRIED FRUITS**\n\n   - What was the price of potatoes per bushel?  \n     - $1.50 per bushel  \n     - $2.00 per bushel  \n     - Other (specify)  \n\n   - Could you get potatoes at the store?  \n     - Yes  \n     - No  \n\n   - If not, where from?  \n     - Other (specify)  \n\n   - What year did you first grow your own supply for the winter of?  \n     - 1947  \n\n   - Potatoes  \n     - Carrots  \n     - Turnips  \n     - Cabbage  \n     - Beets  \n     - Onions  \n\n   - In what quantities did you buy white navy beans?  \n     - 1 lb.  \n     - 2 lbs.  \n     - Other (specify)  \n\n   - How did you buy prunes, (in bulk or by the box)?  \n     - Bulk  \n     - Box  \n\n   - What weight?  \n     - 1 lb.  \n     - 2 lbs.  \n     - Other (specify)  \n\n   - Time did the grocer handle prunes?  \n     - Yes  \n     - No  \n\n   - What was the price of prunes?  \n     - $1.50 per lb.  \n     - $2.00 per lb.  \n     - Other (specify)  \n\n   - What other dried fruits did you use in the earliest days?  \n     - Apples  \n     - Pears  \n     - Peaches  \n     - Raisins  \n     - Other (specify)  \n\n8. **PREPARING**\n\n   - In the early years did you prepare any foods by drying?  \n     - Yes  \n     - No  \n\n   - Juice  \n     - Yes  \n     - No  \n\n   - Other foods?  \n     - Yes  \n     - No  \n\n   - What year did you first preserve vegetables by canning?  \n     - 1947  \n\n   - What year did you first preserve meat by canning?  \n     - 1947  \n\n   - Do you still preserve foods by canning or drying?  \n     - Yes  \n     - No  \n\n   - To what extent?  \n     - Yes  \n     - No  \n\n   - Did you make your own vinegar?  \n     - Yes  \n     - No\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                  |                                   |                     |\n| Macaroni              |                                               |                                                  |                                   |                     |\n| Graham flour          |                                               |                                                  |                                   |                     |\n| Brown sugar           |                                               |                                                  |                                   |                     |\n| Molasses              |                                               |                                                  |                                   |                     |\n| Table salt            |                                               |                                                  |                                   |                     |\n| Common salt           |                                               |                                                  |                                   |                     |\n| Lily white syrup      |                                               |                                                  |                                   |                     |\n| Toilet soap           |                                               |                                                  |                                   |                     |\n| Baking powder         |                                               |                                                  |                                   |                     |\n| Baking soda           |                                               |                                                  |                                   |                     |\n| Dried peas            |                                               |                                                  |                                   |                     |\n| Dried corn            |                                               |                                                  |                                   |                     |\n| Vinegar               |                                               |                                                  |                                   |                     |\n| Raisins - seeded      |                                               |                                                  |                                   |                     |\n|                      |                                               |                                                  |                                   |                     |\n| Raisins - seedless    |                                               |                                                  |                                   |                     |\n| Rice                  |                                               |                                                  |                                   |                     |\n| Currants              |                                               |                                                  |                                   |                     |\n| Store jam - kinds?    |                                               |                                                  |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? The Dried Yeast Co., Royal Yeast\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nUsing hops? No\n\nSalt rising?\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                |\n| Canned sardines             |                                        |                               |                                                |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                                |\n|                             | dried                                  |                               |                                                |\n| Lettuce                     |                                        |                               |                                                |\n| Tomatoes - fresh            |                                        |                               |                                                |\n|                             | canned                                 |                               |                                                |\n| Bananas                     |                                        |                               |                                                |\n| Lemons                      |                                        |                               |                                                |\n| Oranges                     |                                        |                               |                                                |\n| Cornflakes                  |                                        |                               |                                                |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                                |\n| Minute tapioca              |                                        |                               |                                                |\n| Sago                        |                                        |                               |                                                |\n| Dates                       |                                        |                               |                                                |\n| Walnuts                     |                                        |                               |                                                |\n| Icing sugar                 |                                        |                               |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ........... Good wells both hard and soft water.\n\nHow far was this water from your home? ............. Some times not with house and some times some little distance away.\n\nHow was it brought to the house? (pail, barrel, tank) ............. Pail.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAP\n\nDid you buy laundry soap or make your own? ____________________________\nIf you made your own, did you use lye? ____________________________\nWhat kind of laundry soap did the grocer handle? ____________________________\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ____________________________\nWhere did you get your fuel? ____________________________\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ____________________________\nDid you use an outdoor fireplace or bake oven? (Give dates) ____________________________\n\nBy whom was your first cook stove made? ____________________________\nWhat year was it purchased? ____________________________ Price? ____________________________\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ____________________________\nFor preparing food? (china, earthenware, wooden bowls, other) ____________________________\nWhen did you first see enamel ware? ____________________________\nAluminum? ____________________________\n13. Soaps\n\nDid you use any soaps or detergents?\n\nIf so, what were they?\n\nIf not, why not?\n\n14. Fuel\n\nThat fuel did you use in an electric lamp? (List and total)\n\nWhat fuel did you use last year? (List and total)\n\nHave you noticed any changes in the use of fuels which have taken place since you first started housekeeping, either during the past year?\n\n15. Types of Cookers and Types of Utensils\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made?\n\nWhat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preserving food? (china, earthenware, wooden bowls, other)\n\nAluminum?\n16. **Wrappings and Containers**\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? .................. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n17. Giving a Supper/Day's meal (breakfast, dinner & supper) for the family.\n\n18. That you did you serve your first Christian dinner in another family.\n\n19. Were you ever refused to almost starvation level living on one or two local food products? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nIn the early day I think we really had more substantial meals. I mean, meat, potatoes and other vegetables, and the old fashioned Rice Pudding baked in the oven with good fresh cows milk and such like. No little milk snacks such as different kinds of salads and fancy cooking and we always had hot porridge as we called it, Rolled Oats, Oatmeal, Cornmeal or ground wheat cooked. There was no option when our porridge was cooked we ate it and said nothing (This was in my Father's time).\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nI never did rely on purchased foods, and I cooked and made my own. Only such things as Salt, Sugar, B. Powder & R. Soda, pepper and such like.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nIn the early days I think we really had many substantial meals. I mean, meat, potatoes and the vegetables, and the old fashioned rice pudding baked in the oven with good fresh cows milk and such like.\n\nWe didn't rush much, and we always had hot porridge and fancy eating, and we always had something (I say something) when we got up, and we always had something (I say something) when we went to bed.\n\nAnd so on.\n\nB. Pudding & Rice, pepper and onion.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12938_1907A-L_213.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4311, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1552, 5], [1552, 1552, 6], [1552, 2874, 7], [2874, 2874, 8], [2874, 4498, 9], [4498, 6407, 10], [6407, 11009, 11], [11009, 11009, 12], [11009, 14599, 13], [14599, 14599, 14], [14599, 15813, 15], [15813, 16579, 16], [16579, 17267, 17], [17267, 17528, 18], [17528, 18757, 19], [18757, 19208, 20], [19208, 19208, 21], [19208, 19362, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]