[{"id": "069d86212623386b868b88dd1ec5617eabe34b28", "text": "When looking through an old scrapbook one day recently A. T. Turner, manager of the Monarch Lumber Company, ran across the following article which should be of interest to many readers of this newspaper. It was taken from the North West Territories Gazette, Regina, published on Monday, June 19, 1905, just before the Province of Saskatchewan was formed.\n\nNotice is hereby given in accordance with the provisions of the School ordinance in that behalf that by order of the Commissioner of Education the following lands, namely: Sections 8, 9, 10, 11; 14, 15, 16, 17; 20, 21, 22, 23; 26, 27, 28, 29; 32, 33, 34 and 35 in Township 31, Range 25, west of the second meridian, have been erected into a school district under the name of the Manual School District No. 1334 of the North West Territories.\n\n(Signed) J. A. Calder,\nDeputy Commissioner of Education.\n\nThe first three trustees elected were: T. N. Bjorndahl, for a term of three years; A. Wilde, 2 years, and R. Thomas, 1 year. T. N. Bjorndahl was appointed secretary-treasurer and A. Wilde, chairman, at the first meeting of the Board. The Board agreed that we pay $12 per M feet for hauling lumber to erect a schoolhouse, from either Davidson or Humboldt. The schoolhouse to be 14 x 24 xg, with four windows and one door. $500 in debentures were issued for the cost of the school. The contract for building the school was awarded to A. M. Skevik who submitted the lowest bid, $43.00.\n\nIn July, 1905, L. A. Pearson was engaged to teach in the school at $45 per month.\nWhen looking through an old scrapbook one day recently A. T. Turner, manager of the Monarch Lumber Company, ran across the following article which should be of interest to many readers of this newspaper. It was taken from the North West Territories Gazette, Regina, published on Monday, June 19, 1905, just before the Province of Saskatchewan was formed.\n\nNotice is hereby given in accordance with the provisions of the School ordinance in that behalf that by order of the Commissioner of Education the following lands, namely: Sections 8, 9, 10, 11, 14, 15, 16, 17; 20, 21, 22, 23; 26, 27, 28, 29; 32, 33, 34 and 35 in Township 31, Range 25, west of the second meridian, have been erected into a school district under the name of the Mandal School District No. 1334 of the North West Territories.\n\n(Signed) J. A. Calder,\nDeputy Commissioner of Education.\n\nThe first three trustees elected were: T. N. Bjorndahl, for a term of three years; A. Wilde, 2 years, and R. Thomas, 1 year. T. N. Bjorndahl was appointed secretary-treasurer and A. Wilde, chairman, at the first meeting of the Board. The Board agreed that we pay $12 per M feet for hauling lumber to erect a schoolhouse, from either Davidson or Humboldt. The schoolhouse to be 14' x 24' x 8', with four windows and one door. $500 in debentures were issued for the cost of the school. The contract for building the school was awarded A. M. Skevik who submitted the lowest bid, $43.00.\n\nIn July, 1905, L. A. Pearson was engaged to teach in the school at $45 per month.\nThis Space May be Used for Correspondence\n\nADDRESS TO BE WRITTEN ON THIS SIDE\n\nMay the heart be\n\nArchives Office\n\nUniversity of Idaho\n\nTo central village, situated on the\n\nAbout 1 mile west of present town of Wallace,\n\nIn foreground is seen\n\nC. P. R. R. Grade as well as\n\nStill under construction, 1908; at\n\nWhich the village of\n\nMandal was moved to\n\nIts new tourist's callix\n\n\"Wallace\"\n\nS.B.\nMandal Village grew up on the homestead of T.H. Goodall.\n\nAbout 1 mile west of present town of Watsons.\n\nThis Space May be Used for Correspondence\n\nIn foreground is seen C.T.P.R.R. grade on which steel was laid 1908, at which time village of Mandal was moved to new townsite called \"Watsons.\"\n\nS.B.\n\nADDRESS TO BE WRITTEN ON THIS SIDE\n\nMay be kept by:\n\nArchives Office,\nUniversity of Saskatchewan,\nSaskatoon.\nMandal Village grew up on the homestead of T. H. B. Gondall.\n\nAbout 1 mile west of present town of Watson.\n\nThis Space May be Used for Correspondence\n\nIn foreground is seen C.T.F.R.R. grade on which steel was laid 1908, at which time village of Mandal was moved to new townsite called \"Watson.\"\n\nS.B.\n\nADDRESS TO BE WRITTEN ON THIS SIDE\n\nmay be kept by:\n\nArchives Office,\nUniversity of Sask.,\nSaskatoon.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA work of examination to the period answered by this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you, so don't worry about answering them. If there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in their province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you are willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Mrs. A.M. Bjorndahl\n2. Your address: Matiasco, Idaho, U.S.A.\n3. Date: 4/7/1958\n4. Where were you born? (Give name of place and country) Norway\n5. What was your father's name and occupation? Farmer\n6. When did you come to Saskatchewan? (Give month and year) November 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - Norway\n   - Idaho\n   - Matiasco\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" or \"I was in my teens,\" etc.) About 19 years\n9. What were your reasons for coming West?\n   - Our reason to pick up a homestead\n\nX. How did you learn about the West? (Through other people? Reading about it?)\n\nB. Through friends, through other people\n1. Your full name: Mr. & Mrs. Bjornsdottir\n\n2. Your address: [illegible]\n\n3. Date: [illegible]\n\n4. Where were you born? (Give name of place and country) [illegible]\n\n5. What was your father's name and occupation? [illegible]\n\n6. When did you come to Saskatchewan? (Give month and year) [illegible]\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child.\")\n\n9. What were your reasons for coming here?\n\nOur reason to pick up a homestead.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nBoth reading, through other people.\n11. What did your friends and relatives think or your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? (By train, auto, etc.)\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel with your family or alone? If so, how many people were in your group?\n\n13. What means of transportation did you use? By train, by horse, by foot?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. The mail route to Prince Albert was delivered by horseback. How often did you receive mail?\n\n19. How did you earn your living before coming to Western Canada? How about your family?\n\n20. How did you feel about living in a prairie province?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any memory which stands out?\n\n24. Did you ever visit friends in the district?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Salt Lake because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell them why they came and where they settled.\n\n23. Is there any memory which stands out in your mind?\n\n24. Did you ever visit the place where your parents lived?\nMost of the people thought it was cold enough there without going farther north. Some of our friends asked us, \"Why go up to the Klondike to freeze?\" They razzed us about the cold in every letter until midwinter. Then we found a butterfly outside amongst our packing crates during a mild spell in February. We wrote and asked them if they could match that! We never heard another word about the Klondike.\n19. How often did you write to relatives or friends in your old home? About once a month to friends & relatives.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. We were married before we came here and our little boy was one year old.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Two or three families - friends from North Dakota.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. They came shortly after we came here & homesteaded in the district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? Most all of the buildings were made of sod. The walls 2½ feet thick. The homes had board ceilings & floors, window sashes & doors. Inside walls were plastered & whitewashed. Warm & cozy inside but not much to look at outside - just black soil. At first there were very few families to compare with the number of bachelors. Needless to say Mrs. Bjornsdahl's mother, Mrs. Anna Johnson, were especially overjoyed with the arrival of every new bride into the district. It not only broadened social life but increased the demand for bread making which often amounted to 20 loaves a day for three two-roomers - no bake shops then.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? We went back to the States a few times by train the first two times, and later by car. Partly pleasure & business.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to report?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n25. When was the first car used in the community? 1910.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   1910 IHC (International)\n\n27. Where was your trading center? How far from your home? Coventry store 1905\n   in our home at Mandal. Supplies brought by horse wagon from Davidson & Humboldt (57 miles).\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In 1908 when the G.T.P.R.R. was completed Mandal P.O. village was moved about 1 mi. east & new townsite named \"Watson.\" Our store was moved to Watsons, was enlarged, and was the first general store in town.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Gradually as automobiles replaced the horse & buggy.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We ordered thru mail order cats. the first year we arrived at Mandal. Ordered mostly seed goods & fancy trimmings.\n   Very little ordering by mail now - go to city (Saskatoon) for big shopping.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   No, we intended to go back to our home in N.Dak. as soon as we could prove up our homestead, but we enjoyed living here, got deeper into business and the time never seemed to go by fast.\n25. When was the first car used in the community? 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? (Indicate any changes due to new towns appearing.)\n\n28. Did you own time to trade things? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you come here?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes, many moved away during the drought season. Some returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI own something you've got. History of our district where it began was given. This information.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nI own something you've got. History of our house with Mr. Bjornstad sitting in his car, one of the first ones in town. I think bought in 1911.\n\n(see snapshot enclosed)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (date and reason for change). Give facts of new name as above in (1), (2), (3).\n\nMr. Bjornstad's name was changed so into the reason he named it Mondele. More information in the early history of Montana. (copy enclosed)\n\nManton Lake - named by Indians\n34. If any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did any member of your family have had public office, or have been elected to any office in the district? If so, give name, position held, date elected, and date left office.\n\n36. If you or any of your family or friends were \"inured\" to have or do something in the first automobile, compare it here giving dates whenever possible. (Such as owning the first automobile, owning the first automobile, owning the first automobile, etc.)\n\n37. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and location of place-name; (2) origin and meaning of the name; (3) date of adoption; (4) any change in name since the first name was given; data and reason for change. Give facts of new name as above in (1), (2), (3).\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and location of place-name; (2) origin and meaning of the name; (3) date of adoption; (4) any change in name since the first name was given; data and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nYes, enclosing copy of \"Early History of Town of Watson.\"\n\nCopy of \"Watrous School Souvenir 1912-1913\"\n\nSeveral picture postcards of early days.\n\nPlease return same.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n2 sons + 1 daughter, 6 grandchildren\n\nMorris Bjornsdall, Watson, Sk., (T.N.B. mechanic)\nMyron Bjornsdall, Watson, Sk., (farm implement)\nJohn Bjornsdall, Winnipeg, Radio engineer\nAdeline Smith, Ottawa, husband with RCAF\n\n41. What do you think are the most important changes in your community since you first came West?\n\n______________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI'm sorry I didn't get the answers in before and afraid it's too late now. I may be able to pick up a few more names if not too late.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here: completed by daughter Adeline\n\nMrs. J.O. Smith\n214 Alvin Road,\nOttawa, Ont.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, written recollections and reminiscences (Please list):\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nSignature: ___________________________ Date: ________________\nEARLY HISTORY OF THE TOWN OF WATROUS\n\nOn the 11th day of November, 1903, three young men, B.B. Haaland, T.N. Bjorndahl and T. Odne, journeyed out from Davidson, Saskatchewan, by democrat, to Manitou Lake, looking for homesteads. They found good land just south of the lake and decided to settle there. However the land was not open for filing on, so they returned to their homes in Edmore, North Dakota.\n\nThe next summer the land was opened for settlement and these men returned July 4th, 1904, built sod shacks into which their families moved in the fall. In the summer of 1904 much land settlement took place and homesteaders shacks dotted the countryside for miles round. A post office was the first necessity, the nearest one being 51 miles south-east (Davidson). Application was made to open a post-office by the name of \"Mandal\", and T. N. Bjorndahl was the first postmaster. The mail route was up from Regina, Lumsden, Strasbourg, Taylorborre, Peacock, Ridgeford, to Mandal. It is hardly possible for us to realize the difficulty and danger involved in hauling mail by horse team and democrat or lumber wagon through winter snows and spring thaws -- but the mail came through regularly, twice a week, via this route and means until the steel came through.\n\nThe village of Madal popped up like a mushroom. Mr. Bjorndahl opened a general store and blacksmith shop. The next spring Dr. J. H. White opened a drug store; J. J. Abraham and J. Elsworth opened a real estate office; OmN. Bjorndahl started a restaurant and butcher shop; the North American Lumber Company put in a lumber yard. A school board was soon elected with N. Thomas, R. Wildie, and T. N. Bjorndahl as trustees. The first term was held in a sod shack on the homestead.\n\nT. N. Bjorndahl, secretary-treasurer, made up the first school board. A. J. Gordon and Miss Dainard were teachers; attendance was approximately 60.\nEARLY HISTORY OF THE TOWN OF VANDALIA\n\nOn the 11th day of November, 1903, three young men, R.B., Harold, T.N. Bjornsdahl and T. Odeh, journeyed out from Davidson, Saskatchewan, by democrat, to Manitou Lake, looking for homesteads.\n\nThey found good land just south of the lake and decided to settle there. However, the land was not open for filing on, so they returned to their homes in Edmore, North Dakota.\n\nThe next summer the land was opened for settlement and these men returned July 4th, 1904, built sod shacks into which their families moved in the fall. In the summer of 1904, much land settlement took place and homesteaders shocks dotted the countryside for miles around.\n\nA post office was the first necessity, the nearest one being 51 miles southeast (Davidson). Application was made to open a post-office by the name of \"Vandalia,\" and T. N. Bjornsdahl was the first postmaster.\n\nThe mail route was up from Regina, Lumsden, Strasbourg, Taylorboro, Peacock, Ridgeway, to Vandalia. It is hardly possible for us to realize the difficulty and danger involved in hauling mail by horse team and democrat or lumber wagon through winter snows and spring thaws—but the mail came through regularly, twice a week, via this route and means until the steel came through.\n\nThe village of Vandalia popped up like a mushroom. Mr. Bjornsdahl opened a general store and blacksmith shop. The next spring Dr. J. H. White opened a drug store; J. J. Abraham and J. Elsworth opened a real estate office; O.M. Bjornsdahl started a restaurant and butcher shop; the North American Lumber Company put in a lumber yard. A school board was soon elected with Mr. Thomas, H. Wildie, and T. N. Bjornsdahl as trustees. The first term was held in a sod shack on the homestead.\n\nT. N. Bjornsdahl, Secretary-Treasurer, made up the first school board.\n\nA. J. Gordon and Miss Darnell were teachers; attendance was approximately 60.\nEARLY HISTORY OF THE TOWN OF WATROUS\n\nOn the 11th day of November, 1903, three young men, B.B. Haaland, T.N. Bjorndahl and T. Odne, journeyed out from Davidson, Saskatchewan, by democrat, to Manitou Lake, looking for homesteads. They found good land just south of the lake and decided to settle there. However the land was not open for filing on, so they returned to their homes in Edmore, North Dakota.\n\nThe next summer the land was opened for settlement and these men returned July 4th, 1904, built sod shacks into which their families moved in the fall. In the summer of 1904 much land settlement took place and homesteaders shacks dotted the countryside for miles round. A post office was the first necessity, the nearest one being 51 miles south-east (Davidson). Application was made to open a post-office by the name of \"Mandal\", and T. N. Bjorndahl was the first postmaster. The mail route was up from Regina, Lumden, Strasbourg, Taylorborre, Peacock, Ridgeford, to Mandal. It is hardly possible for us to realize the difficulty and danger involved in hauling mail by horse team and democrat or lumber wagon through winter snows and spring thaws -- but the mail came through regularly, twice a week, via this route and means until the steel came through.\n\nThe village of Madal popped up like a mushroom. Mr. Bjorndahl opened a general store and blacksmith shop. The next spring Dr. J. H. White opened a drug store; J. J. Abraham and J. Elsworth opened a real estate office; O.M. Bjorndahl started a restaurant and butcher shop; the North American Lumber Company put in a lumber yard. A school board was soon elected with R. Thomas, R. Wildie, and T. N. Bjorndahl as trustees. The first term was held in a sod shack on the homestead.\nEARLY HISTORY OF THE TOWN OF MATROUS\n\nOn the 11th day of November, 1903, three young men, B.B. Haaland, T. N. Bjornsdahl and T. Ohno, journeyed out from Davidson, Saskatchewan, by canoe, to Hanitou Lake, looking for homesteads. They found good land just south of the lake and decided to settle there. However the land was not open for filing on, so they returned to their homes in Minnesota, North Dakota.\n\nThe next summer the land was opened for settlement and these men returned July 4th, 1904, built sod shacks into which their families moved in the fall. In the summer of 1904, much land settlement took place and homesteaders shacks dotted the countryside for miles around.\n\nA post office was the first necessity, the nearest one being 51 miles southeast (Davidson). Application was made to open a post-office by the name of Matrous, and T. N. Bjornsdahl was the first postmaster.\n\nThe mail route was up from Regina, Lumsden, Strasbourg, Taylorboro, Peacock, Ridgeway, to Matrous. It is hardly possible for us to realize the difficulty and danger involved in hauling mail by horse team and democrat or lumber wagon through winter snows and spring thaws — but the mail came through regularly, twice a week, via this route and means until the steel came through.\n\nThe village of Matrous popped up like a mushroom. Mr. Bjornsdahl opened a general store and blacksmith shop. The next spring Dr. J. H. White opened a drug store; J. J. Abraham and J. Elsworth opened a real estate office; O.M. Bjornsdahl started a restaurant and butcher shop; the North American Lumber Company put in a lumber yard. A school board was soon elected with Mr. Thomas, R. Wildie, and T. N. Bjornsdahl as trustees. The first term was held in a sod shack on the homestead.\nof O. Førgaard, Leo Pearson engaged as teacher of the dozen or so children of school age. The first church was organized by the Norwegian Lutherans. Reverend Carl Norum, as pastor, preached the first sermon at the farm home of Hans Johnson.\n\nIn the fall of 1906 engineers came through, surveying for the Grand Trunk Pacific Railroad, what is now the main line of the C.N.R. transcontinental. In 1907 the grade was completed and the townsite of Watrous was surveyed one mile east of the village of Mandal (on the Homestead). This location was decided more adaptable for a railroad stop, hence the village of Mandal was \"moved\" and the name changed to \"Watrous\" by the Grand Trunk Pacific Railway Company — thus naming the town after one of their directors and keeping this divisional point in alphabetical order in the line.\n\nThe first man to build on the new townsite was Frank Keebler who put up a small shack for a harness shop on the east side of Main Street in the late fall of 1907. In the spring of 1908 the townsite of Watrous was put on the market and the town grew rapidly. The first church service was held in Hultgreen and Thurston's lumber yard, and conducted by the missionary minister, R. Surtice, who was shortly after replaced by Reverend Vessey of the Methodist Church. The first church erected was the Anglican; Reverend H. King took charge. The (Reverend John Mason, pastor), Norwegian Lutheran, and Presbyterian churches soon followed. School was opened in the Hiltz Building on 2nd Avenue and Main Street on December 1st., 1908. O.M. Holm, Harry Schlater, with T. N. Bjorndahl, secretary-treasurer, made up the first school board. A. J. Gordon and Miss Dainard were teachers; attendance was approximately 60.\nof O. Fergaard, Leo Pearson engaged as teacher of the dozen or so children of school age. The first church was organized by the Norwegian Lutherans. Reverend Carl Norum, as pastor, preached the first sermon at the farm home of Hans Johnson.\n\nIn the fall of 1906 engineers came through, surveying for the Grand Trunk Pacific Railroad, what is now the main line of the C.N.R. transcontinental. In 1907 the grade was completed and the townsite of Matrous was surveyed one mile east of the village of Mandal (on the Homestead). This location was decided more adaptable for a railroad stop; hence the village of Mandal was \"moved\" and the name changed to \"Matrous\" by the Grand Trunk Pacific Railway Company — thus naming the town after one of their directors and keeping this divisional point in alphabetical order in the line.\n\nThe first man to build on the new townsite was Frank Keebler who put up a small shack for a harness shop on the east side of Main Street in the late fall or 1907. In the spring of 1908 the townsite of Matrous was put on the market and the town grew rapidly. The first church services was held in Hultgreen and Thurston's lumber yard, and conducted by the missionary minister, R. Surtice, who was shortly after replaced by Reverend Vessey of the Methodist Church. The first church erected was the Anglican; Reverend H. King took charge. The (Reverend John Mason, pastor), Norwegian Lutheran, and Presbyterian churches soon followed. School was opened in the Hulta Building on 2nd Avenue and Main Street on December 1st., 1908. O.M. Holm, Harry Shollater, with T. N. Bjornsdahl, secretary-treasurer, made up the first school board.\n\nA. J. Gordon and Miss Deinard were teachers; attendance was approximately 60.\nOn July 1st, 1908, the first celebration was held, sponsored by the Watrous Citizens' Band under the direction of band leader W. H. McVaugh.\n\nThe first baby born in Watrous was a son to Mr. and Mrs. George Saunders, named Colonel; the baby was presented with a carriage from the town. The first baby girl born was to Mr. and Mrs. D. A. Mollard and called Jean.\n\nIn the latter part of 1909 the census was taken and the population found to be over 1100 souls, hence the village was incorporated as a town. The first town council met on the 18th of February, 1910, and was composed of E. Meadows, Mayor, G. Mollard, George Smith, George Stover, L. Edmunds, R. B. Hiltz, and T. N. Bjornsdahl, Councillors.\n\nThe men who built Watrous:\n\n| Plasterers | Stone Masons | Contractors and Carpenters |\n|------------|--------------|---------------------------|\n| E. B. Miller | O. Forgaard | J. Dahl, J. Rude, H. Erlanson, J. Children, F. Stenson, J. Irvin, A. Collins, J. Whitmore, Wm. Whitmore, J. Hadfield, Geo. Crooks, R. Horn, H. Moe, John Bull, H. Halvorson |\n\nGeorge Harper was station agent of Grand Trunk Pacific Railway Company; Clarke's Kitchen, operator; C. Brook, locomotive foreman, was soon promoted and replaced by George Robinson.\n\nDr. H. R. Agar established his business place as a dentist; W. J. Stephenson and J. Swindale, jewellers; F. Kehler, harness and hardware; T. N. Bjornsdahl, department store; Dr. J. White, drugs; O. N. Bjornsdahl, restaurant, Meadows, Mollard, Saunders, the Watrous Trading Company.\nOn July 1st, 1908, the first celebration was held, sponsored by the Wetmore Citizens' Band under the direction of band leader Mr. H. McNally.\n\nThe first baby born in Wetmore was a son to Mr. and Mrs. George Bannister, named Colonel; the baby was presented with a carriage from the town. The first baby girl born was to Mr. and Mrs. D. A. Willard and called Jane.\n\nIn the latter part of 1909 the census was taken and the population found to be over 1100 souls, hence the village was incorporated as a town. The first town council met on the 18th of February, 1910, and was composed of R. Meadows, Mayor; G. Willard, George Bannister, Councillors.\n\nBarrett, L. W.; Willard, R. E.; Hill, T. N.; Bjornstad, Councillors.\n\nThe men who built Wetmore:\n\n| Name       | Occupation |\n|------------|------------|\n| E. B. Miller | Stone Mason |\n| O. Forsland | Stone Mason |\n| N. Forsland | Stone Mason |\n| B. Harrington | Stone Mason |\n\nGeorge Harper was station agent of Grand Trunk Pacific Railway Company; G. H. Kitchin, operator; G. Brody, locomotive foreman; was born in Wetmore and employed by George Robinson.\n\nDr. H. R. Agar established his business place as a dentist; Mr. J. Stephenson and J. Bjornstad, jewellers; P. Koehler, harness and saddlery; T. N. Bjornstad, department store; Dr. J. Whiteley, druggist; O. H. Bjornstad, restaurant; Meadows, Willard, Bannister, Wetmore Trading Company.\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904A-D_747.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 60, "total-input-tokens": 99600, "total-output-tokens": 10544, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1523, 7], [1523, 3047, 8], [3047, 3440, 9], [3440, 3849, 10], [3849, 3849, 11], [3849, 4253, 12], [4253, 4253, 13], [4253, 4253, 14], [4253, 4253, 15], [4253, 4253, 16], [4253, 4253, 17], [4253, 4253, 18], [4253, 4253, 19], [4253, 4253, 20], [4253, 4253, 21], [4253, 4253, 22], [4253, 4253, 23], [4253, 4253, 24], [4253, 4253, 25], [4253, 4253, 26], [4253, 4253, 27], [4253, 4253, 28], [4253, 4253, 29], [4253, 4253, 30], [4253, 4253, 31], [4253, 4253, 32], [4253, 6142, 33], [6142, 6142, 34], [6142, 6987, 35], [6987, 7755, 36], [7755, 8435, 37], [8435, 9296, 38], [9296, 9755, 39], [9755, 10261, 40], [10261, 10261, 41], [10261, 10666, 42], [10666, 12311, 43], [12311, 12985, 44], [12985, 14770, 45], [14770, 15771, 46], [15771, 17240, 47], [17240, 18543, 48], [18543, 20174, 49], [20174, 20848, 50], [20848, 22738, 51], [22738, 24644, 52], [24644, 26384, 53], [26384, 28134, 54], [28134, 29864, 55], [29864, 31598, 56], [31598, 33116, 57], [33116, 34508, 58], [34508, 34655, 59], [34655, 34809, 60]], "primary_language": ["None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]