[{"id": "f5554d83227f6638fe9393f7d906c168fe70bc57", "text": "S-X2\n842. Gush Dolly\nProvince of Saskatchewan\nSASKATCHEWAN ARCHIVES OFFICE\nUNIVERSITY OF SASKATCHEWAN\nSASKATOON, SASK.\n\nDecember 12, 1962\n\nMrs. Dolly Gush,\n219 Vancouver St.,\nVictoria, B.C.,\n\nDear Mrs. Gush:\n\nThe Saskatchewan Archives is presently conducting a search for information on pioneer days to add to the permanent historic records of this province. In order to facilitate this search we have prepared a questionnaire which we are asking pioneers to fill in for us. It is intended that the completed questionnaires will be kept permanently and used as reference material for historians conducting research on early history of this province.\n\nYour name has been given us as a person who might be willing to help us by completing the enclosed questionnaire. We will be pleased if you will complete the questionnaire as far as you are able to do so and return it to this office.\n\nYours sincerely,\n\n[Signature]\n\nD. H. Rocking,\nAssistant Provincial Archivist\n\nDHE (es)\nEnc.\n\nRe above Better & Worse & More Better also to keep or cut out.\nProvince of Saskatchewan\n\nSASKATCHEWAN ARCHIVES OFFICE\nUNIVERSITY OF SASKATCHEWAN\nSASKATOON, SASK.\n\nDecember 12, 1962\n\nMrs. Dolly Gush,\n219 Vancouver St.,\nVictoria, B.C.\n\nDear Mrs. Gush:\n\nThe Saskatchewan Archives is presently conducting a search for information on pioneer days to add to the permanent historic records of this province. In order to facilitate this search we have prepared a questionnaire which we are asking pioneers to fill in for us. It is intended that the completed questionnaires will be kept permanently and used as reference material for historians conducting research on the early history of this province.\n\nYour name has been given us as a person who might be willing to help us by completing the enclosed questionnaire. We will be pleased if you will complete the questionnaire as far as you are able to do so and return it to this office.\n\nYours sincerely,\n\n[Signature]\n\nD. H. Boonstra\nAssistant Provincial Archivist\n\nDHE/ee\nEnc.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives of the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Dorothy Gush nee Burrows\n2. Your address: 219 Homestead St., Victoria BC.\n3. Date: \n4. Where were you born? (Give name of place and country): Weymouth, Dorset England\n5. What was your father's name and occupation?: George Henry Burrows Taylor\n6. When did you come to Saskatchewan? (Give month and year): May 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens\" etc.)\n9. What were your reasons for coming West?: I came with my father, mother & sister, nurse years older than me. My father was advised to move to Canada for health reasons; to improve a dry climate; needed a dry climate.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through family members. They were Piwed in manitoba. They were there when they were raised. Relocated to Canada in the year of 1904.\n1. Your full name: Mrs. Dorothy Gush nee Burrows\n\n2. Your address: 319 Blumberger St., Victoria, B.C.\n\n3. Date: \n\n4. Where were you born? (Give name of place and country): Weymouth, Dorset, England\n\n5. What was your father's name and occupation?: George Henry Burrows Taylor\n\n6. When did you come to Saskatchewan?: May 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child,\" \"I was in my teens,\" etc.): 16 years old\n\n9. What were your reasons for coming West?: Because with my father & sister, raise years older than me, my father was advised to move to Canada. He needed a dry climate\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through family friend. They were Pioneers who had moved west in the year of 1904. I heard about it from them.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome thought we were coming to a country of wild animals + too new ways! Others thought we were coming to a country of opportunity.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTravelled as a family\n\n13. What means of transportation did you use?\n\nBoat + Lumber freight + Railways + Stagecoaches + Horseback\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThere was no Saddle Mountain, was the end of the line. There was no Saddle Mountain, was the end of the line. There was no Saddle Mountain, was the end of the line.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOne night at the Hotel\n\n16. Where did you settle or take up land?\n\nOn the 34 & 47 Range 19\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nJust Reaped on the farm\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nSome thought we would come to Canada as a family.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTravelled as a family.\n\n13. What means of transportation did you use?\n\nBoat from England to France, then train to Canada.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nThe boat was very crowded. The food was not very good. We had to sleep on the floor. There was a lot of rain and mud. We had to change our clothes frequently. We also had to be careful of the wagons and railroad tracks.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nI stayed at the Hotel Regina and our family.\n\n16. Where did you settle or take up land?\n\nOn the Grasslands near the Missouri Valley, N.W.T., Canada.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked on the farm.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n* Too, as Railroads were built we changed to nearest town, Sturgeon for 6 miles.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSent mail orders to various offices in Winnipeg for twenty-three years until we closed our post office; until we closed our Raymore.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Yes.\n\nOr did you make up your mind after trying it out? When did you make this decision?\n\nMy father impressed it on me.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing; better means of travel, etc.)\n\n* Too. As Railways were built we charged to nearest town. Sugar River for 6 miles.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nSent mail orders to Edmonton. We had post office, until we moved to deal in Raymore.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, was it with the idea of staying permanently? Yes.\n\nOr did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, mostly because you came to work at the mine. Also, some people were attracted by the opportunity to build up the community.\n\n35. Did many people return?\n\nI moved away in 1925 to Viselejaria.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father, S.H. Burrows, was a Justice of the Peace for many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nThe Hypolite School district was first named in 1890. The first school building was built in 1892. The first teacher was Mrs. Louise Burrows.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Hypolite School district was named after Mr. Burrows. The first school building was built in 1892. The first teacher was Mrs. Louise Burrows.\n\nThe Hypolite School district was named after Mr. Burrows. The first school building was built in 1892. The first teacher was Mrs. Louise Burrows.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, myself. House you came to just get their rent steadily r seed them + were not interested in building up the country.\n\n35. Did many people return? Did many return?\n\n1925 to Vitebskia\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father S.H. Burrows was a Justice of the Peace for many years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe Hygieia School district name was given by Mr. Burrows on our new farm land. We used to have a school house on the edge of the Bute Road near the surveyors road made of The Earl of Granville's H.P. Rail Castle. I said it was built there by the Bishop Castle & we decided to call our new home in Canada Hygieia.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJ. A. Black\nson (technical engineer)\nhas 5 y. sons\n1 daughter has 2 y. wife\ninvaluable wife\nfuture housewives\n\n41. What do you think are the most important changes in your community since you first came West?\n\nImprovements in farm life. Electricity\nor turning improved farm implements\ngood roads.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this\nperson give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photography, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nJ.A. Gush\n1 son Edward Engleson. 1941 Hydro\n1 daughter, Mrs. S.Y. Sears\ninvaluable wife\nyour housewife\n\n41. What do you think are the most important changes in your community since you first came West?\n\nImproved roads, improved farm implements\nGood roads.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1905G-L_842.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5308, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 21, 4], [21, 1042, 5], [1042, 2001, 6], [2001, 3620, 7], [3620, 5331, 8], [5331, 6751, 9], [6751, 7785, 10], [7785, 8906, 11], [8906, 10047, 12], [10047, 10047, 13], [10047, 10047, 14], [10047, 10722, 15], [10722, 11393, 16], [11393, 12629, 17], [12629, 13783, 18], [13783, 13783, 19], [13783, 13783, 20], [13783, 15384, 21], [15384, 16852, 22], [16852, 18047, 23], [18047, 19198, 24], [19198, 19353, 25], [19353, 19507, 26]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]