[{"id": "81fe7827aaf0ebbc6d6e256c31e6179cd7b52fcd", "text": "It is difficult to prepare a general questionnaire on pioneer life because\n\nA word of explanation to the person answering this questionnaire\n\nI\nIncidentally, it was during years before I made any great visit to England. I heard our family physician at Hillburn, and wrote often.\n\nThat summer 1892 I had a cow by mail. The next year I worked for a Canadian (not a green-eyed Ishmael) or $3 per month. (1893)\n\nI paid back up new land with New Mexico.\n\nThe settlers in this district came there in 1882.\n\nMy uncle, Mr. Eddy, lived at South Elmo, about 1 mile west of Ontario.\n\nIn 1894 I bought a farm (240 acres) for $880 in the Hillburn District. Buying it to farm, I lived in a log shanty on the farm.\n\nI was watching a child out in the spring with 25 cents. I met a Canadian (not a pioneer) before he started his own claim for a pre-emption. That summer, I was so hard up the friend turned hunt my first through the hole in my head, and I was thrown down on my back.\n\nNext, it was hard work clearing heavy brush with an axe or bucking the land with two horses in the fall. The rain came all bundled in bales of hay, shipped from the carriers in boxes of dirt and always a bad dream.\n\n(Mr. North Star, Alta.)\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences; others may prove less experienced.\n\nIf you were a boy in the family and the question came from the head of house, you would probably have a good copy of what you had to write.\n\nAnd if you had a good copy of what you had to write, you could use it to make a good job of answering the question.\n\nYou could also use your own handwriting if you thought it looked good enough.\n\nI couldn't have done that without the guidance of my parents.\n\nI was delighted to receive your kind letter.\n\nYour son's name is mentioned by Mr. Roy F. Hannah.\n\nHe became No. 18969 and was named at the age of 14.\n\nHe died in 1952.\n\nI am glad you wrote back so soon.\n\nI wonder how you are doing now.\n\nI hope you are well and happy.\n\nI am looking forward to hearing from you again.\n\nWith best wishes,\n\n[Signature]\n\nOctober 11\n\n[Signature]\nThere was a farm on the farm and the Indians came there to pitch tents at noon. While bathing I liked for syrup or tea. Mulling am. Prunes of rice. So I had a good crop that fall but the wheat had a brown frost. I heeled it 15 miles to Hopilla near of the farm and sold it for $366 per bus.\n\nand sold goods from the store. In 1895 I was buying around 14 hours a day. On morning I went to the store of this man in a Red River cart. The pull-up three days in a printed shirt and pants. I walked away toward the poplars.\n\nOn December 4th 1895 I was married at the Methodist Church at Millburn. There was a Methodist Church at Millburn at this time which we attended.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA CASE OF IMPEACHMENT TO THE PERSON\n\nANSWERING THE QUESTIONNAIRE\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nSASKATCHEWAN ARCHIVES OFFICE,\nUNIVERSITY OF SASKATCHEWAN,\nBASILIANOON, SASK.\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nPreservation of Questionnaires\n\n() Pioneer farming experience\n() Pioneer homesteading\n() Pioneer occupation and otherwork\n() Pioneer social life, sports and recreation\n() Pioneer health conditions\n() All questionnaires\n\nSome of these are listed below. Please mark the ones you would be willing to answer.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nWestern Canadian Pioneers East? still being evaluated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWrite them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1947, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nThe questionnaire is intended for persons who lived in Western Canada before 1947, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"Ex\" to denote to give details, or describe particular events, if help to answer the questions.\n\nThe questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"Ex\" to denote to give details, or describe particular events, if help to answer the questions.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWrite them on separate sheets or apply for a separate questionnaire.\nEvans, William\nNorth Star, Alta.\nTo Sask., March, 1892.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA series of questionnaires to the pioneer settlers of the North West Territories.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual life is such as to answer it as easily as the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. You are free to select or reject them as you see fit. If there is not sufficient space to answer the questions, please use additional sheets.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1941 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for separate questionnaires.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experiences\n\nEnrollment of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Collection at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: William Evans\n\n2. Your address: North Star, Alberta\n\n3. Date: April 11th, 1952\n\n4. Where were you born? (Give name of place and country)\n   Birkenhead, England\n\n5. What was your father's name and occupation?\n   John Evans, Superintendent, Insurance Co.\n\n6. When did you come to Saskatchewan? (Give month and year)\n   March 29th, 1892\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   (Ottawa)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   21 years\n\n9. What were your reasons for coming West?\n   Always wanted to be a farmer although brought up in the city. A friend of mine came from Saskatchewan & I came here with him.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through my friend\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: William Evans\n2. Your address: North Star, Alta.\n3. Date: March 1952\n4. Where were you born? England\n5. What was your father's name and occupation? John Evans\n6. When did you come to Saskatchewan? March 25, 1892\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible (Canada, United States, etc.)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n9. What were your reasons for moving to Saskatchewan?\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nSigned: William Evans\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   My parents were very much upset - I left under a cloud.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   Self or friend\n\n13. What means of transportation did you use?\n   CPR\n   Sleigh from Winnipeg to Hillburn 28 miles\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   When train stopped over at Winnipeg half a dozen guys went up main street where there was a wooden pump halfway up. We stripped off coats & one pumped until the rest had a good cold sweat. This was in March & the natives of Winnipeg got the excitement.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   County School District (Hillburn)\n   20 miles North of Moose Jaw\n\n16. Where did you settle or take up land?\n   Hillburn\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Insurance business\n   Worked more 2 years\n   Bought farm\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy friend was very pleased.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy myself.\n\n13. What means of transportation did you use?\n\nTrain from Ontario to Hillman 21 miles.\n\n14. What incidents of the journey West do you remember? (People you met on the way, etc.)\n\nWe had to stop our train at Hemingway half hour.\n\nA day or two we went up through the woods.\n\nWe had to stop our train at Hemingway half hour.\n\nWe had to stop our train at Hemingway half hour.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nCrowley School District (Hemming)\n\n16. What did you settle or take up land?\n\nHillman\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n---\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n19. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n20. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n21. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n22. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n23. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n\n24. How did you earn a living before coming to Western Canada? How after you came?\n\n---\n19. How often did you write to relatives or friends in your old home?\n\nAbout three times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy husband's name was William. Married 4th December 1895 at Shillburn.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNo. Hard times, hard work.\n\nMosquitoes were no inducement to those who I had known in England.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nNone\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOnly the character of the pioneer women on the farms who gave many professional men in later years its own Victorian titles. I remember old Scottish lady who heard my cough in the night, said when I got to the door, \"I knew you were coming.\" I was ready for her midwife duties or it was you coming. I was ready for her midwife duties or it was you coming. Or another occasion a male neighbour who slept in the manger so that he would be there if needed to go to Montana over a bloodied prairie trail for a doctor. This was the spirit of the old West.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNone in earlier years, occasional visits to neighbours within five mile radius. Home working all over needed most only had major met of the myself. Later when I got married, I remember wife and I going to church on the Sunday. I think the Methodist church was a real Godsend those days, here the women the service of worship & get together, and the Ladies Aid which help to keep up their moral.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n   Around 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Either 1913 or 14, McLaughlin Buick\n\n27. Where was your trading center? How far from your home?\n   By townsite 20 miles, Regina 15 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   No in 1902, branch line from Virden to Regina (Pheasant Hill Branch) & our Village of Rocanville started that year. My farm was 5½ S.W. of Rocanville.\n\n29. How often did you shop in the early days?\n   Get year supply flour & sugar, shop around four times per\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Around 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Don't remember but I think we were little the chief neighbors I have up here who built a log barn. I asked him why he did not put the windows in. He said he cannot buy. Well I said, take flour sacks & use them. So he did want them for the kid clothes.\n\n32. When did you first have a telephone and what company provided it?\n   1910, Rocanville Rural Tel Co\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, a new change\n25. When was the first car used in the community?\n   - 1913\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - 1913-14\n\n27. Where was your trading center? How far from your home?\n   - 20 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n   - Yes\n\n29. How often did you shop in the early days?\n   - Every day\n\n30. When did people in your district first start going to town regularly on Saturdays?\n   - 1920\n\n31. When did you first begin to buy through the mail order catalogues?\n   - 1920\n\n32. When did you first have a telephone and what company provided it?\n   - 1910\n\n33. When did you come to Saskatchewan the first time after buying it out? When did you make this decision?\n   - 1910\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a member of the local Grain Growers Ass' when Fred Green was Secretary.\n\nDeVos Farmers Landed Rockville built Community Hall\n\nMember of Masonic Lodge \"1910\" Master round 1915-16\n\nOne of the first 160 delegates appointed by Post when it started\n\nSecretary of Standing Committee Board of Methodist Church 19 years\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nNo\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nHillburn got its name from one of the first settlers in town.\n\nRockville received its name from the first Post Master, an old Frenchman named Rock Basile. 1912-3.\n\nTheir names have not changed.\n5.\n\n34. Did any people move away from your district prior to 1944? What reasons did they have for moving?\n\nTo\n\n35. Did many people move away during the 1930s? Did many return?\n\nNo\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a member of the local farmers' union.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, building the first lodge, etc.)\n\nFirst\n\n38. How did the places in your community get their names? (School, districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPoveshull received its name from the first post office.\n\nPost Office: Red Barns, Nebraska Bay\n\nFather named Poveshull - Bessie, 1922-6.\n\nOther names have not changed.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a friend whose father was one of the first settlers in the Rosedale District and who wrote quite a history of the old timers.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations,\n\nChildren Alberta\nHume Evans North Star Farmer\nJohn C Brownvale Storekeeper\nArthur H North Star Farmer\nNorthy Jane North Star Housekeeper\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPhone, Radio, educational facilities, Agricultural Societies, Agricultural schools, Co-ops, Pool.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preferences, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1892A-G_533.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6036, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 144, 5], [144, 1207, 6], [1207, 2166, 7], [2166, 2830, 8], [2830, 5410, 9], [5410, 7398, 10], [7398, 8721, 11], [8721, 9696, 12], [9696, 10892, 13], [10892, 12337, 14], [12337, 14156, 15], [14156, 14825, 16], [14825, 16442, 17], [16442, 17226, 18], [17226, 18712, 19], [18712, 19900, 20], [19900, 21302, 21], [21302, 22300, 22], [22300, 22300, 23], [22300, 22454, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]