[{"id": "4e0ddb3a13b1cbf1960700c3ca13db79b2bc506c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WAY OF ENQUIRING TO THE PERSON SUBMITTING THIS QUESTIONNAIRE.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences others may prove impossible for you to answer so don't worry about leaving blank spaces. If there are extra sheets of paper, if there is not sufficient space to answer the question, don't hesitate to give details or describe the particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Life Conditions\" will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA LIST OF QUESTIONS GIVEN TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, or don't worry about leaving blank spaces.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer List: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of our permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: E. D. W. L. N. GRANT\n\n2. Your address: Caragana, Sask.\n\n3. Date: April 16, 1953\n\n4. Where were you born? (Give name of place and country): Thawntor, Big County, in June 8th, 1871\n\n5. What was your father's name and occupation? Daniel Grant Collins\n\n6. When did you come to Saskatchewan? (Give month and year): March 12-1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: State of Nebraska, Town of Lehigh\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.). I was 32 years old\n\n9. What were your reasons for coming West? To get cheap land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Other People\n1. Your full name: E.D.W.I.N. GRANT\n\n2. Your address: Carriagenea, Sask.\n\n3. Date: April 16th, 1953\n\n4. Where were you born? (Give name of place and country): Prince Albert, Sask., Canada\n\n5. What was your father's name and occupation? Daniel Grant\n\n6. When did you come to Saskatchewan? (Give month and year): March 12th, 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: State of Nebraska, Town of Beigel\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.) I was 32 years old\n\n9. What were your reasons for coming West? To get cheap land\n\n10. How did you learn about the West? (Through other people? Reading about it?) Railroad or government information?\n\nOther People\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought I was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Friends\n\n13. What means of transportation did you use? Freight train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). We had no accidents\n\n15. Where did you first stay when you arrived in Saskatchewan? Railways, section house\n\n16. Where did you settle or take up land? 12 mile south of Rouleau\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Osler, Regina, Ogema\n\n18. How did you earn a living before coming to Western Canada? How after you came? Carpenter work, Farming & Carpenter work\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought it was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Friends\n\n13. What means of transportation did you use? Trains\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents etc.) Railways\n\n15. Where did you first stay when you arrived in Saskatchewan? Section house\n\n16. Where did you settle or take up land? 12 mile south of Portage\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Omakwa, Regina, Agassiz\n\n18. How did you earn a living before coming to Western Canada? (If after you came) Carpenter & Carpenter work\n19. How often did you write to relatives or friends in your old home?\nTwo or three times a year\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nI got married at Beigh Mib to a lady by the name of Anna Kleopfer on the 14th of October 1894.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nMy father & step brother\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nNone came\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nYes lots of them but it would take a lot of paper to tell it all. When I first landed here there was only one road or trail in the whole blasted country from Regina South to Carleton. I got stranded here back up to Moose Jaw. When I got out to my housestead in the spring of 1904 the bridge went out across the Moose Jaw Creek and left me stranded for 16 days. I happened to have some flour and hard baking formula salt so and milk so I lived on hot cakes. I drove every other day up to the creek to see if any body in town had made a boat to cross with for logs as I knew did I make a boat out of some lumber I had and believe me I went to town got my family out some glue and back here.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nNo everything was too far away team and waggon\n3. How often did you write to relatives or friends in your old home?\n\nTwo or three times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, tell when they came and where they settled.\n\nMy father & step brother\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI am glad to have a list of them but I do not know how to keep it all together in this book. I shall carry it around with me and read it occasionally.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nTrain and stagecoach\n25. When was the first car used in the community? About 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make? I did not.\n\n27. Where was your trading center? How far from your home? Nomeau 12 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). I continued to trade there for several years; a rail road was built within 6 miles then I traded at Nomeau.\n\n29. How often did you shop in the early days? Every two weeks in summer, once a month in winter.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? When Nomeau was built.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. Very soon after arriving in Canada.\n\n32. When did you first have a telephone and what company provided it? In 1908 it was owned and operated by the farmers.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? I first came permanently to see the country, then moved up here with the intention of staying and by gum I still here.\n25. When was the first car used in the community? About 1912\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Northam 12\n\n28. Did you continue to trade there? (Indicate any changes due to new times, improved means of travel, etc.)\n\n29. How often did you shop in the early days? Every two weeks in December\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order establishment? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases paid by mail order since then.\n\n32. When did you first have a telephone and what company installed it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? I think it was a matter of personal choice and my family chose to stay.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nTwo moved to Regina and went into business.\n\n35. Did many people move away during the 1930's? Did many return?\n\nA few moved into town.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was always active in every thing that went on. Telephone Co., school boards, trustees, building roads and building trades.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI built the first house then the first school house. I built the first bridge across Souris Creek on way to New Rouleau. Then I built a cement bridge further south on the same creek that was in three years after I am dead and gone.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1) & (2), (3).\n\nThere was a family named New Warren Mine near where the R.R. was located later and they proposed the name of New Warren. I built the first school house near the R.R. and it was the first school house in all that large expanse of land and it was called the New Warren school.\n\nThis became the center of all social affairs for quite a number of years. Later when the R.R. built a road 1 mile south running with Souris Creek and the R.R. store that are at New Warren moved the town south to the town of Rouleau and R.R. took on the name of Rouleau. The creek got its name from the Ranchers that lived on the creek and gave a few Ranchers lived on the creek.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did any people come into your district prior to 1930? If so, from where?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"thrifty\" to have or do something in the district mentioned it here, giving dates wherever possible (such as owning a farm, always saving money, etc.). Mention the first, second, third, fourth, etc., house built by the family, and the date of each.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name, (2) date and reason for change, (3) any changes in names since the first name was given.\n\nThus, the area around the old schoolhouse near the P.O. and creek became known as \"Old School Creek,\" and the creek itself was named Old School Creek.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\nI'm not sure moved to Regina and went into business.\n\n35. Did many people move away during the 1930s? Did many return?\nQuite a few moved into town.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was always active in every thing that went on telephone or school boards trustees building roads and building trades.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nI built the first house then the first school house.\nI built the first bridge across Long creek on way to Bokeleau then I built a cement bridge after Smith for the same creek that only be three years after I am dead and gone.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1) & (2), (3).\nThere was a family named Lee from Wisconsin where the P.O. was located later and they proposed the name of New Warren. I built the first school house near the P.O. and it was the first school house in all that large expanse of land and it was called the New Warren School.\nThis became the center of all social affairs for quite a number of years. Later when the R.R. came a road built south running with the P.O. store that are at New Warren moved the name south to the town of Warren and P.O. took on the name of Warren. The creek got its name from the Ranchers it is just a long creek and quite a few Ranchers lived on the creek.\n5.\n\n6. If any people were away from your district prior to 1941, what reasons did they have for doing so?\n\n7. If you or some member of your family have held public offices, or have been active in any organization, please list their positions.\n\n8. Did any members of your family attend school at any time?\n\n9. Any other information you would like to share?\n\n10. Any other comments you would like to make?\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nThese are my children Ralph, Percy, Willard, Reggie, Clara, Wayne, Alvin, Merrill.\n\nRalph in Ontario, Percy in grave, Willard in Caragana, Reggie in Mich., Clara in Vancouver, Wayne in grave, Alvin in Rock Island, Merrill in Vancouver.\n\nAll have children and I have grandchildren. I have 9 great-grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRail Road, Churches, School House, Telephones & Roads. Electric lights for towns brought in from outside town. By the way those few got into town from a traveler who fixed in wagon with the four bone of oxen.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nNathan Leepart Caragana Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nEd Collins\n6.\n\n59. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(3) indicate your preferences, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the name and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_682.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5419, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1990, 5], [1990, 3918, 6], [3918, 4783, 7], [4783, 5632, 8], [5632, 6474, 9], [6474, 7258, 10], [7258, 8819, 11], [8819, 9676, 12], [9676, 11092, 13], [11092, 12159, 14], [12159, 14207, 15], [14207, 15250, 16], [15250, 17269, 17], [17269, 17673, 18], [17673, 19265, 19], [19265, 20290, 20], [20290, 20378, 21], [20378, 20529, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]