[{"id": "8f3ba005054c300050ba4e741cf4615957217082", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA. Aged of settlement in the region\n\nIt is difficult to secure a general questionnaire on pioneer life because no individual will be asked about every aspect of the new experiences as such. Some of the questions will apply to your experience; others may prove interesting to you even though they do not apply to your experience.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Face?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n1. Pioneer health conditions\n2. Pioneer social life, sports and recreation\n3. Pioneer housing\n4. Pioneer education and churchwork\n5. Pioneer farming experiences\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nPIONEER EXPERIENCE: A GENERAL QUESTIONNAIRE\n\nIt is difficult to express a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experience; others may apply in part or in whole.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Western Pioneers: What Did Western Canada Mean to You?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please state the ones you would be willing to answer:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer funding experiences\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan, as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: [Name]\n2. Your address: [Address]\n3. Date: [Date]\n4. Where were you born? [Place of Birth]\n5. What was your father's name and occupation? [Father's Name and Occupation]\n6. When did you move to [New Location]? [Date]\n7. Mention any other places where you lived before coming to [New Location], divided dates wherever possible. [Dates]\n\nI came with my Father to the west of the family of which I have been a part.\n\nMy Uncle William Watson has died from old age and told my father about a country in Canada so father came to Brandon in 1881 and saw the country then there was all empty in 1882 we settled on land 12 miles east of Brandon.\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to England? ____________________________\n7. Mention any other places where you lived before coming to Manchester, giving dates whenever possible. ____________________________\n8. How old were you when you first came to Manchester? ____________________________\n9. What were your reasons for coming here? ____________________________\n10. How did you learn about the work? (Through other people? Reading about it? Household or government information?) ____________________________\n\nMy uncle William mentioned the work and told my father what a wonderful country it was. So father came to Manchester in 1891 and saw the country then there was all very in 1892 as dotted on land in times of Blandford.\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Waddington, John\n2. Your address: 401 Main St., Regina, Saskatchewan\n3. Date: Feb. 14th, 1953\n4. Where were you born?\n5. What was your father's name and occupation? Thomas Bradham, Bradham Co.\n6. When did you come to Saskatchewan? (Give month and year) Jan 4th, 1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible. At Brandon, Man., arrived there in Aug. 1892\n8. How old were you when you first came to Western Canada? (You do not need to answer if you are under 18 years of age)\n9. What were your reasons for coming West? I came with my father and the rest of the family of which there were eight.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Any Amelia Williams Waddington had been out West and told my father what a wonderful country it was so father came to Brandon in 1881 and saw the country then. Once we all met in 1882. We settled on land at Guild, S.E. of Brandon.\nPIONEER HISTORY FORM: A GENERAL QUESTIONNAIRE\n\nNAME: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\n1. Your full name: ____________________________\n2. Your address: ____________________________\n3. Date: ____________________________\n4. Where were you born? ____________________________\n5. What was your father's name and occupation? ____________________________\n6. When did you come to Saskatchewan? ____________________________\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible. ____________________________\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you think it was a small child.)\n9. What were your reasons for coming West? ____________________________\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nMy uncle, Mr. Smith, had been out West and told my father what a wonderful country it was. So father came to Brandon in 1881 and our family then came to all out in 1882. We settled on land 12 miles SE of Brandon.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel alone or with a party (family, friends or other group)?\n\n13. What means of transportation did you use? Traveled by train from Edmonton to Calgary via the Canadian Pacific Railway.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy Father kept one\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use? \n\nTravelled by train from Brandon via Waskesiu to Brandon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nNothing special happened on the journey from Brandon to central Pastel.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nCentral Pastel Students\n\n16. Where did you settle or take up land?\n\nOff North Pastel\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo other place until I retired to my present address.\n\n18. How old you were a little before coming to Western Canada? How after you came?\n\nAny further questions\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nIn Elizabeth Johnson on Oct 27th 1902\n\nTo North Portage Lake by Rail\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\nAll the family moved to North Portage Lake\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI rode two trips to the old home of homesteaders\n\nOn by Rail\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n9. Choice Two Trips To the old Home of Grandfather\n\nOn by Rail.\n25. When was the first car used in the community? about 1910\n\n26. If you owned a car before 1914, when did you buy it? What makes I bought a Model T Ford car in 1914\n\n27. Where was your trading center? How far from your home? North Postal Office\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) continued to trade in North Postal\n\n29. How often did you shop in the early days? once a week\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays? about 1910\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? You by this way? Indicate also what fraction of your total purchases were made by mail order and any changes in the proportion of purchasers made by mail order since then.\n\n32. When did you first have a telephone and what company provided it? We formed a phone union so\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When all you make this decision?\n\nI came with the intention of staying and found that I liked it.\n25. When was the first car used in the community? about 1910\n\n26. If you owned a car before 1914, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new trading centers, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Shubertown the first time was it with the idea of staying or just passing through?\n34. Did any people move away from your district prior to 1914? If so, when?\n\n35. Did many people move away during the 1920s? If so, when?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates where possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here (giving dates wherever possible). (Such as owning the first automobile, combining organizing the first L.C.S., etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (4) any changes in name since the first name was given; date and reason for change. Give names of new names as above in (1), (2), (3).\n35. Old military service during the present war.\n\n36. If you or some members of your family have held public office, or have been active in any organizations, mention it here; giving dates wherever possible.\n\n37. If you or any of your family or friends were drafted to have or do something in the district mention it here giving dates wherever possible.\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) To give: (1) name and occupation of person suggesting place-name (2) date and meaning of the name (3) date of its adoption. (4) any changes in name and date of change. Give dates of new name as above in (1), (2), (3).\n12. Questions regarding historical source materials:\n\nDo you have any personal or family records such as letters, old photographs, newspapers, or other documents? If so, please describe them.\n\nWould you be willing to lend them to the Provincial Archivist for research purposes?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe most important change was the turn over from house planning to farm planning.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\n\n[Signature]\n12. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, minute books of community organizations, old newspapers, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library (Regina), or the Archives Office at the University in Saskatoon? (Indicate your province/province)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nQ. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have one daughter living with me here in Regina, she's a clerk in the M.F.P.A.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe most important change was the turn over from horse farming to farm farming.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\n\n[Signature]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1898_583.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4433, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1697, 5], [1697, 3258, 6], [3258, 3913, 7], [3913, 4891, 8], [4891, 6157, 9], [6157, 7383, 10], [7383, 8137, 11], [8137, 9054, 12], [9054, 9900, 13], [9900, 10630, 14], [10630, 11791, 15], [11791, 12486, 16], [12486, 13418, 17], [13418, 14131, 18], [14131, 14925, 19], [14925, 16298, 20], [16298, 16453, 21], [16453, 16607, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]