[{"id": "7c2a097824532d2eb31ecdf2ffc89a56e4b11dd3", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or protected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra space or paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nYou will notice I have filled in a little of this form, and I want very much to send it back.\n\nI am very grateful to you for the great deal of help you have given me.\n\nOf the early days, I vividly remember some of them, and children, friends, and others of those days, for visits to the old schoolhouse.\n\nOn every day of the week, I have been making up my own account.\n\nI would be pleased to have you or anyone else present at any time at my home, or even just for a talk, for you might get in touch with Dan Warden, who made a talk to our club five years ago.\n\nMy memory is very good, and I am in good health, have never been to a doctor in my life, have not had any hospital bills for two years, and I connect other things to my health.\n\nQuilt Thursday in 1946, did go over country and threshed over 1000 acres before quite young.\n\nSincerely,\n\n[Signature]\n\n[Signature]\nYou will notice I have filled in a little of them today, and I am very glad to see any improvement on my part.\n\nI am very grateful for the need of the Lord's church. It has been a great comfort to me during these days of trial.\n\nOn every occasion, I have found them smilingly disposed.\n\nI would be pleased to hear from anyone who would be interested in making a tape. If you would like to make a tape for Dan Warden, I would be very grateful.\n\nMy memory is very good, and I have never been to a doctor in good health. I have not had any illness for many years.\n\nI am convinced that God has been faithful to me throughout these difficult times, and I thank Him for His grace and mercy.\n\nYours Truly,\n\n[Signature]\n\n[Signature]\nSir,\n\nYou will notice I have filled in a little of this form, and I am very glad to give any information you could need.\n\nI am very grateful to you for the kindness of the early days at Pakefield Park.\n\nIn every care I have found them valuable, and children, grand children, and grandchildren have been making their own account.\n\nI have had hundreds visit me in the past few years, and I am disappointed not to see you here.\n\nI would be glad to have you or anyone else put out by the church.\n\nPlease make a note, you may get in touch with me soon.\n\nMy memory is very good, I am in good health, have never been to a doctor in my life, have not had any trouble with my feet.\n\n20th June\n\nI have moved to Southwold and go over every Thursday in 1946, and through over teaching in these districts, and through over 100,000 before I quite.\n\nYours sincerely,\n\n[Signature]\n\n[Signature] Outell\nSir,\n\nYou will notice I have held in a little of this form, and I must say I would be glad to give any information you could give.\n\nBy the way, I am sure the need of the Lord's work of early days, especially among the young people.\n\nOn every day of the Lord's work, on and children, I have been making a great deal of prayer and praise.\n\nI would be pleased to have you at some point in the future, or even now, or when you make a talk, you might get in touch with Don Wonder, he made a talk for us last year.\n\nMy memory is very good, I am in good health, have never been to a doctor in my life, have not had any illness.\n\n2 o'clock.\n\n& therefore, I am quite sure.\n\nYours faithfully,\n\n[Signature]\n\n[Signature]\nThe history was taken with my camera.\n\nIn the spring of 1912, (on my uncle's farm) I am the farmer, the first of a \"H\" - Waynes from Nova Scotia. We, in company with others from Nova Scotia,\n\nwere travelling them district as we\n\nin the fall of 1911 and the Hayloft surrounded\n\nhe was at the same time, and would run the\n\noutfit, he did not have two horses with him\n\nfour round down each for them, we threaded till\n\ntwo days, and had to pay on account of Sadie\n\nJennifer, he purchased the people to work or come\n\nback the next spring and clear all the land\n\ngo every book to did turn up, or turned\n\nall charge, all the wheat was $60 about 15000\n\nbought from the machine for seed, and got our\n\nkernel grown (which means necessity) new body fitted\n\nnotary in those days. The one arm man in the\n\nsection was a town of wig. The old couple\n\nhad come to Saskatoon in 1903, homesteaded in Redcliff\n\nHe bought the old house valued on his own land where their\n\nand was carrying still within a 100 feet where their\n\ngrave was.\nThe story was told by Mr. Cameron.\n\nIn the spring of 1912, (on my uncle's farm) I am the farmer, the engineer, to a Mr. Wagner from Nova Scotia. We, in company with another man were travelling through district as prospectors.\n\nTwo other men had quit growing the crops in the fall of 1911 and the Haynes returned to work at a new location. And would own the outfit. He did not have two horses with him.\n\nFour weeks down each for them, we traveled till new year, and had to quit on account of bad snow. The farmers had the pasture to worry about.\n\nEach the next spring and clear all the land, go every block sufficient to did turn up, or turned all along all the wheat was $60 about 1870-1875.\n\nBought from the machine for seed, and the corn from the same. (which was necessary) paid big prices.\n\nThe old house was a storehouse of the owner of the farm. The old house stood near the homestead in 1903. Homestead was built there.\n\nHad been to Sutherland in his own family. Chief there.\n\nHe bought the field and rolled on his own place. Then\n\nAnd now owning still within a 100 feet within their grave. One.\nProvince of Saskatchewan\n\nOFFICE OF THE SASKATCHEWAN ARCHIVES\nUNIVERSITY OF SASKATCHEWAN\nSASKATOON, SASK.\n\nMarch 7, 1963\n\nMr. Frank Antill,\nPike Lake, O'Malley, Sask.\n\nDear Mr. Antill:\n\nThe Saskatchewan Archives, in a continuing program of trying to secure historical information on pioneer days, has prepared a series of questionnaires. Enclosed is the general questionnaire number 2. The completed questionnaire will be permanently kept in the offices of the Archives and used for historical research. Your name has been given us as a person who might be willing to complete the questionnaire. Any assistance you can give us in this project will be greatly appreciated.\n\nPlease return the completed questionnaire to the address given on the front page. Thank you.\n\nYours sincerely,\n\n[Signature]\n\nD. H. Booking\nA./Asst. Prov. Archivist\n\nDEB/ejo\n\nEncl.\nProvince of Saskatchewan\n\nOffice of the Saskatchewan Archives\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\nMarch 7, 1963\n\nMr. Frank Antill,\nPike Lake, Sask.\n\nDear Mr. Antill:\n\nThe Saskatchewan Archives, in a continuing program of trying to secure historical information on pioneer days, has prepared a series of questionnaires. Enclosed is the general questionnaire number 2. The completed questionnaire will be permanently kept in the offices of the Archives and used for historical research. Your name has been given us as a person who might be willing to complete the questionnaire. Any assistance you can give us in this project will be greatly appreciated.\n\nPlease return the completed questionnaire to the address given on the front page. Thank you.\n\nYours sincerely,\n\n[Signature]\n\nD. H. Booking\nA/Ass't Prov. Archivist\n\nDEP/ejo\n\nEnc.\n1. Your full name: Frank Antill\n\n2. Your address: Pile Lake, S.E. 3-32-7-4\n\n3. Date: March 8, 1965\n\n4. Where were you born? (Give name of place and country): Liverpool, England\n\n5. What was your father's name and occupation? J.H. Antill, (Plow maker)\n\n6. When did you come to Saskatchewan? (Give month and year): April 1906\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? With father & mother.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Hannah Antill\n2. Your address: Pipe Lake\n3. Date: March 8, 1942\n4. Where were you born? (Give name of place and country): Saskatchewan\n5. What was your father's name and occupation? J.H. Antill, (Plow maker)\n6. When did you come to Saskatchewan? (Give month and year): After 1906.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - First settled in the district: May 15, 1906.\n   - Homesteaded in 1912 and still have my homestead.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   - With father & school.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad)\n\nRailroad - Pony adventure!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Answer:\n\n13. What means of transportation did you use? \n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? \n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGood.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? [Answer]\n\nCouple plus stayed in Edmonton\n\n13. What means of transportation did you use? [Answer] (Train)\n\nC.N. & S. Railway (end of 1905) Subway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nHard times were hard on England.\n\nDad was See. of Bird's Shoe maker union,\n\nGreat Harvey Macdonald, R.M. Hardy\n\nShortly afterwards, I returned at a Canton\n\nNext time in the centre of the unemployment quack\n\non London. Got in the spring of 1906.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn my brother Hall\n\n16. Where did you settle or take up land? [Answer]\n\nIn this district\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn other place\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWas on Montana cowboys and for some years, 2 terms on Montana cowboys of the 1906 year was P.P. overpaid left\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Sokolstrewen the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School district, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_886.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 32, "total-input-tokens": 53120, "total-output-tokens": 5413, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1614, 5], [1614, 3216, 6], [3216, 4087, 7], [4087, 4812, 8], [4812, 5697, 9], [5697, 6406, 10], [6406, 7422, 11], [7422, 8525, 12], [8525, 9378, 13], [9378, 10219, 14], [10219, 10219, 15], [10219, 10219, 16], [10219, 10219, 17], [10219, 10219, 18], [10219, 10219, 19], [10219, 10219, 20], [10219, 10996, 21], [10996, 12202, 22], [12202, 12876, 23], [12876, 14064, 24], [14064, 14739, 25], [14739, 15412, 26], [15412, 16365, 27], [16365, 16365, 28], [16365, 17411, 29], [17411, 18373, 30], [18373, 18528, 31], [18528, 18682, 32]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]