[{"id": "1daf7665b74a67badb5338af56a3b6ce8233acbe", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\nRECEIVED\nMAY 10 1952\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to make a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer without trying blank spaces. It is suggested that you try to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What I'd Tell Western Canadian Pioneers If They Knew,\" is still being circulated. If you have not already answered this, and are willing to do so, please put a check mark here ( ).\n\nAnd one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires are available:\n\n- Pioneer health conditions\n- Pioneer school life\n- Sports and recreation\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll completed questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: CHARLES DAVIS\n\n2. Your address: ROYAL WHITEWOOD, SASK.\n\n3. Date: May 5, 1952\n\n4. Where were you born? (Give name of place and country): DORSET, ENGLAND\n\n5. What was your father's name and occupation? Charles Davis\n   Rail Road Man & Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): Sept 3, 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: 9 years at Paris out 1872 to 1882\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc): 12 years\n\n9. What were your reasons for coming West? My father wanted land\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Railroad and government advertising\n\nIn the early days there was no music. I learned to play a mouth organ & have played at Halls and in hotel Dining Rooms and at Country Houses I often made $5 a night. I could play and dance in any round Dance and we used to have just as much fun as now. We used to have at least one dance a week at these Houses and the Houses were very small. They had to have 10 ft by 10 ft to work in. They were the happy days.\nCharles Davis\nBox 98, Whitewood.\n\nTo Sask. - September, 1862\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Charles Davis\n2. Your address: Box 98, Whitewood\n3. Date: May 5, 1952\n4. Where were you born? (Give name of place and country): Dorset, England\n5. What was your father's name and occupation? Charles Davis\n6. Rail Road Man & Farmer\n7. When did you come to Saskatchewan? (Give month and year): Sept. 3, 1882\n8. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: 9 years at Paris out 1/12/1882\n9. What were your reasons for coming West? My father wanted land\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nIn the early days there was no music. We learned to play a mouth organ or harmonica. At parties and in hotels dancing rooms and at country homes we often made a night of it. We used to have just as much fun as now. We used to have at least one dance a week at the schoolhouse and the houses were very crowded. We have 10 ft by 10 ft to work in.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey did not know what to think.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nMy Mother & Sisters and one Brother\n\n13. What means of transportation did you use? CPR\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nMet lots of Indians as soon as we arrived here.\nThere is a big Reserve 6 miles north of Whitewood.\nWe were afraid the Indians were going on the war path in 1885 but the Minister on the Reserve kept them at home. The Rev Hugh McKay.\nThere was a train made up for weeks night and day ready to take the settlers from Broadview and East.\nIf the Indians started trouble in 1885.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nIn a Box car off the track at Whitewood and the ladies in a tent.\n\n16. Where did you settle or take up land? North of Whitewood.\nTo 6 miles North of Whitewood in 1885.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nNone.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nI was Cookie for the CPR gang building the Station Section House and water Tank at Whitewood for September 2 October 1882.\nThere was not a building in the town at that time.\n11. What did your friends and relatives think of your decision to come to Western Canada? They did not know what to think.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Yes\n\n13. What means of transportation did you use? CPR\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nThere was a big Reserve 6 miles North of Whitewood where we arrived at 9:00 PM in 1858 but the Indians were going on the trail there at 9:00 PM. We had to wait until the next day.\n\nThere was a train made up of four weeks' worth of supplies ready to take the Indians from Brandon and 85% of the Indians started trouble in 1858.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? North of Whitewood to 6 miles North of Whitewood in 1858.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How often you came?\n\nI was working on the CPR gang building the Atlantic Station House and worked there at Whitewood from September 2nd to October 1852.\n\nYour area was not a building in the town at that time.\n19. How often did you write to relatives or friends in your old home?  \n   Maybe sometimes every 2 weeks and later not so.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.  \n   I married Miss Fanny Howard Nov. 3, 1895 at St. Luke's Church 12 miles north by Whitewood.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?  \n   No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.  \n   My father came to Brandon in March 1882 and the rest of the family came in Sept. 1882. Two sisters settled married in Winnipeg and two sisters married and settled at Whitewood and my brother did not marry but settled at Whitewood.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?  \n   My father quit the railroad in 1885 and started farming with oxen. He saved 4 crops following and never cut one bushel of corn. The mail was carried by team from Whitewood to Wallace North of Yorkton. So I took the job and when I got to the Assiniboine River it was frozen over in November and I did not know if the ox would carry the outfit or not. No shoes on the horses I got ahead of them and pulled and coaxed them over. (Made me sweat)\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?  \n   I remember one Sunday afternoon my father took the whole family 12 miles with oxen wagon to visit friends. It was quite a treat.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. In there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nI remember our Sunday afternoon my mother took the whole family 15 miles with oxen wagon to visit friends it was quite a treat.\n25. When was the first car used in the community? Maybe around 1914.\n\n26. If you owned a car before 1914, when did you buy it? What make? Bought a Chevrolet in 1919.\n\n27. Where was your trading center? How far from your home? Whitewood, 6 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, we still trade at Whitewood.\n\n29. How often did you shop in the early days? We did not shop very much because we had no money.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? They always did go Saturday and still do.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. No, there is no change; lots of money goes to the mail order houses.\n\n32. When did you first have a telephone and what company provided it? I think in 1914, the Whitewood Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Any one who came in the early days had to stay; they had no money to get out with.\n25. When was the first car used in the community? May 1914\n\n26. If you owned a car before 1914, then did you buy it? Yes\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel etc.)\n\n29. How often did you shop in the early days? We did not shop very much we had no money.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? They always did go Saturday and Sunday.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? What fraction of your total purchases were by mail order and what charges in the preparation of purchases made by mail and since the pioneer period? No there is no charge lots of money go to the small order stores.\n\n32. When did you first have a telephone and what company installed it? elchuck in 1914 Whitehouse Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Any one who came in the early days had to stay they had no money to get our work.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nI think about half of the early settlers moved out. The price of wheat was about $0.25 and I went nearly every year.\n\n35. Did many people move away during the 1930s? Did many return?\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was Chairman of the Grain Growers also of the McKay School for many years in the 1920s. Also, Andrew Jones played in the Whitehead Band for maybe 20 years. I also was councillor for Willowdale Municipality 1933 for 6 years 1930 to 1937.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nMy sons 3 of them started a Pure Breed Hereford Ranch about 1847 and they have some very fine stock imported from a few farms United States & Calgary. They had good success at Toronto Royal last fall (name Davis Bros) they sold a two-year-old heifer to a man from P.E.I. for $3,000.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\nOur school was named after a missionary at the Round Lake Mission Rev Hugh McKay a mission school on the Indian Reserve.\n34. Did any people move away from your district prior to 1947? What reasons had they?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"flirted\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining organizing the first club, etc.)\n\nMy brother and I started a New Beld Sheppard Ranch about 1894 and they have joined everyone block they had good success at Yarwood Royal Court Ball\n\n38. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give:\n\n(a) date of its settlement\n(b) date of its incorporation\n(c) any changes in name since then\n(d) date and reason for change\n\nOur school was named after a Monday at the Round Lake Mission by Rev. Hugh M. Kay\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\nI have three daughters and 3 sons\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter Mrs. Austin Hall Nipawin Saskatchewan\nMrs. Robert Reid Yarrow Kennedy Saskatchewan\nMr. D.J. Poths operates elevator Whitewood 2 children\nMy sons Bert has 2 children Merle Poths 2 Glenn Poths\nWalfred & Darla's June Davis live on farm near Whitewood\nMy son Harold has two Hughie and Ellen Davis\nC.E. Davis lives at home on farm\n\n41. What do you think are the most important changes in your community since you first came West?\n\nEverything is changed we had to sow by hand and do everything by hand\nNow we have drills, tractors, combines, etc., etc.,\nand all the rest of the improvements\nI and my 3 sons work together on farm\nWe have also a herd of Hereford cattle Pure Breed\nMaybe around 75 head\n\nPioneer John Howard Whitewood Sask\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nPioneer Mrs. Edith Ford Esterhazy Sask\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPioneer Charles Davis John Howard Whitewood Sask\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preferences, if any).\n\n49. Have three daughters and 5 sons.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\na. Daughter Mrs. Anna E. Wall\n\nb. Daughter Mrs. Anna E. Wall\n\nc. Son Mr. Reid Reid\n\nd. Son Mr. Reid Reid\n\ne. Son Mr. Reid Reid\n\nf. Son Mr. Reid Reid\n\ng. Son Mr. Reid Reid\n\nh. Son Mr. Reid Reid\n\ni. Son Mr. Reid Reid\n\nj. Son Mr. Reid Reid\n\nk. Son Mr. Reid Reid\n\nl. Son Mr. Reid Reid\n\nm. Son Mr. Reid Reid\n\nn. Son Mr. Reid Reid\n\no. Son Mr. Reid Reid\n\np. Son Mr. Reid Reid\n\nq. Son Mr. Reid Reid\n\nr. Son Mr. Reid Reid\n\ns. Son Mr. Reid Reid\n\nt. Son Mr. Reid Reid\n\nu. Son Mr. Reid Reid\n\nv. Son Mr. Reid Reid\n\nw. Son Mr. Reid Reid\n\nx. Son Mr. Reid Reid\n\ny. Son Mr. Reid Reid\n\nz. Son Mr. Reid Reid\n\nA1. What do you think are the most important changes in your family over the years?\n\nEvery thing is changed and lead to so on\n\nBy hard work by every thing by hard work\n\nNow we have Drills, homes, churches, schools\n\nand all the rest of the surroundings\n\nand my 3 years work together on farms\n\nwe have also a stead of Hereford cattle, Bull Breed\n\nMaybe around 45 head\n\nPovesh John Howard Whitewood\n\nPovesh Mrs. Edith Howard Whitewood\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nPovesh Whitewood\n\nPovesh Whitewood\n\nPovesh Whitewood\n\nPovesh Whitewood\n\nPovesh Whitewood\n\nPovesh Whitewood\n\nPovesh Whitewood\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?... (indicate your preference, if any) ................\n\nI have three daughters and 3 sons\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDaughter Mrs. Austin Hall Whitewood Saskatchewan\nMrs. Robert Reid Farmer Kennedy Saskatchewan\nMy son Bert has 2 children Merle Roth & Glenn Roth\nMy son Harold has two children Hughie and Ellen Davis\nC.E. Davis lives at home on farm\n\n41. What do you think are the most important changes in your community since you first came West?\n\nEverything is changed we had to sow by hand and do everything by hand\nNow we have Drill Press Combines Tractors\nand all the rest of the implements\nand my 3 sons work together on farm\nwe have also a herd of Hereford Cattle Pure Breed\nmaybe around 75 head\n\nPioneer John Howard Whitewood Sask\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nPioneer Mrs. Edith Ford Esterhazy Sask\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPioneer Charles Davis John Howard Whitewood Sask\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\na. Daughters: Mrs. Anna E. Wall, Mrs. Annie J. White, Mrs. Emma J. White\n\nb. Sons: Mr. Peter Reid, Mr. James (Keaney) White\n\nMy own 3 sons have 3 children each. White has 2 children.\n\nI have a daughter-in-law, Mrs. Anna Davis, wife of James Whitehead.\n\nMy eldest son has 4 children, 2 boys and 2 girls.\n\nMy second son has 3 children, 2 boys and 1 girl.\n\nMy third son has 3 children, 2 boys and 1 girl.\n\nFamily thing is charged off had to go by hand and the every thing by hand.\n\nWe have been doing business for years and all the rest of the engagements.\n\nWe have also a stand of heavy load cattle, 25 head.\n\nMaybe around 55 acres.\n\nPovesh\n\nJohn Howard Whitehead\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nPovesh\n\nPovesh\n\nIf anyone else has filled in this questionnaire for you, please have this person sign name and address here.\n\nCharles Davis\n\nPovesh\n\nWhitehead farm\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_370CharlesDavis.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 6481, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2026, 5], [2026, 3913, 6], [3913, 5561, 7], [5561, 6868, 8], [6868, 8282, 9], [8282, 9555, 10], [9555, 11199, 11], [11199, 11993, 12], [11993, 13367, 13], [13367, 14609, 14], [14609, 16331, 15], [16331, 17381, 16], [17381, 19174, 17], [19174, 20858, 18], [20858, 22531, 19], [22531, 23803, 20], [23803, 23958, 21], [23958, 24112, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]