[{"id": "45dc2b44b1fb97eed5cd3b699439e8fdac0f8e6e", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces.\n\nThe extra effort of writing answers is not sufficient space to answer the questions. Don't hesitate to give details or describe particular events. If they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1919, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to complete:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Families in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Emily Melissa (Rouse) Overbaugh\n\n2. Your address: 6021 So Ryan St, Seattle, Wash. 98179\n\n3. Date: ____________________________\n\n4. Where were you born? (Give name of place and country).\n   MEDICINE LODGE, KANSAS. BARBER\n\n5. What was your father's name and occupation?\n   HORACE, EDWARD, ROUSE farmer blacksmith\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   Not sure about month but year was 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Was too young to remember\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   Was 9 years old\n\n9. What were your reasons for coming West?\n   It was homesteaders rights that induced them to come\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Not too sure about that but think government\n1. Your full name: Emily Melissa (Rouse)\n2. Your address: 6031 So. Ryan St., Seattle, Wash.\n3. Date: \n4. Where were you born? (Give name of place and country): Medicine Lodge, Kansas\n5. What was your father's name and occupation?: Horace Edward House, farmer (Blacksmith)\n6. When did you come to Saskatchewan? (Give month and year): Not sure, almost 1900\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Want to go back to New Mexico\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 16 years old\n9. What were your reasons for coming West?: It was Home\n10. How did you learn about the West? (Through other people, Reading about it?): Not to worry, about that but think government\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought he was doing wrong.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Family was 4 of us.\n\n13. What means of transportation did you use?\n   We came by train brought our horses & equipment with us.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   No Indians but we got up their they gave us no trouble and we used to go to their camps and no trouble.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We rented a house at Yorkton Sask.\n\n16. Where did you settle or take up land?\n   My Father took up land about 4 miles south of what is now Stenen Sask.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   We lived in the same place all the time till we came back south.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming & my Dad was a blacksmith.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was doing very well.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nFamily was of us.\n\n13. What means of transportation did you use?\n\nWe came by train through our family equipment with us.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nNo Indians but we got up thin they gave us no trouble and we used to go to their camps and no trouble.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe rented a house at Yorkton Gask.\n\n16. Where did you settle or take up land?\n\nMy father bought land about 4 miles south of what is now my farm.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWe lived in the same place all the time till we came back south.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarming or my Dad was a blue beam.\n19. How often did you write to relatives or friends in your old home?\n   We wrote quite often to our relatives in Kansas.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   We got married in 1919 Feb 13\n   My husband's name was Ray Lorenz Overbaugh\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   They all came when my father & mother did. 3 boys, 3 girls besides myself.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   The good times we had and spent so little money, and we were all healthy & happy.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes, in winter time especially\n   Once or twice a week not over 10 miles\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what places do you mention?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThis good times we had acid opened for little money and we were all healthy & happy.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel? (By water line especially once or twice a week not once 10 miles)\n25. When was the first car used in the community?\n   About 1912. It was a Essex. The first car I ever see.\n\n26. If you owned a car before 1914, when did you buy it? What make? It had hard rubber tires.\n\n27. Where was your trading center? How far from your home?\n   At first Yorkton and later Canora, Sask., and then Stenen, Sask. Yorkton was 60 miles, Canora 20.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes, as the towns came closer we went to them.\n\n29. How often did you shop in the early days?\n   Every three or four months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Around 1914.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We bought all our clothes through mail order catalogues from 1910 on.\n\n32. When did you first have a telephone and what company provided it?\n   As far as I can remember it was 1916 or 1917. The neighbors had phone built on subdivision fence.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   When we came and found it wasn't as we had thought we were not financially able to go back where we came from.\n25. When was the first car used in the community?\n   - About 1912\n\n26. If you owned a car before 1914, then did you buy it? What make? All told how many?\n   - No\n\n27. Where was your trading center? How far from your house?\n   - At least 30 miles away\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   - Yes, we went to Canora, Sask., and then to Stenon, Sask.\n\n29. How often did you shop in the early days?\n   - Every three or four months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - Around 1914\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   - We bought our clothing through mail order catalogue from 1910 on\n\n32. When did you first have a telephone and what company provided it?\n   - We don't know\n\n33. When did you come to Saskatchewan the first time with the idea of staying permanently?\n   - We came to Saskatchewan the first time with the idea of staying permanently.\n\n34. Or did you make up your mind after trying it out? When did you make this decision?\n   - We came to Saskatchewan because it wasn't as we had thought we were not financially able to go back where we came from.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo not till later around 1918 some went to California and some to other places other people moved in.\n\n35. Did many people move away during the 1930's? Did many return?\n\nI left before that time about 1924\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nThe boys belong to a Lodge or two\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI just don't know who organized the lodge and I forget the name of it too.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur school district was named after Crystal Lake. It was a beautiful clear lake. Mr. & Mrs. Tate run the first Post Office and it was called after them. Then when the Village and railroad station came in it was named after the people that owned the land it was built on that was Steven farm.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo, they didn't move around 1918 because we went to California and served in other places.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, there was a lot of movement during that time—about 1924.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nThe boys belonging to a lodge or two.\n\n37. If you or any of your family or friends were \"drafted\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nJust don't know who organized the lodge and just forget the name of it.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person (2) date of its adoption (3) any changes in name and meaning of the name (4) date of its adoption (5) any changes in name since the first name was given, date and reason for change. Give facts of our school district was named after Crystal Lake. It was a beautiful place and it was named after Thine. There was a village and rail road station. Came in it was named after the people that owned the land. It was built on the farm.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nnone\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\nPIONEER CHURCH\n\nThe first years we had church in the homes and the minister would come, and visit us during the week. Then when the school house was built we had church in it.\n\nI remember having to wash my school dress to wear to church. Later on by having parties, ladies aid, we built a library at Crystal Lake, and we all went there every Sunday, we had church that was about 1912.\nPIONEER CHURCH\n\nThe first years we had church in the homes and the minister would come,\nand visit us during the week. Then when the school house was built we had\nchurch in it.\n\nI remember having to wash my school dress to wear to church. Later on by\nhaving parties, ladies aid, we built a library at Crystal Lake, and we all\nwent there every Sunday, we had church that was about 1912.\nPIONEER HEALTH AND HOUSING\n\nThe neighbors were several miles apart when we first went there. There was no roads, no fences, the cattle had free range, and roamed all over.\n\nAfter we got a school house which was two miles from our home, we had to run from one bunch of willows to the next to hide so the cattle wouldn't come after us.\n\nMany times we had prairie fires and the men would either plow a strip or back fire to keep from getting our house burned.\n\nOur health problems were mostly colds and flue. I was never to a dentist until I was 18 and then only had one tooth to fill. My father wasn't well, he had heart trouble and rhumatism. He passed away on July 4, 1910.\n\nOur house was made of logs layed up and plastered with what they called morter, and had a sod roof on it and a dirt floor.\nPIONEER HEALTH AND HOUSING\n\nThe neighbors were several miles apart when we first went there. There was no roads, no fences, the cattle had free range, and roamed all over. After we got a school house which was two miles from our home, we had to run from one bunch of willows to the next to hide so the cattle wouldn't come after us.\n\nMany times we had prairie fires and the men would either plow a strip or back fire to keep from getting our house burned.\n\nOur health problems were mostly colds and flu. I was never to a dentist until I was 18 and then only had one tooth to fill. My father wasn't well, he had heart trouble and rheumatism. He passed away on July 4, 1910.\n\nOur house was made of logs layered up and plastered with what they called mortar, and had a sod roof on it and a dirt floor.\nFOLKLORE IN SASKATCHEWAN\n\nWhen we first lived on the homestead that my father filed on we didn't have a door on the house, no boards to make one with, and one day one of the large pigs came in unexpectedly and ran under the table spilling all the dishes on the floor which was very discouraging. However, Mother must of had extra for I don't remember doing without.\n\nI was very young, but can remember living in a tent and when it rained everything was wet which made an awful chore for my Mother.\n\nMy father and brothers, and some neighbors went bear hunting and got three bears when they got home they took me out and set me on the dead bear. You can imagine my fright. It was dark and I wasn't over 5 or 6 years of age.\nWhen we first lived on the homestead that my father filed on we didn't have a door on the house, no boards to make one with, and one day one of the large pigs came in unexpectedly and ran under the table spilling all the dishes on the floor which was very discouraging. However, Mother must of had extra for I don't remember doing without.\n\nI was very young, but can remember living in a tent and when it rained everything was wet which made an awful chore for my Mother.\n\nMy father and brothers, and some neighbors went bear hunting and got three bears when they got home they took me out and set me on the dead bear. You can imagine my fright. It was dark and I wasn't over 5 or 6 years of age.\nPIONEER FARMING EXPERIENCE\n\nWas a discouraging experience, we lost crops from frost and lost several of the horses from distemper that we had shipped from Kansas. We raised our horses as the years went by. My Dad was a blacksmith and sharpened plow shares for the neighborhood, and he received $.25 for each plow share. He made and mended many other things also.\nPIONEER FARMING EXPERIENCE\n\nWas a discouraging experience, we lost crops from frost and lost several of the horses from distemper that we had shipped from Kansas. We raised our horses as the years went by. My Dad was a blacksmith and sharpened plow shares for the neighborhood, and he received $.25 for each plow share. He made and mended many other things also.\nPIONEER FARMING EXPERIENCE\n\nWas a discouraging experience, we lost crops from frost and lost several of the horses from distemper that we had shipped from Kansas. We raised our horses as the years went by. My Dad was a blacksmith and sharpened plow shares for the neighborhood, and he received $.25 for each plow share. He made and mended many other things also.\nPIONEER FARMING EXPERIENCE\n\nWas a discouraging experience, we lost crops from frost and lost several of the horses from distemper that we had shipped from Kansas. We raised our horses as the years went by. My Dad was a blacksmith and sharpened plow shares for the neighborhood, and he received $.25 for each plow share. He made and mended many other things also.\nSOCIAL LIFE\n\nDances, card parties, ladies aid where we made articles and auctioned them off to highest bidder for church work.\n\nMy mother had the only sewing machine in the neighborhood so we had visitors quite often.\n\nIn summer time the men folks played horseshoes when they had company.\n\nMay brother played violin and often played for dances.\nSOCIAL LIFE\n\nDances, card parties, ladies aid where we made articles and auctioned them off to highest bidder for church work.\n\nMy mother had the only sewing machine in the neighborhood so we had visitors quite often.\n\nIn summer time the men folks played horseshoes when they had company.\n\nMay brother played violin and often played for dances.\nDIET\n\nWe mostly lived off the land at first because we had so far to go to town.\n\nSCHOOLS\n\nOur school was built about 1906 and was 2 miles from our home. We were obliged to walk. School commenced May 1 and as it snowed early in the fall, we had a short school term.\n\nIt was just a one room school with a box heater in the center of the room, and kerosene lamps on each side of the room. My brother being the oldest boy and most trustworthy built the fire in the morning. After we got older my brother drove a horse hitched to a toboggan so our school term was somewhat longer.\nWe mostly lived off the land at first because we had so far to go to town.\n\nSCHOOLS\n\nOur school was built about 1906 and was 2 miles from our home. We were obliged to walk. School commenced May 1 and as it snowed early in the fall, we had a short school term.\n\nIt was just a one room school with a box heater in the center of the room, and kerosene lamps on each side of the room. My brother being the oldest boy and most trustworthy built the fire in the morning. After we got older my brother drove a horse hitched to a toboggan so our school term was somewhat longer.\nWe mostly lived off the land at first because we had so far to go to town.\n\nSCHOOLS\n\nOur school was built about 1906 and was 2 miles from our home. We were obliged to walk. School commenced May 1 and as it snowed early in the fall, we had a short school term.\n\nIt was just a one room school with a box heater in the center of the room, and kerosene lamps on each side of the room. My brother being the oldest boy and most trustworthy built the fire in the morning. After we got older my brother drove a horse hitched to a toboggan so our school term was somewhat longer.\nDIET\n\nWe mostly lived off the land at first because we had so far to go to town.\n\nSCHOOLS\n\nOur school was built about 1906 and was 2 miles from our home. We were obliged to walk. School commenced May 1 and as it snowed early in the fall, we had a short school term.\n\nIt was just a one room school with a box heater in the center of the room, and kerosene lamps on each side of the room. My brother being the oldest boy and most trustworthy built the fire in the morning. After we got older my brother drove a horse hitched to a toboggan so our school term was somewhat longer.\nWe mostly lived off the land at first because we had so far to go to town. Sixty miles is a long way to drive horses. Some had oxen which was still slower. There was lots of wild berries such as Saskatoons, goose berries, pin cherries, strawberries, raspberries, high bush cranberries and choke cherries. We also had rhubarb and currents in the garden which we had lost of, and shared with our neighbors.\n\nWild game was plentiful such as prairie chickens, grouse, partridge and in the fall wild ducks by the thousands. I have known my brothers to get as high as 21 in one day's hunt, and we had wild turkey once. We had a few cattle and hogs and chickens as soon as we had a place to put them.\n\nWe had oatmeal pancakes for breakfast some oats and mush. We couldn't be choosy and lots of dried beans at first, and lots of dried fruit.\nDIET\n\nWe mostly lived off the land at first because we had so far to go to town. Sixty miles is a long way to drive horses. Some had oxen which was still slower. There was lots of wild berries such as Saskatoons, goose berries, pin cherries, strawberries, raspberries, high bush cranberries and choke cherries. We also had rhubarb and currents in the garden which we had lost of, and shared with our neighbors.\n\nWild game was plentiful such as prairie chickens, grouse, partridge and in the fall wild ducks by the thousands. I have known my brothers to get as high as 21 in one days hunt, and we had wild turkey once. We had a few cattle and hogs and chickens as soon as we had a place to put them.\n\nWe had oatmeal pancakes for breakfast some oats and mush. We couldn't be choosey and lots of dried beans at first, and lots of dried fruit.\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford®\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3521.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 38, "total-input-tokens": 63080, "total-output-tokens": 7540, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1649, 5], [1649, 3248, 6], [3248, 4614, 7], [4614, 5497, 8], [5497, 6605, 9], [6605, 7690, 10], [7690, 8736, 11], [8736, 9573, 12], [9573, 11125, 13], [11125, 12379, 14], [12379, 13882, 15], [13882, 15323, 16], [15323, 16354, 17], [16354, 17074, 18], [17074, 17459, 19], [17459, 17844, 20], [17844, 18642, 21], [18642, 19441, 22], [19441, 20164, 23], [20164, 20861, 24], [20861, 21224, 25], [21224, 21587, 26], [21587, 21950, 27], [21950, 22313, 28], [22313, 22658, 29], [22658, 23003, 30], [23003, 23580, 31], [23580, 24151, 32], [24151, 24722, 33], [24722, 25299, 34], [25299, 26133, 35], [26133, 26973, 36], [26973, 27109, 37], [27109, 27263, 38]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]