[{"id": "3dd1265d47444702038edf13b6745f73cd5d5ebc", "text": "What did early homesteaders find out?\n\nA QUESTIONNAIRE\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName ... Albert Hoverson ...\nAddress ... P.A.R.G.A.A ...\nBirthplace ... Ontario ...\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ... 1896 ...\nWhere did you set up housekeeping? ... Caron, Sask.\nWhere had you been living before that? ... In Village of Caron\nFor how many people did you prepare meals? ... 5 ...\nHow far was it to your nearest store? ... 20 miles ...\nHow often could a visit be made to the store? ... Twice a month ...\nWhat groceries did you usually buy in those earliest years?\n\nFlour, Sugar, Tea, Prunes, Beans, Dried Apples\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ... Ogilvie ...\nIn what quantities did you buy it? ... half ton ...\nWhat was the usual price per hundred pounds of white flour? ... Don't remember ...\nHow much did you use Graham flour? ... Yes ...\nWhole wheat flour? ... No ...\nWas flour milled locally? ... Yes ...\nHow far away? ... 60 mi., what year? ... 1896 ...\nWhat was the price for a twenty pound bag of rolled oats? ... about 25 cents ...\nWhat other grain products did you use?\nCornmeal? ... No ...\nWhole wheat? ... Used some ...\nFarina? ... No ...\nOther? ... None ...\nDid you grind your own wheat for porridge? ... Yes ...\nHow did you grind it? ... With roller shaper ...\n6. Buy tea. At what kind of tea did you buy? (name or brand) At what price? $1.00\n\n7. Buy potatoes. What was the price of potatoes per bushel? How much did you pay? $2.50\n\n8. Buy vegetables. What was the price of vegetables per pound? How much did you pay? $0.50\n\n9. Buy fruits. What was the price of fruits per pound? How much did you pay? $1.00\n\n10. Buy preserves. What was the price of preserves per jar? How much did you pay? $1.50\n6. What kind of tea did you buy? (Tea or coffee) Did you buy tea from a store? Yes or No.\n\n7. What kind of potatoes did you buy? (Potatoes or sweet potatoes) Did you buy potatoes from a store? Yes or No.\n\n8. In what years did you first grow your own supply for the table? (Year)\n\n9. How did you grow your own supply? (In bulk or by the bushel) Yes or No.\n\n10. What other dried fruits did you use in the apple butter? (Apples, pears, apricots, peaches, plums, currants, etc.)\n\n11. In the early years did you preserve any foods by freezing? Yes or No.\n\n12. Did you freeze any foods? Yes or No.\n\n13. Did you freeze any foods by canning? Yes or No.\n\n14. Did you freeze any foods by smoking? Yes or No.\n\n15. Do you still preserve foods by canning or smoking? Yes or No.\n\n16. To what extent? Yes or No.\n\n17. Did you freeze any foods? Yes or No.\n| Item                  | Price per lb | Total Price |\n|-----------------------|--------------|-------------|\n| Canned salmon         |              |             |\n| Canned sardines       |              |             |\n| Other canned fish     |              |             |\n| Fish that can't pour  |              |             |\n| Beans (dry)           |              |             |\n| Apples - fresh        |              |             |\n| Apples - dried        |              |             |\n| Lettuce               |              |             |\n| Tomatoes - fresh      |              |             |\n| Tomatoes - canned     |              |             |\n| Bananas               |              |             |\n| Lemons                |              |             |\n| Oranges               |              |             |\n| Corn Chicken          |              |             |\n| Other prepared        |              |             |\n| Breakfast             |              |             |\n| Oranges - five        |              |             |\n| Pearl tapioca         |              |             |\n| Minute tapioca        |              |             |\n| Sago                  |              |             |\n| Dates                 |              |             |\n| Walnuts               |              |             |\n| Icing sugar           |              |             |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout)\n\nIf so, how far was this water from your house?\n\nHow was it brought to the house? (Well, barrel, tank)\n\nFrom springs\n\nMiles\n\nHow early was water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n\nPluh will be about 1900\n| Item                  | Quantity | Notes       |\n|-----------------------|----------|-------------|\n| Canned salmon         |          |             |\n| Canned cardenas       |          |             |\n| Other canned fish     |          |             |\n| Fish that was        |          |             |\n| poured early          |          |             |\n| - gives name          |          |             |\n| Apples                |          |             |\n| - fresh               |          |             |\n| - dried               |          |             |\n| Lettuce               |          |             |\n| Tomatoes              |          | Fresh       |\n| - canned              |          |             |\n| Bananas               |          |             |\n| Lemons                |          |             |\n| Peaches               |          |             |\n| Corn (cobs)           |          |             |\n| Other unpreserved     |          |             |\n| breakfast - dry       |          |             |\n| - eggs                |          |             |\n| Pearl tapioca         |          |             |\n| Minato tapioca        |          |             |\n| Sugar                 |          |             |\n| Dates                 |          |             |\n| Walnuts               |          |             |\n| Ice cream             |          |             |\n\n12. WATER SUPPLY\n\n*Did you get water for drinking and for cooking? (Call, river, spring, dugout)*\n\n*From springs*\n\n*If so how far from your house?*\n\n*How was it brought to the house? (pail, barrel, tank)*\n\n*Distance*\n\n*If not getting water supply, mention any changes which have taken place since last visited.*\n\n*First started here about* 1900\n\n*Pluh well about* 1900\n13. Did you buy laundry soap or make your own? If you made your own, did you use lye? If so, how much? Hot water or laundry soap did the creamer hold? Good and easy.\n\n14. Fuel. What fuel did you use in our first house? How did you get your fuel? Mention any changes in the use of fuel. Have you started a housekeeping plan, planning data sheet possible?\n\n15. Fuel. For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates.) Did you use an outdoor fireplace or bake oven? (Give dates.) By whom was your first cook stove made? Price? That year was it purchased? What types of utensils did you use? (Iron, copper, tin, homemade) For preserving foods? (china, earthenware, wooden bowls, other) Then did you start a housekeeping plan? Aluminer?\n6.\n\n13. Did you buy January newspapers? Yes, I did. Did you use them? Yes, I did. Did you read them? Yes, I did.\n\n14. Fuel. Did you use in December? Yes, I did. Did you use in January? Yes, I did. Did you use in February? Yes, I did.\n\n15. Did you use an indoor fireplace or open hearth in December? Yes, I did. Did you use an outdoor fireplace or bake oven? Yes, I did.\n\nBy whom was your first cook stove made? Priest. When was it purchased? 1896. What types of utensils did you use? (Iron, copper, tin, homestead) For preserving food? (Chili, earthenware, wooden bowls, other)\n\nWhen did you start using aluminum? 1910.\n17. Give a typical dinner menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family within your age at the time. State the approximate month, etc., winter or summer.\n\nBread Butter Beef Pork Potatoes Carrots\n\nPoveshell's family ranging in age from 12 to 60 that was 6 months - years old.\n\none year to 30 that was three\n\n18. That year did you serve your first Christmas dinner in eastern Kansas? List those present, and give their approximate ages at that time.\n\nthe whole family was there\n\n19. Have you ever refused to almost starvation level living for local / produced foods? Give details.\n17. Give a typical day's menu (breakfast, dinner & supper) for the applicant's family. Include the year and list the members of the family with their ages. State the approximate month, e.g., winter or spring.\n\nBread Butter Beef Baked Potatoes\n\nPancakes Oatmeal\n\nPoveshell's family ranging in age from 12 to 65 years old.\n\none year to six months three\n\n18. What year did you serve your first Christmas dinner in eastern Kentucky? Give the date at that time.\n\n19. Have you ever refused to almost starvation level living on one or two locally produced foods? Give details.\nIn early days everything had to be purchased around days you can buy everything myself.\n\nIf you wish\n\nthe change began about 1890 and has changed gradually every since\n20. Mention any outstanding differences in the arrangement of deals in the early days. Everything had to be purchased.\n\n21. We are obliged to rely on personal observation of the market, as compared with today.\n\n22. Please add other details from your early experiences of buying, selling, and operating tools in your early days. Include such matters as prices, quality, methods of merchandising, etc., and other details. Use both of these pages if necessary.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1896_69.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 2940, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1524, 5], [1524, 1524, 6], [1524, 1524, 7], [1524, 1524, 8], [1524, 1960, 9], [1960, 2799, 10], [2799, 2799, 11], [2799, 2799, 12], [2799, 4565, 13], [4565, 6311, 14], [6311, 7088, 15], [7088, 7708, 16], [7708, 8364, 17], [8364, 8934, 18], [8934, 9102, 19], [9102, 9560, 20], [9560, 9560, 21], [9560, 9560, 22]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]