[{"id": "7f5c80ba3c711ae1a4a2190ac019ae246ec924d8", "text": "Please print name and address in capital letters.\n\nYour full name: MRS. ESTHER MAUD GOLDSMITH\nPresent Address: HOOSIER, SASK.\nPioneer Address: WHITEWOOD, SASK.\nYear you came to Saskatchewan: 1897\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE:\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experiences and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About 8.\n\nHow many of these were bachelor's homes? One.\n\n2. How often did you usually visit neighbors? About once a week.\n\n3. Did you usually visit on a Sunday, or other days? Mostly Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Sometimes invited but always welcome.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Without a meal.\n\nWhat about meals? Did you stay when not invited beforehand? Very seldom got away without a meal.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Never heard the term \"potluck\" used. Usually, you must stay for dinner or supper.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Almost always tea. Sometimes lemonade, never any alcoholic beverages.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? The whole family went at courthouse.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? We had many bees, both inside and out.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. Remember one bee, when long, father had stepped down, so the neighbors being gathered to support his crops. Also, these same men took part in nights, so help each other to relieve some of the work, so another, sometimes then.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nAll the dances were in homes. Some were taken over one left out, even though the house were small. Different kinds of games were played including parlor games.\n\nWere these more frequent in later years? Give dates.\n\nYes, they gradually died out. Afterwards schools, balls were built.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? Yes, a plan was followed.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few days how many homes were near enough to you for visiting? How many of these were bachelor's homes? One!\n\n2. How often did you usually visit neighbors? About once a week.\n\n3. Did you usually visit on a Sunday, or other days? Mostly Sunday.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Sometimes invited but always without an invitation.\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to make pot luck used, or was some other expression common?)\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what you remember about such gatherings, giving dates if possible, telling what the bees were for, and how often they occurred.\n\n7. In the earliest years that you knew, were there many parties, whilst drives or dances in homes?\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a week, a month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? Who ever had a hall.\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christian tree, plants, etc.)\n\n9. How much of your social life was centered around the school, not within the school district?\n\n10. Who built it - the community through special funds; the municipality, some organization, etc.?\n\n11. What games were popular in the early days?\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially, etc.?\n\nWe got into a bit of that after our school days. In the small town there was the afternoon for calling and calling cards.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThe neighbors all gathered together with horns, tin lids, & anything that would make a lot of noise, then proceeded to the home of the bridegroom. When they would be invited and have a meal, they would have a real laugh.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nAfter the automobile came things were changed. Baseball sports were organized. Sports days were held in all the small towns so there was not so much neighborhood visiting.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe Grain Growers.\n\nGive the date and reason for it being organized.\n\nIt was a forerunner of the Grain Growers throughout the farmers' co-operative societies such as the Farmers' Co-operative Association.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nIt came from the old Grange which was organized about 1892.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nMost of them!\n\nHow many women belonged? How often did it meet?\n\nOne woman was a member along with her husband.\n\nWhat were some of the activities carried on by this organization?\n\nBuying of goods sometimes a social time lunch.\n\n17. Was there a Homemakers' Club in your district? Not at that time\n\nWhen was it organized? After I was married in 1911\n\nApproximately how many women belonged to it? About 40\n\nDescribe what you remember of its activities and services.\n\nWe built, furnished a hall. Playing for money, putting on social affairs. We took charge of all the social activities in the district. Our hall to this day is very useful for all kinds of meetings & social affairs.\n12. Have attempts at formality or \"snobbery\" do you remember in small towns, such as gloves and hats when calling, calling salutes, visiting treated ceremonially?\n\n13. What the observances known in your community?\n   Describe what you remember about observances, telling how common they were.\n\n14. Describe any other details of visiting, parties, etc., that you remember,\n    telling of any games or amusements that were popular at parties and give approximate dates when they were popular in visiting or social life because not local.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n    Give the date and reason for its being organized.\n\n16. Was there a Saskatchewan grain growers' club in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nPurpose of group, sometimes in a social home lunch\n\n17. Was there a Homemakers' Club in your district? Hot at that time\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nAn agricultural society was organized in 1913. Most of the people took part in it. A hall was built. This carried on successfully until the hard years of the 1930s when we had to disband. Since then the building has been used as a meeting place for women and high school students.\n\nWhat means were commonly used by organizations for raising money? Taking advantage, Putting on dances, Plays, Amateur contests.\n\n19. Where did various organizations hold their meetings?\n\nIn the homes of members, hall after it was built, before that in the different houses.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Not much before 1914.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBally, Wading in the slough, Riding their ponies.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping rope, some ball, some paddling in slough's.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, the name of their president or chairman, and the year they were organized.\n\nOn January 25, 1913, the Women's Club was organized.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, how often? What subjects were discussed?\n\n21. What games did boys play in summer (sandlot baseball, marbles, etc.)?\n\n22. What games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n   At home we played with sleds, slides, skating with the children.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPI. NICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. July 1892.\n\n26. Who organized it? The Orange Lodge.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the entire community.\n\n28. Was it the first picnic held in the community? No.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Games, races, a fine band, plenty of sewing for the children.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? There was a general lunch. Long tables under the trees, everybody sat down.\n\n31. What did you have to eat and drink? Sandwiches, pies, cakes, cookies, \"hot salads,\" lots of tea, lemonade.\n\n32. What time of the day did it start, and how long did it last? It started as early in the day as people could get there and lasted until sundown.\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children live in houses made of wood, stone, or other materials?\n\n25. What games did children play outside?\n\n26. Who organized the school program?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization?\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends bring their own food?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe arrangements were thoughtful, elegant. The leader riding a white horse. There were speeches by different members and a very good band. People sang hymns even in the rain. Everyone was very friendly.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nSome years later there were school picnics but on a smaller scale. Always held in holiday times. Games were always plenty of good races. Very sociable but not all standing like the Orange Lodge picnics.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nSince cars became common, the picnics are becoming a thing of the past. Sports days, a standard thing taken over by the schools. Everyone looks forward to them.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nTrack races, high jumping, long jumping, wrestling, stone throwing. Very popular among everyone. Everyone looked forward to them.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nBaseball league. Played at many local sports days. Teams from all towns in the district.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nAbout 1913 it was used mostly by the children attending our Consolidated School.\n\nWhen was the first indoor rink built, and what was it used for?\n\nIn 1914, used for curling. Most of the men, women, and the district taking part, also high school pupils.\n31. Describe any features of this place which you remember as most enjoyable.\n\n32. What did you like best about this place?\n\n33. What changes have you noticed in places since the first years? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in them (men, women, mostly young people).\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\n36. How long did it continue?\n\n37. Name any other sports teams that were organized before 1914, giving date of organization. If possible, tell something of their activities—played against whom, played in competitions, etc., played in larger contests, etc.\n\n38. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\n39. Then was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held (last month, or any special day, such as May 24th or July 4th).\n\n41. Are there any from your community who have become members of well-known clubs, teams, or other organizations? Give names and dates.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any travelling library books in your community or school?\nGive details and dates.\n\n48. Was there a school library? When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? In the early years of 1930.\n\nWho started it? The Homemakers Club.\n\nIs it still in existence? No.\n\nIf not, when was it discontinued, and why? After times became better, people could afford newspapers and magazines belonging to Reading Clubs. All the books collected in the Community Library before the library was returned to the owners.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nIt was kept in the Homemakers Hall, and certain days were set to exchange the books. Members of the club took turns in acting as Librarian. Everyone who cared about reading used it.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe first papers I can remember were the Family Herald, the Northwest Farmer.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe later dropped the Family Herald as it took so long to come from Montreal. Its place was the Winnipeg Free Press.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes, and also the children's paper, Hilda.\n\nGive dates and tell how and where you got them.\n\nIt must have been about 1894, they were sent to us through the mail.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nAs a child, I was very fond of reading and having no libraries, I often read over several times the little books even the school readers.\n50. Has there ever been a community library in your district or town?\n\nWhen was it started? In what year?\n\nIf not, when was it discontinued? In what year?\n\nIf so, how many people used it?\n\nGive any other details which you can about the library.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe the later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? In the hard times of 1930 on.\n\nWho started it? The Homemakers Club.\n\nIs it still in existence? No.\n\nIf not, when was it discontinued, and why? After times became better, people could afford magazines, along for reading clubs. All the books collected in the community storehouse for the library were returned to their owners.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nIt was kept in the Homemakers Hall. Certain days were set to exchange the books. Members of the club took turns in acting as Librarian. Everyone who cared about reading used it.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe first papers I can remember were the Family Herald, the Homestead Farmer.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWe later dropped the Family Herald as it took so long to come from Montreal. In its place was the Winnipeg Free Press.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes, and also the children's paper, the Willie Winkie.\n\nGive dates and tell how and where you got them.\n\nIt must have been about 1894. They were sent to us through the mail.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nAs a child, I was very fond of reading, and having no libraries, I very often read over several times the little stories from the school readers.\n50. Has there ever been a community library in your district or town? If so, when was it started? For how long has it existed? If not, when was it discontinued, and why? After the library closed, what arrangements were made for borrowing books?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly \"Lady Aberdeen\" packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n   (A couple of them had organs, & several ones played the violin.)\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   (None before 1914.)\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   (My father & mother both liked singing & we all sang, without any instrument. Later my brother taught himself to play the violin.)\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   (A few musical concerts)\n\n60. What were some of the favorite songs in the home?\n   (Remember my parents' songs, years ago. Singing, \"The Pilgrim's song,\" \"Home on the Range,\" \"White Horses,\" & many old Scotch songs.)\n\nin the community?\n   (The Scotch Irish songs were popular)\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   (Mostly Scotch Irish, that was the descent of most people. A little Swedish too.)\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   (Sometimes parodies were made on old songs, but I don't remember doing it.)\n\n63. Was there a band in your community? When was it started?\n   Who started it? How long did it continue?\n   How many were in it? Who was bandmaster?\n   What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n9.\n\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How long did it continue? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nMy hobby was growing things, gardening of all kinds. I planted and took care of most of the trees on our farm. Lots of work on the wild prairie.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nIn the Pioneer days of the Hoosier community, The Homemakers Club was the head of all social activities. After building our hall we made good use of it, putting on dances, plays, musical concerts, Box socials, debates, etc. The proceeds from these affairs soon paid for the Hall's furnishing.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, times of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, fairs, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary.)\n\nThe following was written by someone else:\n\n\"The pioneer days of this town were the head of all. Social activities. Often building our hall was a good use of it, putting on dances, plays, musical concerts, band societies, blebaters, etc. The proceeds from these affairs, some paid for the hall, some for the blebaters.\"\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpecifyz si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1884_1912.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 8243, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1128, 5], [1128, 1128, 6], [1128, 3426, 7], [3426, 4836, 8], [4836, 6501, 9], [6501, 6904, 10], [6904, 9346, 11], [9346, 10645, 12], [10645, 12448, 13], [12448, 13041, 14], [13041, 14714, 15], [14714, 15524, 16], [15524, 17732, 17], [17732, 18671, 18], [18671, 19935, 19], [19935, 21190, 20], [21190, 23007, 21], [23007, 23800, 22], [23800, 25624, 23], [25624, 26567, 24], [26567, 28341, 25], [28341, 29354, 26], [29354, 30914, 27], [30914, 32339, 28], [32339, 32474, 29], [32474, 32628, 30]], "primary_language": ["None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]