[{"id": "efa51195b6bc4bb81c2c4a3c0a7ce1a2c327df3a", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Ernest C. Fletcher\nAddress: Box 89, Kincaid, Sask.\nBirthplace: Worcester, England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1913\nWhere did you set up housekeeping? Hazenmere, Sask.\nWhere had you been living before that? Duff, Sask.\nFor how many people did you prepare meals? 2\nHow far was it to your nearest store? 19 miles\nHow often could a visit be made to the store? Monthly once a week\nWhat groceries did you usually buy in those earliest years? Much the same as now\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? True Rose\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? 3-25\nHow much did you use graham flour? Not often\nWhole wheat flour? Occasionally\nWas flour milled locally? Sometimes\nHow far away? 10 miles\nWhat was the price for a twenty pound bag of rolled oats? 90¢\nWhat other grain products did you use?\nCornmeal? Yes\nWhole Wheat? Some\nFarina? Yes\nOther?\nDid you grind your own wheat for porridge? Sometimes\nHow did you grind it? Usually a neighbour's grinder\nPIONEER DIET: WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Ernest C. Fletcher (Mrs. Ernest C.)\n\nAddress: Box 89, Kincaid, 1913\n\nBirthplace: Woburn, England\n\nCame out in 1905\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1913\n\nWhere had you been living before that? Hayman M.R., S.A.S.R.\n\nFor how many people did you prepare meals? 2\n\nHow far was it to your nearest store? 1 mile\n\nHow often could a visit be made to the store? Usually, twice a week\n\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand or white flour did you use in the early years? None\n\nIn what quantities did you buy it? 100 lbs.\n\nWhat was the usual price per hundred pounds of white flour? 3-25¢\n\nHow much did you use graham flour? 100 lbs.\n\nWhole wheat flour? 100 lbs.\n\nWas flour milled locally? Yes\n\nWhat was the price for a twenty pound bag of rolled oats? 90¢\n\nWhat other grain products did you use?\n\nCornmeal? 100 lbs.\n\nWheat Wheat? 100 lbs.\n\nOther?\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? Normally a neighbour's grinders\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 60¢\n\nWhat brand of golden corn syrup did you use? Edwards\n\nWhat size of tin of syrup did you usually buy? all sizes\n\nAt what price? (not remembered) but cheaper than now\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cow\n\nButter? Our own\n\nEggs? Own\n\nWhat was the price of butter? 25¢\n\nDid you pick eggs for hens? Yes\n\nWater glass for salt?\n\nDid you make butter? Yes\n\nWhat kind of cheese? Sometimes Cottage Cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef & Pork\n\nChicken\n\nHow did you get fresh meat? Panned our own\n\nHow often did you get fresh meat? During Winter\n\nHow did you preserve meat? Canned & Salted\n\nBeef\n\nWas there a \"beef ring\" in your neighborhood? Later yes\n\nIf so what year was it organized? about 1912\n\nDid you use game? Yes\n\nWhat kinds? Prairie Chicken or Rabbit\n\nFor how long? When we could get them\n\nWhat part did fish play in the family diet? Very little\n\nHas the fish fresh, cured, or canned? Canned\n\nKinds? Usually Salmon or Herring\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy? (to nearest $1.00) $6.25\n\nWhat was the price for a ten pound sack of this sugar? $1.25\n\nThat brand of molasses syrup did you use? All States\n\nThat size of tin or syrup did you usually buy? All States\n\nAt what price? (Price of tin included)\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of cream milk in the early days?\n\nButter? Yes\n\nThat was the price of butter? $2.00\n\nDid you pick eggs for hens? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? Sweet Curd Cottage Cheese\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat? Beef\n\nHow often did you get fresh meat? Weekly\n\nHow did you preserve meat? Salted\n\nWas there a \"meat ring\" in your neighborhood? No\n\nIf so what was it organized? No\n\nDid you use films? Yes\n\nFor how long? 1912\n\nWhat part did fish play in the family diet? Very little\n\nWas the fish fresh, cured, or canned? Canned\n\nWas the fish whole, cut up, or filleted? Filleted\n\nWas the fish salted, curried, or seasoned? Seasoned\n\nWas the fish cooked? Yes\n\nWas the fish eaten? Yes\n6. BEVERAGES\n\nWhat kind of tea did you buy? Lipton? Other at what price? 75¢\nWhat kind of coffee did you buy? (beans or ground) Ground\nPrice? about 4.5¢ That other beverages were used? Cocoa\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 30¢\nCould you get potatoes at the store? Yes\nIf not, where from? Out of state\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1926 Carrots 1926 Onions 1926\nTurnips 1926 Beets 1926\nIn what quantities did you buy white navy beans? 10 lbs.\nHow did you buy prunes, (in bulk or by the box)? By the box\nWhat weight? 50 lbs How did the grocer handle prunes (by box)? 40¢\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\nThere were shipped in later years.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Peas? Corn? Beans? Yes\nOther foods? Wild fruit, raspberries, blackberries, currants, blueberries, etc.\nWhat year did you first preserve fruit by canning? 1926\nWhat year did you first preserve vegetables by canning? 1926\nWhat year did you first preserve meat by canning? 1926\nDo you still preserve foods by canning or drying? Yes\nTo what extent? Can all my own fruit & chicken\nDid you make your own vinegar? Yes in early years not now.\n7. **Vegetables and Fruits**\n\n   - What kind of tax did you pay? (Include all you buy) [Handwritten: \"Potatoes, Carrots\"]\n\n   - Price: [Handwritten: $1.50]\n\n   - How much did you pay per bushel? (Price for store)\n\n   - If not, where from?\n\n   - What year did you first grow your own vegetables for the winter of 1924?\n\n   - Potatoes: [Handwritten: 1924]\n\n   - Turnips: [Handwritten: 1924]\n\n   - In what quantities did you buy white navy beans?\n\n   - How did you buy potatoes? (In bulk or by the box)?\n\n   - What was the price of carrots?\n\n   - What other dried fruits did you buy in the earliest days? (Apples, pears, apricots, peaches, etc.)\n\n   - These were shipped in boxes.\n\n8. **Preserving**\n\n   - In the early years did you preserve any foods by boiling?\n\n   - Beans: [Handwritten: Yes]\n\n   - Other foods? [Handwritten: No]\n\n   - What year did you first preserve fruit by canning?\n\n   - What year did you first preserve vegetables by canning?\n\n   - Do you still preserve foods by canning or drying?\n\n   - To what extent?\n\n   - Did you make your own vinegar?\n\n   - Corn all by our own hands?\n\n   - [Handwritten: Yes]\n9. Please fill in the following to record any of your history:\n\n| FOOD                  | Year you first remember buying it in the store | How can it be used? | Any, you usually bought at once time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------|--------------------------------------|---------------------|\n| Soda biscuits         | 1905                                          | All ages            |                                      |                     |\n| Macaroni              | 1905                                          |                     | Do not remember.                     |                     |\n| Graham flour          |                                               |                     | Low.                                |                     |\n| Brown sugar           |                                               |                     | Ration was much cheaper.             |                     |\n| Molasses              |                                               |                     |                                     |                     |\n| Table salt            |                                               |                     |                                     |                     |\n| Common salt           |                                               |                     |                                     |                     |\n| Lily white syrup      |                                               |                     |                                     |                     |\n| Toilet soap           |                                               |                     |                                     |                     |\n| Baking powder         |                                               |                     |                                     |                     |\n| Baking soda           |                                               |                     |                                     |                     |\n| Dried peas            |                                               |                     |                                     |                     |\n| Dried corn            |                                               |                     |                                     |                     |\n| Vinegar               |                                               |                     |                                     |                     |\n| Raisins - seeded      |                                               |                     |                                     |                     |\n|                      |                                               |                     | seedless                            |                     |\n| Rice                  |                                               |                     |                                     |                     |\n| Currants              |                                               |                     |                                     |                     |\n| Store jam - kinds?    |                                               |                     |                                     |                     |\n| Cheese (Cheddar or store cheese) |               |                     |                                     |                     |\n| Vanilla               |                                               |                     |                                     |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? ............................................................ Starter, latex, Phage, bread dough, yeast, baker's.\n\nDid you make yeast for your own use? .................................................. Starter, Using starter? ...........................................\n\nUsing hops? ........................................................................................................ Salt rising? ..........................................................\n\nDid you buy baking powder? ................................................................. Baking soda? ..........................................................\n\nCream of tartar? .............................................................................................. Did you make your own baking powder? ...........................................\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon                             | 1905                                   |                              |                                               |\n| Canned sardines                           |                                        |                              |                                               |\n| Other canned fish that appeared early - give names |                                        |                              |                                               |\n| Apples - fresh                            |                                        |                              |                                               |\n| dried                                     |                                        |                              |                                               |\n| Lettuce                                   |                                        |                              |                                               |\n| Tomatoes - fresh                          |                                        |                              |                                               |\n| canned                                    |                                        |                              |                                               |\n| Bananas                                   | Rarely                                 |                              |                                               |\n| Lemons                                    |                                        |                              |                                               |\n| Oranges                                   | Yes                                    |                              |                                               |\n| Cornflakes                                |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names |                                        |                              |                                               |\n| Pearl tapioca                             |                                        |                              |                                               |\n| Minute tapioca                            |                                        |                              |                                               |\n| Sago                                      |                                        |                              |                                               |\n| Dates                                     |                                        |                              |                                               |\n| Walnuts                                   |                                        |                              |                                               |\n| Icing sugar                               |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ........................................... Well ...........................................\n\nHow far was this water from your home? ........................................... Not far ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................................... Pail ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n| Item                  | Quantity | Unit Price | Total Cost |\n|----------------------|----------|------------|------------|\n| General Storage      |          |            |            |\n| Other General        |          |            |            |\n| Glass Bottles        |          |            |            |\n| Vegetables           |          |            |            |\n| Apples - Fresh       |          |            |            |\n| Apples - Dried       |          |            |            |\n| Lettuce              |          |            |            |\n| Tomatoes - Fresh     |          |            |            |\n| Bananas              |          |            |            |\n| Lemons               |          |            |            |\n| Oranges              |          |            |            |\n| Corn Cakes           |          |            |            |\n| Other Prepared       |          |            |            |\n| Grated Cheese        |          |            |            |\n| Potatoes             |          |            |            |\n| Mashed Potatoes      |          |            |            |\n| Sago                 |          |            |            |\n| Dates                |          |            |            |\n| Walnuts              |          |            |            |\n| Iced Summer          |          |            |            |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, stream, dugout) ...\n\nIf so, how was this water from your home? (Well, barrel, tank)\n\nWas this water brought to the house? (Well, barrel, tank)\n\nFor each water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Made our own.\n\nIf you made your own, did you use lye? Yes... used ashes?\n\nWhat kind of laundry soap did the grocer handle? Laramie, Kent, Buntlinger, Captiva.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal.\n\nWhere did you get your fuel? In the Bluff, around town.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAfter moving to the South West we burned all coal. Now both coal & fuel oil is used. Also Propane & Electric stoves in town.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No.\n\nBy whom was your first cook stove made? The Colony, Trumbull.\n\nWhat year was it purchased? 1905. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nIron & Tin.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nChina & Iron.\n\nWhen did you first see enamel ware? 1916-7.\n\nAluminum? Salt.\n6.\n\n13. What kind of laundry soap do you use? (Give name)\n\nIf you make your own soap, what is it made from?\n\nWhat kind of laundry soap did the grocer recommend?\n\n14. Fuel\n\nWhat fuel did you use in the fall last year?\n\nHave you not used your fuel? In the fall last year?\n\nHas any change been made in the use of fuels which have taken place since you first started housekeeping, giving reasons where possible?\n\nFor burning all coal, fuel oil, or other fuel, also propane, etc., how much was used?\n\n15. Methods of Cooking\n\nDo you use an indoor fireplace or open hearth in the summer?\n\nDid you use an outdoor fireplace or back porch? (Give dates)\n\nBy whom was your first cook stove made?\n\nThat year was it purchased?\n\nWhat type of stove do you use?\n\nFor preparing food (other than bread, roasting, etc.)\n\nWhen did you first see aluminum? (Give date)\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nMost purchases were weighed out in paper bags.\n\nCelophane did not come till the 30's or 40's.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast: Porridge, toast, tea, jam.\n\nDinner: Meat, vegetables, pudding.\n\n18. What year did you serve your first Christmas dinner in eastern Canada? ...................... Give the menu. List those present and give their approximate ages at that time.\n\nThere would be Chicken & Beef,\nvegetables, home grown,\nrelish & English plum pudding,\n& mince-pie.\n\nWe were English you see.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo, but living was reduced to bare necessities in the Drought Period of 1930's.\n17. Give a typical day's menu (breakfast, dinner & supper) for the applicant.\n\n18. What are the chief Christian aims in education? \n\n19. Have you ever been educated in the Diocese?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nSimpler in 1908.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nStill grow much of our own vegetables etc. I now rely on prepared foods more.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in eastern Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nNot so many luxuries, but the fare was good & wholesome.\n21. Start this year to rely on purchased foods and prepared foods instead of homegrown and homemade (as much as possible).\n\nStill grow our own if we can.\n\nVegetables etc. or prepared foods alone.\n\nDon't rely on prepared foods alone.\n\n22. Please add other details from your early experiences of buying groceries and comparing foods in your area during pioneer days. In particular:\n\n- Include items not mentioned above, quality, reliability, price, etc.\n\n- Include problems of storage, shortage, etc., if applicable.\n\nThat's the history, but the fact was\n\nnot so heavy burdens, but the fact was\n\ngood wholesome\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_334.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5061, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1417, 3], [1417, 2777, 4], [2777, 3920, 5], [3920, 5008, 6], [5008, 6404, 7], [6404, 7526, 8], [7526, 12028, 9], [12028, 12028, 10], [12028, 16206, 11], [16206, 17935, 12], [17935, 19059, 13], [19059, 19916, 14], [19916, 20981, 15], [20981, 21162, 16], [21162, 21914, 17], [21914, 22523, 18], [22523, 22523, 19], [22523, 22675, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]