[{"id": "f9564b8b515af0252891d919adbb444a0e78eb35", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Kenyon, Florence A. (Mrs. Henry Joshua)\nAddress: 1892, Kenyon, Mrs. Florence\nLemberg\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start housekeeping in Western Canada? ...........1875\nWhere did you set up housekeeping? ..............................................In the Dominion of Canada\nWhere had you been living before that? .............................................In England\nFor how many people did you prepare meals? .................................About 11 people\nHow far was it to your nearest store? ................................................About 1 mile\nHow often would a visit be made to the store? .................................About twice a week\nWhat groceries did you usually buy in those earliest years? ..................Salt, coffee, dried fruit, oatmeal.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? ....................Path, milled wheat flour\nWhat quantities did you buy? ...............................................................About 40 pounds\nWhat was the usual price per hundred pounds of white flour? ..........About $3.50\nHow much did you use graham flour? ................................................About 10 pounds\nWas flour milled locally? .................................................................Yes\nWhat was the price for a twenty pound bag of rolled oats? ...............About $1.50\nWhat other grain products did you use? ..............................................Cornmeal\nOther? ..............................................................................................Farina\nDid you grind your own what for porridge? ......................................We took it to a mill\nHow did you grind it? .................................................................We had a crusher & we used it a lot\n\nApricot and also in bread.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, S6A 5C2.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1895\n\nWhere did you set up housekeeping? In England\n\nWhere had you been living before that? In England\n\nFor how many people did you prepare meals? About 10\n\nHow far was it to your nearest store? About 10 miles\n\nHow often could a visit be made to the store? About twice a week\n\nWhat groceries did you usually buy in those earliest years? Rye flour, coffee, dried fruit, oatmeal.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Wheat\n\nIn what quantities did you buy it? About 20 pounds per month\n\nWhat was the usual price per hundred pounds of white flour? $3.50\n\nHow much did you use rye flour? About 10 pounds per month\n\nWas flour milled locally? No\n\nWhat was the price for a twenty pound bag of rolled oats? $1.50\n\nWhat other grain products did you use? Cornmeal\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? With a cracker mill\n\nFare? Porridge and also in bread\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy \"sugar\" last summer? \n\nThat was the price for a ten pound sack of white sugar. \n\nWhat brand of golden corn syrup did you buy? \n\nWhat size of tin or syrup did you usually have? \n\nAt what price? \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early years? \n\nWhat was the price of butter? \n\nDid you make butter? \n\nDid you make cheese? \n\nWhat kind of cheese? \n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"meat ring\" in your neighborhood? \n\nIf so, what year was it organized? \n\nDid you use game? \n\nFor how long? \n\nWhat part did fish play in the family diet? \n\nWas the fish fresh, canned, or smoked? \n\nKinds? \n\nSometimes by the tub full, cleaned & salted and smoked them to keep them.\n3. SUGARS AND STAPLES\n\nIn what quantity did you buy this sugar? ________ pounds at a time.\n\nWhat was the price for a ten pound sack of white sugar?\n\nBest brand of golden corn syrup did you buy? ________\n\nWhat also do you usually buy? ________\n\nAt what price? ________\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early years? ________\n\nWe bought our butter. We churned our own cream.\n\nWhat was the price of butter? ________\n\nDid you pack eggs for winter? ________\n\nDid you make butter? ________\n\nWhat kind of cheese? ________\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ________\n\nHow did you get fresh meat? ________\n\nHow often did you get fresh meat? ________\n\nHow did you preserve meat? ________\n\nWas there a \"beef ring\" in your neighborhood? ________\n\nIf so what year was it organized? ________\n\nDid you use names? ________\n\nFor how long did they make a weekly trip? ________\n\nWhat part did fish play in the family diet? ________\n\nCan you recall the fish you ate? ________\n\nKinds? ________\n\nPurchased by the tub full. Cleaned & salted and smoked them to keep them.\n6. Buy:\n\nWhat kind of tea did you buy? \nThat kind of coffee did you buy? \nThat other beverages were made from?\n\n7. Vegetables and Fruits:\n\nWhat was the price of potatoes per bushel? \nCould you get potatoes at the store? \nIf not, where from? \nThat year did you first grow your own supply for the winter of?\nPotatoes \nTurnips \nCarrots \nRadishes \nBeets \nOnions \nCabbage \nApples \nPears \nPlums \nGrapes \nRaspberries \nStrawberries \nBlueberries\n\n8. Preservation:\n\nIn the early years did you preserve any foods by:\nPreserving \nCanning \nPickling \nFreezing \nOther methods?\n\nThat year did you first preserve fruit by canning? \nThat year did you first preserve vegetables by canning? \nThat year did you first preserve meat by canning? \nDo you still preserve foods by canning or drying? \n\nTo what extent? \nDid you make your own vinegar?\n6. **Extraction**\n   - What kind of tea did you buy? (Specify brand) At what price? (Specify amount)\n   - What kind of coffee did you buy? (Specify brand) At what price? (Specify amount)\n\n7. **Vegetables**\n   - What was the price of potatoes per bushel, when you bought them?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What did you first grow your own supply for the winter of?\n   - Potatoes\n   - Turnips\n   - Cabbage\n   - Beets\n\n8. **Preservation**\n   - In the early years did you preserve any foods by?\n   - Peas?\n   - Corn?\n   - Beans?\n   - Other?\n   - That year did you plant grapes? Fruit by?\n   - That year did you plant apples? Apples by?\n   - That year did you plant strawberries? Strawberries by?\n   - Do you still consume foods by similar or different methods?\n\nTo what extent? (Specify) In preference to buying.\n\nDid you raise your own vegetables? (Specify) Not all the time.\n10. Baking\n\nWhat type of yeast did you use? \nDid you make yeast for your own use? \nUsing starter? \nUsing hops? \nSalt rising? \nDid you buy baking powder? \nBaking soda? \nCream of tartar? \nDid you take your own baking powder?\n\nDry yeast cake Royal brown.\n### 11. Fill in the following table:\n\n| Item                  | Approximate price at the store | How did it differ from the same period last year? |\n|-----------------------|--------------------------------|--------------------------------------------------|\n| Fish                  |                                 |                                                  |\n| Meat                  |                                 |                                                  |\n| Vegetables            |                                 |                                                  |\n| Fruits                |                                 |                                                  |\n| Dairy products        |                                 |                                                  |\n| Eggs                  |                                 |                                                  |\n| Bread                 |                                 |                                                  |\n| Butter                |                                 |                                                  |\n| Coffee                |                                 |                                                  |\n| Tea                   |                                 |                                                  |\n| Sugar                 |                                 |                                                  |\n\n### 12. Water Supply\n\n- Did you get water for drinking and for cooking? (well, river, stream, dugout) ________\n- If so, was this water from your home? ________\n- If not, was it brought to the house? (well, barrel, tank) ________\n\n---\n\nOn 1913 we had a well dug close by the house, we had a small pump which filled a tank in the attic. We also had no water on tap in bathroom or kitchen sink. We were in the panhouse.\n13. STAPLES\n\nDid you buy laundry soap or make your own? [Blank]\nIf you used your own, did you use lye? [Blank]\nWhat kind of laundry soap did you use? [Blank]\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? [Blank]\nHow did you get your fuel? [Blank]\nWhat did you use for cooking? [Blank]\nWhat did you use for heating? [Blank]\nWhat did you use for lighting? [Blank]\n\n15. ITEMS OF COMMON USE\n\nDid you use an indoor fireplace or open hearth in the earliest days? [Blank]\nDid you use an outdoor fireplace or bake oven? [Blank]\nBy whom was your first cook stove made? [Blank]\nThat year was it purchased? [Blank]\nWhat types of utensils did you use? (iron, copper, tin, homestead) [Blank]\nFor preparing food? (chips, earthenware, wooden bowls, other) [Blank]\nThen did you first use an electric range? [Blank]\nAluminum? [Blank]\n13. SOAP\n\nDid you buy laundry soap or make your own?\n\nIf you make your own, did you use lye? Yes...no...not sure.\n\nBut kerosene or laundry soap did you choose?\n\n14. FUEL\n\nWhat fuel did you use in the auxiliary house?\n\nThere did you not your fuel?\n\nFrom the furnace, did you cut down wood with an axe, shovel, or other means?\n\nDid you ever change to the use of fuels which have been placed above you?\n\nFirst started housekeeping, what type of fuel did you use?\n\nWe used wood for cooking as long as we could get it.\n\nWe also used a wood stove for heating.\n\nWhen the furnace was installed in 1907, we had hard coal to heat the house.\n\nAfter moving into the new house in 1925, we used oil for heating.\n\nIn the summer, we used a wood stove for heating.\n\nIn the winter, we used a wood stove for heating.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?\n\n(Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nFor show, was your first cook stove made?\n\nThat year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food (boiling, stewing, baking, roasting, boiling, etc.)\n\nThen did you first use natural gas?\n\nAluminum? About 1910\n16. TRADITIONS AND CUSTOMS\n\nDuring the early years, I remember very well how we celebrated Christmas. We always had a big dinner on Christmas Eve, followed by a smaller breakfast on Christmas morning. We would exchange gifts and cards, and there was always a lot of singing and caroling.\n\n17. Give a typical day's menu (breakfast, dinner, and snacks) for the earliest year you can remember. Include the names of the family members who ate at the table, along with their ages at the time.\n\nThe menu for December 25th, 1895:\n\nBreakfast: Pancakes, bacon, and toast.\n\nDinner: Roast beef, mashed potatoes, carrots, and green beans.\n\nSupper: Bread pudding, apple pie, and coffee.\n\nSometimes, we would have an extra course of dessert, such as a fruit tart or a cake.\n\n18. What year did you serve your first Christmas dinner in your parents' home? Give details.\n\nI served my first Christmas dinner in my parents' home in 1999. It was a special occasion because it was my daughter's birthday, and we invited her friends over for a party. We cooked a roast turkey, mashed potatoes, and cranberry sauce, and we had a chocolate cake for dessert.\n\n19. Were you ever refused to almost starvation level living on one locally produced food? Give details.\n\nNo. We always had plenty to eat. The lack of fresh meat was hard to get used to, but we never went hungry. We would often prepare a meal of porridge and quail for dinner when unexpected company arrived, but our guests were always well-fed. At another time of remember, provisions were made. The harvest for eggs to feed incorporated Company.\n16. **TRADITIONAL CHRISTMAS DINNER**\n\n   During the family gathering, the food was prepared in the house. The family would gather around the table for dinner.\n\n   17. Give a typical day's menu (breakfast, dinner, and supper) for the entire family.\n\n   18. Describe how the family would celebrate Christmas Day.\n\n   19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n   Yes. We always had plenty to eat. The lack of fresh meat was hard to get used to, but flour was always plentiful. During the war years, we ate mostly plain, homemade bread and porridge for dinner.\n\n   20. Prepare a meal of porridge and tell me about it.\n\n   When unexpected Company arrived, I put on a few extra pounds. At another time, I remember making the ham for our first Christmas dinner in my parents' home in 1949 at which time, we were still living in the same house.\n\n   21. What year did you serve your first Christmas dinner in your parents' home?\n\n   I have a record of a Christmas dinner in my parents' home in 1949 at which time, we were still living in the same house.\n\n   22. Did you ever have to go without food during the war years?\n\n   No. We always had plenty to eat. The lack of fresh meat was hard to get used to, but flour was always plentiful. During the war years, we ate mostly plain, homemade bread and porridge for dinner.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nAs far as I can remember, we used to get meat from a local butcher, to go along with the vegetables. We would also have milk delivered daily. In the early days, we had to keep the milk cold for the day. In the early days, we had to have a big pot going in the heat of summer to cook a meal. Nowadays, we can have meals cooked with electricity. Large batches of bread had to be baked regardless of heat, whereas we can now buy bread brought into town daily. There was not the variety of foods that there is today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nI did not buy bread until the summer of 1942, the same year I started buying butter.\n\nI have always grown my own vegetables, and still do so. In 1902, we bought canned salmon, and canned tomatoes. Until we retired from the farm in 1942, we always had our own supply of meat either salted or canned. About 1914, we started buying such things as canned corn, cornflakes.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Nathan was outstanding difference in the preparation of meals in the\nsummer days compared with today.\n\n21. Did not buy bread until the summer of 1942. The\nfamily always grown my own vegetables, canned tomatoes,\nand preserved fruits and vegetables. (Give as many details and dates\nas possible.)\n\n22. Please add other details from your early experiences of buying groceries\nand acquiring foods in the years during pioneer life in Montana. Include items not purchased above, quality, methods of preservation,\nprices, problems or stories, photos, etc. (This book of\nnotes needs a cover.)\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1895_65.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4396, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2145, 5], [2145, 3378, 6], [3378, 4257, 7], [4257, 5367, 8], [5367, 6190, 9], [6190, 7106, 10], [7106, 7358, 11], [7358, 7358, 12], [7358, 9256, 13], [9256, 9256, 14], [9256, 10082, 15], [10082, 11355, 16], [11355, 12937, 17], [12937, 14320, 18], [14320, 15801, 19], [15801, 16389, 20], [16389, 16389, 21], [16389, 16389, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]