[{"id": "9aff392eae83d83300e65e7c6b2e28224bd6e23c", "text": "Please print name and address in capital letters.\n\nYour full name: ALFRED N MANN\nPresent Address: LANGLEY, SASK\nPioneer Address: VENN, SASK\n\nYear you came to Saskatchewan: 1906\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realise that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nThe extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n(Signed)\nMEMORIOUS VISITING, PARTIES, ETC.\n\nPioneer Recreation and Social Life.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes? How often did you usually visit neighbors?\n\n2. How often did you usually visit neighbors? Frequently\n\n3. Did you usually visit on a Sunday, or other days? At any time\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? \n\nThat about meal? Did you stay when not invited beforehand? Or was it necessary that two all the supper we shared being a lot?\n\nHow was the invitation to a meal worded when people had come unexpectedly? How was this term to \"take potatoes\" used, or was some other expression common?\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to watch after the house?\n\n6. Did you ever have \"spells\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the spells were for and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, what drives or dances in homes? Describe, generally not enough written for dancing or what drives cards were used for the games.\n\nWere these more frequent in later years? Give dates, especially not enough written for dancing or what drives cards were used for the games.\n\nDid you follow any kind of informal schemes, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? Isolation caused the custom to not come again and at polling it was the custom to not come again.\n\nIt has been said a bachelor trifled the word to decide what was working and to hang over to be on time for the meal. It was wonderful how resourceful a manly settler improvised limited provisions for a meal.\nNEIGHBORLY VISITING, PARTYING, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many homes were bachelor households? How many of these were bachelor households?\n\n2. How often did you usually visit neighbors? Frequently, occasionally, rarely?\n\n3. Did you usually visit on Sundays, or other days? At what time?\n\n4. Have you often invited to other homes, or was most visiting done without invitation?\n\nWhat time of the day did you go? In the morning and spend the day, or in the afternoon, etc.? \n\nWhat about meals? Did you stay when not invited beforehand? Or was the occasion that day all the people were having a meal together?\n\nHow was the invitation to a meal worded when people had some unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to cook after the dinner? Or was there a separate meal for the children?\n\n6. Did you ever have these meetings at someone's house? Or did they take place in a building, like a schoolhouse, or another public building? Tell what you remember about such gatherings. If possible, tell what the \"beast\" were for and how often they happened.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in honor? Describe.\n\nWere these more frequent in later years? Give dates, between which years? How old were adults around for conveniences? Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a month, etc.? If so, did you change the custom to only come again and at pacing it was the custom to only come twice?\n\nIt has been said a bachelor prefers the word to decide what was working and to hurry over to town time for the meal. It has been noted that provisions for the married settler improved limited provisions for a unmarried settler.\n8. Tell what was made of the school house for community dances, box socials, and other activities (include also the school Christmas tree, pictures, etc., if you have not included these on the School Questionnaire). Give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings etc.? If so, describe how the hall was used.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for? With diapers for a fence?\n\nHow were hoppers sheltered and fed in the winter time at these parties? A team of horses hitched to a sleigh would be used to transport the hoppers from the barn to the hall.\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the playhouse, church, parlor, and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. There was no liquor in the beginning, but later there were at times religious sects living among the neighbors and had a mental attitude over some horrible tales and the results to the community. I should agree to stop immediately to work by starvation etc.\n\nReference in #4\n8. Tell what was made of the school house for community dances, box socials, and other activities (include also the school Christmas tree, pianos, etc., if you have not described these on the School Questionnaire). Give dates.\n\n9. What was your first community hall built? How large was it?\n\nWhat material was it made of?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all purposes?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were tables and seats provided?\n\nHow were hoppers sheltered and fed in the winter time at these parties?\n\nA team of horses hitched to a sleigh would be used to convey the guests from the nearest town.\n\n11. What card games were popular in the early days?\n\nHas there card playing for a prize?\n\nWhat dances were popular?\n\nReference in #4\n12. What attempts at formalities, or \"snaps,\" do you remember in small towns, such as those made by the school board when calling cards at the annual town meeting? Describe any incidents connected with them.\n\n13. Was the obverse known in your community?\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can. You may also describe visiting or social life scenes not mentioned here.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led up to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. What attempts at journalism, or \"rurality,\" do you remember in small towns, such as Parry Sound? Were there any newspapers, weekly or monthly, published locally?\n\n13. Was the church known in your community? Describe what you remember about churches, telling how common they were, how they were attended, and any incidents connected with them.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or entertainments not already mentioned that were popular in visiting or social life besides those mentioned above.\n\n15. What was the name of the first organization, if any, that you can remember becoming established in your community?\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Tell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community? (There is space so the church and its auxiliary organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\nQuestion:\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nAs a man could speak intelligently on a lot of topics and yet he was most unfortunate in farm operations and every thing seemed to go wrong on other than farming and crops. He learned for other than farming and crops.\n\nDid you often have magic lantern shows? Have you ever seen one?\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n4. Name any other organizations that were in existence in your community before 1926, giving the name of each, date when it was first organized, its relative size and purpose, who belonged (men, women, young people), whether it included people only in our relatively small area (for example, within a school district), or was carried in the town or village and included the surrounding community. (There is space in the margin for statements for organizations connected with the church so they need not be included here).\n\n13. Where did various organizations hold their meetings?\n\nWhat means were commonly used by organizations for holding meetings? (Churches, halls, schools, etc.)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe the methods used.\n\nDescribe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nA program could speak intelligently on a lot of topics and yet be read most unfortunately.\n\nDid you often have magic lantern shows? Have you ever given dates if possible?\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (sandlot type, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Vauchera\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone unusually busy with some kind of work? Explain. Each were allotted chores.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, geophors or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? \n\n31. What did you have to eat and drink? Home made bread, butter, cheese, jam, pickles, tea with coffee, water, etc.\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? What games were played indoors in winter - card games such as \"Happy Families\", \"Whist\", or other, checkers or other games? Did the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPIERCING AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, for a smaller group, such as a school district, Sunday school, some organization, etc.? (Please write)\n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? (Please write)\n\n31. What did you have to eat and drink? (Please write)\n\n32. What time of the day did it start, and how long did it last? (Please write)\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n34. Describe any different kinds of picnics which you remember as being handled by your school or church.\n\n35. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them (boys, girls, young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving dates of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day? [Handwritten: Mr. Brown]\n   When was the sports day usually held? (what month, or any special day, such as May 24th, or July 1st?)\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them? [Handwritten: Several]\n\nWhat kind of books and how many? A Jewish family had to read them.\n\n44. To what extent did you exchange books with neighbors? It was always a pleasure to read and exchange them.\n\n45. Did you buy many books after you came west? Give details. There was no opportunity also newspapers were scarce.\n\n46. What books were sent to you as gifts in early years? [Handwritten: Magazines]\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? [Handwritten: Yes]\n\nWhen was it begun? [Handwritten: 18th school]\n\nTo what extent were books borrowed from the school library for adults to read at home? Some older residents and I have chosen newspapers from the wind.\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual sports day become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day? [Name]\nThen was the sports day usually held? (what month, or any special day, such as May 24th for July 4th)\n\n41. Are there any from your community who have become members of well-known hockey's hall of fame? Give names and dates.\n\nREADING\n\n42. How many books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us nearly as you can remember how many books you brought, and what kind. (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them? [Name]\nWhat kind of books and how many? A typical family had to read them.\n\n44. To what extent did you exchange books with neighbors? It was always a pleasure to read and exchange new ones.\n\n45. Did you buy many books after you came west? (Give details, where were no opportunity also newspapers were scarce.\n\n46. What books were sent to you as gifts in early years? [Name]\n\n47. Have you ever had any travelling library books in your community or school? Give details and dates.\n\n48. Was there a school library? [Name]\nWhen was it begun? [Name]\nTo what extent were books borrowed from the school library for adults to read at home? [Name]\nSome of the newspapers which were used have been a newspaper which were used\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Who started it?\nWhen was it started?\nIs it still in existence?\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (List of the earliest newspapers and periodicals.)\n\n52. Describe later changes in your subscriptions, telling why you dropped certain ones in subscriptions and added others. (List on hand had an influence more than editorials.)\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. (Occasionally yes and on occasions you may not have been able to read for weeks at a time due to lack of reading materials and pencil money had to be taken leaving a scribbler and pencil on the table and very often that proved too weak to work up his stories.)\n8.\n\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? Are they still being read?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMusical Instrumentation\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home or community? (Were there musical concerts, was there group singing at parties?) Describe. Why? (Describe what kind of music was played.)\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs or make up words to fit an old tune as a joke on someone, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue?\n\nHow many were in it? Who was bandleader?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nThe story of Oregon and Idaho is told by John Brown, who was part of the Idaho contingent on the pioneer trail.\nMusical Instrumentation\n\n56. What musical instruments did you bring with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home social life in early years? In the early days, was there a group singing at parties? Describe. Was there a band or orchestra? If so, what kind? Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody? Because of some special happening in the community? Explain.\n\n60. What were some of the favorite songs in the house?\n\nIn the Community\n\n61. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain. They used to play piano, fiddle, and all present several musical instruments.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody? Because of some special happening in the community? Explain.\n\n63. Has there been a band in your community? If so, when was it started? Who started it? How long did it continue?\n\nHow many were in it? Who was conductor?\n\nWhat instruments were included?\n\nTell what you remember of its activities; how often practice was held; where, if members had uniforms; what events the band played for.\n\nThe Glory Song and Lord, Lord, Lord, I'm Bound to You may be heard part of the hymns on this program.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo record kept but interest likely will never diminish.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nJust survival I have worked for a living since age 13 and have now passed 70.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nA British Guardsman retained his uniform and sabre and was asked for a number at a social and offered to put on a display of swordsmanship as he proceeded. The flashing sword caused a panic and the audience backed up screaming they were afraid he would not be able to keep his hold of the sabre. On another occasion he was refused because of this possibility.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. To music not important or less important in your community than in other communities with the same size population? What is the reason for this difference?\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any connection you may have with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\nPlanned to be uniform and plain and asked for a number at a social and offered to put on the flannel ring sword caused a panic and the audience turned upperambling they worked afraid he would not be able to keep his hold of the saber On another occasion he was refused because of this possibility.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nJust survival I have worked for a living since age 13 and have now passed 70.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nA British Guardsman retained his uniform and saber and was asked for a number at a social and offered to put on a display of swordsmanship as he proceeded the flashing sword caused a pandemonium and the audience bunched up screaming they were afraid he would not be able to keep his hold of the saber. On another occasion he was refused because of this possibility.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. In what or less important is your community interested at present? With the early part of the year, give the reasons why. What do you think will happen throughout the year? Melodies and songs which have been popular in the past.\n\nREQUESTS AND SPECIAL INTERESTS:\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, etc.? If so, give details of this collection, telling when you started it, how you began, and what you have accomplished in connection with it.\n\n67. Did you make notes of the weather, time of sunrise and sunset, time of rising and setting of the moon, etc.? If so, describe them.\n\n68. Describe other hobbies or special interests of those not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL:\n\n70. Describe any outstanding features or incidents of social life, races, entertainments, sports, reading, music, if necessary.\n67. Tell what you remember of the Christmas concerts, type of program, when it was held, if a platform was erected for it, and other incidents connected with it. A usual program on erected stage and extra plank seating, decorations and lighting made up into instead of a rush as that seemed to engage the children and held after school term end to allow the variety of trash to be removed and cleaned up.\n\nTo what extent was the teacher's ability as a teacher judged by the success of her Christmas concert? Give details. A good program was considered a good recommendation for the teacher.\n\nWas there much neighborhood rivalry as to which school could put on the best concert? Explain. Some folk attended the other schools expecting not so good a concert but such things as masters disturbed the results.\n\n68. Tell about any other parties or special events held on particular days, which were a part of the school activity, such as Valentine or Halloween parties, parents visiting the school, etc. If there wasn't up to receive cards and send them to pupils made up their own cards and wrote to revive the memory of past foolish or embarrassing situations. Parents came which the lunch sometimes.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\nSchool was used for all purposes listed in 69 and for a grain growers association meeting place and for the distribution of commodities by cooperation.\n\n70. Was the school yard used for school or community picnics, ball games, etc.? Describe.\n\nThe annual picnic of three schools Bloomfield, Thorntown, and Boulder Lake was in the yard and a Mr. Paulson MPL of Wymond constituency arrived and wanted to address the gathering but was not allowed as he was very intoxicated. Our special speakers topic was progress and achievement by B. B. Munsellman.\n\n71. What differences were there in the way the school was conducted in the first years you were here as compared with the country you came from?\n\nTeachers frequently misspelled and handwriting is very poor and the term \"I see\" quite common also. Schedule for schedule general knowledge vague and they have forgotten lots they should know.\n\n72. What do you think of the school system today as compared with that in the pioneer days? Advanced in all respects and with the high school advantages a pupil should make a special effort to make the grades.\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\nFlorence Johnston BA Hugh McDaniel Clokie Rhodes Scholar Alfred Johnston BA James Gardiner minister of Agriculture Brother and Sister All Teachers at Thorntown SD\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (Use back of page or extra sheets if necessary.)\nTell what you remember of the Christmas exercises—a type of program when it was held, if a platform was essential for it, and other particulars.\n\n67. Tell what you remember of the Christmas exercises—a type of program when it was held, if a platform was essential for it, and other particulars.\n\n68. Tell about any other parties or special events held on particular days, such as Valentine or Halloween.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, or graduation exercises?\n\n70. Describe the school yard used for school or community purposes, ball games, etc.\n\n71. What differences were there in the way the school was conducted in the first years you were here compared with the country you came from?\n\n72. What do you think of the school system today as compared with the pioneer days? Advanced in all respects and with the high school advantages a pupil should make a special effort to make the grades.\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (See back of page or extra sheets if necessary.)\n67. Tell what you remember of the Christmas concerts, type of program, when it was held, if a platform was erected for it, and other incidents connected with it. A usual program or erecting stage and extra plank seating, decorations and lighting a male up Santa instead of a mask as that seemed to please the children and help after school term end to allow the variety of trash to be removed and cleaned up.\n\nTo what extent was the teacher's ability as a teacher judged by the success of her Christmas concert? Give details. A good program was considered a good recommendation for the teacher.\n\nWas there much neighborhood rivalry as to which school could put on the best concert? Explain. Some folk attended the other schools expecting receipt of good concert but such things as measles disturbed the results.\n\n68. Tell about any other parties or special events held on particular days, which were a part of the school activity, such as Valentine or Halloween parties, parents visiting the school, etc. A post office was set up to receive cards on Easter, Valentine, etc. Pupils made up their own cards and verse to revive the memory of dear foolish, embarrassing situations. Parents came with the lunch sometimes.\n\n69. To what extent was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\nSchool was used for all purposes listed in 69 and for a grain growers association meeting place and for the distribution of commodities by cooperation.\n\n70. Was the school yard used for school or community picnics, ball games, etc.? Yes. Describe.\n\nThe annual Picnic of three schools B. Brownfield SD, Thornfield SD Band Brother Luke SD was in the yard and Mr. Hudson M.P.L. of Wymond constituency arrived and wanted to address the gathering but was not allowed as he was very intoxicated. Our special speakers topic was progress general and achievement by B. Brunzelman.\n\n71. What differences were there in the way the school was conducted in the first years you were here as compared with the country you came from?\n\nTeachers frequently mispell and handwriting is very poor and the term \"I see\" quite common also. Schedule for Schedule general knowledge is vague and they have forgotten lots they should know.\n\n72. What do you think of the school system today as compared with that in the pioneer days? Advanced in all respects and with the high school advantages a pupil should make a special effort to make the grades.\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\nFlorence Johnston BA Hugh Mc Dowel Clokie Rhodes Scholar Alfred Johnston BA James Gardiner Minister of Agriculture Brother and Sister All Teachers at Thornfield SD\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (Use back of page or extra sheets if necessary.)\n67. Tell what you remember of the Christmas concert, - type of program, when it was held, if a platform was erected for it, and other matters connected therewith. Describe the platform, decorations, etc., and explain how and why they were arranged.\n\n68. To what extent was the teacher's ability as a teacher judged by the success of his Christmas concert? Give details.\n\n69. Was there much neighborhood rivalry seen in this school? Describe.\n\n70. Was the school building used as a community hall, for church, dances, concerts, organization meetings, special events, etc.? Describe.\n\n71. What differences were there in the way the school was conducted in the first years you were here compared with the way you came from?\n\n72. What do you think of the school system today as compared with that in the pioneer days? Advantages in all respects, any缺点?\n\n73. Did any teachers or pupils from your district achieve distinction or become well known in later years? Give names and details.\n\n74. Describe any special or unusual happenings or incidents in connection with school affairs in your district not already mentioned. (Use back of page or extra sheets if necessary.)\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906K-P_2071.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 9933, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 1119, 4], [1119, 1119, 5], [1119, 1119, 6], [1119, 3191, 7], [3191, 5223, 8], [5223, 7295, 9], [7295, 8611, 10], [8611, 9591, 11], [9591, 10591, 12], [10591, 12130, 13], [12130, 13542, 14], [13542, 14898, 15], [14898, 16197, 16], [16197, 17424, 17], [17424, 18386, 18], [18386, 19982, 19], [19982, 21510, 20], [21510, 22809, 21], [22809, 23765, 22], [23765, 25041, 23], [25041, 26553, 24], [26553, 28173, 25], [28173, 29548, 26], [29548, 31118, 27], [31118, 32246, 28], [32246, 35180, 29], [35180, 36457, 30], [36457, 39434, 31], [39434, 40599, 32], [40599, 40735, 33], [40735, 40889, 34]], "primary_language": ["None", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]