[{"id": "467af9b0e348176163427f1da572e81f0ae8090c", "text": "PETERMAN, Mrs. Elizabeth\nRed Deer Hill.\n\nTo Sask. - June, 1892.\n\nPIONEER QUESTIONNAIRE: A GENERAL QUESTIONNAIRE\n\nA LIST OF CONTRIBUTIONS TO THE PIONEER HISTORY OF SASKATCHEWAN\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual has been able to answer all the questions. Some of the questions may not apply to the experiences of others, but they may prove important for your own life story or for those having black records. The answers should be brief and not sufficient space to answer the questions. If they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them in separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diary: What Did Western Canada Pioneer Do?\" is still being circulated. If you have not already received one, you will be willing to do so; please put a check mark here.\n\nBelow are some of these questions:\n\n- All questions relating to pioneer life conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer trading experiences\n\nInformation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board file at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nIt is difficult to prepare a short questionnaire on pioneer life because no individual has all answers to answer it but knowing the answers of others is a matter of some importance. It will be easy to answer the questions in the order they are given.\n\nThis questionnaire is intended for persons who have lived in Western Canada for more than five years. If you have not lived there for five years, please do not complete this questionnaire.\n\nIf more than one member of the family can answer the questions, they should write their names separately or apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did You Eat?\" was sent out last year. If you have not answered it yet, please put a check mark here ( ).\n\nA later date, some of these are listed below. Please note the ones you would be willing to answer.\n\n| All questionnaires | Pioneer health conditions |\n|--------------------|---------------------------|\n|                    | Pioneer social life, sports and recreation |\n|                    | Pioneer housing |\n|                    | Pioneer education and research |\n|                    | Pioneer traveling experiences |\n\nInformation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPeterman, Mrs. Elizabeth\nRed Deer, Alta.\n\nTo Sask. - June, 1902.\n\nPIONEER EXPERIENCES:\nA GENERAL QUESTIONNAIRE\n\n1. Your full name: Peterman, Elizabeth\n2. Your address: Red Deer, Alta., Canada\n3. Date: March 15, 1902\n4. Where were you born? (Give name of place and country): Kingsland, England\n5. What was your father's name and occupation? (Give name and occupation): John Peterman, Farmer\n6. When did you come to Saskatchewan? (Give month and year): June 30, 1898\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   In Wales, I was born there and lived there until I was about 18 years old. Then I moved to Liverpool, England, where I lived for about 10 years. After that, I came to Canada in 1898.\n\nQ. What were your reasons for coming to Canada?\n\n   We wanted to farm. My husband and I were both farmers, and we thought we could make a good living here.\n\nQ. How did you learn about the West? (Through other people? Reading about it?)\n\n   My mother talked about it a lot, and she always told me how wonderful it was.\n\nQ. How did you get to Canada?\n\n   We came by ship from Liverpool to Quebec City, then by train to Winnipeg, and finally by horse-drawn cart to our homestead near Edmonton.\n\nQ. What was your life like when you first arrived in Canada?\n\n   It was very hard at first. We had to build our own house and clear the land for farming. It was a long and difficult journey, but we were determined to succeed.\n\nQ. Did you face any challenges or difficulties during your time in Canada?\n\n   Yes, we faced many challenges. The weather was harsh, and we had to work hard to survive. But we never gave up, and we eventually became successful farmers.\n\nQ. How did you adapt to life in Canada?\n\n   We adapted quickly. We learned to speak English and to work with the land. We also met many new friends who helped us settle in.\n\nQ. What do you miss most about your time in Canada?\n\n   I miss the freedom and the opportunity to start anew. It was a challenging time, but it was also very rewarding.\n\nQ. What advice would you give to someone considering moving to Canada?\n\n   I would tell them to be prepared for hard work and to have a positive attitude. It can be tough at first, but it will be worth it in the end.\nPeterman, Mrs. Elizabeth\nRed Deer Hill.\nTo Sask., June, 1923.\n\n1. Your full name: Elizabeth J. Peterman\n2. Your address: Red Deer Hill, Sask.\n3. Date: March 15, 1923\n4. Where were you born? (Give name of place and country) England, England\n5. What was your father's name and occupation? (Give name and occupation) Joseph Walter\n6. When did you come to Saskatchewan? (Give month and year) June 3rd, 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nWe moved to Canada in 1895 from England. We came by train and boat to Canada. We had been in Canada for about six months when we moved to Saskatchewan. My father was very hardworking and very kind.\n\nMy mother talked about her childhood and early life in England. She said she missed the countryside and the animals. She also mentioned how much she enjoyed the fresh air and the freedom to move around. She said she was very happy to be in Canada and felt at home there.\n\nMy father worked hard to provide for our family. He was very resourceful and always found ways to make ends meet. He was also very kind and generous to others.\n\nWe learned about the history of the area through our ancestors' stories. They told us about the early settlers and their struggles to survive in the harsh conditions. We also heard about the local wildlife and the plants they used for medicine.\n\nWe visited many historic sites and learned about the culture of the indigenous people. We also learned about the impact of European settlement on the land and its inhabitants.\n\nWe had a wonderful time exploring the area and learning about its rich history. We hope to visit again soon!\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not think much of it.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nMy mother and two children came with me.\n\n13. What means of transportation did you use?\n\nThe train name was the \"Pioneer Express\" in 1895.\n\nWhen my husband came, they thought him a sight.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other significant events)\n\nWe met new people on the train, but we only came to Calgary or Edmonton.\n\nWhen we got on the train from Regina, we thought it was going to be smooth sailing, but then we found out that the train was going to be delayed due to an accident.\n\nWe also heard about the train being delayed due to a delay.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn Prince Albert's road, we stayed at the Prince Albert Hotel.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nMy husband was a farmer in a town called Prince Albert.\n\nAfter he went to town, he started his own business.\n\nHe worked hard and saved money and purchased land.\n\nWe built a house and started our own farm.\n\nTraveling was such a long journey...\n12. What did you think of your friends and relatives when you arrived in Western Canada?\n\n13. How many people came with you? (Family, friends, or other people?)\n\n14. What was the journey like? (Describe any difficulties or challenges.)\n\n15. Where did you first stay when you arrived in Western Canada?\n\n16. How long did you stay there?\n\n17. Did you have any jobs before coming to Western Canada?\n\n18. How did you earn a living before coming to Western Canada?\n\n19. How did you earn a living after coming to Western Canada?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not think much of it. Although they were violent, they came on the prairie train at some point and they moved to town.\n\n12. What was the purpose behind purchasing land in the year 1892?\n\nThe purpose was to acquire land for farming and the children could own their own land.\n\n13. What means of transportation did you use?\n\nWe had a horse and buggy, a wagon or two, and a cart.\n\nWhen my husband came, they thought he was a opportune.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other accidents etc.)\n\nWe traveled by horse and buggy, but we also came to Prince Albert by train. We met a man from Alberta who bought land from us. We traveled through the mountains and across the plains. We encountered many challenges along the way, including harsh weather conditions and difficult terrain.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn Prince Albert's main street, we stayed there for about six months.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nMy husband and I worked on a farm in Prince Albert. We lived on the farm and started a family.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nMy husband and I worked on a farm in Prince Albert. We lived on the farm and started a family.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nMy husband and I worked on a farm in Prince Albert. We lived on the farm and started a family.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nWhy did not think much of it? Although you will not want to come to a farm, in the people who thought of the name.\n\nMy father and two children came over with my husband earlier this year, so you can't imagine how we felt when we heard about it.\n\n12. What means of transportation did you use?\n\nWe have never used any other than our own.\n\nWhen my husband came, they thought he was a favorite.\n\n13. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other setbacks.)\n\nThe trip was very long and tiring, but no one came to help us out.\n\nFrom what they talked on the train, we knew that things would be tough.\n\nChanges as you enter a new world, you must adjust yourself to the changes.\n\nOut west there's nothing like it, you must adjust yourself to the changes.\n\n14. How did you first stay when you arrived in Saskatchewan?\n\nFor Prince Albert, my husband had bought a lot of land and built a small house.\n\nWe then came from Prince Albert to Prince Albert, and then to Saskatoon.\n\nWe lived in a tent on a small farm near Saskatoon until we could afford a house.\n\n15. How did you earn a living before coming to Western Canada? (If after you came)\n\nMy husband worked as a man on the railroad.\n\nAfter we moved to Prince Albert, we started working at the lumber yard.\n\nWe worked at the lumber yard and then moved to Prince Albert.\n\nTraveling was quite hard, but we learned to adapt.\n25. Then was the first car used in the community? 1913.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading contact? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? What was also what proportion of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer days?\n\n32. In 1906: Mail order goods, yes; store goods, no.\n\n33. When did you first have a telephone and what company provided it?\n\n34. Then did you first have a telephone and what company provided it?\n\n35. Would you make up your mind after trying it out? When did you make this decision?\n\nYes.\n25. When was the first car used in the community? 1913.\n\n26. If you owned a car before 1914, then did you buy it? (What makes?)\n\n27. There was your traveling contact? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\n29. How often did you shop in the early days?\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any changes in the proportion of\n\npurchases made by mail order since the pioneer period.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to the community the first time was it with the idea of staying\n\npermanently? Or did you make up your mind after trying it out? Then make this decision?\n\nYes.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes.\n\nMy husband died in 1930. I moved away from here.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible. (Such as owning the first automobile, purchasing the first radio, etc.)\n\nMy husband was a great deal from the Paul Mowbray\n\n37. If you or any of your family or friends were \"afraid\" to have or do something in the district mention it here. Give data wherever possible. (Such as owning the first automobile, purchasing the first radio, etc.)\n\nNo letter and mother was hurt by the neighbor.\n\nMy strong pole and the wind was hurting for the neighbor.\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks, hills, etc.) Try to find out:\n\n(a) origin and meaning of place-name;\n\n(b) date of its adoption;\n\n(c) date and reason for change.\n\nWinners Park called Winners Park because there was a post office there a long time ago.\n\nWhatever you called Winners Park the children worked towards my old put it to grassland. No one else could ever work on it.\n\nOsar Park started as a race on children working towards my old log building. Only got the pasture from the old log building.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old photographs, written recollections and reminiscences (testimony)?\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the archives division of the Legislative Library, Regina, or the archives office at the University of Saskatchewan?\n\nIf you have children or grandchildren, please give their names, addresses, ages, occupations.\n\nIf you have any other information about the family, please give it here.\n\nWhat do you think are the most important changes in your community since you lived there?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nQuestions regarding historical records materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, written recollections and reminiscences? (remember)\n\nNothing of value.\n\nHere is a good collection of such things donated by\n\n[Signature]\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n[Signature]\n\nIf you wish, you can donate your personal papers to the Provincial Archives Division, Regina, or the University of Saskatchewan Archives Office.\n\n[Signature]\n\nIf you have children or grandchildren, please give their names when they were born.\n\n[Signature]\n\nDear Daughter and Granddaughter,\n\nI am writing this letter to you from my home in [City/State/Country]. I hope this message finds you well.\n\n[Signature]\n\nWhat do you think are the most important changes in your community since you first came here?\n\n[Signature]\n\nPoveshell, Hi there, how's everything going? I'm doing well, thank you for asking.\n\n[Signature]\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_549.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4740, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1687, 5], [1687, 3189, 6], [3189, 5466, 7], [5466, 7141, 8], [7141, 8465, 9], [8465, 8988, 10], [8988, 10654, 11], [10654, 12210, 12], [12210, 12210, 13], [12210, 12210, 14], [12210, 13132, 15], [13132, 14003, 16], [14003, 15431, 17], [15431, 15431, 18], [15431, 16404, 19], [16404, 17798, 20], [17798, 17945, 21], [17945, 18099, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]