[{"id": "a718e27de13607520d6d149ccc0b3651d881d428", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Marie Sinclair\n2. Your address: 3113 Victoria Ave Regina Sask.\n3. Date: July 11, 1962.\n4. Where were you born? (Give name of place and country): Wheaton Minnesota U.S.A.\n5. What was your father's name and occupation?: Hans E. Melvin Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 16 years\n9. What were your reasons for coming West?: Came with my stepfather Mother & family of 4 sisters\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through other people.\n11. How did you earn a living before coming to Western Canada? How, after you came?: House mainly Tableau hallways hotels I knew Mommy. My Dad was a farmer.\n1. Your full name: Marie Sinclair\n2. Your address: 3113 Victoria Ave Regina Sask.\n3. Date: July 11, 1962.\n4. Where were you born? (Give name of place and country): Waterton, Minnesota U.S.A.\n5. What was your father's name and occupation?: Hans E. Sinclair Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1903.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?: Came with boy step brother mother & family of 6\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through other people.\n\nHow did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through other people.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Some thought it a good move, some did not.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With my family.\n\n13. What means of transportation did you use?\n   A freight train with a few implements and the stock & house held, with a car for the family's at the back of train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   We did stop at places to feed & water the stock. But don't remember where or how many times.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At a section house at Macoun Mr & Mrs Wils Hanson. The only place to get a meal or a bed.\n\n16. Where did you settle or take up land?\n   My parents, ¼ section 3 Township 5 Range 10, Macoun.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Since Dec 1942 in Regina Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   House Maid, Table waiter in hotels & house Maid.\n   My Dad was a farmer, on the farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nSome thought it a good idea, some didn't.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\nWith my family.\n\n13. What means of transportation did you use?\nA freight train with my belongings and the stock & horse trailer with a car for the family at the back of train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nWe did stop at places to feed & water the stock. But don't remember very far away times.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAt a settler's house, at Maclean's. Mrs. Wils Hanson. The only place to get a meal on a bed.\n\n16. Where did you settle or take up land?\nMy parents, by auction, 3 Townships Range 10, Municipality.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nWinter 1942 in Rigener's.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nHow many jobs I had, not sure. My dad was a farmer.\n19. How often did you write to relatives or friends in your old home?\n   *Handwritten*: not very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   *Handwritten*: Colin Alexander Sinclair, Nov 22, 1905.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   *Handwritten*: No not that I know off.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   *Handwritten*: As early as 1904 if there was a house or something to go for.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   *Handwritten*: No drinking water to be found so we dipped it out of a slough & strained it through a cloth. There were little red bugs or insects we called them wigglers, then boiled & cooled it not very tasty. The tea was black & we were used to green tea, also the butter they served was red with color & surely didn't taste like butter and there were no roads, we followed our tracks back.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   *Handwritten*: Not too much, by buggy. 4-8 miles.\n\n   We did go to Estevan to get our coal to burn right from the mine about 24 miles with horses & wagon. Sell so furniture & things like that.\n19. How often did you write to relatives or friends in your old home?\n   met very often.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Tom Alexander Sinclair Nov. 22, 1905.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n   No one else came.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   We drinking water to be found so we dipped it out of a slough & strained it through a cloth. There were little red bugs on water we called them wigglers, then boiled & cooled it out very tasty. The tea was black & we were used to green tea, also the butter they served was red with color & surely didn't taste like butter & with no flavor at all.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.)\n   How often? By what means of travel?\n   Not too much, by buggy.\n\n   We did go to Edmonton to get our coal to burn right from the prairie about 24 muls. with horse & wagon. All so primitive & things like that.\n25. When was the first car used in the community? Mr. Westgard our banker had 1913 a Krit.\n\n26. If you owned a car before 1914, when did you buy it? What make? Ward. Not before 1914 - 1918 I think.\n\n27. Where was your trading center? How far from your home? Macoun. 4 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Circle a few some did return.\n\n29. How often did you shop in the early days? When ever the flour bag got empty as we had lots of meals with just bread & gravy.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? As early as 1904 if there was a dance or something to go for.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. Maybe 1906 or 7 we did send for clothing. To Eaton's Winnipeg, and I also bought groceries from Neal Bros. in Winnipeg by Mail.\n\n32. How did the places in your community get their names? (School districts, bus stations, colleges, railway stations, creeks, hills, etc.) Try to give: (1) name and composition of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give full information about each name.\n\n33. When did you first have a telephone and what company provided it? My dad had one of the first Telephone but don't remember when. The Elsworth Telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? My Father came with the idea to staying permanently & he did. I made up my mind when I married a Canadian although he has been gone 5-6 years I am still here.\n25. When was the first car used in the community? Had 1913 a Knut.\n\n26. If you owned a car before 1914, when did you buy it? What make? A Model T.\n\n27. Where was your trading center? How far from your home? Macomb 14 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) No.\n\n29. How often did you shop in the early days? Usually over the floor bag.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? As early as 1904 if there were a dance we could go some thing to go for.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nProbably 1906 or 7 we did send for clothing. To Eaton's in Winnipeg, and also bought groceries from Hall Bros. in Winnipeg by mail.\n\n32. When did you first have a telephone and what company provided it?\n\nMy dad had one of the first telephones but didn't remember who.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you move up your mind after trying it out?\n\nPermanently & he did. I made up my mind when I married a Canadian although he has been gone 6-7 years & came till here.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nHave given them to friends living there.\n\n35. Did many people move away during the 1930's? Did many return?\n\nQuite a few some did return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy Husband was on the Municipality Council for 18 years. (year not visible)\n\nAbout 1924 — till 1942.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe were the first to have own & we did have 12 mix in each team. Six black & mixed we did do custom work. Breaking up the prairie.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here.\n5. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n34. Did many people move away during the 1920's? Did many return?\n\n35. Quilt a few some did return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was on the County Council for 18 years. Eymil No 36.\n\nAugust 1924 — till 1942\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nWe were the first to have own a car. We had a horse and buggy. We were the first to have a car in each town. We had a horse and buggy. We were the first to have a car in each town. We had a horse and buggy.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nHave given them to friends & neighbors to send to you.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI do have 7 children, 13 grandchildren, 10 Great Grandchildren scattered all over. Now a widow living by myself.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt is a nice farming place when it rains, like a green carpet this year.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nHave given them to friends & neighbors\n\nTo send to you.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office of the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI do have 7 children, 13 grand-\n\nchildren. 10 great-grandchildren\n\nattended all over. Own a widow\n\nliving by my self.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIt is a nice farming place when\n\nit rains, like a green carpet this\n\nyear.\n\nPlease give the names and addresses of other pioneers who could answer\n\nthis questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this\n\nperson give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_728.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4532, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1354, 5], [1354, 2353, 6], [2353, 3577, 7], [3577, 4732, 8], [4732, 6209, 9], [6209, 7485, 10], [7485, 9514, 11], [9514, 10933, 12], [10933, 12403, 13], [12403, 13697, 14], [13697, 14938, 15], [14938, 16193, 16], [16193, 16193, 17], [16193, 16347, 18]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]