[{"id": "aa121273a49af8303ea3e6f79a0d856480673f73", "text": "Hogg, Robert John\nCarmuth, 1892\n\n1. FAMILY HISTORY\n   - Year did you start homesteading in eastern Canada? 1873\n   - Where did you see no boundaries? Ontario\n   - Where had you been living before that? Ontario\n   - For how many people did you prepare meals? 5\n   - How far was it to your nearest store? 1 mile\n   - How often could a visit be made to the store? 1 time per month\n   - What groceries did you usually buy in those earlier years? Sugar, flour\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   - What brand of white flour did you use in the early years? Five Roses\n   - In what quantities did you buy it? 100 pounds\n   - Was there any local mill? No\n   - What was the price for a twenty pound bag of rolled oats? 50 cents\n   - Did you grind your own wheat for flour? Yes\n   - How did you grind it? Grain grinder\nHagg, Robert John\nGarfield, 1892\n\nInstructions: Fill in as much of the following questions as possible.\n\n1. Where did you grow up? Ontario\n   Address: Garfield, Ontario\n   Name: Robert John Hagg\n   Age: 35\n   Occupation: Farmer\n\n2. How many people did you live with? 4\n   How often do you visit your parents? Monthly\n   What materials did you usually buy in those years? Flour, sugar, tea\n\n3. Flour and other grain products\n   What brand of flour did you use in the early years? Five Roses\n   What was the price per pound of flour? $1.50\n   Did you buy flour locally? Yes\n   What other grain products did you buy? Cornmeal, oats\n   Did you grind your own flour? Yes\n\n4. Steam or electric power\n   What was the price for a twenty-five horsepower steam engine? $1,200\n   Did you have electricity? No\n   Did you think your own wheat for perishable? Yes\n3. SEEDS AND STAPLES\n\nIn what quantity did you buy? \n\nThat was the price for a 7 pound sack of white sugar? \n\nThat brand of golden corn syrup? \n\nThat size of tin of syrup? \n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nThat was the price of butter? \n\nDid you pack eggs for winter? \n\nDid you make butter? \n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? \n\nHow did you get fresh meat? \n\nHow often did you get fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"beef ring\" in your neighborhood? \n\nIf so, what year was it organized? \n\nDid you use names? \n\nFor how long? \n\nWas the flesh fresh, cured, or canned? \n\nKind of fish?\n3. **JUNKET AND STRAWS**\n\nIn what quantity did you buy milk? **2 QUARTS**.\n\nWhat was the price for a half pound each of cheese? **$1.00**.\n\nWhat brand of galvanic corn syrup did you use? **GEORGE HINE**.\n\nHow much of this syrup did you usually buy? **1 QUART**.\n\nAt what prices?\n\n---\n\n4. **DAILY ECONOMY**\n\nHow did you get a supply of fresh milk in the early days? **I CAME TO THE MARKET AND BOUGHT MILK**.\n\nDid you make butter? **YES**.\n\nIf so, how many pounds? **50**.\n\nDid you pack eggs for market? **NO**.\n\nDid you make butter? **YES**.\n\nWhat kind of cheese?\n\n---\n\n5. **MEAT AND FISH**\n\nWhat was your meat supply in the early days? **BEEF, LAMB, CHICKEN, PIGS, AND GAME**.\n\nDid you get fresh meat? **YES**.\n\nHow often did you get fresh meat? **EVERY DAY**.\n\nDid you preserve meat? **NO**.\n\nWas there a \"meat plant\" in your neighborhood? **NO**.\n\nIf so, what was its operation? **NO**.\n\nDid you use game? **YES**.\n\nWhat kind? **DEER**.\n\nFor how long? **NO**.\n\nWhat part did fish play in the daily diet? **FRESH CAUGHT**.\n\nWas the fish fresh, canned, or salted? **FRESH**.\n\nKind? **Pike, Suckers**.\n6. **AVOCADO**\n   - What kind or size did you buy? (name or variety) **AVOCADO**\n   - How much did you pay? (cents or amount) **NAME**\n   - What other varieties were usually available?\n\n7. **VEGETABLES AND FRUITS**\n   - What was the price of potatoes per bushel when you last bought them?\n   - Could you get potatoes at the store?\n   - If not, where from? **NEIGHBORHOOD**\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes **YES**\n     - Cabbages **NO**\n     - Turnips **NO**\n     - Beets **NO**\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes? (in bulk or by the box?) **BY BOX**\n   - How did the grocer usually prune? (by box) **BY BOX**\n   - What was the price of prunes? **35¢**\n   - What other dried fruits did you use in the summer? (apricots, raisins, currants or others?)\n\n8. **PRESERVATION**\n   - In the early years did you preserve any foods by:\n     - Peas? **NO**\n     - Beans? **NO**\n     - Corn? **NO**\n     - Other foods? **NO**\n   - That year did you first make pickles? **NO**\n   - What year did you first make jelly? **NO**\n   - That year did you first preserve meat by canning? **NO**\n   - Do you still preserve foods by canning or drying? **NO**\n   - To what extent? **NO**\n   - Did you make your own vinegar? **NO**\n### 1. Baking\n\n| Item                  | Price |\n|-----------------------|-------|\n| Soda bicarbonate      | $890  |\n| Granulated sugar     | $890  |\n| Brown sugar           | $890  |\n| Molasses              | $890  |\n| Table salt            | $890  |\n| Cinnamon salt         | $890  |\n| Lily white sugar      | NONE  |\n| Yeast                 | NONE  |\n| 10 pounds per year    |       |\n| Baking powder         |       |\n| Cow brand baking soda |       |\n| Split peas for soup   |       |\n| Dried corn            | NO    |\n| Malt vinegar          | ONEQUARTER |\n| Raisins               | NOT SEDED |\n| Glassless             | $1930 |\n| Rice                  | IN BULK |\n| Currents              | $890  |\n| Store jam             | $890  |\n| Choose (cheesecloth)   | $75 CENTS |\n| or store cloth        |       |\n| Vanilla               | $893  |\n| Small bottles         |       |\n\n10. Baking\n\n- What type of yeast did you use? **Rayna yeast**\n- Did you make yeast for your own use? **YES**\n- Using starters? **YES**\n- Using hops? **YES**\n- Salt rising? **YES**\n- Did you buy baking powder? **YES**\n- Baking soda? **YES**\n- Cream of tartar? **YES**\n- Did you make your own baking powder? **YES**\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (call, river, slough, dugout) WABAMOYA RIVER.\n\nIf so, was it brought to the house? (pail, barrel, tank) PAIL, BARREL.\n\nBag arling water supply, mention any charges which have taken place since you first started homesteading, river dates where possible. WATER PLentiful.\n\nIN THIS DISTRICT SPRINGS FLOWING CREEK AND SOME FLOWING WELLS. MOVED TO SASKATCHEWAN 1900.\n\nAT THAT TIME, CALLED NORTHWEST TERRITORIES\n12. WATER SUPPLY\n\nThere will you get water for drinking and for cooking? (e.g., river, stream, dugout) W.E.A.A. SASKATCHEWAN RIVER.\n\nIf not for this water from your house? W.E.A.A. SASKATCHEWAN RIVER.\n\nHere was it brought to the house? (pail, barrel, tank) PAIL, BARREL, TANK.\n\nFor another water supply, mention any changes which have taken place since you first started homesteading, giving dates where possible. W.E.A.A. PLAINFIELD.\n\nIN THIS DISTRICT SPRINGS, FLOWING CREEK AND SOME FLOWING WELLS. MOVED TO SASKATCHEWAN 1900.\n\nAT THAT TIME, CALLED NORTH-WEST TERRITORIES\n13. Did you buy laundry soap or make your own? Bought.\n\nIf you made your own, did you use lye? Yes\n\nWhat kind of laundry soap did the grocer sell? Lysol\n\n14. Fuel\n\nWhat fuel did you use in the earliest days? Wood, Coal\n\nHave you not your fuel? Gas, Oil, Kerosene, Wood, Coal\n\nFrom where did you get your fuel? From the nearest town, From the nearest city, From the nearest state, From the nearest country\n\nDid you ever have any chance in the use of fuels that have been placed since you first started housekeeping? Giving dates where possible, Started using Coal/Oil Stoves 1912\n\n15. Beginnings of Commerce (continued)\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nWhen was your first cook stove bought? Name—Saukville\n\nThat year was it purchased? 1893\n\nWhat type of utensils did you use? (Iron, copper, tin, homestead)\n\nIron, Tin, Granite\n\nFor preparing food? (Utensils, stovetop, pans, bowls, other)\n\nEarthenware\n\nWhen did you first use animal fats? 1900\n\nAluminum? 1912\n13. JAMES\nDid you buy laundry soap or make your own bought?\nIf you made your own did you use soap made at home?\nWhat kind of laundry soap did the greater number buy?\nFROM THE KEMMONTOWN, 35 MILES...SOUTH OF BARRIE, ONTARIO\n\n14. FEEL\nThat food did you eat in the month last August were:\n- Bread\n- Meat\n- Fish\n- Vegetables\n- Fruits\n- Other\n\n15. COAL/OIL STOVES\nCoal/oil stoves, 1912\n\n16. FIREWOOD\nDid you use firewood to heat your house?\nFor cooking, did you use an indoor fireplace or open hearth in the coldest days? (Give dates) A.O.\nDid you use an outdoor fireplace or bake oven? (Give dates) A.O.\n\n17. MAKE - SAILOR'S ENGINEER\nBy then was your first cook stove maker?\nWhen was it purchased? A.O.\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\n18. GRANITE\nFor preparing food? (Glass, earthenware, porcelain, bottle, other)\n\n19. EARLIER WARE\nWhen did you first use animal sorei?\n\nAluminum? A.O.\n16. Give a typical day's menu (breakfast, dinner & supper) for the earliest generation in your family. Include the names of the members of the family with their ages at the time. State the approximate month, year, or season.\n\nBreakfast—Oatmeal porridge, bread and milk, butter\n\nDinner—Meat, potatoes, pie or pudding, bread, butter, tea\n\nSupper—Meat, potatoes, fruit, bread, butter\n\nNo—Father 50 years old, Father's partner in farming part-time\n\nDaughter 14 years old, farming part-time\n\nSon 11 years old\n\n17. What did you serve for Christmas dinner in eastern Canada?\n\n18. Have you ever reheated to illustrate storage and living conditions in the local area? If so, describe.\nGive a typical day's menu (breakfast, dinner & supper) for the earliest year in which your parents lived at this place. Include the number of the family members living there.\n\nBreakfast — oatmeal porridge, bread and milk, butter, tea, dinner — meat, potatoes, pie or pudding, bread, butter, supper — meat, potatoes, fruit, bread, butter.\n\nNo — Father 50 years old, Fathers partner 47, daughter 14 years old, farming part-time.\n\nSon 11 years old.\n\nWhat did you serve your first Christmas dinner in eastern Canada?\n\nGive the date, location, food served, etc., at that time.\n\nWere you ever refused to admit starvation? Local or national? Give details.\n21. When did you begin to rely on prepared foods and processed foods instead of homemade and home-prepared foods? (Give as many details and dates as possible).\n\n22. Bought bread and some cereals in 1914.\n\n23. Plans and other details from your early experiences of buying groceries.\n\nCan you tell me about the paid for from wages paid in 1893 by first employer, which was paid in 11 year old boy's wages as agreed upon farm work and finally paid for cows' wages 50 cents per day.\n\nCow had calf one year old which was traded for a third cow. Who supplied pork for household—other calves supplied beef for each. Pork was cured in brine in barrel storage was made in cellar. Fish was packed in dry salt making its own brine.\n\nEarned hens and booster doing chores for neighbor while he was away for egg supply. My sister was married in 1897.\nMORE FRESH AND CANNED VEGETABLES AND FRUITS\nCAKES ETC., BOTH HOMEMADE AND PURCHASED.\n\n21. When did you begin to rely on purchased foods instead of homemade? Bought bread and some cereal in 1914.\n\n22. Please add other details from your early experiences of buying groceries and everyday foods in other years. Include prices of merchandise, methods of purchasing, etc.\n\n23. Paid $11 per year old cow, which was traded for a third cow. The price supplied pork for household use. Other calves supplied beef.\n\nEach cow was valued at $500.\n\nFarm storage was earth cellar; fish was packed in dry salt making its own brine.\n\nEarned hens and doves doing chores for neighbor. While he was away for egg supply, my mother was married in 1897.\nFrom then on we had various house-keepers but batched most of the time. We moved to the Storthoaks district in Saskatchewan in 1900.\nFrom then on we had various house-keepers but batched most of the time. We moved to the Storthoaks district in Saskatchewan in 1900.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1893_56.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4116, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 811, 5], [811, 1661, 6], [1661, 2377, 7], [2377, 3478, 8], [3478, 4784, 9], [4784, 4784, 10], [4784, 5979, 11], [5979, 5979, 12], [5979, 6457, 13], [6457, 7030, 14], [7030, 8108, 15], [8108, 9025, 16], [9025, 9701, 17], [9701, 10350, 18], [10350, 11187, 19], [11187, 11918, 20], [11918, 12051, 21], [12051, 12184, 22], [12184, 12184, 23], [12184, 12184, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]