[{"id": "67ef896e6a2c248fcd7caba6fa6be18890e919eb", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions may not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank answers.\n\nDon't hesitate to give details, or describe particular events, answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan, Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA void of examination to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank questions.\n\nUse extra sheets of paper if there is not sufficient space to finish the questions.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n[X] All questionnaires\n[X] Pioneer diet\n[X] Pioneer schools\n[X] Pioneer churches\n[X] Pioneer recreation and social life\n[X] Pioneer farming experiences\n[X] Folklore in Saskatchewan\n[X] Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan.\n1. Your full name: M.S. Dickson\n2. Your address: 123 Main St., Anytown, USA\n3. Date: July 17, 1953\n4. Where were you born? (Give name of place and country): Anytown, USA\n5. What was your occupation at that time? (Give name of occupation): Teacher\n6. When did you come to Canada? (Give date and place): July 17, 1953, Anytown, USA\n7. Mention any other places where you lived before coming to Canada: Anytown, USA\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you were not or are not now a citizen of Canada): 18 years old\n9. What were your reasons for coming West? (Give name of reason): To find work\n10. How did you learn about the West? (Through other people's hearing about it): From friends and family\n\n[Handwritten text not legible]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How did you come?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you have?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? (If you were a farmer, how did you earn your living?)\n\n19. Mention any other things you would like to add about your experiences in Saskatchewan.\n25. When was the first car used in the community? (Date)\n\n26. If you owned a car before 1914, when did you buy it? (What make?)\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new appearance, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you cease to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community? (Date)\n\n26. If you owned a car before July 1914, when did you buy it?\n\n27. Where was your traveling agency? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes since 1914.)\n\n29. How often did you shop in the early days?\n\n30. When did your district first start going to town regularly?\n\n31. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order during the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time and why?\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n\nWhen the town came to be called a certain name, it was because...\n34. Did any people move away from your district prior to 1924? What persons did they have for neighbors?\n\n35. Did many people move away during the years 1924-1942? Did many new ones come in?\n\n36. If you or some member of your family have held public office, or have been elected to any organization, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"citizens\" to have or do ever (such as owning the first automobile), mention it here, giving date shown as possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. What was the name of your town when it was founded? What was the name of your county when it was founded? What was the name of your state when it was founded?\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old newspapers, old photographs, written recollections and concepts (describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave always been a builder\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, antique books of community organizations, old photographs, old newspapers, written records sections and reminiscences? (described).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nFirst came here:\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_685.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3171, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1461, 5], [1461, 3107, 6], [3107, 3107, 7], [3107, 3901, 8], [3901, 4562, 9], [4562, 5353, 10], [5353, 5353, 11], [5353, 5353, 12], [5353, 6385, 13], [6385, 7039, 14], [7039, 7983, 15], [7983, 9070, 16], [9070, 10094, 17], [10094, 11064, 18], [11064, 11219, 19], [11219, 11373, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]