[{"id": "f5dfc207ea7a890f9391b6d5670d145fc85066c2", "text": "WHAT DID WESTERN CANADIAN FARMERS EAT?\n\nA QUESTIONNAIRE\n\n(Instructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.)\n\nName: Mary E. McLean\nAddress: 7 Fairlight, Sask.\nBirthplace: N.W.M.S.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1915\nWhere did you set up housekeeping? S.E. 4-14-32-W6 Sask.\nWhere had you been living before that? St. Croix Falls, Minn., U.S.A.\nFor how many people did you prepare meals? 6 to 14\nHow far was it to your nearest store? 2 miles\nHow often could a visit be made to the store? 4 or 5 times a year\nWhat groceries did you usually buy in those earliest years?\nFlour, sugar, tea, coffee, matches, tobacco, yeast, catsup, dried fruit, Baking Powder, flour.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Cook's Pride Flour\n\nIn what quantities did you buy it? 16 bags per year\nWhat was the usual price per hundred pounds of white flour? $6.00\nHow much did you use graham flour? 2 lbs. per year\nWhole wheat flour? 2 lbs. per year\nWas flour milled locally? Yes\nHow far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? 40 cents\nWhat other grain products did you use?\nCornmeal? 50 cents\nWhole wheat? 50 cents\nOats? 50 cents\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? With a hand mill.\nMcLean, Mrs. Mary E.\nFairlight, 1902\n\nName: Mary E. McLean\nAddress: Fairlight, England\n\n1. OCCUPATION HISTORY\n\n   What year did you start working in the factory?\n   How long have you been working there?\n   How many people did you supervise?\n   How far was it to your nearest store?\n   How often would you visit the store?\n\n2. FOOD AND DRINK HISTORY\n\n   What kind of tea did you drink?\n   What kind of coffee did you drink?\n   What kind of flour did you use?\n   What kind of sugar did you use?\n   What kind of milk did you use?\n   What kind of eggs did you use?\n   What kind of meat did you eat?\n   What kind of vegetables did you eat?\n   What kind of fruits did you eat?\n   What kind of bread did you eat?\n   What kind of butter did you eat?\n   What kind of cheese did you eat?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ........................................... 10 lb. $7.95\nWhat was the price for a ten pound sack of white sugar? ......................... 70 cents\nWhat brand of golden corn syrup did you use? ...................................... Rogers Syrup\nWhat size of tin of syrup did you usually buy? ....................................... 1 lb.\nAt what price? .................................................................................. 70 cents\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ......................... Buttermilk\nButter? ............................................................................................ Homemad\nEggs? ............................................................................................. Home grown\nWhat was the price of butter? .............................................................. Milk or eggs?\nDid you pack eggs for winter? .............................................................. Yes\nDid you make butter? ........................................................................ Yes\nWhat kind of cheese? .......................................................................... Good with dinner\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ........................................ Beef or Bacon\nHow did you get fresh meat? .................................................................. Game in summer\nHow often did you get fresh meat? ..........................................................\nHow did you preserve meat? .................................................................. Hanging in high place after curing in lime\nWas there a \"beef ring\" in your neighborhood? ...................................... Yes\nIf so what year was it organized? .......................................................... 1926\nDid you use game? .............................................................................. Yes\nWhat kinds? ...................................................................................... Chickens or ducks\nFor how long? ....................................................................................\nWhat part did fish play in the family diet? .............................................. River or lake salmon trout\nWas the fish fresh, cured, or canned? .................................................... Fresh\nKinds? ..............................................................................................\n3. SUGAR AND SUGAR\n\nIn what quantity did you buy sugar?\n\nThat was the price for a ton of sugar in the market.\n\nWhat kind of sugar did you buy?\n\nHow much did you usually buy at a time?\n\nAt what season?\n\n4. DAIRY PRODUCTS\n\nHow did you get your milk or fresh milk in the early days?\n\nButter?\n\nWhat was the price of butter?\n\nDid you make butter?\n\nDid you make cheese?\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nDid you preserve meat?\n\nWas there a meat market in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use game?\n\nFor the Lord?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nKind?\n6. BEVERAGES\n\nWhat kind of tea did you buy? Bulk At what price? ...........\nWhat kind of coffee did you buy? (beans or ground) 4¢\nPrice? .................. What other beverages were used? Mixture\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes\nIf not, where from? .......................................................\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1905 Cabbages 1905 Carrots 1905 Onions 1905\nTurnips .......... Beets ............\n\nIn what quantities did you buy white navy beans? 1 lb. 25¢\nHow did you buy prunes, (in bulk or by the box)? Bulk\nThat weight? 5 lb. How did the grocer handle prunes (by box)? Bulk\nWhat was the price of prunes? ............\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currents or others)?\nApples apricots raisins currents\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\nPeaches? Corn? Beans? Saskatoons? Other foods? Canned\nWhat year did you first preserve fruit by canning? 1905\nWhat year did you first preserve vegetables by canning? ..................\nWhat year did you first preserve meat by canning? ..................\nDo you still preserve foods by canning or drying? Canning\nTo what extent? ..............................................................\nDid you make your own vinegar? Yes\n6. Buy any... best kind of tea did you buy?... At what price?\n\n7. Vegetables and dried fruits:\n   - What was the price of potatoes per bushel, than or at least... (in cents)\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter of...\n   - Turnips... Beets... Carrots... Cabbage... Garlic... Celery...\n   - In what quantities did you buy these items?\n   - How did you buy them? (In bulk or by the box)?\n   - What weight?... How much did the grocer handle prices (by box)?\n   - What was the price of carrots?\n   - What other dried fruits did you use in the earliest days? (apples, peaches, apricots, prunes, lemons, raisins, currants or others)?\n\n8. Preserving:\n   - In the early years did you preserve any foods by drying?... (yes)\n   - Other foods?... (yes)\n   - What year did you first preserve fruits by canning?... (year)\n   - What year did you first preserve vegetables by canning?... (year)\n   - Do you still preserve foods by canning or drying?... (yes)\n\nTo that extent?... Did you make your own vinegar?...\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Your first time seeing it in the store | No. was it sold? - In bulk, 10 lb. sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------------|----------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               |                                        |                                                   |                                    |                     |\n| Macaroni                    |                                        |                                                   |                                    |                     |\n| Graham flour                |                                        |                                                   |                                    |                     |\n| Brown sugar                 |                                        |                                                   |                                    |                     |\n| Molasses                    |                                        |                                                   |                                    |                     |\n| Table salt                  |                                        |                                                   |                                    |                     |\n| Common salt                 |                                        |                                                   |                                    |                     |\n| Lily white syrup            |                                        |                                                   |                                    |                     |\n| Toilet soap                 |                                        |                                                   |                                    |                     |\n| Baking powder               |                                        |                                                   |                                    |                     |\n| Baking soda                 |                                        |                                                   |                                    |                     |\n| Dried peas                  |                                        |                                                   |                                    |                     |\n| Dried corn                  |                                        |                                                   |                                    |                     |\n| Vinegar                     |                                        |                                                   |                                    |                     |\n| Raisins - seeded            |                                        |                                                   |                                    |                     |\n| Raisins - seedless          |                                        |                                                   |                                    |                     |\n| Rice                        |                                        |                                                   |                                    |                     |\n| Currents                    |                                        |                                                   |                                    |                     |\n| Store jam - kinds?          |                                        |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) |                                |                                                   |                                    |                     |\n| Vanilla                     |                                        |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal or estate\n\nDid you make yeast for your own use? Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Baking soda?\n\nCream of tartar? Did you make your own baking powder?\n\n........... when out of prefer\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| Food                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same food today? |\n|-----------------------------|----------------------------------------|------------------------------|--------------------------------------------|\n| Canned salmon               |                                        |                              |                                            |\n| Canned sardines             |                                        |                              |                                            |\n| Other canned fish that appear early - give names |                  |                              |                                            |\n| Apples - fresh              |                                        |                              |                                            |\n|                             | dried                                  |                              |                                            |\n| Lettuce                     |                                        |                              |                                            |\n| Tomatoes - fresh            |                                        |                              |                                            |\n|                             | canned                                 |                              |                                            |\n| Bananas                     |                                        |                              |                                            |\n| Lemons                      |                                        |                              |                                            |\n| Oranges                     |                                        |                              |                                            |\n| Cornflakes                  |                                        |                              |                                            |\n| Other prepared breakfast cereals - give names |                  |                              |                                            |\n| Pearl tapioca               |                                        |                              |                                            |\n| Minuto tapioca              |                                        |                              |                                            |\n| Sago                        |                                        |                              |                                            |\n| Dates                       |                                        |                              |                                            |\n| Nuts                        |                                        |                              |                                            |\n| Icing sugar                 |                                        |                              |                                            |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...........................................\n\nHow was it brought to the home? (pail, barrel, tank) ........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n1907 easter\nAlways able to buy\n\nApples - fresh\nApples - dried\nLettuce\nTomatoes - fresh\ncarrot\nBananas\nLemons\noranges\nCorn Flakes\nPasta prepared\nbiscuits, five\nnoodles\nPorridge\nInstant tapioca\nSago\nDates\nSalmon\nIce cream\n\n12.\n\nWhere did you get water for drinking and for cooking? (well, river, slough, stream)\n\nHow was this water from your house? (pail, barrel, tank) Pail\n\nWas it brought to the house? (pail, barrel, tank) Pail\n\nHave any water supply, condition or charges which have been placed since you first started homesteading, giving dates where possible.\n\n1907 existing\n13. SOAP\n\nDid you buy laundry soap or make your own? Medicated.\n\nIf you made your own, did you use lye? Yes... good ashes?\n\nWhat kind of laundry soap did the grocer handle? Lysol.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Coal.\n\nWhere did you get your fuel? From Mr. Johnson.\n\nLention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nHave changed to Propane gas.\n\nCooking coal used.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? Johnson.\n\nWhat year was it purchased? Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n13. FUEL\n\nDid you buy lumber logs or make your own wood? (Attach answer)\n\nThat fuel did you use in your home? (Attach answer)\n\nIf you trade your fuel, did you ever try any other kind?\n\n14. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Attach answer)\n\nWhat year was it purchased? (Attach answer)\n\nWhat types of utensils did you have? (Attach answer)\n\nFor preparing food? (Attach answer)\n\nThen did you first use metal utensils?\n\nAfter dinner?\n18. What did you serve for your first Christmas dinner in Canada? Give the menu. List those present and give their approximate ages at that time.\n\nTurkey, roast beef, corn, vegetables, corn potatoes, twinkles, mince pie\n\n19. Have you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nalways had plenty to eat\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nThis was given to me only the other day to send onto you. I hope it is not too late.\n\nMrs. H. Melvoin, Sec., president,\nMayfield Homemakers Club.\nThis was given to me only the other day to send onto you, I hope it is not too late.\n\nMrs. H. McLean. Sec. pre-lim\n\nMaryland Homestead Club\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1905_157.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4168, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1448, 3], [1448, 2226, 4], [2226, 4766, 5], [4766, 5512, 6], [5512, 6982, 7], [6982, 8074, 8], [8074, 12634, 9], [12634, 12634, 10], [12634, 16304, 11], [16304, 16871, 12], [16871, 17808, 13], [17808, 18443, 14], [18443, 18802, 15], [18802, 18802, 16], [18802, 19546, 17], [19546, 19686, 18], [19686, 19774, 19], [19774, 19928, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]