[{"id": "1bcf68d8f0e2475a78611028c489bd71a984b80a", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to secure a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If you have any questions or remarks, or desire particular events, it may help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1922, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nIf less than one member of the family can answer the questions, they should answer the questions.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and upbringing\n( ) Pioneer farming experience\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPreservation of questionnaires\nRoss, George W.\n826 - 1st Ave. E., Moose Jaw.\nTo Sask. - November,\n1890\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNo. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because some of the questions here will not apply to your experiences or those of your family. It is not necessary for you to answer all questions; only those which apply to your experience should be answered.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1871, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled Pioneer Fiat: What Will Western Canadian Pioneers Say? is still being circulated. If you have not already received a copy, please send a stamped addressed envelope to the Provincial Archivist, University of Saskatchewan, Saskatoon, Sask.\n\nInstructions for Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name ......................................................... GEORGE WELLINGTON ROSS\n\n2. Your address ......................................................... 836-15th Ave N.E. Moose Jaw.\n\n3. Date, A.U.G., 1934 ...................................................\n\n4. Where were you born? (Give name of place and country) ..............................................................\n\n5. What was your father’s name and occupation? ..............................................................\n\n6. When did you come to Saskatchewan? (Give month and year) ..............................................................\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ..............................................................\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use “I was a small child”, “I was in my teens”, etc.)\n\n9. What were your reasons for coming west?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nNO. 2\n\nPIONEER EXPERIMENTS: A GENERAL QUESTIONNAIRE\n\nSASKATOONIAN ARCHIVES QUESTIONNAIRES\n\nS-X2 Ross George Wellington\n\nRoute: George H. Ross - 1st Ave. E. - Ross House, Jap.\n\nTo Sask. - November 1934\nRoss, George W.,\n526 - 1st Ave. E., Moose Jaw.\n\nTo Sask. - November, 1890.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES & GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you cannot write the name correctly, please give it in full. If you have someone else do the writing at your direction, this is quite acceptable.\n\n1. Your full name: Geo. W. Wellington, Ross.\n2. Your address: 526 - 1st Ave. N.E., Moose Jaw.\n3. Date: Aug. 24, 1953.\n4. Where were you born? (Give name of place and country)\n   - Michelville, Saskatchewan, Canada.\n5. What was your father's name and occupation?\n   - Geo. W. Ross - Farmer.\n6. When did you come to Saskatchewan? (Give month and year)\n   - Nov. 1890 - Red Place.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - None.\n8. How old were you when you first came to Western Canada? (You do not need to add years.)\n   - 16.\n9. What were your reasons for coming West?\n   - To find work.\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n[Stamp]\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   My whole family in 1940 and the whole family back then.\n\n13. What means of transportation did you use?\n   Once we got to Brandon on the railroad track.\n\n14. What thoughts of the journey best do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement,\n    etc.)\n\n15. What did you travel by yourself before coming to Western Canada? How after you came?\n\n16. Where did you settle or take up land?\n    We settled in the province of Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. With whom did you travel? (Family, friends, or other)\n\n13. What means of transportation did you use?\n\n14. What was the first place you visited in Saskatchewan?\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community? \n   - I think - 1908 - by Mr. Wellington\n\n26. If you owned a car before 1924, when did you buy it? What make?\n   - 1920 - Ford\n\n27. Where was your trading center? How far from your home?\n   - 9 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing)\n   - Always traded\n\n29. How often did you shop in the early days?\n   - Once a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - Tom Smith & S. H. Railwell came to town in October 1920\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   - Father & Mother bought about 1920 by mail\n\n32. When did you first have a telephone and what company provided it?\n   - Formed as rural company in 1910\n\n33. When you came to Saskatchewan, the first thing you did with the idea of staying permanently? Or did you make up your mind after trying it out?\n   - George Wellington - town of Stratford will be moved to Minnedosa County in the spring of 1920\n\n34. The intention of making that home here which he did for many years to be lived in.\n25. When was the first car used in the community? 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of purchases were they? Mail order and any changes in the proportion of purchases made by mail order and the correspondence.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you first have a rural road around 1910?\n\n35. When did you come to stay at the farm?\n25. When was the first car used in the community? 1908\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nGeorge Wellington - Town of Elstobury on Wildwood County Road 10822 wild wood information making his home here which he did too long to be lived (1921) he passed away.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appear-\n\nalways - 9 miles\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you begin to buy through the mail order catalogues?\n\nWhat kind of articles did you buy in this way? Indicate also what fraction of\n\nyour purchases came by mail order and any changes in the proportion of\n\nmail orders purchased.\n\n32. When did you start having a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? With the idea of staying\n\npermanently? Or did you make up your mind after trying it out?\n\n34. Formed a rural school district 1910. Known as\n\n35. William County in the spring of 1882 will\n\n36. Inclusion of making his farm here\n\nwhich he did so long ago in 1911\n34. Did any people leave from your district prior to 1914? What reasons did they have for moving?\n\nSome of early settlers went back to Richard Holloway farm - 1885-1890 to warm up poor years.\n\n35. Did many people move away during the 1930's?\n\n36. If you or some member of your family have held public office, or have been active in any organization mention it here, listing each wherever possible.\n\n37. If you or any of your family or friends were \"witnesses\" to have or do anything in the district mention it here, giving dates whenever possible. (Such as seeing the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any members of your family ever hold public office, or have been elected to any branch of the government? If so, give name, date, and office held.\n\n35. Did many people move away during the 1920s?\n\n36. If you or any member of your family were interested in politics, did they belong to any political parties? If so, which ones?\n\n37. If you or any member of your family were interested in religion, did they attend any churches? If so, which ones?\n\n38. How did the places in your community get their names? (School district, Post offices, Villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin; and (3) date of the suggestion. Give reason for change, if any.\n\n39. Did any members of your family ever serve in the military? If so, give name, rank, and unit.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any) ____________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n______________________________ _________________________\n______________________________ _________________________\n______________________________ _________________________\n\n41. That do you think are the most important changes in your community since you first came West?\n\nFirst change from 60 days.\n\nHave seen all the change from 60 days.\n\nUntil this present time completed.\n\nA very which is much completed.\n\nPlease give the name and address of other persons who may have this information.\n\nV. Charles J. Marvin - 413 Holdgate St. W. Regina, Sask.\n\nV. Glenn - 708 Brown - Emmaville Rd. 7070 Regina\n\nV. Johnny Wilson - Emmaville Rd. 7070 Regina\n\nIf someone else has filled in this questionnaire for you, please give name and address here:\n\nGeorge W. Ross\n\n2777-722-8\n39. Question regarding historical materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Please list).\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the archives office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\n[Handwritten text not legible]\n\n41. That do you think are the most important changes in your community since you first came West?\n\nHave seen all the change from day to day.\n\nUntil old friends died and like\n\nIt very much improved.\n\n[Handwritten text not legible]\n\nPlease give the names and addresses of other persons who could answer this question.\n\n[Handwritten text not legible]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1890_507.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4677, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1643, 5], [1643, 3130, 6], [3130, 4452, 7], [4452, 5579, 8], [5579, 6340, 9], [6340, 6867, 10], [6867, 7537, 11], [7537, 8211, 12], [8211, 9363, 13], [9363, 10201, 14], [10201, 11138, 15], [11138, 12205, 16], [12205, 13238, 17], [13238, 14075, 18], [14075, 15565, 19], [15565, 16635, 20], [16635, 16790, 21], [16790, 16944, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]