[{"id": "7ed58fe37a79e84819849e3c5f90484e2c81f4ff", "text": "Nipawin Sask., May 18th 34.\n\nSask Archives Office\nSaskatoon.\n\nGentlemen;\n\nEnclosed questionnaire filled out to the best of my ability, from here. Have lived in this town only part of last year and so far this spring. I think I have some letters and photos in Quill Lake that you might make use of as I lived there for several years before coming here. Will try and look them up when I am there next time. Am staying with my oldest son here when he and Mrs Bates are managing an aged people home. \"Bethel Haven\" is the name. At present they have about 24 elderly people here. I think 17 men and 7 ladies.\n\nI have answered the questions as tho I was in Quill Lake or on my old farm when I have lived since 1904 except for the 5 yrs in Watson. You will please excuse all mistakes and shortages as your correspondent is past 82 yrs of age and quite crippled at this time.\n\nVery Respectfully,\n\nT.H. Bates.\n\nAll questionnaires will be preserved by the Archives at the University of Saskatchewan as part of the pioneer history of the Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nMAY 21 1954\nDear Archivist Office,\n\nEnclosed you will find a list of the best 8-10 abilities from them. I have lived in this town only part of last year and so far this spring. I think I have some letters and photos in Quill Rock that you might want to see. They are for several years before coming here. I will try and send them to you when I can. There may be some other things that you may want to see. One stopping over with my children in Kim today. He said three beds for the management of an orphanage house. Bethel Farm is his name. He promised they have about 24 children there. I think it's man and 7 ladies.\n\nI have answered the questions on the form in Quill Rock as an old farm when I have lived since 1904 myself for the first time in Matane. You will please answer all questions and strategies on your own. I am 82 years old and quite confident at this time.\n\nVery Respectfully,\n\n[Signature]\n\nMAY 21, 1954\n\nUniversity of Education, Bathurst, New Brunswick.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so do not worry about leaving blank spaces. Take extra paper if necessary to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .................................................. Wesley F. Bates\n2. Your address ..................................................... STANWICH, SK.\n3. Date ................................................................. May 17th, 1954\n4. Where were you born? (Give name of place and country). Retired, New York, USA.\n5. What was your father's name and occupation? John T. Bates, Farmer\n6. When did you come to Saskatchewan? (Give month and Year). April 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   From April 8th till Nov. 1st, 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   32 yrs.\n9. What were your reasons for coming West?\n   I wished to change my occupation. I had been working in a general store for 14 yrs. I was anxious to farm and produce live stock. I thought I could do until spring of 1944. A serious accident then forced me to quit the farm and stock raising.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through my brothers who came here in 1902. Also reading about it through R.R. dept. information.\n1903. Bates, Mr. Wesley F.\nWapowin, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct when it is given, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Wesley F. Bates\n2. Your address: Wapowin, Sask.\n3. Date: July 17th, 1854\n4. Where were you born? (Give name of place and country): Red Deer, Alberta, Canada\n5. What was your father's name and occupation? John Bates Farmer\n6. When did you come to Saskatchewan? (Give month and year): April 1903\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Old Trail Rd., April 1903\n   - Old Trail Rd., July 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nHandwritten notes:\n\n- \"I came to Canada reading a book by Sir James Macdonald.\"\n- \"R.R. had information.\"\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They thought I was crazy, and was making a very foolish move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Myself and two brothers came in three cars of settlers effects.\n\n13. What means of transportation did you use?\n   RR to Fort Macleod, from there went by teams & wagons. We all took homesteads on Sec 28 Dist 36 Range 14 W about 150 miles west of Fort Macleod.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Several miles N.W. from Okotoks we came to a real large slough which we had to cross. I rode my saddle horse third and found no footing to the mud. We tried four horses on the first load and found it impossible to get across. Our next move was to add enough log chains to the poles and hitch the horses on opposite side when footing was good, and this way all three of our loads were lost then. Of course I had to drop the chains back each time and hitch to the other wagons.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   N.E. corner of with my brother who built a big house before I got here.\n\n16. Where did you settle or take up land?\n   At what is now Willow Park, on the C.M.R. line.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Myself and family lived in Nelson for 5 years from Jan 1st 1921. Then returned to the farm. I was working for Mr. Walsh in his Dept store during this time.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Working in store at Red Deer, Win. As soon as possible I got into raising live stock and 10 to 12 yd cattle raising, grain and feeding live stock, selling stock and grain. I bought all the feeder stock I could around town, but had to get a car from Calgary 2 or 3 times. Have shipped several car loads from the farm the past few years. They say in new car loads from the farm I immediately with 2 acre added and running the farm I immediately with 2 acre added and bought 1/2 acre before I quit in 1944.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\nJust often enough to let them know how I was getting along.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nI brought my wife and family 82 with me.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\nNot that I know of.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nMy two brothers settled on same farm as I. Our sister married settled with her husband at Sheho. My father came in 1904 and settled on same site as myself & brothers. He homesteaded his N.E.1/4 sec. 73 built a little frame log shack which stood there until 1929. We used it for a grocery for several years after he left to live in Portland, Ore., where he passed on in 1919.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nIn 1904 our nearest T.O. was at Fishing Lake only 43 miles from here. Our grocery store was at Sheho 35 mi. We had no roads and had too much rain and snow for about 2 or 3 years. We planted a few acres of oats in June 1904 and had a good crop. We had a good lot of field beans and made a good lot of feed. Beans were abundant but made a good lot of field beans and to 4 ft high. February 1905 threatened for myself and all my neighbors with a small spring thaw many feet under snow and a straw cornfield & house partly flooded. Snow loaded on a sleigh. Worked nearly all winter at the job with 6 to 12 in of snow on the ground. Grain was all stacked.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nOur school was built in 1906 and we had church services there from then on. Previous to that it was held in my house several times and at another neighbor's house a few times. We did very little travelling and all was done by team & wagon. I did quite a lot of travelling on my saddle horse when I was R.M. & councillor for Lethbridge R.M. for two terms. I was councillor for Lethbridge R.M. for two terms.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n25. When was the first car used in the community? Don't remember.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home? Watson 7\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? Once a week, usually sometimes twice a week\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? About 1925 or near as I remember.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1918. Ladies wear, some hardware.\n\n32. When did you first have a telephone and what company provided it? 1912-1915\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI intended to stay permanently and stayed.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order, or any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\nVery few moved away, most here thought they could do better.\n\n35. Did many people move away during the 1930s? Did many return?\nVery few if any, most here returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was Secretary of Selby School Dist. for 13 yrs., the last 4 yrs. I also was Secretary of County S.P. Also, I was Chair of Lakeside P.T.A. for two terms. I worked to get the Pool Elevator started in 1923 and succeeded in 1945. I am a life member of pool committee and still talk to members. I was Secretary of Women's Club for several years. My wife was Secretary of Selby School for several years. I helped organize the J.C.O.F. Lodge at Wallace and Hanson. I took the Grand Lodge degree in 1928 or 1929 at Regina or Moose Jaw.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nThe first famous names in this district were planted by my brother in June 1904. The first good house was built by myself in 1918 after living in a log house for 14 yrs. My house was 30x34 full basement, 2½ story high. My son Clifford's family occupy it now. All lumber, nails, doors etc. were bought from Tealons, at cost $400.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\nSelby School. Name given by Mr. Davis Armstrong. Homesteader living farm from school built in 1906. Name brot from Scotland.\n34. Did any people move away from your district prior to 1914? What persons did they have for moving?\n\n35. Did many people move away during the 1930s? Did any return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"friends\" to have or do something in the district mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and origin; (2) meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nBaby Robert, born June 7, 1906, died April 26, 1906.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........ (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\nMrs. Helen Dixon, Assiniboia, Alberta, address: H.A.R.R.\nRev. Charles Bates, Nipawin, Saskatchewan, Minister, Manager Oldfield Church\nW.H. Bates, Touchwood Mills, 1831 Clancy Highway\nMarilyn Royden, 1776-65 Ave & Lathbridge Rd.\nClifford J. Bates, Farmer, Touchwood Mills, Summer Lake\nMargaret Butler, Touchwood Mills, 123 Westwood Ave, Shell Lake City\n\nI have 17 Great Grandchildren - no space here to write names.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nAll farming done by tractor power, trucks and heavy diesel equipment. Telephones, Tractor Combines. Hydro power lines for farms, with lighting, power for homes. Better roads, paved highways, inter-provincial, Trans Canada Highway. Better school system. Roads, cars, trucks etc. Better farm machinery.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\n91. Questions regarding historical sources and materials\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old newspapers, old photographs, written recollections etc.?\n\nWould you or the person who owns them allow:\n\n(1) Be willing to lend them to the Provincial Archivist for copying?\n(2) Be willing to present them to the Archives Division of the Legislative Assembly, Library, or the Archives Office at the University in Dartmouth?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you came here?\n\nPlease give the names and addresses of other persons who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903A-C_673.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5925, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1180, 5], [1180, 2140, 6], [2140, 3805, 7], [3805, 5368, 8], [5368, 7020, 9], [7020, 8293, 10], [8293, 10508, 11], [10508, 11172, 12], [11172, 13396, 13], [13396, 14042, 14], [14042, 15223, 15], [15223, 16208, 16], [16208, 18249, 17], [18249, 19220, 18], [19220, 20989, 19], [20989, 21869, 20], [21869, 21957, 21], [21957, 22111, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]