[{"id": "32b52122d2f6dfaf9e410983a72cccd6dbc0020a", "text": "S-X2\n415. Muirhead Isabel (Mrs. W.M.)\nThis is the story of my life in Oakey.\nMy father came to Saskatchewan from Perth Co., Ont., near the city of Stratford Ont., to Brandon, Man., he spent a short time there but found it very well, so came on to Moose Jaw, Sask.\nThen started land hunting and travelled ninety miles south to what is now known as Oakey.\nThere he took up a homestead at Pechampton, put up a sod shack, and that fall returned to Ont. to spend the winter there.\nIn the spring of 1883 he returned west bringing a car load of horses and machinery, household furniture etc.\nMy mother & I came as far as Edmonton by rail, and then by stage coach to Alameda and were among the first to travel on the stage which made weekly trips for some years carrying passengers & mail.\nThat spring my father broke up some land and put in a crop.\nThen as mother did not at all like the sod shack, he started to build a concrete house.\nOhio in the spring of my life in Oakes.\n\nMy father came to Oakes from Perth by boat via the city of Bradford Bay to Brandon.\n\nIn 1883, he spent a short time there but found it very wet so came on to Summer smile back.\n\nThen David land farming and homesteaded.\n\nShortly after went to what is now Blanche's Park.\n\nThere he built up a house (a small one) and lived there.\n\nOn the spring of 1883 he returned west bringing a car load of goods and many personal worth furniture etc.\n\nMy mother came as far as Brandon by rail and then by stage coach to Blanche's Park and were among the first to travel on the stage which made weekly trips for some years.\n\nPoveshell gave a barrel.\n\nThat evening my mother broke up some towels and put in a wash.\n\nThen my father did not at all like the brook where he started to build a small barn.\nThis is the story of my life in Oshkosh.\n\nMy father came to Oshkosh from Perth Co., Ont., near the city of Stratford Ont., to Brandon, Man., he spent a short time there but found it very wet, so came on to Wisconsin Dells. Then started land buying and travelled sixty miles south to what is now known as Alameda. There he bought up a homestead or preemption, just up a sod shack and that fall returned to Ont. to spend the winter there.\n\nIn the spring of 1883 he returned west bringing a car load of horses machinery, several field furniture etc.\n\nMy mother & I came as far as Wisconsin by rail, and then by stage coach to Alameda and were among the first to travel on the stage which made weekly trips for some years bringing passengers & mail.\n\nThat spring my father bought up some land and put in a crop.\n\nThen my mother did not at all like the cold shocks she started to build a concrete house.\nThis is the story of my life in Oahu.\n\nMy father came to Hawaii from Perth, Scotland in the early 1880s. He opened a short time there but found ill-health was too severe on the tropical climate.\n\nThen started land farming and handled cattle on a small scale. What is now Kamehameha Beach.\n\nThere he built up a homestead or farmstead.\n\nIn the spring of 1883 he returned west bringing a car load of horses and machinery.\n\nJanuary 1st, 1884 came so far as homesteading family and then by boat went to Alameda and were among the first to homestead the place which made weekly trips for some years buying lumber and supplies.\n\nThat spring my father bought up some land and put in a orchard.\n\nThen we moved to build a new house where he started to build a new house.\nwhich proved very good, and we were able\nto move into Neil City; shortly before my\nsister was born on Oct 27th 1883, and as she\nwas the first white child born in the district\none of her names is Alameda.\nNeedless to say there were no Dr or nurse attending\nat her birth, but three neighbors were there to help,\nbeing so far from a railroad neighbor\nhelped out in any way possible.\nWe were at Alameda during the time of\nthe Rebellion in the Mepistle valley, and\nas there were many wandering tribes of\nIndians travelling around, our grandparents\nin fact were greatly concerned for our safety,\nbut even though we have had whole tribes\nof Indians march through our house, and I\nremember one time we were at dinner when\na tribe came in, and one very old Indian\nreached across the table a short hand with\nan old gentleman we had at dinner\nthat day and how he did laugh.\nI must say we were not harmed in the\nleast; in fact we found them very friendly.\nwhich proved very good, and we were all\nto arrive into it in less than thirty before my\ndaughter was born on Oct 27th 1883, and so she\nwas the first white child born in the district\nof our own province in Alameda.\n\nNeedless to say there were no roads or means of travel\nat her birth, but three daughters were there to help.\nYoung as she was from a railroad passenger car\nshe fell out in any way possible.\n\nWe were at Alameda during the time of\nthe Rebellion in the Mokelumne valley and\nso three were on a wandering through\nCalifornia (not likely around) our grandmothers\nwe felt more greatly concerned for our safety\nbut even though we have had whole bunch\nof Indians through our house and I\nremember one time we were at dinner when\na tribe came in! And one very old Indian\nreached across the table, oh yes! Hand with\nan old gentleman we had dinner\nthat day and how he did laugh.\nI cannot say we were well harmed in the\nleast; in fact we found them very friendly.\nand thankful for any favors without fail returned any kindness in some way.\n\nIn 1886 in Oct 3 my sister Betty was born and we still had no less neighbors again assisted.\n\nIn 1887 the men of the district got busy and hauled logs from the Davis River & built a Church. Money was sent out from relations in the east to buy what lumber doors windows etc were needed, and the building was also used for school purposes for many yrs. It was fairly well equipped with desks, black board etc., and served quite a large community for church & school, neighbors came for mile by ox team to church.\n\nWe were only able to hold school in summer as we suffered very severe & sudden storms in winter making it dangerous for children to attend. We also were not able to hold Church in Winter as we did not have a regular minister, and had to depend on\nand thankful for any favors I wrote out.\n\nBut returned away in some way.\n\nFor 1886 in Oct 3 my dear little baby was born,\n\nand as we still had two more children again\n\nawaited.\n\nIn 1887 the name of the district got larger.\n\nI heard from the owner, Mr. Smith, and built a\n\nChurch. Money was sent out from relatives in\n\nthe east to buy what timber doors windows etc.\n\nwere needed and the building was also\n\nused for school purposes for many years.\n\nIt was fairly well equipped with church\n\nplace, pews, etc., and served quite a large\n\ncommunity for church or school purposes.\n\ncame for only by train to church.\n\nWe were only able to hold school in common\n\nas we afforded very scarce and dear prices\n\nin winter because of dangerous for children\n\nto attend. We also were not able to build\n\na house in Windsor as we did only have a\n\nregular month, and had to depend on\nStudents sent out who used to ride horseback all over a large territory, preaching in homes & schools, most of them made their headquarters at our home.\n\nOur teachers were also young students with only grade eight and mostly had no normal training.\n\nIn the early 1880s we were greatly troubled with horse thieves who used to cross the border from U.S.A. to steal the valuable Canadian horses, so the Mounted Police were sent out to patrol the border, and they traveled with my parents as we were only ½ a mile from the Alameda Rd.\n\nFor entertainment we used to have lots of picnics in summer, baseball was quite a popular game, of which my father was captain for yrs, we children ran races etc but me sure didn't get any pop or ice cream, and I never saw an orange till I was twelve yrs old and sure thought it was wonderful, but we had lots of wild fruit as there was a great\nWe had a large family living in\nTexas, evidently most of them made their\nroad through at own home.\nOur children were also young children with\nonly grade eight and mostly had no formal\ntraining.\n\nIn the early 1880s we were greatly troubled\nwith Indians, who would cross the\nborder from U.S.A., to steal the valuable\nCanadian horses on the Canadian border.\nThey\nwould not be afraid of the border, and they\nwould deal with any person as we were only a\nhalf from the Alameda Rd.\n\nFor much farming we used to have lots of\nhorses in summer, and fall, we would plant a\npotato garden, which my father was captain\nfor you, our children, and I\nwere divided up among you, but I was always\nyour own on our hill. I was always your old\nand own horse, it was wonderfully kind, we\nhad lots of wild family so there was a great\nabundance in the early days before the prairie fires destroyed so much of it. Also my Grand Parents sent out barrels of honey apples, also apple butter or jelly.\n\nIt was a long drive to Moosejaw only taken when really necessary.\n\nMy Father raised pigs raising his grain for that purpose, and both out a load in the fall or brought back supplies, there was a small grocery store near the P.O. where we could get any extras. My Parents kept quite a lot of stock & milked about 10 cows, it was my job after school to get them home and I often had to walk two or three miles, also had to walk 1/2 mile to school but as I got older I learned to ride horse back and there was some times four of us on a quiet old horse but we some times had a spill.\n\nIn the winter our neighbors used to get together quite often and have parties dancing debates etc., where there were some real good times spent, also neighbors were great for visiting each other and helping out in various ways.\nabundance in the early days before the\nprairie fires destroyed so much of it\nalso my Grand Parents must not have been very\naffluent, also Apple Butter & Jelly\nit was a long drive to purchase a very\nlarge really necessary.\nmy Father raised pigs raising hogs in that\npurpose and both out a load in the fall\na breakfast box supplies there was a small\ngrocery store near the P.O. where we could get any\nsupplies. My Parents bought quite a lot of which I\ndon't know about 10 years, it was only for coffee\nto get them home and I think had to walk back in\ntheir own, also had a horse Y and a cart\nbut as I got older I learned to ride a horse\nand there was some times four of us on a\nquick old horse but we came twice and a half\nin the winter our job was to get together quick\nthen we'd have hard planning debates etc when\nthere were some real good times also\nvery little money spent for buying each other\nand helping out in anyway.\nSod houses were mostly used as they were warm & cheap, and as coal had to be hauled thirty miles from what was known as the Hugh Macdonald mine near Birdfoot, a warm house was considered a great benefit.\n\nMany farmers used Oxen, which made the long trips very slow; they proved very good though for breaking the new land & were cheaper than horses, but my father never owned a yoke as they were too slow for him, anyway he brought out two good teams of horses from Ont.\n\nGardens were not grown very extensively as we got early frosts, making it hard to grow even tomatoes & onions, but we always had plenty of root vegetables.\n\nMost farmers had small crops only about 40 or 50 acres as markets were too far away.\n\nIn 1888 my brother Gordon was born April 19th and he gave his life in 1918 in the first world war.\n\nThen in 1890 Feb 11 my sister Laura was born on a very stormy night. Father had to go two miles to get a neighbor lady to assist.\nAnd now we are slowly and surely moving\nthrough the years from what was known as the\nIdaho and now as the Bitterroot Valley. Home\nwas invaded by a great Bitterroot\nFalls river slow. They moved very good through\nfor building the new land, more cheerful than\nbefore, but any better owner could not be\nmore happy for him, every way he brought\nout live gravel from his place from 1874\ngardens were well grown very financially\nas we got early fruits, nothing of hard\nhired men familiar to him, but we always\nhad plenty of regular help.\n\nGreat farmers had small crops only about\n65 acres so market was far away.\n\nIn 1888 my family's location was four miles\nand he gave his life in 1918 in the great\nworld war.\n\nThen in 1890 they came to Idaho and\nbore on a very strong mind. Father said it wasn't\nto go here onto to get a daughter lady it wasn't\nIn 1891 the rail road came in from Brandon as far west as Oxbow which was about three miles east of our home, and that was a great day for everyone, then followed bridges over the rivers & creeks making it so much better as it was bad crossing these streams in flood time.\n\nThe rail road followed on to Alameda in 1892 and on to Estevan in 1893.\n\nMy sister Pearl was born on March 24/1892\n\nIn the summer of 1893 we moved to a ranch eight miles west of Estevan, there had been very poor crops for two yrs before we left Alameda, so my father thought he would try something, and from a small herd he built up to have 50 head of horses & about 125 head of cattle also had 115 pigs & poultry.\n\nThe valley we settled in had a large quantity of hay & pasture, but he never tried to farm as the valley floods nearly every spring & the land on the hills is very steep.\n\nThere were no bridges over the creek that runs through the valley making it hard to cross.\nIn 1891 the railroad came in from Brandon as far west as Oyster Point where about three miles east of town and that was a great day for many as they followed bridges over the river and watching it go around better as it was bad running them through in flood time.\n\nThe railroad continued on to Alameda in 1892 and on to Oakland in 1893.\n\nSamuel Pearl was born in March 24, 1892.\n\nThe summer of 1893 we moved to a ranch eight miles west of Oakland, there good for growing corn crops for two years before we left Alameda, so my father thought he would be ranching and from a small herd he built up to have 50 head of horses and about 120 head cattle also had 100 hogs & poultry.\n\nThe valley we settled on had a large quantity of hay & pasture but he soon tried to farm too the valley, finding scarcely anything growing on the hills so going along.\n\nThere were no bridges on the creek that runs through the valley reaching it back to San Pablo.\nIt is a terrible muddy bottom.\n\nWhen my father & I first went up early in July to put up hay or build a house etc., we got very badly stuck in the middle of the creek; the horses pulled & tipped till the whippoorwill flew away, and father had to unhitch and ride one of the horses about three miles to the Missouri River, to cut an ash pole to make another one.\n\nWell we arrived at the ranch in time for supper, then made our bed under the wagon and that night it rained quite heavy & we got good & wet, but I don't think it rained again that summer as our crops & garden at Alameda put in that spring was very poor, just giving us enough for a quiet flour & chicken feed.\n\nMy father put up a very comfy stone house hay for the stock and barn also harvested the crop that summer, and in the fall the family were moved up. My sister met me & I were left alone at the ranch house to guard the fowl from the wolves while\nWhen my father and I went up to build a house in July\nto pull up hay. We got very\nbadly stuck in the middle of the creek. The\nhouse pulled, but not till the whipped tree\nfell, and father tried to unstick it and ride\none of the horses about three miles to the house.\nStill we arrived at the ranch in time for\nsupper, then on our bed under the wagon\nand that night if a wind swept away\nwe got great comfort, but I don't think it\nwould have been that summer an easy\nyear for us. That spring was\nquiet from a sickness, but\nmy father put up a very empty store house\nstay in the ditch and farm also harvested the\ncrop that summer, and in the fall the\nfamily were moved up. My mother went to\nme if we were left alone at the ranch house\nto gravel the floor from the window while\nFather moved the family etc., and as he had not got the windows & doors on we were left rather in a jam if the wolves had been at all ferocious, but they were not—indeed even though about twenty of them sat up a sing song every night, they kept their distance, and very strange we were not the least bit afraid, as our parents had taught us not to be afraid of anything.\n\nIn 1894 Sister Mary was born on July 4th at the ranch and while I was only fourteen yrs old I gave her the first bath & thought it lots of fun.\n\nThere were only two other neighbors in the valley and as they had no children for some yrs we were not able to attend school.\n\nBut we became great riders & did most of the riding after stroke. Often riding miles without either saddle or bridle, often bringing home poisoned wolves & new dappled colts on horseback. We had quite an experience.\nMother arrived at the family, etc., and we all had well-got the windmills down on the new loft, other in a barn. The wheat had been cut and threshed, but they were not used from them. Many of them fell on a pile, and many more they kept there. \n\nThe house was very strange we were not familiar with it. We were afraid of anything there.\n\nIn 1894, Mr. Smith came back on July 4th at the same time while I was only fourteen years old. He came from the forest path, through the hills of snow.\n\nThere were only two other settlers in the valley, and so they had no children for some years. We were not able to attend school.\n\nBut we became great friends and almost of the same age. After riding and without saddles in the hills, after bringing home several little cows and calves, we came back. We had quite an adventure.\nnothing the nests of two wild goose geese getting four goslings in one nest and five in the other, my sister robbed one nest alone by herself, she rode into the marsh & fought with the goose and got the five goslings brought them home on horse back, we were successful in raising all of them, but just hunting shot them all in the hunting season, and they were all clearly marked on one wing with a large piece of bright red cotton.\n\nIn 1896 Brother Roy was born but only lived three months.\n\nAbout that time our family moved to Estevan so we could attend school.\n\nAt that time Estevan was a very small village, the district was very sparsely settled, as lots of people had moved away who had taken up land earlier as we had some very dry summers & lots of crop failures.\n\nOn Feb 3rd 1898 I was married to\nnothing the acorns of the wild grey oaks\n\ngutting from goulings in our nest and give\nin the floor, say mother wished me next alone\nby her self, she wrote under the smell of freight\nwith the gorge and got the from goulings.\n\nbrought them home on horse back, we were\nsuccessful in raising all others but not\nseasoning and they were all clearly marked\non one wrong with a large piece of bright\nred onion.\n\nJan 1896 Butten very was born but only lived\nthese months.\n\nAbout that time own family moved to Zetton\nso we could attend school.\n\nAt that time Zetton was a very remote\nvillage, the district was very sparsely\nsettled, so the Butten's had moved\naway who had taken up land earlier as\nwe had come very dry summers, 1878\n\nearly fall leaves.\n\n(4th Feb 3rd 1898 I was married to\nW.M. Muirhead Station Foreman & we had nearly all the village people at our wedding.\n\nIn 1899 Sister Maud was born Feb. 8th & on March 7th my first child Junie was born. They were like a pair of twins.\n\nOn Oct. 27th 1900 my son Clayton was born & still we had no Bro.\n\nOn May 2nd 1902 Sister Margaret was born & June the 2nd my second girl Pearl was born another another pair like twins.\n\nA great many houses & buildings in Estivans were built of stone & were very good & still remain in very good repair.\n\nThe first school was stone & was used for school & church & most community entertainments concerts dances etc.\n\nMr Henry Yardley was Estivans first Mayor & as he & his wife were trained singers & musicians they were a great help to the town in many ways & were splendid neighbors.\nWm. Jamieson married Marion Maclean in 1899. Shortly after their marriage, they moved into the village. They had two children: James and Robert. James was born on October 27, 1900, and Robert was born on May 25, 1902.\n\nJames became a farmer and lived in the area. Robert became a teacher and taught in the local school. Both children were very intelligent and contributed significantly to the community.\n\nThe first school was built in 1899 and was used for school, church, and social events. It was a small building with a single room. Mr. Henry Yardley was the principal of the school, and he was a great teacher. He taught in many ways and was appreciated by the students.\n\nSadly, the school closed down in 1910 due to the lack of students.\nEstevan is quite a rail road centre having the main line and three branch lines, we have quite a few industries but mostly brick or coal & a large sawmill. Due to sudden storms in Winter quite a few people were lost or frozen to death and many were badly frost bitten, but I will say I have lived here all my life & I have never been cold or hungry & I am now seventy two.\n\nI have had eleven children four girls & seven boys, and now have thirty six Grand children & seven Great Grand children they are all alive except my youngest son who gave his life in the last great War a Warrant Officer in the Air force, all my Boys served in the Army & Air force. All my Sisters are alive and we had a re-union this last Aug., all were fairly well and enjoyed the get together.\n\nMy Sister Laura wife of Mayor Harry Nicholson lives here, and as their\nI am quite a mail now & will\n\nhaving the main store line & three branch\nstores, we have quite a few inducements. But\nusually brisk & cool & a large quantity.\n\nDue to send them in Winter goods,\na few people were lost & foreign to death\nand many were badly injured, but\nI will say I have tried here all my life\n& have never been cold or hungry & am\nnow firmly set.\n\nI have had three children from girls,\nseven boys and now have thirty-five\ngrand children & am in great need of children\nthey are all alive excepting youngest son\nwho gave his life in the Great Great War a\nwarrant officer in the air force all my\nboys served in the Army, Air force\nall my sisters are alive and we had\na reunion this last Aug., all were fairly\nwell and enjoyed the get together.\n\nMy sister Laura wife of Mayor Harry\nRichardson lives here, and as their\nHome is right across the street from the new hotel, where most of my sisters booked rooms during the re-union. We all had our meals at the Nicholson home, fourteen of us sitting down to a long table. Besides my sisters we had two sisters who came with their mother, Sister Gertrude from Dayton, Wash., also were accompanied by Sister Isabel from Victoria, B.C. The girls drove all the way without much difficulty.\n\nMrs. Nicholson was ably assisted by Mrs. Campbell, a friend of the family and a daughter from nearest neighbor at Blaine, who helped. We visited many points of interest around Everett and wound up the visit with a dance & get together in the Elks hall just on by our young people and all returned to their homes tired but happy.\n\nMy Sister Pearl, Mrs. Muller & her husband have spent over thirty yrs in China she as a Dentist & she as a teacher under the\nSome in flight over the streets from the\nNew Hotel where most of my sisters had\nrooms during the reunion, we all had\nour meals at the back-to-back dining room.\nI was sitting down in a long table, besides\nmy sisters we had two ladies who came with\ntheir brothers and girls from Gayton, Wash., also\nwere accompanied by ladies, several young\ngirls in 1946. The girls drove all the way without\nmuch difficulty.\n\nJean Richardson was also assisted by Mrs. Campbell\na friend of the family and a daughter of our\nfavorite neighbor at Ellensburg, Mr. Campbell.\nWe traveled on our own, without any\nassistance and arrived up the valley with a\ndance gal together in the Ellensburg hall for\nour young people and all returned to\ntheir homes tired but happy.\n\nMy sister Pearl Casso, Smith & her husband\nhave spent over thirty years in China as an\nAmerican. She as a teacher under the\nUnited Church Missionary Society.\n\nMy young host living here Jack has bought the ranch taken up by my father in 1892. He farms a small portion of the land in various grain & flax, but does not break up too much as it still floods in spring. There being lots of hay etc he keeps a lot of stock. The valley land produces very good crops.\n\n[From E.C. COOKE, Agricultural Representative, Ottawa]\n\n[Written - Mrs. W.M. MacLeod, Edmonton]\nI wrote to you old missionary brother,\n\nmy young great-harvest son Jack has bought\nthe ranch from us by my father in 1892\nhe farms a small portion of the land\nin coarse grain, hay but does not break\nmy loam as it will produce in spring\nthere being lots of hay to be kept a lot\nof wheat. The valley land produces very\ngood crops.\n\nE.C. COOKE, Agricultural Representative\n\n[Signature]\nLucinda - Mrs. W.M. Munro, Colton", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_415.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 7020, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 38, 4], [38, 930, 5], [930, 1755, 6], [1755, 2654, 7], [2654, 3415, 8], [3415, 4359, 9], [4359, 5323, 10], [5323, 6159, 11], [6159, 7023, 12], [7023, 7900, 13], [7900, 8710, 14], [8710, 9683, 15], [9683, 10608, 16], [10608, 11552, 17], [11552, 12392, 18], [12392, 13345, 19], [13345, 14287, 20], [14287, 15205, 21], [15205, 15976, 22], [15976, 16836, 23], [16836, 17653, 24], [17653, 18459, 25], [18459, 19235, 26], [19235, 20023, 27], [20023, 20766, 28], [20766, 21608, 29], [21608, 22438, 30], [22438, 23308, 31], [23308, 24176, 32], [24176, 24609, 33], [24609, 25025, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]