[{"id": "d5b58dc8216621d659f8c124471bf8b1c092daf3", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives of the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\n1. Your full name: Ralph Taylor\n\n2. Your address: Pense, Sask.\n\n3. Date: \n\n4. Where were you born? (Give name of place and country): Goldham, Lancs., England\n\n5. What was your father's name and occupation? John Taylor, Mill Worker, in England, Railroad, and Hammer, at Peace\n\n6. When did you come to Saskatchewan? (Give month and year): 1904, April 10th\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: None in Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West? I was four years old, came with my parents and brother\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Government\n11. What did your friends and relatives think of your decision to come to Western Canada? Several families came together, some stayed in Manitoba.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Friends & relatives.\n\n13. What means of transportation did you use? Boat, train, to get to Prince. Team, horse & buggy.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.) Traveled on foot, to ten miles north of a farm. Worked, saw our first pair of syrup on the table there also saw goats, and thought they were rats—only stayed there a week, came back to Prince where we lived little time paper covered shack. Mother went out washing, mending and cleaning, Dad went on the railway as division hand.\n\n15. Where did you first stay when you arrived in Saskatchewan? Prince Sask.\n\n16. Where did you settle or take up land? Bought a quarter in 1905—where I now farm.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. None.\n\n18. How did you earn a living before coming to Western Canada? How, after, you came? Dad & Mother worked in the cotton mills, (had not had any farming experience before)\n19. How often did you write to relatives or friends in your old home? quite often.\n\nThree sisters of Dad's came out in 1910, one is still living, all of them married brothers.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Married in 1918 at Anglican Church, Prince Albert.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Yes, several friends and relatives.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. Answer in question 19.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWalking five miles to school, until I got a pony. Hauling water ten miles each Saturday, the ferries at different farms, the cyclone in 1913 at Regina, runaways of horses, hail storms, violent storms, weddings, divorces, and dances.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? Team, horseback.\n\nAttending the Anglican Church Sunday School.\n25. When was the first car used in the community? Maxwell, bought by my uncle in 1910—later a Studebaker.\n\n26. If you owned a car before 1914, when did you buy it? What make? Ford—1912.\n\n27. Where was your trading center? How far from your home? Seven-five miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Yes, we got a car.\n\n29. How often did you shop in the early days? Once a week—to take in eggs, butter, and buy a few things; we took wheat to Moore to have ground into flour.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Around 1910.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. We bought underwear, shoes—blankets seldom buy by catalogue now as Regina is our nearest shopping centre.\n\n32. When did you first have a telephone and what company provided it? Penrose Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Yes, we had to stay. Mother & Dad went back twice for a trip, but was always glad to come back.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Many moved, some to take up homesteads at Crane Valley.\n\n35. Did many people move away during the 1930's? Did many return?\n   No, we didn't have money to move, but we were on relief, had ignite soap, fish & apples from the east, and clothing came in from several places. We don't want to see that again.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   Have been on municipal councils, also town council, from 1952 to 1958. Wife active in Homemakers Clubs. Since 1918 attended several conventions in Saskatoon. I am a steam engine expert at the conference in 1959. Also can a threshing outfit for Henry Chapman - for many years still have my steam engine (spokes, ploughed myself). Have used steam engine in 1912-1913.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   Mr. Reeves of Kingston Ontario was on the train when the steel got as far as Prince. He was a newsman and attended the Golden Jubilee here in 1955. He donated a flag to the Town Hall then.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWe have a cup donated to Prince by Dr. George Ramsay in 1906 for the first civic holiday celebration. If this cup is of any historic value, we shall be glad to donate it. Since we had no history written and recorded by members of our Homemakers Club, we received a fudge for the same. Mrs. W.A. Thomson could give you the following information.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne daughter, Mrs. A.E. Warner, 1152 Algoma.\n\nTwo adopted grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPeople are not as community minded now, owing to earn more money etc., there are very few of our pioneers left.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire,\n\nIf someone else has filled in this questionnaire for you, please have the person give name and address here:\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWe have a cup donated to Peace by Dr. George Ramsay in 1906 for the first civic holiday celebration. If this cup is of any historic value, we will be glad to donate it. Perhaps had its history written and recorded by members of our Homemakers Club, we received a page for same.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne daughter, Mrs. E. Warner, 1152 Algoma.\n\nTwo adopted grandchildren.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPeople are not as community minded now owing to each more money etc., there are very few of our pioneers left.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire,\n\nIf someone else has filled in this questionnaire for you, please have the person give name and address here:\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_805.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 10, "total-input-tokens": 17060, "total-output-tokens": 2851, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1603, 2], [1603, 2497, 3], [2497, 3768, 4], [3768, 4952, 5], [4952, 6395, 6], [6395, 8158, 7], [8158, 9687, 8], [9687, 11146, 9], [11146, 11146, 10]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false]}}]