[{"id": "ce4636852ced7ad9b949576d68aae3a325ec3e30", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Albert Smith\nAddress: 284-6th Ave., Medicine Hat\nBirthplace: Toronto, Ont.\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1901\nWhere did you set up housekeeping? Prairie Albert, Ont.\nWhere had you been living before that? Butte, Montana, P.O. 1882\nFor how many people did you prepare meals? One\nHow far was it to your nearest store? Two miles\nHow often could a visit be made to the store? Any time\nWhat groceries did you usually buy in those earliest years?\nIn 1901 practically any type of food was available in Prairie Albert.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? H.B.C. Flour\nIn what quantities did you buy it? 100 lbs.\nWhat was the usual price per hundred pounds of white flour? $1.50 per 100 lbs.\nHow much did you use graham flour? 100 lbs.\nWhole wheat flour? 100 lbs.\nWas flour milled locally? Yes\nHow far away? 100 miles\nWhat other grain products did you use? Rolled oats, cornmeal, buckwheat\nDid you grind your own wheat for porridge?\nHow did you grind it?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER DAYS: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to:\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: Mrs. Allison\nAddress: 224 5th Street, Medicine Hat, Alberta\nDate: June 1953\n\n1. INTRODUCTORY QUESTIONS\n\nThat year did you start housekeeping in Western Canada? 1901\nWhere did you set up housekeeping? Medicine Hat\nWhere had you been living before that? Medicine Hat\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 1 mile\nHow often could a visit be made to the store? Twice a month\nWhat groceries did you usually buy in those earliest years? Groceries\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand or white flour did you use in the early years? M.B.G. Hom\nIn what quantities did you buy it? 10 lb. per roll\nWhat was the usual price per hundred pounds of white flour? $1.50 per roll\nHow much did you use Graham flour? 10 lb. per roll\nWas flour milled locally? Yes\nWhat was the price for a twenty pound bag of rolled oats? $0.75 per bag\nWhat other grain products did you use? Cornmeal, Whole Wheat\nDid you grind your own wheat for porridge? No\nHow did you grind it? By hand\n\nThe answers are written in cursive handwriting.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 10 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 10 cents.\n\nWhat brand of golden corn syrup did you use? Edward's Syrup.\n\nWhat size of tin of syrup did you usually buy? 1 lb.\n\nAt what price? 1920.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From farmers.\n\nWhat was the price of butter? 15 cents.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? No.\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, pork, lamb.\n\nHow did you get fresh meat? From the shop.\n\nHow often did you get fresh meat? All the time.\n\nHow did you preserve meat? Salted.\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nFor how long?\n\nWhat part did fish play in the family diet? In summer for food.\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKinds?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? (Lb. lbs.)\n\nWhat was the price for a ten pound sack of white sugar? (Lb. lbs.)\n\nWhat brand of golden corn syrup did you use? (Brand)\n\nWhat size of tin of syrup did you usually buy? (Size)\n\nAt what price? (Price)\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? (Method)\n\nWas there a creamery? (Yes/No)\n\nWhat was the price of butter? (Price)\n\nDid you pack eggs for winter? (Yes/No)\n\nDid you make butter? (Yes/No)\n\nWhat kind of cheese? (Type)\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? (Method)\n\nHow did you get fresh meat? (Method)\n\nHow often did you get fresh meat? (Frequency)\n\nHow did you preserve meat? (Method)\n\nWas there a \"beef ring\" in your neighborhood? (Yes/No)\n\nIf so what year was it organized? (Year)\n\nDid you use game? (Yes/No)\n\nFor how long? (Duration)\n\nWhat part did fish play in the family diet? (Importance)\n\nWas the fish fresh, cured, or canned? (Type)\n\nKind of? (Type)\n6. BEVERAGES\n\nWhat kind of tea did you buy? H.B.C. Co. 6c. At what price? 42¢. 6¢.\n\nWhat kind of coffee did you buy? (beans or ground) 1 lb. 5¢. Ground.\n\nPrice? 40¢. What other beverages were used? Water.\n\nVEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 25¢ in 1901.\n\nCould you get potatoes at the store? Yes.\n\nIf not, where from? Tennessee.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes Cabbage Carrots Onions\n\nTurnips Beets\n\nIn what quantities did you buy white navy beans? None.\n\nHow did you buy prunes, (in bulk or by the box)? In bulk.\n\nWhat weight? 25 lb. How did the grocer handle prunes (by box)? In bulk.\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, peaches, apricots, loganberries, raisins, currants or others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No.\n\nPeas? Yes. Corn? Yes. Beans? Yes. Saskatoons? No.\n\nOther foods? All. (Dried fruits, dried berries, canned, cranberry and other berries.)\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying? We preserved fruit and vegetables by canning.\n\nTo what extent?\n\nDid you make your own vinegar?\n6. Beverages\n\nWhat kind of tea did you buy? H.B. Co. (tea or ground) 4.00¢/lb.\n\nWhat kind of coffee did you buy? (beans or ground) 4.00¢/lb.\n\nPrice? 4.00¢/lb.\n\nWhat other beverages were used?\n\nVegetables and dried fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 25¢/bushel\n\nCould you get potatoes at the store? Yes\n\nIn what quantities did you buy white navy beans? 1 lb.\n\nHow did you buy peaches? (in bulk or by the box)? In bulk\n\nWhat weight? 1 lb.\n\nHow did the grocer handle peaches (by box)? No\n\nWhat was the price of peaches? 3¢/lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, raisins, currants or others)\n\nPreserving\n\nIn the early years did you preserve any foods by drying? No\n\nPeas? No\n\nBeans? No\n\nOther foods? No\n\nWhat year did you first preserve fruit by canning? 1920\n\nWhat year did you first preserve vegetables by canning? 1920\n\nWhat year did you first preserve meat by canning? 1920\n\nDo you still preserve foods by canning or drying? Yes\n\nTo what extent? Yes\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb., bought at sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-------------------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         | always                                        | 25c lb.                                                     |                                   |                     |\n| Macaroni              |                                               |                                                             |                                   |                     |\n| Graham flour          |                                               |                                                             |                                   |                     |\n| Brown sugar           | always available                              | 10 lbs.                                                     |                                   |                     |\n| Molasses              | 1885                                          |                                                             |                                   |                     |\n| Table salt            | always                                        |                                                             |                                   |                     |\n| Common salt           |                                               |                                                             |                                   |                     |\n| Lily white syrup      | about 19 05                                    |                                                             |                                   |                     |\n| Toilet soap           | always                                        | please recheck                                             |                                   |                     |\n| Baking powder         | always                                        |                                                             |                                   |                     |\n| Baking soda           |                                               |                                                             |                                   |                     |\n| Dried peas            |                                               |                                                             |                                   |                     |\n| Dried corn            |                                               |                                                             |                                   |                     |\n| Vinegar               | always                                        |                                                             |                                   |                     |\n| Raisins - seeded      |                                               |                                                             |                                   |                     |\n| - seedless            |                                               |                                                             |                                   |                     |\n| Rice                  |                                               |                                                             |                                   |                     |\n| Currants              |                                               |                                                             |                                   |                     |\n| Store jam - kinds?    |                                               |                                                             |                                   |                     |\n| Cheese (Cheddar or store cheese) |                             | large 50 lb. price alone 35 c. lb. |                                   |                     |\n| Vanilla               | always                                        |                                                             |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? My mother for Brewer's Yeast always -\nDid you make yeast for your own use? Yes... Using starter? David price I\nUsing hops? don't enough & may buy I used it rising hot water.\nDid you buy baking powder? Yes........ Baking soda? Yes........\nCream of tartar? Yes........ Did you make your own baking powder? No\n9. PLEASE TELL ME THE NAME OF THE BEST AP TO WORK FOR\n\nFOOD\nYour you first How was it? Any you usually bought at this amount?\nremember seeing it in the store\nSoda biscuits\nMacaroni\nGraham flour\nBrown sugar\nMolasses\nTable salt\nCommon salt\nLilly white syrup\nTalbot soap\nBaking powder\nBaking soda\nDried peas\nDried corn\nVinegar\nRaisins - seeded\n- seedless\nRice\nCurrants\nStore jam - kinds?\nCheese (Cheddar or store cheese)\nVanilla\n\nPrice 25¢ each\n\n10. BAKING\nWhat type of yeast did you use? My mother for Brewer's Yeast always\nDid you make yeast for your own use? Yes...Using starter...Always used flour\nDid you buy baking powder? Yes...Using cream of tartar...Yes...Baking soda\nDid you make your own baking powder?\n\n110\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               | (pre-1900?)                           | 36¢/lb.                       | Seems smaller.                                  |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | pilchards                             |                               |                                                 |\n| Apples - fresh              | about 1898                             | 4¢/lb. barrel                 | Seems same - Orleans apples.                    |\n| - dried                     | always                                 |                               |                                                 |\n| Lettuce                     | spring                                 |                               |                                                 |\n| Tomatoes - fresh            | more                                   |                               |                                                 |\n| - canned                    | always after 1900                      |                               |                                                 |\n| Bananas                     | after 1890 when rail road reached PA   |                               |                                                 |\n| Lemons                      | do                                     |                               |                                                 |\n| Oranges                     | do                                     |                               |                                                 |\n| Cornflakes                  | after 1900                            | 2¢/lb.                        | Seems same.                                    |\n| Other prepared breakfast cereals - give names | shredded                              | 2¢/lb.                        | Seems same.                                    |\n| Pearl tapioca               | always                                | 1¢/lb.                        | No at all                                       |\n| Minute tapioca              | 1905                                  |                               | No at all                                       |\n| Sago                        |                                        |                               | No at all except in panic.                      |\n| Dates                       | 1900                                  | 10¢/lb.                       |                                                 |\n| Walnuts                     | 1890                                  | 40¢/lb.                       |                                                 |\n| Icing sugar                 | 1¢/90                                 | 10¢/lb.                       |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, August) ..................................................................\n\nHow far was this water from your home? ................................................\n\nHow was it brought to the home? (pail, barrel, tank) .................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1902 when I moved away from Prairie Allen to Medicine Hat there was no change in water supply. Five or six years later many water was available.\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Lake, river, spring)\n\nHow far was this water from your house?\n\nHow was it brought to the house?\n\nRegarding water supply, mention any changes which have taken place since you first started keeping records, giving dates where possible.\n\nIn 1902 (or 1903) we moved away from our old home in Waterford to Medicius Hall, thus we no longer had water supply. We now rely on our own tanks for our water needs.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bought ours.\n\nIf you made your own, did you use lye? Wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Electric and Royal Ivy.\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood.\n\nWhere did you get your fuel? From the woods, wood yard, wood lot.\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWhen I began to cook in 1902 everyone used wood in their stove and furnace. By 1903 or 1904 we had begun using coal especially for the furnace.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) When my parents lived here, P.A. Wilf, they had a clock stove and chimney pipe.\n\nDid you use an outdoor fireplace or bake oven? (Give dates) Never ever used one.\n\nBy whom was your first cook stove made? Guinney.\n\nWhat year was it purchased? 1881. Price?\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteader)\n\nJars, kettles, pans, and coffee pots.\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nWe used all of these.\n\nWhen did you first see enamel ware? About 1890.\n\nAluminum?\n13. SOAP\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kinds of laundry soap did the grocer handle?\n\n14. FUEL\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Did you use an outdoor fireplace or take over? (Give dates)\n\nBy whom was your first cook stove made? Price?\n\nWhat year was it purchased? (Iron, copper, tin, brass)\n\nWhat types of utensils did you use? (Iron, copper, tin, brass)\n\nFor preparing food? (china, earthenware, wooden bowls, other)\n\nThen did you first use enamel ware? Aluminum?\n\n16. KITCHEN APPLIANCES\n\nPans, pots, kettles, etc.\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nWhen I was a child and in fact prior to 1942 our foods were packaged. We bought sugar, tea, coffee, prunes, raisins, currants, peels, spices, pepper, salt, dried fruits all by the pound. Green peas kept better, sealed and weighed that way. Dried tomatoes and currants in barrels - as well as hard tack.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g. winter or summer.\n\nI remember very far back when I was 5 years old. Rebellion took place likely the events were very important. We had oatmeal porridge, coffee bread rolls, olives (or beans). It was hard to make as it was made on a wood fire and syrup. Dinner at noon - meat, roast beef (which to you was 18 cents). Potatoes, turnips, cranberry pie, tea and milk, tea at 6 p.m. We had cold meat, fried potatoes, raspberries, strawberries, jam. Bread rolls, a tin pie. Mrs. Vincent - how much my mother was famous.\n\n18. What year did you serve your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at the time.\n\nI cannot remember when any Christmas dinner was much different than in later years - turkey, vegetables, plum pudding and mince pie - and always dumplings made with head dough. In 1945 there was present my father and mother - Douglas (myself), Edith, Ethel, Harry so he was born in 1946 killed in France 1948. Lot more fun and a puzzle from the office who had no home like Pbt Burns.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo never - we were flour, sugar once I remember but there was always a great plenty of flour, meal, tea, coffee - and dried fruit in my day.\n16. WASTE DISPOSAL CONTAINERS\n\nMention any changes which you recall in the wastepaper and containers used.\n\nWith the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nI remember very few menus. The china was very nice. We had a lot of meat, pork, ham, or a little fish and maybe a little meat. We had to make our own bread, tea and milk. Tea at 6 p.m.\n\nPotatoes, lima beans, cranberry pie, ice cream.\n\nBread rolls, omelet, 1947, plus honey. For breakfast, we had toast, jam, eggs, bacon, coffee.\n\n18. What year did you serve your first Christmas dinner? List those present and give the menu.\n\nChristmas dinner John and Christine dinner was served December 25th. Turkey was always served. Plan pudding and mince pie and always apple fritters.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nI began once more to have flour meal. I always had plenty of flour meal in my days. Coffee and dried fruit in my days.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThe only difference I notice was that there was a much greater variety—and the frozen foods and imported perishable foods—strawberries, etc.—were frozen—cabbage, onion, etc., imported during winter months and pressure cooking methods—all made great changes and shortened the housekeeper's time (which) shortened what work she did.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWe always—from earliest recollection—bought every thing except a few potatoes, onions, and bacon. Bread was available once in 1886 or 1887. A few canned fruits as strawberries and canned jams—some times in the H.B. & Co. English and apple jars and mandarins—expression in food—tomatoes were the earliest canned vegetable—remember (above?) along in 1890 there were packaged jellies (something like jelly) but no desserts as now.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nIn my recollection as a child—Ontario—Ontario—when they had large stores of everything—goods and canned provisions in barrels, evaporated or dried apples in tins, raisins and currents in boxes (I believe) jams—these stores also had a store lot—a dear food—panty lace, ribbons—sometimes childrens' and ladies' hair hats as well as men's—pre-made clothes as far as I can remember—lots of pretty beads and gay collars and flannel blankets in red green or grey or white—the French and Indians loved these to wrap themselves. All the stores in pioneer days were several stores and carried a wide variety—including coal oil.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences or buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality of merchandise, prices, problems of storage, shortages and other details. (Use back of page if more space is needed.)\nand candles, matches, etc. There was a great deal of \"trading\" in the early days. In my father's business the adventurers were thought of paying cash for the family \"deal-out,\" any account they bought goods until the amount owing was paid. The farmers brought in a few bushels of potatoes, a couple hams (eggs and butter occasionally) and once I remember a load of wheat which we had made into flour at one of the mills where they did \"grinding,\" as they called it, and paid them subscription—then pay—and paid them subscription—the pay—I never remember seeing much money they said when the railroad came it took over all the money—because freight had to be paid in cash instead of the \"trading,\" the freighter used to do. When they really just got goods for their freight.\n\nIn addressing my envelope for this I recalled to mind that—When I was a kid just for a trip in 1897 there was not one building on the south side of the main street and only about three including the depot on the north side. The N.W.M. had a tavern I think named Willis located there.\nand candles, pots, etc. Have no c.\n\ngreat deal of trading in U. until dep.\n\nfor my father because the adventurers have\n\nthought of paying card be the people's\n\ndebt one away account. Our money\n\ngood will if anyone owing we paid\n\nThe former brought in a few valuable goods.\n\na couple farms (1779 and half, occasional)\n\nand one house in a body of water. What\n\nwe had most into play, or they called us\n\nlike this dry ground, or the poor\n\nand paid them pre-emption—their money\n\nand never received owing much money.\n\nWe card like the railroad came,\n\nover all the money—treasure\n\nbut the Red Kid paid in cash instead of the\n\npreyful need to do. But this\n\ntrading the preyful for their prosperity\n\nreally got put food for their prosperity.\n\nIn addition my card goes to d. = )\n\nNewell's farm that I knew. Know one\n\nfrom a trip in 1897 they lost more one\n\nbuilding or the end of it over at Bennett's\n\nand they allow the machinery the depot\n\nor the money paid. If it happens\n\nI think named will plateau.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1882_10.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 6474, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1357, 5], [1357, 2745, 6], [2745, 3691, 7], [3691, 4694, 8], [4694, 6072, 9], [6072, 7149, 10], [7149, 11998, 11], [11998, 12714, 12], [12714, 16691, 13], [16691, 17166, 14], [17166, 18415, 15], [18415, 19300, 16], [19300, 21292, 17], [21292, 22499, 18], [22499, 24477, 19], [24477, 25049, 20], [25049, 26108, 21], [26108, 27102, 22], [27102, 27102, 23], [27102, 27102, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]