[{"id": "b3604594cd1634d5f66f93814cb421fc63236e57", "text": "Po. Carmanara\nSaskatoon\n19 Dec. 62\n\nMr. D. H. Bowering\nAssistant Provincial Archivist\nSaskatoon, Sask.\n\nDear Sir,\n\nI was very pleased to receive your letter of Dec. 6th, replying to mine sent to Mr. Allan R. Yarner, Regina.\n\nI may say I consider it a very pleasant privilege to be requested to supply an account of my experiences in the early history of Saskatchewan, & hope my account may be of some value.\n\nBriefly, I would like to explain that those experiences could be divided into two or three distinct parts or periods.\n\nThe first of these periods would be from 1903, working at various pioneer jobs as building roads & railroad construction & homesteading in the Cut Knife country.\n\nI served three years in the World war & afterward took a soldier grant of land in the Peaceful Valley Settlement south of Prairie River 160 acres, & I farmed there until retiring a few years ago.\n\nThis venture was not an easy one, the land was...\nPov Carragher\n\n19 Dec. 62\n\nMr. H. Brooking\nAssistant Provincial Archivist\nSaskatoon, Sask.\n\nDear Sir,\n\nI was very pleased to receive your letter of Dec. 6th replying to mine sent to Mr. Allan R. Turner, Regina. I may say I consider it a very pleasant privilege to be requested to supply an account of my experiences in the early history of Saskatchewan. I hope my account may be of some value.\n\nBriefly I would like to explain that those experiences could be divided into two or three distinct parts or periods:\n\nThe first of these periods would be from 1903, working at various pioneer jobs on building roads & railroads constructed & homesteaded in the Cut Knife country. I served three years in the World War & afterward took a soldier grant of land in the Peaceful River Settlement south of Prairie River 11/2 miles, and farmed there until retiring a few years ago.\n\nThis venture was not an easy one the land was\nIn my early years, there were no roads or streams here. We took a severe freeze in the winter, but the drought year 1919 caused it to turn up. We endured the hardship of travel, but most of us liked myself were so glad to be back from the war that we were willing to face up to difficulties which we could only guess at.\n\nHowever, we (my wife & I) the family did our best to gradually build a successful farm, and our sons now farm here & our daughters have their homes not too far from us.\n\nStill it is right, the early experiences of the early years here should be made available for future generations & students, it will be a pleasure if seen help towards this end.\n\nI have filled in the questionnaire you sent me though rather sketchily.\n\nI would chiefly like to record my early experiences especially those building the Canadian Northern Railway from Battleford to Edmonton in the year 1905. There were many events that were the world recording & my memories are nearly as clear as when they took place, especially I think of some of the very outstanding resourceful men I got to know and the conditions...\nVery hard, there were no roads & swamps here took a severe toll of the horses through the year 1919 caused it to turn up (induced) me to move & did not realize the hardship of travel from country but most of us like myself were so glad to be back from the war that we were willing to face up to difficulties which we could only guess at.\n\nHowever we (my wife & the family) did our best & gradually build a successful farm, any our sons now farm here & our daughters have their homes not too far from us.\n\nStill it is right that early experiences of the early years here should be made available for future generations & students it will be a pleasure if you help towards this end.\n\nI have tried in the questionnaire you sent me though rather sketchily.\n\nI would chiefly like to record my early experiences especially those building the Canadian Northern Railway from Battleford to Edmonton in the year 1905 there were many events that will be worth recording & my memories are nearly as clear as when they took place, especially I think of some of the very outstanding resourceful men I got to know & the conditions\nI hope apart from this introductory letter to give a brief account of that work, it was very dangerous & always with great hardship. Here were 40 old men on our outfit mostly young like myself 21 years & needing to earn to get a little start in life.\n\nThe work was the teamsters' labor in the ties behind us was the steel laying crew - about 150 men, all had to be physically strong & resourceful, we worked in all weather & slept on the ground in tents at night.\n\nWork problems arose very frequently & the work manager (Brown) had to be extremely resourceful and hardy but they were like able men & we respected & admired them for their qualities.\n\nIf I shall be able to give you a fairly good account of these experiences into answer as well as possible any questions you might like answered.\n\nHoping to be of service to you,\n\nYour Sincerely\n\n[Signature]\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nunder which the work was carried through.\n\nI hope apart from this introductory letter to give a brief account of that work, it was often dangerous & always back breaking physically.\n\nThere were 40 old men on our outfit mostly young like myself 21 years & needing to earn to get a little start in life.\n\nWe were the teamsters carrying the ties behind us was the steel laying crew about 130 men, all had to be physically strong & resourceful, we worked in all weather & slept on the ground in tents at night.\n\nWork problems arose very frequently & the work manager (boss) had to be extremely resourcefully & hard but they were like able men & we respected & admired them for their dedication.\n\nWe shall be able to give you a fairly good account of these experiences into answer as well as possible any questions you might like answered.\n\nHoping to be of service to your work,\n\nYour Sincerely\n\n[Signature]\n\nSaskatchewan Archives Board\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nThe building of Canada's second transcontinental railway, the Canadian Northern Railway, was conceived and built in the winter hundreds years by the Hon. Sir William J. Ross, Prime Minister and Sir Donald Macdonald who also served as its contractors, and it was reported that they gained a fortune in this double role.\n\nIn the early spring of 1905 the end of steel was approached at the divisional point that became the city of North Battleford and the Saskatchewan River crossing eight miles to the west where crews were preparing for the construction of the bridge to cross the river.\n\nDuring the summer of 1904, grade had been built as far as Edmonton and during 1905 from May until mid-December the steel was laid to that point.\n\nThis required the co-operation of several large crews of men serving the different requirements; a temporary pile and timber bridge was built across the river and temporary material cranes, and track laying operations commenced on the south side of the river.\n\nThe track laying crew included a 200-man crew organized to handle the steel rails from the Peterborough yard and shipped on the trestle.\n\nThe ties were hauled from a string of box cars.\nThe building of Canada's second transcontinental railway, the Canadian Northern Railway, was conceived and built in the winter hundreds' years by the Hon. Sir William J. Ross (Sir Donald Macdonald) who also served as its contractor, and it was reported they gained fabulous riches, acting in the double role.\n\nIn the early spring of 1905 the end of steel was approaching the divisional point that became the city of Prince Albert, and the Saskatchewan River crossing eight miles to the west where crews were hard at work for the construction of the bridge to carry the river.\n\nDuring the summer of 1904, grade had been built as far as Edmonton and during 1905 from near until mid-December the steel was laid to that point.\n\nThis required the co-operation of several large crews of men serving the different requirements; a temporary pile and timber bridge was built across the river, and then the main bridge material, crewed, and track laying operations commenced on the south side of the river.\n\nThe track laying crews included a 200-man crew organized to handle the steel rails from 10 feet away until placed and spiked on the ties.\n\nThe ties were hauled from a string of five cars.\nBy seven teams of mules and horses dumping their loads of ties on the grade, rounded where they were placed and spaced ahead of the advancing steel. Two trains of steel and ties came up from the material yard per day; the first arriving between 6 and 7 a.m., and the second about 1 p.m. The work of track laying was continued until the trains were unloaded.\n\nIf necessary, two or three team drivers unloading the ties and dumping them on the grade, see the managing or \"boss\" jobs were occupied by very outstanding men for difficult, and new situations were very frequently gathering requiring a bit of a high order to cope with them and keep the track laying coming smoothly, and I think a description of them would be appropriate.\n\nThe \"boss\" of the big steel gang (name forgotten) was a big, heavy, swarthy man, wearing a friendly smile, but a masterpiece in managing without trouble or accidents handling men who were given or not to the jobs they had to do.\n\nThe main flows on our outfit was Charlie Wellman. I think the most resourceful man for such working conditions that I have ever met.\n\nActing under him was Pete, a native Swede, dark and tan, in exposure acting as General Boss, a most responsible job, which required the overseeing and\nBy seven teams of mules and horses dumping their loads of ties on the grades (or sidings) where they were placed and spaces ahead of the advancing steel.\n\nTwo trains of steel and tie came up from the material yard per day; the first arriving between 6 and 7 a.m., the second about 1 p.m. The work of track laying was continued until the trains were unloaded.\n\nIf a horse (or mule) took one of the team drivers unloading the ties and dumping them on sidings or the grade, ace the managing or \"fool\" jobs were occupied by very outstanding men for difficulties and new situations were very frequently gathering requiring a skill of a high order to cope with them and keep the track laying coming smoothly, and I think a description of them would be appropriate.\n\nThe boss of the big steel gang (name forgotten) was a big hearty, swarthy man, wearing a friendly smile, bit a masterpiece in managing without trouble or accident handling men who were given or new to the jobs they had to do.\n\nThe main boss of our outfit was Charlie Wellman.\n\nI think the most successful men for such working conditions that I have ever met.\n\nActing under him was Pete, a native Swede but dark and tan by exposure acting as Lionel Best's a moat.\n\nA turnkey by exposure acting as Lionel Best's a moat.\n\nPoveshell's job, which required the overseeing and\nManaging all the jobs around the camp, this included all the requirements for the 70 teams of mules, horses, care of the wagons, and the imperatives necessary of having the men on time where required for the work, which often commenced at two to three miles distant from the camp, at 6 a.m., time.\n\nPete (or Pete) was the man who loaded after the work was done, elephant jumbo, tile it was accurately filled.\n\nThe boss of the unloading the team onto the wagons often in difficult situations was Bob, a very big and tall man, always master of every kind of situation, his orders were law or get your time.\n\nMike, a friend of Pete, also Groede was the man directing the work. Unloading each man had an exact order, very easy to get along with.\n\nThe cook (name forgotten) had a very massive fire; breakfast at 4 a.m., dinner at seven o'clock sent out each noon! Over seventy men to cook for meal for including baking of the bread, he was assisted by two cooks. George and another hard working quick acting fellows who must have lived almost without sleep, one or other served the dinner time meals, if his word were to be taken without any question.\n\nThere was also a time keeper, a small fellow which...\nManaging all the jobs around the camp, this included all the requirements for the 70 to 80 mules, horses, care of the wagons, and the responsibilities necessary of having the men on time where required for the work, which often commenced at two or three miles distant from the camp, at 6 a.m. time.\n\nPete took us by bus when the men rode (how long) after the work (how many) elephant fumbaro, tie it up, immediately killed.\n\nThe boss of the unloading the ties out to the wagons (in different situations) was Bob, a very big and tall man, always master of every being situation, his orders were law—or get your time.\n\nMike (friend of Pete) also (name) was the man directing the work (how many) loading each man (how many) road (how many) (how many) required, very easy to get along with.\n\nThe cook (name) had a very marvellous fish; breakfast at 4 a.m., dinner presented them sent out each noon! Over seventy men to cook (how many) meal for including (name) of the bread, he was assisted by two (name) (name) and (name) hard working & quick acting (name) who (name) have lived almost without sleep, one or other serve the dinner time meals, & his word (name) be (name)\n\nwithout any question!\n\nThere was also a time keeper, a small fellow which\nNo one regarded seriously.\n\nThe crew was made up of a mixture of people,\nof men but mostly young & among them were a few\nrather Black Sheep & it was only that two of them\nlater became real good men.\n\nMost of them were pleasant & easy to work & get\nalong with, there were few injuries or accidents\nduring the summer, but toward the end of the fall\nin spite of the conditions accidents were frequent.\n\nI should think about half had homesteads, and they\nwere working to make a stake for a start on their\nplace.\n\nWe fell on hard times a little west of Edmonton towards\nthe Glencoe district, and with the end of the fall\nwe received the typical thank you from our patron employers.\n\nThe great Tycoon, Mr. Kenney of Hanna,\n\nWe had been hired to help pay the great wages of thirty dollar\nper month, but with the proviso that those who stayed to\nthe end of the fall would receive an additional five\ndollars per month (for the time they had worked).\n\nIn the astonishment of all, when we received our\npaycheques they were made out to sum of thirty dollars\nper month & the bonus of three per month for staying to\nthe end was never thought of.\n\nThere was another fellow before quite wishing us\n\n\"Good Bye.\"\n\nHe had been informed or having that a pan break\nto the same place where he given to each man.\nThe crew was made up of a mixture of accounts of men but mostly young among them were after rather Black Sheep's it was said that two of them later became real good men.\n\nMost of them were pleasant & easy to work & get along with, there were few injuries or accidents during the summer, but toward the end of the first in spite of the condition accidents were frequent.\n\nSome think about half had homesteads, and they were working to make a stake for a start on their plans.\n\nWe first started a little west of Edmonton towards the Story-Rainy district and with the end of the fall we received the typical thank you from our patron employers.\n\nWe had been hired to help pay the great wages of thirty dollars per month, but with the provisions that those who stayed to the end of the job would receive an additional five dollars per month for the time they had worked.\n\nIn the autumn we moved all, when we received our pay checks they were made out to sum of thirty dollars per month & the bonus of twice per month for staying to the end was never thought of.\n\nThere was another fellow before quite wishing less \"Good Bye.\"\n\nHe had been informed or having that a pan break to the same place where he given to each man.\nat the end of the fort, this applied also to the steel gang.\n\nThey were true to their promises, the pans back\ntaking the shape of two box cars, for over two-\nhundred men standing room only.\n\nIt was mid December & the temperature below\nzero, only one man in four could get a chance\nto sit; there was no stove for heat & a hole had to\nbe cut in the car roofs for ventilation & no food or\ndrink obtainable.\n\nAfter one & a half days at Vermillion we were\ngiven another box car & a chance to raid the\nlittle restaurant there for something to eat.\n\nThe additional car given us enabled half now\nto have room to sit & take turns with the other half\nstanding.\n\nOn the third day we arrived at H. Bottford the\ndestination for my closest friend & myself.\n\nWe were family while after our long ordeal,\nand I can hardly believe at this time, what\nwe had to endure, & perhaps two worse be\nin mind, but the closing incident, they are true and\nclear in my memory two days later I returned to\nmy little home more the worse for the experience,\nand nearly two hundred dollars richer than\nwhen I left it to seek work in early spring.\n\nI am afraid I am overflowing with memories of those\ntimes & incidents, more than you archives could possibly\nwant.\n\nYours Sincerely,\n\nBill Howse\nat the end of the job, this affair about the steel gang.\n\nThey were true to their promises, the men back taking the ship of two box cars for over two hundred men standing room only.\n\nIt was mid December & the temperature below zero, only one man in four could get a chance to sit, there was no store for heat & a hole had to be cut in the car roofs for ventilation & no food or drinks obtainable.\n\nAfter one & a half days at Vermillion we were given another box car & a chance to raid the little restaurant there for something to eat.\n\nThe additional car given us enabled half now to have room to sit & take turns with the other half standing.\n\nOn the third day we arrived at H. Battleford the destination for my closest friend & myself.\n\nWe covered family work after our long ordeal, and I can hardly believe at this time what we have had to endure, & perhaps too wonder if I'm losing sight of the obvious, incidentally they are true any clear in my memory two days later I returned to my little home more the worse for the experience and nearly two hundred dollars richer than when I had left it to seek work in early spring.\n\nI am afraid I am overflowing with memories of those times & incidents, more than you archives could possibly want.\n\nYours sincerely,\n\nP. House\nMr. Howze\nP.O. Carrahan\nSask.\n\nMrs. D. H. Bocking\nAssistant Provincial Archivist\nUniversity of Saskatchewan\nSaskatoon\nSask.\n\nIt is necessary to prepare a general questionnaire on pioneer life because no individual answer it has exactly the same experiences as another. Some of the questions to your experiences; others may prove impossible for you to answer, so don't blank spaces. Use extra sheets of paper if there is not sufficient space to\n\nDon't hesitate to give details, or describe particular events, if they\nMr. D. H. Bocking\nAssistant Provincial Archivist\nUniversity of Saskatchewan\nSaskatoon Sask\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experiences of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: WILLIAM HOWSE\n2. Your address: CARRAGANA, SASK\n3. Date: Dec. 1962\n4. Where were you born? (Give name of place and country): MONMOUTH, ENGLAND\n5. What was your father's name and occupation?: J.H. HOWSE SADLER\n6. When did you come to Saskatchewan? (Give month and year): May 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Miami, Manitoba from Aug 1903 till May 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): 30 years\n9. What were your reasons for coming West?: I had been apprenticed to Electrical Work, finishing that period in 1903 & worked in London but following the end of the Boer War I became one of a large number of unemployed in Northwich, Northwich when worked fifty thousand lost their jobs in one week. This caused me to leave & come to Canada seek work.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through other people and the intensive advertising put on by the Government.\n1. Your full name: WILLIAM HOWSE\n2. Your address: CARRAPANA, SASK.\n3. Date: Dec. 1962\n4. Where were you born? (Give name of place and country): MONTMOUTH, ENGLAND\n5. What was your father's name and occupation?: T.H. Howse SAPLER\n6. When did you come to Saskatchewan? (Give month and year): May 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Winnipeg, Manitoba from Aug. 1903 till May 1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I\" was a small child,\" \"I was in my teens,\" etc.) 20 years\n9. What were your reasons for coming West?\n   - I had been apprenticed to Electrical Work, finishing that part in 1904. I worked in London for (following the war) the Board of Trade. I became an electrician in Northam (then known as Northam) last claim. I was in one week. You can see me to hear me come to Canada's work.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    - Through other people and the information being put out by the Government.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   They were against my coming, but I was young & anxious to experience a little of the world.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   By myself, but made travelling friends quickly.\n\n13. What means of transportation did you use?\n   S.S. Corinthian (Allen Line) to Montreal via Colonist train to Winnipeg C.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   A lot of the passengers were young Electricians like myself & the journey was very pleasant and without incident.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Battleford neighborhood, working on roads & bridges on the Saskatoon Trail, in tents.\n\n16. Where did you settle or take up land?\n   48 miles West of Battleford, on Cut Knife Plain.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   All my time until settling on Homestead was at various outdoor jobs on Road or Railroad building & bridges including C.N.R. bridge 8 miles west of Battleford.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   On farms in Manitoba.\n   (Settled on my homestead) in 1906, occasionally going away to earn funds to carry on, & buy needed equipment.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were against it at first, but they came to like it.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nBy myself but made friends quickly.\n\n13. What means of transportation did you use?\n\nS.S. Courthian (Allen Line) to Montreal via Clover Train to Winnipeg C.P.R.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMyself, a little nervous was very pleasant and without incident.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBattleford neighborhood, writing on ready bridges on the Saskatchewan Trail in tent.\n\n16. Where did you settle or take up land? 45 miles North Battleford on\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nAll my time until settling on Homestead 1 mile west of railway station (C.W.R. Bridge 8 miles west of Battleford)\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nOn farms in Manitoba, (settled on homestead) in 1906, occasionally going away to earn funds to carry on buying needed equipment.\n19. How often did you write to relatives or friends in your old home?\n   Not too often, a few times per year, but letters were very welcome.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   I was married in Winnipeg in fall 1920, through accident & World war II happened.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   I don't think so.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   [Handwritten text not legible]\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Quite a few, would almost fill a book.\n   I served in Canadian artillery in World War I & returning back filled on land North of Prairie River on Bush land, it was a tougher proposition but we made out, our second son farms the land, our five children have made good with good homes & families.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Mostly on outside work, my probably longest job was construction of C.N.R. from Battleford to Edmonton from May to Dec. 1905. This was a great experience & met some very outstanding men.\n   Perhaps a description of this work might be of historical value, conditions & work were very severe.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Shikarichawon because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. How did you make your living?\n25. When was the first car used in the community? about 1919 or 1910\n\n26. If you owned a car before 1914, when did you buy it? What make? In 1930 or about that time, Ford Model T, Coach.\n\n27. Where was your trading center? How far from your home? First Battleford, then Paynton, then Unity, finally Cut Knife. After the war it was Prairie River & then Carriagama.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) Our trade town came as the Railroad were built, C.N.R. through Paynton & Battleford, then Unity, when Grand Trunk Pacific was built, then branch line to Cut Knife from Wilkie C.P.R.\n\n29. How often did you shop in the early days? As needs arose, a week, a month or longer.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Probably during war times.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? It was installed in my house while I was away in the War & charges for unused service.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? Expected to stay if things turned out satisfactory, I did not mind pioneer conditions. People varied but on the whole were friendly, strict a good code of honesty.\n25. When was the first car used in the community? about 1909 or 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you begin to buy through mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes, families often moved away because good land was hard to find out there. Otherwise, work likely had to be done.\n\nThis applied to the stay in Cut Knife area.\n\n35. Did many people move away during the 1930s? Did many return?\n\nIn this district, very few of the original settlers stayed long enough to prove up; the conditions were too severe, there were no roads, farms, or facilities.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nNot much. See first school volunteer organizer for a few social needs.\n\nThis applies to the members of our family.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nNot much, but a few firsts: first gasoline engine used for wood sawing & grinding.\n\nFirst radio, home built one tube headphones set, but a wonder to all visitors.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe origin of the name Cut Knife was told to a gathering (name) attended by a man old Indian, originating in the warfare between the Cree's and the Black feet. It is possible the source of this name is not otherwise known.\n\nThe name Carrigans (Held with 220) was given to the first post office letter was for the nearby school, later given to the C.N.R. siding 6 miles distant which became the village of Carrigans.\n\nThe story is typical early pioneering type.\n5. Did many people move away during the 1930s? Did many return?\n\nIn this district, many people left the area during the Great Depression due to unemployment and economic hardship. However, many returned after World War II.\n\n6a. If you or some members of your family have held public offices, or have been active in any organizations, mention it here, giving dates where possible.\n\n7. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n8. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new names as above in (1), (2), (3).\n\nThe origin of the name Cat Knapp is not known. It is likely that it was named after a local family. The name was later changed to a more descriptive name, but it is not known when or why.\n\n9. What was life like in your community during the Great Depression? How did people cope with the economic hardships?\n\nLife was very difficult during the Great Depression. Many families struggled to make ends meet. People worked long hours for low wages and often had to rely on government assistance programs. Despite these challenges, communities came together to support each other and find ways to survive.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nI have a file of old letters & documents of the early days of this settlement, I do not know if they would be worth while.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMrs. Sam Sampson, + 3 grand children\n323, 26th St. W., Prince Albert. Graduates here.\n\nMrs. Francis Bouch, + 3 children, Methodist Store, Rimbey Alta.\n\nMiss Helen House, Teacher, Prince Albert Sack.\n\nTwo sons of H. and W.T. House with families farming in this district.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe coming of the Railroad C.N.R. was first, then roads, Radio, Electric Power & development of a stable community.\n\nPorcupine Plain is our best nearby town, Carreague is losing out in the competition but is nearest for distance. Some & Becker are also small village towns giving service to the community.\n\nSouth of the C.N.R. track is an inhabitable forest.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThere was a strange happening here that deserves careful record, a visit of a large meteorite in July 1921, details available.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nA short letter accompanies this questionnaire.\n\nWould be pleased to give any fuller information if above information desired.\n39. Questions regarding historical source materials.\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and records, minute books of community organizations, old newspapers, old photographs, written recollections and reminiscences? (Describe.)\n\nShare a file of letters & dreams of the early days of the settlement. Please let us know if they would be valuable.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe coming of the Railroad C.N.R., bank-first, then road, Radio, Electric Power + development of a stable community.\n\nPoveshuppe Plain is our heart next town, Carriagene is losing out in the competition but is nearest for distance.\n\nSourpise & Maclean are also nice villages to go to.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nThey lost a large lot of land that deserves careful study, a much larger historic site in July 1941, details.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\na short letter accompanies this questionnaire.\n\nWould be pleased to give any further information if above desired.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1904E-L_772.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 38, "total-input-tokens": 63080, "total-output-tokens": 10091, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 938, 5], [938, 1855, 6], [1855, 2968, 7], [2968, 4084, 8], [4084, 5023, 9], [5023, 6008, 10], [6008, 7189, 11], [7189, 8375, 12], [8375, 9624, 13], [9624, 10954, 14], [10954, 12156, 15], [12156, 13399, 16], [13399, 14689, 17], [14689, 15906, 18], [15906, 17164, 19], [17164, 18436, 20], [18436, 18952, 21], [18952, 19043, 22], [19043, 20708, 23], [20708, 22300, 24], [22300, 23811, 25], [23811, 24987, 26], [24987, 26437, 27], [26437, 27700, 28], [27700, 29174, 29], [29174, 29883, 30], [29883, 31554, 31], [31554, 32457, 32], [32457, 34485, 33], [34485, 36104, 34], [36104, 38111, 35], [38111, 39682, 36], [39682, 39682, 37], [39682, 39836, 38]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]