[{"id": "5e25d23ece82293f3d039b68764e93399336764c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Ethel Maud Laycock\n2. Your address: Battleford\n3. Date: May 27, 1952\n4. Where were you born? (Give name of place and country): Virden, Man.\n5. What was your father's name and occupation? Thomas Hitchins Farmer\n6. When did you come to Saskatchewan? (Give month and year): May 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   I was seven years old.\n\n9. What were your reasons for coming West?\n   My father wanted to ranch.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    We learned about it from other people. Mr. Megaffin of Balgonie had a brother at Virden whom we knew and it was through him that we heard about Battleford.\n1. Your full name: Ethel Maud Laycock\n\n2. Your address: 1347 LeFleur Rd.\n\n3. Date: May 2, 1952\n\n4. Where were you born? Warden, Man.\n\n5. What was your father's name and occupation? Thomas Hutchins Farmer\n\n6. When did you come to Saskatchewan? (Give month and year) May 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you say \"I don't know.\")\n\n9. What were your reasons for coming to Western Canada?\n\nMy father wanted to move.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWe learned about it from other people. Mr. Megaffin of Balgonie had a brother at Warden whom we knew and it was through him that we heard about it.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy father's brother wasn't much in favour of moving.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nJust our own family.\n\n13. What means of transportation did you use?\nWe came by train to Saskatoon and from there to Balgonie we came by horse and wagon.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nI can remember at Regina most of the side was covered with snow and lengthwise. At Saskatoon I saw the width span of the railway bridge go out at about 8 A.M. May 27, after having crossed over by train the evening before. The bridge was reported to have sunk 3 inches while we crossed.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe stayed at Balgonie, near the camp.\n\n16. Where did you settle, or take up land?\nWe bought land at Balgonie and took over the stopping place for the mail.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nI lived in Battleford for six years attending school, later teaching at Marsden and Poppasico, and the past thirty-five years fourteen miles N.E. of Battleford.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nBy teaching and doing work and since as a housewife on a farm.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy brother thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nJust our own family.\n\n13. What mode of transportation did you use?\n\nWe came by train to Edmonton and from there to Balgonie on the by train and stagecoach.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\nI remember meeting at Regina and the ride was very rough and bumpy. We had to cross the railway bridge near Allan at 8 A.M. May 7th after having arrived at Allan by stagecoach. We had to walk about 3 miles while our horse was being fixed.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed at Balgonie Hotel until we could find a place to rent.\n\n16. Mention any other plans where you have lived since coming to Balgonie.\n\nI visited my parents in Regina and then moved to Balgonie and worked at the post office.\n\n17. What kind of work did you have?\n\nI worked as a housewife and a farmer.\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote quite often and kept in touch with relatives in England, Manitoba, and in the U.S.A.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nJay Floyd Laycock, Saskatchewan July 22, 1915\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nMy father was instrumental in getting some of the Barr Colonists to settle at Balgonie.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThe prairie fires were always a menace also illness when the nearest Dr. was over twenty miles away. One of the highlights of my very early years here I think 1903 was when \"Patience Johnson\" had dinner with us on her way to Battleford for a concert. We had roasted wildfowl and she carved it.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe went to Battleford occasionally 22 miles, and visited our nearest neighbors three miles away. Later on we had service at our house for a number of years. All our travelling was done by horse and sleigh.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nMy father was instrumental in getting some of the Bar U Colonists to settle at Balgonie.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe first winter was very hard. We had no shelter except a small tent. We were forced to live in this tent until spring. The weather was extremely cold and we suffered greatly from the cold and hunger.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far?\n\nWe went to Battleford occasionally. It was about 22 miles away. Later on we moved closer to our home for our land service at our house for a number of years. All our building was done by hand and almost all.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   Battleford 22 miles by rail at 83rd year after we were married and still 14 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days? Not very often.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   My folks ordered most of their clothing from Eaton's in Toronto when we first came west and since I was married we did a lot more buying that way. The last few years we buy more in N. Biford and Battleford.\n\n32. When did you first have a telephone and what company provided it?\n   The telephone was built here in 1920.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came prepared to stay.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1934, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to take them? (Indicate any changes due to new town appearance.)\n\n29. How often did you shop in the early days? - not very often\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\n32. Did you ever buy anything from the catalogues?\n\n33. When did you first have a telephone and what company provided it?\n\n34. The telephone was always there.\n\n35. When did you make up your mind after trying it out? When all you wanted was a permanent TV? Or did you make up your mind after trying it out? Make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n   After moved, but others moved in.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n   I was Sec. for the Homemakers club for several years, and Sec. for our Church. My husband was teacher at Eagle Hills school for over 30 years and was the first Sec. of the Masonic Fraternity and Sec. of the Weekly Board for 20 years. The past six years he has been Sec. of the Telephone.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n   My husband's father was instrumental in forming the first school district Eagle Hills No. 1047.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n   The school was named after the Eagle Hills. Cooper Creek was named after an old rancher. A big hill coming along the creek is called the Ballendine Hill after the Ballendines who lived at the top of the hill and now live in Battleford.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did any people move into your district after 1914? If so, how many?\n\n26. If you or some member of your family have held public office, or have been active in any organization, position it here, giving dates whenever possible.\n\n27. Have you ever been a member of any club or association?\n\n28. If yes, name them:\n\n29. If no, explain why not.\n\n30. If yes, describe the activities of these clubs or associations.\n\n31. If no, explain why not.\n\n32. If yes, describe the activities of these clubs or associations.\n\n33. If no, explain why not.\n\n34. If yes, describe the activities of these clubs or associations.\n\n35. If no, explain why not.\n\n36. If yes, describe the activities of these clubs or associations.\n\n37. If no, explain why not.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) the date of its acquisition; (2) any changes in names since the first time; (3) the date and reason for change.\n\n39. The school was named after the old homestead along the creek called the Baldwin Hills. Goofen Park was a big hill covered with an old barn. A big hill covered with Ballentine Hill off of the hill are now live in Beattyford.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a few old photos, one of the Gov. line erected at Balgonie for the convenience of the Barr Colonists on their trek to Clayhannah another of a steamboat on the back River.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren Julia Ann - Mrs. R. C. Hill, 7113 Ford Leslie & Charles Laycock. Norma Betty Ruth (Hill)\n\n41. What do you think are the most important changes in your community since you first came West?\n\nBetter homes & roads. Up-to-date machinery & cars.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, old newspapers, old pamphlets, old postcards, old maps, old books, old manuscripts, old records, old documents, old artifacts, old memorabilia?\n\nWould you be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to lend them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf so, please provide the following information:\n\nName:\nAddress:\nPhone:\nEmail:\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________________________\nThe Indians had pow-\nwows by the creek\nwhere we lived. I can\nremember the first\none very well, as my\nfather had gone to\ntown and mother and\nthe children, I being\nthe oldest age 7 was\nleft alone. A band\nof Indians from the Red\nPheasant reserve\narrived around 7 P.M.\nsuddenly to meet\nanother band on\ntheir way home from\nSaskatoon. We were\nall terribly scared\nmother included, at\nthe noise & dance and\nespecially when one old\nIndian in a white blanket\nThe Indians had fear-\ned me at the first\nsight; the third saw\nme as the friend, an\nenemy, a cruel, as my\nfather had gone. He\nforsook and mourned\nfor his children being\nthe oldest age 7 were\nleft alone. A line of\nIndians from the Red\nPheasant around 7 PM\narrived eagerly to meet\nour line travel from\ntheir way. From there\ntook down, the town\nall terribly pleased, at\nmost in intellect, at\nthe rivalry dance and\nespecially when one red\nIndian in a white blanket\ncame for bread and then sat on the doorstep to eat it. I and my sister were outside and mother let us in at the window on the far side of the house. Not long after a young man from Megaffins came to play the night and we were glad. I think he must have been a real hero—more for our fears vanished that is. I am sure my sister, Jim and possibly my mother. A few years later I can remember taking part with a number of young people in an Indian dance.\nI am free from sorrow and pain\nout of the gloomy life I lead\nin my lonely, silent room\nwith a window at the window\non the far side of the house\nfor long after\na young man came to me\nthe night and I think\nwhile we sat there\nhe must have been a real hero\nfor a minute that\ntwo lovers mine\nmy dear mother's a few years\nlater than I am\ntaking part in a\nmilitary formation before\nme and I'm sure she\nMy husband Jay Laycock came west with his folks in Mar. 1903 from Miami, Man. He is 63 years old. They came with the idea of securing farms or homesteads for the boys.\nMy dear Mr. Laycock,\n\nI am writing to you from Miami, Fla., March 1903. I am in the 6th year of my stay here. My name will be the idea I have used for the name of the town.\n\nFor the time being,\n\nYours sincerely,\n[Signature]", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_657.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4829, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1308, 5], [1308, 2193, 6], [2193, 3637, 7], [3637, 4785, 8], [4785, 6188, 9], [6188, 7326, 10], [7326, 8692, 11], [8692, 9714, 12], [9714, 11339, 13], [11339, 12678, 14], [12678, 14028, 15], [14028, 15157, 16], [15157, 15606, 17], [15606, 16066, 18], [16066, 16517, 19], [16517, 16912, 20], [16912, 17080, 21], [17080, 17303, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]