[{"id": "95ed951d2bc76731956a2b331574b35fc7c29206", "text": "University of Saskatchewan,\n\nSaskatoon.\n\nMay 15th.\n\nI regret that I have not kept written records of such dates as you are interested in pertaining to the province of Saskatchewan. If my husband were with me, he could supply the information requested in connection with school, church, and United Grain Growers as he was the first secretary of your \"Bennett\" school district, 5 miles south of Gruin, and helped financially and otherwise in carrying on the Baptist church which was the first church organized in Gruin, and who was active in the United Grain Growers society from the first, as long ago as 1900.\n\nBut Mr. Wesley N. Brissett, my husband, passed away in January, 1950, and I cannot depend on my memory for dates except a few of the most personal ones.\n\nI do not consider that these dates would be of interest to you. Of course, I remember many things but cannot give the dates of their happening. I have written to friends who may be able to supply certain dates, and I will return the archives as soon as receive replies.\n\nHoping the information may be of your assistance.\n\nYours sincerely,\n\n(Mrs) Mary E. Brissett.\nUniversity of Saskatchewan,\nSaskatoon.\n\nMay 153.\n\nI regret that I have not kept written rec-\nords of such dates so you are interested in my previous G 1914 in the\nProvince of Saskatchewan. If my husband were with me, he could\nsupply the information requested in connection with school,\nchurch, and United Grace Church as he was the first secretary\nof our \"Bennett\" school district, 5 miles south of Grinnell, and\nhelped financially and otherwise in carrying on the United Church\nwhich was the first church organized in Grinnell, and was active\nin the United Grace Church district from the first, so long ago in Canada.\n\nBut her Wesley H. Bennett, my husband, passed away in December\n1950, and I cannot depend on my memory for dates except\na few of the most personal ones.\n\nI did not consider that these dates would be of interest to them.\n\nOf course I remember many things but cannot give the dates of their\noccurrence. I have written to friends who may be able to supply\noutstanding dates, and I will return the archives as soon as\npossible.\n\nHoping the information may be of use\nyours sincerely,\n\n(Mrs) Mary E. Bennett\nJune 19/53\n\nHaving failed to get further information I am forwarding what I have.\n\nSincerely,\n\n(Mrs) Mary E. Birckett\nHaving failed to get further information, I am forwarding what I have.\n\nSincerely,\n\n(Mary) Mary E. Birckett\nHaving failed to get further information I am forwarding what I have.\n\nSincerely,\n\n(Mrs) Mary E. Birkett\n\nJune 19, 1953\nHaving failed to get further information I am forwarding what I have.\n\nSincerely,\n\n(Mrs) Mary E. Birkett\n\nJune 19, 1953\nPlease print name and address in capital letters.\n\nYour full name: Mrs. Mary E Birckett\nPresent Address: 45 San Jose Ave., Victoria B.C.\nPioneer Address: Girvin\nYear you came to Saskatchewan: 1905\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 2 in walking distance / mile & 1/2 miles\n\nHow many of these were bachelor's homes? neither\n\n2. How often did you usually visit neighbors? seldom\n\n3. Did you usually visit on a Sunday, or other days? other days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly by invitation\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? in afternoon and early evening\n\nWhat about meals? Did you stay when not invited beforehand? sometimes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) It was taken for granted that they would stop, no special form was used.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Our house was 1 mile from the road so visitors didn't often \"drop in.\"\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? The whole family went. Usually there was a third man left at home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Our house was too small for quilting parties. Auction sales were a sort of bee and got together later on.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. We lived in a 2-car-roofed shack at first but had a lumber frame house put up before winter. My husband did most of the work on the house but let several men from the village (joining) to shingle it in one day. The women were too busy at home to come.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. Dances were the commonest form of parties when there was a house large enough. Some who didn't want a dance played cards. The women of our district liked to surprise one of us on our birthday. They were surprise parties each bringing a gift and lunch always in the afternoon and not continued after most had been visited.\n\nWere these more frequent in later years? Give dates. On one birthday.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, monthly, every once a month, etc.? No.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were near enough to you for visiting back and forth? 2 an unusually distant 1 mile & 1/2 miles\n\nHow many of these were bachelor's? neither\n\n2. How often did you usually visit neighbors? seldom\n\n3. Did you usually visit on Sunday, or other days? other days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly by invitation\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.? m afternoon and early evening\n\nWhat about mails? Did you stay when not invited beforehand? sometimes\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(that is, was the term to make polite? yes, or was some other expression common?) if no taken for granted they only would always special from house\n\nIf no meal, what other refreshment might be offered to visitors who had pedicure?\n\n5. Did the whole family go, or did someone stay home to \"lock after the places\"?\n\n6. Did you ever have \"these\" or did someone stay home to \"lock after the places\"? (usually, they were children)\n\nTell what you remember about such gatherings, giving dates if possible, telling what the places were, and how often they occurred. We had a car, my husband did not work, the workers in the village had not started new farms yet, the village (Grinnell) is still single at an old day. This was our first house built.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in houses? Describe. Describe. Describe. Describe. Describe.\n\nDid you follow any kind of informal schedule, such as going to town once a month, etc.?\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? 2 in walking distance (1 mile & 1/2 miles)\n   How many of these were bachelor's homes? neither\n\n2. How often did you usually visit neighbors? seldom\n\n3. Did you usually visit on a Sunday, or other days? other days\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? mostly by invitation\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? in afternoon and early evening\n   What about meals? Did you stay when not invited beforehand? sometimes\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?) it was taken for granted that they would stay, special invitations\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? our house was 1 mile from the road so visitors didn't often \"drop in\"\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? the whole family went. Usually there was a third man left at home\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? our house was too small for quilting parties. Auction sales were a sort of bee and got together better on\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. We lived in a 20x20 foot shack at first but had a lumber frame house put up before winter. My husband did most of the work on the house but we had several men from the village (Girvin) to shingle it in one day. The women were too busy at home to come.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. dances were the commonest form of parties when there was a house large enough. Some who didn't know a dance played cards. The women of our district liked to surprise one of us on our birthday. They were surprise parties each bringing a gift and lunch always in the afternoon and not continued after most had been visited.\n\nWere these more frequent in later years? Give dates. on one birthday.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a month, twice a month, etc.? no.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first ten years, how many houses were near enough to you for visiting back and forth? How many of these were bachelor's homes? Neither.\n\n2. How often did you usually visit neighbors? Often.\n\n3. Did you usually visit on a Sunday, or other days? Other days.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Mostly by invitation.\n\n5. What time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? In afternoon and early evening.\n\n6. What about meals? Did you stay when not invited beforehand? Sometimes.\n\n7. How was the invitation to a meal worded when people had come unexpectedly? (That is, was the term to \"take refreshment\" used, or was some other expression common?) If so, what?\n\n8. If no meal, what other refreshment might be offered to visitors who had dropped in? Our house was a mile from the road and we rarely didn't offer refreshment.\n\n9. Did the whole family go? Or did someone stay home to cook after the guests left?\n\n10. Did you ever have \"open house\" when groups of neighbors came together to put up a building, make quilts, or other such activities? Tell me what this meant to you, and how often they occurred. We didn't do this very often.\n\n11. In the earliest years that you were here, were there many parties, whilst drives or dances in town? Describe them.\n\n12. Did you follow any kind of informal schedule, such as going to town every two weeks, month, etc.?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nBox socials were held twice or three times.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? Later than 1914 I think.\n\nWhat material was it made of? Lumber\n\nHow large was it? 15' x 20'\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The community through special funds.\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) Both were used. The hall was used for larger gatherings concerning more people than in the school district.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Seldom as our two daughters were too young for dancing gatherings.\n\nHow were babies and small children provided for? Some were laid in cribs etc. when at the school, to sleep, and put to bed on the bed in homes.\n\nHow were horses sheltered and fed in the winter time at these parties? The school had a barn, for small animals.\n\n11. What card games were popular in the early days? Whist, We didn't play cards so we are not well informed on the matter.\n\nWas there card playing for a prize? Not in the earlier years. There was a \"five clubs\" in the village in later years, with prizes each night.\n\nWhat dances were popular? Square dances, waltzes, two-steps.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Card playing was used more by Anglican people than by U.C. people. If one distanced from that form of entertainment they stayed away. If invited to a home they might have chosen other games.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, parties, etc.) If you have not described these on the school questionnaire, give dates.\n\n9. When was your first community hall built? How large was it? How many people attended?\n\n10. What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.?\n12. What attempts at formality, or \"swank,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? practically none.\n\n13. Was the chivaree known in your community? occasionally\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nSometimes attended one. They were usually attended or arranged by a few young men. Sometimes house parties were given for newly married couples attended by men and women, held in the village hall.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life become noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nThe (United) Grain Growers\n\nGive the date and reason for it being organized. About 1910. To secure better facilities for farmers in handling their grain, including platforms, elevators, a fair system of supplying cars, shipping grain, etc.\n\n16. Was there a Saskatchewan Grain Growers local in your community? yes\n\nTell when it was organized, and what steps led to its organization. About 1916. A few farmers got together and appointed officers and held meetings in helpful spots, as Mr. Green and Mr. Bartlestone. Contributions soon followed.\n\nApproximately what proportion of the farmers in the community belonged to it? I judge 60% to 70%\n\nHow many women belonged? a few How often did it meet? fortnightly\n\nWhat were some of the activities carried on by this organization? Having elected Grain Growers from other towns occasionally, having debates and musical programs when possible, and picnics in summer, sometimes with an outside speaker.\n\n17. Was there a Homemakers' Club in your district? yes\n\nWhen was it organized? 1917 or 1918?\n\nApproximately how many women belonged to it? 20 or 30\n\nDescribe what you remember of its activities and services. I belonged to the women's section of Grain Growers and had not time for both. They usually sent me a list of their members & conventions at the University once a year. Homemakers included town and county members.\n3.\n\n12. They attempt at formality or \"formal\" do you remember in small towns, much\nmore so than in big cities? Calling cards, visitors treated ceremonially\nin parlor, etc., specifically name.\n\n13. Was the olivette known in your community? Occasionally\nDescribe what you remember about olivettes, telling how common they were,\nany traditions connected with them, etc.\n\n14. Sometimes house parties were given for neighborhood couples\nattended by men and women, often held in the valley hall.\n\n15. What was the name of the first organization of any kind that you can remember\nbeing established in your community?\nGive the date and reason for its being organized.\n\n16. Was there a Seed Exchange Club in your community?\nTell when it was organized, and what steps led to its organization.\n\n17. Was there a Homemakers' Club in your district?\nWhen was it organized?\n\n18. Approximately how many women belonged to it?\nDescribe what you remember of its activities and services.\n\n19. In my town, members of the University met\nevery year. Homemakers included both men and women.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding country. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money? **Dances, socials in private homes, occasionally.**\n\n19. Where did various organizations hold their meetings? **The grain growers met in halls in towns or villages and sometimes in country schools. The women's organization, also, met at several different times and places.**\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? **Not in the early years.**\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? **Yes. Give dates if possible.**\n\nWho provided the lantern and the slides? **A visitor from some outside place or an implement company.**\n\nWhat were the slides about? **Some were missionary slides with some strange unusual objects or scenes.**\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? **Kite flying was rarely seen.**\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? **Ball was almost as popular with girls as with boys. Perhaps skirts were in the way of girls playing marbles. In those days a girl would probably have strongly objected to wearing overalls.**\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was organized, its activities and purposes, who belonged (men, women, children), whether it was organized for charitable or religious purposes only, or was centered in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? (Give names of places.)\n\n20. Were there any special events or activities in your community during the early years? (Describe, telling who gave them, how they were attended, and any other details you remember about them.)\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWhat were the slides about? Some were made by members.\n\nAlways unusual objects in scene.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletyping, ball, marbles, fly kites, etc.)?\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nBall was almost a popular with girls as well as boys. Perhaps this was due to the way I girls playing marbles. In those days a girl would probably have strongly objected to playing marbles.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Vassar\" or others, checkers or other games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, folklore or other objects or games in the snow? Describe.\n\n25. What was the date of the first picnic that you attended in Saskaatchewa? Give year and month if possible. \n\n26. Who organized it? \n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\n28. Was it the first picnic held in the community? If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink? \n\n32. What time of the day did it start, and how long did it last? \n\nI didn't stay.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. They are fewer and not so generally attended.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Later than 1914\n\nWhen was the first indoor rink built, and what was it used for? After 1935.\n33. Describe any features of this school which you remember as outstanding.\n\n34. Name the different kinds of plants which you knew of in the early days, such as those grown in the school grounds, school or nearby fields, planters, etc. Tell about any differences in matters clothing, uniforms, food and shelter, when held, etc.\n\n35. What changes have you noticed in planters since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them various places and sport (e.g., women, mostly young people).\n\n37. For what team was the first team organized in your community to play against neighboring teams?\n\nWhat year?\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving data of organization, if possible, and tell something of their activities - played against whom from neighboring towns, played at local sports days, entered in competition in larger contests, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). Since then, 1914\n\nThen was the first indoor rink built, and what was it used for? From early after 1935.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\nGIRVIN was a smaller village between 2 larger villages where grew towns.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nwe took 3 or 4 books with us from Ont., some fiction, Dickens, a few history as Carlyles French Revolution, a few poetry Longfellow & Burns and literature as the works of E. Stanley Jones History of Canada, and England and of course, Bibles, Hugh Miller's biography, Lambs Tales from Shakespeare etc.\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many? Very few books were also in wardrobes.\n\n44. To what extent did you exchange books with neighbors? We loaned our two.\n\n45. Did you buy many books after you came west? Give details. Not in the earlier days.\n\n46. What books were sent to you as gifts in early years? Children's books for our daughters.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. No\n\n48. Was there a school library? Yes When was it begun? about 1917 to 1918\n\nTo what extent were books borrowed from the school library for adults to read at home? Seldom if ever.\n\n49. Did parents ever use their children's school text books as additional reading material? Possibly. I have read the Canadian Geography.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community plans?\n   Who was responsible for starting the first sports day?\n\n41. How many people attended the event? (Give a list of the names and authors if possible. If not, tell how many books you brought with you when you came west. Give details about the event.)\n\n42. What kind of books did you bring with you? (Give a list of the names and authors if possible. If not, tell how many books you brought with you when you came west. Give details about the event.)\n\n43. How many of your neighbors brought books with them?\n   What kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy any books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n   Give details and dates.\n\n48. Was there a school library?\n   When was it begun?\n   To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town? Yes\n\nWhen was it started? Who started it?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why? In later years we went to the Post Office for books on which we paid only return postage of 3¢.\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Montreal Witness, The World Wide.\nThe Christian Guardian.\nThe Winnipeg Herald for a few years. I am not sure of the name. In Sunday school we received \"Onward\" and other Methodist publications.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We kept these until they closed.\n\nPublication and still I get The Christian Guardian which has become \"The United Church Observer\".\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nMany of the same but we moved several times and usually gave away all fiction and some others to S.S. library and friends on account of their weight.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. As for the above were weekly papers and also received S.S. papers, as Onward and others for the children.\n50. Has there ever been a community library in your district or town? No\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Christian Witness, The World's Work.\n\nThe Christian Guardian.\n\nThe Unwin Library (for a few years, I am not sure of its name).\n\nDescribe later changes in your subscriptions, telling why you stopped certain ones and subscribed to others.\n\n52. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n53. What books or papers that you brought to the west with you do you still have?\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\n55. Propose and also record $5.00 per year as our aid and all for the children.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A violin, an organ, etc.\n\n57. What instruments did any of your neighbors have? Many had violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. Came here after 1914.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe had occasional sing-a-long or practice, mostly hymns or sacred songs.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nchiefly the old songs as \"Turkey in the Old Campground,\" \"Way Down Upon the Western Side,\" \"Out Where the West Begins,\" \"O Give Me a Home Where the Buffalo Roam.\"\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\nNo folk music unless I'm going back to Dixieland and such old American folk songs.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nAt little gatherings.\n\n63. Was there a band in your community? Yes. When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A violin, an organ, etc.\n\n57. What instruments did any of your neighbors have? Many had violins.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. More till after 1914.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community? Chiefly the old songs as \"Turkey in the Old Campground,\" \"Way Down Upon the Tennessee River,\" \"Out Where the West Begins,\" \"O Give Me a Home Where the Buffalo Roam.\"\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain. Yes folk music unless I disagree back to Dixie and some American folk songs.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. At little gatherings.\n\n63. Was there a band in your community? Yes\n\nWhen was it started?\n\nWho started it?\n\nHow long did it continue?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now than compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? Explain.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo, we heard false alarms of spring from all school children, and noticed its full return with ducks, geese, etc.\n\nbut did not record them.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNot to my knowledge\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music or pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905A-E_2024.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 59760, "total-output-tokens": 9800, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1129, 5], [1129, 2250, 6], [2250, 2368, 7], [2368, 2476, 8], [2476, 2596, 9], [2596, 2716, 10], [2716, 3844, 11], [3844, 3844, 12], [3844, 6336, 13], [6336, 8090, 14], [8090, 10579, 15], [10579, 12079, 16], [12079, 14563, 17], [14563, 15015, 18], [15015, 17374, 19], [17374, 18440, 20], [18440, 20302, 21], [20302, 21652, 22], [21652, 22907, 23], [22907, 24148, 24], [24148, 25450, 25], [25450, 26708, 26], [26708, 28560, 27], [28560, 29767, 28], [29767, 31389, 29], [31389, 32513, 30], [32513, 34082, 31], [34082, 35592, 32], [35592, 36714, 33], [36714, 38010, 34], [38010, 38010, 35], [38010, 38162, 36]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]