[{"id": "19e8a2e6bc9937cfae4dd76bdd513f856cd8e67a", "text": "S-X2\n32. Bird, (Mr. and Mrs. J.R.)\n1. INTERMEDIATE QUESTIONS\n\nWhat year did you start homesteading in eastern Canada? 1859\n\nWhere did you settle? 20-15-5 W & R\n\nThere had you been living before that? Out of limits\n\nFor how many years did you operate there? 10 months\n\nHow far was it to your nearest store? 10 miles\n\nHow often could a visit be made to the store? Twice a month\n\nWhat crops did you usually grow in those earliest years? Potatoes, oats, corn\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brands of white flour did you use in the early years? Appel's mill\n\nIn what quantities did you buy? 100 lbs at a time\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use of whole flour?\n\nWas flour milled locally? Yes\n\nWhat was the price for a twenty pound barrel of rolled oats? 65¢\n\nWhat other grain products did you use?\n\nCornmeal\n\nOther?\n\nDid you grind your own wheat for porridge?\n\nHow did you grind it? By hand\n1. INTERVIEWING\n\nWhat year did you start homesteading in New Mexico? 1894\nWhere did you get your homestead? 2.4 - 15 - 5 N & W\nHow many people did you have at first? 6\nHow far was it to your nearest store? 10 miles\nHow often could a visit be made to the store? Once a month\nWhat crops did you usually grow? In those early years, we grew corn, beans, and potatoes.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of wheat flour did you use in the early years? Atchison, Topeka & Santa Fe\nIn what quantities did you buy it? 100 lbs. at a time\nWhat was the usual price per hundred pounds of wheat flour?\nHow much did you use each year? 100 lbs. per year\nWhat other grain products did you use? Cornmeal\nDid you grind your own flour? Yes\nHow did you grind it? With a small hand mill\n\n*we made flour by hand\n3. SIGNATURES AND STAMPS\n\nIn what quantity did you buy milk? What kind of milk did you buy? How much did you pay?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Did you make butter? What was the price of butter? Did you pay extra for butter? Did you make cheese? What kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? How did you get fresh meat? How often did you get fresh meat? Did you use game? Was there a \"meat ring\" in your neighborhood? If so, what was it organized for? Did you use fish? For how long? What part did fish play in the family diet? Was the fish fresh, cured, or canned? Kindly sign here.\n2.\n\n3. SIGNS AND STORIES\n\nIn what quantity did you buy goods in early days? A little.\n\nWhat was the price for a ton pound of salt? $1.00.\n\nWhat brand of cotton cloth did you use at that time?\n\nAt what prices?\n\n4. DAIRY PRODUCTS\n\nHow did you get milk? From cows.\n\nDid you make butter? Yes.\n\nDid you make cheese? Yes.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? Rabbit.\n\nHow often did you eat fresh meat? Weekly.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized? 1910.\n\nDid you use piano? Yes.\n\nFor how long? 10 years.\n\nThat part of fish play in the family diet?\n\nWas the fish fresh, cured, or canned? Fresh.\n\nKind of fish? Salmon.\n6. Beverages\n\nWhat kind of tea did you buy? (green, black, etc.) At what price?\n\nWhat kind of coffee did you buy? (instant or ground) At what price?\n\nThat other beverages? At what price?\n\n7. Vegetables\n\nCan you get potatoes at the store? If not, where from?\n\nThat year did you first grow your own supply for the winter of?\n\nPotatoes\n\nCabbages\n\nCarrots\n\nOnions\n\nTurnips\n\nBeets\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)?\n\nWhat weight?\n\nHow did the grocer handle prunes (by box)?\n\nThat was the price of prunes?\n\nThat was the price of prunes?\n\nThat other dried fruits did you use in the driest days? (apricots, peaches, raisins, currents or others?)\n\n8. Preserving\n\nIn the early years did you preserve any foods by canning?\n\nOther foods?\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own wine?\n6. Buyings\n\nWhat kind of tea did you buy? [illegible]\nAt what price? [illegible]\n\nThat kind of coffee did you buy? [illegible]\nAt what price? [illegible]\n\nThat other beverage did you buy? [illegible]\nAt what price? [illegible]\n\n7. Vegetables & Fruits\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n[illegible]\n\nCould you get potatoes at the store? [illegible]\n\nIf not, where from? [illegible]\n\nWhat year did you first get your supply for the winter of:\nPotatoes [illegible]\nCabbages [illegible]\nCarrots [illegible]\nOnions [illegible]\nTurnips [illegible]\nBeets [illegible]\n\nIn what quantities did you buy white navy beans? [illegible]\n\nHow did you buy prunes, (in bulk or by the box)? [illegible]\n\nThat weight? [illegible]\n\nFor did the grocer handle prunes (by box)? [illegible]\n\nThat was the price of [illegible]\n\nWhat other dried fruits did you use in the earliest days? (apricots, peaches, apricots, prunes, raisins, currants, or others)? [illegible]\n\n8. Preserving\n\nIn the early years did you preserve any foods by [illegible]?\n\nRoses? [illegible]\nBeans? [illegible]\nSusinatons? [illegible]\n\nThat year did you first preserve fruit by canning? [illegible]\n\nThat year did you first preserve fruit by freezing? [illegible]\n\nThat year did you first preserve fruit by smoking? [illegible]\n\nDo you still preserve foods by canning or freezing? [illegible]\n\nTo what extent? [illegible]\n\nDid you make your own wine? [illegible]\nSoda biscuits: always\nMacaroni: always\nGraham flour: always\nBrown sugar: always\nHollandsa: \" \"\nTable salt: \" \"\nDried peas: \" \"\nCornstarch: \" \"\nLily white flour: recently\nPasta: \" \"\nYeast: \" \"\nRaisins: seedless\nRice: always\nCurrants: store in airtight container\nCheese (Cheddar or Brie): always\nVanilla: always\n\n10. Baking:\nWhat type of yeast did you use? Yes\nDid you make yeast for your own use? Yes\nUsing starter? Yes\nUsing hops? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder?\nSoda biscuits: always\n\nFlour: always\n\nSugar: always\n\nSalt: always\n\nBaking powder: always\n\nVanilla: always\n\n10. Baking:\n\nWhat type of yeast did you use? Yes\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nOther? No\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING LIST AS TO THE ITEMS YOU PURCHASED.\n\n| Item          | Approximate Price at the Market | How did it differ from the store price at the time? |\n|---------------|---------------------------------|-----------------------------------------------------|\n| Canned salmon | $5.75                           | No difference                                        |\n| Other canned fish that spoiled easily | $2.32 | No difference                                        |\n| Apples - fresh | $0.98                           | No difference                                        |\n| Apples - dried | $0.98                           | No difference                                        |\n| Lettuce       |                                 |                                                     |\n| Tomatoes - fresh | $0.90                        | Recently                                             |\n| Bananas       |                                 |                                                     |\n| Lemons        |                                 |                                                     |\n| Cornflakes    |                                 |                                                     |\n| Pearl tapioca |                                 |                                                     |\n| Minute tapioca|                                 |                                                     |\n| Sugar         |                                 |                                                     |\n| Dates         |                                 |                                                     |\n| Walnuts       |                                 |                                                     |\n| Icing sugar   |                                 |                                                     |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream)\n\nHow far was this water from your house? (well, at house, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nHas anything happened which has taken place since you first started homesteading, civil war dates where possible.\n11. PLEASE FILL IN THE PRICES TO THE NEAREST CENT\n\n| Food                      | Approximate price at the time |\n|---------------------------|-------------------------------|\n| Corned salmon             | $3.95                         |\n| Grilled and fried         |                               |\n| Other canned              |                               |\n| Fish that was prepared early | - $2.00                     |\n| Apples - fresh            |                               |\n| Apples - dried            |                               |\n| Lettuce                   |                               |\n| Tomatoes - fresh          |                               |\n| Bananas                   |                               |\n| Lemons                    |                               |\n| Grapes                    |                               |\n| Corn flakes                |                               |\n| Other prepared            |                               |\n| Breakfast                  |                               |\n| Bread rolls               |                               |\n| Pearl tapioca             |                               |\n| Minute tapioca            |                               |\n| Sugar                     |                               |\n| Dates                     |                               |\n| Walnuts                   |                               |\n| Icing sugar               |                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout)\n\nIf so, how was this water from your house? All at house, well, barrel, tank.\n\nHow was it brought to the house? (Well, barrel, tank).\n\nIf not, what water supply, mention any others which have taken place since you began living in this house, giving dates where possible.\n\nFirst standard housekeeping.\n### Food Inventory\n\n| Item                  | Quantity | Notes          |\n|-----------------------|----------|----------------|\n| Corned salmon         | 15.95    |                |\n| Other canned fish     |          |                |\n| Apples - fresh        |          |                |\n| Apples - dried        |          |                |\n| Lettuce               |          |                |\n| Tomatoes - fresh      |          |                |\n| Bananas               |          |                |\n| Lard                  |          |                |\n| Butter                |          |                |\n| Cornflakes            |          |                |\n| Pearl tapioca         |          |                |\n| Jugo                  |          |                |\n| Dates                 |          |                |\n| Walnuts               |          |                |\n| Icing sugar           |          |                |\n\n### Water Supply\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout)\n\nIf so, was this water from your house? (well, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n| Item                  | Quantity | Price |\n|-----------------------|----------|-------|\n| Corned salmon         |          |       |\n| Canned corned salmon  |          |       |\n| Other canned fish     |          |       |\n| Fish that can be poached easily |          |       |\n| Green beans           |          |       |\n| Apples - fresh        |          |       |\n| Apples - dried        |          |       |\n| Tomatoes              |          |       |\n| Tomatoes - fresh      |          |       |\n| Tomatoes - canned     |          |       |\n| Biscuits              |          |       |\n| Lactose               |          |       |\n| Gravies               |          |       |\n| Cornflakes            |          |       |\n| Pearl tapioca         |          |       |\n| Minute tapioca        |          |       |\n| Sugar                 |          |       |\n| D. tea                |          |       |\n| Salt                  |          |       |\n| Icing sugar           |          |       |\n\n12. WATER SUPPLY\n\nThere is no water for drinking and for cooking? (Well, river, cistern, dugout) **Ploughs well at home**\n\nIf so, was this water from your house? (well, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nHave any changes been made which have taken place since you began using water supply? Mention any changes which have taken place since you began using water supply. If applicable, give date when started.\n\n**Ploughs well at home**\n13. SOAP\n   Did you buy laundry soap or make your own? If you made your own, did you use lye? Yes, I used lye. That kind of laundry soap did the greatest number of pounds.\n\n14. FUEL\n   What fuel did you use in the house? Wood, coal, oil, gas, electricity, wood, coal, oil, gas, electricity.\n\n15. HEATING\n   Did you have any chance in the use of fuels which have been placed since you first started housekeeping? Electric, gas, other possible.\n\n16. COOKING AND USE OF UTENSILS\n   For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Yes, stove, range, electric, oil, gas, wood, coal, other. Did you use an outdoor fireplace or bake oven? (Give dates) No, wood, coal, other.\n\n   By whom was your first cook stove made? (Name) Price? $25.00. What types of utensils did you use? (Iron, copper, tin, homemade) Iron.\n\n   For preparing food? (chips, earthenware, modern pots, other) Earthenware.\n\n   When did you first see electric appliances? Before 1912.\n6.\n\n13. SOAP\nDid you buy laundry soap or make your own? ... made own\nIf you make your own did you use lye? ... yes\nThat kind of laundry soap did the grease wash? ... yes\n\n14. FUEL\nWhat fuel did you use in the winter last year? ... wood\nDid you not use fuel? ... from fuel\n\n15. FOOD\nWhat new changes in the use of foods which have taken place since you first started housekeeping? ... (no change)\n\n16. HOUSEHOLD ITEMS\nFor cooking, did you use an indoor fireplace or stove in the winter days? (Give dates) ... Radiant Stove ... electric stove on the wood\nDid you use an outdoor fireplace or bake oven? (Give dates) ... no\n\nBy whom was your first cook stove made? ... John Smith\nWhat year was it purchased? ... 1908\nWhat types of utensils did you use? (Iron, copper, tin, homemade) ... iron\n\nFor preparing food? (enamel, earthenware, wooden bowls, other) ... earthenware\n\nWhen did you start using aluminum? ... 1912\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year. Include the number of members at the family meal each day, the ages of the children, and the number of adults.\n\n18. That year did you serve your first Christmas dinner in eastern Tennessee? Give the menu. List those present and five chair approximations to ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. Always\n\nPart of your poverty was not enough to eat, but didn't have...\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at that time. State the approximate number of visitors or number of guests.\n\n18. What did you serve your first Christmas dinner in eastern Tennessee? (approximate date & place)\n\n19. How do you feel about living in rural areas today?\n\n20. What do you think about the future of rural living?\n20. Mention any outstanding differences in the preparation of meals in the earlier days as compared with today.\n\n21. When did you begin to rely on processed foods and packaged foods instead of home grown and home prepared foods? (Give any additional reasons.)\n\n22. Please add other details from your early experiences of buying groceries and eating them in those early, simpler days in eastern Canada.\n\nInclude items not included above, quality, methods of transportation, etc.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1889_32.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4547, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 35, 4], [35, 943, 5], [943, 1744, 6], [1744, 2415, 7], [2415, 3101, 8], [3101, 4149, 9], [4149, 5597, 10], [5597, 6153, 11], [6153, 6487, 12], [6487, 8693, 13], [8693, 10577, 14], [10577, 11734, 15], [11734, 13204, 16], [13204, 14196, 17], [14196, 15109, 18], [15109, 15651, 19], [15651, 16105, 20], [16105, 16583, 21], [16583, 16583, 22], [16583, 16583, 23], [16583, 16583, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]