[{"id": "754a373228ecdb015069097e837bfb7cf3e662a6", "text": "S-X2\n28. Keys, (Mrs. Joseph)\nKEYE, Mrs. Jos.\nKeystown, 1886 (with parents)\n\n1. INTERDIARY USES\n   That year did you start homesteading in eastern Canada? Yes, I did.\n   Where did you set up housekeeping? At Stanley, Green Bay, Wisconsin.\n   How far had you been living before that? Never.\n   For how many people did you prepare meals? Eight.\n   How far was it to your nearest store? Four miles.\n   How often could a visit be made to the store? When necessary.\n   What groceries did you usually buy in those earliest years?\n   For my own supplies at home, I prepared meals for six.\n   How many more trips to town did you make each year?\n\n2. FLOUR AND GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? No, I don't know.\n   In what quantities did you buy flour? Small quantities of whole wheat flour.\n   Was the usual price per hundred pounds of flour? No.\n   How much did you use regular flour? None, we used only whole wheat flour.\n   Was flour milled locally? Yes.\n   Was the price for a twenty pound bag of flour? $1.50.\n   What other grain products did you use? Wheat, cornmeal, oats, and rice.\n\n3. FOOD PREPARATION\n   Did you grind your own flour? Yes.\n   How did you grind it? With a hand mill.\n   There was mostly some white flour, though in limited quantities. A large quantity of porridge would be made in a pot, sliced when cold and fried in fresh dripping. The meal meal this course was cracked wheat.\nMrs. Mrs. Joe.\nKeytown, 1866 (with parents)\n\n1. INTERROGATION LISTINGS\n\nWhat year did you start school in eastern Canada? With parents?\nWhere did you go to high school? At St. John's, Nova Scotia.\nHow far had you been living before that? None.\nFor how many years did you live there? 7.\nHow far was it to your nearest store? Unknown.\nHow often could a visit be made to the store? Unknown.\nWhat groceries did you usually buy in those earlier years?\nFor any new things at times, prepared meals, yes.\nHow much from store? $11.\n\n2. FLAX AND WOOL CULTIVATION\n\nWhat brand of milk did you use in the early years? No.\nWhat quantities did you buy? Small quantities, hard to say what.\nWas the usual price per hundred pounds of milk to flour?\nYou used that flour? Yes.\nWas that flour milled locally? Yes.\nWas the price for a twenty pound bag or roll? $1.00.\nThat other grain products did you use? Wheat, corn, oats.\nCornmeal? Yes.\nDid you grind your own flour? Yes.\nHow did you grind it? Stone mill.\nThere was mostly some white flour, though in limited quantities. A large quantity of porridge would be made in a pot, divided when cold and fried in pork dripping. The meal meal this flour was cooked with.\nKaye, Mrs. Jos.\nKeystown. 1866. (with parents)\n\nInstructions: Fill in as much of this questionnaire as you can and will fit.\n\nName: Mrs. Kaye\nAddress: Keystown, N.Y.\nPhone: 222\n\n1. INTER-DEPARTMENTAL USES\n\nWhat year did you start housekeeping? 1900\nWhere did you get your housekeeping? Keystown, N.Y.\nHow long have you been living there? 1900\nFor how many people did you prepare meals? 4\nHow far was it to your nearest store? 1 mile\nHow often could a visit be made to the store? Weekly\nWhat groceries did you usually buy in those earlier years?\nAnd the very necessary ones bought only by the necessity of living in my own home.\n\n2. FLours AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? No particular\nbrand, as what you had was exchanged for flour from friends.\nIn what quantities did you buy? 100 lbs.\nThat was the usual price per hundred? 1.07\nHow much did you use regular flour? 100 lbs.\nThat was the price for a twenty pound bag of rolled oats? 35¢\nWhole wheat flour? Yes\nThat other grain products did you use? Wheat kernels, corn meal, rice\nCommercially grown? Yes\nDid you grind your own flour for pancakes? Yes\nHow did you grind it? Stone mill\nThere was mostly some whole flour, though in limited quantities. A large quantity of porridge would be made in morning, what was left would be packed in a box, dried when cold and fried in pork dripping. The meal meal flour because was cracked without\nMrs. Jos. \nReynolds. \n1886. (with parents)\n\nTHAT OLD FAMILY CANADA PIONEER DAYS\n\nInstruction: Fill in an oath of this questionnaire as you can and will at \nthe Saskatchewan Archives Office, Box 209, University of Saskatchewan, \nSaskatoon.\n\nName: ____________________________\nAddress: ____________________________\nBirthplace: _________________________\n\n1. INTERROGATORY QUESTION\n\nWhat year did you start homesteading in eastern Canada? _______ _______ _______\nWhere did you settle? _______ _______ _______\nHow far did you travel before there? _______ _______ _______\nFor how many people did you prepare meals? _______ _______ _______\nHow far was it to your nearest store? _______ _______ _______\nHow often could a visit be made to the store? _______ _______ _______\nWhat groceries did you usually buy in those early days? _______ _______ _______\nWhat was the usual price per pound? _______ _______ _______\nHow much did you use whole flour? _______ _______ _______\nHow much did you use white flour? _______ _______ _______\nWas flour milled locally? _______ _______ _______\nWas the price for a twenty pound barrel of rolled oats? _______ _______ _______\nWhat other grain products did you use? _______ _______ _______\nCorncakes _______ _______ _______\nCornmeal _______ _______ _______\nWheat _______ _______ _______\nBarley _______ _______ _______\nRye _______ _______ _______\nOats _______ _______ _______\nFlax _______ _______ _______\nLinseed _______ _______ _______\nPumpkin seeds _______ _______ _______\nSunflower seeds _______ _______ _______\nOther _______ _______ _______\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nThat brand of white flour did you use in the early years? _______ _______ _______\nHand-milled wheat flour? _______ _______ _______\nWhole wheat flour? _______ _______ _______\nFast flour milled locally? _______ _______ _______\nWas the price for a twenty pound barrel of rolled oats? _______ _______ _______\nWhat other grain products did you use? _______ _______ _______\nCorncakes _______ _______ _______\nCornmeal _______ _______ _______\nWheat _______ _______ _______\nBarley _______ _______ _______\nRye _______ _______ _______\nOats _______ _______ _______\nFlax _______ _______ _______\nLinseed _______ _______ _______\nPumpkin seeds _______ _______ _______\nSunflower seeds _______ _______ _______\nOther _______ _______ _______\n\nThere was mostly some white flour, though in \nlimited quantities. A large quantity of porridge \nwould be made in the morning, what was left would \nbe cooked in a boiler, sliced when cold and fried \nin pork dripping. The meal meal flour \nwas cracked wheat.\n3. **MEATS AND MEAT PRODUCTS**\n\nIn what quantity did you buy? (This question is not visible in the image.)\n\n4. **DAIRY PRODUCTS**\n\nHow did you get a supply of fresh milk in the early days?\n\n5. **FISH AND FISH PRODUCTS**\n\nWhat was your main supply in the early years?\n\n6. **FRUIT AND VEGETABLES**\n\nHow did you get fresh vegetables?\n\n7. **BREAD AND BAKING**\n\nDid you make bread at home?\n\n8. **CONFECTIONERY**\n\nDid you make candy?\n\n9. **CLOTHING**\n\nDid you make clothes?\n\n10. **HOUSEHOLD ITEMS**\n\nDid you make household items?\n\n11. **MEDICINE**\n\nDid you make medicine?\n\n12. **OTHER**\n\nDid you make other things?\n3. **SUGAR AND OTHERS**\n\nIn what quantity did you buy this sugar? This was the price. For a ten pound sack of sugar in 1923-24, that was the price. For a ten pound sack of sugar in 1924-25, that was the price.\n\nWhat else did you usually buy with this sugar? What other items did you usually buy with this sugar?\n\nAt what period? At what period?\n\n---\n\n4. **DEALERS**\n\nDid you get a supply or fresh milk in the early days? Did you get a supply or fresh milk in the early days?\n\n---\n\n5. **WHAT ARE THEM**\n\nWhat was your meat supply in the early years? What was your meat supply in the early years?\n\n---\n\n6. **HOW DID YOU GET FRESH MEAT?**\n\nHow did you get fresh meat? How did you get fresh meat?\n6. BEVERAGES\n\nWhat kind of tea did you buy? [Handwritten]\n\nWhat kind of coffee did you buy? (beans or ground) [Handwritten]\n\nPrice? [Handwritten]\n\nThat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes for bushel then you set up homestead? [Handwritten]\n\nCould you get potatoes at the store? [Handwritten]\n\nIf not, where from? [Handwritten]\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes 1894 [Handwritten]\nCarrots 1892 [Handwritten]\nOnions 1890 [Handwritten]\n\nIn what quantities did you buy white navy beans? [Handwritten]\n\nHow did you buy prunes? (in bulk or by the box)? [Handwritten]\n\nThat weight? [Handwritten]\n\nHow did the grocer handle prunes (by box)? [Handwritten]\n\nThat was the price of prunes? [Handwritten]\n\nBuy, dry, and fresh... that was the price of prunes? [Handwritten]\n\nWhat other dried fruits did you use in the earliest days? (apricots, prunes, apricots, peaches, loganberries, raisins, currents or others)? [Handwritten]\n\nDried apples, raisins, currents - cost only 18¢/lb. [Handwritten]\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by canning? [Handwritten]\n\nPeas? [Handwritten]\n\nCorn? [Handwritten]\n\nBeans? [Handwritten]\n\nOther foods? [Handwritten]\n\nThat year did you first preserve fruit by canning? [Handwritten]\n\nThat year did you first preserve vegetables by canning? [Handwritten]\n\nThat year did you first preserve meat by canning? [Handwritten]\n\nDo you still preserve foods by canning or drying? [Handwritten]\n\nTo what extent? [Handwritten]\n\nDid you make your own vinegar? [Handwritten]\n\nThe homesteaders' log houses were all protected by a fire guard, and this was very slow the oldly freezing at the beginning. This bit of land was used for potatoes and when there was sufficient moisture, yielded well.\n6. **BUYING**\n\n   - What kind of tea did you buy? (Tea was bought at what price?)\n   - What kind of coffee did you buy? (Coffee or ground)\n   - That other beverages were used?\n\n7. **VEGETABLES AND FRUIT**\n\n   - What was the price of potatoes per bushel when you got up housekeeping?\n   - Could you get potatoes at the store in 1890?\n   - If not, where from? (Planted in your garden)\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes: 1894\n     - Cabbage: 1894\n     - Turnips: 1890\n     - Carrots: 1890\n     - Onions: 1890\n\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes? (In bulk or by the box)?\n   - How did the grocer handle prunes (by box)?\n   - What weight? 25 lbs.\n   - How did the grocer handle prunes (by box)?\n   - What was the size of prunes? 1/2 lb each.\n\n   - Buy, buy, and buy! (Buy, buy, and buy!)\n   - What other dried fruits did you use in the saloon? (Dates, raisins, currants, or other?)\n\n8. **PREPARATION**\n\n   - In what years did you make your own?\n   - In what years did you buy?\n   - In what years did you buy?\n   - In what years did you buy?\n\n   - Did you make your own vinegar?\n   - Did you make your own vinegar?\n   - Did you make your own vinegar?\n   - Did you make your own vinegar?\n\n   - The homesteaders' big houses were all protected by a fire guard, and this was very good. They were built at the beginning of the fit of land and used for potatoes, and when there was sufficient sunshine, yielded well.\n| Item                      | Year |\n|---------------------------|------|\n| Soda Bicarbonate           | 1854 |\n| Hardtack                   | 1890 |\n| Brown sugar                | 1886 |\n| Molasses                   | 1873 |\n| Table salt                 |      |\n| Common salt                | 1896 |\n| Lily white syrup           | 1914 |\n| Toilet soap                | 1901 |\n| Baking powder              | 1900 |\n| Baking soda                | 1906 |\n| Dried peas                 |      |\n| Dried corn                 |      |\n| Vinegar                    |      |\n| Raisins - sealed           |      |\n| Raisins - unsweetened      |      |\n| Rice                       | 1886 |\n| Currants                   | 1886 |\n| Store Jan - Khris?         | 1896 |\n| Cheese (Cheddar or store cheese) | 1896 |\n| Vanilla                    | 1896 |\n\n10. Baking\n\nWhat type of yeast did you use? [Handwritten text not legible]\n\nDid you make yeast for your own use? Yes\n\nUsing starter? No\n\nUsing hops? Yes\n\nSalt rising? No\n\nDid you buy baking powder? No\n\nBaking soda? Yes\n\nDid you buy flour? No\n\nDid you make your own baking powder?\n\nYes, not sure if present time\nHarlaxton was in salutes\nHarlaxton came in Wodin\nfruits and sold by bush\n\nLily white syrup\n1914\n1901\n1900\n1900\n1900\nDried peas\nDried corn\nVinegar\nFruit - seeded\nWas in sale, had heads in\nStore Jan - Klinzing\nChocolates (chocolate or store chocolate)\nVanilla\n\n10. Baking\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing starter?\nUsing rising?\nDid you buy baking powder? If so, when?\nDid you make your own baking powder?\n\nNo, not at present time\nThere were first ordered 1888-1890\n\nHow can we be sure? It's still a mystery.\n\nThere was no other way to find out.\n\nApples - fresh\ndried\nLettuce\nTomatoes - fresh\npeanuts\nBananas\nLemons\nOranges\nCornflakes\nOther prepared breakfast foods\nCereal - grits\nPovesh\nTapioca\nInstant tapioca\nSago\nDulce\nPalmita\nIcitar\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nWell\n\nHow far was this water from your house?\n\n500 yards\n\nHow was it brought to the house? (pail, barrel, tank)\n\nTank\n\nNow there is hot and cold running water in the house.\n\nSince 1911 - Drinking water has been delivered by truck.\n\nSupply tank in attic.\nThere were first ordered 1888-1950\n\nHow early were they ordered? It was a mystery.\n\nThere were no canned apples. There were no canned apples.\n\nApples - fresh\nLettuce - 1996\nTomatoes - fresh\nPotatoes - 1920\nBananas - 1890\nLemons - 1890\nBroccoli - 1926\nCornflakes - 1926\nPeaches - 1920\nPearl tapioca - 1920\nInstant tapioca - 1940\nSugar - 1990\nDiet - 1890\nSalt - 1890\n\nWater supply\n\nThere didn't you get water for drinking and for cooking? (a.l.), river, slough, dugout)\n\nIf so far was this water from your home? 500 yds.\n\nHow was it brought to the house? (pail, barrel, tank) barrel\n\nFirst started homesteaders, giving dates where possible.\n\nNow there is hot and cold running water in the house.\n\nSince 1911 - Drinking water has still to be hauled. Still water system is in operation with supply tank in attic.\n13. SOAP\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kind of laundry soap did the grocer sell you? How long have you used this soap? Have you used any other brands in the last five years? If so, how long?\n\n14. FUEL\nWhat fuel did you use in your earliest days? Did you ever use oil? Have you used any other fuels? Mention any changes in the use of fuel which have taken place since you first started housekeeping.\n\nNowadays, what type of fuel do you use? Electric and gas furnaces are now being used (1950). The 18th century and earlier used wood, also electricity and gas and oil furnaces are now being used. Oil furnaces are being used to heat public buildings as well as rural homes.\n\n15. HEATING AND COOKING APPLIANCES\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? Did you use an outdoor fireplace or back oven? By whom was your first cook stove maker? What year was it purchased? What types of utensils did you use? (Iron, copper, tin, porcelain) For preparing food (chips, earthenware, wooden bowls, other) Then did you first see steel pans? Aluminum?\n13. COMFORT\n\n14. FOOD\n\n15. HEATING\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates.) What kind of wood did you use?\n\nDid you use an outdoor fireplace or bake oven? (Give dates.)\n\nBy whom was your first cook stove made? (Name, address)\n\nWhat year was it purchased? (Give dates.)\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nAre there other...\n\nPreparing Food? (Other, earthenware, wooden bowls, other)\n\nThen did you first use... (Give dates)\n16. **SNAPSHOTS AND OWN MEMORIES**\n\n   Contain any photos which you would like to include in the scrapbook and enclosures.\n\n   Note: If the food was sent by mail in paper bags, label about 1932, Leo could be purchased in packages.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate number, etc., of guests.\n\n   The breakfasts in 1886 consisted of porridge, milk, tea, or coffee, and the other two meals differed slightly with perhaps a small quantity of meat for dinner.\n\n   Father 45 - Brother 18 - Mother 35 - Sister 23\n\n18. That year did you serve your first Christmas dinner in eastern Canada?\n\n   Yes, in 1886. Give the menu, lists those present, and five things approximately ages at that time.\n\n   Helped to serve the first Christmas dinner in what is now Saskatchewan in 1886. The menu was little different from any other day.\n\n   The older members of the family were away from home working, so do not recall how many were there.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\n   Being one of the youngest of the family, do not remember ever being reduced to starvation level, but very often had to go after years, that the going much harder than very hard for the older ones. The hard years (1887) was so heavy that gardens or nothing else would grow. The only means of making a livelihood was by selling buffalo hides. These were piled up by the grain elevators. There were so plentiful, it was not necessary to travel a very great distance to sell a wagon load. The only complaint I heard was with a yoke of oxen.\n17. Give a typical day's menu (breakfast, dinner & supper) on the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, etc., in winter or summer.\n\nThe breakfasts in 1886 consisted of porridge, milk, tea for the older ones, some white bread, some molasses or syrup, and the other two meals differed slightly with perhaps a small quantity of meat for dinner.\n\nFather 45 Son(s) 20 Daughter 11 Age in 1886 Mother 45 Brother 14 Myself 8 Sister 23 Brother 14\n\n18. That year did you serve your first Christmas dinner in eastern Canada? If so, give the date, list those present and five things appreciated at the time.\n\nHelped to serve the first Christmas dinner as what is now called \"turkey\" in 1904. The menu was little different from any other day.\n\nThe older members of family were away from home homesteading, so do not recall how many were there.\n\n19. Have you ever resided to almost starvation level living on one or two locally produced foods?\n\nBeing one of the youngest of the family, do not remember ever being reduced to starvation level, but very often hung on after years, that the gang must have been very hard for the other ones. The land year (1889) was so very dry that gardens or nothing else raised grain. The only means of making a livelihood was by selling buffalo hides. These were piled up by the grain elevators. These were plentiful, it was not necessary to travel a very great distance to collect a wagon load; the only ordinance of travel was with a yoke of oxen.\nThere are many differences in the preparation of meals today compared with the earlier days. The earliest days used some simple and planning, then the housewife knew how to come by new and planning to make the food as far as possible. We always tried to eat the best we could, never all that was necessary in a bundle. Many kinds of canned meat, chicken and pork became, and many kinds of canned vegetables. They came in one and processed in glass cases.\n\n21. When did you begin to rely on preserved foods? (Olives or canned fruits?)\n\n22. Please add other details from your early experiences of butter production and other foods in your pioneer life. Include things not mentioned above, quality, number of participants, price if more than $1.00 needed.\n\nTrue things not mentioned earlier regarding butter. Shortly, was the abundance of milk. In the early years, milk was gathered from the cows and sheep near the Amish farm. The milk was then delivered to the Amish farm and churned. The Amish farm was also known as Nasholom, all of which were carefully gathered and preserved.\n\nSomething learned about buying provisions in my mind. Could not get much — fixed meal to chew. How Regina (25 miles away) when we always went there?\nThere are many differences in the preparation of meals today compared with the earlier days. The earliest days were hard times. There was no money and planning was essential. It was as far as possible. We always tried to save at all times.\n\nIn fact, there was little necessity in a large family of bread, sugar, butter, and many kinds of preserved meat.\n\nWhen did you begin to rely on preserved foods? When did you begin to purchase canned goods?\n\nHave you always had a garden? Have you always had fresh vegetables?\n\nIn October, there is a good supply of apples in all the stores. We have always had a good supply of canned meat, canned vegetables, and many kinds of canned vegetables. They are now more plentiful than ever before.\n\nPlease tell other details from your early experiences of buying groceries and other goods. Include any special stories or memories.\n\nTrue, things not mentioned earlier regarding food in the early years. Meats were usually purchased in the fall when they were gathered by families. The Indians would gather in the fall and store them in the winter. The Indians would also store meat in the fall.\n\nWe were very careful about buying provisions in our second summer. We could not get much bread, meat, or cheese. However, we always used (more) oranges (25 miles away) where we always used (more).\nThere are many differences in the preparation of meals today compared with the earlier days. The earliest days were more thought and planning, though I know others the food was to come from and planning to make it go as far as possible. We always took time to read the menus, knew all that was necessary in a tough day of bread, bought butter and many kinds of prepared foods instead of home made bread or root vegetables. (Give as many details as possible.)\n\nHave not yet begun to rely on purchased and prepared foods. Almost always have my own made bread. Have beef, pork, meat, poultry, etc., all the things that have always been there. Have our own canned meat as well as canned beans, and as many kinds of canned vegetables. They cannot be made processed in glass jars.\n\nPlease add other details from your early experiences of buying groceries and supplies. Foods in other ways during pioneer days in southern Canada.\n\nIreland was not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages, and other details. (Use back of paper if more space is needed.)\n\nSome things not mentioned earlier, regarding our food supply, was the abundance of wild fruit in the early years. Strawberries covered the fields in the northern prairies. Raspberries were gathered by rail from the South West near the Canadian border. In addition, there were black cherries and choke cherries were to be had most years as well as blackberries, all of them were carefully gathered and preserved.\n\nSomething learned about buying groceries in my second former days 1900-1951 when not to forget anything. Could not get much bread, meat at store often.\nThere are many differences in the preparation of meals today compared with the earlier days. The earliest day's meal was simple and planning was necessary to make sure there was enough food and planning to make it go as far as possible. We always tried to use what we had, new all that is necessary in a tough life.\n\n21. When did you begin to rely on purchased foods instead of home prepared foods? (Give as many details as possible.)\n\nI have not yet begun to rely on purchased foods. I have always prepared my own food. Have beef, pork, meat, fish, and vegetables. We also have canned goods such as canned meat, canned vegetables, canned fruits, and canned vegetables. They are stored in glass jars.\n\n22. Please list other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in eastern Canada.\n\nInclude items such as price, quality, methods of purchasing, and any other details.\n\nIf you could add any other details, please do so.\n\nSome things not mentioned earlier regarding our food. Murphy was the abundance of wild fruit in the early years. Strawberries could be picked in the wilderness. Great near was gathered by Paul from the South West near the Cassiar River. Similarly, blackberries were gathered into the Athabasca Valley were black currants, gooseberries, and cranberries were to be had most years as well as Saskatoon berries, all of which were gathered and preserved.\n\nSomething learned about buying provisions in my second summer days (1900-1931) when not too much money was available. We always went over to Regina (25 miles away) where we always went over.\nThere are many differences in the preparation of meals today compared with those of earlier days. The emphasis has shifted from planning and preparing meals to convenience foods. However, there are still times when planning and preparing meals is necessary.\n\nMany new methods have been developed over the years. For example, canned goods have become more common. However, canned goods should be used sparingly as they can be expensive.\n\nIn conclusion, while convenience foods have become more popular, it is important to remember that planning and preparing meals is still essential for a healthy diet.\nThere are many differences in the preparation of meals in the past compared with today. The earlier days included more thought and planning. Through the years, we have learned how to make do with what we have and planning has become less necessary. As we plan our meals, we always try to use what we have rather than go out and purchase. We also try to use a variety of foods.\n\nHere are some tips to help you plan and save money:\n\n1. Make a list of things you need to buy each week.\n2. Plan your meals around what you already have in the refrigerator or pantry.\n3. Use leftovers creatively.\n4. Buy in bulk when possible.\n5. Shop during sales.\n6. Use coupons and discounts.\n7. Prepare meals in advance.\n8. Use recipes that use ingredients you already have.\n9. Make sure you have all the ingredients before you start cooking.\n10. Don't forget to save money by buying in bulk.\n\nBy following these tips, you can save money and still enjoy delicious meals.\nbefore threshing—done with labor and durance—and\nif anything was missed in getting it was just too bad.\nYear after the years when you had to rely on\nyour own head working and raising many other things\nin the early pioneer days starting in 1886, we did\nnot have much, sometimes more necessities fail—\nwhat we got was our own and many things to be\nthankful for—one of the qualities of which was\nyour own old reliab.\nbefore threshing—done with labor and demoralized—and\nif anything was needed in getting it was just too bad.\nyear and the years' when you had to help one\nyou have heard whaling and many other things\nin the early pioneer days starting in 1886 we did\nnot have church, sometimes more recitals but—\nwhat our girl was our own and many things to be\nthankful for——one of the greatest of which was—\nthere was no relief.\nbefore threshing—drove with team and democrat—and\nif anything was missed or forgotten it was just too bad.\nThose were the years when you had to rely on\nyour own bread making and many, many other things.\nIn the early pioneer days starting in 1886, we did\nnot have much, sometimes mere necessities, but\nwhat we got was our own and many things to be\nthankful for——one of the greatest of which was——\nThere was no relief.\nbefore threshing—drove with team and democrat—and\nif anything was missed or forgotten it was just too bad.\nThose were the years when you had to rely on\nyour own bread making and many, many other things.\nIn the early pioneer days starting in 1886, we did\nnot have much, sometimes mere necessities, but—\nwhat we got was our own and many things to be\nthankful for ——one of the greatest of which was——\nThere was no relief.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1885_28.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 30, "total-input-tokens": 49800, "total-output-tokens": 7943, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 29, 4], [29, 1437, 5], [1437, 2631, 6], [2631, 4069, 7], [4069, 6652, 8], [6652, 7261, 9], [7261, 7954, 10], [7954, 9775, 11], [9775, 11278, 12], [11278, 12430, 13], [12430, 12900, 14], [12900, 13565, 15], [13565, 14374, 16], [14374, 15510, 17], [15510, 16022, 18], [16022, 17763, 19], [17763, 19333, 20], [19333, 20562, 21], [20562, 21888, 22], [21888, 23547, 23], [23547, 25178, 24], [25178, 25781, 25], [25781, 26733, 26], [26733, 27147, 27], [27147, 27558, 28], [27558, 27975, 29], [27975, 28393, 30]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]