[{"id": "2884601395271dbab4cdb8cae3e21bb3185fe093", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA WORD OF EXPLANATION TO THE PERSON ANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n__________________________\n\n[Stamp: RECEIVED April 14, 1952]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Herbert Pearson\n2. Your address: BIRSDAY, SASK.\n3. Date: April 14th, 1952\n4. Where were you born? (Give name of place and country): Dewsbury England\n5. What was your father's name and occupation? Richard Pearson\n   Carpet Weaver\n6. When did you come to Saskatchewan? (Give month and year): April 1904\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   No other places\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   30 years old\n9. What were your reasons for coming West?\n   To try and better my position. I worked in a factory. And the scenery looked good at that time.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    From a pal who came out here and who worked on the CRRR. Then bought a piece of land at Givin. He paid me 15 dollars a month with board.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey did not want me to come.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nCame all alone.\n\n13. What means of transportation did you use?\n\nBoat and Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n\nThere was only one real incident. And that was when I arrived in Regina. The old bridge at Saskatoon was washed out. But there was no train between Regina and Saskatoon. Lumber in the Qu'Appelle Valley was all under water. There was a lot of snow that melted, which caused floods.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Bessie Girvin.\n\n16. Where did you settle or take up land?\n\nAt what is called Binsay, 50 miles West of Girvin.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nStill here on the Homestead.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFactory in England. Worked Man on a farm after I got here.\n19. How often did you write to relatives or friends in your old home?\n   Nearly every week to Mother & Dad both dead now,\n   But still write regularly to my sisters.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Was Married this year 1904. Married in June of that\n    Year at Elbow, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place\n    to settle?\n    I did not recommend anybody to come\n    Has I knew they would like it. Some came\n    And they stayed and for a number of years\n    After I got here\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    None of them ever came, has I would not\n    Can for them to go through the same experience\n    Has I did\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    Oh Boy, one could write a book on those\n    Remembered. Living in a shack when a fruit full\n    Of water would freeze solid in a night. Sleeping on\n    Stuck mattress. Building cold barns. Would travel\n    20 miles for fuel in 36 below weather. Had to buy\n    Mortgage the homestead once it was proved. To buy\n    A team of horses and Lully Plow and Wagon. Tom\n    The money was gone. And had to help build Railway\n    Well John Watson gave. Had to get out Sheatsy. All kind\n    Of troubles\n\n24. Did you travel about much in the early years? (For business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    Went to Church once in a while Horse and\n    Buggy. Sometimes go to Concert about 9 Miles\n    away. This was on thing that was noticeable\n    That Everybody was the same. Social life in\n    those days was superior than it is today with\n    All the Car and Modern Machinery. Nobody\n    exists these days. The community almost as soon\n    Farm to scattered. The rural trend has been\n    somewhat neglected. No good and everybody moving into town\n25. When was the first car used in the community? About 1912, a Ford.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Did not own a car\n\n27. Where was your trading center? How far from your home?\n   About eight miles away at a farm\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   In a number of years until the Railway was built—added to Birsay\n\n29. How often did you shop in the early days?\n   Once a month. Small stores. And supplies we had on them days\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   Not until the Railway came through here. Now they go nearly every mail day. Has not been\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   That's hard to answer correctly. The articles mostly purchased through mail order were clothing, furniture, and other household articles. Groceries and other small articles were purchased through the store in the Town\n\n32. When did you first have a telephone and what company provided it?\n   I can't just remember what year. But it was a private company\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   This was no other option for me, but to hang on. Was I could not pay my way back. Has I only had 12 dollars to my name when I arrived here. Just compare what things there was in those days and the present time! Just Immigrants and do the best you can\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNot many to my knowledge.\n\n35. Did many people move away during the 1930's? Did they return?\n\nQuite a number moved out in the 30's and never came back again. 37. and 38. It was just like a desert—everybody in the Municipality for Relief. And what poor Relief in those days.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nAs I have myself been Reeve of the Municipality of Ostien 255 for 3 years and councillor three years previous to that—just retired at the end of the year 1951.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nI cannot answer this question just as I would like to. We have had a car & truck for a number of years now. We bought our combine three years ago. But had a car and truck previous to that—It used to be all hand—a threshing in the early days.\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nBitsay was named by the CNR. They may have given that information. Tullis Post Office was named after a settler there also the School. Most of the School Districts were named after settlers arrived but one in particular was named Gumbo Flats. Was the land around it was once Gumbo.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI don't think I could answer this.\n\nAnd the only way to find information would be to someone to interview some of the old timers and see if they gather around here.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? Yes.\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? Yes.\n\n(Indicate your preference, if any). Yes.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nHave one son & one daughter.\n\nThe boy is Reginald Pearson. Farming near North Battleford.\n\nThe girl Doris Pierce living in Timber Camp B.C. with her husband Clarence Prince. Two grandchildren Douglas 16 and Donald eight.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nDon't see a great deal of changes anymore.\n\nThat I have already mentioned. Telephone, better roads, an improvement from the old settlers' trails. Progress has been slow. But we must admit the standard of living has improved since the 30's.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nHave no idea whether or not you have sent out this questionnaire to other persons in this District. Have I have been away this winter.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJust myself.\n\nHerbert Pearson\n\nBison\n\nHope this will furnish you with some information from a real old timer in the District.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904M-R_788.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 3077, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 2036, 2], [2036, 3178, 3], [3178, 4350, 4], [4350, 6420, 5], [6420, 8244, 6], [8244, 10099, 7], [10099, 12004, 8], [12004, 12004, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]