[{"id": "317e1c286c33da6808bfa30c0cc1a5f26dde9d34", "text": "PIONEER LIST: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our province.\n\nName: Henry K. H. Smith\nAddress: 123 Main Street, Saskatoon, SK\nBirthplace: Austria, Hungary\n\n1. INSTRUCTION QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1903\nWhere did you set up housekeeping? Pleasant Forks\nWhere had you been living before that? With Fred Pollard\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 5 miles\nHow often could a visit be made to the store? Once or twice a week\nWhat groceries did you usually buy in those earliest years?\nSalt, Sugar, Tea, Coffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? American Mills\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? 7 cents\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes, how far away? 1 mile\nWhat was the price for a twenty pound bag of rolled oats? 25¢\nWhat other grain products did you use?\nCornmeal: Yes, Whole Wheat: Yes, Farina: Yes\nOther: Whole Wheat\nDid you grind your own wheat for porridge? Sometimes\nHow did you grind it? Coffee grinder\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Harry Kinsash\nAddress: Edmonton, New Westminster, BC\nBirthplace: Austria-Hungary (Galicia)\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1903\nWhere did you set up housekeeping? Pleasant Forks\nWhere had you been living before that? With Fred Pillhow\nFor how many people did you prepare meals? With him\nHow far was it to your nearest store? 2 Miles\nHow often could a visit be made to the store? Once or twice a week\nWhat groceries did you usually buy in those earliest years?\nSalt\nSugar\nTea\nCoffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Hardly milled\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour? Tended Wheat\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes. How far away? Melville. What year? 1902\nWhat was the price for a twenty pound bag of rolled oats? 75¢\nWhat other grain products did you use?\nCornmeal? Yes\nWhole Wheat? Yes\nFarina? Yes\nOther? Whole Wheat\nDid you grind your own wheat for porridge? Some Time\nHow did you grind it? Coffee Grinder\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to:\nSaskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Harry Kinash\nAddress: 114 Kinash, Harry\nCity: Edmonton\nProvince: Alberta\nCountry: Canada\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1903\nWhere did you set up housekeeping? Pleasant Forks\nWhere had you been living before that? With First Bullfrog\nFor how many people did you prepare meals? 6\nHow far was it to your nearest store? 2 miles\nHow often could a visit be made to the store? Once a week\nWhat groceries did you usually buy in those earliest years?\nSalt Sugar Tea Coffee\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nIn what quantities did you buy it? 50 lbs\nWhat was the usual price per hundred pounds of white flour? $1.50\nHow much did you use graham flour?\nWhole wheat flour?\nWas flour milled locally? Yes\nHow far away? 50 miles\nWhat was the price for a twenty pound bag of rolled oats? $0.50\nWhat other grain products did you use?\nCornmeal? Yes\nOther? Whole Wheat\nDid you grind your own wheat for porridge?\nHow did you grind it? Coffee grinder\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $2.50\n\nWhat brand of golden corn syrup did you use? Crown\n\nWhat size of tin of syrup did you usually buy? 25 lb.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cow\n\nButter? Home made\n\nEggs? Home\n\nWhat was the price of butter? No buying of eggs? No one bought\n\nDid you pack eggs for winter? Yes how? Store in cellar (sand)\n\nDid you make butter? Yes cheese? Yes\n\nWhat kind of cheese? Cottage\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Salt killing or sharing\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat? In winter not often in spring\n\nHow did you preserve meat? Yes in Brine\n\nWas there a \"beef ring\" in your neighborhood? No\n\nIf so what year was it organized? Farmers shared meat\n\nDid you use game? Yes What kinds? Ducks\n\nPrairie chicken, rabbit (mostly ducks)\n\nFor how long? All along even brought a.m. with\n\nWhat part did fish play in the family diet? Local catch\n\nWas the fish fresh, cured, or canned? Fresh\n\nKinds? Trout - 2 varieties we used\n\nFresh fish from lakes\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $2.00\n\nWhat brand of golden corn syrup did you use? Crown\n\nThat size of tin of syrup did you usually buy? 5 lbs.\n\nWas that price? Yes\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nCow\n\nHave Mama?\n\nThat was the price or butter? No\n\nDid you pack extra for winter? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese? Cottage\n\n5. MEAT AND FISH\n\nWhat was your main source in the early days?\n\nSalt Killing & Smoking\n\nHow did you get fresh meat? In Winter—how often?\n\nYes\n\nHow did you preserve meat? Yes\n\nWas there a \"beef ring\" in your neighborhood? No\n\nIf so what year was it organized? 1918\n\nDid you use game? Yes\n\nPoultry\n\nFor how long? All along—even brown and old\n\nWhat part did fish play in the family diet?\n\nFresh Catch\n\nWas the fish fresh, cured, or canned?\n\nKind?\n6. Beverages:\n   - What kind of tea did you buy? (Tea, coffee, etc.)\n   - How much did you pay?\n   - What other beverages did you buy?\n\n7. Vegetables and Fruits:\n   - What was the price of potatoes per bushel?\n   - Did you grow your own potatoes at home?\n   - If not, where from?\n   - What year did you first grow your own supply for the table?\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes? (In bulk or by the box)?\n   - What did you pay?\n   - What was the price of prunes?\n   - What other dried fruits did you use in the earliest days? (Apples, pears, apricots, peaches, loganberries, raisins, currants, or others?)\n\n8. Preserving:\n   - In the early years did you preserve any foods by freezing?\n   - Yes\n   - Other foods? Yes\n   - That year did you first preserve fruit by canning?\n   - That year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make your own vinegar? Yes\n   - Did you make your own salt? Yes\n\n9. Other:\n   - How much did you pay?\n   - What other purchases did you make?\n6. **BEVERAGES**\n   - What kind of tea did you buy? (Loose or ground)?\n   - What kind of coffee did you buy? (Instant or ground)?\n   - What other beverages were used?\n\n7. **VEGETABLES AND FRUITS**\n   - What was the price of potatoes per bushel when you started farming?\n   - If any, where from?\n   - That year did you grow your own supply for the table?\n   - Potatoes: 1902, 1903, 1904\n   - Turnips: 1902, 1903, 1904\n   - Cabbage: 1902, 1903, 1904\n   - Onions: 1902, 1903, 1904\n   - In what quantities did you buy white navy beans?\n   - How did you buy peanuts, (in bulk or by the bushel)?\n   - How did you buy hams, (in bulk or by the pound)?\n   - What was the price of peanuts?\n   - What was the price of hams?\n   - What other dried fruits did you use in the earliest days? (apricots, pears, apples, peaches, raisins, currants, or others)?\n\n8. **PRESERVATION**\n   - In the early years did you preserve any foods by freezing?\n   - Yes, corn, yes, beans, yes, tomatoes?\n   - Other foods?\n   - That year did you first preserve fruit by canning?\n   - That year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make your own vinegar? Yes, salt, soda.\n\n---\n\n**Note:** The handwriting is quite faded and difficult to read, but these questions appear to be part of a larger survey about farming practices and food preservation methods.\nmade only dry dough on floor with milk\n\nBulk (50c) 30 lbs\n\nQuaker salt\nLilly white syrup\nToilet soap\nBaking powder\nBaking soda\nDried peas\nDried corn\nVinegar\nRaisins - seedless\nRice\nCurrants\nStore jen - khris?\nChoose (Cheddar or store cheese)\nVanilla\n\n10. BAKING\nWhat type of yeast did you use? ________\nDid you make yeast for your own use? ________\nUsing hops? ________ Salt rising? ________\nDid you buy baking powder? ________ Did you take your own baking powder? ________\n\nYes No\nmade my dry dough on piebust\n\n10. What type of yeast did you use? \n   Did you make yeast for your own use? \n   Using starter? \n   Salt rising? \n   Baking soda? \n   Did you buy baking powder? \n   Ground or tartar? \n\nNo.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nIf so far was this water from your home? (pull, barrel, tank)\n\nHere was it brought to the home? (pull, barrel, tank)\n\nFor adding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\n---\n\n**List of Items**\n\n| Item          | Approximate Price at the Time |\n|---------------|-------------------------------|\n| General salmon | $0.50                         |\n| Canned sardines | $0.30                        |\n| Other canned fish that didn't come canned | $0.40            |\n| Apples - fresh | $0.50                         |\n| Apples - fried | $0.50                         |\n| Lettuce       | $0.50                         |\n| Tomatoes - fresh | $0.50                      |\n| Bananas       | $0.50                         |\n| Lemons        | $0.50                         |\n| Cornflakes    | $0.50                         |\n| Other prepared breads for dinner | $0.50         |\n| Pearl tapioca | $0.50                         |\n| White tapioca | $0.50                         |\n| Sago          | $0.50                         |\n| Dried beans   | $0.50                         |\n| Icing sugar   | $0.50                         |\n\n---\n\n**Notes**\n\n- **Note:** No. 11 is different from the other ones used at the time.\n- **Note:** No. 11 is different from the other ones used at the time.\n- **Note:** No. 11 is different from the other ones used at the time.\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nIf so, was this water from your home? Yes\n\nHere was I brought to the house (well, barrel, tank) Yes\n\nBag and/or water supply, mention any others which have taken place since you first started homesteading, giving dates where possible.\n\n---\n\n**Note:** The handwriting appears to be quite faded and difficult to read. It seems to contain a list or inventory of items, possibly related to food supplies or water sources. The handwriting includes terms like \"fresh,\" \"dried,\" \"before WWI,\" and \"for survival.\"\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye? What kind of laundry soap did the grocer supply?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Where did you get your fuel? Mention any changes in the use of fuels which have taken place since you first started housekeeping.\n\n15. UTENSILS\n\nFor cookstove, did you use an indoor fireplace or outdoor hearth in the earliest days? (Give dates) Did you use an outdoor chimney or bake oven? (Give dates)\n\nBy whom was your first cook stove made? That year was it purchased? That type of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (Glass, earthenware, wood, metal, other)\n\nWhen did you start using aluminum?\n13. **SPACE**\n   \n   Did you buy laundry soap or extra powder?  \n   If you did, what kind?  \n   Did you use any other kind of laundry soap?  \n   If so, what kind?\n\n14. **FUEL**\n   \n   What fuel did you use in the earliest days?  \n   Did you use any other kind of fuel?  \n   Mention any changes in the use of fuels. How have they changed since you first started householding?  \n   How wood to cool the water?  \n   Other good wood for fire?  \n\n15. **METHODS OF COOKING AND TYPES OF UTENSILS**\n   \n   For cooking, did you use an indoor fireplace or outdoor stove?  \n   Did you use an outdoor fireplace or bake oven?  \n   By whom was your first cook stove made?  \n   That year was it purchased?  \n   What types of utensils did you use? (iron, copper, tin, homemade)  \n   For preparing food? (glass, earthenware, wooden bowls, other)  \n   Than did you first use gas?  \n   Alternate?\n20. Mention any outstanding differences in the preparation of meals in the \nearliest days as compared with today.\n\nNo canned goods in early days.\n\n21. Then did you begin to rely on purchased foods and prepared foods instead \nof homemade and home preserved foods? (Give as many details and dates \nas possible).\n\nAfter first war\n\n22. Please add other details from your early experiences of buying groceries \nand securing foods in other ways during pioneer days in the barn Canada. \nInclude here not mentioned above, quality, methods of merchandising, \nprices, problems of storage, shortages and other details. Use back of \npaper if more space is needed.\n\nQuality for better\nDry foods common\nProf. Breckinridge\n20. Mention any qualitative differences in the preparation of meals in the earliest days as compared with today.\n\nNo canned goods or early days.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of home-prepared foods? (Give as many details as possible).\n\nAfter first war\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other parts during pioneer days in the barns.\n\nThe food I buy not mentioned above, quality, methods of merchandising, prices, products purchased, other uses and other details. Use back of sheet if needed.\n\nQuality, price, etc.\n\nBuy fresh, eat more.\n\nRon Breckner\n20. Mention any outstanding differences in the preparation of meals in the past week.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homemade and home-prepared foods? (Give as many details and dates as possible.)\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during the war in Ontario Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other difficulties. Use back of page if more space is needed.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home preserved foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any questionable differences in the preparation of meals in the excellent days as compared with today.\n\n21. Have you begun to rely on processed foods and prepared foods instead of home-prepared foods? (Give us many details and ideas, if possible.)\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in other ways than those listed above, quality, methods of preparation, etc. Include types not mentioned above, such as chili, stews, soups, etc., and other details. Use back of paper if space runs out.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home-prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nSaskatchewan Archives Office\n\nUniversity of Sask.\n\nSaskatoon\n\n5054\nSaskatchewan Archives Office\n\nUniversity of Sask.\n\nSASKATOON\n\nSASK\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12936_1903_114.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 5185, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1401, 5], [1401, 1401, 6], [1401, 2832, 7], [2832, 4171, 8], [4171, 5357, 9], [5357, 6287, 10], [6287, 7455, 11], [7455, 8926, 12], [8926, 9408, 13], [9408, 9627, 14], [9627, 11157, 15], [11157, 11766, 16], [11766, 12497, 17], [12497, 13375, 18], [13375, 14083, 19], [14083, 14746, 20], [14746, 15310, 21], [15310, 15908, 22], [15908, 16469, 23], [16469, 17066, 24], [17066, 17133, 25], [17133, 17200, 26], [17200, 17200, 27], [17200, 17200, 28]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true]}}]