[{"id": "419134e690886a89ab3dc4d59e73770ff55a6645", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 8\n\nPIONEER Health\n\n(Drawing by McGregor Hone).\n\nPlease print name and address in capital letters.\n\nYour full name: Thomas William Bennett\nPresent address: Willow Ranch\nYear of arrival in Saskatchewan: 1909\nAge at that time: 24 years\nPioneer Address: Willow Ranch\n\nAt what other places did you live in Saskatchewan prior to 1914? None\n(\"Saskatchewan\" means the area which is now Saskatchewan).\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, although information for later years may be included.\n\nIf you cannot answer a question, skip it. We realize that any one person will not be able to answer all questions.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire is greatly appreciated. All questionnaires are preserved in the Saskatchewan Archives.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER HEALTH\n\n(Drawing by McDougall Horn)\n\nPlease print name and addresses in capital letters.\n\nYour full name: Thomas William Bennett\nPresent address: Willow Bunch\nYear of arrival in Saskatchewan: 1909\nAge at that time: 26 years old\nPioneer Address: Willow Bunch\n\nAt what other places did you live in Saskatchewan prior to 1914? (Saskatchewan means the area which is now Saskatchewan).\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, although information for later years may be included.\n\nIf you cannot answer a question skip it. We realize that any one person will not be able to answer all questions.\n\nThe extra sheets of paper if there is not enough space on the questionnaire.\n\nYour cooperation in answering this questionnaire is greatly appreciated. All questionnaires are preserved in the Saskatchewan Archives.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nIn regard to #3 my opinion of pioneer doctors, both Dr. Bird and Dr. Porter were very competent. Dr. Godin was soon said to be extremely callow and incompetent so much so an investigation was made and a strong petition, backed by actual experiences, was sent to the Government to remove him but it failed to accomplish anything. I never used them or his two predecessors.\n\nAfter Dr. Lavallee died the municipality took over and we have Municipal Doctor since then. Some good one or two indifferent but since the railroad came in they have always been another doctor in neighboring villages. I cannot think of trouble we have no doctor here in Wellm Bank for the last three weeks, at the nearest village Coronach.\n\n5. Was the doctor consulted at his office or called to your house? (Explain the circumstances)\n\nGenerally called to house\n\n6. What conditions were usually treated without reference to a doctor, and which were of a nature that led to consultation?\n\n7. Do you recall how much you paid for treatment each year?\n\nDid costs ever deter you from consulting a doctor?\n\nNo\n\nWere farm products or other services exchanged for treatment received? Give examples.\n\nNo\nI regard a #3 mg of serum I former doctor\nhad on Board and #2 Povt. and was confirmed\nto be #3 mg. I was never seen & L. attorney\nwas called and completed no mail as an invalid\nwas made and a story public. I held a actual\nengagement was paid in Queensland to remove him\nand I failed to accept any thing. All 9 men\nused him or his services.\n\nAfter Dr. Lawrence died the municipality tax\nof $100 and we took Municipal Doctor since then\nand found one in town. I did know he\nwould come in. He had to always been\ndoctor in neighboring villages. Until the District\nhe also as doctor was in Wauka Band for 10 years\n\nNew words, or he usual valley. Remember\n\nDid costs ever deter you from consulting a doctor?\nNo\n\nWere farm products or other services exchanged for treatment received?\nGive examples. No\nIn regard to Mr. H. & my friend, Dr. Bird and Dr. Conner, who are very competent to go further in this case and to continue the investigation. No need for an immediate call and immediate action was made and a strong petition should be addressed to Governor to remove him. It behooves us all to accept any offer. Let me know what he is doing.\n\nDr. Lawrence died in a hospital in New York City and was buried Municipal Cemetery. He died there. His death came on his way home from a dinner in neighboring villages until his death was less than two weeks, or no news without personal.\nIn regard to #3 my opinion of pioneer doctors. Both Dr. Bird and Dr. Penton were very competent but Dr. Godin was soon said to be extremely callous and incompetent so much so an investigation was made and a strong petition backed by actual experience was sent to the Government to remove him but it failed to accomplish anything. I never used him at his hospital.\n\nAfter Dr. Lavellee died the municipality took over and we have Municipal Doctors since then some good one or two or different but since the railroad came in they have always been another doctor in neighboring villages. (Until this Dr. Smith we have no doctor here in Wellin Bend for the last three weeks, or the nearest village Cornwall.)\n\n5. Was the doctor consulted at his office or called to your house? (Describe the circumstances).\n\n[Signature]\nI. Services of a Doctor\n\n1. How far were you from the nearest doctor at first? About 8 miles.\n\n2. Was there one closer as time went by? (Explain the circumstances)\n\n3. What was your opinion of the competence of the pioneer doctor in your district? (a good physician? a good surgeon? Explain why.)\n   - Good doctor. English trained. American graduate.\n   - In 1907-16 English doctor P.E. Bird. American Dr. Plinton.\n   - In 1912 O.J. Gordon came & William Rand & Co. were also physicians.\n\n4. Was it customary to go to the same (or family) doctor in all situations, or did it depend on the nature of the illness?\n   - The same.\n\n5. Was the doctor consulted at his office or called to your home? (Explain the circumstances).\n   - Generally called to home.\n\n6. What conditions were usually treated without reference to a doctor, and which were of a nature that led to consultation?\n   - Sprains.\n\n7. Do you recall how much you paid for doctors' calls or services?\n   - Preserved on last page.\n\nWhat did this amount to annually for yourself? for your family?\n\n(If you have preserved accounts for medical services, would you supply a record of payments for specific illnesses, operations, etc.?).\n\nDid costs ever deter you from consulting a doctor?\n   - No.\n\nWere farm products or other services exchanged for treatment received? Give examples.\n   - No.\nServices of a Doctor\n\n1. How far were you from the nearest doctor at first?\n2. Was there ever closer at time went by? (Explain the circumstances)\n3. What was your opinion of the competence of the pioneer doctor in your district? (A good physician? A good surgeon? Explain why.)\n4. Was it customary to go to the same (or family) doctor in all situations, or did it depend on the nature of the illness?\n\n5. Was the doctor consulted at his office or called to your home? (Explain in the circumstances)\n\n6. What conditions were usually treated without reference to a doctor, and which were of a nature that led to consultation?\n\n7. Do you recall how much you paid for doctors' calls or services? What did this amount to annually for yourself? (If you have preserved accounts for medical services, would you supply a record of payments for specific illnesses, operations, etc.? Did costs ever deter you from consulting a doctor?)\n\n8. Were farm products or other services exchanged for treatment received? Give examples.\nII. Hospital Services\n\n8. Where was your nearest hospital? Willow Bay. How far away was this? 8th.\nWho organized it and how was it supported?\nDr. Godin\n\nHow many beds did it have? How large was its staff?\n\nDid you feel that patients received good care in it?\n\n9. For what illnesses did members of your family enter hospital?\nNever until 1936.\n\n10. Do you recall how much was charged for hospitalization on these occasions?\n$25.00\n\n11. For what illnesses were members of your family confined to bed at home?\nCold\n\n12. Did other members of the family look after the sick person?\nGenerally\n\nWas there a registered nurse or other person in the district who assisted on these occasions?\nTwo extremely competent midwives.\n\n13. In the case of contagious diseases, were sick members isolated from the rest of the family? How was this carried out?\nNo experience with contagious disease.\n\n14. Were children born at home or did the mother go to hospital?\nGenerally at home\n\nIf the mother remained at home, was there a doctor, midwife, nurse, or another woman who assisted and which was preferred?\nAround here both a doctor and midwife. Doctor.\nII. Hospital Services\n\n6. Where was your nearest hospital? Willow Bay. How far away was this? 8¼ miles.\n\nWho organized it and how was its support?\n\nHow many beds did it have? How large was the staff?\n\nDid you feel that patients received good care in it?\n\n9. For what illnesses did members of your family enter hospital?\n\n10. Do you recall how much was charged for hospitalization on these occasions?\n\n11. For what illnesses were members of your family confined to bed at home?\n\n12. Did other members of the family look after the sick person?\n\nWas there a registered nurse or other person in the district who assisted on these occasions?\n\n13. In the case of contagious diseases, were sick members isolated from the rest of the family?\n\n14. Were children born at home or did the mother go to hospital?\n\nIf the mother remained at home, was there a doctor, midwife, nurse, or another woman who assisted and which was preferred?\nIII. Home Remedies.\n\n15. What home remedies did you use for various illnesses? (Specify illnesses and the treatment given).\n   We had our own outlet for birds etc.\n\n16. How did you learn of these remedies? (Specify the remedy and state if it was handed down in the family, recommended by a neighbour, etc.) Were any remedies acquired from the Indians or from people of a particular national background? (Use back of page or extra sheets if necessary).\n   The outlet recipe was handed down in the family for many years, but the main ingredient is no longer available. It was a mixture of herbs and spices.\n\n17. What patent medicines were customarily used in your family and for what conditions?\n   Bucan pills\n   Baby's own tablets\n\n18. What serious accidents (burns, sprains, fractures, etc.) were experienced by members of your family and what treatment was given?\n   I have been exceptionally fortunate except for confinement. I had a broken ankle in 1944 and then again two years ago in 1956 when my wife had a broken leg - treated by hospital. She was confined to bed for several weeks.\n\n19. What was done about securing such aids for the handicapped as crutches, wheel chairs, etc.?\n\n20. Do you recall home remedies being used in circumstances other than for specific illnesses (e.g., spring tonics?). Elaborate.\n3.\n\nName: Bennett\n\n15a. What home remedies did you use for various illnesses? (Specify illnesses and the treatments given.)\n\n16. How did you learn of these remedies? (Specify the remedy and state if it was handed down in the family, recommended by a neighbour, etc.) Were any remedies suggested by a doctor? (Use back of page or extra sheets if necessary.)\n\n17. What patent medicines were customarily used in your family and for what conditions?\n\n18. What serious accidents (burns, sprains, fractures, etc.) were experienced by members of your family and what treatment was given?\n\n19. What was done about securing such aids for the handicapped as crutches, wheel chair, etc.?\n\n20. Do you recall home remedies being used in circumstances other than for specific illnesses (e.g., spring tonic)? If so, describe.\n21. Did you have a \"doctor book\"? No To what extent was it used to diagnose illnesses?\n\nConsulted for remedies?\n\nIV. Public Health Problems\n\n22. Were members of your family vaccinated or inoculated against contagious diseases? (State diseases and dates).\n\nSmall Pox\nTyphus\n\nWas this done by the family doctor at his suggestion or at the family's request, or was there a definite campaign carried on in the district with arrangements made for immunization of the children and/or adults at one time?\n\n23. Do you recall epidemics in your district in which quarantine was enforced? Upon whose orders was this carried out? (Give details of the epidemic)\n\n24. Was there ever an outbreak of typhoid fever in your community? (Describe). What was considered to be the source of infection and what steps were taken to remedy the situation?\n\nTo\n\n25. Was it ever found necessary to close your local school because of an epidemic? (Specify the occasion).\n\nNo\nIV. Public Health Problems\n\n21. Did you have a \"doctor book\"? To what extent was it used?\n\nConsulted for remedies?\n\n22. Were members of your family vaccinated or inoculated against contagious diseases? (Specify diseases and dates).\n\nHas this been done by the family doctor at his suggestion or at the family's request, or was there a definite campaign carried on in the district with arrangements made for immunization of the children and/or adults at one time?\n\n23. Do you recall epidemics in your district in which quarantine was enforced? (Give details of the epidemic)\n\n24. Was there ever an outbreak of typhoid fever in your community? (Describe), what was considered to be the source of infection and what steps were taken to remedy the situation?\n\n25. Was it ever found necessary to close your local school because of an epidemic? (Specify the occasion).\n26. Have there been cases when children with mild contagious diseases such as measles, chicken pox, etc., continued at school because of their proximity to the disease?\n\n27. Do you recall any infectious eye diseases in the district (pink eye, trachoma)?\n   Among what groups did these occur? What treatment was given and what steps were taken to prevent their spread?\n\n28. Were there any cases of tuberculosis in your district, or was it ever contracted by a member of your family?\n   What treatment was undertaken and was this prescribed by a doctor?\n\nWas the patient sent to hospital?\nDo you recall steps being taken in your community in keeping with the movement for sanitation in the province (i.e., informal discussions, public meetings, petitions, visiting speakers)?\n\n7. Dental Services\n29. How far was it to the nearest dentist? [2½ miles]\n30. How often did you see him? [once a month]\n31. What dental conditions led to your seeing him (fillings, extractions)?\n32. Was it customary to have fillings?\n33. Were there instances when simple extractions were carried out at home?\n   by whom?\n34. What was charged for the various dental services?\n   & for extracting each tooth.\n\nDid costs deter you from visiting a dentist?\n   No\n\nVI.\n\n35. What personal (or non-communicable) diseases seemed to be most frequent in your district in the pioneer period?\n\nWhat communicable diseases?\n\nWhat accidents? Kicked by horse or run over in a run a way.\n\n36. In connection with any of these diseases do you recall a feeling of helplessness on your part and of others in face of the lack of facilities for treatment? No always good medical help available.\n\nWhat did you think should be done about the situation?\n\n37. What steps were taken in your community towards an improvement of the situation - public meetings, enforcing quarantine, immunization, municipal doctor, union hospital? (Give details).\n\n38. Add any personal experiences, recollections or observations related to this topic which have not been touched in the questionnaire. (Use back of page or extra sheets if necessary).\n\nMedical care around my own district was taken care of by Dr. P.S. Burt M.R.C.S. He came to Canada to work from New England between Canada and England so he could not be called for his services so he attended whenever called and was very kind. When someone was sent to do his work while he attended my family and I attended him back continuously. Dr. Lavallee was a really competent doctor came here in about 1917 and when Dr. Bird left (overseas) I used this doctor for a number of years. His name was Dr. Lavallee.\n34. What was charged for the various dental services?\n   - For extraction and tooth\n   - Did costs deter you from visiting a dentist?\n\nVI.\n\n35. What personal (or non-communicable) diseases seemed to be most frequent in your district in the pioneer period?\n\nWhat communicable diseases?\n\nWhat accidents?\n\n36. In connection with any of these diseases do you recall a feeling of helplessness on your part and of others in face of the lack of facilities for treatment? No\n\nWhat did you think should be done about the situation?\n\n37. What steps were taken in your community towards an improvement of the situation—public meetings, enforcing quarantine, immunization, municipal doctor, union hospital? (Give details.)\n\n38. Add any personal experiences, recollections or observations related to this topic which have not been touched in the questionnaire. (See back of page or extra sheets if necessary.)\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13001_3468.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 4622, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1047, 5], [1047, 2045, 6], [2045, 3214, 7], [3214, 4008, 8], [4008, 4589, 9], [4589, 5404, 10], [5404, 6753, 11], [6753, 7768, 12], [7768, 8901, 13], [8901, 9825, 14], [9825, 11143, 15], [11143, 11954, 16], [11954, 12900, 17], [12900, 13762, 18], [13762, 14857, 19], [14857, 14857, 20], [14857, 16357, 21], [16357, 17254, 22], [17254, 17410, 23], [17410, 17561, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]