[{"id": "26a6ca8d9a9bf64ebfa258f5cabe248648d2f7a1", "text": "What did early Canadian farmers eat?\n\nInstructions: Fill in as much of this questionnaire as you can and mail it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Sask.\n\nName: Robert Lindlaw\nAddress: [illegible]\nBirthplace: Rosslyn, Scotland\n\n1. HOUSEHOLD HISTORY\n   What year did you start housekeeping in Eastern Canada? 1892\n   Where did you set up housekeeping? 6 mi. S.W. of Estevan\n   Where had you been living before that? Heathland\n   For how many people did you prepare meals? 5\n   How far was it to your nearest store? 6 mi.\n   How often could a visit be made to the store? once a week\n   What groceries did you usually buy in those earliest years? flour, homestead corn meal, sugar, tea, dried apples, pine nuts, condensed milk, salt\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   What brand of white flour did you use in the early years? Local Mill flour\n   In what quantities did you buy it? 4 lb. 10 lb.\n   What was the usual price per hundred pounds of white flour? 150 cents\n   How much did you use graham flour? 20\n   Whole wheat flour? 20\n   Was flour milled locally? Yes\n   How far away? 40 mi. that year?\n   What was the price for a twenty pound bag of rolled oats? 75 cents\n   What other grain products did you use? [illegible]\n   Cornmeal? [illegible]\n   Whole wheat? [illegible]\n   Other? [illegible]\n   Did you grind your own oatmeal for porridge? Yes\n   How did you grind it? [illegible]\n1. **FOOD PURCHASES**\n\n   - What year did you start consuming meat in eastern Canada?\n     - 1984\n   - Where did you buy it from?\n     - Butte, Montana\n   - How many people did you consume meat?\n     - 6 mi.\n   - How often do you visit the store?\n     - Once a week\n\n2. **FLOUR AND GRAIN CONSUMPTION**\n\n   - Name brand of wheat flour used in your household:\n     - Hard White\n   - In what quantities did you buy it?\n     - 5 lbs. (2.27 kg)\n   - What was the usual price per hundred pounds of wheat flour?\n     - $2.00\n   - How much did you use each flour?\n     - 1/2\n   - Was flour milled locally?\n     - Yes\n   - Do you buy other grain products like rice?\n     - Yes\n   - Other comments:\n     - None\n\n3. **OTHER FOOD PURCHASES**\n\n   - Name brand of corn meal used:\n     - None\n   - Name brand of tea used:\n     - None\n   - Name brand of powdered milk:\n     - None\n\n4. **OTHER COMMENTS**\n\n   - Any other comments:\n     - None\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? ... 20 lb. for $1.00\nWhat was the price for a ten pound sack of white sugar? ... $6.80\nWhat brand of golden corn syrup did you use? ... Monthly Volunteer canning coop\nWhat size of tin of syrup did you usually buy? ... \nAt what price? \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? ... From cows\nBefore that condensed milk\nButter? ... \nEggs? ... \nWhat was the price of butter? ... 15¢\nDid you pack eggs for winter? ... \nDid you make butter? ... \nCheese? ... \nWhat kind of cheese? ...\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? ... Hand to kill a beef in fall\nHow did you get fresh meat? ... \nHow often did you get fresh meat? ... Once a week\nHow did you preserve meat? ... Pickled some\nWas there a \"beef ring\" in your neighborhood? ... \nIf so what year was it organized? ... \nDid you use game? ... Yes\nWhat kinds? ... Ducks, from chickens, rabbits, hares\nFor how long? ... \nWhat part did fish play in the family diet? ... Very little, more so\nWas the fish fresh, cured, or canned? ... There was very little canned\nKinds? ... Fish in early days, canned salmon came in the early twenties\n3. In what quantity did you buy milk? [Handwritten: 20 lbs.]\n\n4. Did you get a supply of fresh milk in the early days?\n\n5. What was your meat supply in the early days? [Handwritten: Beef rings]\n\n6. How often did you get fresh meat? [Handwritten: Weekly]\n\n7. Was there a \"beef ring\" in your neighborhood? [Handwritten: Yes]\n\n8. If so, what year was it organized? [Handwritten: 1912]\n\n9. Did you use flour? [Handwritten: Yes]\n\n10. For how long? [Handwritten: 1912-1914]\n6. BEVERAGES\n\nWhat kind of tea did you buy?  Black Tea  At what price?  $1.40 lb\n\nWhat kind of coffee did you buy? (beans or ground)  Ground coffee\n\nPrice?  $1.50 lb\n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?  $0.50 lb\n\nCould you get potatoes at the store?  Yes\n\nIf not, where from?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes  1894  Cabbage  Carrots  Onions\n\nTurnips  Beets\n\nIn what quantities did you buy white navy beans?  25 lb\n\nHow did you buy prunes, (in bulk or by the box)?  Bulk & Box\n\nWhat weight?  20 lb\n\nHow did the grocer handle prunes (by box)?  Bulk & Box\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apalaces, cherries, apricots, peaches, loganberries, raisins, currents or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?  Yes\n\npeas?  Beans?  Beans?  Saskatoons?\n\nother foods?\n\nThat year did you first preserve fruit by canning?  1894\n\nThat year did you first preserve vegetables by canning?  1895\n\nThat year did you first preserve meat by canning?  1896\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?  All kinds of fruits & meat\n\nDid you make your own vinegar?  Yes\n6. BEVERAGES\n\nAt what prices did you buy?\n\nWhat kind of tea did you buy?\n\nWhat kind of coffee did you buy?\n\nPrice per pound:\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per pound?\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes:\n\nTurnips:\n\nCarrots:\n\nOnions:\n\nHow did you buy prunes? (In bulk or by the box?)\n\nHow did the grocer handle prunes? (Or boxed prunes)\n\nThat was the tree of prunes?\n\nOther dried fruit did you use in the earliest days? (Apples, apricots, plums, raisins, currants, or others?)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by:\n\nThat year did you first preserve fruit by canning?\n\nThat year did you first preserve vegetables by canning?\n\nThat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Are you usually bought at one time? | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits         | 1884                                          | 3lb.                                              | 3lb.                                | 25¢                  |\n| Macaroni              |                                               |                                                   |                                     |                      |\n| Graham flour          |                                               |                                                   |                                     |                      |\n| Brown sugar           |                                               | Bulk                                              |                                     |                      |\n| Molasses              |                                               | 10 gal. Kgs                                        |                                     |                      |\n| Table salt            |                                               |                                                   |                                     |                      |\n| Common salt           |                                               |                                                   |                                     |                      |\n| Honey-white syrup     |                                               |                                                   |                                     |                      |\n| Toilet soap           |                                               |                                                   |                                     |                      |\n| Baking powder         |                                               |                                                   |                                     |                      |\n| Baking soda           |                                               |                                                   |                                     |                      |\n| Dried peas            |                                               |                                                   |                                     |                      |\n| Dried corn            |                                               |                                                   |                                     |                      |\n| Vinegar               |                                               |                                                   |                                     |                      |\n| Raisins - seeded      |                                               |                                                   |                                     |                      |\n|                       |                                               |                                                   |                                     |                      |\n|                       |                                               |                                                   |                                     |                      |\n| Rice                  |                                               |                                                   |                                     |                      |\n| Currants              |                                               |                                                   |                                     |                      |\n| Store jam - kinds?    |                                               |                                                   |                                     |                      |\n| Cheese (Cheddar or store cheese) | NO |                                                   |                                     |                      |\n| Vanilla               |                                               |                                                   |                                     |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? **Home made yeast**\n\nDid you make yeast for your own use? **Yes** Using starter?\n\nUsing hops? **No** Salt rising? **No**\n\nDid you buy baking powder? **Yes** Baking soda? **No**\n\nCream of tartar? **Yes** Did you make your own baking powder? **No**\n| Food Item          | Quantity | Price |\n|-------------------|----------|-------|\n| Soda bicarbonate  | 1/8 lb   | $2.50 |\n| Macaroni          |          |       |\n| Graham flour      |          |       |\n| Brown sugar       |          |       |\n| Rollbuns          |          |       |\n| Fresh salt        |          |       |\n| Coarse salt       |          |       |\n| Baby carrots group|          |       |\n| Roast corn        |          |       |\n| Butter powder     |          |       |\n| Dried peas        |          |       |\n| Spiced corn       |          |       |\n| Vinegar           |          |       |\n| Raisins - muscatel|          |       |\n| Rice              |          |       |\n| Currents          |          |       |\n| Store jar - water |          |       |\n\nChoose (yes) or (no) (recipe source)\n\n10. Baking\n\nWhat type of yeast did you use? (yeast source)\n\nDid you make yeast for your own use? (yes)\n\nUsing hops? (yes)\n\nSalt rising? (yes)\n\nDid you buy baking powder? (yes)\n\nOr was it tartar? (yes)\n\nDid you make your own baking powder?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                              |                                                |\n| Canned sardines             |                                        |                              |                                                |\n| Other canned fish that appeared early - give names |                      |                              |                                                |\n| Apples - fresh              |                                        |                              |                                                |\n|                             | dried                                  |                              |                                                |\n| Lettuce                     |                                        |                              |                                                |\n| Tomatoes - fresh            |                                        |                              |                                                |\n|                             | canned                                 |                              |                                                |\n| Bananas                     |                                        |                              |                                                |\n| Lemons                      |                                        |                              |                                                |\n| Oranges                     |                                        |                              |                                                |\n| Cornflakes                  |                                        |                              |                                                |\n| Other prepared breakfast cereals - give names |                      |                              |                                                |\n| Pearl tapioca               |                                        |                              |                                                |\n| Minuto tapioca              |                                        |                              |                                                |\n| Sago                        |                                        |                              |                                                |\n| Dates                       |                                        |                              |                                                |\n| Nuts                        |                                        |                              |                                                |\n| Icing sugar                 |                                        |                              |                                                |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) ...water well... some lake by Maugh...\n\nHow far was this water from your home? ...4 mile...\n\nHow was it brought to the home? (pail, barrel, tank) ...Pail & Barrel...\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n12. Where did you get water for drinking and for cooking? (Tell river, stream, well)\n\n13. If so far was this water from your house? How was it brought to the house? (Tell how, by what means)\n\n14. Has any water supply been installed in your home since you first started homesteading? (Tell dates where possible)\n13. SOAP\n\nDid you buy laundry soap or make your own? ...Moldy water...\n\nIf you made your own, did you use lye? ...wood ashes...\n\nWhat kind of laundry soap did the grocer handle? ...Royal Laundry Detergent...\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? ...Wood stoves...\n\nWhere did you get your fuel? ...Coal...chips...\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ...Moldy water...\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ...Moldy water...\n\nBy whom was your first cook stove made? ...Moldy water...\n\nWhat year was it purchased? ...1882... Price? ...$20...\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead) ...Moldy water...\n\nFor preparing food? (china, earthenware, wooden bowls, other) ...Moldy water...\n\nWhen did you first see enamel ware? ...1894...\n\nAluminum? ...Moldy water...\n13. Did you buy laundry soap to wash clothes? If so, how much did you pay?\n\n14. Fill in any changes in the use of fuel which have taken place since you first started housekeeping.\n\n15. For cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or back porch? (Give dates)\n\nBy whom was your first cook stove made? What year was it purchased?\n\nWhat types of utensils did you use? (Iron, copper, tin, homesteader)\n\nFor preserving food (butter, jam, etc.)\n\nFor heating water (boiler, earth oven, etc.)\n\nAll answers?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates here please).\n\nNearly all food came in the same style in bulk and was sealed in paper bags. The first package I ever saw was \"Saladini\" sugar dried apples. Soda would come in boxes. Raisins came in soft boxes.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nFather, Mother & children 2yo, 8yo\nBreakfast would be mostly porridge, ground wheat or granulated oatmeal & eggs.\nDinner Salt pork potatoes onion apple pie.\nSupper eggs potatoes meat & butter.\n\n18. What year did you serve your first Christmas dinner in Western Canada? _________________. Give the menu. List those present and give their approximate ages at that time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. If you are not sure about the date, give the approximate month, season or year.\n\nFather, Mother & children 27 & 28\n\nBreakfast: toast & scrambled eggs\n\nDinner: roast pork, potatoes, mixed vegetables\n\nSupper: eggs, apples & butter\n\n18. What year did you serve your first Christmas dinner in Western Kansas? Approximately how many people attended?\n\n19. Have you ever refused to allow starvation levels to exist due to poverty? If so, how did you do it?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMost people had up a supply of meat flour outstanding in the fall to do their best with that was the main articles of their food with the addition of prunes evaporated apples & molasses.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nNearly all groceries were sold in bulk there was very little packaged food. Batada tea was the first package tea about 1895. Pickles were sold in wooden jars about 3 pints. In the early days there was quite a lot of British food in the stores in Crosse & Blackwell's fruit & pickles, Dundee marmalade, Huntley & Palmers biscuits, Epsom cocoa.\n20. Mention any outstanding difficulties in the preparation of meals in the \n   early days. How did you overcome them?\n\n21. When did you begin to rely on purchased foods instead of home-prepared foods? (Give as many details as possible.)\n\n22. Please add other details from your early experiences of buying groceries \n   and preparing foods in those years during pioneer days in Eastern Canada.\n\n   Include items not mentioned above, quality, quantity, prices, or perishability,\n   problems of storage, shortages and other details. Use both of these pages if necessary.\n\n   Nearly all groceries were packed in bulk at the \n   time by little packages of salted tea was \n   The great Mackay's tea about 1875 - tightly wound \n   and in wooden boxes about 1890. In the early \n   days there was still a type of British grocer \n   The store is O'Brien & Blackwell's fruit & grocer \n   Danola, Manotick, Huntsville, Palmerston, Toronto\n\n   [Signature]\n\n   [Date]\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1882_9.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4913, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1424, 5], [1424, 2350, 6], [2350, 3553, 7], [3553, 4021, 8], [4021, 5331, 9], [5331, 6205, 10], [6205, 11016, 11], [11016, 12074, 12], [12074, 15760, 13], [15760, 16071, 14], [16071, 17131, 15], [17131, 17713, 16], [17713, 18784, 17], [18784, 19333, 18], [19333, 20462, 19], [20462, 21417, 20], [21417, 21417, 21], [21417, 21417, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]