[{"id": "b12798d41f40c58c9f1c3be2532ad9cf4b8f57cb", "text": "Diamond Jubilee Celebration\n\nProgramme...\n\nat...\n\nMoosomin, P.W.C.,\nCanada\n\nTuesday, June 22nd\nH.D. 1897\nProgramme...\n\n10 A.M. - CALTHUMPAN PROCESSION.\n\n11 A.M. - BASE-BALL.\n\n11.30 P.M. - PROCESSION FROM SCHOOL GROUNDS TO TURF CLUB PARK.\n\nORDER OF PROCESSION:\n1. BRASS BAND.\n2. MOUNTED POLICE.\n3. SCHOOL CHILDREN OF THE DISTRICT.\n4. TOWN COUNCIL AND COMMITTEE.\n5. BASE-BALL CLUBS.\n6. GENERAL PUBLIC.\n\nGeneral Sports.\n\nBoys' Race, 6 years old and under, 50 yards.\nBoys' Race, 6 years old and under, 50 yards.\nGirls' Race, 6 years old and under, 50 yards.\nGirls' Race, 6 years old and under, 50 yards.\nBoys' Race, 8 years old and under, 75 yards.\nBoys' Race, 8 years old and under, 75 yards.\nGirls' Race, 8 years old and under, 75 yards.\nGirls' Race, 8 years old and under, 75 yards.\nBoys' Race, 10 years old and under, 100 yards.\nBoys' Race, 10 years old and under, 100 yards.\nGirls' Race, 10 years old and under, 100 yards.\nGirls' Race, 10 years old and under, 100 yards.\nBoys' Race, 12 years and under, 125 yards.\nBoys' Race, 12 years and under, 125 yards.\nGirls' Race, 12 years and under, 125 yards.\nGirls' Race, 12 years and under, 125 yards.\nBoys' Race, 14 years and under, 150 yards.\nBoys' Race, 14 years and under, 150 yards.\nGirls' Race, 14 years and under, 150 yards.\nGirls' Race, 14 years and under, 150 yards.\nBoys' Race, 16 years and under, 175 yards.\nBoys' Race, 16 years and under, 175 yards.\nGirls' Race, 16 years and under, 175 yards.\nGirls' Race, 16 years and under, 175 yards.\nBoys' Race, 18 years and under, 200 yards.\nBoys' Race, 18 years and under, 200 yards.\nYoung Ladies' Race, open, 100 yards.\nYoung Ladies' Race, open, 100 yards.\nBoys' three-legged race, 18 years and under, 100 yards.\nBoys' three-legged race, 18 years and under, 100 yards.\nHalf-mile Walking Race.\nQuarter-mile running.\nFoot Race, 100 Yards.\nFoot Race, 100 Yards.\nForty Mins' Race, 100 Yards.\nForty Mins' Race, 100 Yards.\nMarried Ladies' Race, 50 yards and return.\nMarried Ladies' Race, 50 yards and return.\nWheelbarrow Race, 75 yards, blindfolded, and return to starting point.\n\nBicycle Races.\n\nOne mile event.\n\nGrand Display of Fireworks.\n\nAT GRAND STAND.\n\n1. \"THE MAPLE LEAF\"..............SCHOOL CHILDREN\n2. SELECTION.........................BRASS BAND\n3. \"THE RED WHITE AND BLUE\".....SCHOOL CHILDREN\n4. SELECTION.........................BRASS BAND\n5. ADDRESS, VERY REV DEAN O'MEARA\n6. \"GOD SAVE THE QUEEN\"..........SCHOOL CHILDREN\nCOMMITTEE.\n\nCOUNCILLORS M. MILLAR\nJ. SMITHERS\nT. H. BRISTOW\nF. G. LEWIS\nA. E. HART\nJOHN McGUIRLL\n\nMAYOR O. NEFF,\nCHAIRMAN.\nJ. BUCHANNAN,\nSECRETARY.\n\nMESSRS. A. H. SMITH, B.A.\nA. KINSEY\nA. E. CHRISTIE\nB. TENNYSON, Q.C.\nSHERIFF MURPHY\nJ. R. NEFF, M.L.A.\nJ. R. BRIGHAM\nI. R. BRIGHAM\nJ. A. WHITING\nGEO. HAY\nCAPT. HARRIS\nINSPECTOR MACDONELL.\n\nJUDGES—SPORTS.\nD. H. MCCALLUM\nJ. DANIEL\nI. R. BRIGHAM\n\nJUDGES—BICYCLE RACES.\nA. S. SMITH\nL. D. KEOWN\nJ. T. BROWN\n\n1953 The two marital art still\nalive in this young family\nBrown & Rogers\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same experiences as another. Some will like questions better than others; some may apply to your experience; others may prove too difficult or too easy. So don't worry about leaving blank spaces. Use your imagination to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1947, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWestern Saskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Fiat: What 3rd Western Canadian, more than 50 years old, would be willing to do so please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer clothing\n- Pioneer food supply\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the Permanent Records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you do not know the name is correct, as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: John Marley\n2. Your address: 207 Hwy 293, Macarthur, Sask.\n3. Date: April 5/1958\n4. Where were you born? (Give name of place and country) Yarmouth, Nova Scotia\n5. What was your father's name and occupation? James Marley\n6. When did you come to Saskatchewan? (Give month and year) May 1/1889\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\".)\n9. What were your reasons for coming West?\n\nYarmouth, Nova Scotia\n1958\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   - 1876 to March / 1875 Plus Heard of Blue Grass Valley to Move to West.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   - Party\n\n13. What means of transportation did you use?\n   - Walked through North Bay, arrived in Winnipeg, Saturday Morning.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   - Regina\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   - Worked at the Hardwood Sawmill\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns springing up, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out when did you make this decision?\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"pioneers\" to have or do something in the district mention it here, giving dates if possible. (Such as coming to the first automobile, combine, organizing the first school, etc.)\n\n38. How did the places in your community get their names? (School district, Post Office, villages, railway stations, creeks, hills, etc.) Try to give: (1) name; (2) date of its adoption; (3) any changes in names since then; (4) date and reason for change. Give facts of how name so above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photographs, written recollections and reminiscences? (Describe).\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nPlease give the names and addresses of other places you could answer than questionnaires.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1890_501.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 14, "total-input-tokens": 23240, "total-output-tokens": 3100, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 105, 4], [105, 2427, 5], [2427, 2952, 6], [2952, 4741, 7], [4741, 5724, 8], [5724, 6587, 9], [6587, 7248, 10], [7248, 8023, 11], [8023, 8783, 12], [8783, 9400, 13], [9400, 9554, 14]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]