[{"id": "e0582b28c8e89b4445a8059b4652a4efe4107afd", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to your experiences and may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nUse extra sheets of paper if there are not sufficient space available to answer the questions.\n\nDon't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Provincial Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPIONEER EXPERIENCES\n\nA word or explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space on this form.\n\nDon't hesitate to give details, or describe particular events, if they help you answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or prepared for use are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer farming experiences\n- Pioneer recreation and social life\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1897 Turner, Mrs. Harriet\nKipling, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Harriet Turner\n2. Your address: Kipling, Sask., S.S.S.R.\n3. Date: July 1st, 1954\n4. Where were you born? (Give name of place and country): Newton Heath, (now) Manchester\n5. What was your father's name and occupation?: Joseph Barlow, Farmer\n6. When did you come to Saskatchewan? (Give month and Year): January 1897\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Stockport, England; Before 1897\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n9. What were your reasons for coming West?\n   My two brothers had moved to Canada and they reported good prospects in the farming industry.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    We learned about the West through my brothers who had been farming in Canada for about five years.\n1974 Turner, Mrs. Harriet\nKip Line, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please explain further. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Mrs. Harriet Turner\n2. Your address: Kip Line, Sask.\n3. Date: July 1st, 1954\n4. Where were you born? (Give name of place and country): Newton Heath, England\n5. What was your father's name and occupation? (Give month and year): Joseph Barlow, Farmer\n6. When did you come to Saskatchewan? (Give month and year): January 1897\n7. Mention any other places where you lived before coming to Saskatchewan:\n   Stockport, England\n   Bradford, England\n   Hope, Canada\n   Winnipeg, Canada\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   Nine feet tall\n9. What were your reasons for coming West?\n   My two brothers have moved to Canada and they reported good prospects in the farming industry.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    We learned about the West through my mother who had been living in Canada for about five years.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were very anxious to see someone to the west. We had to travel by ourselves or with a party (family, friends or other group).\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nBy train from Valdosta to Whitehorse.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other occurrences, etc.)\n\nThe trip was very pleasant. We were 15 days on the trail. I was very sick when we got there because my infant daughter was very young.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Regina (approximately 100 miles)\n\n16. Where did you settle or take up land?\n\nWe settled at Regina.\n\n17. How long have you lived since coming to Saskatchewan?\n\nWe have lived here for about 10 years.\n\n18. How did you earn a living before coming to Western Canada?\n\nWorking on a farm in England.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were very anxious to come.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled with my husband and baby daughter.\n\n13. What means of transportation did you use?\n\nBy train from Winnipeg to Halifax.\n\n14. What incidents of the journey do you remember? (People you met on the way, interesting sights, adventures on the journey, accidents or other experiences, etc.)\n\nThe trip was very pleasant. We were 15 days on the boat. It was very nice and the captain was very good to my infant daughter. She had a big time and was very active and mischievous.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Regina (Farmers' Hotel)\n\n16. Where did you settle or take up land?\n\nWe settled at Okotoks.\n\n17. How did you earn a living before coming to Western Canada?\n\nI worked on a farm in England.\n\n(a) A housewife on a farm\n\n(b) Great mistress of the farm\n\n(c) In 33 years of residence I have been a faithful worker, from my childhood until death\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to settle here? If so, state their names and the place to settle.\n\nYes. My Husband & His Family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nJust after we settled here in 1897, my Youngest Son came to live with us in England. In 1921 my eldest sister came to visit me & after returned to England.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nNone.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nJust went about once a week in the wagon to visit our neighbors & about 4 times a year in a wagon to do our shopping in Willard & market our crops in Butler.\n19. How often did you write to relatives or friends in England?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Canada? If so, where from and what was their occupation?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nJust after we settled here in 1897 my young folks came to see me in England. In 1921 my eldest son came to see me & after returned to England to stay.\n19. How often did you write to relatives or friends in your old home?\n\nAbout 15 letters to England and one year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nDate: Morehouse Joseph, 7/4/1895\nPlace: Geauga County, Ohio\n\n21. Did anyone else come to Shaker Heights before or after your family?\n\nYes, my husband's brother W. A. Turner & his family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nJust after we settled here, May 1893, my younger sister came to Kentucky, then returned to England. In 1921 my oldest aunt came to visit me & also returned to England.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nNone.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nJust went about once a week in the wagon to visit our neighbors & about 4 times a year in a wagon to do our shopping in Willoughby & market and everything further.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else settle here? Yes, my husband's brother W. A. Turner & his family.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nJust went about once a week to the wagon to visit my neighbors & about 4 times a year via a wagon to do our shopping in neighboring villages.\n25. When was the first car used in the community? Birth in 1913 or 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen we came to Saskatchewan first it was with the idea to stay permanently. We came to turn (garden path runners).\n25. When was the first car used in the community? Between 1913 & 1914\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new taxes)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly?\n\n31. When (if ever) did you first begin to buy through the mail order catalogs?\n\n32. What kind of articles did you buy in this way? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.)\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen we came to Saskatchewan it was with the idea of trying permanently. We came to plant a grain farm (planned).\n34. Did any people move away from your district prior to 1914? What, where did they have for months?\n\nThe district was thinly settled.\n\nNo known or precise number away prior to 1914.\n\n35. Did many people move during the 1930s? Did many return?\n\nYes. None of them returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n(a) First President from 1919-1933\n\n(b) Postmaster from 1902-1919 my husband now\n\n(c) Postmaster from 1919-1933 my husband now\n\n(d) Mrs. [illegible] was first teacher\n\n(e) Mrs. [illegible] was first teacher\n\n(f) Mrs. [illegible] was first teacher\n\n(g) Mrs. [illegible] was first teacher\n\n(h) Mrs. [illegible] was first teacher\n\n(i) Mrs. [illegible] was first teacher\n\n(j) Mrs. [illegible] was first teacher\n\n(k) Mrs. [illegible] was first teacher\n\n(l) Mrs. [illegible] was first teacher\n\n(m) Mrs. [illegible] was first teacher\n\n(n) Mrs. [illegible] was first teacher\n\n(o) Mrs. [illegible] was first teacher\n\n(p) Mrs. [illegible] was first teacher\n\n(q) Mrs. [illegible] was first teacher\n\n(r) Mrs. [illegible] was first teacher\n\n(s) Mrs. [illegible] was first teacher\n\n(t) Mrs. [illegible] was first teacher\n\n(u) Mrs. [illegible] was first teacher\n\n(v) Mrs. [illegible] was first teacher\n\n(w) Mrs. [illegible] was first teacher\n\n(x) Mrs. [illegible] was first teacher\n\n(y) Mrs. [illegible] was first teacher\n\n(z) Mrs. [illegible] was first teacher\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOld school district named after man named Washington Stafford. He used to own a farm near the old schoolhouse. Because the mail carriers who drove mail from Wilburton to Stafford and back were named Washington Stafford and Mr. B. G. were adopted as the name in 1905.\n34. Did any people move away from your district prior to 1917? What reasons did they have for leaving?\n\nThe district was thirty acres.\n\nNo reason or reasons known.\n\naway prior to 1914.\n\n35. Did any people make any changes during the 1900s? Did many return?\n\nYes. None of them returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\n(a) Great Firewatcher 1919-1933\n\n(b) Post Master 1902-1919 my husband\n\n(c) Mrs. Hubbard was in the Grand Army of the Republic\n\n(d) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(e) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(f) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(g) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(h) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(i) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(j) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(k) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(l) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(m) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(n) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(o) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(p) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(q) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(r) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(s) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(t) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(u) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(v) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(w) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(x) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(y) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n(z) Mrs. Hubbard served 1905-1910 in the Red Cross\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of the adoption; (4) any changes in names since the first name was given; date and reason for change; give facts of new name as above in (1), (2), (3).\n\nOld town named after Mr. Smith. He used to own a farm there. The town was named after Mr. Smith because he was the first settler who came there. Mr. Smith was named Smith because he was the first settler.\n6.\n\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and programs, minute books of community organizations? (Describe), old photographs, written recollections and reminiscences?\n\nNil.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n.............(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children three are living at home:\nJames William Harold Wallace\nMargaret Mary Isabel Wallace\nMary Ellen Florence Wallace\n\nWhat do you think are the most important changes in your community since you first came West?\n\nWe have greatly improved. We have better schools, churches, etc. Have easier means of travelling.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWilliam Sherrin, Probably not.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. B.A. Wallace.\n\nLoring Hannah.\n6.\n\n39. Questions regarding historical source material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and programs, minute books of societies, organizations, clubs, old pamphlets, old photographs, written records, etc., relating to your ancestor? (Describe).\n\nNil\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n............. (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children three are living at home:\n\nFirst son William married to Mrs. Johnson\nSecond son Harold married to Mrs. Smith\nThird son Donald married to Mrs. Taylor\n\nWhat do you think are the most important changes in your community since you first came West?\n\nOur water are greatly improved. We have electricity and telephones. We have easier means of travelling.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nWilliam Wallace, Southfield\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. R.A. Wallace\n\nGeorge Hamilton\n\nS-X2\n378. Turner Harriet\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1897_578.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5974, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1594, 5], [1594, 3162, 6], [3162, 4542, 7], [4542, 5966, 8], [5966, 7026, 9], [7026, 8115, 10], [8115, 9135, 11], [9135, 9942, 12], [9942, 11088, 13], [11088, 11892, 14], [11892, 12926, 15], [12926, 13926, 16], [13926, 16080, 17], [16080, 18461, 18], [18461, 19749, 19], [19749, 21136, 20], [21136, 21291, 21], [21291, 21445, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]