[{"id": "c6b00620eda755e3ba78b807c6a2d0160aa7abc0", "text": "Pioneer Experiences: A General Questionnaire\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual could be asked exactly the same questions as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. If you have sheets of paper, if there is not sufficient space to answer the questions, just initiate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be either very young or old, and personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives has a questionnaire No. 1 entitled \"Pioneer Diet: What Did Western Canadians Eat?\" It is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our Province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nEdmonton, Sask.\n\n[Stamp]\n\n[Signature]\n\n[Date]\nPioneer Experiences: A General Questionnaire\n\nSaskatchewan Archives No. 2\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was asked to enumerate all his experiences. It has usually been necessary to ask questions which may prove impossible to answer. If there is not sufficient space to answer the question, just write \"not applicable\" or \"not applicable\" or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives has prepared a list of other questionnaires which may be useful to you. If you have already answered these, and are willing to do so, please put a check mark next to each one that applies to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below:\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nEnclosure of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Handwritten note:]\nWell, fill answer areas of 16 questions through I don't know. I can add anything of value to the archives.\nPotts, John\n\nRaymore.\n\nTo Sask. - March, 1894.\n\n1. Your full name: John Potts\n2. Your address: Raymore, Sask.\n3. Date: March 14th/1894\n4. Where were you born? (Give name of place and country): Manchester England\n5. What was your father's name and occupation? Peter Potts\n6. When did you come to Saskatchewan? (Give month and year): March 1894\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - From: England\n   - To: Canada in 1894\n8. How old were you when you first came to Western Canada? (You do not need to answer this question, if you would rather not or you may use \"I was 18 at my arrival,\" etc.)\n9. What were your reasons for coming West?\n   - To be close to a large family I felt that I needed for moral and social support\n   - Also had a notion that I wanted to see the wide open spaces\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFrom personal reading. My friend Charles was made when my wife moved to a man coming to Western Canada.\nPioneer Experiences: A General Questionnaire\n\n1. Your full name: John Potts\n2. Your address: Baymore\n3. Date: March 1894\n4. Where were you born? (Give name of place and country) Manchester England\n5. What was your father's name and occupation? Peter Potts\n6. When did you come to Saskatchewan? (Give month and year) March 1894\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - From England to Canada - from 1874 to 1894\n8. How old were you when you first came to Western Canada? (You do not need to answer this question. If you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West?\n   - To be closer to a large family I felt that I needed to move west and I also had a mother that I wanted to see her again\n10. How did you learn about the West? (Through other people? Reading about it?)\n    - Through other people\n\nFrom personal writing: Boyhood dreams were made within my mind.\n\n- John Potts\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nBefore I left, they came to me before I had made my decision.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)?\n\nWith my wife and her husband.\n\n13. What means of transportation did you use?\n\nRail to Winnipeg, boat to Halifax (summer season), rail to British Head.\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe took two more weeks, and I lost in the heavy of the land and strength from weakness. By the time we got there, we were out of the woods, which was a good thing. We were very weak, but we were able to get through.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe landed at Regina, then moved to North Battleford, and finally settled in Saskatoon.\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on the family farm in Victoria until I came to Canada. We had a hard time adjusting to the new environment.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on the family farm in Victoria until I came to Canada. We had a hard time adjusting to the new environment.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nWorking on the family farm in Victoria until I came to Canada. We had a hard time adjusting to the new environment.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n   - Rail to Winnipeg, boat to Halifax (summer journey), via to British Head\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other exciting experiences.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\n17. What was life like for your family from in Victoria until came to Canada? What had changed?\n\n18. How did you adjust to the climate and lifestyle in Canada? What challenges did you face?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a family (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n   Rail to Winnipeg, Boat to Halifax (Steamer Dominion), rail to Regina Head\n\n14. What incidents of the journey most do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How did you earn a living before coming to Western Canada? How after you came?\n\n17. Working on the family farm in Ontario while I came to Canada. While I had been working on my own farm, I worked myself back on Canada, but could not persuade my wife to come back. While I did farm work, office work, and coal mining. During the two years until my brothers came, I worked with horses also both on the land and on the farm, and some government work.\n\n18. How much did you earn per year? How much did you save? How much did you spend?\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you have any family in Western Canada? (Family, friends, or other relatives)\n\n13. What means of transportation did you use?\n\nRail to Winnipeg, boat to Halifax (Steamer Aurora), sail to St. John's, N.B.\n\n14. What hardships of the journey must do you remember? (People you met on the way, meetings with Indians, rivers, mountains, or other obstacles)\n\nWe lost one man, overboard, and I fell in the river of foamy water.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith Mr. Thomas Johnson, former resident of Kitchener, Kansas, then, for a couple of weeks until we moved my little house place a bit more backwoods - it was a big shack with no floor except dirt floor, and I then moved there would have a lot with my wife, but he came with us and his family, and they lived there for many years, and then moved back.\n\n16. How did you earn a living before coming to Western Canada? How about you came?\n\nWorking on the growing farm in Nebraska until came to Canada. While had three acres of land, came myself back in Canada, but could not persuade my wife to come back. Worked there at that farm work, office work, and coal mining. During the four years until my last interview, I worked with horses also both outside work as I had been used to work, and now employed by my new employer, and I am employed at present for $1.25 a day. Bought my own horse for $125 and work back for $1.25.\n19. How often did you write to relatives or friends in your old home?\n\nAbout twice a month\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nKaye Smith, Oct. 18, 1956, at the Anglican Church\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\nYes, my brother Peter and his family came in 1907. My friend John Smith came in 1905.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy brother Peter came in 1907 and settled near the town of Saskatoon.\n\n23. Is there any particular story you would like to recount?\n\nYes, I would like to recount the story of how my family came to Saskatchewan.\n\n24. Will you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nYes, we traveled quite a bit. We went to church every Sunday and visited our friends and family regularly.\n13. How often did you write to relatives or friends in your old home?\n\nAbout twice a month.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\nYes, John Smith came to Saskatchewan because of my recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west, tell when they came and where they settled.\n\nThe descendants of our family are still living in what is now the Regina district for many years.\n\n23. What was the condition of the land when you first came?\n\nThe land was very fertile and well suited for farming.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nYes, I traveled quite a bit during those early years.\n\n25. Was there any particular thing that you would like to remark?\n\nI would like to say that the early years were very challenging but also very rewarding.\n25. Then was the first car used in the community? I believe it was 1908 when W. Smith had his first car.\n\n26. If you had a car before 1914, what did you use it for? What makes?\n\n27. Where was your traveling country? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing.)\n\n29. Did you make better means of travel, etc., when the railroad came through what is now Raymore?\n\n30. How often did you shop in the early days? How frequently do you go shopping now?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and what percentage of purchases made by mail orders since the phone was installed.\n\nThe Eastern catalogue was used extensively. We had a house boy and maid.\n\nI don't think the phone has changed much.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? How did you make this decision?\n\nWell, I didn't altogether leave my job, but I think what I have always said reflects my attitude.\n25. Than was the first car used in the community? \n26. If you had a car before 1931, when did you get it? \n27. Where was your trading center? How far from your home? \n28. Did you continue to trade there? (Indicate any changes due to new towns, expansion, etc.) \n29. How often did you shop in the early days? \n30. When (if ever) did people in your district first start going to town regularly? \n31. What kind of articles did you buy? In what way did this also affect the proportion of purchases made by mail orders since the phone was installed? \n\nI don't think the OP has changed much. \n\nWell, I didn't really care enough my whole life.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI don't think I have anything of value in this respect, but I find anything I will send it on.\n\nI lost all my records, etc., when my home and its contents were destroyed by fire in Dec/15.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..... (indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon, Frank, married with 3 children, farming my old farm here — Joseph with travel and mechanical training, working at home; Florence and Jane going to school.\n\nSon, Jack, married with 4 children, with Edmonton Motors at Edmonton Alta — Kenneth married, with 1 child, with Edmonton/Henderson, Edmonton — Evelyn Helen 2 years old — Bertha with Woodworths Dry Dept., Vancouver — Keith in the Air Force, Edmonton and Jack at school, Edmonton.\n\nDaughter, Mary Gordon, married (now Mrs. Golly) 1 son, going to school — They are farming west of Raymond.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nProbably not the most important, but perhaps the most easily seen and having a most important, fresh in other improvements, are the improvements in transportation and communication. When I stood on the platform at Indian Head and looked down the track of the C.P.R. on March 19th, it looked like a wire fence blown down compared to the tracks I had left in England. Now we have tracks on all sides of us capable of carrying 180 car loads. In place of the rutted roads, we now have good gravelled roads, with many of them gravelled and black top coming nearer to our suburbs. Buses and motor cars make it possible to reach centres in a fraction of the time necessary in the warm and buggy days of the 1870's. Telephones have cut the isolation of the early days but still in some ways we seem to lack the human intimacy of the early days. Education has made great strides since the little red school house defended for its life on the injuries of war in a small district. His assistance of support today has made a great improvement, but I wonder that field must be widened until it includes the nation.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. A.J. McLean — Raymond — already sent one\n\nMr. John Riddell — Raymond\n\nMr. Charles Sanderson — Indian Head\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_____________________________\n6.\n\n59. Questions regarding historical source materials:\nDo you have any personal photographs or do you know the whereabouts of diaries, old letters, old newspapers, written records, etc.? If so, please describe them in detail.\n\n60. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n61. What do you think are the most important changes in your community since you moved here?\n\n62. How do you feel about the future of your community?\n\n63. Do you have any suggestions for improving the community?\n\n64. Is there anything else you would like to add?\n\n---\n\nI'm A.J. Potts - Reporter - Olney, IL\n\n---\n\nIf anyone else has filled in this questionnaire for you, please have them sign below:\n\n---\n\nS-X2\n566. Potts John\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M6\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1894_566.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5004, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1914, 5], [1914, 3712, 6], [3712, 4791, 7], [4791, 5790, 8], [5790, 7322, 9], [7322, 8136, 10], [8136, 9208, 11], [9208, 10710, 12], [10710, 11699, 13], [11699, 12713, 14], [12713, 13967, 15], [13967, 14604, 16], [14604, 14604, 17], [14604, 14604, 18], [14604, 14604, 19], [14604, 14604, 20], [14604, 17615, 21], [17615, 18373, 22], [18373, 18520, 23], [18520, 18674, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]