[{"id": "3d9f0ea4c51e73d7f05b39d1da76219b4abcb544", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives of the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSASKATOON, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Herman Ehrlich\n2. Your address: Box 1765, Helfort, Saskatchewan\n3. Date: March 29, 1963\n4. Where were you born? (Give name of place and country): Hennebergdorf, Lower Silesia, Germany\n5. What was your father's name and occupation? August Ehrlich - Farmer\n6. When did you come to Saskatchewan? (Give month and year): September, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Berlin, Germany - before 1905 - left Berlin August 4, 1905\n   Landed in New York August 13, 1905 - spent 1 year in New York and Madison Wisconsin. Came to Sask. Sep., 1906 - 1908\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were 21 years of age\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Seeing dissatisfied with \"city life\" and still dreaming about the \"wilderness\" I went to the station railroad ran in west in Canada - which was to Swan River. Man so I was told. However upon arriving in Swan River, we found out that the train went over Prince Albert. Stayed three weeks in Swan River and then continued to Star City, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Herman Ehrlich\n2. Your address: Box 176, Melfort, Saskatchewan\n3. Date: March 29, 1963\n4. Where were you born? (Give name of place and country): Herberdorf, Lower Silesia, Germany\n5. What was your father's name and occupation? August Ehrlich - Farmer\n6. When did you come to Saskatchewan? (Give month and year): September, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Berlin, Germany - before 1905 - left Berlin August 5, 1905\n   Landed in New York August 13, 1905 - spent 1 year in New York and Madison Wisconsin. Came to Sask. Sept., 1906 - 1908 (can't)\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West? To see wilderness and nature.\n   As a boy going to school, western Canada, on the map was a blank and I wondered just what I might find there.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Feeling dissatisfied with \"city life\" and still dreaming about the \"wilderness.\" I went to the station and bought a ticket to take me as far as Swan River, Manitoba (as I was told). Upon arriving in Swan River, we found out that the train went even further, to Alberta. Stayed three weeks in Swan River and then continued to Clear City, Sask.\n7. Returned to Milwaukee and Chicago - 1908 - 1910 have been here ever since.\n\n16. In Germany. Worked in Prince Albert and Neffcroft.\n\n---\n\n**Trapping experiences**\n\n1906 - Landed in Star City.\n1906 - 07 - In winter time trapped where Ridgelate is today.\n1907 - 08 - Trapped at Jordon River district - McConnell Creek.\n1908 - Returned to U.S.A.\n1906 - 1914 - Eagles always had a nest about ¼ mile from present site of Ridgeland. Last nest in 1914. Rabbits and fur bearing animals very plentiful.\n1906 - An enormous amount of large eagles.\n1910 - 1917 - Trapped in Ridgelade area.\n1918 - 1919 - Went across Sask. River at Nipawin (first fall they had ferries across river). Trapped in White Fox district.\n1919 - 1920 - Trapped at Birch Island east of Nipawin.\n1921 - Trapped around Waskesui.\n1922 - Started to chop a trail from north of Nipawin to Bear Hills. It took us four years to chop 80 miles (approx. 6 months a year) - trapped and chopped till 1921. Myself and partner, Walter Jensen - deceased spring, 1926.\n1926 - Landed at Ballantyne Creek, 6 miles east of Big Sandy.\n1927 - 1929 - Trapped on trap line from Mississinewau (wrong spelling) to Ballantyne Creek. Trap line ran due north between range 14 and 13.\n1928 - C.P.R. surveyors came through to Frog Portage, Churchill River. As my trap line went north they chained on my line 75 miles north and south from the Mississinewau to Ballantyne Creek.\n7. Returned to Milwaukee and Chicago - 1908 - have been here ever since\n\n16. In Germany. Worked in Prince Albert and Neifroft\n\n---\n\n**Trapping experiences**\n\n1906 - Landed in Star City.\n\n1906 - 07 - In winter time trapped where Ridgelate is today\n\n1907 - 08 - Trapped at Jordon River district - McConnell Creek\n\n1908 - Returned to U.S.A.\n\n1906 - 1914 - Eagles always had a nest about ¼ mile from present site of Ridgelate. Last nest in 1914. Rabbits and fur bearing animals very plentiful\n\n1906 - An enormous amount of large eagles\n\n1910 - 1917 - Trapped in Ridgelate area\n\n1918 - 1919 - Went across Sask. River at Nipawin (first fall they had ferrie across river) Trapped in White Fox district.\n\n1919 - 1920 - Trapped at Birch Island east of Nipawin\n\n1921 - Trapped around Waskesul\n\n1922 - Started to chop a trail from north of Nipawin to Bear Hills. It took us four years to chop 80 miles (approx. 6 months a year) - trapped and chopped trail. Myself and partner, Walter Jensen - deceased spring, 1926.\n\n1926 - Landed at Ballantyne Creek, 6 miles east of Big Sandy\n\n1927 - 1929 - Trapped on trap line from Mississinewau (wrong spelling) to Ballantyne Creek. Trap line ran due north between range 14 and 13\n\n1928 - C.P.R. surveyors came through to Frog Portage, Churchill River. As my trap line went due north they chained on my line 75 miles north and south from the Mississinewau to Ballantyne Creek.\nThe surveyors had been working about ten miles or so west. As they had a man going east and west every day, they discovered my trap line and then continued on it.\n\nAfter this the trail from the north to Nipawin was used for hauling provisions for the surveyors, hauling fish, etc., and by other people.\n\n1929 - Feb., moved 30 miles north into Bear Hills as there was too much traffic on my trap line. My partner that year was Joe Johnson, Prince Albert. In 1929 deer and jumpers were deceased and most of them died between Nipawin and Ballantyne Creek.\n\n1930 - Chopped trapping trails in Bear Hills with Joe Johnson.\n\n1931 - 1944 - trapped in Bear Hills area. There were an enormous lot of timber wolves.\n\n1935 - First fall went north by plane from Emma Lake. Landed on a very small lake on top of Bear Hills. Pilot was Angus Campbell from P.A. After this flew in and out every spring and fall.\n\nBefore we always walked. From Ridgedale to Bear Hills took ten days walking. In October provisions were brought in by horse as far as Ballantyne Creek and hauled by dogs from there.\n\n1933 - 34 - Very deep snow and thinner wolves killed a lot of moose between Ballantyne Creek and Bear Hills.\n\n- Caribou very plentiful up to 1935. From then on caribou started to disappear. By 1945 - 46 seemed to be gone.\n\n1945 - Fire Rangers map, east division, surveyors mentioned earlier, named lake that ran right through our trap line, that they followed \"Herman's Lake\".\nThe surveyors had been working about ten miles or so west. As they had a man going east and west every day, they discovered my trap line and then continued on it.\n\nAfter this the trail from the north to Mipawin was used for hauling provisions for the surveyors, hauling fish, etc., and by other people.\n\n1929 - Feb., moved 30 miles north into Bear Hills as there was too much traffic on my trap line. My partner that year was Joe Johnson, Prince Albert. In 1929 deer and jumpers were deceased and most of them died between Mipawin and Ballantyne Creek.\n\n1930 - Chopped trapping trails in Bear Hills with Joe Johnson.\n\n1931 - 1944 - trapped in Bear Hills area. There were an enormous lot of timer wolves. An old map called the area Wolf Mountain.\n\n1935 - First fall went north by plane from Emma Lake. Landed on a very small lake on top of Bear Hills. Pilot was Angus Campbell from P.A. After this flew in and out every spring and fall.\n\nBefore we always walked. From Ridgsdale to Bear Hills took ten days walking. In October provisions were brought in by horse as far as Ballantyne Creek and hauled by dogs from there.\n\n1933 - 34 - Very deep snow and timer wolves killed a lot of moose between Ballantyne Creek and Bear Hills.\n\nCaribou very plentiful up to 1935. From then on caribou started to disappear. By 1945-46 seemed to be gone.\n\n1945 - Fire Rangers map, east division, surveyors mentioned earlier, named lake that ran right through our trap line, that they followed \"Herman's Lake\".\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Relatives did not think anything of it except Mother who thought it would be alright to go for about six months.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Brother and a friend from Germany to New York. Brother Paul came west in 1906 but returned to Germany in 1907.\n\n13. What means of transportation did you use?\n   Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   On the train to Swan River we met an old cattle buyer who during the course of conversation told us that if we were looking for homesteads we should take land north of Star City as this was ideal farming land.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   1st night - hotel in Star City. Then bought supplies in Star City and walked north to the Sask. river - east 12 miles and south and finally landed where the village of Ridgedale is today.\n   We were on the road about 4 weeks.\n\n16. Where did you settle or take up land?\n   Took a homestead just north of Ridgedale. Lived off of and on at homestead while also working at the bricklaying and plastering trade, learned / will mention other places where you have lived since coming to Saskatchewon.\n   Lived on the Homestead and worked in Prince Albert and Melfort until 1918.\n   After 1918 worked steady in Melfort. Sold Homestead in 1921.\n   Biggest mistake I ever make.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   - Plastering and Bricklaying\n   - Plastering, Bricklaying, Trapping and a little farming\n11. What did your friends and relatives think of your decision to come to Western Canada? Relatives did not think anything of it except Mother who thought it would be alright to go for about six months.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? Brother and a friend from Germany to New York. Brother Paul came west in 1906 but returned to Germany in 1907.\n\n13. What means of transportation did you use? Train\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents, or other excitement, etc.) On the train to Swan River we met an old cattle buyer who during the course of conversation told us that if we were looking for homesteads we should take land north of Star City as this was ideal farming land.\n\n15. Where did you first stay when you arrived in Saskatchewan? 1st night - hotel in Star City. Then bought supplies in Star City and walked north to the Cash River east 12 miles and south. We were on the road about 4 weeks.\n\n16. Where did you settle or take up land? Took a homestead just north of Ridgedale. Lived off and on at homestead while listing supplies at the bricklaying and plastering trade, learned / 17. Mention any other places where you have lived since coming to Saskatchewan. Lived on the Homestead and worked in Prince Albert and Melfort until 1918.\n\nAfter 1918 worked steady in Melfort. Sold Homestead in 1921. Biggest mistake I ever make.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Plastering, Bricklaying, Trapping and a little farming\n3.\n\n19. How often did you write to relatives or friends in your old home?\n   About once a month. In 1907 I found the country around P.A. very beautiful and I wrote much oftener - telling mostly about the wild roses.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Elisabeth Jung - Ridgedale, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   One man came to Sask. from Milwaukee\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n   One brother, Paul. Went back to Germany in 1908. Took a homestead at Ridgedale but let it go\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Traveled from Ridgedale to Melfort and Star City - mostly by foot. Sometimes in the winter rode with neighbors with a sleigh but was so cold walked most of the way to keep warm. Usually came out in the spring to work and went back to homestead in late summer.\n19. How often did you write to relatives or friends in your old home?\n\nAbout once a month. In 1907 I found the country around P.A. very beautiful and I wrote much oftener — telling mostly about the wild roses.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nEliza (Elizabeth) Jung — Ridgedale, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nOne man came to East from Milwaukee.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nOne brother, Paul, went back to Germany in 1908. Took a homestead at Ridgendale but let it go.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nTravelled from Ridgedale to Valcourt and Star City — mostly by foot. Sometimes in the winter rode with neighbors with a sleigh but was so cold walked most of the way to keep warm. Usually came out in the spring to work and went back to homestead in late summer.\n25. When was the first car used in the community?\n   - 1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   - First car - 1915\n\n27. Where was your trading center? How far from your home?\n   - Star City\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing,\n   better means of travel, etc.)\n   - Country store - 1910 - 2 miles from Ridgedale\n   - 1920 train came through to Ridgedale - stores, etc., opened\n\n29. How often did you shop in the early days?\n   - Every two months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   - 1921 - To Ridgedale\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n   articles did you buy in this way? Indicate also what fraction of your total purchases were\n   by mail order and any changes in the proportion of purchases made by mail order since the\n   pioneer period.\n   - Only once - 1 bed and mattress through Eaton's in 1910\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   When coming out first time decided to try it out before making\n   up my mind. After going back to the States made up my\n   mind to stay in Sask.\n25. When was the first car used in the community?\n   1911\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   First car - 1925\n\n27. Where was your trading center? How far from your home?\n   Star City\n   Country store - 1910 - 2 miles from Ridgedale\n\n28. Did you continue to trade there? (Indicate any changes due to new town appearing,\n   better means of travel, etc.)\n   1920 train came through to Ridgedale - stores, etc. opened\n\n29. How often did you shop in the early days?\n   Every two months\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   1921 - To Ridgedale\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of\n   articles did you buy in this way? Indicate also what fraction of your total purchases were\n   by mail order and any changes in the proportion of purchases made by mail order since the\n   pioneer period.\n   Only once - 1 bed and mattress through Eaton's in 1910\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently?\n   Or did you make up your mind after trying it out? When did you make this decision?\n   When coming out first time decided to try it out before making\n   up my mind. After going back to the States made up my\n   mind to stay in Sask.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Mostly bachelors moved away. No particular reason to my knowledge.\n\n35. Did many people move away during the 1930's? Did many return?\n   No\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nRidgedale - two deep ravines at the district now known as \"Old Ridgedale.\" Later Village, where it now stands, given name of Ridgedale.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   Mostly bachelors moved away. No particular reason to my knowledge.\n\n35. Did many people move away during the 1920's? Did many return?\n   No\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combining the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nRidge Dale - two deep ravines at the district now known as \"Old Ridge Dale\" later village where it now stands, given name of Ridge Dale.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\nHave a few old photographs\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon?\nYes\n(Indicate your preference, if any) ____________________________\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\nAnnemarie Ehrlich, 307 Main Street, Saskatoon (daughter)\nSecretary -\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n(Miss.) Annemarie Ehrlich\n307 Main St., Saskatoon, Sask.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\nHave a few old photographs\n\nWould you or the person who owns them either\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\nor the Archives Office at the University in Saskatoon? Yes\n(Indicate your preference, if any) Saskatoon\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\nAnnemarie Ehrlich, 307 Main Street, Saskatoon (daughter)\nSecretary -\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n(MRS.) Annemarie Ehrlich\n307 Main St., Saskatoon, Sask.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906D-G_908.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 7267, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1618, 5], [1618, 3237, 6], [3237, 4870, 7], [4870, 6668, 8], [6668, 8078, 9], [8078, 9482, 10], [9482, 10938, 11], [10938, 12429, 12], [12429, 14184, 13], [14184, 15817, 14], [15817, 17070, 15], [17070, 18321, 16], [18321, 19737, 17], [19737, 21135, 18], [21135, 22301, 19], [22301, 23468, 20], [23468, 24651, 21], [24651, 25814, 22], [25814, 25969, 23], [25969, 26123, 24]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]