[{"id": "04e978ef2e3deddbb816ececf3d56b7763fa8cbb", "text": "S-X2\n658. Linnen Harvey Herbert\n| Articles          | Weight | Rate | Total |\n|------------------|--------|------|-------|\n| Mr. J. R. Fulton's Effects |        |      |       |\n| And Street       | 43½    |      |       |\n| Special          | 24600  |      |       |\n\nDate: March 9th, 1902\n\nReceived Payment: $104.40\n\nAgent: [Signature]\n\nNote: The freight will be delivered only on presentation of this bill. See Bill of Lading for conditions of carriage.\n\nThis receipt is signed by the Canadian Pacific Railway Company.\n| Articles          | Weight | Rate | Total |\n|------------------|--------|------|-------|\n| Mr. Smith's Effects |        |      |       |\n| Bed & Blanket     |        |      |       |\n| Bed & Blanket     |        |      |       |\n| Bed & Blanket     |        |      |       |\n\nTotal: $104.40\n\nReceived Payment: March 9th\n\nNote: The freight will be delivered only on presentation of this bill. See Bill of Lading for Freight Claim Agent, Montreal.\n\nThis freight is subject to the Freight Claim Agent, Montreal, compensation by freight bill. Any claim for damages incurred or loss must be sent to the Freight Claim Agent, Montreal. All claims for compensation or loss must be sent to the Freight Claim Agent, Montreal.\nA charge will be made when cars are delayed beyond the time allowed by this Company for loading and unloading. Make all cheques payable to the order of the Canadian Pacific Railway.\n\nAll freight transported by this Company is subject to its published terms and regulations. All claims for overcharge must be sent to the Freight Claims Auditor, Montreal, accompanied by freight bill. All claims for damage incurred on Lines West of Fort William must be sent to the Freight Claim Agent, Winnipeg, and on Lines East of Fort William to the Freight Claim Agent, Montreal.\n\nThis freight will be delivered only on presentation of this bill. See Bill of Lading for conditions of carriage.\n\n| Date       | No. of Pkg's | ARTICLES          | Weight | Rate | Unpaid | Advances | Total |\n|------------|--------------|-------------------|--------|------|--------|----------|-------|\n| March 9    |              |                   |        |      |        |          |       |\n\nReceived Payment:\n\nAgent:\nTO THE CANADIAN PACIFIC RAILWAY COMPANY,\n\nFor transporting the undermentioned freight billed from Spencerville.\n\nDate of W.B.: March 9, 1903\nW.B. No.: 35\nPro. No.: \nCar No.: 44902\n\nShipper: H. L.\nNo. of Pkg's: \n\n| ARTICLES          | Weight | Rate | Unpaid | Advances | Total |\n|-------------------|--------|------|--------|----------|-------|\n| Corr. Collins Effects |        |      |        |          |       |\n| And Stock         | 43½    |      |        |          |       |\n| OR Rail           | 3.4000 |      |        |          |       |\n\nStocks to be valued and fed by owner in charge.\n\nReceived Payment:\n\n[Signature]\n\nAgent:\nThis bill of lading, where we came west to homestead.\n\nIndian Head Station, March 9, 1903\n\nM. L. Linnion\n\nTo THE CANADIAN PACIFIC RAILWAY COMPANY,\n\nFor transporting the undermentioned freight billed from Spencerville.\n\n| Date of W. B. | W. B. No. | Pro. No. | Car No. |\n|---------------|-----------|----------|---------|\n| March 2       | 55        |          | 44902   |\n\nShipper: M. L. / Cor. Linnion Effects\n\nWeight: 43 lbs\nThis bill of lading, where we came west to homestead.\n\nIndian Head Station, March 9th, 1903\n\nM. H. Linnion\n\nTo THE CANADIAN PACIFIC RAILWAY COMPANY,\n\nFor transporting the undermentioned freight billed from Spencerhill.\n\nDate of W.B.: March 2nd\nW.B. No.: 35\nPro. No.: \nCar No.: 14902\n\nShipper: W.L.\nNo. of Pkg's.: 1\nARTICLES: Cor Sullivan Effects\nWeight: \nRate: \nUnpaid: \nAdvances: \n\nCustoms Report No.: \nIn Pro. No.: \n\nSheet No.: 75\n1. Your full name: Herbert Finnen\n\n2. Your address: 14563\n\n3. Date: April 1st, 1958\n\n4. Where were you born? (Give name of place and country) Ontario, Canada\n\n5. What was your father's name and occupation? David Finnen, farmer\n\n6. When did you come to Saskatchewan? (Give month and year) March, 1902\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n   Born near Sherrardville, Ontario 1878\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use it was a small child)\n\n   I was in my teens, 18 years\n\n9. What were your reasons for coming West? To get land to make a home.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Walking to another young man who had been west in 1901 and came home to see his parents in Windsor, Ont. 1901-1902 at Cardinal, Ont.\n1. Your full name: Herbert Loomen\n2. Your address: Shanehatchie, Ontario\n3. Date: April 1st, 1968\n4. Where were you born? Shanehatchie, Ontario\n5. What was your father's name and occupation? Donald Loomen, farmer\n6. When did you come to Saskatchewan? March, 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Bonny Head near Sherwoodville, Ontario 1878\n8. How old were you when you first came to Eastern Canada? (You do not need to answer this question if you were under 18 years old at that time)\n9. What were your reasons for coming West? To get land to make a home.\n\n10. How did you learn about the West? (Through other people, reading about it, railroad or government information?) Walking to another young man who had been west in 1901 and came home to see his parents winter 1901-1902 at Cardinal.\n11. What did your friends and relatives think of your decision to come to Western Canada? I thought I had made a good choice.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? By myself.\n\n13. What means of transportation did you use? C.P.R. to Indian Head.\n\n14. That incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures or other excitement etc.) Everything especially everything new to us.\n\n15. Where did you first stay when you arrived in Saskatchewan? At a hotel in Indian Head till I got a job on a farm at $6.00 per month for 8 months.\n\n16. Where did you settle or take up land? Lot 10 Township 13 Range 15\n\n17. Mention any other places where you have lived since coming to Saskatchewan. What kind of work?\n\n2329 Smith Rd., Regina, Sask.\n\n18. How did you earn a living before coming to Western Canada? How after you came homesteaded and that meant lots of work.\n11. What did your friends and relatives think of your decision to come to Western Canada? I thought I had made a good choice.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? Yes, I traveled by myself.\n\n13. What means of transportation did you use? CPR to Indian Head.\n\n14. That incidents of the journey best do you remember? People you met on the way, meetings with Indians, adventures or other excitement.\n\n15. What especially everything new to us?\n\n16. Where did you first stay when you arrived in Saskatchewan? At a hotel in Indian Head for a total of $6.00 per month for 8 months.\n\n17. Where did you settle or take up land? Sec 10 Township 13 Range 15 West of Second Meridian.\n\n18. Mention any other places where you have lived since coming to Saskatchewan.\n\n2329 Smith St., Regina, Sask.\n\n19. How did you earn a living before coming to Western Canada? How after you came here?\n\nHomesteaded and that meant lot of work.\n19. How often did you write to relatives or friends in your old home?\n\nEvery two or three weeks\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried to Mr. John Smith on May 15, 1905\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nYes, my brother and his family.\n\nDavid Samuel Simmon\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West then when they came and where they settled.\n\nShrewsbury, 1905, settled on a homestead 71 W. 1/4\n\n14-13-5, West 2nd road.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOur table was a hole dug out of the side of a small hill, cedar poles brought from Montana put in ground and board on the sides. This was made of poplar poles with alder hay spread on. Our living quarters was a quinney 4 X 16 with 3 feet boarded off to hold outs for 4 horses, two cows, our bed, stove, table, churn, sideboard to hold clothing.\n\nIf a young married couple lives that way for a start.\n\n24. Did you travel about much in the early years (for business, attending church, visiting friends, etc.)? How often? How far? By what means of travel?\n\nHad to travel to Medicine Hat for any supplies about 467 miles no other than we had to.\n\nHow many hours and at my lunch on the trail in winter when it was 35 or 40 day below zero. It wasn't half funny.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle? Yes my brother and his family.\n\nDavid Samuel Simmon\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nSpring 1905 started on a homestead N.W./4\n\n14-13-85. West 9 and south.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nOur stable was a hole dug out of the side of a small hill, cedar poles brought from Ontario put in ground and board on the sides. This was made of poplar held with a rough hay thread on our living quarters was a primitive 4x6 with 3 foot boards fitted outs for 4 horses two cows our bed, stove, table, churn, and board to hold clothing.\n\nIn 1910 built a frame 30'x20' high roof, about 46 million to plaster. From we had to.\n\nI have fed the horses and eat my lunch on the trail in winter when it was 35 or 40 degrees below zero. It wasn't half funny.\n25. When was the first car used in the community? 1915, a Ford.\n\n26. If you owned a car before 1917, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, etc.)\n\n29. How often did you shop in the early days? In homestead days we tried to make as few trips as possible.\n\n30. Then (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy? (Specify.) Indicate also what fraction of your total purchases by mail order and by catalogue was the proportion of purchases made by mail order.\n\n32. When did you first have a telephone and what company provided it? 1920\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nAge I could make age 8 at 1902\n25. When was the first car used in the community? 1915, a Ford.\n\n26. If you owned a car before 1914, when did you buy it? That makes 1917, a Buick.\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new times, etc.)\n\n29. How often did you shop in the early days? In homestead days we would make as few trips as possible.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy by mail order? Mail order catalogs were available.\n\n32. What kind of articles did you buy by mail order? Mail order catalogs were available.\n\n33. When did you first have a telephone and what company provided it? 1920\n\n34. When did you come to Saskatchewan? The first time was with the idea of staying permanently. Or did you make up your mind after trying it out? When did you make this decision?\n\n35. Would you make a go of it? 1902\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nSome who had never got homesteads\nwere forced to share they could get them.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many from our district although some\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been school trustee, chairman of board\nSunday school superintendent, president, layman representative\nPrairie City Elder, trustee church, chairman, director and chairman\nfor Francis church, chairman, director, chairman of frame\nboard directors local election, director in frame organization association\n\n37. If you or any of your family or friends were first to have a water tank,\nwindmill to pump water and first to have a windmill.\n\nIn 1915-9 was the second man in our district to have a\nwindmill to pump water and first to have a windmill.\n\n38. How did the places in your community get their names? (School districts, Post\noffices, villages, railway stations, creeks, hills, etc.) Try to give (1) na-\nme of person suggesting place-name (2) origin and meaning of the na-\nme (3) date of its adoption (4) any changes in name since the first name was given\nand reason for change.\n\nThe town of Francis was named in honor of which\nman? H. Francis, who owned the land on which\nthe townsite stands. Mr. Francis lived on many\nyears at Indian Head, town near Tenafly, Indiana\ntown of town never changed. Our two newest huddles\nthat was name for district of Furguson\none and that school is called Furguson name for a village\nin Sterling county.\n34. Did any people move away from your district prior to 1914? That reasons did they have for moving?\n\nSome who had never got homesteads\nmove to where they could get them.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many from our district although some considered returning to go next.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI have been school trustee, chairman, chairman of board\nSunday school superintendent, president, chairman, representative\nof Francisco Elderly trusteeship church, chairman, director, chairman\nfor Francisco charge graved church, chairman, director, chairman\nfor Francisco charge graved church, chairman, director, chairman\n\n37. If you or any of your family or friends were members of any organizations in the first automobiles, combine, organizing the First Ledge, etc., etc.\n\n8 helped organized our parish and present church, started\nto operate a new mission / local wheat herd committee\nin 1915-9 run by the second man in each district to have a\nwindmill to pump water and be it to have a windmill.\n\nIn town effort to help to house everybody we will face situation\n\n38. How did the names in your community get their names? (School districts, post\noffices, villages, railway stations, places, etc.). Try to give: (1) as\norigin, (2) villages, (3) origin and meaning of the name\nand separation of person suggesting place name since the first name was given,\n(4) date of its adoption, (5) any changes in names since above in (1) (2), (3).\n\nThe town of Francisco named in honor of which\nman H. Francisco who owned the land on which\nthe town site stands, near Francisco, Ontario\nthe town of Indian Head, town near Kansas/Nebraska\nname of town never changed, our two nearest buddies\nthat was name for district of township, what was name for a village\none and first school is called Mowville name for a village\nsecond school is called Glengarry county\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library/Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nTry children: Harold Harvey, former Hope editor. May Robert Cochrane, married Earl Hardesty, former Grand S. Hall. Barry Deacon, field worker in Elmoira. Francis Borthwick, former farmer. Danna Harvey and Judi Timm, 16 year old.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRailway, Better Roads, Schools, Churches\n\nTelephone, Co-operatives in action.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJohn T. Murray P.O., Francis, Sask.\n\nMr. Watson - address 1934 Roy St., Regina\n\nMrs. E.B. Moodie, Redden\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here;\n\nI did it myself\n\nH.H. Finney\n\nFrancis, Sask.\nWould you or this person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for display?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatchewan?\n\n(Indicate your preferences, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nMy children are: Harold Johnson, Harold Johnson, Harold Johnson, Harold Johnson\n\nMy grandchildren are: Harold Johnson, Harold Johnson, Harold Johnson, Harold Johnson\n\n41. What do you think are the most important changes in your community since you first came West? Railway, Better Roads, Schools, Churches\n\nTelephone, Too of whatever in action.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJohn H. Murray, P.O., Murray, Sask.\n\nMrs. Watson - address 1934 Hwy at Regina\n\nMr. C.E. Brown, Lawrence Park\n\nMrs. E.B. Brooks, Victoria\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nI did it myself\n\nH. H. Finney\n\nFrancis Look\n\"My pioneering experiences in Indian Head\"\n\nThat's what they call us!\n\nIndian Head\n\nExperimental Farm employee for stock at Col., times and many available immediately.\n\nTO REGINA\n\nBRIANTS\n\nThe summer of 1890 was a busy one for all of us, seeding the crop, breaking up new land and planting forage crops. The fall was spent in harvesting and storing the grain. We had to put up hay and wood to keep the animals comfortable through the winter.\n\nIn the fall of 1890, we moved into our new home in Regina. The house was a two-story frame structure with a large porch on the front. It had four bedrooms, two bathrooms, and a large living room. We also had a garage attached to the side of the house.\n\nThe next spring, we planted more crops and harvested them again in the fall. We continued to work hard on the farm throughout the year, despite the challenges of farming in the semi-arid climate.\n\"My pioneering experiences in Indian Head\"\n\nThat's what they call us!\n\nIndian Head\n\nFirst Prize Essay\n\nThe following story, submitted by W.D. Lang of Caveston, B.C., took first prize, $5, in Indian Head's Golden Jubilee contest.\n\nOne of the most interesting stories I ever heard was told to me by an old timer who had lived through the early days of Indian Head. He said that when he first came to town, there were only a few houses and a small population. The town was growing slowly, but there was a lot of potential for growth.\n\nIn those early days, the town was very isolated from the rest of the world. There were no roads or bridges, and travel was difficult. However, the people of Indian Head were determined to make their mark on the world.\n\nOne day, a group of pioneers decided to set out on a journey to find a new home. They loaded up their wagons with supplies and set off into the wilderness. After many days of travel, they finally arrived at their destination.\n\nThey found a beautiful valley surrounded by mountains. They built their homes and started farming. Over time, the town grew and prospered.\n\nToday, Indian Head is a thriving community with a rich history. It is a place where people come to experience the beauty of nature and the warmth of its people.\n\nTO REGINA\n\nBRIANTS\n\nExperimental Farm employee for stock at C.M. times and many valuable services rendered.\n\nTO REGINA\n\nMOOSOMINTS 70\n\nCheckers races over a half mile all blood horses barred, tan 31st.\nHours Counted to Big Jubilee Celebration\n\nIndian Head's 50th birthday celebration now needs only fair weather next Tuesday, July 1 to assure recognition of the event by the community. The hours until the Golden Jubilee celebration will be counted down by the Indian Head Legion branch and Rockets, plus farm groups and other organizations.\n\nAthletic association officials, in top charge, had the ball rolling on the sports program. The Legion has scheduled an outstanding milestone in Indian Head's history.\n\nRINK JOB STARTED\n\nWork on the new rink is progressing steadily. The work involves heating and lighting, and the installation of the ice-making machinery. The work is being done by local firms.\n\nTRIBUTE TO PETTY\n\nMore than 200 people attended the tribute to Petty at the Legion Hall last Friday night. The tribute was held in memory of Petty, who died recently.\n\nLAST FOR SENDALL\n\nThis Coming Sunday\n\nIn keeping with the theme of the Jubilee celebration, members of the Church and other friends pack their bags and head for Regina. The event will be held at the Regina Exhibition Grounds.\n\nMINISTER BURIED\n\nRev. R. L. Landheer, pastor of the First United Church, was buried yesterday afternoon at the Regina Cemetery. He died on Friday.\n\nBRIDE-ELECT HONORED IN SHOWER\n\nMiss Mary Smith, who will be married to Mr. Smith next week, was honored in a shower held at the home of Mrs. Smith.\n\nCADETS LEAVE FOR DUNDURN CAMP\n\nThe cadets left for Dundurn Camp today. They will spend the next few weeks there.\n\nWINNERS PICKED IN ESSAY CONTEST\n\nWinners of the essay contest have been selected. The winners will be announced soon.\n\nBRIANTS TO REGINA\n\nMiss Mary Smith, who will be married to Mr. Smith next week, was honored in a shower held at the home of Mrs. Smith.\n\nMOOSOMIN'S TO REGINA\n\nMiss Mary Smith, who will be married to Mr. Smith next week, was honored in a shower held at the home of Mrs. Smith.\n\n\"MY PIONEERING EXPERIENCES IN INDIAN HEAD\"\n\nFirst Prize Essay\n\nThe following essay, submitted by W. D. Long of Carleton, B.C., has been selected as the first prize essay:\n\n\"I was born in 1900 in Indian Head, Saskatchewan. I grew up there and still live there. I have lived through many changes in my life, but I have always been proud to be an Indian Header.\n\n\"In the spring of 1920 I graduated from high school. I then went to work for the Canadian Pacific Railway. I worked there for many years and became quite proficient in my job.\n\n\"In the fall of 1930 I married Miss Mary Smith. We moved to Regina where we lived for many years. We had two children, a boy and a girl.\n\n\"We returned to Indian Head in 1940 where we still live. We have enjoyed our time here and have made many friends.\n\n\"I am proud to be an Indian Header and I hope to continue living here for many more years.\"\nThat’s what they call us!\n\nIndian Head, which this year celebrates its 25th anniversary, began as an hotel known as Scratch’El-Elk or “wild rice” camp. It was called “wild rice” because it was located in the center of a cornfield instead of near a river.\n\nMore than two decades ago Dr. John Farrar purchased the land and built a house on it. The farm was run by Dr. Farrar’s wife until his death in 1899.\n\nThe property then passed into the hands of Dr. Edward Davies, who sold it to Mr. Edmondson. Mr. Edmondson sold it to Mr. Billingsly, who lived there until his death in 1916.\n\nThe property was then bought by Mr. Simpson and was held by him until his death.\n\nMr. Simpson’s widow continued to live there until she died in 1940.\n\nSince then, the property has remained in Mr. Simpson’s family.\n\n“My pioneering experiences in Indian Head”\n\nFirst Prize Essay\n\nThe following story, submitted by Mr. W. A., took first prize, $5, in Indian Head’s candlelight essay competition.\n\nBriants To Regina\n\nExperimental Farm employees for weeks preceding the show.\n\nExhibitors have been trying to interest their cattle on his retirement.\n\nThere was no opportunity for annual outings for the members of the staff at each of the Experimental Farm.\n\nMr. J. J. Briant received a presentation emblems placed in the windows of the public library.\n\nSocial causes are included among the many interests for which our branch of the Club will make efforts. Among these are seeking ways to improve life and death for our citizenry.\n\nSomeone smaller in size than any of the bars can make a public foot tall. No tax must be paid upon these bands.\n\nJust for the fifth day a child like that baby beer sauce will not become so stimulant that you must apply cool water immediately after the meal to prevent diarrhea.\n\nAdvertised to be open this week, the new building across the street from the school will become an agitator for public service.\n\nJoe Glass and Jack Green have been employed for two years by Joe Glass in selling newspapers. Jack is attending all around and Mike and Miss L. Hogg have helped out during this period. Rendering personal services such as those suggested by Glass, Jack is honesty and punctuality. TreeSet School will be closing December 31 and Joseph Brown, principal of the school, has conducted the meetings to Been for two months now.\n\nIt was a full day for those who attended the industrial training exercises which took place Saturday afternoon. The exercises were conducted by Mr. J. L. Willett of Stratford, who is the instructor. Mr. Willett gave the students an excellent drill period and they spent the day working together on various projects.\n\nLos showing the best specimens and working tirelessly for all types of plants throughout the winter I would be glad to see Hervey again next orchestra will give its concert. Remember Boole Hall.\n\nThese signatures, which are still unsigned on both sides, belong to the wooden structures that encircle the Shades of the ship. These signs are located about forty feet from the nearest landmass.\n\nCadets Leave For Dundurn Camp\n\nThe cadets of the district will attend a training camp this summer at Dundurn Camp. The camp is located approximately three miles from Hamilton, Ontario.\n\nAn interview with Mayor O’Connell shows that he is very interested in the development of the town. He has promised to work hard to bring prosperity to the community.\n\nHas this article alluded to events or circumstances which may affect future developments?\nHours Counted to Big Jubilee Celebration\n\nIndian Head's 50th birthday celebration now needs only fair weather next Tuesday, July 1, to assure residents and visitors that the community counted the hours until the Golden Jubilee event.\n\nAthletic association officials in top charge had the honour of announcing that the Indian Legion branch and Rockets, plus farm groups and throngs of individuals, are preparing plans for what is expected to be an outstanding milestone in Indian Head's life.\n\nRINK JOB STARTED\n\nWork has been started on the new rink, which will be completed by the end of June. According to the general manager, the work will be finished by the end of June.\n\nTRIBUTE TO PETTY\n\nTribute to Petty\n\nThe work involves heating and ventilating systems, plumbing, wiring, painting, and miscellaneous work.\n\nLast For Sendall\n\nThis Coming Sunday\n\nMinister Buried\n\nCadets Leave for Dundurn Camp\nLarge Stone Home Is Little Bit Of Old England At Moosomin, Sask.\n\nMOOSOMIN, Sask.—'The Maples' of Moosomin stands solid and enduring. A handsome, 10-roomed natural stone house in wide wooded grounds, the mansion is a little bit of old England. The Victorian flavor of the big stone house starts with the riding crop in the hallway, carried past the steeplechase pictures and into the den where the squire smokes his pipe and a visitor examines a Malayan kris on the library wall.\n\nThe squire of Maples is 82-year-old Kenneth Price, London-born and Oxford-nurtured, who began life as the son of an imperial army officer. He changed his mind about an army career and in 1887 turned his back on the white cliffs of Dover—but not its traditions—to become a farmer at Cannington Manor, Sask.\n\nAfter his home at Cannington burned down he worked in a livery stable at Moosomin and part of his job was driving the mail and passenger coaches over the old Moose Mountain trail to Birtle, Man. His parents, sisters and brothers came out in 1889 and they settled on a farm near here.\n\nThe restless Price however was a timber cruiser in northern Manitoba when the First World War broke out, and he became Captain Price with a squadron of the 9th Canadian Mounted Rifles that served overseas. He was gassed in France and after months of hospital care found his way back to Moosomin, where he served as postmaster for the next 30 years.\n\nMr. Price has been astride a horse most of his 82 years. He staged his own fox hunts in the Moosomin district with hounds imported from England. Polo was another pastime he brought to the prairie west but jumping was his favorite sport.\n\nHe took five horses to Winnipeg one year and won every steeplechase prize offered. Mr. Price has been a top-notch cricket player, representing Saskatchewan in other parts of Canada.\n\nHe was the first secretary of the Martin municipality and president of the Dominion Postmasters' Association for a five-year term. He retired from the Moosomin post office in 1950.\n\nSquire Price now is holding the fort for merrie England at Moosomin and confidently looks forward to celebrating his first century at his beloved Maples.\n\nA water moccasin can bite under water, but is less likely to be annoyed into striking while in the water.\n\nCanada's Quality Tea\n\n\"SALADA\"\n\nORANGE PEKOE\nLarge Stone Home Is Little Bit Of Old England At Moosomin, Sask.\n\nMOOSOMIN, Sask.—\"The Maples\" of Moosomin stands solid and enduring. A handsome, 10-roomed natural stone house in wide wooded grounds, the mansion is a little bit of old England. The Victorian flavor of the big stone house suffuses with the firing crop in the hallway, curving past the steeplechase pictures and into the den where the squire smokes his pipe and a visitor examines a Malayan kris on the library wall.\n\nThe squire of Maples is 92-year-old Kenneth Price, London-born and most of his 82 years. He staged his old Kengsith Price, Oxford-nurtured, who began life as an army officer, trained in the Moosomin district, the son of an imperial army officer. Polo was another pastime career and in 1887 turned his back on the prairie west but jumped by his favorite sport. He took five horses to Winnipeg one year and won every steeplechase prize offered. Mr. Price has been a burned down he worked in a livery stable, driving the mail and passenger coaches over the old Moose Mountain trail to Birle, Man. His parents, sisters and brothers came the Dominion Postmasters' Association out in 1889 and they settled on a farm near here.\n\nThe restless Price however was a timber cruiser in northern Manitoba. Square Price now is holding the post office in from the Moosomin post office in 1906.\n\nMatthew B. Ridgeway, former Canadian Army Reserve, Gen. Ridgeway, and Col. Ridgeway, Shropshire headquarters of the British Army, have been appointed to the Canadian Army Reserve.\nSMART DOG\n\nBy Walter Stanley Shatto\n\nScientists Believe They Will Soon Unravel Mysteries Of The Brilliant Northern Lights\n\nWestern Briefs\n\nTroops Warned\n\nFinds Wild West Tales Tame Compared With War Adventures\n\nMayer Finds He's Wearing Someone Else's Topcoat\n\nBaking's Easier, Speedier\n\nMACDONALD'S Fine Cut\n\nMakes a better cigarette\nBuffalo Are Attraction At Waterton Lakes National Park\n\nWaterton Lakes, Alta.—Buffalo herds have returned to the rolling prairie of Waterton Lakes National Park. This is the first time in more than a century that the area has been visited by such large herds.\n\nThe buffalo are attracted to the park by the abundant grasses and the absence of hunting. The herds are now being studied by scientists from the University of Alberta.\n\nSaskatchewan farm workers may be called up for military service.\n\nCanada's wild animals, birds, constitute some of its greatest attractions.\n\nHelps You Overcome FALSE 'EETH Looseness or Worry\n\nMACDONALD'S Fine Cut Makes a better cigarette\nHere's Some Quick and Appetizing Sandwiches\n\nFor The Picnic\n\nHoney Butter\n\n1 cup honey (melted)\nMix honey and butter together until thoroughly blended. Put in a covered container, hot or cold.\n\nCheese and Egg Spread\n\n1 tablespoon fat\n1 tablespoon sugar\n1/2 teaspoon mustard\n1/4 cup milk\n1/4 cup vinegar\nMelt fat, add sugar, mustard, milk and vinegar. Mix well.\n\nCinnamon Honey Spread\n\n1/2 cup honey\nMix honey and butter as for honey butter, then add cinnamon. Store in covered jar.\n\nSpanish Sandwich Spread\n\n1 tablespoon chopped onion\n1 tablespoon minced garlic\n1/2 cup grated cheese\nDash of paprika\nMix onion, garlic, cheese and paprika. Store in covered jar.\n\nMeat and Olive Spread\n\n2 cups ground bologna or cooked ham\n2 cloves minced garlic\n1/4 cup mayonnaise\nCombine all ingredients. Mix well.\n\nChopped Meat Sandwich\n\n1 hard-cooked egg\n1/2 cup mayonnaise\n1/2 cup chopped pickles\nMix all ingredients together.\n\nEggs and Bacon Sandwich\n\n3 hard-boiled eggs\n3 slices bacon, fried brown\nSpread on generously buttered bread.\n\nTuna-Apple Filling\n\n1 cup tuna, chopped\n1/2 cup apples, chopped\n1/4 cup mayonnaise\nMix all ingredients together.\n\nPrinter With A Few Drinks\n\nTourist Right\nHere's Some Quick and Appetizing Sandwiches\n\nFor The Picnic\n\nHoney Butter\n\n1 cup honey (family size)\n\nPinwheel Sandwich\n\n1/2 inch thick bread, cut lengthwise into strips\n\n1/4 cup butter\n\nMix honey and butter together until smooth.\n\nSpread mixture evenly over bread slices.\n\nRoll up tightly and slice into rounds.\n\nChase and Egg Spread\n\n1 tablespoon fat\n\n1 tablespoon mayonnaise\n\n1/2 teaspoon sugar\n\n1/2 teaspoon vinegar\n\nMelt fat in a small saucepan.\n\nAdd remaining ingredients and mix well.\n\nSimmer until thickened.\n\nCool and spread on toast or crackers.\n\nSpanish Honey Spread\n\n1/2 cup honey\n\n1/2 cup ground cheese\n\nMix honey and cheese until smooth.\n\nSpread on toast or crackers.\n\nMeat and Olive Spread\n\n1 hard-cooked egg\n\n2 cups ground bologna\n\n1/2 cup mayonnaise\n\n1/2 cup chopped olives\n\nMix all ingredients together.\n\nSpread on toast or crackers.\n\nSalmon and Horseradish\n\n1/2 hard-cooked egg\n\n1 tablespoon horseradish\n\n1/2 cup canned salmon\n\n1/2 cup mayonnaise\n\nMix all ingredients together.\n\nSpread on toast or crackers.\n\nChopped Meat Sandwich\n\n1 hard-cooked egg\n\n1 tablespoon mustard\n\n1/2 cup chopped meat\n\n1/2 cup mayonnaise\n\nMix all ingredients together.\n\nSpread on toast or crackers.\n\nEggs and Bacon Sandwich\n\n3 hard-boiled eggs\n\n3 bacon slices\n\n1/2 cup mayonnaise\n\nMix all ingredients together.\n\nSpread on toast or crackers.\n\nPrinter With A Few Drinks\n\nOut in Montana & Wyoming\n\nMrs. Frank Schuster\n\nPuts on Blue Berries\n\nMakes a Hit!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902E-Z_658.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 62, "total-input-tokens": 102920, "total-output-tokens": 10492, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 32, 4], [32, 32, 5], [32, 32, 6], [32, 522, 7], [522, 1240, 8], [1240, 2231, 9], [2231, 2866, 10], [2866, 3293, 11], [3293, 3726, 12], [3726, 4697, 13], [4697, 5562, 14], [5562, 6517, 15], [6517, 7475, 16], [7475, 8949, 17], [8949, 10140, 18], [10140, 11176, 19], [11176, 12138, 20], [12138, 13829, 21], [13829, 15847, 22], [15847, 17010, 23], [17010, 18145, 24], [18145, 19037, 25], [19037, 20519, 26], [20519, 23307, 27], [23307, 23307, 28], [23307, 26798, 29], [26798, 26798, 30], [26798, 27698, 31], [27698, 27698, 32], [27698, 27698, 33], [27698, 27698, 34], [27698, 30031, 35], [30031, 31573, 36], [31573, 31573, 37], [31573, 31573, 38], [31573, 31907, 39], [31907, 31907, 40], [31907, 32576, 41], [32576, 32576, 42], [32576, 32576, 43], [32576, 32576, 44], [32576, 32576, 45], [32576, 32576, 46], [32576, 32576, 47], [32576, 32576, 48], [32576, 32576, 49], [32576, 32576, 50], [32576, 32576, 51], [32576, 32576, 52], [32576, 32576, 53], [32576, 32576, 54], [32576, 32576, 55], [32576, 32576, 56], [32576, 33755, 57], [33755, 35201, 58], [35201, 35201, 59], [35201, 35201, 60], [35201, 35356, 61], [35356, 35510, 62]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "None", "en", "None", "en", "en", "None", "None", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, true, true, true, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]