[{"id": "38e42dd5c919017f24d209c815f660d2bd1e009c", "text": "1. Your full name: JOHN WATSON\n\n2. Year added: 1940\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have some-one else do the writing of your direction.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nSAKSATCHEWAN ARCHIVES QUESTIONNAIRES\n1. Your full name is John Smith.\n2. Your address is 123 Main Street, Anytown, USA.\n3. Date — October 10, 2023.\n4. Where were you born? Johnstown, Pennsylvania.\n5. What was your favorite book as a child? \"The Chronicles of Narnia\" by C.S. Lewis.\n6. Who was your favorite teacher? Mrs. Johnson from 8th grade.\n7. What was your favorite subject in school? History.\n8. What do you remember about your childhood? Playing outside with friends and going to the park.\n9. What did you enjoy doing during your free time? Reading books and watching movies.\n10. What do you remember about your childhood? Playing outside with friends and going to the park.\nMrs. Hail Decedent 1940\n\nMr. & Mrs. John Hail\nHad 10 children.\n\nLena, Mrs. Elm J. Thomas\nLucy, Mrs. Kelvington Smith, Farmer\nDecedent 1931. One child.\n\nOsgood, Mrs. Matthew Pierce\nWoodman, Sarah Farmer\nBatt, 1961. Four children.\n\nOlga, Mrs. Ken Bragier\nRose, Mrs. Sally Smith\nMrs. Montgomery Allred\nDecedent 1960. Two children.\n\nOtley — Mr. Albert Hail\nMrs. Woodman Smith\nChief Engineer Alabama Highway\nChief Engineer Children\n7. Mention any other information, giving dates if needed to answer this question.\n\n8. How did you come to Saskatchewan? (Give month and year.)\n\n9. What was your occupation at this time?\n\n10. How did you get here?\n\n11. What was your first job in Saskatchewan?\n\n12. Years:\n\n13. Railroad\n8. Goodrich Taft Elevator Mgr.\n9. W. Lemansano Sask.\n10. How did you come to Saskatchewan? (Give month and year.) SPRING 1905\n\n2. Children?\n\nFrank Taft & Louise Taft Mgr.\nW. Lemansano Sask.\n4 Children.\n\nNo children.\n\nRailroad\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mentice where giving dates\n\n8. How old was in my teens, etc.\n\n9. What question A\n\n10. How or g\n\nAnd so on. I'm not sure what it's about it? Railroad\n\nJohn Taylor, his initials\n\nof a school teacher\n\non field.\n\nJohn Taylor, his initials\n\nof a school teacher\n\non field.\n\nFrom Taft & Co. to Mr. Monk\n\nH. Eldredge\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mentions where\n\n8. How many children?\n\n9. What\n\n10. How or about it? Railroad\n1. Your full name: JOHN WATSON\n\n2. Your address: WADENA, SASK\n\n3. Date: MARCH 4, 1962\n\n4. Where were you born? (Give name of place and country): STIRLING, SASKATCHEWAN\n\n5. What was your father's name and occupation? ALEX TAIT (BLACKSMITH)\n\n6. When did you come to Saskatchewan? (Give month and year): SPRING OF 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: JASPER, MINN USA AGE 12 YEARS\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.): ABOU 30-31, MARINER, WIFE OF ONE CHILD\n\n9. What were your reasons for coming West? TO HOME SETTLE\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) BY READING ABOUT IT\n1. Your full name: JOHN TAIT\n\n2. Your address: MADEN SASK.\n\n3. Date: MARCH 9, 1962.\n\n4. Where were you born? (Give name of place and country): STIRLING SCOTLAND.\n\n5. What was your father's name and occupation? ALEX TAIT (BLACKSMITH)\n\n6. When did you come to Saskatchewan? (Give month and year): SPRING 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: JASPER MINN. USA AGE OF 13 YEARS.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\" or \"I was in my teens, etc.\") ABOUT 30-31 MARRIED WIFE AND ONE CHILD\n\n9. What were your reasons for coming West? TO HOMESTEAD\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) BY READING ABOUT IT.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought it was a rather dangerous adventure.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n(Family) Wives Parents & Brothers\n\n13. What means of transportation did you use?\n\nTrain to Yorkton Sask.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWe had all our personal belongings on the hayrack on wagon pulled by horses over prairie trail. Stuck many times in low wet places. Some Indians not none gave trouble. No accidents or illness.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nYorkton Sask\n\n16. Where did you settle or take up land?\n\nWadena Sask\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nGull Lake Sask then back to Wadena.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nWorked in the Quarries Marble Stone Factory\n\nFarming in Saskatchewan\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation or a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled. All came to Galt Hill.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVISITING FRIENDS ONE OR TWO MILES APART\n\nBY THE USE OF OXEN.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\nQuite regularly\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMarried Mary Jensen Spence of 1900 in Jasper, Alberta, Canada\n\n21. Did anyone else come to Saskatchewan because of your recommendation it was a good place to settle?\n\nYes. Ole Stouenud from Jasper.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nAll came to Canada.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nRaising cattle and breaking in oxen to work the land.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nVisiting friends one or two miles away by the use of oxen.\n25. When was the first car used in the community? BY A MR. FENSON, \"DRUGGIST\"\n\n26. If you owned a car before 1914, when did you buy it? What make? NONE.\n\n27. Where was your trading center? How far from your home? AT FIRST IT WAS SHEHO ABOUT 40 MILES DISTANCE BEFORE RAILWAY GAME THROUGH.\n\nTHEN IT WAS ONLY 3/4 MILES TO WINDING.\n\n28. Did you continue to rode there? (Indicate any changes due to new towns appearing.\n\nbetter means of travel, etc.)\n\n29. How often did you shop in the early days? ONCE A MONTH AT SHEHO.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAFTER THE RAILWAY AND TOWN WAS STARTED.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\nA-ABOVE-THE-QUARTER HOUSE, ABOUT 1920\n\n33. When you came to Saskatchewan the first time was it with the idea of trying permanently?\n\nOr did you make up your mind after trying it out? When did you make this decision?\n\nYES, AFTER FIRST YEAR WE STAY.\n25. When was the first car used in the community? BY A MR. McLENNAN 'DRUGIST'\n\n26. If you owned a car before 1914, when did you buy it? What makes? NONE.\n\n27. Where was your trading center? How far from your home? AT FIRST IT WAS SHENY ABOUT 3 MILES DISTANCE BEFORE MAILWAY CAME THROUGH.\n\nTHEN IT WAS ONLY 2 1/2 MILES TO WARDEN.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNO ROADS JUST PRAIRIE TRAILS AT FIRST\n\nIN 1905 THE RAILWAY CAME THROUGH THE TOWN STARTED TO GET SETTLED.\n\n29. How often did you shop in the early days? ONCE A MONTH AT SHENY.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? AFTER THE RAILWAY AND TOWN WAS STARTED.\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order, and any changes in the proportion of purchases made by mail orders since the pioneer period.\n\nORDERED THROUGH T. EATONS AND NEIL BROS. CLOTHING AND GROCERIES.\n\nORDERS TOOK FROM 7 TO 9 DAYS.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nYES. AFTER FIRST YEAR WE DECIDED TO STAY.\n34. Did any people move away from your district prior to 1942? What reasons did they have for moving?\n\nNONE LEFT AT ALL.\n\n35. Did many people move away during the 1930's? Did many return?\n\n2 FAMILIES LEFT IN 1930, DID NOT RETURN.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nN/A\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district combine, organizing the first lodge, etc., mention it here giving dates wherever possible. (Such as owning the first automobile, etc.)\n\nWE OWNED FIRST & HEAD OF OXEN.\n\nBROKE THEM HIMSELF.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving? \n\nNONE LEFT AT ALL.\n\n35. Did many people move away during the 1930's? Did many return?\n\n2 FAMILIES LEFT IN 1930, DID NOT RETURN.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nWE OWNED FIRST 3 HEAD OF COWS.\n\nBROKE THEM HIMSELF.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nFROM A FAMILY COMMUNE FROM WADENA\n\nBY TOLKENS FARMERS.\n39. Questions regarding historical source materials: N/A\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.) NAME THAT.\n\nI CAN THINK OF.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina,\n\n(Indicate your preference, if any)\n\nor the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations. You had 10 children, many of whom are still working and living in a separate place of residence.\n\nAND WATER WORKS INSTALLED IN 1961\n\nAND NOW THE SEWER IN 1959\n\nCOMING TO WADENA FROM OTHER PARTS OF CAN.\n\nWEST? THE GROWTH OF OUR TOWN AND FOLKS\n\n41. What do you think are the most important changes in your community since you first came\n\nPlease give the names and addresses of other pioneers who could answer\n\nthis questionnaire. HENRY AND OTTO JOLYN WADENA SASK.\n\nNELS JOLYN WADENA, CLARENCE ERICKSON WADENA SASK.\n\nOSCAR PETERSON WADENA SASK, MRS LAURA SMITH WADENA SASK.\n\nMR ALFRED LARSON POSSERN SASK, MR JOHNNY WADENA SASK.\n\nIf someone else has filled in this questionnaire for you, please have this\n\nperson give name and address here:\n\nMRS ALEX ZAIT (DAUGHTER IN LAW)\n\nBOX 83 WADENA SASK\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.) \n\nI CAN THINK OF.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nThe head of children's families will sign and date.\n\nGreat-grandchildren attached if willing to sign.\n\non a separate piece of paper.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nTHE GROWTH OF OUR TOWN AND FOLKS\n\nCONNING TO WADEWA FROM OTHER PARTS OF CAN.\n\nAND NOW THE SEWER IN 1959\n\nAND WATER WORKS INSTALLED IN 1961\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire. WHEREVER AND WHENEVER TOLEN WADEWA SASK.\n\nWELS TOLENY WADEWA SASK CLARENCE EMERSON WADEWA SASK.\n\nOSCAR PETERSON WADEWA SASK MRS LAURA SMITH WADEWA SASK.\n\nMR ALFRED LARSON PASSDEN SASK MR JOHN A. SUTHERLAND WALL HUNT.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMRS ALEX TAIT (Daughter-in-Law)\n\nBOX 82 WADEWA SASK\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903R-Z_732.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 4837, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 372, 5], [372, 372, 6], [372, 1017, 7], [1017, 1444, 8], [1444, 1729, 9], [1729, 1955, 10], [1955, 2328, 11], [2328, 2470, 12], [2470, 3350, 13], [3350, 4225, 14], [4225, 5327, 15], [5327, 5990, 16], [5990, 6745, 17], [6745, 7676, 18], [7676, 8943, 19], [8943, 10386, 20], [10386, 11473, 21], [11473, 12199, 22], [12199, 13719, 23], [13719, 15277, 24], [15277, 15277, 25], [15277, 15436, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]