[{"id": "ca3a0fb410be27c9e14c1ebcd4cc4d603690892a", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\nYour full name Sydney Chipperfield\nPresent Address 261 - 14th Street West, Prince Albert, Sask.\nPioneer Address Chicora, Abernathy and Hubbard\nYear you came to Saskatchewan Landed in Indian Head May 24th, 1883.\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? about ten.\n\nHow many of these were bachelor's homes? about half.\n\n2. How often did you usually visit neighbors?\nQuite often, my mother served many meals to the bachelors and we visited them back and forth with the married neighbors.\n\n3. Did you usually visit on a Sunday, or other days?\nSome of the neighbors did visit on Sundays; we usually attended the local services either at church or in town.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Often without invitation, for special occasions with invitation.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Sometimes in the morning, sometimes in the afternoon sometime we spent the day and sometime part.\n\nWhat about meals? Did you stay when not invited beforehand? Very often.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?)\n\nJust asked them to stay for a meal and they could give them whatever was prepared for the family. No they have grown products was used.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Cup of tea, cake or sandwiches.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Sometimes the whole family would go and the boy or hired man would stay here and look after the farm. He would go at another time.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\nYes, they were held and a lot of people took part in it.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\nI can remember my mother attending quilting bees but could not give dates. My Father used to go and help neighbors when they were putting up new buildings and other neighbors gathered there too.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\nVery seldom, I can remember one neighbor who had a dance in his house one evening.\n\nWere these more frequent in later years? Give dates.\nYes, they were.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, I do not remember.\nREMARKS ON VISITING, PARTIES, ETC.\n\n1. In the first few years, how many house were near enough to you for visiting about twice each day?\n\n2. How often did you usually visit neighbors? (Give an answer by saying how many times per week.)\n\n3. Did you usually visit on Sundays or other days? (Give an answer by saying how many times per week.)\n\n4. Were you ever invited to other houses, or was most visiting done without an invitation? (Give an answer by saying how many times per week.)\n\nWhat time of the day did you go? In the morning and around the day, or in the afternoon, etc.? Sometimes we went somewhere in the afternoon, sometimes we spent the day doing something else.\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression used?)\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the plants?\n\n6. Did you ever have bees when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.?\n7. Were there any additions or major alterations in the school later? Not for many years and then a new school was built. Chilbury Rd., 43. If so, explain what these changes were, giving sizes, and explain the reason. (that is, was it because of increase in number of pupils, or for extra convenience, such as adding a porch or coal shed).\n\n8. Is this first school building still in use? No. If not, give the reason. (burned, new school built, school closed because of lack of pupils, etc.). Give dates if possible. New school built.\n\n9. Describe the window arrangement in the classroom, telling how many, how placed (all on one side, on two sides of room, etc.) whether provided with blinds, etc. 2 windows on each side.\n\nWas there any kind of lamp in the school, or other provision for artificial light? Explain. Coil Oil lamps were used in the early days.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards, maps, etc. 2 blackboards, sufficient old style desks for the pupils, and two or three maps. Big wood stove at the back of the school, chair and table for the teacher.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in getting the first school started? About 20 families.\n\nHow many children of school age were there in the school? In 1896 nine attended. The number of children gradually increased each year.\n\nHow many bachelors or others in the district helped in establishing the school? Explain. about 5.\n\nWas there any opposition within the community towards the idea of starting a school? Explain. No, not that I know.\n2.\n\n7. Were there any additions or major alterations in the school later?\n   If so, explain what these changes were, giving dates and reasons.\n   If not, explain (that is, was it because of increase in number of pupils, or for\n   extra convenience, such as adding a porch or coal shed), etc.\n\n6. Is this first school building still in use?\n   If not, give the reason; (burned, new school built, school closed because\n   of lack of pupils, etc.). Give dates if possible.\n\n3. Describe the window arrangement in the classroom, telling how many are\n   placed (all on one side, on two sides of room, etc.) whether provided with\n   blinds, etc.\n\nWas there any kind of lamp in the school, or other provision for artificial\nlight? Explain.\n\n10. Describe the school equipment, - desks, (kind and number), blackboards,\n    maps, etc., 2 blackboards, sufficient old style desks for the pupils,\n    and two or three maps. Big wood stove at the back of the school, chair and\n    table for the teacher.\n\nORGANIZATION AND ADMINISTRATION.\n\n11. How many families with children of school age or younger were active in\n    getting the first school started? About 20 families.\n\nHow many children of school age were there in the school? In 1896 nine attended.\n\nHow many teachers or others in the district helped in establishing the\nschool? Explain, about 5.\n\nWas there any opposition within the community towards the idea of starting\na school? Explain, No, not that I know.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? Very few in the early years. Money was too scarce.\n\n13. Was the chivaree known in your community? Only occasionally. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. None that I remember.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. We organized Socker football and baseball clubs and then arranged with the districts of Abernethy, Kenlis, Hill Farm, Lorlie and Pheasant Forks and arranged tournaments to see which club would be the winner for the season. This took place about 1898.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The Chickney Tempered Society. Give the date and reason for it being organized. About 1895. Strong XXXXXX prohibition sentiment in the community.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes. Tell when it was organized, and what steps led to its organization. As far as I remember about 1900, I was appointed Secretary of the Chickney Branch. If I remember rightly the No. was #3. Approximately what proportion of the farmers in the community belonged to it? About 75%. How many women belonged? Do not remember that there were any. How often did it meet? About once a month. What were some of the activities carried on by this organization? Occasionally evening meetings and possibly a picnic.\n\n17. Was there a Homemakers' Club in your district? No. When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n12. That attempt at formality, or \"manners,\" do you remember in small towns, such as gloves and hats when calling, calling cards, visiting cards especially in parlor, etc.? Very few in the early years. Money was too scarce.\n\n13. Was the obivare known in your community? Only occasionally. Describe what you remember about obivares, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, at parties and give approximate date whenever you can. Also describe games or amusements not already mentioned that were popular in visiting or social life before noticeable. We organized soccer football and baseball clubs and then arranged with the districts of Abernathy, Kenilworth, Hill Party, Lord's and Pleasant Forks and arranged tournaments to see which club would be the winner for the season. This took place about 1898.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nThe Chicony Temperance Society.\n\nGive the date and reason for its being organized.\n\nAlong 1895. Strong prohibitionist sentiment in the community.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community?\n\nYes, it was organized, and what steps led to its organization.\n\nAs far as I remember about 1900, I was appointed Secretary of the Chicony Branch. If I remember rightly, the No. was No. 3. Strong prohibitionist sentiment in the community.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAbout 75%.\n\nHow many women belonged? Do not remember that there were any.\n\nHow often did it meet? About once a month.\n\nWhat were some of the activities carried on by this organization?\n\nOccasionally evening meetings and possibly a picnic.\n\n17. Was there a Homemakers' Club in your district?\n\nNo.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in the town/village or small area (for example within a school district), or was centered in the town/village and included the surrounding community. (There is space in the church questionnaires for organizations connected with the church, so they need not be included here).\n\nDo not remember any at Chickney.\n\nAbout 1903 I moved to Abernethy and they had the usual small village organizations at that time.\n\nWhat means were commonly used by organizations for raising money?\n\nPut on local concerts, raised a certain amount by personal canvass, hold picnics and later on agricultural society every other year.\n\n19. Where did various organizations hold their meetings?\n\nIn Churches and the Public Hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Occasionally, usually in the Churches.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nLocal Ministers or teachers gave the lectures and they were usually fairly well attended. The writer remembers Pauline Johnson who gave a Concert at the Kenlis School house some years before.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nNo, not often, I well remember one I attended at the Kenlis School House when I was a boy of about ten years of age.\n\nWho provided the lantern and the slides? Cannot remember.\n\nIt was a very amusing picture and it showed hunters for elephants.\n\nThey would catch a young elephant and then fasten a barrel on his tail and after that all the elephants would be sporting barrels on their tails and the picture show said whatever size barrel they would require they would recapture an elephant either small or big as to their requirement.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? The usual game played was rounders, anti-me-over, association football and former baseball played with a solid ball.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nHide and Seed, Skipping rope, rounders and anti-me-over, also play house.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district) or those who came from all over the church quarter, and if any organization connected with the church, so they need not be included here.\n\nDo not remember our at Okemah and they had the annual small village organizations about 1903 I moved to Altamont and they had the annual small village organizations at that time.\n\nWhat means were commonly used by organizations for raising money?\n\nPut on local concerts, raised a certain amount by personal canvass, hold picnics and fairs on agricultural soil every other year.\n\n19. Where did various organizations hold their meetings?\n\nIn Churches and the Public Hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Occasionally, usually in the Churches.\n\nDescribe telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nLocal Ministers or Teachers gave the lectures and they were usually fairly well attended. The writer remembers Pauline Johnson who gave a Concert at the Emma School house some years before.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nNo, not often, I will remember one I attended at the Emma School house when I was a boy of about ten years old.\n\nWho provided the lantern and the slides? It was a very amusing show for adults.\n\nCannot remember.\n\nThey would catch a young elephant and then fasten a string on his tail and after that what were the slides about? All the elephants would be pulled by the tails and the picture show said whatever else they could manage they would recapture an elephant either small or big as to their requirements.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jump rope, ball, marbles, fly kites, etc.)? The usual games played were marbles, anti-reverser, association football and former baseball played with a solid ball.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nHide and Seek, Skipping rope, rounders and anti-reverser, also play houses.\n22. What winter games were played outside - fox and hounds, skating, etc.? Fox and hounds, skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? Checkers, various card games such as Authors, Flinch and other card games.\n\nDid the whole family join in such games, or only the children? Explain. In our own home my Mother and Cousin used to join my Sister and myself as my Father seldom played indoors games.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. In long winter evenings.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe. Not that I remember.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. I cannot remember the first one but I will remember a picnic conducted at Gladstone July 1901 which was very well attended.\n\n26. Who organized it? It was organized by the young men of the district of which the writer was the secretary.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Entire community and many came from nearby other communities. They came from Pheasant River, Lorne, Kenlis, Hill Para and Abernathy.\n\n28. Was it the first picnic held in the community? The first large one that I remember. There may have been some small family picnics. If not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? There was baseball and soccer football tournaments, races for the children, horseshoe throwing and other sports. There was a booth on the ground and it was well patronized.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? General Lunch and tables were set up in the clearing of a nearby bluff.\n\n31. What did you have to eat and drink? The usual food at that time with tea and lemonade supplied for drinks.\n\n32. What time of the day did it start, and how long did it last? It started about 1 P.M. and finished up at 10:00 P.M.\n22. What winter games were played outside - fox and hounds, skating, etc.? Fox and hounds, skating.\n\nWhat games were played indoors in winter - card games such as \"Happy Families,\" \"Whist,\" or other card games; checkers or other games? Checkers, various card games such as \"Happy Families,\" \"Whist,\" and other card games.\n\nDid the whole family join in such games, or only the children? Explain. In our own home my mother and father used to join my sisters and myself in playing indoor games.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nIn long winter evenings,\n\n23. Did children invent games connected with such things as buffalo bones, arrowheads, gypsies or other objects or animals, or games in the snow? Describe.\n\nNot that I remember.\n\n24.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Remember it distinctly. I cannot remember the first one but I was eleven years old at the time.\n\n26. Who organized it? It was organized by the young men of the district of which we wrote earlier.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? It was for the entire community and many times from members of other communities. They came from Moose Jaw, Prince Albert, Temiskaming, Hill Town and Athabasca.\n\n28. Was it the first picnic held in the community? The first large one that I remember. There were several more small family picnics.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? There were baseball and other sports. There was a booth on the ground where refreshments were served.\n\n30. What arrangements were made for eating - was there a general lunch, or did General Daniel and others serve up in the clearing of a nearby bluff?\n\n31. What did you have to eat and drink? The usual food at that time with tea and homemade supplies for dinner.\n\n32. What time of the day did it start, and how long did it last? It started about 1 P.M. and finished up at 10:00 P.M.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThere was a very large crowd gathered from the points mentioned as these districts had their own soccer football team, some of them such as Abernethy, Emils and Chickney also had baseball teams. One item I well remember was that supplies had been ordered from Edmonton for the event such as oranges, etc., they had to be freighted over from Sintaluta by wagon and when the train called at the station the goods had not arrived so we bought a case from one of the local merchants which happened to be very small oranges, the Emils correspondents of the Indian Head paper in referring to the picnics stated that the oranges \"were hide bound widgets\". Some very good games of ball were played for the opportunity that the players of that day had of practising.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nWhen living at Hubbard my Father and I attended a large Sunday School picnic held South of Nelleher, this if we remember rightly would be in July 1911, a very good time was spent by both grown ups and children. This picnic was in charge of the superintendent of teachers of the Sunday School of the Presbyterian Church at Nelleher.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nIn the old days most of the people went in a poor type of buggies, carts and some in lumber wagons, some of them were not very well dressed as they could not afford good clothes, nowadays nearly every one goes by car and they are well dress and some money to spend. In the early days the children did not have more than .05 or .10 to spend. Today I have seen some children with $1.00 or more.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nThe sports were usually young men for the football and baseball games, sometimes there would be races for both men and women as well as the children and some interested races were run, prizes if any were small.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Soccer football.\n\nWhat year? about 1898 How long did it continue? Nearly until the store and Post Office were discontinued at Chickney.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nAt Hubbard in about 1912 there was a football team that played against Ituna and Isloher teams. We are not sure the date of organization and it was not carried on for very many years. At Hubbard there was also men's tennis teams that competed at the Bunnichy tournament on Labor Day for several years. The girls played in these tournaments for a number of years, and Mr. Tom Redden, farmer of the district also competed and others occasionally.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). If we remember rightly curling and skating rink was erected in Abernethy in 1905. At Hubbard an open air rink being a good size slough was held in 1912.\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nThere was a very large crowd gathered from the earliest morning until late at night. The weather had been excellent all day long, and the children had fun in the park, playing games, eating snacks, and enjoying the music provided by the band. The food was plentiful and delicious, and everyone seemed to be having a great time.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large family picnic, school or Sunday School, picnic for family, etc.\n\nThe first picnic I attended was a large family picnic held at the park near our home. It was a beautiful day, and we had a wonderful time. We played games, ate snacks, and enjoyed the music provided by the band. The food was plentiful and delicious, and everyone seemed to be having a great time.\n\n35. What changes have you noticed in picnics since the first years? If possible, tell us about the differences.\n\nIn the early days, picnics were simple affairs, with just a few people gathering together to enjoy the outdoors. Today, picnics have become much more elaborate, with many people attending and enjoying a variety of activities.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in them.\n\nThe sports which were popular in my community in the early years included baseball, football, and basketball. These sports were played by both boys and girls, and were enjoyed by people of all ages.\n\n37. For what game was the first team organized in your community to play against another team?\n\nThe first team organized in my community to play against another team was the baseball team. They played against teams from other towns and cities, and were very successful.\n\n38. Name any other parks or areas that were used for picnics or sports activities.\n\nThere were several parks and areas used for picnics and sports activities in my community. These included the park near our home, the park near the school, and the park near the church.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for.\n\nThe first outdoor rink was built in 1920, and was used for hockey, curling, and skating. It was a great success, and many people enjoyed using it.\n40. When did an annual \"sports day\" become established in your community?\nIn Abernethy about 1905; in Hibbard about 1912.\nDid it grow out of or replace the earlier community picnic?\nYes.\nWho was responsible for starting the first sports day?\nIn Abernethy Mr. M.R. Williams, Mr. George Bewell, Mr. J.H. Gillespie, Mr. A.A. Hunt, etc.\nIn Chickney Mr. A. Watkins, Mr. Mike Farino and myself.\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st). The date was arranged each year.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\nNot that I'm aware of.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\nMy parents brought with them some thirty or forty books when they came from England in 1883, I remember they had two or three bibles, two testaments, Pilgrim's Progress, Uncle Tom's Cabin and a number of English story books some suitable for children some for older people.\n\n43. How many of your neighbors brought books with them?\nNearly all those who came from England brought a certain amount of books.\nWhat kind of books and how many?\nI am not sure as I was too young.\n\n44. To what extent did you exchange books with neighbors?\nIf we had an interesting book we used to lend to one home to another until nearly all the district had read it.\n\n45. Did you buy many books after you came west? Give details.\nYes, quite a number. I bought a History in England about ten volumes and quite a number of the popular fiction of the day such as Ralph Connor's books and many others.\n\n46. What books were sent to you as gifts in early years?\nI do not remember receiving many of these, possibly an odd one from a friend in England.\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\nNot that I remember as I left the Chickney district over fifty years ago.\n\n48. Was there a school library? No. When was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? Not that I know of.\n40. When did an annual \"sports day\" become established in your community?\n\nIn Australia, about 1905, in Victoria, about 1912.\n\n41. Are there any from your community who have become members of well-known\n\nnot that I'm sure of.\n\n42. What books did you bring with you when you came west? (Give a list of the\n\nnames and authors, if possible; if not, as nearly as you can for many\n\nbooks you brought, and what kind.) (Use extra sheets if necessary.)\n\nMy parents brought with them some thirty or forty books when they came from\n\nEngland in 1853. I remember they had two or three bibles, two testaments, Pilgrims\n\nProgress, Uncle Tom's Cabin and a number of English story books suitable for\n\nchildren ages four to eight years.\n\n43. How many of your neighbors brought books with them?\n\nNot all those who came from England brought a certain amount of books.\n\nThat kind of books and how many?\n\nI am not sure as I was too young.\n\n44. To what extent did you exchange books with neighbors?\n\nIf we had an interesting book we used to lend it to one home to another until nearly\n\nall the literature had read it.\n\n45. Did you buy many books after you came west? Give details.\n\nYes, quite a number. I bought a history of England about ten volumes and quite\n\na number of the popular fiction of the day such as Ralph Connor's books and many\n\nothers.\n\n46. What books were sent to you as gifts in early years?\n\nI do not remember receiving many of these, possibly an odd one from a friend in England.\n\n47. Have you ever had any \"traveling library\" books in your community or school?\n\nNot that I remember as I left the Chilcotin district over fifty years ago.\n\n48. Was there a school library? No.\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to\n\nread at home?\n\n49. Did parents ever use their children's school text books as additional reading\n50. Has there ever been a community library in your district or town? Not at Chickney but there has probably been one at Abernethy.\n\nWhen was it started? Who started it?\n\nNot sure Cannot say.\n\nIs it still in existence? I expect so.\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nCannot say as I left Abernethy forty-six years ago.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nThe Family Herald and Weekly Star, the Leader Post, the Indian Head Fiddette, Ladies Home Journal.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWhen I moved to a new locality Hubbard, I use to get the Melville Weekly, the United Church Observer, the Saskatoon Star Phoenix and continued to get the Family Herald and Weekly Star. Of late years I have been getting the Maclean's Magazines, the Reader's Digest, Saturday Night and other magazines.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nAs about Sevent-one years ago very few, possibly Bible and one or two other books.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n\nNo, we use to get enough to keep us going.\n50. Has there ever been a community library in your district or town? If so, at what date did it start? What was its name?\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? The Family Herald and Weekly Star; the Leader Post; the Indian Head Palladium.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nWhen I moved to a new locality in Alberta, I used to get the Manitoba Weekly, the United Church Observer, the Saskatchewan Free Press, and continued to get the Family Herald and Weekly Star, of Alta, Texas. I have been getting the Holcomb Magazine, the Reader's Digest, Saturday Night, and other magazines.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nNo.\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\nAs stated above—ten years ago very few, possibly Bible and one or two other books.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west & hardship? Explain.\n\nYes, we had to get enough to keep us going.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   None\n\n57. What instruments did any of your neighbors have?\n   One or two had small organ and one or two others had a violin. My Father bought\n   a Concertina with him from England.\n\n58. What musical instruments have you bought since you came to the west? Give\n   dates, prices if possible, and tell where you bought them.\n   We bought an organ from an Agent at Grassfield. This was an American Oxford, bought\n   it about 1890 price about $90.00. Later I bought a Mason & Risch piano from the\n   company selling them in Sebastapol, about 1912 price about $300.00.\n\n59. How large a part did singing and other forms of music play in your home-\n   entertainment in early years in the West? Describe.\n   Probably about 10%.\n\n   in the community? (were there musical concerts, was there group singing at\n   parties, etc.) Describe.\n   Yes, there were.\n\n60. What were some of the favorite songs in the home?\n   Old Black Joe, Swan River, A lot of Sankeys Hymns, Where is now the Merry Party\n   I Remember Long Ago.\n\n   in the community? A lot the same as above together with the Girl with Pinafore\n   Dress.\n\n61. Was \"folk music\", or music of the country you came from, popular in your\n   home or community? Explain.\n   Yes.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old\n   tune as a joke on somebody, or because of some special happening in the\n   community? Explain.\n   I never did but my Father occasionally.\n\n63. Was there a band in your community? No. When was it started?\n   Who started it? How long did it continue?\n   How many were in it? Who was bandmaster?\n   What instruments were included?\n\n   Tell what you remember of its activities, how often practice was held, where,\n   if members had uniforms, what events the band played for.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\nNone.\n\n57. What instruments did any of your neighbors have?\nOne or two had small organs and one or two others had a violin. My father bought a concertina with him from England.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\nWe bought an organ from a man in town at $100.00. In 1912 we bought a piano from the company selling house in Butte City for about $300.00.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\nProbably about 10%.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe.\nYes, there were.\n\n60. What were some of the favorite songs in the home?\nOld Black Jack, Swan River, A Lot of Sundays' Hymns, Where Is Now the Happy Party I Remember Long Ago.\n\nIn the community? A lot the same as above together with the Girl With Plaidsfore Dress.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\nYes.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune just for fun, or because of some special happening in the community? Explain.\nI never did but my father occasionally.\n\n63. Was there a band in your community? No. When was it started?\nWho started it?\nHow long did it continue?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\nNot that I know of.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nIt's more important now on account of the Musical Festivals held in many communities.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n56. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\nNo.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nWe used to have a Mr. Boyce in our community who made a lot of models of boats and ships. He moved to Qu'Appelle Station when I was twelve years of age. I was invited to his home for a week's visit, where I had the privilege of looking over all the models. Forty-one years after this, I was in Saskatoon visiting my eldest son Lawrence who was attending the University of Sask. He took me to visit the Museum, where we got in. I pointed to a shelf on which were a large model of boat and ships, said to belong to Mr. Boyce. That time I visited the museum, there were any in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Boyce's home since I was 12 years of age. We went over to examine them more carefully and found a tag presented to the U. of S. by H.F. Boyce they were the same I had seen forty-one years before.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? If so, name(s) and dates and places of public appearances.\n\n65. In what way was the early days' life in your community more or less connected with the early days? What is the reason for this change?\n\nIt's more important now on account of the bustling Port Macquarie held by many communities.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n56. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding event connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nWe used to have a lot of boys in our community who made a lot of models of boats and ships; he was a little later moved to Queensland where I was living at the age of nine years old. The next year after that I was in Gladstone, and then my eldest son Lawrence who was attending the University of South Australia took me to visit the museum, where we got to know pointed to a shelf on which were a large model of a ship and a number of other objects.\n\n69. At what times did you spend your leisure hours? For example, did you read books, newspapers, magazines, or listen to music? Or did you engage in outdoor activities such as sports, games, or other forms of recreation?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, musicals of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883A-L_1894.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 10343, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1302, 5], [1302, 1302, 6], [1302, 3853, 7], [3853, 5300, 8], [5300, 6918, 9], [6918, 8371, 10], [8371, 10381, 11], [10381, 12403, 12], [12403, 14838, 13], [14838, 17221, 14], [17221, 19531, 15], [19531, 21621, 16], [21621, 25245, 17], [25245, 27548, 18], [27548, 29911, 19], [29911, 31776, 20], [31776, 33391, 21], [33391, 34579, 22], [34579, 36436, 23], [36436, 38046, 24], [38046, 40031, 25], [40031, 41797, 26], [41797, 41797, 27], [41797, 41949, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]