[{"id": "ba901f09f7bec7fea9a18f8053fe87f4e247b20e", "text": "1. Your full name: Joseph G. Wilson\n\n2. Your address: 4165 Sheena St., Vancouver, B.C.\n\n3. Date: Aug. 2/52\n\n4. Where were you born? (Give name of place and country): Wolferton - Ont. 1872\n\n5. What was your father's name and occupation? Hugh Wilson - Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): April 1904\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Wolferton until 1905 - Saint Marie 1895 to 1904\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 32\n\n9. What were your reasons for coming West?\n   To get a farm of my own and better my condition\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Through advertising and a course of mine. Rev. E. Scottley and his son, both now deceased, we homesteaded together at Lashburn Sack. Rev. E. Scottley used to conduct services there occasionally at the home. Miss Risley who was one of the early settlers there, who came with a number of English boys to settle on farms at her expense. Three of them stuck to the farms to complete their homesteading and two of the boys and families have done very well. Tommy Simpson's boys and families have done very well. Tommy Simpson's boys and families have done very well. Tommy Simpson's boys and families have done very well. Tommy Simpson's boys and families have done very well. Tommy Simpson's boys and families have done very well. Tommy Simpson's boys and families have done very well.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were pleased with it. Mr. Roftley wanted my family to come west years before when you could get land around Yorkton for $5 per acre.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith Mr. Roftley first trip to fall on homestead.\n\n13. What means of transportation did you use? Train to Lethbridge Regina and train to Lumsden. We were taken through here by boat as far as Lumsden was flooded out and then into box cars to Saskatoon where we got there the bridge was out from spring flood so we were taken across to Immigration Hall by boat and had to stay there about 10 days account of bad roads.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). We met a Mr. Newman a pioneer by trade and he bought a pair of steers that had just been tied together by the neck for about a week as broken down by cowpox. We bought a pair of small steers just nicely fat. We bought an old wagon & harness all for $70 which was nearly all the money we had outside of supplies to do us for the summer. Mr. Newman had a nice team of steers that new wagon & box with spring seat, a first class outfit. Oxen were worth about $100 each but he did not know the first thing about them and was stuck so I told him to come with us & I would handle his oxen which he was pleased to do so we loaded up 2 loads of machinery flows (wagons) and wagons & harnesses for us at Stegmonton. We were paid $45.00 for delivering agent at Stegmonton. We were paid $45.00 for delivering agent at Stegmonton. We were paid $45.00 for delivering agent at Stegmonton.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nImmigration Hall, Saskatoon about 10 days and then camped for summer at homestead near Saskatoon while we built a log house & sod barn.\n\n16. Where did you settle or take up land?\n\nSec 30 NW 4 - 47 - 25 W 3.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nN. Battleford - Turtleford.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI worked for a lumber Co at Sandstone main town also clerk for a logging camp out of the Sandstone about 30 miles. Was born & brought up on a farm near Wallerton Ont. until about 18 yrs of age.\n19. How often did you write to relatives or friends in your old home?\n\n3 or 4 times a year.\n\nThen I went to Blydenister and what experience we had on the road. I drove Mr. Newman's oxen for 2 days or at least road with him until he learned something about them. After about 2 days the oxen were tired enough to not be much better. Mr. Newman was a green Englishman and I told him to say \"see\" when he wanted to go right & \"how\" when he wanted to go left. He kept practicing saying \"see & how\". He said \"aw\" and about the fourth day about 6 o'clock I got the gun & went out to get some prairie chickens or rabbits to cook for supper. I was out from the trail a piece when I heard Mr. Newman yelling \"aw aw\" aw. I ran out to see what the trouble was and on account of the mosquitoes being so bad his oxen headed on the run for a bluff on the right pulling down the small trees at edge of bluff and running in as far as they could go & it took us 2 or 3 hours to get the oxen & wagon out. As the small trees flew up behind the wagon & the neck yoke was nearly choking them. It did not take me long with our axe to relieve the oxen. Mr. Newman said I told them to \"aw\" but they wouldn't. We had quite a laugh afterwards.\n\nI had quite a few other experiences on this trip that I would tell if interested.\n\nThe spring came and my young women came one night trails home. My travelling was mostly hunting cattle burners deals and church on Sundays occasional visits or picnics. We had a good farmers organization in the early days. Our bee hive in Saskatchewan now I believe. His name is Fred Lawrence Smith - you probably know of him.\nthe roads to Lloydminster and what experiences we had on the road. I drove Mr. Newman's oxen for 2 days or at least road with him until he learned something about them.\n\nAfter about 2 days the oxen were tired enough to not be much bother. Mr. Newman was a green Englishman and I told him to say \"lee\" when he wanted to go right & \"haw\" when he wanted to go left. He kept practicing saying \"lee & haw\". He said \"aw\", and about the fourth day about 4 o'clock I got the gun & went out to get some prairie chickens or rabbits to cook for supper. I was out from the trail a piece when I heard Mr. Newman yelling \"aw aw aw\" I ran out to see what the trouble was and on account of the mosquitoes being so bad his oxen headed on the run for a bluff on the right pulling down the small trees at edge of bluff and running in as far as they could go & it took us 2 or 3 hours to get the oxen & wagon out as the small trees flew up behind the wagon & the neck yoke was nearly choking them. It did not take me long with our axe to relieve the oxen. Mr. Newman said I told them to \"aw\" but they wouldn't. We had quite a laugh afterwards.\n\nI had quite a few other experiences on this trip that I would tell if interested.\n\n---\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, I knew all the settlers for miles around.\n19. How often did you write to relatives or friends in your old home?\n   3 or 4 times a year.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n    Emma Reid Apr 30th 1910 at\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n    Yes - mother, sister, brother & some relatives by marriage.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n    Mother, brother & sister settled at Bashburn around 1907.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n    I homesteaded near a green Englishman. They had 3 oxen & as I was willing to bashburn for some groceries I saw them starting to break some land. One held the plow & the other lead the oxen & they were going away way so I offered to show them how to do it and struck a furrow for them & told them I would call coming back. The furrow was about 200 yds long so I left & coming back they were plowing just one way & going back without plowing so I plowed a furrow back for them & they got an easy ride afterward. They both made good & all now retired one here in B.C. & the other at Bashburn both comfortable. Another homesteader used to get so angry with his horse he called them unprintable names and would grab an ox by the ear with his teeth.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n    Yes. I knew all the settlers for miles around after my first year when I had a pony & saddle and afterwards a cart which my mother used to sell later. This pony would always bring her & my sister home no matter how dark the night. My first load to get in the cart & let the horses loose & the pony would take the right trails home. My travelling was mostly hunting cattle, business deals and church on Sundays occasional visits or picnics we had a good farmers organization in the early days. Our bee lives in Saskatchewan now I believe. His name is Fred Tawney Smith - you probably know of him.\n25. When was the first car used in the community? About 1912.\n\n26. If you owned a car before 1914, when did you buy it? What make? Model T Ford at N. Battleford 1913. I moved to N. Breda & took the money from agency 1916.\n\n27. What was your trading center? How far from your home?\n\nUp to 1912 it was at Lashburn 2 miles north.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nNo change except that Lashburn got to be quite prosperous. A wealthy Englishman named Jimmy Boree built a hospital & church for the community and bought a large farm equipped with first class steers. He would truck his place from Lashburn with a team of horses & teams of oxen which I tied behind the house loads about once a week.\n\n29. How often did you shop in the early days? Made over $20 a day alone.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAlmost 1912. Then you could see quite a number of cars. In 1915 you hardly ever saw an ox in town. Mr. Bailey used to drive out in a buggy to attend services on Sunday that were held.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the \"phone\" period.\n\nI did very little business with mail order houses. We had good stores at Lashburn organized a fine Co-op. store which is still going strong.\n\n32. When did you first have a telephone and what company provided it?\n\nNever had one at Lashburn.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came intending to stay and am glad I did. Am very comfortable now in Vancouver.\n25. When was the first car used in the community? about 1912\n\n26. If you owned a car before 1914, when did you buy it? What make? Model T Ford at N. Battleford 1913. I moved to N. Bagg & Sons the money agency 1912.\n\n27. Where was your trading center? How far from your home? Up to 1912 it was at Lashburn 2 miles north.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). No change except that Lashburn got to be quite prosperous. A wealthy Englishman named Jimmy Bruce built a hospital & church for the community and established a large farm equipped with pure bred stock. I traveled back to this place from Saskatoon with a team of horses & teams of oxen which I tied behind the house load.\n\n29. How often did you shop in the early days? I made over $10 a day alone about once a week.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Almost 1912. Then you would see quite a number of men. In 1915 you hardly ever saw an ox in town. Miss Folley used to drive out in a buggy to attend services on Sunday that she held.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. I did very little business with mail order houses. We had good stores at Lashburn organized a fine Co-op there which is still going strong.\n\n32. When did you first have a telephone and what company provided it? Never had one at Lashburn.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? I came intending to stay and am glad I did. Am very comfortable now in Vancouver.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few for various reasons. I took the marry Harris Agency at M. Balliford in 1912.\n\n35. Did many people move away during the 1930s? Did many return?\n\nI don't think there was any moved then.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI always helped to promote anything that I thought would help to the district such as agricultural organizations at Larkspur. I won prizes for grain growing, was close to George Wheeler when he won at the county fair. I won the B of Commerce medal and award in 1918 at Larkspur. My sample was sent to Regina. I think it was placed 5th. Am not quite sure of the year. Helped to promote Cold Pool.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nDon't know much about this.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI haven't anything suitable for this.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne Son announcer for Radio Station at Victoria B.C., & one grandson at school.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nFrom farming with oxen and walking plows to tractor farming of the present. I ended up on a farm at Turtleford where myself and one man harvested the crop with a combine. Hauled by one man & I hauled the grain to market with a Gordon tractor & trailers having one while the other was being filled.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nFred Townley Smith, Saskatoon. Expect you have him.\n\nMr. Josh Greaves 2155 Waverley, Burnaby, B.C. This man wrote a number of interesting articles (that I think he has copies of) about early days at N. Battleford experiences.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_815.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 12, "total-input-tokens": 20472, "total-output-tokens": 4354, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1681, 3], [1681, 4118, 4], [4118, 5746, 5], [5746, 7159, 6], [7159, 9378, 7], [9378, 11307, 8], [11307, 13232, 9], [13232, 14741, 10], [14741, 16418, 11], [16418, 16418, 12]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false]}}]