[{"id": "414b96887197f0f750fca569859f665c3165fe48", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA SET OF QUESTIONNAIRES TO BE SENT TO EVERYONE WHOSE NAME APPEARS ON THE SASKATCHEWAN ARCHIVES LIST OF PIONEERS\n\nIt is difficult to reproduce a general questionnaire on pioneer life because no individual who has lived in Western Canada for more than twenty-five years will have had exactly the same experiences as another. Some of the questions here will not apply to pioneer experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If possible, try to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be still living there today. If you have personal experiences of the pioneer era which you would like to share with others, please complete this questionnaire.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nSaskatchewan Archives Board, No. 1, entitled \"Pioneers' Plata Wt. Dld.\"\n\nWestern Canadian Pioneers' Plata Wt. Dld. is still being circulated, and we would be glad to receive any completed questionnaires. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below:\n\n- Pioneer health conditions\n- Pioneer social life\n- Pioneer sports and recreation\n- Pioneer business and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: LILIAN SCOTT\n\n2. Your address: MA NO R\n\n3. Date: April 9th, 1952\n\n4. Where were you born? (Give name of place and country) FENELON TOWNSHIP, ONTARIO\n\n5. What was your father's name and occupation? JAMES RUSSELL SCOTT\n\n6. When did you come to Saskatchewan? March 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not or you may say \"I was a small child.\"\n\n9. What were your reasons for coming West? The family had all come west; it looked like an adventure.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nIt seems looking back, what we had always known of it, some neighbors & relatives were here.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: J. L. Scott\n\n2. Your address: MA No. 18\n\n3. Date: April 9th, 1943\n\n4. Where were you born? (Give name of place and country)\n\nFENELON TOWNSHIP, ONTARIO\n\n5. What was your father's name and occupation?\n\nJAMES RUSSELL SCOTT\n\n6. When did you come to Saskatchewan? (Give month and year)\n\nMarch 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n\nLived in Ontario where born until finished public school then attended school in London, Ont. (Gave name of school)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this if you are under 18 years of age.)\n\nI was in my teens, probably nearly 20 years old.\n\n9. What were your reasons for coming West?\n\nThe family had all come west; it looked like an adventure.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nIt seems looking back what we had always known of it, some neighbors' relatives were here.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nI think it was considered the right thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other)?\nI traveled by myself.\n\n13. What means of transportation did you use? C.P.R. train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the trail, etc.)\nI cannot remember any striking incidents except a feeling of wonder when we saw the level country, a joy in the ride around Lake Superior.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWith my people in M.0.080 Minn.\n\n16. Where did you settle or take up land? My brothers took up land in the east of the Moose Mountains.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nI lived in Regina while attending school. I taught school four miles south of Calgary for one year and near Preston, Manitoba for two years.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nFor three years, by teaching school.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nI think it was considered the right thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nTravelled by myself.\n\n13. What means of transportation did you use? C.P.R. Train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.)\n\nI cannot remember any thrilling incidents except a feeling of wonder when we saw the level country, a joy in the ride around Lake Superior.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWith my people in Moosomin.\n\n16. Where did you settle or take up land?\n\nAnthemiet of the Moose Mountains.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived in Regina while attending school. I taught school four miles south of Calgary for one year and near Preston, Manitoba for two years.\n\n18. How did you earn a living before coming to Western Canada? How much money?\n\nFor three years, by teaching school.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle. I do not think so, not to stay a few came to visit.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nMy immediate family moved a brother & sisters, mother's sister & her family came to Saskatoon a few years before I did. I came at my MANOR.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe have experienced cold winters, bad storms, hot summers, drought years & plentiful grass prairie fires etc., like all others who have grown up here. We have a special feeling, but I do not know what it was a special feeling.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often?\n\nI traveled to my school and home for holidays. Each an occasional trip to Brandon or Winnipeg that was by train.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many came?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nMy immediate family, mother, brothers & sisters,\n\nmother's sisters & her family came to Saskatchewan\n\na few years before I did. I came at age MANOR.\n\n23. In there any particular experiences of pioneer days that stand out in your memory which you would like to record?\n\nWe have experienced cold winters, hot summers, drought years & plentiful grass, prairie fires etc., like all others who have given Saskatchewan fifty years, but I do not know if they were typical.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? Or what kind of travel?\n\nI traveled to my school and home for holidays. That was by train!\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days? \n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order.\n\n33. When did you move to Saskatchewan? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Are you now intending to stay?\n25. When was the first car used in the community? \n\n26. If you owned a car before 1924, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\n29. How often did you shop in the early days? \n\n30. On Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district earlier than 1920? What reasons did they have for moving?\n\nSome people got their homesteads and sold out or went away.\n\nThey really did not want to farm.\n\n35. Did many people move away during the 1930s? Did many return?\n\nYes. Others came but the farms are larger now.\n\n36. If you or some member of your family have held public office, or have been active in any organization, name it here giving dates whenever possible.\n\nWe have held offices in church organizations as well as local townships. We have held offices of provincial councils. We have been members of municipal councils. We have been members of local district boards.\n\n37. If you or some member of your family or friends were willing to have or do something for the first automobile, combine giving dates whenever possible.\n\nMy aunt and uncle were the first to own a car.\n\nMy mother and father were the first to own a bicycle in Manor 1902. My brothers always about the first to try out new kinds of wheat.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name origin and (2) reason for adoption.\n\n(1) Name origin: The first name was given by the first settlers who all had farms there.\n\n(2) Reason for adoption: The first settlers named it after their families.\n\n39. Did the South African War 1900-1902 affect your community?\n\nThe South African War 1900-1902 affected our community.\n\nCANNINGTON MANOR was named after the English colony that settled there early in the 1880s.\n35. Did many people move away during the 1930s? Did many return?\n\nYes. Others came back but the farms are larger now.\n\n36. If you or some member of your family have held public office (either at the local, county, state, or national level), please list all offices held and the dates of service.\n\nWe have held offices in church organizations, town hall meetings, and various other positions.\n\n37. If you or any of your family members were involved in any community or charitable organizations, please list them here giving dates wherever possible.\n\nMy mother was involved in the first grade teacher's association. My father was involved in the local volunteer fire department.\n\n38. How old are the places in your community? Give their names (school districts, post offices, etc.), the date they were established, and the reason for establishment.\n\nWAUHOP was named after the Waugh family. REDVERS was named after the Redvers family. MANOR was named after the Manor family. CANNINGTON was named after the Cannington family.\n\n39. How did the places in your community get their names? (School districts, post offices, etc.)\n\nWAUHOP was named after the Waugh family. REDVERS was named after the Redvers family. MANOR was named after the Manor family. CANNINGTON was named after the Cannington family.\n\n40. How did the places in your community get their names? (School districts, post offices, etc.)\n\nWAUHOP was named after the Waugh family. REDVERS was named after the Redvers family. MANOR was named after the Manor family. CANNINGTON was named after the Cannington family.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nHave there been photos belonging to Mr. Russell White\n\nWould you lend them to the archives? If so, how?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe changes that have made most difference are:\n\n- Improved road means for everyone (quality)\n- Hydro\n- Town's big engines & machinery on the farms\n- The latter causes bigger farms & fewer neighbors\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of old letters, old photos and photographs, written recollections and reminiscences? (Describe).\n\nHave you ever belonged to any organization? If so, what was it?\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your reference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since first came West?\n\nThe changes that have made most difference are:\n\n- Improved roadways for everyone, especially those living in town\n- Big equipment and machinery on the farms\n- The latter came too big for many farmers\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_616.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4208, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1921, 5], [1921, 1921, 6], [1921, 2755, 7], [2755, 4073, 8], [4073, 5192, 9], [5192, 6322, 10], [6322, 7501, 11], [7501, 8586, 12], [8586, 9349, 13], [9349, 10017, 14], [10017, 10017, 15], [10017, 10017, 16], [10017, 11612, 17], [11612, 13183, 18], [13183, 13914, 19], [13914, 14892, 20], [14892, 15056, 21], [15056, 15210, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]