[{"id": "1740e2b18935a30318a4505e122af756dd5764db", "text": "Name: Mrs. Henry L. Ross\nAddress: Kipling, Sask., R.R. 3\nBirthplace: Boulder, Ont., Hamilton, Hastings County\n\n1. INTRODUCTORY QUESTIONS\nWhat year did you start homesteading in eastern Canada? 1912\nWhere did you get your homestead? Smithville, Sask.\nWhere had you been living before that? Unknown\nFor how many people did you prepare meals? 4\nHow far was it to your nearest store? 5 miles\nHow often could a visit be made to the store? Usually once a week\nWhat groceries did you usually buy in those earliest years? Sugar, flour, tea, coffee, syrup, coal oil, oatmeal, baking powder, baking soda, green tea, castor sugar, black tea.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\nWhat brand of white flour did you use in the early years? First Roses and Redwood\nIn what quantities did you buy it? Usually two or three hundred lbs.\nWhat was the usual price per hundred pounds of white flour? 2.50\nHow much did you use rather flour? Not at all\nWhole wheat flour? A few yrs later by the half bag\nWas flour milled locally? No\nHow far away? What year?\nWhat was the price for a twenty pound bag of rolled oats? 85¢\nWhat other grain products did you use? Have used cracked wheat for porridge\nCornmeal? 10 lb. Bag\nWhole wheat? Farina?\nOther?\nDid you grind your own wheat for porridge? Yes\nHow did you grind it? By putting it through the chopper about twice for porridge about four times for graham or whole wheat flour.\nInterview with Mrs. Henry\nKipling, Oklahoma\n\n1. Personal Information\n   - What year did you start teaching?\n   - How old were you when you started teaching?\n   - Where did you grow up?\n   - How many people did you serve in your school district?\n\n2. Food and Drink\n   - What was the most popular food item at school?\n   - How often did you have lunch breaks?\n   - What was the most common breakfast item?\n   - What was the most common dinner item?\n\n3. Community Involvement\n   - Did you participate in any community activities?\n   - How did you get involved in these activities?\n   - What was the most memorable event in your community?\n\n4. Challenges\n   - What were the biggest challenges you faced as a teacher?\n   - How did you overcome these challenges?\n\n5. Advice\n   - What advice would you give to current teachers?\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Usually 50 lb. bag.\n\nWhat was the price for a ten pound sack of white sugar? $1.00.\n\nWhat brand of golden corn syrup did you use? A brand I can't remember.\n\nWhat size of tin of syrup did you usually buy? 25 lb. wooden keg.\n\nAt what price? Do not remember price. But it was good.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? From the cows.\n\nSet milk pans, let cream rise overnight, skim, heat slowly.\n\nButter? Churned.\n\nWhat was the price of butter? Twenty cents.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nDid you make cheese? Dutch cheese.\n\nWhat kind of cheese? Dutch cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Pork or beef and chicken.\n\nHow did you get fresh meat? Freeze it for winter use.\n\nDry salted at home.\n\nHow often did you get fresh meat? Just when you killed.\n\nHow did you preserve meat? By dry salting, smoking, with chips.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized? Towns are the closest 10 miles.\n\nDid you use game? Yes.\n\nWhat kinds? Ducks.\n\nFor how long? Just in fall, early winter.\n\nWhat part did fish play in the family diet? Catch the odd fish from some of the lakes. Bought some too.\n\nWas the fish fresh, cured, or canned? Fresh in the beginning.\n\nKinds? White fish, caught from the lakes.\n\nUsually pack fish we bought, or usually canned some.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Red Rose. At what price? 3 lb. for $1.00.\n\nWhat kind of coffee did you buy? (beans or ground) Ground. Price? \n\nThat other beverages were used? \n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nCould you get potatoes at the store? \n\nIf not, where from? Usually from a neighbor.\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1914\nCabbage Bought\nCarrots\nOnions\nTurnips\nBeets\n\nIn what quantities did you buy white navy beans? 5 oz., 10 lb., 25 lb.\n\nHow did you buy prunes, (in bulk or by the box)? Box\n\nWhat weight? 20 lb.\n\nHow did the grocer handle prunes (by box)? Bulk\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nSome yes, then no, some\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods? Apples\n\nWhat year did you first preserve fruit by canning? 1913\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning? 1918 or 1920\n\nDo you still preserve foods by canning or drying? By preserving\n\nBut not by drying\n\nTo what extent? Usually plan about 175 qts of fruit, some vegetables\n\nDid you make your own vinegar? Try mother and I\n9. Please fill in the following to the best of your ability:\n\n| Food                  | Year you first remember seeing it in the store | How can it sold? - In bulk, 10 lb., snack, can etc. | At what price usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|-----------------------------------------------------|------------------------------------------|---------------------|\n| Soda biscuits         | 1915                                          | 30¢                                                | 1 small box                              |                     |\n| Sugar                 |                                               |                                                     |                                          |                     |\n| Graham flour          | 1920                                          | 10 lb. bag                                         | 10 lb. Bay                               |                     |\n| Brown sugar           | 1910                                          | in bulk                                            | 5 lb. lot                                |                     |\n| Molasses              |                                               |                                                     |                                          |                     |\n| Table salt            |                                               |                                                     |                                          |                     |\n| Common salt           |                                               |                                                     |                                          |                     |\n| Lily white syrup      | 1920                                          | pails                                              | 10 lb. pail This was good                |                     |\n| Toilet soap           | Castile                                       | Bars                                               | 3 for $2.50                              |                     |\n| Baking powder         | 1912                                          |                                                     |                                          |                     |\n| Baking soda           |                                               |                                                     |                                          |                     |\n| Dried peas            |                                               |                                                     |                                          |                     |\n| Dried corn            | Dark 1912                                     | 10 lb.                                              | ½ gallon                                 |                     |\n| Wine or Dark          |                                               |                                                     |                                          |                     |\n| Raisins - seeded      | 1915                                          |                                                     |                                          |                     |\n| Seedless              | 1920                                          |                                                     |                                          |                     |\n| Rice                  |                                               |                                                     |                                          |                     |\n| Currants              |                                               |                                                     |                                          |                     |\n| Store jam - kinds?    | Raspberry, strawberry, mixed                  |                                                     |                                          |                     |\n| Cheese (Cheddar or store cheese) | 1907                                      | in slabs                                           | 3 ½ 4 lb.                               |                     |\n| Vanilla               |                                               |                                                     |                                          |                     |\n\n10. Baking\n\nWhat type of yeast did you use? Compressed yeast cakes 5 to 6 oz.\n\nDid you make yeast for your own use? Yes\n\nUsing starter? Yes and without\n\nUsing hops? No\n\nSalt rising? No\n\nDid you buy baking powder? Yes\n\nBaking soda? Yes\n\nCream of tartar? Hot water\n\nDid you make your own baking powder? No\n| Item                  | Price |\n|-----------------------|-------|\n| Soda Mix              | $1.75 |\n| General               | $1.20 |\n| Graham flour          | $1.10 |\n| Brown sugar           | $1.60 |\n| Table salt            |       |\n| Dressed salt          | $1.90 |\n| Lily white arrow      | $1.90 |\n| Toilet soap           | $1.90 |\n| Solder solder         |       |\n| Bread rolls           |       |\n| Bristol corn          | $1.90 |\n| Whirlpool             | $1.90 |\n| Mariana - scratch     | $1.90 |\n| Sour cream            |       |\n| Store jam - kibbles   |       |\n| Cheese (Cheddar)       | $1.90 |\n| or store cheese       |       |\n| Vanilla               |       |\n\n10. BAKING\n\nWhat type of yeast did you use? **tempura**. Yeast cake 5 lb. box.\n\nDid you make yeast for your own use? **yes**. Using starter? **yes**. Using rising? **no**.\n\nDid you buy baking powder? **yes**. Baking soda? **yes**.\n\nDid you make your own baking powder? **no**.\n\nOrigin of tartar? **hot water**.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product |\n|-----------------------------|----------------------------------------|-------------------------------|----------------------------------------|\n| Canned salmon               |                                        |                               |                                        |\n| Canned sardines             |                                        |                               |                                        |\n| Other canned fish that appeared early - Give names | | | |\n| Apples - fresh              |                                        |                               |                                        |\n|                             | dried                                  |                               |                                        |\n| Lettuce                     | 1920                                   |                               |                                        |\n| Tomatoes - fresh            |                                        |                               |                                        |\n|                             | canned                                 |                               |                                        |\n| Bananas                     |                                        |                               |                                        |\n| Lemons                      |                                        |                               |                                        |\n| Oranges                     |                                        |                               |                                        |\n| Cornflakes                  |                                        |                               |                                        |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                        |\n| Minuto tapioca              |                                        |                               |                                        |\n| Sago                        |                                        |                               |                                        |\n| Dates                       |                                        |                               |                                        |\n| Walnuts                     |                                        |                               |                                        |\n| Icing sugar                 |                                        |                               |                                        |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, slough, dugout) \n\nHow far was this water from your house?\n\nHow was it brought to the house? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nIn 1913 we had a covered in well about 4 ft from the house. This went dry. In 1915 we dug one about 4 rod from house. Drainage from a slough. This meant a lot of carrying water uphill both for the house and for the stock; and in 1946 we dug a well right by the Barn having water pumped into the Barn.\n11. PLACES FILLED IN\n\n| Item          | Year |\n|---------------|------|\n| Canned apples |      |\n| Other canned  |      |\n| Club tea      |      |\n| Canned corn   |      |\n| Apples - fresh|      |\n| Apples - dried|      |\n| Lettuce       | 1920 |\n| Tomatoes - fresh | 1920 |\n| Tomatoes - canned | 1920 |\n| Bananas       |      |\n| Lemons        |      |\n| Oranges       |      |\n| Cornflakes    |      |\n| Other preserved breakfast cereals |      |\n| Porridge      |      |\n| Minute tapioca|      |\n| Sugo          |      |\n| Dextar        |      |\n| Halibut       |      |\n| Ice cream     |      |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (cistern, river, dugout)\n\nIf so, how was this water from your house? (pail, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nFirst started homesteading, living dates where possible.\n\nThis next day 1913 we had a covered in well about 4 ft from the house.\n\nDrainage from a slow, Ohio River and a lot of carrying water up hill both in the house and in the stock, and in 1948 we dug a well right by the Barn heavy water pumped into the Barn.\n6.\n\n12. Games:\nDid you buy lottery tickets or make your own? Yes or No?\nIf so, did you win? Yes or No?\n\n11. Fuel:\nThat fuel did you use in the winter last year? (Specify)\nWhere did you get your fuel? (Specify)\n\n10. Did you have any chances in the use of fuel? Which have taken place since you first started housekeeping? (Specify dates where possible.)\n\n9. When we first moved into this house, we used wood for cooking and heating. Now they use coal. We still burn wood in the summer. In winter, we still burn wood in the range also some coal. In the fall we burn coal.\n\n8. Methods of取得和使用能源:\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? (Specify dates) Yes or No.\nDid you use an outdoor fireplace or bake oven? (Specify dates) Yes or No.\n\n7. By whom was your first cook stove made?\nThat year it was purchased from: (Specify)\n\n6. For preparing food? (Specify, such as gas, electric, wood, etc.)\nWeather: Winter, Summer, Fall, Spring\n\n5. Altitude? (Specify)\n6.\n\n13. What was your first experience with electricity? How did it change your life?\n\n14. Fuel:\n   - What fuel did you use in your home when you moved in?\n   - Did you have any chance to use any other type of fuel?\n   - When we first homesteaded, we used wood for cooking and heating.\n   - In winter, we still burn wood in the stove.\n   - For summer, we use a wood stove.\n   - We also use a wood stove in the fall and spring.\n\n15. Methods of Cooking:\n   - For cooking, did you use an indoor fireplace or open hearth in the earliest days?\n   - Did you use an outdoor fireplace or bake oven? (Give dates)\n   - By whom was your first cook stove made?\n   - What year was it purchased?\n\n16. Additional Information:\n   - For your marriage date (if applicable), give the reason behind it.\n   - Any other information you would like to add.\n\nDate: 1978-02-14\n16. **SNAPPELUS AND OTHERS**\n\n   Sandman can be purchased at your local store. It is a good source of protein.\n\n   Shortly before the fall, sugar, fruits, and vegetables were in bulk in a container.\n\n   The next day, they became out of date. We bought them out on sale. If I make\n\n   on the stove, they will also go bad. This happened to me in 1918.\n\n   Now to try all these things on an empty stomach.\n\n17. **Give a Typical Day's Menu (Breakfast, Dinner, Supper)**\n\n   For the entire family, give the year and the month or the family\n\n   with their ages at the time. State the approximate number of guests,\n\n   or number.\n\n   The earliest I can remember after we came west, 1903 August\n\n   was the same. Present at breakfast, potatoes, bacon, eggs,\n\n   milk, coffee, tea, bread, butter, jam, applesauce, and apples.\n\n   Lunch was usually meat, potatoes, beans, and apple pie.\n\n   Dinner was usually meat, potatoes, beans, and apple pie.\n\n   Supper was usually meat, potatoes, beans, and apple pie.\n\n   A typical lunch would have been:\n\n   - Meat: Roast beef\n   - Potatoes: Mashed\n   - Beans: Boiled\n   - Applesauce: Homemade\n   - Apple pie: Fresh\n\n   A typical dinner would have been:\n\n   - Meat: Roast beef\n   - Potatoes: Mashed\n   - Beans: Boiled\n   - Applesauce: Homemade\n   - Apple pie: Fresh\n\n18. **Local Produce**\n\n   Locally produced tomatoes? Give details.\n\n   But after we came\n\n   down to the mountains to homestead, we knew what vegetables\n\n   at that time. There was no store, just Barbersville, and we bought\n\n   from a neighbor. In times of shortage, if they didn't have any\n\n   could always rely on a pot of potatoes or butter for preserving.\n\n   From the garden, we could get out of a piece\n\n   of rag with some yellow in a dish and keep a tight lid. This\n\n   was a chance to get to town, so you could make jam or\n\n   It wouldn't last long from the door.\n\n   It would not last long from the door.\nBriefly describe food or things you ate in Butte in a sentence.\n\nYour diary began out on May 15th. What was your dinner like? How did you feel?\n\nGive a typical day's menu (breakfast, dinner & supper) for the week.\n\nYour diary can recur at any time. Give the approximate date, month, year.\n\nThe earliest I can remember after we came west in 1903 August\n\nWe used to have breakfast, lunch, dinner, and bedtime snacks.\n\nBreakfast included toast, bacon, eggs, and milk.\n\nLunch was usually sandwiches, soup, and fruit.\n\nDinner typically consisted of meat, vegetables, and potatoes.\n\nSnacks included crackers and cheese.\n\nWe rarely had dessert, but sometimes had apple pie.\n\nWas there ever a time when you went without food? If so, how long did it last?\n\nDid you ever go to a school that didn't have enough food? If so, what was it like?\n\nDid you ever have to go to bed hungry? If so, how often did it happen?\n\nWould you describe your childhood as happy or sad?\n21. When did you begin to rely on purchased foods instead of raising them at home? (Give as many details as possible.)\n\n22. Please add other details from your early experiences of buying groceries and other items. Include things not mentioned above, such as quality, methods of purchasing, prices paid, and other details. Use book of Pioneer Life, pages 47-48.\n\nThere is quite a bit concerning pioneer days of the west which the generation that has already passed on could not have been better than we can. The hardships, the loneliness of homestead days, the bucking up of the land, the pioneer fires which swept through, the privations which could not be helped. No man when they were badly needed depending on me experienced fire wives to see the Indians through. Sorry I took 40 miles with grain, bringing back provisions to get out a couple of months, getting along as best they could without any of the comforts which we knew today.\n\nThe true cattle range, he farms, he heard about then. The children's schooling, having very little chance of even a public school education. The generation of today will\nThere is quite a bit concerning pioneer days of the west.\n\nwhich the generation that has already passed on could not have been better than we can. The hardships, the loneliness of homestead days, the breaking up of the land, the prairie fires which swept through, the privations which could not be helped. In the winter when they were badly needed.\n\ndepending on a map of the area, they were badly needed.\n\nprovision to get out a couple of months' getting along as best they could without any of the comforts which we know today.\n\nfor our cattle range, no fences, no roads, no railroads.\n\nthe children's school just barely having any little chance of even a public school education. The generation of today will\npaying the price of pioneer days having had\nso opportunities which are so essential today, yet\nwe managed to navigate without much education.\nToday you can't get by unless you have a\ngrade twelve, and what is suffering more than\nthe farms? Still we were just as happy, just as\ncontented as the ones who knew nothing of the pioneering\ndays.\npaying the price of pioneer days having had its opportunities which are so essential today, yet we managed to navigate without much education. Today you can't get by unless you have a grade twelve, and what is suffering more than the farms? Still we were just as happy, just as contented as the ones who know nothing of the pioneering days.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_319.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5372, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1398, 3], [1398, 2219, 4], [2219, 3673, 5], [3673, 3673, 6], [3673, 5076, 7], [5076, 5076, 8], [5076, 9884, 9], [9884, 10877, 10], [10877, 14469, 11], [14469, 15600, 12], [15600, 15600, 13], [15600, 15600, 14], [15600, 16595, 15], [16595, 17446, 16], [17446, 19360, 17], [19360, 20315, 18], [20315, 21425, 19], [21425, 22137, 20], [22137, 22477, 21], [22477, 22817, 22]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]