[{"id": "267e3f49868347b09b34af78b82100da4d7acedc", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name Wellwood Scott Rattray\n\nPresent Address Preeceville, Sask.\n\nPioneer Address Asineboia N.W.T.\n\nYear you came to Saskatchewan 1867.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Eight or ten\n\n   How many of these were bachelor's homes? Very few. Most people were married.\n\n2. How often did you usually visit neighbors? Any time we felt like it.\n\n3. Did you usually visit on a Sunday, or other days? Sunday mostly.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Without invitation. We lived in early days like one big family, nobody locked a door, that was held as an insult, as we were all in same boat.\n\n   What time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? Afternoon, or evening.\n\n   What about meals? Did you stay when not invited beforehand?\n   Always had tea before we left, and the same with our house.\n\n   How was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Usually, dinner or ready.\n\n   If no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Always a cup tea bread and good butter or milk if children.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? If family small and children, all went.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, helped to build barn etc., or help out in any case where help was needed.\n\n   Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n   Helped to put in a farmer's crop when he was not able.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. No cards, but we danced till daylight went in sleigh box with plenty of hay, and blankets. This was one of the big nights for the young, and NO drinking, so there was very little to be had, that might be the reason, but I have known of girls turning the boy down if he had had a drink of beer, but today it is a must.\n\n   Were these more frequent in later years? Give dates. No, they were part of the early life of the young, and the old folk went along to talk over their crops etc.\n\n   Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, and time was the time.\nPIONEER RECREATION AND SOCIAL LIFE\n\n1. In the first ten years, how many homes were near enough to you for visiting back and forth? Eight or ten? How many of these were bachelor's honest? Very few. Most people were married.\n\n2. How often did you usually visit neighbors? Any time we felt like it.\n\n3. Did you usually visit on a Sunday, or other days? Sunday mostly.\n\n4. Were you often invited to other homes, or was not visiting done without an invitation? Without invitation. We lived in early days like one big family, nobody looked a door, that was held as an insult, as we were all in same boat.\n\n5. What time of the day did you go? - In the morning and spend the day, or in the afternoon etc.? After noon or evening.\n\n6. What about meals? Did you stay when not invited be forwarded? Always had tea before we left, and the same with our house.\n\n7. How was the invitation to a meal, worried when people had come unexpectedly? (That is, was the term to make petticoat used, or was some other expression common?) Usually dinner or \"ready.\"\n\n8. If no meal, what other refreshment might be offered to visitors who had dropped in? Always a cup tea bread and good butter or milk if children.\n\n9. Told the whole family go, or did someone stay home to \"clock after the pleasure\"?\n\n10. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Ten helped to build barn etc., or help out in any case where help was needed.\n\n11. Tell what you remember about such gatherings, fixing dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n12. Helped to put in a farmer's crop when he was not able.\n\n13. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. No end, but we danced till daylight went in slept box with plenty of hay and blankets this was the only way to keep nights for the young and so drinking, as there necessary like it to be had, that night be the reason but I have known of little turning the boy down if he had had a drink of beer but today it is a must.\n\n14. Were these more frequent in later years? Give dates. No they were part of the early life of the young and the old folk went along to talk over their crops etc.\n\n15. Did you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc., and when was the time.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nThe school was used at times, but the private was the place. From 1887 on.\n\nHow much of your social life was centred around the school, and within the school district? Describe. Not much.\n\n9. When was your first community hall built? About 1889 in Village of Saltcoats.\n\nWhat material was it made of? lumber\n\nHow large was it? guess, 60 x 90.\n\nWho built it - the community through special funds, the municipality, some organization, etc.? Mostly local help by everybody and it was used for Years.\n\nMany high class players came out to help us and there were many English families who were good at plays etc., and we had an orchestra of violins.\n\nWas it built in the village or town, or was it a country hall? Town but Country used it also.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) Took place of everything except the private house dances.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nUsually they did.\n\nHow were babies and small children provided for?\n\nIn the Hall were rooms for the children, and always ready hands with the elders to see that the young had a good time.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nOn farms O.K., in Village livery barns.\n\n11. What card games were popular in the early days? Not much.\n\nHas there card playing for a prize? No.\n\nWhat dances were popular? Square, Folks, Waltz, bon-ton, and English dances.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNever, it was the only amusement that seemed to suit the majority.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. There were some who thought the devil was in cards, but not to a point that it interfered with anyone.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Check all that apply.) Church, town hall, schoolhouse, private residence.\n\nThe school was used at times, but the private was the place, from 1937 on.\n\nHow much of your social life was centered around the school, and within the school hallways? Describe how, who, when.\n\n9. When was your first community hall built? About 1929 in Village of Saltboats.\n\nWhat material was it made of? Timber\n\nWho built it - the community through special funds, the municipality, area organization, etc.? Mostly local help by everyone, and it was used for years.\n\nHow high did it rise? It was probably 20 feet high.\n\nWas it used for other purposes besides meetings? Yes, for parties, dances, and other gatherings.\n\nWas it built in the village or town, or was it a country hall? Town but Country used it also.\n\nTo what extent did it take the place of homes or the school house in a plane for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house or were you close enough to come to the hall in town for other functions?) Took place of everything except the private dance halls.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as usually they happened), did the entire family attend?\n\nHow big were the halls? Small children provided for?\n\nHow many were there for the children, and always ready hands with the elders to see that the young had a good time?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nOn farms O.K., in Village livery barns.\n\n11. What card games were popular in the early days? Not much.\n\nHas there card playing for a prize? No.\n\nWhat dances were popular? Square, Polka, Waltz, bon-ton, and English dances.\n\nWas there ever any disagreement to teen dancing and non-dancing? Yes/No\n\nWas playing of parties and social gatherings? Explain.\n\nNever. It was the only amusement that seemed to suit the majority.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an anti-climactic in the home, or for some family gathering? Explain. There were some who thought the devil was in ours, but not to a point that it interfered with anyone.\n12. What attempts at formality, or \"snobish\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? None whatever, although there were a few who felt they should hold positions above the original settlers, but it caused no trouble.\n\n13. Was the chivaree known in your community? Not to any great extent\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc. In event of sickness the Community were concerned, and willing to help out, building barns and the like was a small matter compared to how barns were built in Eastern Canada, no heavy bush to contend with, but if help was required for some job, there was always plenty of volunteers.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable. Most of our time was taken up with small matters, visitors were always welcome to talk over what was being obtained in other parts of the settlement.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Patrons of Industry, and some talk of the grangers, an organization operating in U.S. at that time, but nothing came of it.\n\nGive the date and reason for it being organized. To talk matters of home life, farming, and weather.\n\n16. Was there a Saskatchewan Grain Growers local in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\nNone that I know of.\n\n17. Was there a Homemakers' Club in your district? Not that I know of.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formalities or \"socials\" do you remember in small towns such as Eatonville? How were they attended? Were there any who felt they should hold positions above the original settlers, but it caused no trouble.\n\n13. Was the optimism known in your community? Not to say great extent.\n\nDescribe what you remember about advancement, telling how common they were, conditions you met with, those who were willing to help out, building barns and the like was generally not concerned, and willing to help out, building barns and the like was no heavy bush to contend with, but if help was required for some job, there was always plenty of volunteers.\n\n14. Describe any other details of activities, parties, etc., that you remember, telling of any clubs or organizations not already mentioned that were popular at parties and give approximate dates whenever you can when these things in visiting or social life became noticeable. Most of our time was taken up with small matters, visitors were always welcome to talk over what was being obtained in other parts of the settlement.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Patrons of Industry, and some talk of the grocers, an organization operating in U.S. at that time, but nothing came of it. Give the date and reason for its being organized. To talk matters of home life, farming, and weather.\n\n16. Was there a Saskatchewan Grain Growers' Local in your community? Be approximate what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization? None that I know of.\n\n17. Was there a Homemakers' Club in your district? Not that I know of.\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of the activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nNone at that time 1887.\n\nWhat means were commonly used by organizations for raising money?\nWaiting for the crop to be harvested.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? None.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\nI remember of only one about 1888.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about? Scenes of other parts of Canada.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? The N.W.M.P. at that time had some exercise equipment as horizontal bar, rings hung from two high poles, swinging by one's hands, these were put up near the school, but not for children, but we used them, and nobody stopped them.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Yes.\n18. How many other organizations that were in existence in your community before 1924, still exist today? If so, list them.\n\n19. What meetings were commonly used by organizations for raising money?\n\n20. What was the crop to be harvested?\n\n21. Were you accustomed to having general information lectures, talks on foreign lands, etc.? How?\n\n22. Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n23. Did you often have magic lantern shows? I remember only one at about 1885. The pictures were the lantern and the slides.\n\n24. What were the slides about? Seen, or other parts of Canada.\n\nCHILDREN'S GAMES\n\n25. What games did boys play in summer? (Baseball, football, marbles, fly kites, etc.)\n\n26. What games did girls play in summer? (Skipping rope, play house, etc.) Yes.\n22. What winter games were played outside - fox and hounds, skating, etc.? The Lake was close to the school, and swimming, bathing, etc. in summer, skating and rowing boat. Mr. Fisher, the section foreman of M.N.R. Railway had one boat. Mr. Fisher was the owner, and they were rigged with sail, and fast. What games were played indoors in winter? Board games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain. Not as a rule.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain. Too busy on farm, gardens, cows, chickens, etc.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe, never heard of any.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. The first day of July was set for the big day, and is maintained to the present. This was held at Saltcoats about 1887, or 1888.\n\nWho organized it? The Village organized it with help of country people. Horse racing, athletic sports of all kinds, hop step jump, high jump, foot races, tug of war, etc.\n\nWas it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For the entire Community. This was long before the City of Yorkton was thought of.\n\nWas it the first picnic held in the community? Yes, I believe it was, and had quite a number of Indians competition for the prizes, horses, and running foot. If not, do you know the date of the first one that had been held?\n\nWhat were the amusements at the picnic you attended (ball games, races, band, etc.)? No baseball then. Running, jumping, pole vaulting.\n\nWhat arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? Farmers brought their own, others purchased from stall on the ground, plenty of real homemade lemonade.\n\nWhat did you have to eat and drink? Lemonade, and mostly tea. Coffee as we know it today was used at breakfast only.\n\nWhat time of the day did it start, and how long did it last? In the long days in Summer it was started early, as soon as the crowd arrived, some with oxen, some with horses.\n22. What winter games were played outside? Fire and housework, skating, sledging, etc.? \n\n23. Was there much like for games? If so, were everyone usually busy with some kind of work? Explain. \n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, or other objects or animals, or games in the snow? Describe. \n\nPIONEER AND SPORTS \n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\n26. Give your name and location. \n\n27. What was the date of the first ball game? \n\n28. What was the date of the first baseball game? \n\n29. What was the date of the first football game? \n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends form smaller groups? Farmers bought their own, others purchased from stalls on the ground. \n\n31. What did you have to eat and drink? Lemonade, and mostly tea. \n\n32. What time of the day did it start, and how long did it last? In the early days, in summer, it started early, as soon as the crowd arrived, sometimes with oxen, sometimes with horses.\n33. Describe any features of this picnic which you remember as outstanding.\n\nTwo old descendants of the Indian tribe each had a racing horse, and when the race was getting under way, they each had a ONE HUNDRED DOLLAR BILL, and was ready to bet on their own horse, but as they were both feeling well I say their cats, were almost unheard of in those days. Then there was another incident of an old descendent of the Indians wanted to race on foot, and man of his age on the ground, stripped off his pants, and was parading around in his underwear, and the crowd got quite kick out of the result of the old man having one too much.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc. Very few, as this day was sufficient to last till the next year.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. Too much of a money-making game now and little in return, skin games to take all they can from unsuspecting public. This game of skinning the public started about 1914, and has grown to be nothing but a huge racket. An English man had a game of dolls mounted on a wire, and made the whole thing himself, bells, dolls, etc., and you paid a small price for 2 or 3 balls, and if you turned the dolls on the wire, you got a cheap shot, and was a \"cook\" from London, and the people kept him busy, a popular fellow, his name was Chas. Saunders, and this was 1888.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Men, jumping, wrestling, boxing, pulling on broom handle, twisting wrists, knocking off hats, two men or boys, this knocking off hats was carried off between dances in Winter, and was enjoyed by all the people young and old.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Cricket as there were many Englishmen in the Community.\n\nWhat year? 1888 How long did it continue? for some Years till the settlement grew, and people had no time to keep it up, it died out.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc. A very little lacrosse was played locally for our own amusement.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). There was none as we had the Lake, but there is a large rink at Saltcoats now, built long after we left those parts.\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nTwo old descendants of the Indian tribe each had a racing horse, and when the race was getting under way, they each had a ONE HUNDRED DOLLAR BILL, and was ready to bet on their own horse, but as they were both feeling well I say their oats, beer, were able to make a good bet. The old man who had the old $100 bill was almost unheard of in those days. Then there was another Indian, an old descendant of the Indians wanted to race on foot, and man of his age on the ground, stripped off his pants, and was parading around in his underwear, and the crowd got quite kick out of the result of the old man having one too much.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc. Very few, as this day was sufficient to last till the next year.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable. Too much of a money-making game now and little in return, skin games to take all they can from the unsuspecting public. This game of skinning the public started about 1914, and has grown to be nothing but a huge racket. An English man had a game of dolls mounted on a wire, and made the whole thing himself, bells, dolls, etc., and you paid a small price for 2 or 3 balls, and if you turned the dolls on the wire, you got a ticket. This man was a society from London, and the people kept him busy, a popular fellow, his name was Chas. Saunders, and this was 1888.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Men, jumping, wrestling, boxing, pulling on broom handle, twisting wrists, knocking off hats, two men or boys; this knocking off hats was carried off between dances in Winter, and was enjoyed by all the people young and old.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Cricket as there were many Englishmen in the Community.\n\nWhat year? 1888 How long did it continue? For some years till the settlement grew, and people had no time to keep it up, it died out.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc. A very little lacrosse was played locally for our own amusement.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). There was none as we had the Lake, but there is a large rink at Saltcoats now, built long after we left those parts.\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1888.\n\nDid it grow out of or replace the earlier community picnic? No.\n\nWho was responsible for starting the first sports day? My Father, Sid Fisher, A.B. Lander, T. Bradford, and many other Citizens of Village, and Mr. Phelps the station agent, Pas. McGrath, Dan Mc. Killip, First Massey Harris Agent, Tom Carleton.\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July first 1888.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates. Except myself, I was the fastest half miler in Western Canada, and took second prize at Regina 1895 against the best half miler in Canada. I have a medal for that race.\n\nRegina was a small place in 1895 but they staged the largest exhibition ever undertaken, called the Territorial Exhibition, with the best foot, and horse ever staged up till that time. I was there.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought and what kind.) (Use extra sheets if necessary)\n\nVery few, as we had a long way to travel from Glasgow, Scotland to Sask. If a neighbor had a good book, it was passed around the Community.\n\nPeople could not lock their doors, so the houses were open, and never heard of petty thieving.\n\nThe R.C.M.P. were stationed at Saltcoats about 1889, or 90. Five or six Police were stationed there permanently.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. No.\n\n46. What books were sent to you as gifts in early years? Very few.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Not in the early days.\n\n48. Was there a school library? No\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material? I believe so.\n7.\n\n50. When did an annual \"sports day\" become established in your community? 1898.\n\nDid it grow out of or replace the earlier community picnic? No.\n\nWho was responsible for starting the first sports day? My Father, Mr. Ed. Fisher, A.B. Landon, T. Bradford, and many other citizens of villages, townships, and cities.\n\nStation meetings, horse races, and other events were held at various times during the year.\n\n51. Are there any from your community who have become members of well-known hockey ball or other teams? Give names and dates. Except my girl I was the first assistant to be elected to the Board of Directors of the Edmonton Hockey Club.\n\nReading was a small place in 1896 but they staged the largest exhibition ever undertaken, called the territorial exhibition with the best food and horse races ever seen up till that time.\n\n42. What books did you bring with you when you came west? (Give a list of the names and numbers if possible.) If not listed, as nearly as you can remember.\n\nEvery family had a good book. It was passed around the community.\n\nIf you could not read, you would lock your door so the houses were open and never heard of the G.M.P. More stationed there permanently.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. No.\n\n46. What books were sent to you as gifts in early years? Very few.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. Not in the early days.\n\n8. Was there a school library? No\n\nWhen was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school textbooks as additional reading material? I believe so.\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n   There was no library except in later days.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? We took what was called \"The Farmers Advocate\" a yellow covered magazine, that was the only farm paper I remember. Later we took the Family Herald and weekly Star.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. Only reason was short of the price.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   I have thousands of clippings of most any event of importance.\n   I picked up a quantity of letters near the old Fort Pelly many years ago, gave some of them to Police, to Yorkton, and they are preserved I believe in Regina. These papers were scattered about the old Fort what it was abandoned by H.B.Co.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. I was over 60 Years of age before I seemed to have time to read, since 1918, I have read a good deal, and at age of sixty took up poetry as a hobby, I will enclose a few.\n50. You have ever been a community library in your district or county?\n   When was it started?\n   In it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\nThere was no library except in later days.\n\n51. That newspapers or magazines did you subscribe to when you first came to us? We took what was called \"The Farmers Advocate\" a yellow covered magazine, that was the only farm paper I remember. Later we took the Family Herald and Weekly Star.\n\nDescribe later changes in your subscriptions, telling why you stopped certain subscriptions and added others, only reason was short of the price.\n\n52. Did you ever obtain the free monthly Lady Aberdeen Magazine of reading material? No.\n\nGive dates and tell how and where you got them.\n\n53. What books or papers that you brought to the west with you do you still have?\n   I have thousands of clippings of most any event of importance. I picked up a quantity of letters from the old fort fairly many years ago, gave some of them to Polk, Leota, Yorkeon, and they are preserved by H.B.O.C.\n\n54. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain. I was over 60 years of age before I seemed to have time to read, since 1918 I have read a good deal, and at age of 81 I look for poetry as much as anyone else.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? None.\n\n57. What instruments did any of your neighbors have? None, except the odd mouth organ.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. I bought a violin have played in orchestras a leading part, BY EAR, I do not know a note of music and still play at dances.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. My Sisters and myself were called to every concert that took place in the District, and that goes for many more.\n\nin the community? (were there musical concerts, was there group singing at parties, etc.) Describe. No.\n\n60. What were some of the favorite songs in the home? The old songs, there were none of the trash that is heard today.\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. English, and Scotch were the songs used.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. I have a song copyrighted, and am on the road to do some more, beyond this I do not know of any other that was done.\n\n63. Was there a band in your community? no, 1887. When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nWhere we live now, Freeceville, there was a band some years ago, but is all broken up. It was complete with all instruments, Mr. Joyce was the conductor, and manager of the bank, he was moved and the band broke up. There were about 50 members. I understand the instruments are still here, but people too busy making money to worry about this business, and that is to some extent the condition we are in today.\nMUSICAL ENTERTAINMENT.\n\n95. What musical instruments did you bring with you? None.\n\n57. What instruments did any of your neighbors have? None except the old mouth organ.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. I bought a violin have played in orchestra in a leading part, but I do not know its make and still play at dances.\n\n59a. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe by sisters and myself we called to every concert that took place in the district, and that goes for many more.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe. No.\n\n60. What were some of the favorite songs in the home? The old songs; there were none of the trash that is heard today.\n\nIn the community?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your town or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. I have a song copyrighted, and on the road to do some more, beyond this I do not know of any other that was composed.\n\n63. Was there a band in your community? no. When was it started? Who started it? How long did it continue?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members still living, what events the band played for.\n\nIf you still have your instruments, Mr. Joyce was the conductor and manager up, it was complete with all instruments. Mr. Joyce was the conductor and manager of the band, the instruments are still here, but people go to see me now.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. No.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change? Less important, as one has to spend plenty of money to break the barriers in the modern game, and the so-called music, except the old Music.\n\nThe Music! If we get over the air is nothing compared to the old kind. The radio, out side of the so-called news, would be better shut off, the programs sent over the air, I think, should be broadcast later on, kept out of the way of the people who do not want them.\n\nHobbies and Special Interests, and should be condemned now, or censored severely.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Yes I have quite a quantity of old stamps, may be of value.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nI have on hand an old letter from Scotland Dated 1865.\n\nNone of this matter was considered in early days.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. No, not early, but today, and for past 5 or 6 Years I have kept a diary.\n\n68. Describe other hobbies or special interests of yours not already mentioned. For myself, music and poetry, and my age now is 77, will be 78 next July 18th.\n\nGod willing.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? No.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nThis will conclude, and I hope you will overlook the mistakes, I might add.\n\nWe, wife and myself live at Peaceville, where we took our Homestead 50 Years ago. We have lived at Verigin, Buchanan, Kamloops, Osoyoos, B.C., and New Westminster B.C. Wife was born at Ft. Qu'Appelle, Sask. Her Father was an Englishman from Devon England, worked for H.B.C., and the North West Trading Co. Came to Canada in 1872, age was 13 then, and J.H. Ashdown and Mr. Smith, wife's Father were chums at that time. Robt. Russel Smith was his name, and he had the distinction of shipping part of a car of wheat, and received a large medal and scroll, of certificate for this. This certificate was issued by the then Government of Canada or some high official. Mr. Smith made a trip to Edmonton where it took SIX Months from mpg. to Edmonton and back.\n\nThere is much more I might add, and later if you wish some other information.\n\nI will look up my old papers and see what I can do. I have the complete paper of the Chas. Lindberg flight to Paris, and many clippings of things that happened in Sask.\n64. Has anyone from your community become well known or famous in the medical world? Give names and dates and places of public appearances.\n\n65. In what an important or less important is your community now as compared with the early days? What has been done to improve conditions?\n\n66. Are there any clubs or societies in your community which you think should be continued? If so, name them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming times, etc.? If so, explain.\n\n68. Describe other hobbies or special interests of yours. Mention only those which you have had for at least five years.\n\n69. Is there anyone in your community who is well-known for any of these hobbies?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, meetings, parties, etc., if necessary.\n\nThis will complete our list. I hope you will overlook the mistakes I might have made. We visited your town last week, where we took your pictures. We hope to see you again soon.\n\nYours sincerely,\n\n[Signature]\n\nP.S.: We have lived at [Address] for many years. We hope to see you again soon.\n\nThere is much more I could add, but I will not bore you with all the details. I will look up my old papers and see what I can do. I have the complete paper of the Cheyenne Indians and many other things that happened in [State].\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1887_1924.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 10708, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1240, 5], [1240, 1240, 6], [1240, 3750, 7], [3750, 6207, 8], [6207, 8707, 9], [8707, 11016, 10], [11016, 13157, 11], [13157, 15110, 12], [15110, 16726, 13], [16726, 17633, 14], [17633, 19993, 15], [19993, 21071, 16], [21071, 24037, 17], [24037, 27078, 18], [27078, 29322, 19], [29322, 31186, 20], [31186, 32858, 21], [32858, 34395, 22], [34395, 36490, 23], [36490, 38305, 24], [38305, 41307, 25], [41307, 42675, 26], [42675, 42675, 27], [42675, 42829, 28]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]