[{"id": "73115ab21d710ea5c9179ad00fd8cf0c8eedebe4", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about leaving blank spaces. Use extra sheets of paper if necessary or don't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been completed or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreparation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJULY 26, 1955\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here do not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experience\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreparation of Questionnaire\n\nAll questionnaires will be preserved in the offices of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJULY 26, 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Bernhard A. Friesen\n2. Your address: 547\n3. Date: July 26, 1955\n4. Where were you born? (Give name of place and country): Saskatchewan\n5. What was your father's name and occupation?: Farmer\n6. When did you come to Saskatchewan? (Give month and Year): May 1893\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Guelph, Manitoba (typed three months)\n   - Ontario (typed three months)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.)\n   - 12 years\n\n9. What were your reasons for coming West?\n   - Because the Canadian government had an agreement to provide land at low prices to homesteaders to help settle family and make a living over.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroads or government information?)\n    - Through government information.\n1. Your full name: Bernhard A. Friesen\n\n2. Your address: 857 h.e.n. Saskatchewan\n\n3. Date arrived: 1915\n\n4. Where were you born? (Give name of place and country): Zehmen, Russia\n\n5. What was your father's name and occupation?: Anton A. Friesen, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1893\n\n7. Mention any other places where you lived before coming to Saskatchewan; giving dates wherever possible:\n\n   - Guter, Manitoba, stayed there one month\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.) 21 years\n\n9. What were your reasons for coming West?\n\n   Because the Canadian government had then opened up the land for settlement and the country offered free homesteads to families who wanted to own their own land.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Through government information.\n11. What did your friends and relatives think of your decision to come to Western Canada? They came along. Some were disappointed in Saskatchewan but here building as being very cold.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Traveled with family.\n\n13. What means of transportation did you use? Train and steamship were used all the way.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.). An Indian woman carried a papoose on her back.\n\n15. Where did you first stay when you arrived in Saskatchewan? Lived in a boxcar at the stopping place until school was started on homestead.\n\n16. Where did you settle or take up land? NE¼ Sec. 12 Tp. 19 R4 W½ Mer. new homestead.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Living near Redden all the time.\n\n18. How did you earn a living before coming to Western Canada? How, after you came? Farming before and after coming to Western Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada? Many came along. Some were disappointed at an Saskatchewan building as being very cold.\n\n12. Did you travel by yourself or with a party (family, friends)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nAny Indian women carried a papoose on her back.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n11. What did your friends and relatives think of your decision to come to Western Canada? They came along. Some were disappointed at Saskatchewan. Others found it interesting and exciting.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled with family.\n\n13. What means of transportation did you use? Trains and steamships were used all the way.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other events, etc.)\n\nAn Okotoks woman carried a horse on her back.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBird in a boxcar at the stopping place until dark were excited on homesteads.\n\n16. Where did you settle or take up land? NE 1/4 Sec. 12 Tp. 43 R4 W4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nDuring new frontier all the time.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nPlanning life and after coming to Western Canada.\n11. What did your friends and relatives think of your decision to come to Western Canada? They came a long way. Some were disappointed in Saskatchewan, but they found it just as interesting.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nTravelling with family.\n\n14. What highlights of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences, etc.)\n\nAn old woman carried a horse on her back.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nBird in a boxcar at the stopping place until dark were located on land.\n\n16. Where did you settle or take up land?\n\nNE¼ Sec. 17 To 13 R4 W3 Mer. New Frontier.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nLiving new Frontier all the time.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nFarmering before and after coming to Western Canada.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Had anyone else come to St. John's Church because of your recommendation? If so, who?\n\n22. List other members of your family (brothers, sisters, parents, etc.) who lived here when they came and where they settled.\n\n23. In what part of town did you live?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\n25. The first means of travel was made by horseback. Tell how a week on horseback to visit the town. Tell how the trip was made. How far did you go? How long did it take? What was the weather like? How did you feel?\n19. How often did you write to relatives or friends in your old house?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to United States because of your recommendation? If so, list:\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell what they came to do about them.\n\n23. Have you heard from your family since your arrival?\n\n24. Did you travel much in the early years? (For instance, attending church, visiting friends, etc.)\n\n25. What was the first means of travel when you moved to this town?\n25. When was the first car used in the community? *Ether 1903-1904*\n\n26. If you owned a car before 1914, when did you buy it? What makes?\n\n*Had none.*\n\n27. Where was your trading center? How far from your home?\n\n*Rothlen, similar.*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n*Yes. The Carlton Hotel line the N.R. built about 1909, thereby taking a lot of trade away from Rothlen, giving it to Carlton. And still further.*\n\n29. How often did you shop in the early days?\n\n*Every two-three weeks. Tuesday and Saturday.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n*Right from the start due to Saturday hunting.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n*What kind of articles did you buy in this way? Indicate also what proportion of your total purchases were by mail order and changes in the proportion of purchases made by mail order since the pioneer period.*\n\n*About 1908. A hunting camp. A very small percentage of total purchase was made by mail order and now it is practically nil.*\n\n32. When did you first have a telephone and what company provided it?\n\n*1912. Rothlen Rural Telephone Co.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n*When coming to Saskatchewan the first time the idea wasn't to try it out and then decide. The decision to stay was made after the homestead was declared and receiving the naturalization papers in 1996.*\n25. When was the first car used in the community? \n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your traveling center? How far from your house?\n\n28. Did you continue to travel there? (Indicate any changes due to new taxes appearing after 1909, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen coming to Saskatchewan the first time the idea wasn't to stay out and then back. The decision to stay was made after the honeymoon and winning the naturalization papers in 1916.\n34. Did any people move away from your district prior to 1924? What reasons did they have for moving?\n\nYes, re-employment.\n\n35. Did many people move away during the 1930s? Did many return? No.\n\nWe do not live we only stay.\n\nWe are too poor to get away.\n\n36. If you or some members of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\nSecretary treasurer of Bicknell School district #52 from 1905 to 1916. Volunteer of the school church for 12 years.\n\nAlmost 1920-1932. Also worked for local telephone company for many years.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here giving dates wherever possible.\n\nSuch as owning the first automobile, combining organizing the first lodge, etc...\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin of naming of the place; (3) date of its adoption; (4) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool district #52 named after \"place\" suggested by farmer Henry Demmler in Russia.\n\nPost office was named before our arrival and no one seems to know origin and meaning of name.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nWe do not have any record of people moving away.\n\n35. Did many people move away during the 1930s? Did many return?\n\nWe do not have any record of people moving away.\n\n36. If you or some members of your family have held public office, or have been active in any organization, mention its name, giving dates wherever possible.\n\nSecretary, Friesen School District #252, 1905-1916. President of the school board for about 1920-1932. Also director for rural telephone company for many years.\n\n37. If you or any of your family or friends were elected to have or do something in the district, mention it here, giving dates wherever possible.\n\n(Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, etc.) Give the name and date of its adoption. Try to give the origin of the name. (1) Name of place, (2) Date of adoption, (3) Origin of name.\n\nSchool district #252 named \"Friesenfield\" after the pioneer who farmed there. Post office was named after our arrival and no one seems to know origin and meaning of name.\n6.\n\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and results—have nothing of historical importance.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads—new ones only trails now high roadbed\nTravelling highway older vs. new—trailer now owned\nChurches—Agaractive—then part of Ste. Anne’s—now belonging to local\nAgriculture—then part of Ste. Anne’s—now high speed tillage\nImplement combines, etc.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\nAnother blank.\n6.\n\n39. Questions regarding historical sources material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nHave nothing of historical importance.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads—there were only trails now—highways and gravelled highways then—now—freeway and expressways.\n\nAgriculture—there was no mechanized farming then—now—high speed tractors, implements, combines, etc.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nBernhard A. Friesen\n\nFootman Creek\nChildren - Mrs. A.K. Bierman (Kathleen) Rothen, farmer\nBarbara M. Bierman\nMargaret Bierman (teacher)\nWilliam K. Bierman\nAnn M. Bierman\nMrs. Joseph Bierman (Marilyn)\n\nGrandchildren -\nRobin Bierman (Cleveland, farmer)\nEva Bierman (Northern, farmer)\nMrs. Jacob Bierman (Albany, farmer)\nAmelia Bierman (Northern, farmer)\nBillie Bierman (Northern, student)\nHeidi V. Bierman (Northern, student)\nQuentin Bierman (Northern, office worker)\nJennifer Bierman (Northern, student)\nAmber Bierman (Northern, student)\nJennifer Bierman (Northern, student)\nJuliette Bierman (Northern, student)\nErin Bierman (Northern, school child)\nAllison Bierman (Northern, student)\nMabel Bierman (Northern, student)\nPhyllis Bierman (Northern, student)\nNaomi Jean Bierman (Northern, student)\nBenjamin Winger Bierman (Northern, farmer)\nAndrew Bierman (Northern, teacher)\nTheodore Bierman (Northern, student)\nPamela Bierman (Northern, student)\nElizabeth Bierman (Northern, student)\nHenry Bierman (Northern, student)\nClifford Bierman (Northern, student)\nRosanne Bierman (Northern, student)\nChildren:\n- Mrs. A.K. Bierman (Kathleen) Rothenberg, farmer\n- Barbara Bierman\n- Mrs. Barbara Bierman (Kathleen)\n- Albert K. Bierman\n- Ann M. Bierman\n- Mrs. Joseph Bierman (Helena)\n\nGrandchildren:\n- Robert Bierman, railroad worker\n- Anna Bierman, Northern Farmerette\n- Mrs. Jacob Bierman (Helena)\n- Barbara Bierman, Northern Farmerette\n- Stella Bierman, student\n- Herbert V. Bierman, physician\n- Dorothy Bierman, hospital clerk\n- Donald Bierman, hospital clerk\n- Regina Bierman (farmer)\n- Patricia Bierman\n\nGreat-Grandchildren:\n- Walter Bierman\n- Emma Bierman\n- Robert Bierman\n- Mildred Bierman\n- Phyllis Bierman\n- Naomi Jean Bierman\n- Benjamin Wanger\n- Barbara Bierman\n- Harold Bierman\n- Elizabeth Bierman\n- Clifford Bierman\n\nInfant:\n- Rosemary Bierman\nWilliam Heidegger\nRudolph Fischer\nBruno\nPeter\nAlfredo\nMildred\nMargaret\nClara Ann\nMargaret Kitchinman\nRonald Latham\nFlora Latham\nmore William heather wellworth\n\nRudolph Fischer Northern teacher\nBruno \" Summer student\nPeter \" Foreign student\nOlindo \" School child\nMillard \" School child\nMargaret \" Infant\nClara Ann \" Infant\nMargaret Kothman Kothman student\nRonald Latham \" Summer student\nGlenna Latham \" Infant", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1893_547.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5696, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1622, 5], [1622, 3236, 6], [3236, 4539, 7], [4539, 5578, 8], [5578, 6657, 9], [6657, 7443, 10], [7443, 8510, 11], [8510, 9550, 12], [9550, 10321, 13], [10321, 10935, 14], [10935, 12586, 15], [12586, 13515, 16], [13515, 14931, 17], [14931, 16148, 18], [16148, 17394, 19], [17394, 18630, 20], [18630, 19684, 21], [19684, 20437, 22], [20437, 20565, 23], [20565, 20845, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]