[{"id": "79cb48767664184671c1b438051b6c7bf5e36b77", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName Mrs. Clarissa L. Bean\nAddress 7213 Gateway Blvd S.E., Saskatoon\n\n1. INTRODUCTORY QUESTIONS\n   What year did you come to Canada?\n   Where did you settle?\n   Where had you been before coming to Canada?\n   For how many people was your family living?\n   How far was it from your home in the old country?\n   How often could you get supplies?\n   What groceries did you buy?\n\n2. FLOUR AND OTHER GRAINS\n   What brand of wheat flour did you use?\n   In what quantities did you purchase?\n   What was the usual price per pound?\n   How much did you usually buy at a time?\n   Whole wheat flour:\n   Was flour milled locally?\n   What was the price per pound?\n   What other grain did you use?\n   Cornmeal? Other?\n   Did you grind your own flour?\n   How did you grind it?\n\nHandwritten note:\n\nI used to watch the building of the Yantown Co-Op. I was there just after opening day. Mr. Bean, when I was as much as nine years old, thought we had quite a few millers. I don't know what kind of flour they used, but I do know that they ground it in their own mills. They were very busy gathering grain from the fields and grinding it into flour. Also had a large barn.\nI used to watch their building of J. Eaton Co., Ltd. in Winnipeg—I was there for the opening day—\n\nAt Dana, when I was a child—my stepfather, I was given two coyote puppies—I kept them until they grew up into full maturity—then I gave them away—When we left Dana, I don't know what happened to them—I think my stepfather must have turned them loose—they were my pets and wonderful pets—also had a tame crane and many tame gophers—\n\n---\n\n1. INTRODUCTORY Q.\n   What year did you move?\n   Where did you move from?\n   How far was it?\n   How often could you go to town?\n\n2. FLOUR AND OTHER GRAINS\n   What brand of wheat flour?\n   In what quantity?\n   What was the usual price?\n   How much did you buy?\n   Whole wheat flour?\n   Was flour milled?\n   Was other grain?\n   Cornmeal?\n   Others?\n   Did you grind your own?\n   How did you grind?\nI used to watch them building a J. Eaton Co., Ltd. in Winnipeg - I was there for the opening day.\n\nAt Dana, when I was a mere little girl, I was given two coyote puppies - I kept them until they grew up into full maturity - two or more years. When we left Dana, I don't know what happened to them. I think my stepfather must have turned them loose. They were my pets and wonderful pets - also had a tame crane and many tame gophers.\n\n1906\nI used to watch them building of J. Eaton Co., Ltd. in Winnipeg - I was there for the opening day.\n\nAt Dana, when I was a mere little girl, I was given two coyote puppies - I kept them until they grew up into full maturity - two or more years. When we left Dana, I don't know what happened to them. I think my stepfather must have turned them loose. They were my pets and wonderful pets - also had a tame crane and many tame gophers.\n\n1906\nThis is to acknowledge with thanks the receipt of Archives Questionnaires Nos. 3, 4, and 5, which we received from you recently. We are grateful for your co-operation in completing these questionnaires, and in thus making available first-hand information on the community life of pioneer days as it related to schools, churches, and recreation.\n\nYour questionnaires will be carefully preserved in the Saskatchewan Archives as part of the permanent record of our province, and as such will contribute their share to the sources of information on the early years of provincial settlement.\n\nYours sincerely,\n\nLewis H. Thomas\nProvincial Archivist\n\nI have a picture of my brother and myself with our team fetched to a wagon, on the streets of Winnipeg, Man. just before we moved to Dana, Sask. Would you like to use it? It would have to be returned safely.\nThis is to acknowledge with thanks the receipt of Archives Questionnaires Nos. 3, 4, and 5, which we received from you recently. We are grateful for your co-operation in completing these questionnaires, and in thus making available first-hand information on the community life of pioneer days as it related to schools, churches, and recreation.\n\nYour questionnaires will be carefully preserved in the Saskatchewan Archives as part of the permanent record of our province, and as such will contribute their share to the sources of information on the early years of provincial settlement.\n\nYours sincerely,\n\nLewis H. Thomas\nProvincial Archivist\n\nI have a picture of my brother and myself with our team hitched to a wagon, on the streets of Winnipeg, Man., just before we moved to Dana, Sask.—Would you like to use it? It would have to be returned safely—(lower)\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: Mrs. Clarissa L. Bean\nAddress: 7313 Gateway Blvd S.E., Washington D.C., U.S.A.\nBirthplace: England (district)\n\n1. INTRODUCTORY QUESTIONS - As recalled from my childhood days - 1906\n\nWhat year did you start housekeeping in Western Canada? 1906\nWhere did you set up housekeeping? Dana, Idaho\nWhere had you been living before that? Winnipeg, Man.\nFor how many people did you prepare meals? (2 when a child)\nHow far was it to your nearest store? 2-3 miles\nHow often could a visit be made to the store? About once weekly\nWhat groceries did you usually buy in those earliest years? Staple Groceries, flour, tea, coffee sugar, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Five Roses & Lily\nIn what quantities did you buy it? 100 lbs\nWhat was the usual price per hundred pounds of white flour?\nHow much did you use graham flour? Made our own by mixing\nWhole wheat flour?\nWas flour milled locally? How far away? What year?\nWhat was the price for a twenty pound bag of rolled oats?\nWhat other grain products did you use? Mostly oatmeal\nCornmeal? A little Whole Wheat? A little Farina?\nOther?\nDid you grind your own wheat for porridge? Yes, sometimes\nHow did you grind it? Machine\nPIONEER DIET: WHAT DID WESTERN CANADIAN FARMERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to the Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.)\n\nName: Mrs. Clarissa Bean\n\nAddress: 7318 Saturday Ave., Regina, Sask.\n\nBirthplace: England (Lancashire)\n\n1. INTRODUCTORY QUESTIONS—As recalled from my childhood days—1906\n\nWhat year did you start housekeeping in Western Canada? 1906\n\nWhere did you set up housekeeping? Ranch, Saskatchewan\n\nWhere had you been living before that? Winnipeg, Manitoba\n\nFor how many people did you prepare meals? 4 (including children)\n\nHow far was it to your nearest store? 2 miles\n\nHow often could a visit be made to the store? Almost every week\n\nWhat groceries did you usually buy in those earliest years? Flour, tea, coffee, sugar, etc.\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? (Price)\n\nIn what quantities did you buy it? 100 lbs.\n\nWhat was the usual price per hundred pounds of white flour?\n\nHow much did you use graham flour?\n\nWhole wheat flour?\n\nWas flour milled locally? Yes\n\nWhat was the price for a twenty pound bag or rolled oats?\n\nWhat other grain products did you use? Mostly oatmeal\n\nCornmeal? A little\n\nOther?\n\nDid you grind your own wheat for porridge? Yes\n\nHow did you grind it? With a hand mill\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Own cows -\n\nbutter? Own cows - eggs? Own cows -\n\nThat was the price of butter? 10¢ per lb.\n\nDid you keep eggs for hatching? Yes\n\nDid you make butter? Yes\n\nDid you make cheese? No (only cottage cheese)\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Deer, our own calves\n\nHow did you get fresh meat? Hunting & fishing\n\nHow often did you get fresh meat? Most any time\n\nHow did you preserve meat? Salted down & canned - froze it in winter\n\nWas there a \"beef ring\" in your neighborhood? Yes\n\nIf so, what year was it organized?\n\nDid you use game? Yes\n\nWhat kinds? Ducks, Geese, Pheasants\n\nFor how long? Until they were rationed by law\n\nWhat part did fish play in the family diet? Not much\n\nWas the fish fresh, cured, or canned? Fresh\n\nKinds? Gold Eyes, etc.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon at what price? $1.00\nWhat kind of coffee did you buy? (beans or ground) Beans\nPrice? $2.00\nOther beverages used? None - other than lemonade, orange soda etc.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nCould you get potatoes at the store? Yes\nIf not, where from? Own garden\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1930-31 Cabbage 1930 Carrots 1930 Onions 1930\nTurnips Yes Beets No\nIn what quantities did you buy white navy beans? Yes - but don't know quantity\nHow did you buy prunes, (in bulk or by the box)? Bulk\nWhat weight? Several lbs How did the grocer handle prunes (by box)? Roy\nWhat was the price of prunes? $1.00\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\npeas? Yes corn? Yes beans? Yes Saskatoons? Yes Preserved\nother foods? Wild strawberries, strawberries, raspberries, mushrooms\nWhat year did you first preserve fruit by canning? ?\nWhat year did you first preserve vegetables by canning? ?\nWhat year did you first preserve meat by canning? ?\nDo you still preserve foods by canning or drying? At times\nTo what extent? For family of two\nDid you make your own vinegar? No\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|-----------------------------------|---------------------|\n| Soda biscuits         |                                               |                                                   |                                   |                     |\n| Macaroni              | 1906                                          |                                                   |                                   |                     |\n| Graham flour          | 1906                                          |                                                   |                                   |                     |\n| Brown sugar           |                                               |                                                   |                                   |                     |\n| Molasses              |                                               |                                                   |                                   |                     |\n| Table salt            |                                               |                                                   |                                   |                     |\n| Common salt           |                                               |                                                   |                                   |                     |\n| Lily white syrup      |                                               |                                                   |                                   |                     |\n| Toilet soap           |                                               |                                                   |                                   |                     |\n| Baking powder         |                                               |                                                   |                                   |                     |\n| Baking soda           |                                               |                                                   |                                   |                     |\n| Dried peas            |                                               |                                                   |                                   |                     |\n| Dried corn            |                                               |                                                   |                                   |                     |\n| Vinegar               |                                               |                                                   |                                   |                     |\n| Raisins - seeded      |                                               |                                                   |                                   |                     |\n| - seedless            |                                               |                                                   |                                   |                     |\n| Rice                  |                                               |                                                   |                                   |                     |\n| Currants              |                                               |                                                   |                                   |                     |\n| Store jam - kinds?    |                                               |                                                   |                                   |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                   |                                   |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal and Fleischman's\nDid you make yeast for your own use? Yes\nUsing starter?\nUsing hops?\nSalt rising?\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\nDid you make your own baking powder? Yes\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember buying it in store | How was it bought? | Did you usually buy this amount? |\n|-----------------------|--------------------------------------------|--------------------|----------------------------------|\n| Soda biscuits         |                                            |                    |                                  |\n| Macaroni              | 1906                                       |                    |                                  |\n| Graham flour          | 1906                                       |                    |                                  |\n| Brown sugar           |                                            |                    |                                  |\n| Molasses              |                                            |                    |                                  |\n| Table salt            |                                            |                    |                                  |\n| Common salt           |                                            |                    |                                  |\n| Lily white syrup      |                                            |                    |                                  |\n| Toilet soap           |                                            |                    |                                  |\n| Baking powder         |                                            |                    |                                  |\n| Baking soda           |                                            |                    |                                  |\n| Dried peas            |                                            |                    |                                  |\n| Dried corn            |                                            |                    |                                  |\n| Vinegar               |                                            |                    |                                  |\n| Palisano - seedless   |                                            |                    |                                  |\n| Rice                  |                                            |                    |                                  |\n| Currants              |                                            |                    |                                  |\n| Store jam - kinds     |                                            |                    |                                  |\n| Cheese (Cheddar or store cheese) |                        |                    |                                  |\n| Vanilla               |                                            |                    |                                  |\n\n10. MIXING\n\nWhat type of yeast did you use? Royal and Yeastmold's\nDid you make yeast for your own use? Yes\nUsing starters?\nUsing hops?\nSalt rising?\nDid you buy baking powder? Yes\nBaking soda?\nDid you make your own baking powder?\nCream of tartar? Yes\nDid you make your own baking powder? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                                      | Earliest date it appeared on the market | Approximate price at the time. | How did it differ from the same product today? |\n|-------------------------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon                             |                                        |                               |                                                 |\n| Canned sardines                           |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names |                                        |                               |                                                 |\n| Apples - fresh                            |                                        |                               |                                                 |\n|                                            | dried                                  |                               |                                                 |\n| Lettuce                                   |                                        |                               |                                                 |\n| Tomatoes - fresh                          |                                        |                               |                                                 |\n|                                            | canned                                 |                               |                                                 |\n| Bananas                                   |                                        |                               |                                                 |\n| Lemons                                    |                                        |                               |                                                 |\n| Oranges                                   |                                        |                               |                                                 |\n| Cornflakes                                |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names |                                        |                               |                                                 |\n| Pearl tapioca                             |                                        |                               |                                                 |\n| Minute tapioca                            |                                        |                               |                                                 |\n| Sago                                      |                                        |                               |                                                 |\n| Dates                                     |                                        |                               |                                                 |\n| Walnuts                                   |                                        |                               |                                                 |\n| Icing sugar                               |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout) for cattle when dry weather\n\nHow far was this water from your home? Just back of our house\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible,\n| FOOD | Last seen date | Approximate price at the time | How did it differ from the same product today? |\n|------|----------------|-------------------------------|-----------------------------------------------|\n| Canned sardines | | | |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh | | | |\n| Apples - dried | | | |\n| Lettuce | | | |\n| Tomatoes - fresh | | | |\n| Tomatoes - canned | | | |\n| Bananas | | | |\n| Lemons | | | |\n| Oranges | | | |\n| Cornflakes | | | |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca | | | |\n| Minute tapioca | | | |\n| Sago | | | |\n| Dates | | | |\n| Walnuts | | | |\n| Icing sugar | | | |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your home? (just back of our house)\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n13. SOAPS\n\nDid you buy laundry soap or make your own? Bought at ...............\n\nIf you made your own, did you use lye? Yes wood ashes? No\n\nWhat kinds of laundry soap did the grocer handle? Royal Crown or Feb Puddin'\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood ........................\n\nWhere did you get your fuel? Hauled it from Brush Avery Butler\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible. Coal, Oil etc.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) ..........................................................\n\nDid you use an outdoor fireplace or bake oven? (Give dates) ..........?\n\nBy whom was your first cook stove made? Small iron stove - then large range (forget the name) but nearly all the farmers use it\n\nWhat year was it purchased? 1906 Price? $20\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Enamel\n\nFor preparing food? (china, earthenware, wooden bowls, other) ............\n\nWhen did you first see enamel ware? ?\n\nAluminum? Years later\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use lye?\n\nWhat kind of laundry soap did the grocer handle? (Powdered, liquid)\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? (Wood, coal, oil, etc.)\n\nWhere did you get your fuel? (Purchased at store, bought from neighbor)\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Name, town, date)\n\nWhat year was it purchased? (Year)\n\nWhat types of utensils did you use? (Iron, copper, tin, homestead)\n\nFor preparing food? (China, earthenware, wooden bowls, other)\n\nWhen did you first see enamel ware?\n\nAluminum?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). Used to use plain manila bags - thin waxed paper now cellophane bags and wrappings - plastics.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast - oatmeal\nBacon, eggs - or pork chop & eggs - pancakes,\nor fried potatoes - milk, tea coffee, bread,\netc.\nMother - Sarah Emma Handley - fall -\nBrother - Joseph Handley June 3 - 1889\nSister - Flora Emily (Handley) Bridle Sept 7 - 1892\nMyself - Clarissa Lizzie Handley Bean April 7 - 1896\n\n18. What year did you serve your first Christmas dinner in Western Canada? 1903\nGive the menu. List those present and give their approximate ages at the time.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nI don't recall\n16. WRAPPINGS AND CONTAINERS\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible). Used to use plain manila bags—felt covered (plastic)\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family then living at the time. State the approximate month, e.g., winter or summer.\n\nBreakfast—Cold cereal—Bacon, eggs, or pork chop—Fruit—Potatoes—Milk—Tea—Coffee—Bread—etc.\n\nMother—Joseph Brandley—June 3-18-89\nBrother—Agnes Brandley—April 7-18-92\nSister—Clara Bean—April 7-18-96\n\n18. What year did you serve your first Christmas dinner in Western Canada? 1910?\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nI don't recall.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nIn the early years food was cooked on wood ranges - water was hauled or carried - or snow melted - or ice chopped from rivers and lakes - today mostly cooking is done by gas or electricity running water in the most of farm homes.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n1915-1916 or - when we left the farm - and later 1917 when I came to U.S.A -\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nUsed to go to Dana with oxen hitched to sleigh or wagon. Or I would go with my brother duck hunting etc. Used cellar and well for cold storage in summer - froze meat in winter.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n- In the early days, food was cooked on an open range.\n- Water was hauled or carried from springs and lakes.\n- Food was chopped from trees or shrubs.\n- Food was mostly cooked in a large pot over an open fire.\n\n21. When did you begin to rely on purchased foods instead of homegrown and homemade prepared foods? (Give as many details and dates as possible.)\n\n1915-1916 - When we left the farm and after 1917 when I came to U.S.A.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of purchasing, prices, problems of storage, shortages and other details. (Use back of pages if more space is needed.)\n\nWe used to go to Dana and buy fresh pitched to a horse and wagon.\n\nOn I would go with my brother back hunting and\n\nWeed killers and I will give you cold storage.\n\nSummer - froze meat in winter\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_168.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 6529, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1484, 3], [1484, 2317, 4], [2317, 2317, 5], [2317, 2317, 6], [2317, 2756, 7], [2756, 3196, 8], [3196, 4048, 9], [4048, 4908, 10], [4908, 6426, 11], [6426, 7864, 12], [7864, 8950, 13], [8950, 8950, 14], [8950, 10352, 15], [10352, 10352, 16], [10352, 14770, 17], [14770, 17908, 18], [17908, 21917, 19], [21917, 22947, 20], [22947, 24119, 21], [24119, 25041, 22], [25041, 26121, 23], [26121, 26976, 24], [26976, 28060, 25], [28060, 29116, 26], [29116, 29272, 27], [29272, 29426, 28]], "primary_language": ["None", "en", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]