[{"id": "4df478059a8965ec7e53ad7cf508089ea0573128", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5 \"FOR THE YEARS 1883 to 1887 ONLY\"\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name Robert Webster Widdess,\nPresent Address 509 - 1445 Marpole Avenue,\nPioneer Address Rocanville, Sask., 1883 to 1887.\n\nYear you came to Saskatchewan 1883.\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5 \"FOR THE YEARS 1883-1967 ONLY\"\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Five.\n\nHow many of these were bachelor's homes? Two.\n\n2. How often did you usually visit neighbors? Not very often.\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? The neighbors usually came to see us on Sundays.\n\nWhat time of the day did you go, - in the morning and spend the day, or in the afternoon, etc.? When we went, which was seldom, it was usually for a week-end to one or other of our relatives.\n\nWhat about meals? Did you stay when not invited beforehand? About\n\nThe was never any doubt/the welcome. Meals were taken for granted.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) No apologies were ever made that I know of.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? There was always a meal.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? The whole family went, but the place was looked after too.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, these were all the order of the times.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nEvery new arrival had a \"Bee\" to build his home. They were all built of logs. Sometimes they had bees to plow up the land too. Quilting bees were social events of great importance, and some times stretched out over several days interspersed with card games and dances.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. see above.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? There were no schedules.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? \n\n2. How many of these were bachelor's homes? \n\n3. Did you usually visit neighbors? \n\n4. Were you often invited to other homes, or was most visiting done without an invitation? \n\n5. The neighbors usually came to see us on Sundays. \n\n6. What about meals? \n\n7. How was the invitation to a meal worded when people had some urgency? \n\n8. No apologies were ever made that I know of. \n\n9. If no meal, what other refreshment might be offered to visitors who had dropped in? \n\n10. There was always a meal. \n\n11. Did the whole family go, or did someone stay home to \"watch after the place\"? \n\n12. Did you ever have \"house\" parties when groups of neighbors came together to put up a billiard, race, quilting, or other such activity? \n\n13. Tell what you remember about such get-togethers, giving dates if possible, tell in what town they were held, and how often they occurred. \n\n14. Built of logs, sometimes they had bees to pour up the sand too. \n\n15. Quilting bees were social events that included games and dances. \n\n16. In the earliest years that you were here, were there any parties, what drives or dances in homes? Describe, see above. \n\n17. Were these more frequent in later years? Give dates. \n\n18. Did you follow any kind of informal schedule, such as going by turn from one house to another at definite times; every two weeks, once a week, once a month, etc.? \n\n19. There were no schedules.\n(This is duplicated in Questionnaire No 3)\n\n1883 to 1887\n\n2.\n\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n(This is duplicated in Questionnaire No 3)\n\n1883 to 1887\n\n2.\n\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for a prize?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visiting treated ceremonially in parlor, etc.? Not in those years 1883-1887. That comes later.\n\n13. Was the chivaree known in your community? do do\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for it being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it:\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"manners,\" do you remember in small towns, such as above and lists with calling cards, etc.? Note in those years had changed? What common later.\n\n13. Was the advance known in your community? Do so.\n\nDescribe what you remember about advances, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling of any games or entertainments already mentioned that were popular in further and earlier years; dates shown, you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. That was the name of the first organization of any kind that you remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' local in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the main village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.?\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\nWho provided the lantern and the slides?\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-numbletypeg, ball, marbles, fly kites, etc.)? Ball game called \"Scrub\", marbles, kite flying, Shinny.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Tag and skipping.\n18. Name any other organizations that were in existence in your community before 1914, give their names or early dates when it was first organized, its chief purpose (if any), whether it was connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. What did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jumping rope, ball, marbles, fly kites, etc.)? Ball game called \"Scrab\", marbles, kite flying, shinny.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nWhat games did children play at Christmas?\n22. What winter games were played outside - fox and hounds, skating, etc.?  \n   Sledding, snow-shoeing.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?  \n   Checkers, Authors, Indians.\n\nDid the whole family join in such games, or only the children? Explain.  \n   Yes.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.  \n   Yes.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.  \n   Yes.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.  \n   Rocanville Picnic June 23, 1884.\n\nIt was held along the south bank of the Qu'Appelle valley just east of where the Scissors Creek enters, two or three miles west of our farm.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?  \n   The entire community, or group of communities really.\n\n28. Was it the first picnic held in the community?  \n   Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?  \n   Foot races, Ball game, Oxen figured prominently in the racing contests, but there were a few \"Shagginapries\" too.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? There must have been a general lunch, as I can remember table cloths spread all over on the grass. It was a grand affair. The first of a series of annual picnics that became famous and continued for many years thereafter.\n\n31. What did you have to eat and drink?  \n   Roast chickens chiefly, bread and butter and jam, tea and lemonade no doubt.\n\n32. What time of the day did it start, and how long did it last? Mid-forenoon and lasted until the end of one of the longest days of the year.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"whist,\" \"penny-ante,\" \"whist,\" \"whist\" or others, checkers or other games? \n\nCheckers, Authors, Indians.\n\nDid the whole family join in such games, or only the children? Explain. \n\nYes.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain. \n\nYes.\n\nDid children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or games in the snow? Describe. \n\nYes.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? \n\nGive year and month if possible. \n\nIt was held about the south bank of the Qu'Appelle river, just west of the town of Qu'Appelle, east of where the Souris River enters, two or three miles west of our town.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? \n\nThe entire community, or group of communities really.\n\n28. Was it the first picnic held in the community? \n\nYes.\n\nIf not, do you know the date of the first one that had been held? \n\n29. What were the arrangements at the picnic? \n\nFoot races, ball game, open field sports, races, etc., etc., etc.\n\n30. What arrangements were made for eating? Was there a general lunch, or did families and friends bring smaller groups? \n\nThere must have been a general lunch, as I can remember tablecloths spread all over on the grass.\n\nIt was a great affair, and continued for many years thereafter.\n\nThey became famous and continued for many years thereafter.\n\n31. What did you have to eat and drink? \n\nRoast chickens chieftly, bread and butter and jam, tea and lemonade no doubt.\n\n32. That time of the day did it start, and how long did it last? Mid-forenoon and lasted until the end of one of the longest days of the year.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe outstanding features were the ox racing, singly, by the span, hitched to wagons and ox carts, and bare-back riding of both ponies and steers (oxen).\n\nThe foot races (all sorts) were good too.\n\nBut the wonderful spread of food put everything else in the shade.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThe Rocanville Annual Picnic surpassed all others.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\nThe outstanding features were the ox teams; simply, by the span, hitched to wagons and ox carts, and bareback riding.\n\nOf both ponies and steers (oxen).\n\nThe foot races (all sorts) were good too.\n\nBut the wonderful spread of food put everything else in the shade.\n\n34. Describe the different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc., tell about any differences in numbers attending, activities, food and drinks, when held, etc.\n\nThe Roperville Annual Picnic surpassed all others.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, young people.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nThat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger contests, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n1883 to 1887\n\n40. When did an annual \"sports day\" become established in your community? 1884. Did it grow out of or replace the earlier community picnic? Combined. Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nWe were never without reading matter at any time 1883-1887.\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? No. When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? 1884.\n\nDid it grow out of or replace the earlier community picnic? Combined, who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 4th).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\nWe were never without reading matter at any time 1883-1887.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\n\nGive details and dates.\n\n48. Was there a school library? No. When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading materials?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? None.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. As stated above, we were never short of reading matter.\n50. Has there ever been a community library in your district or town?\n   Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. As stated above, we were never short of reading matter.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   Innumerable mouth organs and jewsharpes, and just one fine old violin.\n\n57. What instruments did any of your neighbors have? The same.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. Not very much.\n\nIn the community? (Were there musical concerts, was there group singing at parties, etc.) Describe. Not that I remember particularly.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? No. When was it started?\n   Who started it? How long did it continue?\n   How many were in it? Who was bandmaster?\n   What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n1883 to 1887\n\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nApplicable to this period (1883-1887) two N.M.M.Policemen arrived in our farm yard late one afternoon in 1886 with a prisoner from up around Fort Pelly and asked if they might stay for the night. Of course they could. They spread their blanket in the corner of our living room, pulled my mother's sewing machine over and handcuffed the prisoner to it. That was the only sewing machine for many miles in every direction. It may not have been the first to arrive, but of one thing we are certain, it was the first sewing machine to take part in law enforcement in Saskatchewan.\n\nIn 1886 Joseph Stocks arrived in our district with a large family of children and took up land about two miles east of our farm. He was a clever man, but he had some queer ideas. He had it all figured out how many acres were required for the upkeep of each person, and he planted grain accordingly. Then he started in the build a flour mill without metal of any kind in any part of the machinery. In place of nails or screws he used wooden pegs. All the wheels, cog-wheels and all, were wooden, and the wonder of it was, it worked. The kids started to come to our school. The bread they brought for their lunches was coal-black.\n64. Has anyone from your community been well known or famous in the world? Give names and dates and places of public appearances.\n\n65. Is there an important or less important event in your community that you remember with the early days? What is the reason for this memory?\n\nHobbies and General Interests\n\n66. Do you have any collections, such as stamps, coins, paintings, signatures, arrowheads, etc.? If so, describe them.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, etc., trees, etc.? If so, describe them.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, birdwatching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features of incidents of social life, family, education, religion, sports, politics, music, literature, art, etc., which may be of interest.\n\nApplicable to this book of pages (or book of pages) of this book of pages if necessary.\n\nIn 1883 Joseph Stoks arrived in our district with a large family of children and took up land about two miles east of our farm. He was a clever man, but he had some queer ideas. He had it all figured out how many acres were required for the upkeep of each person, and he planned grain accordingly. In the build of each mill without metal of any kind in any part of the machinery, in place of nails or screws he used wooden pegs. All the wheel, cogwheels and all were wooden, and the wonder of it was, it worked. The kids started to come to our school. The bread they brought for their lunches was coal-black.\nMr Stocks had forgotten to clean the wheat before grinding it. The bread was much like the oil cakes we fed our calves, in appearance, but not nearly so pleasant to taste. Needless to say, he was one of the first to abandon the farm. But, the worst part of that was, he abandoned the family of small children too. My mother was largely responsible for the placement of them, and it turned out to a fine family. They all became splendid citizens.\nMr Stocks had forgotten to clean the wheat before grinding it. The bread was much like the oil cakes we fed our calves, in appearance, but not nearly so pleasant to taste. Needless to say, he was one of the first to abandon the farm. But, the worst part of that was, he abandoned the family of small children too. My mother was largely responsible for the placement of them, and it turned out to a fine family. They all became splendid citizens.\n1887 - 1905\n\nPIONEER RECREATION AND SOCIAL LIFE\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\nWhen we first moved to Moosomin from the farm, our chief visits were the rare occasions on which we went out to see our relatives at Horamville.\n\n3. Did you usually visit on Sundays, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nOur's was always an open house.\n\nWhat time of the day did you go? - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term to \"take potluck\" used, or was some other expression common?)\n\nNo apologies were made.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"meets\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nNot very many after we left the farm.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nQuilting bees were the most common.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Yes.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a week, once a month, etc.? No.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many times were near enough to you for visiting back and forth?\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\nWhen we first moved to Monomoy from the farm, our chief visits were the rare occasions on which we went out to see our relatives at Rosemville.\n\n3. Did you usually visit on Sundays, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nOur's was always an open house.\n\nWhat time of the day did you go - in the morning and spend the day, or in the afternoon, etc.?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had come unexpectedly?\n\n(That is, was the term \"to take potluck\" used, or was some other expression common?)\n\nNo apologies were made.\n\nIf no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"meals\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nNot very many after we left the farm.\n\nTell what you remember about such gatherings; giving dates if possible, telling what the \"poses\" were for, and how often they occurred.\n\nQuilting bees were the most common.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. Yes.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, every two weeks, once a month, etc.? No.\n8. Tell what was made of the school house for community dances, box socials, etc., and where they were held. (Include also the school Christian tree, pictures, etc.)\n\nIf you have not described these on the School Questionnaire, give dates.\n\nHow much of your social life was centered around the school, and within the school district? Describe.\n\n9. When was your first community hall built?\n\nWhat material was it made of?\n\nWho built it? (the community through special funds, the municipality, some organization, etc?)\n\nWas it built in the village or town?\n\nTo what extent did it take the place of homes or the school house as a place for social entertainments and other uses? (For example, if you lived in the country, did you use the hall for local school functions, or were you close enough to make use of the hall for all gatherings, etc?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days?\n\nWas there card playing for prizes?\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings?\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, etc., if you have not described these on the School Questionnaire. Give dates.\n\nHow much of your social life was centered around the school, and within the school district?\n\n9. When was your first community hall built? How large was it? What material was it made of? Who built it? Was it a country hall? Was it built in the village or town? To what extent did it take the place of homes or the school house as a place for social gatherings? (For example, if you lived in the country, did you go to the local school house for district gatherings, to the town hall for all gatherings, etc.? If you lived in the town, did you go to the town hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in Questions 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Has there card playing for a prize? What dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an anti-social element in the home, or for some other reason?\n12. What attempts at formality, or \"sophistic,\" do you remember in small towns such as gloves and hats when calling, calling cards, visiting treated ceremonially in parties, etc.? For a short portion of this period (1887-1903) this sort of thing was prevalent all over the country, especially two were left for the function whether he wanted there or not, and one for the wife. A reception line was always hungy on the hall table near doors.\n\n13. Was the church a haven in your community? Describe what you remember about churches, telling how common they were, any incidents connected with them, etc. All newly married couples were churched in those early days.\n\n14. Describe any other details of visiting, parties, etc., that you remember. Tell of any games or amusements not already mentioned, that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nMiss Caroline Damard was brought out from Stratford, Ontario, in the late 90's to be organist in the Methodist Church. Her arrival marked the beginning of a new era in the cultural life of Moose Jaw. She taught piano forte and soon had a large class of enthusiastic pupils. Miss Damard was a natural born organizer and she gathered around her all the talented men and women in the town, and before long they were giving concerts that were really splendid. Added by her hat affair and a few others, she put on such entertainments as the Floradora Sextette flanked by full chorus in a manner that would have been becoming established in your community? The Liberal association 1896.\n\nGive the date and reason for it being organized. To whip the torties.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The Liberal association 1896.\n\n16. Was there a Saskatchewan Grain Growers Local in your community? No. Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized? Approximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"sociality,\" do you remember in rural terms such as gloos and halts when visiting, calling cards, visiting card exchanges, etc.? For a short portion of this period (1887-1933) this sort of thing was prevalent all right, fine talking cards, especially, two for the left for the husband, whether muddy boots or not.\n\n13. Was the shivaree known in your community? Yes.\n\nDescribe what you remember about shivarees, telling how common they were, any incidents connected with them, etc.\n\nAll newly married couples were shivareed in those early days.\n\n14. Describe our other details of visiting, parties, etc., that you remember.\n\nMiss Caroline Damard was brought out from Elliot Lake, Ontario, in the late 90's to be organist in the Methodist Church. Her arrival marked the beginning of a new era in the cultural life of Moosomin. She taught piano forte and soon had a large class of enthusiastic musicians, given the name of Miss Smith. Miss Damard was a cultural born organizer and she gathered around her all the talented men and women in the town, and before long there were giving concerts that were really splendid. Aided by Mrs. Hatfield and a few others, she put on such entertainments as the Floradora Sextette, attended by full chorus in a manner that would have been becoming establishment in any city.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The Liberal association 1896.\n\nGive the date and reason for it being organized. To whip the torites.\n\n16. Was there a Saskatchewan Grain Growers local in your community? No.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a women's club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\nMiss Danard proved a little too progressive for the Methodists and they brought out another organist from Ontario. Miss Danard then became organist for the Presbyterian church, where she really excelled herself because they had a better organ. Most of the younger people moved over there with her, just to hear her Mozart, Mendelssohn and Beethoven numbers. Soon after this she accepted an invitation to join the staff of the Toronto Conservatory of Music as a teacher. Later she became vice principal of another famous similar institution in Toronto (a German name that I can't recall at the moment) and died only a few years ago whilst still in that same position. She was one of Canada's greatest in her line.\nMiss Danard proved a little too progressive for the Methodists and they brought out another organist from Ontario. Miss Danard then became organist for the Presbyterian church, where she really excelled herself because they had a better organ. Most of the younger people moved over there with her, just to hear her Mozart, Mendelssohn and Beethoven numbers. Soon after this she accepted an invitation to join the staff of the Toronto Conservatory of Music as a teacher. Later she became vice principal of another famous similar institution in Toronto (a German name that I can't recall at the moment) and died only a few years ago whilst still in that same position. She was one of Canada's greatest in her line.\n18. Name any other organizations that were in existence in your community before 1934, giving the name of each, date when it was first organized, its purpose, who belonged to it, what meetings were held, where they were held, how many attended, how often, and whether there was a school connected with the church, so they need not be included here.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes.\n\nDetails, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nAll the persons mentioned in brackets above took part in these lectures, which were held, first in the academy hall, then in McNaughton's hall and the various churches according to who sponsored them. They were always well attended.\n\nDid you also have magic lantern shows? Yes. Give dates if possible. All\n\nDuring the period 1887 to 1903, who provided the lantern and the slides?\n\nWhat were the slides about? Travelogues, California and the South Seas scenes stand out most prominently in my memory.\n\nChildren's Games\n\n21. What games did boys play in summer ('cubbieships', ball, marbles, kite flying, baseball, etc.)? Marbles in the spring of the year. Kite flying, baseball, and football.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Tag and skipping.\n18. Name any other organizations that were in existence in your community before 1911, giving the name of each, date when it was first organized, its purpose, its officers, and people who attended. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here.)\n\nThat year was commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign countries, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them?\n\nAll the persons mentioned in brackets above took part in these lectures, which were held, first in the Academy Hall, then in Washington's Hall and the various churches according to who sponsored them. They were always well attended.\n\nDid you ever have magic lantern shows? Yes. Give dates if possible. All\n\nDuring the period 1887 to 1903, who provided the lantern and the slides?\n\nWhat were the slides about? Travelogues, California and the South Seas scenes stand out most prominently in my memory.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (rattlesnake, ball, marbles, kite flying, baseball, etc.)?\n\nMarbles in the spring of the year. Kite flying, baseball, and football.\n\nThat games did girls play in summer (skipping rope, play house, etc.)?\n\nTag and skipping.\n22. What winter games were played outside—fox and hounds, skating, etc.? \nSkating, sleighing, snow-shooting, hockey, shinny and dog racing.\n\n23. Did children play indoors in winter—card games with the family? Yes, checkers, Indians and make-believe hunting of all kinds. \n\n24. Did the whole family join in such games, or only the children? Explain.\n\nYes.\n\n25. Was there much time for games, or was recreation usually kept with some kind of work? Explain. Not too much time, but that side of life was certainly never neglected.\n\n26. Did children invent games connected with such things as buffalo bones, arrowheads, rocks, or other objects? Yes, we used to make skating rinks out of barrels, and it took a lot of them to make a rink.\n\nPICKNICS AND SPORTS.\n\n27. What was the date of the first picnic that you attended in Goshen township? (See same item for period 1895-1900.) Picnic June 2nd 1894.\n\n28. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Yes.\n\n29. Was it the first picnic held in the community? Yes.\n\nIf not, do you know the date of the first one that had been held?\n\n30. What arrangements were made for seating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. That winter games were played outside—fox and hounds, skating, sledding, snow-shoeing, hockey, shinny and dog racing.\n\nThat games were played indoors in winter—card games, billiards, checkers, Indians and Poles, here hunting of all kinds.\n\nDid the whole family join in such games, or only the children? Explain.\n\nYes.\n\nFor there much time free? Explain. Not too much time, but that side of life was certainly never neglected.\n\nWe hauled water from the shoulder to make skating rinks, and it took a lot of them to make a rink.\n\nFICTION AND DRAMA.\n\n25. What was the date of the first picnic that you attended in kindergarten? (See same item for period 1883-97)\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? If not, do you know the date of the first one that had been held?\n\n28. Was it the first picnic held in the community? Yes.\n\n29. What arrangements at the picnics you attended (ball games, races, band, etc.)? (See same item for period 1883-97)\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n13. Describe any features of this picnic which you remember as outstanding.\n\n(See same item for period 1883-1887)\n\n14. Describe any different kinds of picnics which you knew of in the early days, such as the large annual, big afternoon, school or Sunday school, family, church, etc. Tell about any attractions, such as games, music, food and drink, when held, etc. Church and Sunday School picnics were common during this period 1887 to 1903. They were always well attended and grand affairs.\n\n15. What changes have you noticed in picnicking since the first years? If possible, give dates when changes became noticeable.\n\n16. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports, (e.g., wrestling, young people), Men of all ages up to 110th took part in the baseball and football games. Cricket was also played to some extent.\n\n17. For what games was the first team organized in your community to play against neighboring teams? Baseball.\n\nWhat year?\n\nHow long did it continue?\n\n18. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc. Hockey, Curling.\n\n19. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n1887 - 1905\n\n13. Describe any features of this picnic which you remember as outstanding.\n\n(See same item for period 1883-1887)\n\n24. Describe the various different kinds of picnics or parties which you knew of in the early days, such as birthday parties, school parties, family picnics, etc., held at various times of the year, when held, etc., Church and Sunday School parties, etc., attended and grand affairs.\n\n25. What changes have you noticed in picnicking since the first years? If possible, give dates when changes became noticeable.\n\n26. Describe the sports which were popular in your community in the early years, telling who took part in them, the various games and sports (each with its own rules), young people, men of all ages up to fifty took part in the baseball and football games. Cricket was also played to some extent.\n\n37. For what game was the flag team organized in your community to play against neighboring teams? Baseball.\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1912, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc. Hockey, curling.\n\n29. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual reports day become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nThen was the sports day usually held? (What month or any special day such as May 24th or July 1st.) July 1st.\n\n41. Are there any men from your community who have become members of milk town players:\nFrederick Lake, Truman Lake, Harry Miller, Gordon Thornton, Irwin.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books did they bring?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. That books were sent to you as gifts in early years?\n\n47. Have you ever had any travelling library books in your community or school?\nGive details and dates.\n\n48. Was there a school library?\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (What month or any special day, such as May 24th or July 4th.) July 1st. May 24th was a special day.\n\n41. Are there any from your community who have become members of well-known teams?\nFrederick Lake, Truman Lake, Liberty Hill, Liberty Hill's team won the county championship.\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary.)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any travelling library books in your community or school?\nGive details and dates.\n\n48. Was there a school library?\nWhen was it begun?\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts books as additional reading material?\n1887 - 1905\n\n50. Has there ever been a community library in your district or town?\n   What was it started?\n   In its small in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to Western Canada? (List newspapers and periodicals.)\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n   None.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n   We were never short of reading matter.\n50. Has there ever been a community library in your district or town?\n   When was it started?\n   Was it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to Western Canada? Mention newspapers in papers, Winnipeg papers, and one of the local dailies.\n\n52. Were the rates charged in your subscriptions, telling why you stopped or continued them?\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have? None.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a handicap? Explain. We were never short of reading matter.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? A very fine old violin.\n\n57. What musical instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. Did your mother conduct a music instrument business in Missouri, so we had all sort from about 1850 onward.\n\n60. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nSome, but not an awful lot.\n\nIn the community? (Were there musical concerts, parties, etc.) Describe. Same applies here.\n\n61. Was \"folk music\" or music of the country you came from, popular in your home or community? Explain. Not particularly.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No.\n\n63. Was there a band in your community? Yes. When was it started? 1885/6.\n\nWho started it? Mr. Beer.\n\nHow long did it continue? Still going.\n\nTell what you remember of its activities, how often the band played for practice was held weekly in any vacant hall available. The band was in uniforms in 1887 and thereafter. It played on all holidays, for picnics, and especially for skating in the winter time. The music consisted of marches and Strauss waltzes, and nothing seemed too difficult for us to try. The amazing part was that it was organized not earlier than 1885, and was fully informed in 1887. There were several leaders between Mr. Beer and Mr. Gibson, and of course there must have been many more since then. Mr. Todd Hopper followed Mr. Gibson, I think.\nMusical Instrumentation\n\n56. What musical instruments did you bring west with you? A very fine old violin.\n\n57. What instruments did you buy in Montana?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices, if possible, and tell where you bought them.\n\n59. How large a part did dancing and other forms of music play in your home entertainments in early years in the West? Describe.\n\nSome, but not an awful lot.\n\nIn the community (were there musical concerts, parties, etc.) describe, same applies here.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was talk music or music of the country you came from, popular in your town?\n\nNot particularly.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on someone, or because of some special happening in the community? Explain.\n\nNo.\n\n63. Was there a band in your community? Yes.\n\nThen was it started in 1885/6.\n\nHow long did it continue? Still going.\n\nTell what you remember of its activities, how often the band played for practice was held.\n\nIf members had uniforms what were they like?\n\nWeekly in any vacant hall available.\n\nMr. Jack Gibson was the leader when I joined the band about 1886/7.\n\nWhat instruments were included? As complete as possible considering the number of players.\n\nThe amazing part was that it was organized not much earlier than 1885, and was fully uniformed in 1887. There were several leaders between Mr. Beer and Mr. Gibson, and of course there must have been many more since the Mr. Todd Hopper followed Mr. Gibson, I think.\n1887-1905\n\n64. Has anyone from your country become well known or famous in the musical world? Give names and places of public appearances.\n\n65. Is music as important or less important in your country now as compared with the early days? What is the reason for this? (Fill in the 90's)\n\nPhotographs with our titles thereon shall be returned at no charge, but we do not guarantee their safety. People liked them so much per tune, but that didn't last very long. Instead of dies familiar records were used on these machines.\n\nBUSINESS AND SPECIAL INTERESTS\n\n66. Do you have any collections such as stamps, coins, paintings, autographs, etc.? A fair collection of postage stamps, Canadian copper coins, etc., would be appreciated.\n\n67. The stamp collection was started by me given to my son and came back to me under the terms of his will when he killed overseas in 1944. I am willing it to my grandson Robert Banting Widdess. The same is true about the coin collection.\n\nNo doubt, I became interested in coins because of my banking experience. And speaking of coins, in those early days we had York shillings which were half the value of a shilling. Several theorists tried to have the term \"two bits\" originated, have been paid here but I am still of the opinion that because it took two of the York shillings to make up a shilling, the expression \"two bits\" was coined.\n\n68. These York shillings were silver of course, and were called bits on land. In 1904 or thereabouts, the silver was replaced by copper.\n\n69. James McInnis, Moose Jaw, Sask.\n\nMint at Oleren, and was informed that copper coins had always been a girt with them up to Eaton's opening in Winnipeg, and that since then up to this time (1920) they had never been able to catch up with the demand.\n\n70. And talking about banking in those early pioneer times, reminds me that in 1903 the bank authorized my signature on their currency notes. They send out the unsigned script in sheets of five each. During the grain marketing season, these small tickets arrived almost daily, because we had to pay for the grain tickets in cash. This meant, we had to sign up enough every night to take care of the next day's business. The signatures had to be written in India Ink and allowed to dry without blotting. In the small hours of the morning spread out to dry. Then find a newspaper officer open in order to correct numerical order, have them cut into bundles of a hundred bills each and be on deck to back into the vault, snatch a hour or so sleep and be on deck to start paying them out for wheat tickets by ten o'clock in the morning.\n\nNow what do you think of that for a true \"mankato\" story?\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nESSELTE\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12968_1883M-Z_1910.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 54, "total-input-tokens": 89640, "total-output-tokens": 16208, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1267, 5], [1267, 1267, 6], [1267, 3554, 7], [3554, 5077, 8], [5077, 6781, 9], [6781, 8487, 10], [8487, 9877, 11], [9877, 11215, 12], [11215, 12528, 13], [12528, 13600, 14], [13600, 15671, 15], [15671, 17592, 16], [17592, 19136, 17], [19136, 20607, 18], [20607, 21961, 19], [21961, 23307, 20], [23307, 24315, 21], [24315, 25289, 22], [25289, 26605, 23], [26605, 26605, 24], [26605, 28946, 25], [28946, 30591, 26], [30591, 31037, 27], [31037, 31483, 28], [31483, 31483, 29], [31483, 31483, 30], [31483, 33270, 31], [33270, 34992, 32], [34992, 36524, 33], [36524, 37957, 34], [37957, 40318, 35], [40318, 42405, 36], [42405, 43118, 37], [43118, 43831, 38], [43831, 45374, 39], [45374, 46871, 40], [46871, 48253, 41], [48253, 49537, 42], [49537, 51060, 43], [51060, 52503, 44], [52503, 53797, 45], [53797, 55132, 46], [55132, 56135, 47], [56135, 57161, 48], [57161, 58897, 49], [58897, 60511, 50], [60511, 63165, 51], [63165, 63165, 52], [63165, 63328, 53], [63328, 63482, 54]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]