[{"id": "08ea74b2e13e1b0ee8ab852a412357c96dc555c1", "text": "Requested by Pembina Homemakers\n\nWhat did early Canadian pioneers eat?\n\nInstructions: Fill in as much of this questionnaire as you can and will it to Saskatchewan Archives Office, Box 100, University of Saskatchewan, Saskatoon, Sask.\n\nName: Mrs. Albert T. Calburn\nAddress: P.A.M.B.R.U.M., SASK.\nBirthplace: Villiersdale, Nova Scotia\n\n1. Introductory Questions\n   What year did you start housekeeping in Eastern Canada? 1929\n   Where did you get your housekeeping? Self-taught\n   Where had you been living before that? Nelson, British Columbia\n   For how many people did you prepare meals? 6\n   How far was it to your nearest store? 40 miles\n   How often could a visit be made to the store? Occasionally\n   What groceries did you usually buy in those earliest years?\n   Sugar, tea, coffee, salt, beans, soda & cream of tartar, oatmeal\n\n2. Flour and Other Grain Products\n   What brand of white flour did you use in the early years? Willard's Best\n   In what quantities did you buy it? 98 lbs\n   What was the usual price per hundred pounds of white flour? $3.50\n   How much did you use Graham flour? ...........................................\n   Whole wheat flour? ...............................................................\n   Was flour milled locally? Yes, how far away? 71, what year? 1909\n   What was the price for a twenty pound bag of rolled oats? $0.65\n   What other grain products did you use? ........................................\n   Cornmeal? .................................. Whole wheat? ............... Farine? ..............\n   Oats? ........................................ Did you grind your own wheat for porridge? Sometimes\n   How did you grind it? With a grinder\nRequest by Colburn家庭\n\nMiss A.B. BEA T. BALDWIN,\nP.A.M.B.KUN., SASK.,\nNorth Dakota, Willmar, Minnesota.\n\n1. What year did you start homesteading in North Dakota? 1909.\n\n2. What brand of wheat flour did you use in early years? Red Star.\n\n3. In what quantities did you buy flour? 100 lbs.\n\n4. How much did you pay per hundred pounds of flour? $8.50.\n\n5. Was there any other product you used? Yes, cornmeal.\n\n6. Did you grow your own wheat for personal use? Yes.\n\n7. How did you travel? By horseback.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 25 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $5.00.\n\nWhat brand of golden corn syrup did you use? Rogers Golden Syrup.\n\nWhat size of tin of syrup did you usually buy? 10 oz.\n\nAt what price? $6.00.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Cow.\n\nButter? Made own.\n\nEggs? Had hens.\n\nWhat was the price of butter? $2.50.\n\nDid you pack eggs for winter? Yes.\n\nDid you make butter? Yes.\n\nWhat kind of cheese? Cottage Cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Cured meat.\n\nHow did you get fresh meat? Did without.\n\nHow often did you get fresh meat?\n\nHow did you preserve meat? Brine.\n\nWas there a \"beef ring\" in your neighborhood? No.\n\nIf so what year was it organized?\n\nDid you use game? Yes.\n\nWhat kinds? Pheasant, Pheasant Chicken.\n\nFor how long?\n\nWhat part did fish play in the family diet? Could not procure fresh.\n\nWas the fish fresh, cured, or canned?\n\nKinds? Salmon, Hardines.\n3. Animals and Stoves\n\nIn what quantity did you buy cattle in memory? [Handwritten text not legible]\n\nWhat was the price for a ton of milk? [Handwritten text not legible]\n\nWhat breed of cattle were they? [Handwritten text not legible]\n\nWhat size of tivvy? [Handwritten text not legible]\n\nAt what price? [Handwritten text not legible]\n\n4. Dairy Products\n\nHow did you get a supply of fresh milk in the early days? [Handwritten text not legible]\n\nButter? [Handwritten text not legible]\n\nDid you make butter? [Handwritten text not legible]\n\nDid you make cheese? [Handwritten text not legible]\n\n5. Meat and Fish\n\nWhat was your meat supply in the early times? [Handwritten text not legible]\n\nHow did you get fresh meat? [Handwritten text not legible]\n\nHow often did you get fresh meat? [Handwritten text not legible]\n\nWas there a sheep range in your neighborhood? [Handwritten text not legible]\n\nIt so that year was it organized? [Handwritten text not legible]\n\nDid you use pans? [Handwritten text not legible]\n\nFor how long? [Handwritten text not legible]\n\nThat part did flesh play in the family diet? [Handwritten text not legible]\n6. BEVERAGES\n\nWhat kind of tea did you buy? [Handwritten: Keaton] At what price? [Handwritten: $.65]\n\nWhat kind of coffee did you buy? (beans or ground) [Handwritten: Beans] Price? [Handwritten: $3.25] That other beverages were used? [Handwritten: Coffee]\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? [Handwritten: $4.25] Could you get potatoes at the store? [Handwritten: Yes] If not, where from? [Handwritten: Mennonite Settlement] What year did you first grow your own supply for the winter of? [Handwritten: 1911] Potatoes [Handwritten: X] Cabbage [Handwritten: ] Carrots [Handwritten: X] Onions [Handwritten: X] Turnips [Handwritten: X] Beets [Handwritten: ]\n\nIn what quantities did you buy white navy beans? [Handwritten: 20 lbs] How did you buy prunes, (in bulk or by the box)? [Handwritten: Bulk] What weight? [Handwritten: 25 lbs] How did the grocer handle prunes (by box)? [Handwritten: None] What was the price of prunes? [Handwritten: $2.85 for 25 lbs] What other dried fruits did you use in the earliest days? (apricots, pears, apricots, peaches, loganberries, raisins, currents or others)? [Handwritten: Raisins]\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? [Handwritten: No] Peas? [Handwritten: ] Corn? [Handwritten: ] Beans? [Handwritten: (Saskatoons? Berries)] Other foods? [Handwritten: ]\n\nWhat year did you first preserve fruit by canning? [Handwritten: 1912] What year did you first preserve vegetables by canning? [Handwritten: 1912] What year did you first preserve meat by canning? [Handwritten: 1912] Do you still preserve foods by canning or drying? [Handwritten: Canning] To what extent? [Handwritten: Vegetables for Winter & some meat & chicken] Did you make your own vinegar? [Handwritten: No]\n6. Buy Annual:\n   What kind of tea did you buy? (name or brand) ... \n   Price ... $5.25\n\n7. Buy Annual:\n   What was the price of potatoes per bushel?\n   If not, where from? ... \n   What year did you first grow your own supply for the number of: \n   Potatoes ... X ... Carrots ... \n   Turnips ... X ... Beets ... \n   In what quantities did you buy? (in bulk or by the box)?\n   How did you pay? ... \n   How did the grower handle your purchase? \n   What other dried fruits did you use in the earliest days? (apricots, peaches, pears)\n\n8. Preserving:\n   In the early years did you preserve any foods by tryin' in? \n   Peas ... \n   Beans ... \n   Peas ... \n   That year did you first preserve? ... \n   That year did you first preserve? ... \n   Do you still preserve foods by similar or different methods? \n\nTo what extent? \n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | How was it sold? - In bulk, 10 lb. sack, etc. | Ask you usually bought at one time. | Price of this amount |\n|-----------------------------|-----------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits               | Bulk                                          | 1 lb. 10                           |                     |\n| Macaroni                    |                                               |                                    |                     |\n| Graham flour                |                                               |                                    |                     |\n| Brown sugar                 |                                               |                                    |                     |\n| Molasses                    |                                               |                                    |                     |\n| Table salt                  |                                               |                                    |                     |\n| Common salt                 |                                               |                                    |                     |\n| Lily white syrup            |                                               |                                    |                     |\n| Pellet soap                 |                                               |                                    |                     |\n| Baking powder               |                                               |                                    |                     |\n| Baking soda                 |                                               |                                    |                     |\n| Dried peas                  |                                               |                                    |                     |\n| Dried corn                  |                                               |                                    |                     |\n| Vinegar                     |                                               |                                    |                     |\n| Raisins - seeded            |                                               |                                    |                     |\n| Raisins - seedless          |                                               |                                    |                     |\n| Rice                        |                                               |                                    |                     |\n| Currants                    |                                               |                                    |                     |\n| Store jam - kinds?          |                                               |                                    |                     |\n| Cheese (Cheddar or store cheese) |                                               |                                    |                     |\n| Vanilla                     |                                               |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Home made\n\nDid you make yeast for your own use? Yes\n\nUsing hops? Yes\n\nDid you buy baking powder? Yes\n\nCream of tartar? Yes\n\nDid you make your own baking powder? No\n1912 Railroad was built & store was stocked with practically all these items\n\n10. Baking\n   - What type of yeast did you need?\n     - Using starter? Yes\n     - Using hops? No\n     - Did you buy baking powder? Yes\n     - Green or tartar? Tartar\n\nDid you make your own baking powder? Yes\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | 1912                                   | 15                           |                                               |\n| Canned sardines             | 1912                                   | 5                            |                                               |\n| Other canned fish that appeared early - give names |                                |                              |                                               |\n| Apples - fresh              | 1912                                   |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - Fresh            | 1912                                   |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     | 1912                                   |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names |                                |                              |                                               |\n| Pearl tapioca               | 1912                                   |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        | 1912                                   |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ..................................................................\n\nHow far was this water from your home? ...................................................\n\nHow was it brought to the home? (pail, barrel, tank) ...........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nPlastic Hard & Soft Water Containers,\nbuilt in 1948, 1926.\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (well, river, stream, dugout)\n\nIf so, was this water free from your house? Yes\n\nIf not, was it brought to the house? (well, barrel, tank)\n\nHas there been any shortage which has been taken place since you have started your homesteading, giving dates where possible.\n\nFirst start a water boiler.\n\nPlane Hard & Soft Water boiler.\n\nBulletin 1948. No. 25.\n13. SOAP\n\nDid you buy laundry soap or make your own? Both\n\nIf you made your own, did you use lye? Yes, wood ashes?\n\nWhat kinds of laundry soap did the grocer handle? Naphtha & Royal Blue\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Buffalo Chips\n\nWhere did you get your fuel? From the Prairie\n\nLignite or Salt Coal\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAbout 1917 we used kerosene stoves then Caroline & at present using Propane Gas\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) No\n\nDid you use an outdoor fireplace or bake oven? (Give dates) No\n\nBy whom was your first cook stove made? Hot Water Small Range\n\nWhat year was it purchased? 1910 Price? $21\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Tin\n\nFor preparing food? (china, earthenware, wooden bowls, other) Earthenware\n\nWhen did you first see enamel ware? 1910\n\nAluminum? 1897-1907\nad-plantation.\n\n13. GAMES\n\nDid you play any? Did you use any games? If so, what kind?\n\n14. FUEL\n\nWhat fuel did you use in the winter last season? (Give dates)\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Name)\n\nThat year was it purchased? (Year)\n\nThat type was it? (Iron, cast iron, copper, tin)\n\nFor preparing food? (chili, earthenware, wooden bowls, other)\n\nFurthermore\n\n1917\n\n1907\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nMany articles are wrapped in cellulose. Waxed paper, kraft paper.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nPorridge. Tea. Bread. Butter. Eggs\n\n18. What was served for your first Christmas dinner in Western Canada? Give the menu. List those present and give their approximate ages at that time.\n\nThanksgiving Dinner. Turkey, vegetables, pickles, cranberry sauce.\n\nMr. & Mrs. Colburn. about 34 & 35.\nFirst children age 9 & 7. Viva & Mary.\nMr. & Mrs. Pete Gambee. age about 32 & 28.\nGlen & Choice. Age 5 & 3. Gambee.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nNo.\nMany articles are unsatisfactory in Hamilton.\n\nPrudgie, Tea, Bread, Butter, Eggs\n\n17. Give a special dinner (grandfather, humor & appeal) for the brilliant children who have been so helpful. Give also the prizes and tell them how much they have helped.\n\n18. Mr. & Mrs. Colburn, about 34 or 35.\n\nGrand children age 9 or 7. Viva & May.\n\nMr. & Mrs. Pete Garibee, age about 32 or 33.\n\nMrs. & Mrs. Colburn, 7 children, 5 children, 3 children.\n\n19. Have you served your first Christmas dinner in eastern Canada? 1909.\n\n20. How did you serve your first Christmas dinner? 1909.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and preparing foods in order to illustrate planning laws in Eastern Canada and methods used in planning, quality methods of recommendation, processing products of today, storages and other details. Use back of paper if more space is needed.\n21. When did you begin to rely on purchased foods instead of homemade and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details. Draw your early experiences of buying Georgia and southern foods in your years before pioneer days in certain sections. Include things not mentioned above, quality, methods of merchandising, prices, problems or successes, shipments and other details. Use back if space is needed.\n\nIn your question where did you start?\n\nStone Harbor, NJ. Answered by company.\n\nHe had a horseback ride on 5/7-11-11. We left there 8/1909 in April. Answered by company.\n\nOr other time. Answered by company.\n\nbut 2 months later a P.O. was opened at Stone Harbor... which was closed when the railroad came through. We got a P.O. at Pamplin.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12939_1909_259.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4775, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1688, 3], [1688, 2185, 4], [2185, 3214, 5], [3214, 4342, 6], [4342, 6152, 7], [6152, 7002, 8], [7002, 10476, 9], [10476, 10762, 10], [10762, 14599, 11], [14599, 15022, 12], [15022, 16085, 13], [16085, 16669, 14], [16669, 17658, 15], [17658, 18228, 16], [18228, 18822, 17], [18822, 19613, 18], [19613, 19768, 19], [19768, 19919, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]