[{"id": "0a3bf78140ed507f47b9b4b007738d99b64fe453", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What It Was,\" and No. 2, entitled \"Pioneers' Life,\" are still being compiled. If you have already answered these, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health\n( ) Pioneer birth and death\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Susan T. Tucker\n\n2. Your address: Buttenworth, Sask., Bay 190\n\n3. Date: April 16th, 1952\n\n4. Where were you born? (Give name of place and country): Linwood, Minnesota, U.S.A.\n\n5. What was your father's name and occupation?: Sanford Broadhead - farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 25th, 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Linwood and Bethel, Minnesota\n   1880 - 1898\n   1898 - 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 25 years\n\n9. What were your reasons for coming West? Desire to get rich quick, war my husband's reason. My desire was to leave the cyclonic wind storms behind me. Minnesota is a very wooded state and noted for high velocity winds.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    Government propaganda booklets were circulated hyping the virtues of a new land. No cyclonic winds, no hail storms, a land of opportunity - well suited to settlement, Indians to stalk, place 160 acres of supposedly good wheat land - and all honesty a romantic young man's venture and his young wife's desire to share it.\nTucker, Mrs. Susan\nBox 190, Rosetown.\n\nTo Sask. - May, 1905\n\nSASKATCHEWAN ARCHIVES INTERVIEWERS\nNo. 2\n\nPIONEER EXPERIENCES A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: Mrs. Susan Tucker\n2. Your address: Rosetown, Saskatchewan\n3. Date: April 14, 1934\n4. Where were you born? Rosetown, Saskatchewan, Canada\n5. What was your father's name and occupation? Sanford B. Tucker - farmer\n6. When did you come to Saskatchewan? (Give month and year) May 25, 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\nSanford and Ruthie Minnich\n1898 - 1905\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child.\")\n\n9. What were your reasons for coming West?\n\n\"I came west because I knew the climate would be more suitable for me. We needed a way to make a living.\"\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n\"I learned about the West through friends who had already moved there.\"\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought we were crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? By ourselves - husband, wife and four children.\n\n13. What means of transportation did you use? Railroad - and here they are in a descent.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.). A former school boy met me at Crack Lock, and we were driven in a democrat behind a spirited team down into what looked like the depths of Hell - just at even tide. This turned out to be Beaver Creek valley. We ended up that night - mother, father and our four children at a brother's former neighbor, one-room shack. There was only bunk bed, with the children about six while my husband and I slept in a back parlor. It was an unforgettable night.\n\n15. Where did you first stay when you arrived in Saskatchewan? We slept and lived in a two-room house, had windowless shack. If I'd had the money and opportunity I would have returned to the States. The prospectors really got us alive, and the children had to walk.\n\n16. Where did you settle or take up land? Crack Lock.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Green Brier, Lock - May 1910\n\n18. How did you earn a living before coming to Western Canada? How after you came? Store keeper. We farmed. Cows, chickens and pigs, and baked bread for tileless bachelors.\nII. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n\n13. What means of transportation did you use? Railroads — and\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. How long did you stay there?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How much money did you make?\n19. How often did you write to relatives or friends in your old home? The neighbors were friendly folk and our one trip to town helped us contact our neighbors.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Tucker, George S., Tucker, Minn., July 19th, 1895.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No — I hope not. Money did come and my husband probably was partly responsible. He loved the freedom of virgin land — and the turkey and geese and prairie chicken that flew over or about.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   None\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n   We were 3½ miles from the nearest one-room school. Our young children had to drive by horseback during the mosquitoes were so bad, the horse insisted on laying down and rolling. My husband had no time to define them, and they were only 9, 8 and 6 years old, so for months our school was postponed. It was a period of frustration and privation.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   We had Sunday school in our little school, with as many as 26 in attendance. We also attended Sunday School in our neighbor's homes. We traveled by horse team and sometimes by car. We were 15 miles from the town of Craik, and weather permitting usually drove in back every week or two.\n19. How often did you write to relatives or friends in your old home? Write the date.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, how many?\n\n22. If other members of your family (brother, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. In these early pioneer days what stumped out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? For business, attending church, visiting friends, etc.? How easy? How far? By what means?\n\n25. What was the nearest school to your little home? How far away? How did you get there?\n25. When was the first car used in the community? 1914\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nWe moved from Chuck to Green River back in 1910. Our trading center was Green River until about 1913, and then we traded at Riverhurst.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.). We dealt here—at Riverhurst for years—until 1927 except when river froze over making ferry boat travel difficult via mail order.\n\n29. How often did you shop in the early days? All dry goods were purchased there. I called them door peddlers.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? Around 1927.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nI bought my first coat and hat there. I called it in 1909, and wore it on a visit back to the States that year. I decided on that visit home, I preferred my Canadian way of life.\n\nI bought all clothing necessities by mail order in early days. Perhaps half of food and buying the rest at local stores.\n\n32. When did you first have a telephone and what company provided it? 1922 Alexander Bell Co. - Rural service\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nNo, we were going to get rich quick and return to the States because we hoped each—and the next year would be even luckier year. Each year was worse than the last—drought, rust, grasshoppers, hail, and poor sandy soils. We planted more wheat some years than we harvested.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1911, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to your own appearance, lack of better means of travel, etc.) The nearest place at\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Salt Lake City, what was it with the idea of staying permanently? Why did you make up your mind after trying it out? When did you\n\n34. How were you able to get work here and what did you do? How long did you stay here? How much money did you earn? How did you feel about coming to Salt Lake City?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNone, than I can remember.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes - they trekked northward, away from the dust storms into the best company.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband was first president of the Local Grain Growers' Association. He was also an elder in the United Church. I was a charter member and vice-president of first Women's Aid Club - 1914.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\nBought the first piece dredge and full-size cattle in district in 1916. Some steers is still in neighborhood.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (2), (3).\n\nGreen Butte: Named after creeping clover and rose bushes, at original post-office site.\n\nRiverhurst: Built a few miles from South Saskatchewan River.\n5.\n\n34. Did any people move away from your district prior to 1912? If so, what reasons did they have for moving?\n\nNow, then you remember. He\n\n35. Did many people move away during the 1930s? Did many return?\n\nThey went northward, but returned.\n\n36. If you or some member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nMy great-grandfather was a member of the first automobile club organized in our district. He died in 1911.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district, mention it here, listing the date, place, etc., etc.\n\nThe first automobile club organized in our district was the First Ladies' Club in 1916.\n\n38. How did the places in your community get their names? (School district; Post Office; Villages; Railways; Station; Creek; Hill; etc.) Try to give (1) date and occupation of person suggesting place name; (2) origin and meaning of name; (3) date of its adoption; (4) any changes in names etc.; (5) reason why name was changed; (6) date and reason for change; (7) new name; (8) old name.\n\nGreen Bay was named after the creek that flows through it.\n\nAlluvial Point: Built a few miles from South Lake Tillery on Route 20.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.......\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMechanical change - from horse team era. Everyone owns a combine, tractor, car. Land is poor, but in most years crops are fair. Very few prospects left. Hard work performed by sons mostly.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMr. William Beckler Lucky Lake\nMr. W. J. Jones Sack.\nMr. Sherwood Morgan Sack.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nDaughter: Mrs. Dorothy L. Hoffman\nWife of Rosetown M.D. Rosetown Yard\nRosetown Sack.\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Instate your preference, if any)\n\nQ. If you have children or grandchildren, please give their names, where they live and occupations.\n\nA. First name please:\n\nWhat do you think are the most important changes in your province?\n\nMuch needed change - thrown\n\nforce team into\n\nburn a province, travel\n\ncan't stand in place, but in\n\nmust have priority left, but\n\nvery fast paced by both, mostly\n\nMr. Tucker, anyone builder? surely like\n\nMr. W. J. Murray\n\nMr. H. L. Murray\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address below.\n\nSignature: May Harveth S. Moffat\n\nType of hometown: Regina\n\nSignature: May Harveth S. Moffat\n\nSignature: Regina\n\nSignature: May Harveth S. Moffat\n\nSignature: Regina\nrecognized that the educational and political measures taken by our allies to denationalize the German population have been thorough but successful. Nazism still poisons the minds of very many Germans. There is no reason to believe that there is not the slightest assurance that the evil forces are not ready to continue their havoc at the first opportunity.\n\nThe effects of two decades of totalitarian teachings, of racist and militaristic propaganda, do not appear to have been checked.\n\nThe Canadian Jewish Congress before adjourning, the Government use its good offices to delay admission of Germany to the family of nations until it is clear that such a step will not involve the reliving over of the wicked record of the Nazis and until it is certain that such an admission will not strengthen the forces of totalitarianism in the world.\"\n\n**FILM GUILD COMES OF AGE**\n\nBritain's oldest film society, The Edinburgh Film Guild, this year celebrates its 50th anniversary. With a membership of over 2,000, it is thought to be one of the largest film societies in the world.\n\nClouded chicken houses and hail stones as big as hen's eggs ever happened.\n\nNever in my life, before or since, have I experienced such a feeling of well-being, all's right with the world as I would when my Dad signed the bill and said \"Everybody back to bed.\" Stern's all over.\n\nAs if of one accord, we came to life, some of us diving head-first into the apple barrel, others plunging our arms to the elbows in the dill pickle crock, searching for the biggest pickle. Up the stairs we would climb, laughing and joyfully spill milk to the water pail and with peace and contentment in our hearts—falling into bed—perhaps to dream of finding the old dill pickles and potatoes with great big juicy green eyes.\n\nAs I sit here and listen to the roar of the bulldozer as it excavates our new, big, up-to-date, modern community deep freeze storage locker plant, I feel sad, sad that my children's children will never have memories of the old food cellar, remember so vividly—and the delicious—my mother prepared from the contents therein.\n\nI wonder, as I roast my perfectly preserved, frozen-in-a-minute, big, juicy, tender corned beef, if future, will my family enjoy it as much as we enjoyed the corned beef and cabbage preserved so well in the old storm cellar? I wonder—oh, yes, I wonder,\n\nin financing the purchase of consumer goods.\n\nThe following requirements will be in effect when retail sales are made on the instalment plan on and after November 1, 1930:\n\n| Motor vehicles (e.g. passenger automobiles and motorcycles) | Minimum down payment | Maximum time to pay |\n|-------------------------------------------------------------|---------------------|---------------------|\n| All other consumer goods                                     | 20%                 | 18 months           |\n\nIn no case shall the down payment be less than $5.00.\n\n**INSTALMENT PAYMENTS** are to be in regular, approximately equal amounts of not less than $5.00 monthly or $1.25 weekly. Installment payments may be varied to meet the circumstances of persons such as farmers and commercial fishermen whose incomes are subject to seasonal fluctuations.\n\nSimilar terms apply to loans granted by banks or loan companies for the purpose of purchasing consumer goods at retail.\n\n**SPECIAL PROVISIONS ARE INCLUDED WITH REGARD TO REVOLVING CREDIT ACCOUNTS**, permanent budget accounts, current budget accounts, and similar plans involving payment for goods by regular instalments.\n\n**ORDINARY CHARGE ACCOUNTS ARE NOT DIRECTLY AFFECTED** by the present Regulations, but steps will be taken, if necessary, to see that charge accounts are not used to evade the regulations relating to instalment sales.\n\n**THE REGULATIONS REQUIRE SELLERS, LENDERS AND FINANCE COMPANIES** to maintain records of transactions, to make them available for inspection, and to furnish information on request to authorized representatives of the Government of Canada.\n\n**CONSUMER GOODS** include all goods with certain exceptions. A full list of these exceptions will be found in the Regulations.\n\nFor example, the Regulations DO NOT APPLY to sales of real estate, stocks, bonds, securities, goods for professional or business use, buses, trucks, building materials, implements and equipment used exclusively in farming and fishing.\n\nPenalties are provided for violation of the Regulations.\n\nMinister of Finance\n\nFor the convenience of the public, copies of The Consumer Credit (Temporary Provisions) Act and Consumer Credit Regulations will be available at branches of the Chartered Banks throughout Canada.\n\nInquiries and requests for additional copies should be addressed to:\n\nAdministrator of Consumer Credit,\n490 Sussex Street, Ottawa, Ontario.\nThe Old Storm Cellar\n\nWith the roar of a bull-dozer and the harsh grating sound of the cartage trucks ringing in my ears as they rip and tear the huge gaping hole in the earth for our new community's first freeze locker plant, I wonder; yes, I wonder how many remember it—the old storm cellar?\n\nI remember it. I remember it well.\n\nMy parents migrated from the woody cyclone Minnesota state in the early nineteen-hundreds to the Canadian prairie.\n\nFrom living in one extreme they reverted to the other, a pioneer homestead overseeing nothing but a flat expanse of prairie, nary a hill or a dale in sight.\n\nHow I, as a young one, hated that endless, bleak land with only the trees above meeting the horizon to break the view. The heat waves that rippled and shimmered in the distance on hot summer days filled me with a woebegone, desolate feeling that then unexplainable.\n\nMy parents, however, seemed to revel in that newly-found freedom of space and appreciated God's handiwork in its naked state. Nary a tree was planted on our homestead. They never ceased to be awed at the beautiful panoramas of the skies; sunsets, sunrises, the moon, the stars, rainbows, storm-clouds, sun-dogs. My folks were never earth-bound; they literally lived with their heads in the clouds. My dad, as well as his breed, delighted in the songs of the wild birds, war keys, geese, ducks of the air. How often I've heard my parents remark \"Wonderful country, this Canada. Space to see and live in. No chance of a storm sneaking up and catching us unawares in this country\"—No more!\n\nMy mother would often, come the cold winter evenings, hold us spellbound with true tales of her youth and homes of the far-off prairie winds that ripped and tore their way through her childhood territory, great trees snapping like match sticks; houses sailing through the sky like modern aeroplanes, barns, horses, cattle, pigs, all over single log coops, and Aunt Hattie our maiden aunt, hanging suspended by her long, beautiful hair in her nightdress, from the top of a huge oak tree. Aunt Hattie lived to tell the tale but died in her bed, partially scalped, head to her dying day.\n\nGrandma, a pioneer nurse in her own right, bound the injured messes back on with good thick, black molasses.\n\nThen there was cousin Tessie, who sailed through the tree tops, also in night attire, was frequently held in a neighbor's oat bin. She, poor girl, was innocent, but for years and years quite forever after, but we all loved hearing how cousin Tessie saved her wild oats.\n\nThe cellar meant that lumber was naturally an expensive commodity—and cement was virtually unknown. The roof had no fancy shingles but was covered with tar paper, lathed on. In as much as we young ones used to sleigh-ride from the roof to the ground on the banks of piled up snow, our house frequently leaked some rain on those days. But no one seemed to care overly much. At the first splash someone would run for a tin dipper. Occasionally the leak would spring unexpectedly over someone's bed and then Dad would hustle to tack on a new piece of tar paper.\n\nOh, I'm willing to admit our house was not as much as far as modern houses go and as the family grew, it grew room by room. But, by golly it did have one thing of which we were mightily proud: It had a storm cellar.\n\nMost pioneer homes, I think I can safely say all pioneer homes had a cellar—an ordinary hole in the ground beneath the house garden provision cellar. No fancy affairs, these either. At least ours wasn't. A few rough boards shelves held the jars of fruit, canned vegetables such as marrow, squash, pumpkin, cabbage, etc. This was more or less temporary produce and not expected to keep more than that last fall December. We also kept a small barrel of potatoes handy here for ready daily access. Our family, like most pioneer families was a big one; ten of us boys and girls all mixed up alive and kicking, and very discontented.\n\nFood, then as today, was of vital importance! It's true my mother's knowledge of balanced diets, vitamins and calories was nil in my early days, but she did realize, that the human frame as all, she must have healthy, happy children and not spindly, undernourished, mentally retarded ones.\n\nConsequently, my mother and dad usually gardened in a big way and always respected a bountiful harvest. Should nature fail, we had a bountiful supply of water in the form of a deep \"bucket on a rope\" well. How we youngsters hated that job! We were backwards, all.\n\nWatering the garden was our ob. At least we had to dip and carry the pails of water to the garden's edge. Mother and dad took it from there. The last one to the well was always a big, fat, monkey and no one seemed to mind it. At this job we were backwards, all.\n\nWith our own children in mind, nowadays, I shudder at the thought of what old pioneer women must have endured. If it hasn't been only a few feet from our kitchen door stood, the top of the cellar like a stick a foot or so off the ground. To each side, a two-by-four piece of lumber was nailed with nails that could sink the pail to the proper level for my slight weight. Invariably the pesky thing would disappear out of sight. Then there was to me a torturous thing—a bitter tug-o-war between the over-flowing pail on one end of the rope and me, a very disgruntled me, on the other end. One thing I can say, however, this hard over-stretching of the rope built up muscles on my forearms and a strength in my wrists, unknown to most puny females. These facts so impressed my sportsman Dad, he attempted to make a female puller just for me. He even went so far as to team me up with a brother two years older, for boxing lessons. Many a bout we've put on for the benefit of the visiting threshing crew. Mother eventually noticed my nose growing in size and leaning to one side, but put a stop to this unlady-like racket.\n\nBut in the meantime the gardens were watered, vegetables grew, the harvests were garnered and finally stored in our underground cellar and its neighbor, the风暴 cellar.\n\nNow the storm cellar was descriptive to the same as the ordinary cellar except it led away from the ordinary cellar by a dark underground passage. Not only this, it was a bit deeper and had the floor of our house here too. It was a place under the earth, beneath the frost line with only the sky above. To me it was an awesome thing. It had two main purposes: To store and preserve the quantities of garden produce we would consume until next year's harvest, and secondly to do just what its name implies: give protection from storms.\n\nIt was an odd-smelling place, not unpleasant and quite cool during the hot summer nights. It had offensive nerves. Not since my childhood days have I smelled a smell to equal it.\n\nMy Yankee grand-parents, thinking always of their dear daughter and family, each fall would ship several barrels of apples, sorghum syrup, brown sugar and a keg or two of apple cider. These commodities, in common with mother's canned tomatoes, preserved beans, preserved hams and corned beef, plus bushels of new spuds, blended to make an aroma I'll guarantee was unknown to any other pioneer family. We had occasion to smell it often.\n\nCome a hot, murky, clothes-stick-to-your-back kind of day, you would hear my dad and mother begin to mutter, \"This heat's terrible. Sure to blow up a storm tonight. We'll have a win and a half storm tonight. So hot and sticky, a person can't breathe. Sure to have a storm tonight.\" And sometimes it did.\n\nNot the kind of storms where parents had been accustomed to rain and lightning sometimes hail, but more often rainstorms. When these storms happened to burst upon us in the middle of a noon and sight we were rushed around and ushered into our trundle beds with the words, \"Hurry down to the storm cellar.\"\n\nKeep Out Nazis\n\nCJC Advises\n\n\"The admission of Nazis among any German immigrants who will be allowed into this country will endanger the harmonious pattern of Canadian life and will create security problems of the utmost degree,\" said the Canadian Jewish Congress today in a letter to Prime Minister Louis St. Laurent urging the utmost care in the admission of Germans.\n\nThe Jewish Congress said:\n\n\"The coming of any Nazi will necessarily, the community of Canadians of German origin whose record of contribution to our national life is so creative...the Government must be aware that the admission of any immigrant with a fascist background will complicate the security problems of our country at a time when the entire western world is giving rise to the most anxious concern as evidenced by recent American measures to prevent the entry of any person who at any time was a member of any totalitarian organization. Moreover, it would constitute a grave menace to democratic ideals if such an immigration brought to our shores those with so vile a heritage.\"\n\n\"We fear that unless the greatest caution and reserve is exercised in the face of these laws, Canada may be faced with grave moral, political and administrative problems which can be avoided at this juncture,\" wrote Mr. Samuel Bronfman, National President of the Canadian Jewish Congress.\n\nThe Congress urged the greatest reserve in all questions regarding Germany and German nations.\n\n\"Germany's wounds inflicted only a short time ago in an international initiative must be faced with grave moral, political and administrative problems which can be avoided at this juncture,\" wrote Mr. Samuel Bronfman, National President of the Canadian Jewish Congress.\n\nTo ignore these inhumanities and the formulation of Canada's Nazi policies is to ignore the sacrifice of six million Jewish victims and the German occupation of large parts of Europe.\n\nTo ignore these inhumanities and the formulation of Canada's Nazi policies is to ignore the sacrifice of six million Jewish victims and the German occupation of large parts of Europe.\n\nFurthermore, it is universally recognized that the extermination of Jews was not the kind of storms where parents had been accustomed to rain and lightning sometimes hail, but more often rainstorms. When these storms happened to burst upon us in the middle of a noon and sight we were rushed around and ushered into our trundle beds with the words, \"Hurry down to the storm cellar.\"\nThe Old Storm Cellar\n\nWith the roar of a bull dozer and the sound of the earth age trucks ringing in my ears as they rip and tear at the earth, I remember it—the old storm cellar. I remember it. I remember it. I remember it.\n\nMy parents migrated from the early cyclonic Minnesota state to the Canadian prairie living in one extreme they left behind. They reverted to the other, a pioneer over someone's bed and their bed. Many but we were put up for the winter. Occasionally a tin dipper, unexpectedly dropped by a weary traveler would run into our new place. We weren't going to be the family grave yard. The heat waves that did have any thing to do with the weather were mighty proud. It had a storm cellar filled with hot, steamy days filled with hot, steamy nights.\n\nMost pioneer life, however, seemed to be a tale of hardship and a constant battle against the elements. My parents, however, were never heard to complain. They lived literally \"in the earth.\" Their heads in the clouds. My dad, as well as his brood, delighted in the sounds of the wind, rain, and snow. My mother was often seen smiling up at the sky during cold winter evenings, holding tales of her youth—her home of the prairie—her childhood—her memories of the prairie. Aunt Hattie lived to tell the tale but bore a scar on her face. She finally escaped death by hanging herself from an oak tree. Aunt Hattie lived to tell the tale but bore a scar on her face.\nThe Stay-at-Home\n\nOh, I'm willing to admit our house was modest, far as most homes go; as much so as the great new grow-room by room. But, by golly it did have one thing in which we were blessed. If there was a storm cellar.\n\nMost pioneer homes, I think, I am safely saying, all pioneer holes in the ground beneath the house, garages, cellars, whatever they may be called, there either. At least ours wasn't. A few rough boards over a stone foundation, and a few crude bins for the easily stored winter vegetables such as marrow, turnips, carrots, and even potatoes was more or less temporary produce was not expected to keep much longer than the first snows came down. This hole kept a small bin of potatoes handy here for ready daily access. Our house was a two-room affair, and our family was a big one; ten of us boys and girls all mixed up, alive and well, and very happy.\n\nFood, then, was today, was of vital importance. It's true my mother's cooking was rather simple, but the food was always good, and she knew how to make it taste good. She was a hard worker, and her meals were always hearty and nourishing.\n\nOne day, while we were playing outside, we heard a loud noise coming from the direction of the woods. We ran to see what was happening, and found a large tree had fallen across the road. We knew we had to get out of the way quickly, so we ran back to the house and told our parents about it. They told us to stay inside until the storm passed.\n\nThat night, we heard thunder and lightning outside, and we knew we were safe inside our house. The next morning, we went outside to see the damage caused by the storm. We were amazed at the destruction caused by the wind and rain.\n\nOur house was typical of most early pioneer dwellings. It started out being a squat two-room cabin built on a hillside, and was banked with nature's bountiful prairie soil—plain, ordinary dirt. Thirty miles by sleigh or wagon horse team to the nearest railway.\n\nThe Stay-at-Home\n\nThe Canadian Film Guild comes of age\n\nBritain's oldest film society, The Edinburgh Film Guild, this year celebrates its 21st anniversary. With more than 3,500 members, it is thought to be one of the largest film societies in the world.\n\nThe guild offers a wide range of films, from classic silent movies to contemporary dramas. Members can attend screenings at local movie theaters or watch films at home via streaming services.\n\nThe guild also hosts regular events, such as film festivals and workshops, to promote the art of filmmaking. Members can participate in these events and meet other film enthusiasts.\n\nThe guild's mission is to promote the art of filmmaking and to provide a platform for independent filmmakers to showcase their work. The guild supports local filmmakers and encourages them to create unique and innovative films.\n\nThe guild's membership is open to anyone who is interested in filmmaking. Members can join for a small fee and receive a variety of benefits, including discounts on tickets and merchandise.\n\nFor more information about the guild, visit their website at www.edinburghfilmguild.org.\nGigantic Clothing Sale\n\nRed & White Store, Eatonia - Beginning Thurs., Nov. 2 - Ends Fri., Nov. 10\n\nNOW is the time to buy economically. Merchandise is going up with a BANG! This is your opportunity to purchase your family needs at the lowest prices imaginable. You won't believe it until you visit us during our Annual Clothing Sale! We handle the Best Merchandise and Guarantee You Satisfaction in your Every Purchase.\n\n100 LADIES' DRESSES $2.98\n$1.98\n\nWomen's Nylon Hose $1.98\n\nJust Arrived!\n100 Ladies Fall and Winter COATS $9.95\n\nLADIES' BLouses $3.49\n\nLadies' Flannel-lined Bloomers $7.9c\n\nAttention Men -\n75 Pairs Dress Pants $2.98\n\nMen's Coats\nElysian, Macambo, and Station Wagon Coats\n\nMen's Forrythe Dress Shirts\n20% Off\n\nMen's Dress Shirts and Sport Shirts\nZippers and Button Fronts\n\nLadies' Pajamas $3.29\n\nLadies' Nightgowns $2.98\n\nLadies' Jackets\nPlaid - Clearance sale EXACTLY 20 percent OFF\n\nLadies' Panties and Briefs $1.79\n\n150 pairs Men's Gabardine Worsted Dress Pants $3.99\n\nMen's Hats Smithbilt $1.98\n\nAll Boys' Dress and Work Pants to Clear 20 percent Off\n\nMen's Underwear\nDarned Stockings $1.98\n\nBargain Table\nWhere Merchandise is practically Given Away\n\nCash Only - No Refunds or Exchanges\n\nW. Rabofsky, Prop.\nPhone 25\nGigantic Clothing Sale\n\nRed & White Store, Eatonia - Beginning Thurs., Nov. 2 - Ends Fri., Nov. 10\n\nNOW is the time to buy economically. Merchandise is going up with a BANG! This is your opportunity to purchase your family needs at the lowest prices imaginable. You won't believe it until you visit us during our Annual Clothing Sale! We handle the best Merchandise and Guarantee You Satisfaction in your Every Purchase.\n\nLadies' and Children's SLIPPERS 69¢\n\n100 LADIES' DRESSES $2.98\n$1.98\n\nWomen's Nylon HOSE $1.98\n\nJust Arrived!\n100 Ladies' Fall and Winter COATS\n15% OFF\n\nMen's Cotton Work Pants $2.98\n\nMen's Coats\nElysian Macaroon, and Station Wagon Coats\n\nMen's Forrythe Dress Shirts\n20% Off\n\nMen's Dress Shirts and Sport Shirts\n$3.29\n\n- Attention Men -\n75 Pairs Dress Pants\n$3.99\n\nMen's Hats\nSmithbilt\n\nNewly Arrived ...\nMen's English Worsted SUITS\n\n10% OFF\nBLANKETS\n\n15% OFF\n\nBARGAIN TABLE\nWhere Merchandise is practically Given Away\n\nCASH ONLY - NO REFUNDS OR EXCHANGES\nW. RABOFSKY, Prop.\nPHONE 25", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_877.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 9935, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1625, 5], [1625, 1625, 6], [1625, 3348, 7], [3348, 4693, 8], [4693, 6258, 9], [6258, 6932, 10], [6932, 8581, 11], [8581, 9319, 12], [9319, 11264, 13], [11264, 12359, 14], [12359, 13876, 15], [13876, 15147, 16], [15147, 16532, 17], [16532, 17545, 18], [17545, 22314, 19], [22314, 22314, 20], [22314, 22314, 21], [22314, 22314, 22], [22314, 32592, 23], [32592, 34026, 24], [34026, 37124, 25], [37124, 37124, 26], [37124, 38366, 27], [38366, 39371, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]