[{"id": "099f79bc35c37a4a95af82959616cebd27d934b4", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: Fred Davies\nAddress: Salt Lake, Sask.\nBirthplace: Manchester, England\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1883\nWhere did you set up housekeeping? 15 miles west of Salt Lake, but bought land there.\nWhere had you been living before that? England, city of Manchester.\nFor how many people did you prepare meals? There were six in family (4 children).\nHow far was it to your nearest store? 2 miles.\nHow often could a visit be made to the store? Not very often, had to walk.\nWhat groceries did you usually buy in those earliest years? Flour, molasses, and molasses, some rice, some dried apples in string, pearl barley, a little tea (no coffee was sold), dried white beans, baking powder, B.Soda, candles, matches (matches did not use tobacco, plugs and)\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years?\nIn what quantities did you buy it? The Bag.\nWhat was the usual price per hundred pounds of white flour? In 1893 $4.50.\nHow much did you use graham flour? None.\nWhole wheat flour? Yes.\nWas flour milled locally? No, far away? 20 miles. What year? 1890.\nWhat was the price for a twenty pound bag of rolled oats? Sold by the pound.\nWhat other grain products did you use? Rice, oatmeal was parboiled.\nCornmeal? Yes, some. Whole Wheat? Yes, Bread. Farina? Not until about 1904.\nOther?\nDid you grind your own wheat for porridge? At times, of course.\nHow did you grind it? Little hand mills.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Price in 1934 we bought 8 lbs worth for $1.00.\n\nWhat was the price for a ten pound sack of white sugar? From 10 to 25¢ per lb.\n\nWhat brand of golden corn syrup did you use? No brand for years, R.J. Dorphum.\n\nWhat size of tin of syrup did you usually buy? 1 liter, you all used 1 pound each, usually 20¢.\n\nAt what price? A big lot of 6¢ each for eight dollars, Dorphum.\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? In milk for two years.\n\nDid you get butter? Yes, Pound or sacks for 40¢.\n\nDid you pack eggs for winter? Yes, in lots, how? Usually in frozen water.\n\nDid you make butter? Yes, when the cows gave?\n\nWhat kind of cheese? Any case, hard mixed with sugar and cream.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Rabbits and P. Chicken ducks.\n\nHow did you get fresh meat? Hunted, shot and smoked it.\n\nHow often did you get fresh meat? Almost daily, Game, late hops.\n\nHow did you preserve meat? Salt and smoked it.\n\nWas there a \"beef ring\" in your neighborhood? Yes in 1910.\n\nIf so what year was it organized? Around 1905 or 1910, I think.\n\nDid you use game? Constantly.\n\nWhat kinds? Rabbit, chicken, ducks, pheasant, quail.\n\nFor how long? For many years.\n\nWhat part did fish play in the family diet? Fish in lakes, huge cat.\n\nDid you buy canned fish too high priced, fish very seldom any place.\n\nWas the fish fresh, cured, or canned? Any way you could get it.\n\nKinds? Fresh fish, Pike, perch, lake perch, canned salmon brings the\n6. BEVERAGES\n\nWhat kind of tea did you buy? Both black and green\nAt what price? 40¢ lb.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee used, a few beans\nPrice? About 3¢ lb.\nThat other beverages were used? Black Body ground up\nSome used canned what for coffee\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\nHow much?\nCould you get potatoes at the store? Yes\nIf not, where from? Not until we raised some about 1886\n\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1886 Cabbage 1888 Carrots same Onions same\nTurnips same Beets same\n\nIn what quantities did you buy white navy beans? By the lb usually 10 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? Fruit in bulk, later by the box\nWhat weight? 5 lb. 25 lbs How did the grocer handle prunes (by box)? Both ways\n\nWhat was the price of prunes? 9.25¢ lb.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\nDried apples, dates, Dried peaches, Apricots\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes dried Saskatoons\npeas? corn? beans? Saskatoons? Yes\nother foods? Pumpkins\n\nWhat year did you first preserve fruit by canning? 1910 to 1913\n\nWhat year did you first preserve vegetables by canning? Same\n\nWhat year did you first preserve meat by canning? Several years later\n\nDo you still preserve foods by canning or drying? Only occasionally\n\nTo what extent? From 50 to over a hundred bottles\n\nDid you make your own vinegar? Yes in the very early years, then sold in stores\n9. What type of yeast did you use? Royal yeast for years and years\n\nDid you make yeast for your own use? Yes, self rising\n\nUsing hops? No, salt rising? Yes, occasionally cheaper\n\nDid you buy baker's powder? Lots of it, baking soda? Yes, strongly preferred it\n\nGrains of barley? Yes, same, did you make your own baking powder? No\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same period to-day? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               | From earliest year, cheap then, today very much dearer |                              |                                               |\n| Canned sardines             | Occasionally                           |                              |                                               |\n| Other canned fish that appear earlyly - give names | Pilchards. Cheap and tasty |                              |                                               |\n| Apples - fresh              | Then no, now plentifully, dear today, high freight |                              |                                               |\n| dried                       | no                                     |                              |                                               |\n| Lettuce                     | yes                                    |                              |                                               |\n| Tomatoes - fresh            | yes                                    |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     | yes                                    |                              |                                               |\n| Lemons                      | yes                                    |                              |                                               |\n| Oranges                     | yes                                    |                              |                                               |\n| Cornflakes                  | greatly used                           |                              |                                               |\n| Other prepared breakfast cereals - give names | Puffed rice & wheat and many other belly fillers |                              |                                               |\n| Pearl tapioca               | I guess so don't know it               |                              |                                               |\n| Minuto tapioca              | yes                                    |                              |                                               |\n| Sago                        | yes                                    |                              |                                               |\n| Dates                       | yes                                    |                              |                                               |\n| Walnuts                     | yes                                    |                              |                                               |\n| Icing sugar                 | yes lots of it                         |                              |                                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) First through thin wells, then some used dugout water.\n\nHow far was this water from your home? Right on the farm.\n\nHow was it brought to the house? (pail, barrel, tank) Past Rand & Tank as needed.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. Some people too lazy to dig, hauled water for miles, others dug, and got good bed and indifferent water for 67 years; the water never failed to get a good supply on his own farm. Some water watchers found water successfully, some failed.\nThen he, now thankfully, dear old boy, high-flying.\n\nPilchards. Cheap and tasty.\n\nApples - Irish\nfried no\nLettuce\nTomatoes - fresh\ncanned yes\nBananas\nLemons\nOranges\nCornflakes greatly used\nOther prepared\nbreakfast - porridge\nor salad - give names.\nPearl tapioca\nInstant tapioca\nSugar\nDates\nSalmuta\nIced sugar\n\nyes tea fit\n\n12. WATER SUPPLY\n\nThere did you not water for drinking and for cooking? (Gail)\n\nIt or flour was this water from your house?\n\nIf so, was it brought to the house (pail, barrel, tank).\n\nRegarding water supply, mention any changes which have taken place since you left your old homestead, giving dates where possible.\n\nSome people had to carry\na day's supply for miles other day, and got so tired\nand inefficient - we often go 67 years old and never failed\nto get a good supply on his own farm. Some could not even\nfind water, occasionally, some failed\n13. SOAP\n\nDid you buy laundry soap or make your own?  \nIf you made your own, did you use lye?  \nWhat kinds of laundry soap did the grocer handle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days?  \nWhere did you get your fuel?  \nMention any changes in the use of fuels which have taken place since you first started housekeeping.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days?  \nDid you use an outdoor fireplace or bake oven?\n\nBy whom was your first cook stove made?  \nWhat year was it purchased?  \nWhat types of utensils did you use? (Iron, copper, tin, homestead)  \nFor preparing food? (china, earthenware, wooden bowls, other)  \nWhen did you first see enamel ware?  \nAluminum?\n13. **FIRE**\n\nDid you buy laundry soap or make your own? How did you do it?\n\nIf you made your own, did you use hot water? If so, how much did you use?\n\nWhat kind of laundry soap did you choose? Did you find it effective?\n\n---\n\n14. **FUEL**\n\nWhat fuel did you use in your home? Wood only?\n\nWhat did you use for your boiler? Hot water, steam, or electric?\n\nDid you use any form of fuel other than wood? If so, what was it?\n\n---\n\n15. **HEATING**\n\nFor cooking: Did you use an indoor fireplace or an outdoor stove?\n\nDid you use an outdoor fireplace or a wood stove?\n\n---\n\n16. **BUILDING MATERIALS**\n\nWhat type of materials did you use for your house?\n\nDid you use brick, stone, or concrete?\n\n---\n\n17. **CLOTHING**\n\nWhen did you first wear clothing made of cotton?\n\nWhen did you first wear clothing made of wool?\n\nWhen did you first wear clothing made of silk?\n\nWhen did you first wear clothing made of linen?\n\n---\n\n18. **METAL**\n\nWhen did you first use metal utensils?\n\nWhen did you first use metal cookware?\n\nWhen did you first use metal tools?\n\nWhen did you first use metal hardware?\n\n---\n\n19. **GLASS**\n\nWhen did you first use glass windows?\n\nWhen did you first use glass doors?\n\nWhen did you first use glass bottles?\n\nWhen did you first use glass jars?\n\n---\n\n20. **WOOD**\n\nWhen did you first use wood for construction?\n\nWhen did you first use wood for furniture?\n\nWhen did you first use wood for tools?\n\nWhen did you first use wood for utensils?\n\n---\n\n21. **STONE**\n\nWhen did you first use stone for construction?\n\nWhen did you first use stone for tools?\n\nWhen did you first use stone for utensils?\n\nWhen did you first use stone for utensils?\n\n---\n\n22. **BRICK**\n\nWhen did you first use brick for construction?\n\nWhen did you first use brick for tools?\n\nWhen did you first use brick for utensils?\n\nWhen did you first use brick for utensils?\n\n---\n\n23. **CONCRETE**\n\nWhen did you first use concrete for construction?\n\nWhen did you first use concrete for tools?\n\nWhen did you first use concrete for utensils?\n\nWhen did you first use concrete for utensils?\n\n---\n\n24. **IRON**\n\nWhen did you first use iron for construction?\n\nWhen did you first use iron for tools?\n\nWhen did you first use iron for utensils?\n\nWhen did you first use iron for utensils?\n\n---\n\n25. **STEEL**\n\nWhen did you first use steel for construction?\n\nWhen did you first use steel for tools?\n\nWhen did you first use steel for utensils?\n\nWhen did you first use steel for utensils?\n\n---\n\n26. **ALUMINUM**\n\nWhen did you first use aluminum for construction?\n\nWhen did you first use aluminum for tools?\n\nWhen did you first use aluminum for utensils?\n\nWhen did you first use aluminum for utensils?\n\n---\n\n27. **PLASTIC**\n\nWhen did you first use plastic for construction?\n\nWhen did you first use plastic for tools?\n\nWhen did you first use plastic for utensils?\n\nWhen did you first use plastic for utensils?\n\n---\n\n28. **OTHER**\n\nWhen did you first use other materials for construction?\n\nWhen did you first use other materials for tools?\n\nWhen did you first use other materials for utensils?\n\nWhen did you first use other materials for utensils?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nIn 1863, anything you could get but fried swine belly and the grease from pork was a treat. For breakfast:\nDinner, boiled rabbit, and cubes of fat pork, and B Powder dumplings and dessert of more molasses. Butter B Powder turns hard because no butter for several years, some boiled buckwheat, very little sugar, perhaps some dried apples. Some cold beans, possibly some cold boiled pork belly. These times were the painful dishes for poor people and with all these luxuries we never complained. Later when we got a cow or cows, we would milk milk and butter. I recall that the first event, a little Pigeon Chicken saved my life at a crucial time.\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\nRabbits, meat, fish. The menu. List those present and give their approximate ages at that time.\n\nFather & mother, between 40 and 50\nSister II, myself 8, Brother 6, sister 4. We did not celebrate in those days, but I remember my mother cried at the poor dinner we had.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nRabbits saved our lives without them, we children might have gone under. In the following summers we lived better. Black chicken flowers, Black birds and the occasional beaver helped out, but the beaver was an oily thing nauseating meat, it took a strong stomach to handle it, personally I preferred beaver or muskrat.\n17. Give a typical story, who (or what) was there? What happened? How did it end?\n\n18. Describe a meal you cooked or ate recently.\n\n19. How do you feel about living in our country?\n16. **TRAPPINGS AND CONTAINERS**\n\nDescribe any changes which you recall in the trappings and containers received with the food you purchased (give dates where possible).\n\n---\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nIn 1863, anything you could get but fed scarcely and the grease thrown over a fire. For breakfast, I had breakfast, dinner, boiled rabbit, and cuber of fat pork, and a brown dumpling and dessert of more molasses. Dinner B. B. had two hashpans no butter for several years, some boiled vegetables, very little sugar, perhaps some dried apples. Some cold beans, possibly some cold boiled pork belly. These times were the finest days for poor people and with all these luxuries we were compelled. Later when we got a cow or cows, we could in milk and butter. I myself did the first event, a little brown chicken serving life at a casual time.\n\n---\n\n18. What was your first Christmas dinner like? Give details.\n\n---\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nRabbits saved our lives without them, we children ought have gone under. In the following summer we lived better. Duck chicken flowers Black birds and the occasional badger helped out. But the badger was an oily thing nauseating meat, it took a strong stomach to handle it. Personally I preferred...\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest\nyear in which you lived. Include the names of the foods served.\n\n18. What was the most common food eaten by your family during the Depression?\n\n19. How did you handle the lack of food?\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nThe meals eaten in the earlier years were greatly less edible than present fare, and I have heard men claim that on pioneer food, a man was much better off. Gradually as livestock increased, the standard of living improved until today, we live in luxury. And kings or politicians live on the same foods as the ordinary man's families of today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\nThese changes have come so gradually that it is impossible to give data. Today our foods are semi-prepared, semi-cooked, less and less cooking is done by all walks of life. Housekeeping is so simplified that there is nothing to it; whereas in the early days you had to hunt and kill before you ate, and live off the land. I was a pioneer, I saw the whole experience of life and death, both plenty and semi-starvation. I would not wish to live it again. Incidentally, the good old days never existed.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Eastern Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nI claim that the mail order stores did much for the people. That the railways gave us good transportation. That the machine companies brought help, but they led us. That the mortgage companies brought capital into a country otherwise valueless, and set the wheels of progress rolling. And Lastly, that churches of all creeds gave comfort to both the living and the dying, and preached the word of God constantly and steadfastly through all the years of war and bloodshed. Amen.\n\nFred S. Baines.\n21. Then did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give us many details and ideas.)\n\n22. Please add other details from your early experiences of buying groceries and similar foods in your early pioneer days in Eastern Carolina.\n\nInclude items not mentioned above, quality, methods of merchandising, prices, problems of storage, characran and other details. (Use book of para II more space if needed.)\n\nI claim that the Lord's order alone did much for this people.\n\nThat the railways gave us good transportation.\n\nThat the machine brought us through help, but they did not.\n\nThat the machine brought us through help, but they did not.\n\nAnd lastly that Church of all needs gave comfort to God the living and the dying. And preached the word of God constantly and steadfastly through all the years of war and peace.\n\nBloodyshed. Amen.\n\nFred Williams\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12934_1883_12.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 5283, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1770, 5], [1770, 1770, 6], [1770, 3323, 7], [3323, 3323, 8], [3323, 4958, 9], [4958, 4958, 10], [4958, 5287, 11], [5287, 5287, 12], [5287, 9284, 13], [9284, 10156, 14], [10156, 10923, 15], [10923, 14019, 16], [14019, 15841, 17], [15841, 16022, 18], [16022, 17554, 19], [17554, 17815, 20], [17815, 19754, 21], [19754, 20666, 22], [20666, 20666, 23], [20666, 20666, 24]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]