[{"id": "92f6b09c00a646206386f06a9cd41dfd5a4013e5", "text": "Garratt, Alfred Webster\nMilestone, Sask. 1884.\nGarratt, Alfred Webster\nMilestone, Sask. 1884.\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions have not been answered by others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer church, religion and social life\n( ) Pioneer farming experiences\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan\nPIONEER EXPERIENCES\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as any other. Some of the questions have not been answered by your experience or your family's experience. The answers given will not reflect your experiences or those of your family.\n\nThe questionnaire is intended for persons who lived in Western Canada before 1924. It may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneer in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Saskatchewan\nGarratt, Alfred Webster\nMilestone, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your request.\n\n1. Your full name\n   Alfred Garratt\n\n2. Your address\n   Milestone, Sask.\n\n3. Date\n   1954\n\n4. Where were you born?\n   Milestone, Sask.\n\n5. What was your father's name and occupation?\n   William Smith, farmer\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1879\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Steinkopf, Ontario\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this if you would rather not or you may use \"I was a small child\", \"I was young\", etc).\n   I was 13 years old\n\n9. What were your reasons for coming West?\n   To acquire land for the family\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Through my uncle Jim\n\n    His kind-heartedness who came from Manitoba in 1879 and came fresh to Milestone in 1883\nGarratt, Alfred Webster\nMilestone, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Garratt, Alfred Webster\n2. Your address: Milestone, Sask.\n3. Date: 1954\n4. Where were you born? (Give name of place and country): Milestone, Sask., Canada\n5. What was your father's name and occupation?: William Henry Garratt\n6. When did you come to Saskatchewan? (Give month and year): June 1917\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.: Ontario\n8. How old were you when you first came to Western Canada? (Do not need to answer this question if you were under five years of age at that time): I was 13 years old\n9. What were your reasons for coming West?: To get away from the family\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    My uncle Jim Birland told me about it in 1917 and came to Milestone in 1918.\nGarratt, Alfred Webster\nMilestone, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Alfred Webster Garratt\n2. Your address: Milestone, Sask.\n3. Date: 15/5/47\n4. Where were you born? (Give name of place and country): Ontario\n5. What was your father's name and occupation?: William Henry Garratt\n6. When did you come to Saskatchewan? (Give month and year): 1894\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Ontario\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 13 years\n9. What were your reasons for coming West?: To make a living\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Through my uncle who came to Manitoba in 1897 and came back to Milestone in 1893\nGarratt, Alfred Webster\nMilestone, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name\n   Alfred Webster Garratt\n\n2. Your address\n   Milestone, Sask.\n\n3. Date\n   15/6/47\n\n4. Where were you born? (Give name of place and country)\n   Ontario, Canada\n\n5. What was your father's name and occupation?\n   William Henry Garratt\n\n6. When did you come to Saskatchewan? (Give month and year)\n   April 1897\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Ontario, Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n\n9. What were your reasons for coming West?\n   To make a living\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nThank you, my uncle Jim\n\nPoveshull, Alberta, 1897 and came back to Milestone in 1893\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGenerally it was considered a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith family members traveled by train.\n\n13. What means of transportation did you use?\n\nFrom Ontario through to Chicago and then to North West to Manitoba there.\n\n14. What incidents of the journey/meet do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIt was a long tedious journey and we were very anxious to get there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Bill Boyd's place at Hazel Vaughn.\n\n16. Where did you settle or take up land?\n\nIn Qu'Appelle, Saskatchewan.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBegan farming in Qu'Appelle in 1892 and moved to the farm in 1902.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nRunning the store, grain elevator, and general farming.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nGenerally it was considered a good move.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith other friends and family.\n\n13. What means of transportation did you use?\n\nFrom Ontario to Chicago by train.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIt was a long trip, very exciting.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt Bill Bowden's Hotel, Vauxhall.\n\n16. Where did you settle or take up land?\n\nIn Ontario, near Hamilton.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nBegan farming around 1892 and continued until 1902.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nRunning the local store, then farming.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n19. How often did you write to relatives or friends in your old home?\nToo far back for me to remember.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nI married Jennie L. Carlson & Webster\nSask on 22nd Feb 1911. We were blessed with two sons and two daughters.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nThey all came when I did and all settled in the Abernethy district. My only brother obtained a homestead near Abernethy and farmed all his life. My 4 sisters married and three of them found homes in Sask., one in Los Angeles.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\nThere was considerable excitement during the spring & summer of 1885 when the North West rebellion was at its height. Indian runners from Batoche, Daniel Albert came down contacting.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nAt first by open wagon. Then horses and buckboards became popular. Later on buggies began and automobiles appeared. It was not until well after the turn of the century that automobiles came into use.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where from?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For instance, returning of church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Any other comments or observations?\nThere was considerable excitement during the spring summer of 1885 when the North West Rebellion was at its height. Indian runners from Batoche and Prince Albert came down contacting the Indians on the Hill and Crooked Lake, warning them to join in a general uprising & intimidate the white settlers.\n\nThere were anxious days to hear if anyone had seen the Indians. The hills were covered with snow, however, none appeared that the Chiefs both promise ever seeing to remain loyal.\n\nUntil after the turn of the century that I know of, there was...\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nThere was considerable excitement during the spring & summer of 1885 when the North West rebellion was at its height. Indian reserves from Batoche and Prince Albert came down contacting the Indians on the Pine Hills and Crooked Lake reserves, urging them to join in a general uprising to exterminate the white settlers.\n\nThose were anxious days especially among the wives mothers of the district. It was, however, soon apparent that the chiefs of both reserves were going to remain loyal.\n\nUntil well after the turn of the century that automobiles came into use.\n24A\n\nThe story shifts to Milstone Lake.\n\ncame to Milstone in 1900 and secured a homestead. Went back to Minnesota and taught school for one year. Returned to Milstone from 1st-1902 and taught the first school for twenty years.\n\nwith a population of 600.\n\n29. How often did you shop in the early days?\n\nEvery day as needed.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nSince the beginning.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nFirst in 1900. The two little stores could not compete with Eaton's in those days. Telephone service was temporary service early in 1907. The town was incorporated in Sept 1907 and became a great boon to the community.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nPersonally I never had any intention or desire to leave this country since I first arrived in 1904. Milstone has proved to be one of the best agricultural districts in the West.\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan the first time with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. When did you leave this country forever?\n\n35. When did you arrive back in Canada?\n25. When was the first car used in your community? \n\n26. If you owned a car before 1914, when did you buy it? What made it?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns, highways, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Salt Lake City, what was it with the idea of staying in this city? Make up your mind after trying it out? When did you make this decision?\n\n34. Personally, I agree with our intention.\n25. When was the first post office in the community?\n26. If you moved & out before 1934, when did you buy it? What name?\n27. Where was your trading center? How far from your house?\n28. Did you continue to trade there? (Indicate any changes due to new towns opening, better means of travel, etc.)\n29. How often did you shop in the early days?\n30. How often did you shop in the early days?\n\n31. From (or ever) did you begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after buying at once? When did you make your decision to come permanently?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or any member of your family have held public office, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or any member of your family owns an automobile, combine, organizing the first league, etc., such as owning the first automobile, etc.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of the adoption (4) any changes in names since the first name was given, if any, and reason for change. Give facts of new name as above in (1), (2), (3).\n\n39. Write a number of anecdotes on the history of your town.\n34. Did any people move away from your district prior to 1927? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organization, mention it here, giving dates wherever possible.\n\n37. If you or some member of your family were friends with anyone who was active in the district section it here, giving dates wherever possible.\n\n38. If you or someone in your family owned an automobile, combine, organizing the first, etc., etc.\n\n39. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person submitting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, use and reasons for change. Give facts of new name as above in (1), (2), (3).\n\n40. How did the names of the townships come about?\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf so, (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\n1. The coming of the high powered tractors and\n2. The coming of the large mechanized trucks carrying\n3. The coming of the telephone and electricity\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Signature]\n\n[Signature]\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, old books of communications, old pamphlets, old photographs, written recollections and personal records? (Describe)\n\nWould you or the person who owns them either:\n\n1. Be willing to lend them to the Provincial Archivist for copying?\n2. Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n_________________________\nGarratt, Mr. Alfred Webster\nWilliston, Sask.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name .............................................. Alfred Webster Garratt\n2. Your address ................................................ Williston, Sask.\n3. Date .......................................................... September 11th, 1954\n4. Where were you born? (Give name of place and country)\n   At Stockdale, Ont.\n5. What was your father's name and occupation?\n   William Henry Garratt Farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   Arrive with my father and family at Indian Head N.W.T., May 1884\n7. Mention any other places where you have lived before coming to Saskatchewan, giving dates wherever possible.\n   At Linton, Ont., for about six years\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.)\n   I was in my teens, July 1884\n9. What were your reasons for coming West?\n   I came because my father and family came.\n10. How did you learn about the West? (Through other people? Reading about it?)\n    Railroad or Government information? Some relatives who settled in Manitoba in 1880 came East in winter of 1883 with glowing reports of Manitoba and the West. They strongly advised my father to go West with his family and get established in that great wide open country.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ................................................................. Alfred Webster Garratt\n2. Your address ........................................................................ Millestone, Sask.\n3. Date .................................................................................... September 11th, 1954\n4. Where were you born? (Give name of place and country) .... At Stockdale Ont.\n5. What was your father's name and occupation? ..................... William Henry Garratt Farmer\n6. When did you come to Saskatchewan? (Give month and year) Arrived with my father and family at Indian Head N.W.T.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ........................................ At Eldon Ont., for about six years\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"small child\") I was in my teens, etc.) July 14th, 1884.\n9. What were your reasons for coming West? ......................... I came because my father and family came.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?) Some relatives who settled in Manitoba in 1880 came East in winter of 1883 with glowing reports of Manitoba and the West. They strongly advised my father to go West with his family and get established in that great wide open country.\nTO THE\nThe Wawanesa Mutual Insurance Company\nWawanesa Manitoba\n\nAGENT'S MEMO\nFROM\nA. W. Carratt\nADDRESS\nMilestone Sask.\n\nATTENTION\nThe Secretary,\nDATE\nOctober 6th, 1954\n\nRe\nSaskatchewan Archives Office,\n\nDear Sir:\n\nI enclose herewith Saskatchewan Archives Questionnaires No.2 completed as well as I know how and an additional copy of same all in blank.\n\nI have also received Questionnaire No.7 which I am returning blank. A lot of it is only a repetition of No.2 and most of the rest, I think, is too foolish for a busy man to bother with. In No. 2 I referred to a little History of Milestone which I prepared about ten years ago and which contains all the happenings of the early days and the beginnings of things.\n\nYours truly,\n\n[Signature]\n\nPLEASE WRITE ABOUT ONE SUBJECT ONLY ON THIS SHEET\nTO THE\nThe Wawanesa Mutual Insurance Company\nWawanesa Manitoba\n\nAGENT'S MEMO\nFROM\nA. W. Carratt\nADDRESS\nMilestone Sask.\n\nATTENTION\nThe Secretary,\nSaskatchewan Archives Office,\nRe\nSaskatoon, Sask.\n\nDATE\nOctober 6th, 1954\n\nDear Sir:-\n\nI enclose herewith Saskatchewan Archives Questionnaires No.2 completed as well as I know how and an additional copy of same all in blank.\n\nI have also received Questionnaire No.7 which I am returning blank. A lot of it is only a repetition of No.2 and most of the rest, I think, is too foolish for a busy man to bother with. In No.2 I referred to a little 'History of Milestone' which I prepared about ten years ago and which contains all the happenings of the early days and the beginnings of things.\n\nYours truly,\n\n[Signature]\n\nPLEASE WRITE ABOUT ONE SUBJECT ONLY ON THIS SHEET\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very wise move and suggested that they might follow in the near future.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My father and a neighbor loaded a car with settlers' effects at Trenton Ont., about March 10th, 1884 and came West in an immigrant train. We crossed the St. Clair river at Sarnia Ont.\n\n13. How long did your journey take? From there we traveled by C.P.R. arriving at Indian Head, Man., 21st\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed over night at Bill Pottle's Hotel, a good host and was ready for our trip out next day. The homestead was about four miles southeast of the present town of Abernethy. We crossed the Qu'Appelle river at Blackmore. Located in later years.\n\n16. Where did you settle or take up land? See above, No. 15.\n\nMention any other places where you have lived since coming to Saskatchewan.\n\nMy father had built a small log shack in the fall of 1883 which only accommodated a couple of beds and a very few pieces of furniture. All household effects including a year's supply of food and fuel had been stored in a big tent near the shack. He went to build a suitable log house after arriving. Within ten days however, calamity hit them. A fierce prairie fire swept through the area and destroyed everything. They had very little money and a job of any kind was extremely hard to find. This was a dreadful blow to the family and my aunt finished my poor mother. At that time all the government relief would have been a God-send.\n\nIt was my job during the summer of 1889 and 1890...\nGARRATT, Mr. Alfred Webster\n\nMilestone, Sask.\n\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very wise move and suggested that they might follow in the near future.\n\n12. Did you travel by yourself or with a party (family), friends or other group?\n\nMy father and a neighbor loaded a car with settlers effects at Trenton Ont., about March 1864 and came West on an immigrant train. We crossed the St Clair river at Sarnia Ont., and then on our way through Chicago, Minneapolis, and on north through Emerson on to Winnipeg.\n\nFrom there we travelled by C.P.R. arriving at Indian Head, May 21st.\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nWriting by hand\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stood over night at Bill Boyd's Hotel and got a good rest and was ready for our trip out toward their house which was about four miles both the east and west of present day Indian Head. Located on the south side of the road.\n\n16. Where did you settle or take up land?\n\nSee above, no. 15.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nMy father had built a small log shack in the fall of 1883 which only accommodated a couple of beds and a very few pieces of furniture. It was a big tent near the shack. He used a hand saw and planned to build a suitable log house after seeding. But in the fall of 1884 he had to sell his land and move to another place. This was a great blow to the family and extremely hard to handle. My poor mother at that time slightest government relief would have been a God-send.\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very wise move and suggested that they might follow in the near future.\n\n12. Did you travel by yourself or with a party (family, friends, or other group)? My father and a neighbor located at Emerson, with settlers' effects at Trenton Ont., about 60 miles west of Emerson, embarked on the train. We crossed the North Clair River at Barrie Ont., and continued south through Emerson on to Winnipeg. From there we travelled by C.P.R. arriving at Indian Head, Jan. 21st.\n\n13. What route of transportation did you take? Through Emerson on to Winnipeg.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. How did you first stay when you arrived in Saskatchewan? Here did you first stay when you arrived in Saskatchewan? I stayed over night at Bill Boyce's Hotel. I got a good rest ready for our trip out toward the homestead which was ready for our trip out toward the homestead which was four miles south of the town of Aboretum. We passed the Quappelle River at Blackwood P.C.W. located 7 miles west of the town of Aboretum.\n\n16. Did you settle or take up land? Yes, No?\n\n17. Any other places where you have lived since coming to Saskatchewan?\n\n18. How did you earn a living before coming to Western Canada? How, after you came? My father was a farmer and the children pitched in an odd job occasionally. In the summer getting berries or hops. After coming West I got a job herding cattle at the handsome wage of 40s per day (not per hour). This included milking and all the other chores I could do. This was my job during the summers of 1894 and 1895.\n11. What did your friends and relatives think of your decision to come to Western Canada? Most of them thought it was a very wise move and suggested that they might follow in the near future.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? My father and I traveled together with a group of seven people from Trenton, Ont., about 150 miles north along the St. Clair River to Sarnia, Ont.\n\n13. How did you reach Winnipeg? We traveled north through Emerson on to Winnipeg via C.P.R. arriving at Indian Head, Sask., first.\n\n14. What incidents of the journey best do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed over night at Bill Road's Hotel. It was a good rest stop ready for our trip out toward the homestead which we had secured the year before. Our homestead was located four miles south east of Elkhorn, Sask., located on the Qu'Appelle River. In later years, did you settle or take up land?\n\n16. How did you earn a living before coming to Western Canada? How, after you came? My father was a farmer and the children pitched in an odd job occasionally. In the summer picking berries or hops. After coming West got a job handling cattle at the handsome wage of $40 per day (not parlor). This included milking and all the other chores I could do. This was my job during the summers of 1908 and 1909.\n19. How often did you write to relatives or friends in your old home?\nFifty years is too long a period to remember that.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of transport?\n\nAll the above answers were recorded by Mr. Webster.\n19. How often did you write to relatives or friends in your old home?\nFifty years is too long a period to remember that.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n\nI was only 14 and could not write then.\n\nFirst with a yoked oxen and afterwards horses and then a team of horses.\n\nAll the above were written over the 18 months from January to December.\n25. When was the first car used in the community? The first car was used in 1902 by Mr. Smith.\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the pioneer period.\n\n33. When did you first have a telephone and what company provided it?\n\n34. When did you first have electricity supplied by your town?\n25. When was the first car used in the community? The first car was used in 1902.\n\n26. If you owned a car before 1917, then did you buy it? What make?\n\n27. How far from your home?\n\n28. Did you continue to trade slaves? (Indicate any charges due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order or any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time, did you have the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n24. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates.\n\n37. If you or any of your family or friends were involved in anything in the district (such as owning the first automobile, organizing the first lodge, etc.), mention it here.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe town of Garrison was named in honor of Gen. Henry S. Garrison, who died in 1903.\n\nFrom 1875 to 1922, there was a post office called \"Garrison,\" which was moved to the town of Garrison when the town was incorporated in 1922.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firstly\" to have or do something in the district mention it here giving dates wherever possible (such as owning the first automobile, combining organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place name, (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for changes. Give facts of new name as above in (1), (2), (3).\n\nThe town of Davison was named in honor of Mr. Davison who lived there.\n\nFrom Elwood to Paragon there was a place called \"Pine Grove.\"\n\nThere was a big house where a man named Mr. Davison came from England to live. He built a big house there.\n\nHe was very successful in the Office. His name was one relative. We went to his place and saw his home.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old newspapers, pamphlets, old photographs, written recollections and reminiscences? (Pamphlets).\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\n1. The change in farming methods from the\n\n   - House main one family\n   - The summer house\n   - Factory and large industries\n   - The invention of electric power\n\n2. The invention of the automobile\n\n3. The appearance about 1905 of the automobile\n\n4. The high-powered farm tractors for power\n\n5. Electric equipment for the farm house\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have this person sign your name and address here:\n\n[Signature]\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old papers and programs, minute books of community organizations and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n\n1. be willing to lend them to the Provincial Archivist for copying?\n2. be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf so, please give their names, where they are located.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you lived there?\n\n42. Please list the names and addresses of other pioneers who could answer this questionnaire.\n\nIf anyone else has filled in this questionnaire for you, please have them sign here.\n\nPrint name and address here:\n\n[Signature]\n\n[Address]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_430.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 44, "total-input-tokens": 73040, "total-output-tokens": 11272, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 47, 3], [47, 94, 4], [94, 1588, 5], [1588, 3041, 6], [3041, 4272, 7], [4272, 5227, 8], [5227, 6411, 9], [6411, 7675, 10], [7675, 8760, 11], [8760, 9720, 12], [9720, 10240, 13], [10240, 10758, 14], [10758, 12180, 15], [12180, 12892, 16], [12892, 13439, 17], [13439, 14121, 18], [14121, 15504, 19], [15504, 16215, 20], [16215, 17231, 21], [17231, 18175, 22], [18175, 19115, 23], [19115, 20145, 24], [20145, 21319, 25], [21319, 22262, 26], [22262, 23979, 27], [23979, 25752, 28], [25752, 26546, 29], [26546, 27359, 30], [27359, 29234, 31], [29234, 31042, 32], [31042, 32835, 33], [32835, 34327, 34], [34327, 35103, 35], [35103, 36016, 36], [36016, 36937, 37], [36937, 37846, 38], [37846, 38968, 39], [38968, 40277, 40], [40277, 41588, 41], [41588, 42573, 42], [42573, 42728, 43], [42728, 42882, 44]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]