[{"id": "62b1342987b02094ef59aa3dff6840478a8201c5", "text": "1. **INTERVIEWER QUESTIONS**\n\n   - What year did you start housekeeping in eastern Canada? (213)\n   - Where did you set up housekeeping? England\n   - Where had you been living before that? England\n   - For how many people did you prepare meals? My husband and myself\n   - How far are you from your nearest store? Saskatoon, Canada\n   - How often could a visit be made to the store? Hardly at all\n   - What groceries did you usually buy in those earliest years?\n\n2. **FLOUR AND OTHER PRODUCTS**\n\n   - What brand of white flour did you use in the early days?\n     - Imperial\n   - In what quantities did you buy 142 at least two or three times a month?\n     - $1.75\n   - What was the usual price per hundred pounds of white flour?\n     - $1.75\n   - How much did you use of other flour?\n     - Imperial\n   - Was flour milled locally? Yes\n   - How far away? 36 miles\n   - What was the price for a twenty pound bag of rolled oats?\n     - 75¢\n   - What other grain products did you use?\n     - Cornmeal\n   - Others?\n     - None\n   - Did you grind your own wheat for porridge?\n     - Yes\n   - How did you grind it? By hand\n   - How did you grind it through three...\n1. THE WOMAN'S HOME\n\nWhat year did you start housekeeping? _______ _______ _______\nWhere did you set up housekeeping? _______ _______ _______\nWhere had you been living before that? _______ _______ _______\nFor how many people did you provide? _______ _______ _______\nHow far was it to your nearest store? _______ _______ _______\nHow often could a visit be made to the store? _______ _______ _______\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER PRODUCTS\n\nWhat brand of flour did you use? _______ _______ _______\nIn what quantities did you buy? _______ _______ _______\nThat was the usual price per hundred pounds of white flour? _______ _______ _______\nHow much did you use flour? _______ _______ _______\nWas flour milled locally? _______ _______ _______\nThat was the price for a twenty pound bag or rolled oats? _______ _______ _______\nWhat other grain products did you use? _______ _______ _______\nCornmeal _______ _______ _______\nOther? _______ _______ _______\n\nDid you retail your own wheat for milling? _______ _______ _______\nFor all the wheat milled at home, was the flour to grind in each batch? _______ _______ _______\nDid you sell through third party? _______ _______ _______\n3. SUGAR AND SYRUP\n\nIn what quantity did you buy sugar? (Specify amount.)\n\nWhat was the price for a ten pound sack of white sugar?\n\nWhat brand of golden syrup did you use?\n\nThat also of the syrup did you use?\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? (Specify amount.)\n\nThat was the price of butter?\n\nDid you make butter?\n\nDid you make cheese?\n\nDid you make butter?\n\nDid you make cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Usually sold fresh.\n\nHow did you get fresh meat?\n\nHow often did you eat fresh meat?\n\nHow did you preserve meat?\n\nWas there a \"meat ring\" in your neighborhood?\n\nIf so what was it organized?\n\nDid you use them?\n\nFor how long?\n\nWhat part did fish play in the family diet?\n\nWas the fish fresh, cured, or canned?\n\nWhen we could not buy it, we had to buy fish, which was very expensive.\n3. SHOWS AND STANDS\n\nIn what quantity did you buy this last summer? \n\nWhat was the price for a ten pound sack of whole wheat? \n\nWhat brand of molasses corn flour do you use? \n\nWhat size of tin do you prefer? \n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? \n\nButter? \n\nDid you make butter? \n\nDid you purchase butter? \n\nDid you purchase butter for winter storage? \n\nDid you purchase butter for other uses? \n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early days? \n\nHow did you get fresh meat? \n\nHow often did you eat fresh meat? \n\nHow did you preserve meat? \n\nWas there a \"meat wagon\" in your neighborhood? \n\nIf so, what year was it organized? \n\nDid you use games? \n\nFor how long? \n\nThat part did flesh play in the family diet? \n\nWas the flesh fresh, cured, or canned? \n\nWas the demand for lean cattle? \n\nWhen we could help it along\n6. **BUYING:** What kind of tea did you buy? At what price? That kind of coffee did you buy? (home or cream) That other beverage was what? Please list the full name of each item.\n\n7. **VEGETABLES AND FRUITS:** What was the price of potatoes per bushel when you got them? Could you get potatoes at the store? If not, where from? That year did you first grow your own supply for the winter of:\n\n- Turnips\n- Cabbage\n- Carrots\n- Beets\n- Apples\n- Apricots\n- Peaches\n\n8. **PRESERVING:** In the early years did you preserve any foods by:\n\n- Peas?\n- Corn?\n- Beans?\n- Other foods?\n\nThat year did you first preserve fruit by canning? That year did you first preserve vegetables by canning? That year did you first preserve meat by canning? Do you still preserve foods by canning or drying?\n\nTo what extent? Did you make your own vinegar?\n6. **BEANS**\n\n   What kind of beans did you buy? (Specify)\n\n   That kind of beans did you buy? (Specify)\n\n   How much did you buy? (Specify)\n\n   Did you grow any beans? (Specify)\n\n7. **VEGETABLES AND FRUITS**\n\n   What was the price of potatoes per bushel then? (Specify)\n\n   Could you get potatoes at the store? (Specify)\n\n   If not, where from?\n\n   That year did you first grow your own supply for the winter of:\n\n   Potatoes (Specify)\n\n   Turnips (Specify)\n\n   Cabbage (Specify)\n\n   Carrots (Specify)\n\n   Turnips (Specify)\n\n   Baked beans (Specify)\n\n   How did you buy prunes, (in bulk or by the box)?\n\n   How much did you pay?\n\n   What other dried fruits did you use in the earliest days? (Specify)\n\n   Apricots, peaches, plums, currants or others? (Specify)\n\n8. **PRESERVING**\n\n   In the early years did you preserve any foods by freezing? (Specify)\n\n   Other foods? (Specify)\n\n   That year did you first preserve fruit by canning? (Specify)\n\n   That year did you first preserve vegetables by canning? (Specify)\n\n   That year did you first preserve meat by canning? (Specify)\n\n   Do you still preserve foods by canning or freezing?\n\n   To what extent? (Specify)\n\n   Did you make your own vinegar? (Specify)\n| Item                  | Price |\n|----------------------|-------|\n| Salted biscuits      | 19/3  |\n| Macaroni             |       |\n| Graham flour         | 19/3  |\n| Brown sugar          | 19/3  |\n| Molasses             |       |\n| Table salt           | 19/3  |\n| Cream salt           |       |\n| Lily white syrup     |       |\n| Toilet soap          | 19/3  |\n| Jack fruit juice     |       |\n| Pickle sauce         |       |\n| Dried peas           |       |\n| Dutch wax            |       |\n| Minced meat          |       |\n| Raisins - seedless   |       |\n| Raisins - seedless   |       |\n| Nuts                 |       |\n| Currants             |       |\n| Store jam - kins     |       |\n| Cheese (Cheddar or store cheese) |       |\n| Vanilla              |       |\n\n9. Please fill in the following on the back of your card.\n\nYour way first. How was it? Any unusual remarks? Did you buy it at the store? Did you buy it at the store? Did you buy it at the store? Did you buy it at the store?\n\n10. Baking\n\nWhat type of yeast did you use? Did you make your own? Using starter? Using hops? Salt rising? Did you buy baking powder? Baking soda? Did you take your own baking powder?\n| Item                        | Price |\n|-----------------------------|-------|\n| Short Biscuits              | 4/5   |\n| Flour                       | 1/9   |\n| Brown Sugar                 | 1/9   |\n| Molasses                    | 1/9   |\n| Table Salt                  | 1/9   |\n| Domino Salt                 | 1/9   |\n| Yeast                       | 1/9   |\n| Cake Flour                  | 1/9   |\n| Raisins                     | 1/9   |\n| Nuts                       | 1/9   |\n| Cream Cheese               | 1/9   |\n| Vanilla                     | 1/9   |\n\n10. What type of yeast did you use? Did you make your own? Did you buy baking powder? Did you make your own? Did you buy cream of tartar?\n\nDid you make your own salt rising? Did you buy baking soda? Did you make your own?\n13. STAPLES\n\nDid you buy laundry soap or make your own? If so, what was the name?\n\nIf you made your own, did you use lye? If so, how much?\n\nWhat kind(s) of laundry soap did the grocer sell?\n\n14. FUEL\n\nWhat fuel did you use in an earlier day? (Give dates)\n\nIf you used wood, did you cut it yourself? If not, where did you get it from?\n\nIf you used coal, did you buy it at a store? If so, where?\n\nIf you used gas, did you have a meter installed? If so, when?\n\nIf you used electricity, did you have a generator? If so, when?\n\nIf you used any other fuel, describe it.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the last few days? (Give dates)\n\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? (Give date)\n\nWhat year was it purchased? (Give date)\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\n\nFor preparing food? (china, earthenware, wooden bowls, others)\n\nWhen did you first see metal? (Give date)\n\nAluminum?\n13. SOAP\n\nDid you buy laundry soap or make your own? If you made your own, did you use any other kind of laundry soap? What was the best kind?\n\n14. FUEL\n\nWhat fuel did you use in an earlier time? Was wood used for cooking? Did you use any other fuel? (Give dates) Did you use any other type of fuel? (Give dates)\n\n15. UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? Did you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? For heating, what year was it purchased? (Give date) What types of utensils did you use? (Iron, copper, tin, porcelain)\n\nFor preparing food? (china, earthenware, modern, other) When did you first use each type? (Give dates)\n\nAluminum?\n16. SHOPPING: AND CONSUMPTIONS\n\nStart list any changes which you recall in the purchasing and consumption of food with the food you purchased (give dates where possible).\n\n17. Give a typical daily menu. Outline breakfast, dinner & supper (for the earliest year). Indicate the month, day, year, and the numbers of the family.\n\nBreakfast:\n- Porridge\n- One other vegetable\n- Bread & butter\n- Tea or milk\n\nDinner:\n- Animal potatoes\n- Scalloped potatoes\n- Or vegetables\n- Butter eggs or meat\n- Bread & butter fruit\n- May the ground wheat\n\nSupper:\n- Animal potatoes\n- Scalloped potatoes\n- Or vegetables\n- Butter eggs or meat\n- Bread & butter fruit\n- May the ground wheat\n\n18. What year did you serve your first Christmas dinner in eastern Canada? Approximately how many people attended at that time?\n\n19. Were you ever reduced to almost starvation level living on our own or on locally produced foods? Give details.\n\nWe relied on our garden chickens, pork & lard to get through the winter. We had enough to eat, but had to work hard to get these things which kept our growing family of four boys & one girl healthy.\n\nOur first means of transportation was a good team of oxen & mule. We worked in summer, fall, or course we got horses & buggy & we had plenty for horses in those days & we still go to the farm in summer one son John Ernest - patch on the wheel & kept a few head of stock & has a full line of modern machinery.\n16. TRAVELERS and GUESTS\n\nGive a typical day's menu (general) list dinner & supper for the earliest\n& latest times. Include the number of the family\n& the number of guests.\n\nBreakfast\n- Porridge\n- Biscuits\n- Tea or Coffee\n- Bread & Butter\n\nDinner\n- Roast Beef\n- Potatoes\n- Gravy\n- Vegetables\n- Rolls\n\nSupper\n- Animal Fat\n- Scalloped Potatoes\n- Gravy\n- Bread & Butter\n\n17. What did you serve your first Christmas dinner in eastern Canada?\nList those present at your table.\n\n18. Did you ever have to almost starve? Give details.\n\nWe relied on our garden, chickens, hens & ducks.\n\nWe always had enough to eat, but had to work for\nto get these things which kept our growing\nfamily of four boys & one girl healthy.\n\nOur first means of transportation was a good team of oxen\n& sleds loaded with wood & supplies in summer. Later we used a\nhorse & buggy & are proud of having our horses in those days & we still\ngo to the farm in summer one son John Ernest - faithful on the\nwondering horse until a few years ago when he has a full line of modern machinery.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n\nI'm afraid that I haven't been very helpfull but we did start from scratch just 35 years ago this coming 29th May we where married in the little Anglican Church in Watrous there where no roads no fences we just drove across country to the homestead with a borrowed horse & buggy.\n20. Mention any outstanding differences in the preparation of meals in the past.\n\n21. When did you begin to rely on purchased foods instead of homegrown and home preserved foods?\n\n22. Please add other details from your early experiences of buying groceries and securing tools in other ways than pioneer days in Eastern Canada.\n\nInk faded that I haven't been very helpfull but we did start from scratch just 35 years ago this coming 29th May we where married on the little Anglican church in Wallace three where no roads no fences we just drove across country to the homestead with a borrowed house & buggy\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1913_341.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4199, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1158, 3], [1158, 2376, 4], [2376, 3270, 5], [3270, 4140, 6], [4140, 4968, 7], [4968, 6179, 8], [6179, 7361, 9], [7361, 8142, 10], [8142, 8142, 11], [8142, 8142, 12], [8142, 9188, 13], [9188, 9934, 14], [9934, 11354, 15], [11354, 12404, 16], [12404, 13282, 17], [13282, 13888, 18], [13888, 14041, 19], [14041, 14193, 20]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]