[{"id": "2e9781d3173c8dbf3710cd5b82d7f971110d2dc2", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 1\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA MEETING OF EXHIBITORS TO THE PROVINCE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in exactly the same environment as another can answer all questions. It is not necessary to answer every question; others may prove impossible for you to answer and you should not worry about leaving blank spaces. The questions are intended for persons who lived in Western Canada before 1921, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nWestern Canadian Archives Questionnaire No. 1 entitled \"Pioneer Diet: What Did You Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nA later date. Some of these are listed below. Please mark the one you would be willing to answer.\n\n[X] Pioneer housing.\n[X] Pioneer social life, sports and recreation.\n[X] Pioneer education and churchwork.\n[X] Pioneer farming experience.\n\nPresentation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nGleniffer Rd., Saskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: NORMAN MACDONALD\n2. Your address: R.R. No. 2, Wapella, Sask.\n3. Date: April 9th, 1957\n4. Where were you born? (Give name of place and country): Benbecula, Inverness Shire, Scotland\n5. What was your father's name and occupation?: Robert MacDonnell, Stone Mason\n6. When did you come to Saskatchewan? (Give month and year): May, 1883\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 10 years\n\n9. What were your reasons for coming West?\n   My father had only a small craft,\n   and he thought he could better himself by coming to Canada with his family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information)?\n    Leslie Gordon Cathcart, owner of the Island of Benbecula from which we surveyed out Macdonald MacDermid over to Canada in 1881 to look over the country to see if he considered it a suitable place to settle and he gave a very favorable report when he went back to Scotland. So that how we came out here. Mr. MacDermid died some years ago; he was the man that took the 1883 settlers and notably Cathcart.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It would rather have someone else do the writing at your dictation, this is quite acceptable.\n\n2. Your full name: NORMAN MACDONALD\n\n3. Date: April 9th, 1953\n\n4. Where were you born? (Give name of place and country) Bendale, America\n\n5. What was your father's trade and occupation? Rancher\n\n6. When did you come to Saskatchewan? (Give month and year) May 1883\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use if was a small child)\n\n9. What were your reasons for coming West?\n\nMy father had only a small cattle farm, my mother had a small cattle farm, and my family was moving to Canada with his family.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nLady Gordon Macdonald, our dear aunt, of Bendale, Saskatchewan, was a Canadian. In 1881 she came to Canada by way of Prince Albert. She came here because it was a good place to live and she came to work there. My parents went to Canada because they heard it was a good place to live and work.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\n   I came out with my parents.\n\n13. What means of transportation did you use?\n   Steamsips and railroad\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n   I met many Indians and they were always friendly\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   On the Banks of the Pipestone Creek Nine Miles South of Wapella\n\n16. Where did you settle or take up land?\n   In this locality\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n2.\n\n11. What did your friends and relations think of your decision to come to Western Canada?\n\n12. Did you travel alone or with a party (family, friends, or other groups)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? In this locality.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after?\n\n---\n\nHandwritten notes:\n\n\"Travel out with my parents\"\n\n\"Family and friends\"\n\n\"I'm not going to leave and they will always be friendly\"\n19. How often did you write to relatives or friends in your old home?\n\nStill corresponding with them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nFirst wife, Anna Graham\nMarried 1900. Married my second wife,\nFlora McDonald in 1928.\n\n21. Did anyone else come to Montana because of you, recommending it as a place to settle? My first wife died with the flu in 1919.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nAll around in this district.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\n\nIn 1883 we built a sod shack and it was burned down, and we lost the most of our clothes. We built a log house before winter set in. It was on 7th farm that we planted potatoes on land barely broken and had a very crop, we also put in a few acres of barley and oats. The barley crop was good but our wheat crop we could not harvest before the frost came.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n\nWe all went to church and visiting friends, our mode of travel was by a yoke of oxen and wagon.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nMy first wife died with the flu in 1919.\n\n21. If other members of your family (cousins, sisters, parents, etc.) came West tell when they came and where they settled.\n\n22. In 1883 he built a new church and turned down, and we lost the most valuable clothes. We were on the farm.\n\n23. In the early years? (for business, attending church, visiting friends, etc.)\n\n24. Did you travel about much? How often? How far? By what means of travel?\n\nWe all went to church and visited friends by our mode of travel and wrote by a clerk of service and telegram.\n25. When was the first car used in the community? **1912**\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   *Wapella 9 miles, Wossomin 15 miles*\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   *Yes, we traveled by train & democrat*\n\n29. How often did you shop in the early days?\n   *about every two weeks*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   *1938*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   *Forty years ago we bought from the mail order houses. It was mostly clothing and harness materials. We bought less than 20% of our purchases from mail order houses.*\n\n32. When did you first have a telephone and what company provided it?\n   *1912, we formed a company and put it up ourselves.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   *We came here to stay*\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. What kind of articles did you buy by mail order? Indicate also what fraction of your total purchases were by mail order and how changes in the proportion of purchases made by mail order since the pioneer period.\n\n33. Where did you first have a telephone and what company provided it?\n\n34. When did you first come to Saskatchewan? Or did you make up your mind after trying it out? When did you make this decision?\n\n35. Has came here today\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1911, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\nWapella 9 miles, Wooramin 15 miles\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\nYes, we traveled by team & democrat\n\n29. How often did you shop in the early days?\nAbout every two weeks\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n1938\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\nForty years ago we bought from the mail order houses. It was mostly clothing and harness hardware. We bought less than 20% of our purchases from mail order houses.\n\n32. When did you first have a telephone and what company provided it?\nWe formed a company and put it up ourselves.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\nWe came here to stay\n25. When was the first car used in the community? 1912\n\n26. If you owned a car before 1912, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. What kind of articles did you buy? In this way? Indicate also what fraction of\n\nyour total purchases were by mail order and any charges in the proportion of\n\npurchases made by mail order during the pioneer period.\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you first come here to stay?\n\n1935\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo\n\n35. Did many people move away during the 1930's? Did many return?\n\nNo one went away\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI was a councillor in the Martin Municipality for 32 years from 1913 to 1945 & was school trustee for over 20 years on Eulonwood School\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were interested in having a car, when was the first automobile purchased, and how much did it cost?\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.). Try to give:\n\n(a) date of its adoption\n\n(b) any changes in names since then\n\n(c) date and reason for change. Give facts of new name as above in (1), (2), (3).\n6.\n\n39. Questions regarding historical source materials:\nDo you have any photographs or do you know the whereabouts of diaries, old letters, old photos and personal items? If so, please list them here:\n\n- [Handwritten text not legible]\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live, and occupations:\n\n[Handwritten text not legible]\n\nPlease give the names and addresses of other persons who should answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\n4b. If you have children or grandchildren, please give their names, where they live and occupations.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here:\n\n[Handwritten text not legible]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_410.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5037, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1976, 5], [1976, 3560, 6], [3560, 5190, 7], [5190, 6594, 8], [6594, 7457, 9], [7457, 8264, 10], [8264, 9571, 11], [9571, 10296, 12], [10296, 11659, 13], [11659, 12626, 14], [12626, 13942, 15], [13942, 14705, 16], [14705, 15823, 17], [15823, 16595, 18], [16595, 17468, 19], [17468, 18097, 20], [18097, 18252, 21], [18252, 18406, 22]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]