[{"id": "7b488c716956c5f73ca437e0aa888f19b4b1c7ee", "text": "of Has Place.\n\nIt happened in 1906 in 1916-18 which was\n\nIt happened in 1906 in 1916-18 which was\nHandwritten in 1906 in Nile - 65 words total\n\nIt happened in India and at Cambridge - and I had a\n\nIf I wanted work, I could get some (1906) - but\n\nI'm not sure if this is what he meant by \"quick success\"\n\nat that place\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? How many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? What was the term used when people had come unexpectedly? (That is, was the term \"make polliwog\" used, or was some other expression common?)\n\nWhat about meals? Did you stay when not invited beforehand? If yes, what was served? If no meal, what other refreshment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to look after the place?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc.? How—what was your way of doing it?\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? Five.\n\nHow many of these were bachelor's homes?\n\n2. How often did you usually visit neighbors? Frequently.\n\n3. Did you usually visit on a Sunday, or other days? Sundays.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? Yes, mostly.\n\nThat time of the day did you go? - In the morning and spend the day, or in the afternoon, etc.? Afternoon.\n\nWhat about meals? Did you stay when not invited beforehand? - If not, why not?\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\" at a casual hour?\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Yes, lots of them.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe. No.\n\nWere these more frequent in later years? Give dates. Yes - 1910 and onward.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No - only when an unusual thing or something special happened.\n\nOther remarks you'd like to add?\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nno such thing\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? Have none\n\nWhat material was it made of? How large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (for example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Yes\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties? Barn\n\n11. What card games were popular in the early days? Whist, Euchre, Pinochle\n\nWas there card playing for a prize? Yes\n\nWhat dances were popular?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. No\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. No - generally accepted\n8. Tell what was made of the school house for community dances, box socials, and other activities. (Include also the school Christmas tree, pianos, etc., if you have not described these on the school questionnaire.) Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\n9. When was your first community hall built? How large was it? What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.? )\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 6, 7, and 10) did the entire family attend?\n\nHow were babies and small children provided for?\n\nHow were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? What dances were popular?\n\nHas there card playing for a prize?\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nWas card playing accepted by all residents in the community, or were there some who favored upon it, either as an entertainment in the home, or for community gatherings? Explain.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nFor such thing in early days.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nAll weddings were chivared without fail.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nNew Years eve, parties would form and call on neighbors singing songs wishing Happy New Year.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nDramatic Club\n\nGive the date and reason for it being organized.\n\nSociety formed this among younger generation chiefly for educational purposes and it proved great success.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes\n\nTell when it was organized, and what steps led to its organization.\n\nDon't remember but very early - one of the first.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nAll of them.\n\nHow many women belonged? How often did it meet?\n\nDon't know.\n\nWhat were some of the activities carried on by this organization?\n\n---\n\n17. Was there a Homemakers' Club in your district? Yes\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n3. What attempts at formality, or manner, do you remember in small towns, such as Elgin and Harts when calling, visiting, etc., especially ceremonially?\n\n12. Was the obituary known in your community? If so, describe what you remember about obituaries, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any places or persons who did pro bono work, and what sort of changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS:\n\n15. What was the name of the first organization of any kind that you remember being established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged to it?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? When was it organized? Approximately how many women belonged to it? Describe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nDrama club, German speaking\nCatholic Volksverein\n\nWhat means were commonly used by organizations for raising money?\n\nMembership dues\n\n19. Where did various organizations hold their meetings? School\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes - sometimes\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nMonthly by priest or teacher\n\nDid you often have magic lantern shows? No Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBall, marbles, flying kites\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nRope skipping most popular\n18. Name any other organizations that were in existence in your community before 1914, giving the names of such, dates when it was first organized, its activities and purposes, who belonged (men, women, or both), whether it included people only from one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is a space in the church questionnaire for organizations connected with the church so they need not be included here.)\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n21. What games did boys play in summer (mumbletypeg, ball, marbles, fly kites, etc.)? Fill out this form for each child.\n\nCHILDREN'S GAMES\n\n22. What games did girls play in summer (skipping rope, play house, etc.)? Fill out this form for each child.\n22. What winter games were played outside - fox and hounds, skating, etc.?\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nDid the whole family join in such games, or only the children? Explain.\n\nThe whole family\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nThere was not much time for games - everybody had to work.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nNo\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\nChurch picnic\n\n26. Who organized it?\n\nChurch trustees\n\nJuly 4-1907\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\nYes entire Community\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\nBall games races rope pulling\n\nLantern games\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\nGeneral lunch\n\n31. What did you have to eat and drink?\n\nSausages wine coffee tea\n\n32. What time of the day did it start, and how long did it last?\n\nAfternoon\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games? \n\nTell the whole family join in such games, or only the children? \n\nExplain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? \n\nExplain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, feathers or other objects or animals, or games in the snow? Describe.\n\n---\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\nChurch picnic - 1907\n\n26. Who organized it? Church ladies\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? Yes\n\n28. Was it the first picnic held in the community? Yes\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? \n\nTell friends about games\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? General lunch\n\n31. What did you have to eat and drink? \n\nShow as more coffee\n\n32. What time of the day did it start, and how long did it last? Afternoon\n33. Describe any features of this picnic which you remember as outstanding.\n\nNow particular\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nOver the same pattern every other\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nPicnics are now taboo and bazaars take their place\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nBaseball\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nMore other\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nIn the year 1926-27 a rink was built with ice sheets for curling attached - 25 feet in summer for agricultural exposition of farm products\n31. Describe any features of this place which you remember as outstanding.\n\n32. Describe any different kinds of skating which you knew of in the early days, skating by horse, skating on ponds, skating on Sundays, skating on family occasions, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n33. What changes have you noticed in skating since the first years? If possible, give dates when changes became noticeable.\n\n34. Describe the sports which were popular in your community in the early years, telling who took part in them, young people, men, women, mostly.\n\n35. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nName any other sports teams that were organized before 1914, stating date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n36. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nIn the spring of 1920-21 a new rink was built with ice skates for curling, etc., in summer for open skating and curling.\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n   I have a large private library, it's impossible to list all the books. There are over 500 consisting of Science literature - History - no fiction. I am a graduate in pharmacy from Lawrence, Kansas & have studied classes 1916-17 in Saskatchewan. Taught college physics & taking up pharmacy in 1946.\n\n43. How many of your neighbors brought books with them? No many\n   What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors? None\n\n45. Did you buy many books after you came west? Give details. Yes - To keep up with the progress of science etc.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates. No\n\n48. Was there a school library? Yes When was it begun? Years ago\n   To what extent were books borrowed from the school library for adults to read at home? Just a few\n\n49. Did parents ever use their children's school text books as additional reading material?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community festival?\n\n41. Are there any from your community who have business members of well-known?\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible; if not, tell as nearly as you can how many books you brought, and what kind.)\n\n43. How many of your neighbors brought books with them? What kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and places.\n\n48. Was there a school library? When was it begun? Give reasons.\n\n49. Did parents ever use their children's school text books as additional reading materials?\n50. Has there ever been a community library in your district or town?  \nWhen was it started?  \nWho started it?  \nIs it still in existence?  \nIf not, when was it discontinued, and why?  \n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?  \nNational Geographic has been my favorite for almost 60 years. My library is bilingual German & English - try to keep the best & both languages in science particularly & literature - Physics & Chemistry.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?  \nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Yes\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? Who started it?\n\nIs it still in existence? If not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contains, how many people used it, where it was kept, and as far as literature, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\nNational Geographic has been my favorite for almost every year. I also enjoyed the Saturday Evening Post and the Ladies' Home Journal.\n\n52. Describe later changes in your subscriptions; tell why you started and then discontinued them and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? [Handwritten: B-flat Cornet]\n\n57. What instruments did any of your neighbors have? [Handwritten: None]\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them. [Handwritten: Piano]\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. [Handwritten: Used to play my Cornet outside my sod shack in summer on homestead 6 mi west of town. Band was in - and family & men living 10 miles away was telling others of this music heard and could not account for it. It was very unusual in the community. (Were there musical concerts, was there group singing at parties, etc.) Describe.]\n\n60. What were some of the favorite songs in the home? [Handwritten: No particular favorite]\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain. [Handwritten: The country people came from]\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. [Handwritten: No]\n\n63. Was there a band in your community? [Handwritten: Yes] When was it started? [Handwritten: Later] Who started it? [Handwritten: John D. Bourne] How long did it continue? [Handwritten: July 1914] How many were in it? [Handwritten: 20] Who was bandmaster? [Handwritten: John D. Bourne] What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the West? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home?\n\nin the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, when was it started? Who started it? How long did it continue? How many were in it? Who was bandleader? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearance.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, curiosities, etc.? If so, explain.\n\nGive details of this collection, telling when you started it, how you began interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, drama, entertainments, sports, reading, music of pioneer days not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2061.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7279, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 98, 5], [98, 318, 6], [318, 1784, 7], [1784, 3386, 8], [3386, 5120, 9], [5120, 6757, 10], [6757, 8472, 11], [8472, 9690, 12], [9690, 11114, 13], [11114, 12215, 14], [12215, 13718, 15], [13718, 15101, 16], [15101, 16529, 17], [16529, 17824, 18], [17824, 19490, 19], [19490, 20432, 20], [20432, 21580, 21], [21580, 22652, 22], [22652, 24376, 23], [24376, 25428, 24], [25428, 26550, 25], [26550, 27687, 26], [27687, 27834, 27], [27834, 27988, 28]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]