[{"id": "99a2d1a8127acdff47896b47a314a2e13b80b49b", "text": "A word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it will have exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer. If so, don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering the questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer will have exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer. You do not worry about leaving blank spaces.\n\nThe experiences of each person are not sufficient unless they describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada for more than one year during the period from 1870 to 1945.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Pioneers in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n1. Your full name: William H. Terry\n\n2. Your address: 813 m. 8th St., S.E., Saskatoon, Saskatchewan\n\n3. Date: March 19, 1955\n\n4. Where were you born? (Give name of place and country): Paul Wisconsin, U.S.A.\n\n5. What was your father's name and occupation?: George Terry, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1901\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   Wisconsin 1874-1886\n   Minnesota 1886-1890\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", etc.): I was 23 years old.\n\n9. What were your reasons for coming West? I came to work over the farm in the fall of 1901, and while there, I found a homestead on the Prairies, decided to come out and get a job.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n    Mostly government information from the Canadian Government Office in Paul\n\n    During U.S.A. I was in Paul frequently and often spent more time in their office.\n1. Your full name: William Terry\n\n2. Your address: 813...8th St., South Bend, Indiana\n\n3. Date: January 3rd, 1953\n\n4. Where were you born? (Give name of place and country): Paul Watson, Okla.\n\n5. What was your father's name and occupation?: George Terry, Farmer\n\n6. When did you come to Saskatchewan? (Give month and year): May 1901\n\n7. Mention any other places where you lived before coming to South Dakota:\n\n   Wisconsin 1874-1886\n   Minnesota 1886/1902\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use an \"I was a small child\" if it was in your case).\n\n   I was 2 years old\n\n9. What were your reasons for coming West?\n\n   I came to South over the Canadian Pacific Railroad in the fall of 1901 and while here I joined a Mormon Church. I then decided to come out and get a job in 1902.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Mostly government information from the Canadian government Office in St. Paul.\n\n    Mr. A.S.A. Johnson of Paul, originally and often spent a lot of time in your office.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was going to the end of the world, and they would never see me again.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIn the fall of 1901 I met a man named Mr. Armstrong at Moose Jaw and traveled with him during my stay there. In June 1902 I traveled in a car of settlement effects and a Buffalo Pole team through almost 50 miles of wilderness. The effects were excellent for our needs.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Windsor Hotel, Regina, where we stayed for a short time.\n\n16. Where did you settle or take up land?\n\nSaskatchewan, near Moose Jaw.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived at Regina, Saskatchewan, from 1908 to early 1911.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nFarmers, livestock owner, and hunter.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey thought I was going to the end of the world and they wouldn't see me again.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nOn the road to Brandon in the fall of 1901\n\n13. What means of transportation did you use?\n\nRoad from Brandon to Winnipeg via Prince Albert, Regina to Saskatoon.\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nIn the fall of 1901 I met James Brady, his afternoon driver. We stayed at Assiniboia and traveled with them. In June 1902 I hitched a car of freight to the Buffalo River station. The next day we arrived at the railway station. The next day we arrived at the Windsor Hotel. They didn't even have telephones there.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt the Windsor Hotel. They didn't even have telephones there.\n\n16. Where did you settle or take up land?\n\nSaskatchewan, near Prince Albert, about 1/2 mile from the railroad.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI lived at Regina, Saskatchewan, from 1908 to 1911.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n\nFarmers started on farms and bought their own farms. After moving to Canada, farming became more difficult.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tall when they came and where they settled.\n\nOn 1905, 1907, 1918. All settled at or near Mead, Saskatchewan.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWhen we came out 1901, we had the most lovely summer weather, and Rachel (Ben) had the longest winter always. The way we used our fire. We never opened any window. We used the fire to keep warm and sleeping very comfortably when we lived in the cabin. We traveled about much in the early years. (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nTraveling by horse and wagon.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early days? By what means of transportation? Tell how far and how often? How often? How often? How often?\n\n25. How did you travel? By horse and wagon.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1934, when did you buy it? That makes:\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car between 1914 and 1919, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to travel there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any charges in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n5.\n\n35. Did any people move away during the 1920's? Did they return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were affected by the district, mention it here, giving dates whenever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change.\n\nGlad the first steam threshing outfit\n\nThe district, and the first attempt to a\n\nAgriculture Research in 1919\n24. Did any people move away from your district prior to 1917? What reasons?\n\n25. Did any people move away during the 1930s Depression?\n\n26. If you or some member of your family have held public office, or have been active in any organizations, mention its name, giving dates whenever possible.\n\n27. If you or any of your family or friends were affected by the Great Depression, mention it here, giving dates whenever possible.\n\n28. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person responsible for the name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n\n29. How did the place in your community get its name? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person responsible for the name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for everything?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify if you prefer to donate them to the University of Saskatchewan)\n\nIf you have children or grandchildren, please give their names, where they live, and occupations.\n\n40. If you think the most important changes in your community since you first came west:\n\nFirst came west:\n\nSettlement of land and road improvements. The growth of Saskatoon from 113 people in 1902 to over 60,000 in 1954\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nIf someone else has filled in this questionnaire for you, please have them sign here:\n\n__________________________\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify whether you prefer to donate them to the library or to lend them temporarily.)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nYour favorite Northern Hamilton Homemakers:\n\n[Handwritten text not legible]\n\nYour favorite Hamilton Homemakers:\n\n[Handwritten text not legible]\n\nThe settlement of land and road improvement. The growth of Hamilton from 113 people in 1902 to over 60,000 in 1954.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\n[Signature]\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1901_632.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4328, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1526, 5], [1526, 2990, 6], [2990, 4150, 7], [4150, 5319, 8], [5319, 6533, 9], [6533, 7997, 10], [7997, 9116, 11], [9116, 9812, 12], [9812, 10797, 13], [10797, 11788, 14], [11788, 12608, 15], [12608, 13844, 16], [13844, 14644, 17], [14644, 15492, 18], [15492, 15647, 19], [15647, 15801, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]