[{"id": "50c224b0aa27767a84c3a51eea2f5181dbca1624", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may be impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name (Mrs. Eileen Smith)\n2. Your address\n3. Date\n4. Where were you born?\n5. What was your father's name and occupation?\n6. When did you come to Saskatchewan? (Give month and year)\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not.\n9. What were your reasons for coming West?\n\nI came to Canada because my parents wanted me to have a better life. They heard about the opportunities in Canada and thought it would be a good place for us.\n\nMy parents had heard about the opportunities in Canada and thought it would be a good place for us.\n2. What did your friends and relatives think of your decision to come to Western Canada?\n\n11. Did you travel by yourself or with a party (family, friends or other group)?\n\n12. Name of transportation used:\n\n13. Name of transportation used:\n\n14. What methods of the journey? (Train, bus, car, boat)\n\n15. Mention any other places where you have lived since coming to Saskatchewan.\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\n\"I bought cotton material to make two and I some dresses, and my father had to start work on the farm as his good work as his employer was not so to farm regularly.\"\n19. How often did you write to relatives or friends in your old home?\n   My parents wrote quite often. I still do, but most of the relatives and friends in England are dead now.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Elmer William Smith Feb. 13, 1922 at Assiniboia, Sask.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   No.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   No sisters or brothers\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n   Nothing in particular, although I think the early days were the best. We visited our neighbors and no one was trying to get ahead of the \"Jones\" as everyone was in the same boat. Speeds low and 90 miles to move from the nearest railroad.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? by what means of travel?\n   We used to travel a bit after we came on the homestead, at first with a wagon and team of horses. Then we got a buggy and a team of drivers. If I went alone I always went on horseback.\n25. When was the first car used in the community?\n   LIMERICK in 1912, a FORD\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   MOOSE JAW 90 miles. The CPR came through from WEYBURN in 1913. That was when LIMERICK started up.\n\n28. Did you continue to trade there? Indicate any changes due to new towns appearing, better means of travel, etc.\n   My parents traded there until they died.\n   I started trading at MELAVAL in 1932 and have traded there since that time. We have HIGHWAY 13 (gravel) going past our door now.\n\n29. How often did you shop in the early days?\n   When my father went to Moose Jaw about 3 times a year. He was gone a week with the team and wagon.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   In 1913 when the CPR came through and LIMERICK started up.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   As soon as we came on the homestead all our clothing and shoes etc. were purchased through the catalogues. We also bought furniture, harness, horse blankets.\n   I still do quite a bit of ordering through the catalogues, but nothing pertaining to horses as we have no horses now.\n\n32. When did you first have a telephone and what company provided it?\n   About 1916 NEWSON and ORINOCO Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came with the idea of staying.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nA few moved away. They sold their homesteads as soon as they had placed them on them. These were the people that just filled up a section of land. All this southern part of Saskatchewan was like this. You could file on a quarter section of land and homestead. You had to stay there.\n\n35. Did many people move away during the 1930s? Did many return?\n\nThere were families left and went to the White Fox district. They did not return.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy father was an Odd Fellow for about 25 years. He was also a member of the Limerick Lodge. He held various offices in the lodge, including District Deputy Grand Master in 1945-46.\n\nI am active in the Women's Missionary Society, Women's Auxiliary to the United Church, and Homemakers Club. I have held offices in these organizations.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining organizing the first lodge, etc.)\n\nMy father helped to organize the IOOF at Limerick in 1916.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give facts of new name as above in (1) & (2).\n\nThe village of Melavale was named after the man whose land they bought for the townsite. His name was Melavale.\n\nLimerick was named after a country Post Office that was in the district before the CPR came through.\n\nHoldsworth school district was named for Mr. Holdsworth from Moose Jaw who farmed in the Limerick district near the school. Just west of our farm is a high hill. It is Highway 13 now. People used to call it Webber's Hill on account of a man by the name of Webber.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nThe late Mr. George Douglas of La Fleche, SASK. Had old photographs and written recollection of this part of country. I understand he had enough material to make a book, but he did not get it done before his death last December. His hobby was history of the district.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? ..........\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ..........\n\n(indicate your preference, if any) ..................\n\nI cannot answer the above questions, but I do know Mr. Douglas' daughter.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nI have one granddaughter she is 57 years old, name Marion Elizabeth Smith.\n\nLives on a farm (my father's homestead) near Limerick, SASK.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWhen we first came here there was nothing but prairie, now it is nearly all wheat farming. The nearest town was 90 miles away, now we have villages and towns all around us. CNR runs about 12 miles north of here. The CPR runs through our farm. Some of the farmers are getting in the power line now. We have a good gravelled highway. Train service every day except Sunday. The first few years we were here two RCMP patrol from Wood Mountain. RCMP Barracks would go through the country to see if someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nThey were at a certain place at a certain time and then they would go further. I think they went out singly as only one at a time ever come to our house.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_799.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 9, "total-input-tokens": 15354, "total-output-tokens": 2779, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1973, 2], [1973, 2701, 3], [2701, 3454, 4], [3454, 4752, 5], [4752, 6573, 6], [6573, 8743, 7], [8743, 10927, 8], [10927, 10927, 9]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false]}}]