[{"id": "6be0b367f5511686fcf2ee614bc0cdd585e425e3", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\nYour full name GEDFREY PERSSON\nPresent Address STOCKHOLM SASK.\nPioneer Address OHLEN P.O ASSA NWT.\nYear you came to Saskatchewan 1892\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPioneer Recreation and Social Life.\n\nPlease print name and address in capital letters.\n\nYour full name: GODFREY PERSSON\n\nPresent Address: STOCKHOLM, SASKATCHEWAN\n\nYear you came to Saskatchewan: 1892\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp: Received]\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? About 8.\n\nHow many of these were bachelor's homes? None.\n\n2. How often did you usually visit neighbors? Once or twice a week.\n\n3. Did you usually visit on a Sunday, or other days? Every day at all.\n\n4. Were you often invited to other homes, or was most visiting done without an invitation?\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? If you came between meals, you were treated to coffee. If you dropped in at mealtime, you would have dinner.\n\nWhat about meals? Did you stay when not invited beforehand? At meal time, you were invited to sit what there was on the table.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (That is, was the term \"take potluck\" used, or was some other expression common?) You were asked to sit down and show what was on the table.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Depending on an old-fashioned custom, you would be asked for some soup, coffee, and crackers, or just plain bread and butter.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? There was usually someone at home.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? I can remember having bees where neighbors helped each other with gathering up rails, fences, driving them, and putting them together. Tell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe.\n\nIn the winter, there were always parties in the homes, and also card playing. The most popular card game was \"King Pedro\" and \"Queen Pedro\" with four players. Between 1900 and 1910, there between 1890 and 1900.\n\nWere these more frequent in later years? Give dates.\n\nI would say less frequent.\n\nDid you follow any kind of informal schedule, such as going by turn from one house to another at definite times, every two weeks, once a month, etc.? For classes in the house, there was very understanding where the next class was to be held.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc. If you have not described these on the School Questionnaire, give dates.)\n\nThe school was sometimes used for public meetings until we got a hall.\n\nHow much of your social life was centred around the school, and within the school district? Describe.\n\nThere was not very much of social life in the 90's. The dances and card parties were held in the homes of the pioneers.\n\n9. When was your first community hall built? I think it was in 1848.\n\nWhat material was it made of? Logs, lumber.\n\nHow large was it?\n\nWho built it - the community through special funds, the municipality, some organization, etc.? The foreign built it to have a place to meet and discuss their problems.\n\nWas it built in the village or town, or was it a country hall? County.\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.)?\n\nSome events at old times the place of the house for socials, debates, and dances were held in the hall, and in the summer, the anniversary picnic was held there. In 1927 a group of us formed a company and moved the hall some 3½ miles west to its present location. The building still stands today.\n\n10. When parties, dances, etc., were held in homes, schools, churches, hall-halls (as referred to in question 8, 9, and 10) did the entire family attend? Sometimes.\n\nHow were babies and small children provided for? They were put to sleep in the dressing room.\n\nHow were horses sheltered and fed in the winter time at these parties? There was a barn on the hall grounds.\n\n11. What card games were popular in the early days? King Pedro, Low Pedro, also casino, five cards.\n\nWas there card playing for a prize? No.\n\nWhat dances were popular? All the old Swedish dances, such as polka, schottische, waltz, mazurka.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nYes, there was the church group who did not play cards for dance.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Choose from the school, Church, town hall, school district, etc.)\n\n9. When was your first community hall built? (First it was in 1894)\n\n10. What was your first community hall built for? (Was it a country hall?)\n\n11. What card games were popular in the early days? (Playing cards, dominoes)\n\n12. Was there card playing for a prize? (Yes)\n\n13. Was there any disagreement between dancing and non-dancing residents in the town? (No)\n\n14. Was card playing accepted by all residents in the community or were there some who frowned upon it? (Some who frowned upon it, either as an entertainment in the house, or for community gatherings)\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? Such things did not exist in our community.\n\n13. Was the chivaree known in your community? Yes\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nThere was a lot of noise making contrabution. The crowd was kept up until the noonwheres were invited in for something to eat and drink.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nI remember the ringdances and the singing connected with them. It was a very gay occasion. The ringdances were composed of young girls and boys, yes and no, married couples taking part, singing and going around in a circle reciting parts of the songs told of.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? Church organizations\n\nGive the date and reason for it being organized, 1900.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Not at that time\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? There was the Church\n\nWhen was it organized? Lader Society, about 1895.\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality, or \"etiquette,\" do you remember in small towns such as Glace Bay and late 19th century cities? Visitors treated respectfully in particular, etc.\n\n13. Was the obituary known in your community?\n\nDescribe what you remember about obituaries, telling how common they were, and last names associated with them, etc.\n\n14. Mention any other details of visiting, parties, etc., that you remember, telling of any jokes or experiences not mentioned above, that you remember, at parties and give approximate dates whenever you can when such changes occurred.\n\n15. Give the date and reason for it being organized. 1900.\n\n16. Was there a Sebastopolmen Grocers' Club in your community? Tell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many members belonged?\n\nHow often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\n17. Was there a Homemakers' Club in your district? This was the Church\n\nThen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nIn the nineties, the settlers in the Swedish colony bought a threshing machine, and drove their own threshing for many years.\n\nThey also purchased a pure breed Clydesdale stallion which was used for many years.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? In the hall.\n\nor in their homes.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Yes.\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? No. Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? Usually played hunting with bow and arrows, spear throwing, foot ball.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? Usually playing housekeeping.\n18. Name any other organizations that were in existence in your community before 1924, giving the name of each, date when it was first organized, its activities and purposes who belonged (men, women, young people), whether it included people only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There are spaces at the end of each question for additional information.)\n\nIn the winter, the settlers in the rural church colony bought a threshing machine, and sold their own threshing for many years.\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? In the hall.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Who gave them? Local ministers or teachers, special lecturers, etc.? Where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (candy store, ball, marbles, fly kites, etc.)? Normally played family with broom and bowers.\n\nWhat games did girls play in summer (skipping rope, play house, etc.)?\n\nMostly playing housekeeping.\n22. What winter games were played outside? Fox and hounds, skating, etc.? \n   Mostly skiing, and sliding down hill on sled.\n\nWhat games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n   Card games of all kinds, and reading.\n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n   The women used to sew, and often went into town to make mittens and socks in the winter evenings.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n   The children usually built snow houses out of hard drifted snow, and played at Indian fighting, using spears and bows and arrows.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n   July 1st 1897\n\n26. Who organized it?\n   The farmers of the settlement.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n   For the entire community.\n\n28. Was it the first picnic held in the community? No.\n   If not, do you know the date of the first one that had been held? Yes.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Foot races of all ages.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n   Several families went to eat together, spreading table cloth on the ground, and sitting around it.\n\n31. What did you have to eat and drink?\n   Meat, chicken, potatoes, relish, and coffee.\n\n32. What time of the day did it start, and how long did it last?\n   Some of the people came early, and had dinner on the grounds. Others had dinner at home, and had lunch in the midafternoon on the picnic grounds.\n33. Describe any features of this picnic which you remember as outstanding.\n\nThere was the local ball team, an outside team would be invited to play against.\n\nThere were races, jumping, tug-of-war, and in the evening before sundown, the young people gathered for the Ring Dance and singing out on the grounds.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nThere were sometimes a gathering of several families went to spend the day at Roland Lake in the Qu'Appelle Valley, fishing and bathing.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\nThe pioneer picnics are gone, and we now have the annual sports day with blue ball, and prizes.\n\nRefreshment booths, where ice cream and soft drinks are sold.\n\nThere is also a charge made for admission to the grounds.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). The young people took part in running, jumping, etc., while the older men took part in the foot race.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nFootball\n\nWhat year? How long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features or facts about which you remember an outdoor area.\n\n34. What changes have you noticed in plants since the first year? If possible, give dates when changes became noticeable.\n\n35. Describe the sports which were popular in your community in the early years, telling who played them and what they did.\n\n36. For what game was the first team organized in your community to play against neighboring teams?\n\n37. How long did it continue?\n\n38. Have any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for.\n\nThen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Yes\n\nWho was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st). July 1st\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nSwedish schoolbooks, such as the history of Sweden, Bible, History of the world.\n\n43. How many of your neighbors brought books with them? I think they all did\n\nWhat kind of books and how many? See 1/2\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nThe first library was started by the debating club in 1898\n\nThe travelling library in 1920\n\n48. Was there a school library? Yes\n\nWhen was it begun? 1910\n\nTo what extent were books borrowed from the school library for adults to read at home? These books were read by the children at home\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nOur parents could not read English\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community plans? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held? (Sept. month, or any special day, such as May 25th or July 4th.)\n\nAre there any from your community who have become members of well-known hockey, ball or other teams? Give names, but dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors, if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them? & Thank you for all\n\nWhat kind of books and how many? An 42\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"traveling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun? To what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\n   Give any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n   The pioneers in this community subscribed to some Swedish papers, printed in United States, and later, when the young people grew up, there was some English newspapers subscribed to.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? Yes.\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district or town?\n   - When was it started?\n   - Is it still in existence?\n   - If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, and acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west? (This community)\n\n52. Describe later changes in your subscriptions, telling why you dropped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west, a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Violin and guitar.\n\n57. What instruments did any of your neighbors have? About the same.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nMy parents bought an organ from a local agent in 1900.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nWe used to get together on the whole evenings and sing. There was also a church choir organized in the community.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nOld folk songs and hymns.\n\nIn the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nYes. The old folks did not know any other songs. I may say, that I still love the Swedish folk songs.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nNo.\n\n63. Was there a band in your community? Yes. When was it started? 1912.\n\nWho started it? I did.\n\nHow long did it continue?\n\nHow many were in it? 14\n\nWho was bandmaster? Myself.\n\nWhat instruments were included? 2 drums, cornets, clarinets, trombones, etc.\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nWe played at fairs, sports days, dances.\n\nWe also had uniforms.\n\nThe name of the band was Fertile Belt Municipality Band.\n96. What musical instruments did you bring most with you? (Musical and garden)\n\n97. What instruments did any of your neighbors have? About the house.\n\n98. What musical instruments have you bought since you came to the west? Give dates, places, etc., possibly, and tell where you bought them.\n\n99. How large a part did dancing and other forms of entertainment play in your home entertainments in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.)\n\n100. Was there also a church choir organized? If so, describe.\n\n101. What were some of the favorite songs in the house?\n\n102. In the community?\n\n103. Was there a band in your community? If so, when did it start? 1912\n\n104. How many were in the band? 10\n\n105. What instruments were included? 2 drums, cornets, clarinets\n\n106. How long did it exist? 1912\n\n107. Who was the conductor? Mr. Smith\n\n108. What occasions did they play? Weddings, funerals, parties, parades\n\n109. Did they have uniforms? Yes\n\n110. All members of the band were... Field Bull (illegible) Obama\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the world? Give names and titles and places of public appearance.\n\n65. Is there an important or even important in your community new as compared with the early days? What is the reason for this change?\n\nIt seems to me the main is here significant.\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of the collection, telling when you started it, how big it is, and a description of the collection.\n\nI have three different types which I found in my field of study.\n\n67. Did you make notes of the weather, time of partial or complete blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, musical events of pioneer days; not already mentioned.\n\n(Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12969_1892_1946.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7480, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1225, 5], [1225, 2421, 6], [2421, 4768, 7], [4768, 4768, 8], [4768, 7315, 9], [7315, 8050, 10], [8050, 9917, 11], [9917, 11088, 12], [11088, 12687, 13], [12687, 14076, 14], [14076, 16066, 15], [16066, 16066, 16], [16066, 17998, 17], [17998, 18881, 18], [18881, 20451, 19], [20451, 21733, 20], [21733, 22866, 21], [22866, 23762, 22], [23762, 25475, 23], [25475, 26563, 24], [26563, 27683, 25], [27683, 28856, 26], [28856, 28944, 27], [28944, 29098, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]