[{"id": "09c2500d9d2860be5a111a27c97256613df85bb7", "text": "Name: Mrs. John Peacock\nAddress: N.E.O.H.A.M.\nBirthplace: ONTARIO\n\n1. INTRODUCTORY QUESTIONS\n   - What year did you start housekeeping in Eastern Canada? Aug. 1912\n   - Where did you set up housekeeping? Spyer Rd. (Mrs. S. Mowbray)\n   - Where had you been living before that? Herbert, Ont.\n   - For how many people did you prepare meals? 18\n   - How far was it to your nearest store? 65 miles\n   - How often could a visit be made to the store? Spring & fall\n   - What groceries did you usually buy in those earliest years? cheese, flour, syrup, sugar, tea, raisins, prunes, oatmeal, soap, cornmeal, molasses, salt\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n   - What brand of white flour did you use in the early years? Robinhood\n   - In what quantities did you buy it? 100 lbs., 60 lbs., more each at once\n   - What was the usual price per hundred pounds of white flour?\n   - How much did you use Graham flour? None\n   - Whole wheat flour? None\n   - Was flour milled locally? Yes, how far away? 17½ miles, what year? around 1912\n   - What was the price for a twenty pound bag of rolled oats?\n   - What other grain products did you use?\n     - Cornmeal? Yes\n     - Whole wheat? No\n     - Farina? Yes\n     - Other?\n   - Did you grind your own wheat for porridge? Yes, first year\n   - How did you grind it? By hand in small coffee grinder\n1. **BUSINESS HISTORY**\n\n   - What year did you start in business? [George 1918]\n   - Where did you get your first investment? [S. Sperry (Lamar S. Peacock)]\n   - How did you begin? [Little by little]\n   - For how many people did you operate? [6-5 people]\n   - How far was it to your nearest store? [Approximately 2 miles]\n   - How often would you visit the store? [Weekly]\n   - What products did you usually buy at your nearest store? [Clothing, shoes, flour, sugar, canned meat, milk, butter, seed]\n\n2. **PURCHASES**\n\n   - How much did you pay? [Total $134.00]\n   - In what quantities did you buy? [100 lbs.]\n   - How much did you pay per hundred pounds of flour? [Not specified]\n   - How much did you pay for flour? [Not specified]\n   - Was flour milled locally? [Yes]\n   - Did you ever buy flour from [Name] that year? [No]\n   - What other goods did you buy? [Tools, shoes]\n   - Other? [Not specified]\n   - Did you ever sell your own wheat for personal use? [Yes]\n   - How much did you earn? [Not specified]\n\n3. **PRODUCTS**\n\n   - How much did you pay for each product? [Not specified]\n   - How much did you earn from each product? [Not specified]\n   - Did you ever sell any of your products? [Not specified]\n   - How much did you earn from selling? [Not specified]\n\n4. **FINANCIAL STATEMENT**\n\n   - How much did you invest? [Not specified]\n   - How much did you earn? [Not specified]\n   - How much did you save? [Not specified]\n   - How much did you spend? [Not specified]\n   - How much did you keep? [Not specified]\n\n5. **CONCLUSION**\n\n   - What advice would you give to someone starting a business? [Not specified]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 100 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 40¢\n\nWhat brand of golden corn syrup did you use?\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? Our own cows.\n\nButter? Our cows.\n\nEggs? Our cows.\n\nWhat was the price of butter? ________ of eggs? ________\n\nDid you pack eggs for inter? ________ how? ________\n\nDid you make butter? yes ________ cheese? no ________\n\nWhat kind of cheese? Big Ontario cheese.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Our own beef + pork.\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat? Half ________\n\nHow did you preserve meat? In brine (pickle)\n\nWas there a \"beef ring\" in your neighborhood? No ________\n\nIf so what year was it organized?\n\nDid you use game? Yes ________ what kinds? Prairie chickens, foxes, rabbits.\n\nFor how long? 2 or 3 yrs ________\n\nWhat part did fish play in the family diet? Not much ________\n\nHas the fish fresh, cured, or canned? ________\n\nKinds? ________\n2.\n\n3. **SHOPS AND STAIRS**\n\nIn what quantity did you buy milk? (100 lbs.)\n\nWhat was the price? $4.50\n\nWhat brand of condiment did you use?\n\nWhat size of tin or can did you use?\n\nAt what price?\n\n4. **DEER TRACKS**\n\nHow did you get a supply of fresh milk in the early days?\n\nButter and cream, milk, eggs, flour, sugar, tea, coffee, etc.\n\nDid you pack eggs for winter?\n\nDid you buy extra butter?\n\nWhat kind of cheese?\n\n5. **USE OF LIVESTOCK**\n\nWas there a \"beef ring\" in your neighborhood?\n\nIf so, what year was it organized?\n\nDid you use it?\n\nFor how long?\n\nWhat part did it play in the family diet?\n\nWas the fish fresh, canned, or smoked?\n\nKinds?\n6. BEVERAGES\n\nWhat kind of tea did you buy? .................. At what price? ..........\nWhat kind of coffee did you buy? (beans or ground) ........... Price? ........... What other beverages were used? Wheat, browned, instant, & ground.\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? .............. Could you get potatoes at the store? ..............\nIf not, where from? .......... neighbors & grew them ourselves.\nWhat year did you first grow your own supply for the winter of:\nPotatoes 1913, Cabbage 1913, Carrots 1913, Onions 1913,\nTurnips 1913, Beets 1913.\nIn what quantities did you buy white navy beans? ..............\nHow did you buy prunes, (in bulk or by the box)? ..............\nWhat weight? 25 lbs. How did the grocer handle prunes (by box)? Yes\n................................. what was the price of prunes? ..............\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes\npeas? No, corn? No, beans? No, Saskatoons? No\nother foods? .......................................................\nWhat year did you first preserve fruit by canning? 1919\nWhat year did you first preserve vegetables by canning? ..............\nWhat year did you first preserve meat by canning? 1917\nDo you still preserve foods by canning or drying? Canning\n...............................................................\nTo what extent? Some meat, chickens, fruit & some vegetables.\nDid you make your own vinegar? No\n6. **NEW ITEMS**\n\n   - What kind of tea did you buy? (Tea or coffee)\n   - Did you make coffee?\n   - What other beverages were used?\n\n7. **VEGETABLES AND FRUITS**\n\n   - What was the price of potatoes per bushel? (Price per bushel)\n   - Could you get potatoes at the store?\n   - If not, where from? (Farmers, grocers, others)\n   - What year did you first grow your own supply for the winter of:\n     - Potatoes: 1913\n     - Cabbage: 1913\n     - Carrots: 1913\n     - Turnips: 1913\n     - Beets: 1913\n\n   - In what quantities did you buy white navy beans?\n   - How did you buy prunes, (in bulk or by the box)?\n   - What weights? 2.5\n   - How did the grocer handle prunes (up bulk)?\n   - What was the price of prunes?\n   - What other dried fruits did you use in the earliest days? (apricots, raisins, currants, pears, loganberries, raisins, currants or others)\n\n8. **PRESERVATION**\n\n   - In what way were foods preserved by drying?\n   - Other foods?\n   - What year did you first preserve fruit by canning?\n   - What year did you first preserve vegetables by canning?\n   - What year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n\n   - To what extent? (Meat, chicken, fruit, or vegetable)\n   - Did you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Your first time seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant., you usually bought at one time | Price of this amount |\n|-----------------------------|----------------------------------------|---------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits               |                                        |                                                   |                                     |                      |\n| Macaroni                    |                                        |                                                   |                                     |                      |\n| Graham flour                |                                        |                                                   |                                     |                      |\n| Brown sugar                 |                                        |                                                   |                                     |                      |\n| Molasses                    |                                        |                                                   |                                     |                      |\n| Table salt                  |                                        |                                                   |                                     |                      |\n| Common salt                 |                                        |                                                   |                                     |                      |\n| Lily white syrup            |                                        |                                                   |                                     |                      |\n| Toilet soap                 |                                        |                                                   |                                     |                      |\n| Baking powder               |                                        |                                                   |                                     |                      |\n| Baking soda                 |                                        |                                                   |                                     |                      |\n| Dried peas                  |                                        |                                                   |                                     |                      |\n| Dried corn                  |                                        |                                                   |                                     |                      |\n| Vinegar                     |                                        |                                                   |                                     |                      |\n| Raisins - seeded            |                                        |                                                   |                                     |                      |\n|                             |                                        |                                                   |                                     |                      |\n| Raisins - seedless          |                                        |                                                   |                                     |                      |\n| Rice                        |                                        |                                                   |                                     |                      |\n| Currants                    |                                        |                                                   |                                     |                      |\n| Store jam - kinds?          |                                        |                                                   |                                     |                      |\n| Cheese (Cheddar or store cheese) |                                |                                                   |                                     |                      |\n| Vanilla                     |                                        |                                                   |                                     |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal Yeast Cakes.\n\nDid you make yeast for your own use? No. Using starter? Yes.\n\nUsing hops? No. Salt rising? No.\n\nDid you buy baking powder? Yes. Baking soda? Yes.\n\nCream of tartar? Yes. Did you make your own baking powder? No.\nFOOD\n\nFood you first bought in bulk? Do you buy goods, etc., at once?\n\nSoda biscuits\nMacaroni\nOatmeal flour\nBrown sugar\nRolls/buns\nTable salt\nCoconut salt\nLily white\nSpruce\nToilet soap\nBaking powder\nFishing soda\nDried peas\nDried corn\nVinegar\nRaisins - seeded\nSeaweed\nRice\nCurrants\nShore jam - kinsels?\nCheese (Gouda or store cheese)\nVanilla\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast cake\nDid you make yeast for your own use? No\nUsing starter? No\nSalt rising? No\nDid you buy baking powder? Yes\nBaking soda? Yes\nCream of tartar? Yes\n\nNo records\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|------------------------------|-----------------------------------------------|\n| Canned salmon               |                                        |                              |                                               |\n| Canned sardines             |                                        |                              |                                               |\n| Other canned fish that appeared early - give names |          |                              |                                               |\n| Apples - fresh              |                                        |                              |                                               |\n|                             | dried                                  |                              |                                               |\n| Lettuce                     |                                        |                              |                                               |\n| Tomatoes - fresh            |                                        |                              |                                               |\n|                             | canned                                 |                              |                                               |\n| Bananas                     |                                        |                              |                                               |\n| Lemons                      |                                        |                              |                                               |\n| Oranges                     |                                        |                              |                                               |\n| Cornflakes                  |                                        |                              |                                               |\n| Other prepared breakfast cereals - give names |          |                              |                                               |\n| Pearl tapioca               |                                        |                              |                                               |\n| Minute tapioca              |                                        |                              |                                               |\n| Sago                        |                                        |                              |                                               |\n| Dates                       |                                        |                              |                                               |\n| Walnuts                     |                                        |                              |                                               |\n| Icing sugar                 |                                        |                              |                                               |\n\nNo records\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...............................................................\n\nHow far was this water from your home? ......................................................\n\nHow was it brought to the home? (pail, barrel, tank) .........................................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible. ..........................................................\n\n1/2 ft deep about 1915 - very hard water. Use sloughs for soft water. Now have a cistern for a few years. (About 5)\nNo records\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream)\n\nWell.\n\nHow far was this water from your home? (mile, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nNow have a cistern for a few years.\n\nNow have a cistern for a few years.\n13. SOAP\n\nDid you buy laundry soap or make your own? Make my own\nIf you made your own, did you use lye? Yes... good ashes?\nWhat kinds of laundry soap did the grocer bundle?\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? Wood, primitive chips, flat dried\nWhere did you get your fuel? From woodchips, from pasture, from the hay.\nMention any changes in the use of fuels which have taken place since you\nfirst started housekeeping, giving dates where possible. Began\nusing coal about 1914. Hauled\nit from Russia (Leeds) after the\nrailroad came through.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest\ndays? (Give dates) No\nDid you use an outdoor fireplace or bake oven? (Give dates) No\nBy whom was your first cook stove made?\nWhat year was it purchased? 1911 Price?\nWhat types of utensils did you use? (Iron, copper, tin, homemade) Iron\nFor preparing food? (china, earthenware, wooden bowls, other)\nWhen did you first see enamel ware?\nAluminum?\n6.\n\n13. SUGAR\nDid you buy sugar in bulk? Yes\nIf so, how much? 50 lbs\nWas it used up quickly? No\n\n14. FUEL\nWhat fuel did you use in your earliest days? Wood\nHow did you get your fuel? From the woods near our home\nWas there any chance in the use of fuels which have been taken from stores?\nFirst started using gas in 1914\nBegan using oil about 1914\nHauled it from Prussia (Pella) after the railroad came through\n\n15. HEATING AND COOKING APPLIANCES\nFor cooking, did you use an outdoor fireplace or open hearth in the earliest days? No\nDid you use an outdoor fireplace or bake oven? No\nDid you use an outdoor fireplace or bake oven? No\nBy whom was your first cook stove made? Unknown\nWhat year was it purchased? 1911\nWhat types of utensils did you own? Copper, tin, homemade\nWhat types of food did you cook? (chili, stew, beans, soup, other)\nWhen did you first own an aluminum pot?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nMuch of the food came to the merchants in bulk & they weighed it out & did the wrapping.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\nSummer:\n- breakfast - fried potatoes, eggs, porridge, bread & butter, milk & sugar\n- dinner - meat, potatoes, gravy, vegetable\n- rice pudding, milk\n- supper - potatoes, eggs, bread, butter, fruit\n\n1914:\nMe -\nPa -\nFive boys - 19, 17, 7, 5, 3.\nThree girls - 14, 12, 10.\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nJust the family.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nThe winter of 1913-14 we used wheat both ground (in our coffee mill) as porridge & boiled whole. Had no milk & only chokecherry jam for fruit. Pretty slim fare.\n\nI'm the \"hungry 30's\" while we didn't starve we certainly did not have adequate food for good health.\nMuch of the food came to the merchant. It did not go back to the merchant. It did not go back to the merchant.\n\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest war years. You can remember. Give the war and list the numbers of the really war years. Give the approximate date, e.g., winter or summer.\n\nSummer breakfast - fried potatoes, milk, jam, family breakfast dinner - meat, potatoes, gravy, vegetables\n\n1914. Mrs. Pa - 19, 17, 7, 5, 3\n\nThese girls - 14, 12, 10\n\n18. That year did you serve your first Christmas dinner in eastern Canada? Approaching the area at that time.\n\nJust the family\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details. The winter of 1913-14 we used wheat bread, milk, jam, sugar, coffee, tea, flour, salt, sugar, butter, eggs, cheese, meat, vegetables, fruit, fish, etc.\n\nPutty来临，我们没有足够的食物来维持健康。\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\ndidn't eat any raw salads in the early days & ate richer food.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\ndidn't eat any raw salads in the early days + ate richer food.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homeproven and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. [Use back of page if more space is needed].\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous vouliez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1912_323.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5398, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1329, 5], [1329, 2951, 6], [2951, 4084, 7], [4084, 4731, 8], [4731, 6355, 9], [6355, 7622, 10], [7622, 12420, 11], [12420, 12978, 12], [12978, 16897, 13], [16897, 17200, 14], [17200, 18224, 15], [18224, 19102, 16], [19102, 20410, 17], [20410, 21321, 18], [21321, 21982, 19], [21982, 22644, 20], [22644, 22792, 21], [22792, 22946, 22]], "primary_language": ["en", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]