[{"id": "37a85f132a6aa08237cfee3fe57109aa7378c885", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nPioneer Experiences\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Politics in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: JOHN HILLIARD McNABB\n\n2. Your address: 315-5TH AVENUE NORTH, SASKATOON, SASK.\n\n3. Date: July 19th, 1954\n\n4. Where were you born? (Give name of place and country): Kenilworth, Ont., Canada\n\n5. What was your father's name and occupation? Donald McNabb, farmer\n\n6. When did you come to Saskatchewan? (Give month and Year): May 1900\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible: Kenilworth, Ont. (only)\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.): 20 yrs. old\n\n9. What were your reasons for coming West? To Homestead and thereby establish a home for myself\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?): Railroad information from Mount Forest, Ont.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: McNABB, John Hilliard\n2. Your address: 315-6th Avenue North, Saskatoon, Saskatchewan\n3. Date: July 1947\n4. Where were you born? Kenilworth, Canada\n5. What was your father's name and occupation? Donald McNabb, farmer\n6. When did you come to Saskatchewan? May 1908\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Kenilworth, Ont. (early)\n8. How old were you when you first came to Western Canada? You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc. 20 years old.\n9. What were your reasons for coming West? To homestead and thereby establish a home for myself.\n10. How did you learn about the West? Through other people? Reading about it? Railroad or government information?\n12. What did your friends and relatives think of your decision to come to Western Canada? They considered it the best prospect for a young man in those days.\n\n13. Did you travel by yourself or with a party (family, friends or other groups)? Traveled by myself.\n\n14. What mode of transportation did you use? Railroads namely CPR and Grand Trunk.\n\n15. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other misfortunes, etc.)\n\n16. Where did you first stay when you arrived in Saskatchewan? I stayed at first with W.J. Rattray, where I joined my brother Robert, who had preceded me to the west.\n\n17. Where did you settle or take up land? On S.E. 1/4 Sec. 24 Twp. 9 R. 9 W., 7 miles northwest of Stoughton, Sask.\n\n18. Mention any other places where you have lived since coming to Saskatchewan. Moose Jaw, Tyner, Sask for the last thirty years and my present address.\n\n19. How did you earn a living before coming to Western Canada? Roy, after you came?\n\nIn 1889 I worked for a farmer at Kneilworth, but for eight months for which I received the sum of $60. This money was used to help pay my expenses to the West. In the early years I earned my living by Homesteading by working for different farmers in my spare time.\nThey considered it fit that\n\nBoroughs for a young man in three days.\n\nSo did you travel by yourself or with a party (family, friends, strangers or other groups).\n\nWhat means of transportation did you use?\n\nRailroads namely\n\nCPR and Grand Trunk.\n\nWhere did you first stop when you arrived in Salt Lake City?\n\nWhat was your first job in Salt Lake City?\n\nWhat was your second job in Salt Lake City?\n\nWhat was your third job in Salt Lake City?\n\nHow did you earn your living?\n\nDid you work for wages or did you own your own business?\n\nDid you have any formal education?\n\nDid you attend any religious services?\n\nDid you join any clubs or organizations?\n\nDid you participate in any sports or recreational activities?\n\nDid you have any hobbies or interests?\n\nDid you travel outside of Utah?\n\nDid you have any family members living in Utah?\n\nDid you have any friends or acquaintances living in Utah?\n\nDid you have any pets?\n\nDid you have any health issues?\n\nDid you have any financial difficulties?\n\nDid you have any legal troubles?\n\nDid you have any other experiences while living in Utah?\n19. How often did you write to relatives or friends in your old home? Between myself and my brother we wrote home quite often as long as my parents were living.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. I married Ethel Beattie Scott on June 25th in 1913 in Hamilton, Ont.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle? Yes, there was some other folks come West to settle on our recommendation.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. My brother Robert came West first in March 1920. He came to Alfred McMillan of Grasswood Man., who was a first cousin to my father. He was also related to the Hon. Archie McNabb. As there was no work at Grasswood Mr. McMillan drove my brother to Pipestone Man., where he got work with W.J. Rattray. Robert and I each filed on homesteads in May of that year in the Moose Mountain district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record? The booklet I am enclosing will tell some of our experiences.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? We attended Church when there was any to attend, and we travelled many miles in the primitive manner, visiting our neighbors was done mostly on horseback.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West first or second, when did they arrive?\n\n23. In what particular experience of pioneer days do you stand out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nThe attached church was the only one we attended, and we traveled many miles to attend it. The furnishing was very simple, and we had to work hard.\n25. When was the first car used in the community? As near as I can recollect around 1908.\n\n26. If you owned a car before 1914, when did you buy it? What make? I bought my first car in 1917, a model T Ford.\n\n27. Where was your trading center? How far from your home? The store was at Areola, 40 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) There was a store and Post Office established in 1902, called New Hope, which was about five miles from my homestead.\n\n29. How often did you shop in the early days? We shopped very seldom in the first days, from Areola our supplies were brought in during the fall.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1904 when the steel came in.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period. Other bought from mail order catalogues in Homestead days.\n\n32. When did you first have a telephone and what company provided it? 1912.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision? I came with the intention of staying.\n25. When was the first car used in the community? Answer: [Blank]\n\n26. If you owned a car before 1914, what make did you buy? Answer: [Blank]\n\n27. Where was your trading center? Answer: [Blank]\n\n28. Did you continue to trade there? (Indicate any charges due to new towns appearing, better means of travel, etc.) Answer: [Blank]\n\n29. How often did you shop in the early days? Answer: [Blank]\n\n30. When did people in your district first start going to town regularly on Saturdays? Answer: [Blank]\n\n31. When did you first begin to buy through the mail order catalogues? Answer: [Blank]\n\n32. When did you first have a telephone and what company provided it? Answer: [Blank]\n\n33. When you came to stay, how did you make up your mind after trying it out? Answer: [Blank]\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n   *Note that I know of no such movement, and I don't think any of them was returned.*\n\n35. Did many people move away during the 1920's? Did many return?\n   *I was not living in that district in the 1930's.*\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible.\n   *(Such as owning the first automobile, combine, organizing the first lodge, etc.).*\n\n38. How did the places in your community get their names? *(School districts, Post Offices, villages, railway stations, creeks, hills, etc.).* Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n   *As far as I know, the railway stations were named by an official of the Railway, and our school district was called Rock Lake after a lake which had that name. It was not far from the school.*\n24. Did any people move away from your childhood prior to 1930? If so, how many?\n\n25. Did any people move away during the 1920s? Did many return?\n\n26. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n27. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates wherever possible.\n\n28. How did the places in your community get their names? (school districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change; (6) facts of new names as above in (1), (2), (3).\n\nDo you know the railroad stations were named by an official of the Railway, and our town's name was called Rock Hall after a lake what had that name, I believe it was near there.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nYou may be able to get some information from the booklet which I am enclosing.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n........... (indicate your preference, if any)\n\nI will present the booklet which I am enclosing to the Regina Division of Archives Office.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nDonald A. McNabb and wife Helen, farming at Tyner, Saskatchewan.\n\nRobert J. McNabb and wife Elizabeth, farming at Tyner, Saskatchewan.\n\nMy daughter Maryann, wife of Mr. F. Reinke, farming at Holy Hill, two sons, Donald and Keith.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nIn 1900 the whole district was bald prairie, all burned black from prairie fires at that time. My brother and I were the first Homesteaders in the district. I would say the coming of the Steel in 1907 was the most important change.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nI don't know of any.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nE. Beatrice McNabb (wife)\n\n315-5th Avenue\n\nSaskatoon\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old posters, old photographs, written books of community organizations, old pamphlets, old newspapers, written reminiscences and reminiscences? (Describe)\n\nYou may be able to get more information from the file which I am enclosing.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\nIf so, please describe your preference, if any.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came west?\n\nIn 1900 the whole district was held by Mr. Tomlinson. He had been here about two years. The first homesteaders in the district were Mr. Ronald and Mr. Keith.\n\nPlease give the names and addresses of other pioneers who could answer these questions.\n\nIf someone else has filled in this questionnaire for you, please have this portion signed.\n\nGive name and address here:\n\n[Signature]\n\n[Signature]\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12945_1900_614.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4775, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3156, 6], [3156, 4418, 7], [4418, 5558, 8], [5558, 6866, 9], [6866, 7948, 10], [7948, 9459, 11], [9459, 10277, 12], [10277, 11737, 13], [11737, 12502, 14], [12502, 13808, 15], [13808, 14850, 16], [14850, 16571, 17], [16571, 17839, 18], [17839, 17839, 19], [17839, 17990, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]