[{"id": "46ce1b720758d77b6f2d6756e37a52f610dda296", "text": "S-X2\n646. Cudmore Harriet Kezia (Mrs. Henry)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nCudmore, Harriet Z.\nManor.\n\nTo Sask. - June, 1932.\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the reader:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual was asked to answer. It is easy to imagine the same experiences in a number of families. The answers will not apply to your experience but may apply to others. It is impossible to give details or stories for particular events, so try to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1924, and may be answered by anyone who has personal experience of this pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets of paper for a complete questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being compiled. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below; please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n\n( ) Pioneer health conditions\n\n( ) Pioneer social life, sports and recreation\n\n( ) Pioneer housing\n\n( ) Pioneer education and churchwork\n\n( ) Pioneer farming experience\n\nEncapsulation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNO. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Harriet Kezia Cudmore\n2. Your address: Manor, Sask.\n3. Date: ...........................................\n4. Where were you born? (Give name of place and country): Osborne County, Huron, Ontario\n5. What was your father's name and occupation?: Richard Johns, Shoemaker in England, Farmer in Canada\n6. When did you come to Saskatchewan? (Give month and year): June, 1902\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   Ontario: 1860 - 1880\n   Manitoba: 1881 - 1902\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.):\n   20 YEARS\n9. What were your reasons for coming West?:\n   Married Henry Cudmore who took up a homestead & preemption at Crystal City, Manitoba about 1878\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n\n[Stamp: June 1932]\n1. Your full name: Harriet T. Kezia Cudmore\n\n2. Your address: Manor, S.A.S.K.\n\n3. Into what county did you come? (Give name of place and country)\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. When did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, listing dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to state your age in years. If you were under 18 years of age at the time of your arrival, state your age then.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Ballad or government information?)\n\nMARIED HENRY CUDMORE\n\nWHO TOOK UP A HOMESTEAD PREEMPTION\n\nAT CRYSTAL CITY, MANITOBA\n\nABOUT 1878\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought I would freeze, starve or meet up with wild Indians.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nA whole train load coming west.\n\n13. What means of transportation did you use?\nTrain to Edmonton 8 days & nights. It was March and we travelled by train & sleigh loaded with a bureau (bed) & luggage 200 miles to Crystal City.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nOne night we spent with the M. where we slept on the floor in a room with 8 men. The other nights we stayed in boarding houses.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nWe bought a farm ½ mile from the village of Canning on Malnor, and brought all farming equipment & furniture on the train to Malnor. They drove the stock having a covered wagon saddle.\n\n16. Where did you settle or take up land?\nPovesh (2 men 1 boy) 2 weeks.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nLived with my parents learned dress making in Exeter. Worked on a farm in the west.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nThey thought it was a good idea.\n\n12. Did you travel by yourself or with a party (family, friends or other)?\nA whole train load coming west.\n\n13. What means of transportation did you use?\nTrain to Edmonton and we traveled by train.\n\n14. What difficulties of the journey did you encounter? (People you met on the way, meetings with Indians, adverse weather conditions or other matters.)\nNone.\n\n15. Where did you first stop when you arrived in Saskatchewan?\nWe bought a farm in Melfort, Saskatchewan.\n\n16. Mention any other places where you have lived since coming to Saskatchewan.\nNone.\n\n17. How did you earn a living before coming to Western Canada? How about you now?\nI worked on a farm in the winter and in the spring I worked in the fields.\n19. How often did you write to relatives or friends in your old home?\n   It took mail a month to come and go.\n\n20. If you got married, give the name of your husband or wife along with the date\n    and place of marriage.\n   HENRY CUDMORE FEB 24, 1880 EXETER ONT.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place\n    to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West\n    tell when they came and where they settled.\n   THOMAS Johns (BRO) CAMROSE ALBERTA\n   He lost his left arm at the shoulder when 22 yrs\n   of age - in a threshing machine.\n\n23. Is there any particular experience of pioneer days that stands out in your\n    memory which you would like to record?\n   One summer the men were away and we\n   felt very badly to miss the annual picnic so\n   we put one horse on the hot sleigh (front lot)\n   loaded the children and food & the women\n   walked behind. A neighbor with wagon &\n   oxen took us all home and we had fun.\n   The first year of my married life I lived in\n   a shanty with no floor & my husband made\n   trips to Edmonton and I was alone 5 months.\n\n24. Did you travel about much in the early years? (for business, attending church,\n    visiting friends, etc.) How often? How far? By what means of travel?\n   We always had horses & wagon later buggy\n   and democrat.\n   I have been back to Ontario St. Louis by\n   train & boat.\n3. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nHENRY Cudmore Feb 24, 1880 Exeter, Ont.\n\n21. Did you ever come to Saskatchewan because of your recommendation? If so, how?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\nTHOMAS Johns (Bro) (Camrose Alberta)\n\nWe had to go off alone at the same time when we were 22 years of age - in a threading machine.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOne summer the new house was away and we fell very badly to moist the arrival of rain. So the next day we went on the old stage (and I)\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe always took horses and wagons - lots of luggage\n\nand sometimes had to cut across Stone Bay of Prince Albert.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Ford\n\n27. Where was your trading center? How far from your home?\n   Mail came from Morcomin.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Manor came on the C.P.R. and became the town & the village of Cunningham Manor gradually died out.\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   Wawota rural telephone Co.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We came to Sask where there was more land for the children.\n25. Then was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading venture? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan, the first time, was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nFor the children\n\nWe came to Saskatchewan as new land\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nTo except some of the English settlers who were not suited to farm life.\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nOffices in the church & school, down through the years.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nMy husband donated land & promoted the building of the Holiness Movement Church which has an active congregation today.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nMrs A E M Swetlith has written up the history of Cannington Manor & surroundings so her accounts will be authentic.\n5. Did any people move away from your district prior to 1934? What reasons did they have?\n\nThe exact number of the original settlers who were not active in farm life.\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some members of your family have held public offices or have been active in any organizations, mention it here, giving dates wherever possible.\n\nMy husband donated land & funds to the building of the Palmer Memorial Church which has an active congregation today.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, owning the first telephone, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, military stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption. (A) any changes in name since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nWas a history written by the History of Tamworth, Maine, purchased by me for twenty-five cents at an antique store.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....\n(indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren Franklin - Farmer - children & grandchild\nCharles Franklin - Farmer - children & grandchild\nEllie Maude Raphael died (spindrift) died 1941 - children & grandchild\nWalter Edgar Turner - children & grandchild\nEliza Grace Willow - children & grandchild (Wawota)\nEliza Jane Ross - no family (wandering)\nAlfred Edwin - farmer - children & grandchild\nRichard Cecil (killed 1893) Buttenman - children & grandchild\n\n41. What do you think are the most important changes in your community since you first came West?\n\nWilfred Stanley - farmer - sons & daughters\nPena Myrtle Taylor - children & grandchild\nVilla Mae Wilson - children & adopted child\nClarence Henry - homestead - adopted child\nErnest Ray - died 1960 at the age of 9 yrs 9 mos 9 days.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire:\n\nMr. Percy Murray Manor Sask.\nMr. Arthur H. Murray Manor Sask.\nMr. W. B. Breckman Wawota Sask.\nMrs. Mrs. J. H. Grayson Wawota Sask.\nMr. Robert Higgins Manor Sask.\nMrs. Mrs. Clara Kaye Dawson Manor Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMy mother is well but dear. Mrs. J. A. Taylor (daughter)\nMy father was fairly well settled when we came and the pioneer days were really in Manitoba.\n\nManor Boy & Sask.\n32. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and photographs, written recollections and reminiscences (testimonies).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (Indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nMy mother is now 86 years old.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_646.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4979, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 45, 4], [45, 2020, 5], [2020, 3836, 6], [3836, 4949, 7], [4949, 5817, 8], [5817, 7152, 9], [7152, 7986, 10], [7986, 9409, 11], [9409, 10492, 12], [10492, 11706, 13], [11706, 12745, 14], [12745, 14080, 15], [14080, 15334, 16], [15334, 17383, 17], [17383, 18224, 18], [18224, 18331, 19], [18331, 18485, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]