[{"id": "6b68dc340db07315ac9c8ac2684eec43685392bb", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. If there is nothing of interest in them, do not fill them out. Answer the questions you can, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who came to Western Canada before 1914, and may be answered by persons who have lived in Western Canada for more than twenty years whether born in 1894 or not.\n\nIf more than one member of the family answers the question, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer:\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\n\nJUL 26 1955\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................... Jackson John S.\n2. Your address .............................................. Kinistino\n3. Date ......................................................... June 1, 1855\n4. Where were you born? (Give name of place and country) ........................................ Kinistino Sask.\n5. What was your father's name and occupation? .......................................................... Samuel Jackson\n6. When did you come to Saskatchewan? (Give month and Year) .................................... April 10th 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so.\n\nIt is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ............................................................ Jackson John S.\n2. Your address .................................................................. Almonte, Sask.\n3. Date .............................................................................. Jan. 9, 1955.\n4. Where were you born? (Give name of place and country) ......... Finland, Sweden\n5. What was your father's name and occupation? ......................... Samuel Jackson\n6. When did you come to Saskatchewan? (Give month and year) .... April 10th 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n9. What were your reasons for coming West?\n10. How did you learn about the Meigs? (Through other people? Reading about it? Balloted or government information?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n   My parents came by ox cart from Winnipeg, 1878, coming from Merrittton, Ontario.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? In Kinistino district.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   I ran a Butlers Shop in Village of Birch Hill, Sask., 1908 to 1916, and served on the Village Council during those years.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Farming (mixed), and also helped build Bridges with my father, running the Bridge Building outfit, building all bridges from South Saskatchewan River at Fenton to Sodale. We were building a traffic Bridge at Sodale when the C.M.R. built their Railroad Bridge at that point, in 1905.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\nMy parents came by ox & cart from Winnipeg, 1878. Coming from Hamilton, Ontario.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land? (Be specific)\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nI ran a butcher shop in Village Board Hall, Sask., 1918 to 1916, and owned an old Village Council during those years.\n\n18. How did you earn a living before coming to Western Canada? Roy, after you came?\n\nFarming (migrated) and also helped build Bridges with my father, running the bridge building outfit. Building the bridge at Chidale, we were building a bridge at Chipman in 1908.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nElizabeth Augusta Gordon - Kinistino, June 30, 1911.\n(Corn in Nova Scotia) Minister Rev. Bates (Presbyterian)\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nThere were two brothers, two sisters came from Ontario with my parents in 1878.\nAll settled in Kinistino District.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nWe never bought through mail order catalogue in early years. We started to buy clothing through catalogue about 1915. We do not buy these mail orders any more.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nPrince Albert was our shopping center.\nAny produce from farm had to be taken there for sale. Hauled our wheat there to be ground into flour. Usually got our year's supply in winter using horses and often on the sleighs or wagons.\nDistance was approximately 50 miles by the old trails.\nWe attended church regularly, 3 to 4 miles of distance.\nAnd in the real early days by ox team, patch by patch.\nPeople were much friendlier and hospitably than they are now. Going 15 miles to see our neighbors.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Sarnia Township because of your recommendation? If so, place to settle:\n\nThere were two brothers. Two sisters came from Ontario with my parents. In 1878.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nPrince Albert was our shipping center.\n\nAny produce from farm yard to the Eaton store was handled over what was to be ground into flour—usually on the old mill by the Old Falls.\n\nWe arranged our own regular route—3 to 4 miles by a dirt road.\n\nPeople went much further to see our products.\n\nWhen you go to see me, you will see how I am doing.\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n   *Kinistino*, about 3 miles after the Railroad came thru.\n   Before that we traded in Prince Albert, 45 miles away.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Occasionally at Prince Albert.\n\n29. How often did you shop in the early days? *about once in 3 months.*\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? *Not until recent years, maybe about 1920.*\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We never bought through mail order. Catalogues in early years. We started to buy clothing thru catalogues about 1915. We do not buy thru mail orders any more.\n\n32. When did you first have a telephone and what company provided it?\n   *First Telephone in 1919, Bowanbrae Telephone Co.*\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading contact? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? about once in 3 months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays? 1920.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\nAbout six families moved out, and about same number moved in.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\nI was municipal councillor for R.M. Invergordon (1930) for 24 years. President of Telephone Co. for many years, and still President of Temagami Central Board. Was councillor in the Birch Hill Council for 6 years. Director on the Temagami Co-op. from its formation until 1953. Served as community captain as director for many years, and am now an Elder of the Gowambros United Church. My son Gordon Jackson is now councillor in the R.M. Invergordon (for No. 430).\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\nFirst farming done with steam tractors in early 1900s, then tractors entirely with engines.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of my name as above in (1), (2), (3).\nThe School District got its name from a little white flower that grew on the hill where school was built. The best name for the flower was Gowam — and a hill is called a Bluff — so there for the name Gowambros was born.\nMy Mother, Mrs. Sam Jackson (Mrs. McHamilton) were the ones to propose the name — J. Gowambros School District was formed in 1896 — school built same year.\n5.\n\n35. Did any people move away from your district prior to 1914? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family were \"firsts\" to have or do something in the district mention it here (e.g., owning the first automobile, combining, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) date and reason for change.\n\nMy mother, Mrs. Jane Jackson, was born in 1896. She lived in Hamilton until she moved to my farm in 1914.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI have a picture of Police Barracks and Dispatch Riders (late Hon. Sanderson & Others) taken during the Rebellion.\n\nAlso a photo of the first Baseball team from Kinistino played in Prince Albert before the Railroad came through.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? (indicate your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nSon Robert Gordon Jackson, lives at home & runs the farm.\n\nDaughter (Mrs.) Helen E. Haines, Fruitvale, British Columbia.\n\n3 Grandchildren: Alice Haines,\n\nDonald Haines,\n\nDouglas Haines, Twins.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMethods of farming done with oxen & horses in early days, and now done entirely with engines.\n\nAnd automobiles & trucks have replaced the ox and cart and horse & buggy.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n6.\n\n39. Questions regarding historical sources material:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old photographs, written recollections and reminiscences (personal).\n\nShare a picture of Police Barrack and Depot.\n\nRider Gate Plus Bandstand's Outline. Taken during the\n\nPhotograph of the first Basketball Team from Hamilton\n\nPlayed in Prince Albert before the Northfield Game.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copyright?\n\n(2) be willing to present them to the Archives Division of the Legislative\n\nLibrary, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, share they\n\nlive and occupations,\n\nName Robert Breeding Jackson, born at home, grown up the farm,\n\nMarried (Mrs.) Helen E. Haines, Fruitvale, British Columbia\n\n8 Boulevard Rd. Home: Alice Thornton\n\nDonald Staines\n\n(Edward Staines) Turner\n\n41. What do you think are the most important changes in your community since you\n\nfirst came West?\n\nMethod of farming done with oxen, horses in early days, and now done entirely with tractors.\n\nAnd Automobiles & Trucks have replaced the ox and cart and horse buggy.\n\nPlease give the names and addresses of other pioneers who could answer this ques-\n\ntionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person\n\ngive name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_373JohnJackson.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4966, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3244, 6], [3244, 4600, 7], [4600, 5914, 8], [5914, 7096, 9], [7096, 8155, 10], [8155, 9709, 11], [9709, 10656, 12], [10656, 12078, 13], [12078, 12883, 14], [12883, 14835, 15], [14835, 15727, 16], [15727, 17317, 17], [17317, 18855, 18], [18855, 19010, 19], [19010, 19161, 20]], "primary_language": ["None", "None", "en", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]