[{"id": "61e67ae321fb6e00f085d92fc19ba5c4ca8626b6", "text": "S-X2\n708. LaRose Laura May Winn (Mrs. Henry)\nLaRose, Mrs. F.M.W.\nKipling.\nTo Sask., July, 1923.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA note of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on Pioneer Life because no individual who has lived in the west will have exactly the same experiences as another. Some of the questions will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It is desirable to give details, or describe particular events, if you have had occasion to answer the question.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nLaRose, Mrs. F.M.W.,\nKipling,\nTo Sask., July, 1902.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual will be asked to answer. It has already been experienced by many others, so there is no need to worry about answering blank spaces or answering questions in a particular manner. If you have any answers to these questions, please fill them in.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether they were born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll Questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life\n- Pioneer housing\n- Pioneer education and churchwork\n- Pioneer heritage experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nLaRose, Mrs. F.M., Kipling.\nTo Sask. - July, 1952.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Mrs. Laura May Winn (Mrs. Henry)\n2. Your address: 18th Ave., Saskatoon, Box 34.\n3. Date: March 18, 1952.\n4. Where were you born? (Give name of place and country)\n   - Ontario, Canada\n5. What was your father's name and occupation?\n   - William Winn\n6. Did your parents own land at the time of your birth?\n   - No\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   - Ontario, Canada\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\")\n   - I was about 12 years old.\n9. What were your reasons for coming West?\n   - Apparently the program was, come west, grow up with the west. Bring the growing boy west, you can purchase a homestead for only $10.00 to own.\n   - The wheat growing country.\n   - Some of brother, sisters, and brother came down to see relatives, advised mother to bring family to the West.\nLaRose, Laura May Winn (Mrs. Henry)\n\nTo Saskatchewan - July, 1932\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Laura May Winn LaRose\n2. Your address: 116 Main St., Box 34\n3. Date: March 18, 1932\n4. Where were you born? (If you were born in Canada)\n5. What was your father's occupation?\n6. What was your mother's occupation?\n7. How many children did you have?\n8. How many of your children are still living?\n\nWe lived in Ontario, until moving to Saskatchewan in July, 1903.\n\nApparently the program was, come west, grow up with the west. Bring the growing boys west. You can purchase a homestead for only $10.00 down and dairy required. Come west get rich.\n\nSome of Father's Siblings or Brother came down to the West.\nIt was rather interesting watching the passing trains or country pass by. Going around the great lakes when you could see both the snow and rain at the same time. We stopped over in Wpg for a few days. Then resumed our journey. It seemed all at once we arrived in Whitewood. Then was driven out to an uncle's farm.\n\nWe then settled up land in the Green Mountain section.\n\nIn 1912.\n\nMy brother was working for wages. Brother Harry the younger children in school doing what he could come to hand to support the family.\n13. What did your friends and relatives think of your decision to go to Western Canada?\n\nPathway relatives helped to get us finally settled.\n\n14. Did you travel by yourself or with a party (family, friends or other groups)?\n\nBrother & I came to go there.\n\n15. What means of transportation did you use?\n\nWe came by train.\n\n16. What landmarks of the journey best do you remember? (Provide you will on the way, etc.)\n\nIt was rather interesting watching the passing farms or countryside pass by. Going around the great lakes when you could see both the fingers and rear of grain at the same time. We stopped over in Wpg for a few days. Then resumed our journey. It seemed odd at that time to see buildings, farm houses attached to the land. One just realized they were living among the large fields to the north as we went through.\n\n17. Where did you first stay when you arrived in Saskatchewan?\n\nWe arrived in Whitewood, then were driven out to an uncle's farm.\n\n18. Where did you settle or take up land?\n\nWe took up land in the Qu'Appelle-Grasshopper section.\n\n19. Mention any other places where you have lived since coming to Saskatchewan.\n\nPathway Homestead, our own farm, where we settled in 1912.\n\n20. How did you earn a living before coming to Western Canada? How often did you earn?\n\nMy brother was working for $1.00 per day doing what the younger children in school doing what he could earn to help support the family.\n21. If other members of your family (brothers, sisters, parents, etc.) came from\n   Salt Lake City, Utah and were very satisfied.\n\n22. If there was any particular experience at pioneer days that stands out in your\n   memory which you would like to record?\n\n23. The county was an open prairie. The fences\n\nvery little cattle land. It was the Homestead age.\n\nyour cattle grazed them farming done.\n\ndaughters were for open.\n\nopen was joined together for Brushing of dands.\n\nas well as horses. Heading cattle on the open range.\n\nWhen we came west, the only mode of traveling was team.\n\nto carry a wagon. The furthest we went was 40 hills\n\nto white road. Grain was first hauled to white road.\n\nRochelle, Idaho. Hauling a windmillboat came into existence.\n\nchurch was at first held from house to house.\n\nJohn for the school house. This was for your\n\ncommunity got to gather and fellowship when hail.\n17. How often did you write to relatives or friends in your old home?\n\n18. If you got married, give the name of your husband or wife along with the date.\n\n19. Did you ever come to Salt Lake City? If so, when?\n\n20. Did you ever come to Salt Lake City? If so, when?\n\n21. Did you ever come to Salt Lake City? If so, when?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came first, tell us about them.\n\n23. In those early pioneer experiences of pioneer days that stand out in your memory what do you think was the most important thing?\n\n24. The country was all open prairie. The fences...\n\n25. Very little building land. It was the Homestead age.\n\n26. Cattle grazed there farming done.\n\n27. Quail were seen for crops.\n\n28. They were joined together for breaking of lands.\n\n29. As well as horses. Heading cattle on the open range.\n\n30. When we came west, the only mode of travel was team.\n\n31. We used a wagon the furthest we went was 40 miles.\n\n32. Grain was first hauled to whitewater.\n\n33. Before then, heading a windmillboat came into existence.\n\n34. Church was at first held from home to home.\n\n35. Later for the weekend house? Here was our first gathering for the community get-together and fellowship when hail.\n25. When was the first car used in the community? About 1916.\n\n26. If you owned a car before 1916, when did you buy it? What makes?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When did you start going to town regularly?\n\n31. What kind of articles were bought by mail order? Indicate also what fraction of your total purchases were made by mail order during the pioneer period.\n\n32. When did you first begin to buy through the mail order catalogue?\n\n33. Did you ever make any changes in the proportion of purchases made by mail order during the pioneer period?\n\n34. When did you first have a telephone and what company provided it?\n\n35. When did you come to Sackettawan the first time? Was it with the idea of starting permanent residence? Or did you make up your mind after trying it out? When did you make this decision?\n\n36. Did you have no choice, was under further supervision.\n25. When was the first car used in the community? about 1916\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Specify any changes due to new terms appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When did you start going to town regularly?\n\n31. Then (if ever) did you first begin to buy through the mail order catalogs?\n\nWhat kind of articles did you buy at this time? What was the proportion of purchases made by mail order during the pioneer period.\n\n32. Then did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\n34. Would you have had choice, were under further\n\nsupervision.\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\nI don't think so.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, several. I moved away during the 1920s but returned.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates whenever possible.\n\nI held office in the Section of the Home Builders\n\nIn 1920, I also was Teacher of the Infant Class in Sunday School for about six years.\n\n37. If you or any of your family or friends were affiliated to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (See below) districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and location of patron suggesting place name; (2) origin and meaning of the name; (3) date of the adoption. Any changes in name since then state the first name was given, date and reason for change.\n\nOur district is called the Buffalo Plain School District.\n\nIt's name, originally, was the Buffalo that used to roam the prairies, when we first came here to Homestead.\n\nThe land was brought out from Town to a Community Center.\n\nJohn Winn was discarded as your law became available.\n34. Did any people move away from your district prior to 1917? What reasons did they have for moving?\n\nI don't think so.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, several. I moved away during the 1920s out west.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI held office in the Justice of the Peace Bureau.\n\nIn 1918, I also was Teacher of The Infant Class in Sunday School, for about six years.\n\n37. If you or any of your family or friends were called to have or do something in the district, mention it here, giving names whenever possible. (Such as organizing the first automobile, combining, organizing the first lodge, etc.)\n\n38. Name all the places in your community. Give their nearest (census) districts, post offices, villages, railway stations, creeks, hills, etc., etc., etc. Try to give (1) name and population of patron suggesting place-name; (2) name and meaning of the name; (3) date of its adoption; (4) any changes in name since then; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nOur district is called the Buffalo Plain School District.\n\nIt's name, originally, was the Buffaloes that used to roam the prairie, when we first came here to Homestead. The trail it was brought out from town to a Community Center.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n(Indicate your preference, if any) ...........................................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nwe have four boys settled close to us. Grandmas\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe change from oxen or horses drawn implements to tractor drawn machinery. combines.\n\nThe better house up to date way of farming.\n\nOur elders were the real pioneers, we having a share in the pioneering too. Most of the first pioneers started passed on. Soon the second generation will follow suit.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs. Henry LaRose\n\nHip Hip Hooray Saskatchewan!\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences (genealogy)?\n\nWould you or the person who could be either:\n\n(1) willing to lend them to the Provincial Archivist for copying?\n(2) willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWe have four grand children.\n\n40. What do you think are the most important changes in your community since you first came here?\n\nThe change from oxen or horse drawn implements to tractor drawn machinery embodies the slower pace of life of farming. Our elders were the real pioneers, not having a share in the pioneering era. Most of the first pioneers' land passed on. Soon the second generation will follow suit.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMrs Henry LaRose\n\nHip hip hooray!\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12947_1903K-Q_708.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4694, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 45, 4], [45, 1918, 5], [1918, 3726, 6], [3726, 4814, 7], [4814, 5550, 8], [5550, 6067, 9], [6067, 7491, 10], [7491, 8385, 11], [8385, 9624, 12], [9624, 10694, 13], [10694, 11626, 14], [11626, 13037, 15], [13037, 14446, 16], [14446, 15880, 17], [15880, 17212, 18], [17212, 17359, 19], [17359, 17513, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]