[{"id": "c45f79831354b9abcc88d5ed5ce54b0448860a70", "text": "A word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer diet\n( ) Pioneer schools\n( ) Pioneer churches\n( ) Pioneer recreation and social life\n( ) Pioneer farming experiences\n( ) Folklore in Saskatchewan\n( ) Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nJordan, Matthew\n\nSaskatchewan Nursing Home,\nAvenue A, Saskatoon, Sask.\n\nPIONEER Experiences\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces.\n\nPlease be honest in your answers, so that we may get an accurate picture of pioneer life.\n\nDon't hesitate to give details, or describe particular events, if they help to answer the question.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives questionnaires which have been prepared or projected are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer diet\n- Pioneer schools\n- Pioneer churches\n- Pioneer recreation and social life\n- Pioneer farming experiences\n- Folklore in Saskatchewan\n- Pioneer health and housing\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Office of the Saskatchewan Archives at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Saskatchewan.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ........................................ Matthew Jordan\n\n2. Your address ........................................ Saskatoon Nursing Home, A. Saskatchewan\n\n3. Date ......................................................... \n\n4. Where were you born? (Give name of place and country).\n   Dunrobin, Ottawa, Ontario\n\n5. What was your father's name and occupation?\n   Thomas Jordan, Farmer\n\n6. When did you come to Saskatchewan? (Give month and Year).\n   April 1903\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   May 24, 1882, Darling Ford, Manitoba\n   1883, Mathey, Manitoba\n   To 1903\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n   24, Born in 1858, August 14\n\n9. What were your reasons for coming West?\n   Wanted a farm of my own\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    My brothers were in Manitoba ahead of me\n    Came to Saskatoon in 1903 looking for more land.\n\n11. How did you earn a living before coming to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n    Bought a farm, Cattle, Rent Estate\n\n12. How did you settle or take up land?\n    Sold settlement money, went to Canada\nJordan, Matthew\nSaskatchewan Nursing Home,\nAvenue A, Saskatoon, Sask.\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Matthew Jordan\n2. Your address: Salt Lake, Minn., Ave A, Saskatoon\n3. Date: 1903\n4. Where were you born? (Give name of place and country): Dorogobin, Ontario\n5. What was your father's name and occupation?: Thomas Jordan\n6. When did you come to Saskatchewan? (Give month and year): April 24, 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - Darling Ford, Manitoba: May 24, 1882\n   - Matther, Manitoba: July 19, 1882\n   - Brown, Manitoba: Aug. 14, 1888\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.):\n   - I was 14 years old\n9. What were your reasons for coming West?\n   - Wanted a farm of my own\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?):\n    - Brothers were in Manitoba ahead of me\n    - Came to Saskatoon in 1903 looking for work\n\nPoveshell\n11. What did your friends and relatives think of your decision to come to Western Canada?\n   Best thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   With a cart.\n\n13. What means of transportation did you use?\n   Ottawa to Emerson via USA. Awful flood at Emerson.\n   Emerson to Darlinford & Matias by team.\n   Matias to Saskatoon by train.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n   Had dog under the seat all the way.\n   Cook stove ruined after sitting in Regina Station for 2 weeks.\n   Saw bridge go out 3 times after arrival in Saskatoon.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   Queen Hotel then a house on River Bank.\n\n16. Where did you settle or take up land?\n   Saskatoon.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   Saskatoon and farm 9 miles S.\n\n18. How did you earn a living before coming to Western Canada? How, after you came?\n   Bought up on a farm. Cut cordwood for boats.\n   On Ottawa River.\n   Farming, cattle, real estate. Sold store.\n   Sold farm to Bank Colonists.\n   Took settlers around country to view land.\n   Sold Pioneer House sale (National Trust on 2nd Ave).\n11. What did your friends and relatives think of your decision to come to Western Canada? Best thing to do.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? Willa Hart\n\n13. What means of transportation did you use? Return to Canada via USA. Arrived aboard at Brown\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\n15. Where did you first stay when you arrived in Saskatchewan? Quillan started them a house on River Bank\n\n16. Where did you settle or take up land? Saskatoon\n\n17. Mention any other places where you have lived since coming to Saskatchewan. Saskatoon and Farm 9 mile S.\n\n18. How did you earn a living before coming to Western Canada? How after you came? Bought land on a farm. Cut and cleared the land. Used Stone. Cattle, Real Estate. Sold Oats to Barn. Coloured. Good Settler around country to work land. (Not sure about these last two.)\n19. How often did you write to relatives or friends in your old home?\n   2-3 times a year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n   Sarah Ann Jordan nee Allan. Cartwright, Manitoba. February 1895.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n   Yes, plenty.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n   Charlotte Weir. Lency. 1905.\n   Con & Albert Dawson. Saskatoon. 1910.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n   Downing land seekers on old Battleford Trail.\n   Ford National Trust to their site.\n   Ford site of Power House.\n   Fored river at Ice House with railroad of cattle.\n   Saw the bridge go out three times.\n   In Manitoba, robber bands used to come out from USA to steal cattle.\n   Typhoid epidemic 1904. Sent hospital.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n   Yes, for business.\n   2 days, 3 days, once 300 miles by boat.\n   Brandon, Battleford, Ocean.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? Yes, Plenty.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nCharlotte Blair Lewis 1905\nC. M. Allard Brown\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nYes, by horseback, oxen, cart, bicycle, train, boat, etc.\n25. When was the first car used in the community? Dr. Willouby Butler\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   No\n\n27. Where was your trading center? How far from your home?\n   Lived on Shading Crescent on West Side Saskatoon\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes\n\n29. How often did you shop in the early days?\n   Every day\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   N.A.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   To stay permanently\n   Made decision before leaving Manitoba\n25. When was the first car used in the community? Our Willaby Butler.\n\n26. If you owned a car before 1914, when did you buy it? That makes?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nN.A.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatoon the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nToday permanently living Merv Ellen\n\nMade old civic fibre planning Merv Ellen\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\nYes\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n1st Overseer Village of West Saskatoon 1905-1\nBrother Ed Jordan was an Alderman\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nSee(36) Overseer\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\n[Handwritten text not legible]\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSee (3C) continued\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?.......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (indicate your preference, if any) ....................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nRoy Jordan Brooks Brook Yukon Civil Servant\nMurray Jordan Salvation Farmer\nMrs Mildred Wilson Hughton Surf Housewife\nMrs M. McGee Turbotville\n\n41. What do you think are the most important changes in your community since you first came West?\n\nRoads Buildings Heating and Lighting\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nFrank Jorgie Hughton Sask.\nMrs. J. E. Buttingham Mullingar Sask.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nHildred Wilson (daughter)\nHughton Sask.\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1903D-J_702.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4725, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1619, 5], [1619, 3323, 6], [3323, 5128, 7], [5128, 6472, 8], [6472, 7802, 9], [7802, 8812, 10], [8812, 10077, 11], [10077, 10869, 12], [10869, 12023, 13], [12023, 13109, 14], [13109, 14206, 15], [14206, 15185, 16], [15185, 16505, 17], [16505, 17464, 18], [17464, 17464, 19], [17464, 17618, 20]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]