[{"id": "a89592ec9e5a901e9a7ac846b9415313d6cf6742", "text": "S-X2\n640. Bennett Mary Rebecca (Mrs. Richard M.)\nS-X2\n640. Bennett Mary Rebecca (Mrs. Richard M.)\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer so don't worry about answering blank spaces. Use extra sheets if necessary. There is also sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here (X).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who has lived in Western Canada for more than five years will have experienced all aspects of pioneer life. Some of the questions here will not apply to everyone; others may prove impossible for you to answer. You don't have to answer every question. Use experience and imagination to fill in answers where necessary.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or reply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this and would be willing to do so, please put a check mark here (X) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: MRS. MARY REBECCA BENNETT\n2. Your address: C. CONQUEST, SASK.\n3. Date: MAY 1952\n4. Where were you born? (Give name of place and county)\n   WILMINGTON (Ontario)\n5. What was your father's name and occupation?\n   William Wright - farmer\n6. When did you come to Saskatchewan? (Give month and year)\n   1902. March 12th\n7. Mention any other places where you may have lived before coming to Saskatchewan (if possible).\n   Grass Lake Alberta\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was in my teens\", etc.)\n   20 years old\n9. What were your reasons for coming west?\n   To help my husband make a home.\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n    Two other people and reading\nSaskatchewan Archives No. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPLEASE PRINT ALL PROPER NAMES AND PLACE NAMES IN CAPITAL LETTERS. IF YOU ARE NOT SURE THE NAME IS CORRECT AS YOU HAVE GIVEN IT, PLEASE SAY SO. IF YOU RATHER HAVE SOMEONE ELSE DO THE WRITING AT YOUR DIRECTION, THIS IS QUITE ACCEPTABLE.\n\n1. Your full name: MRS. MARY REBECCA BENNETT\n2. Your address: CONQUEST, SASK.\n3. Date: M.A.S. 1952\n4. Where were you born? (Give name of place and country)\n   WILSONBORO ONTARIO\n5. What was your father's name and occupation?\n   WILLIAM WRIGHT FARMER\n6. When did you come to Saskatchewan? (Give month and year)\n   1902 MARCH 12TH\n7. Mention any other places where you lived before coming to Saskatchewan, giving date wherever possible.\n   GRASSY HALL ALBERTA 1902-1907\n8. How old were you when you first came to Western Canada? (You do not need to say \"at this time\")\n   20 YEARS OLD\n9. What were your reasons for coming West?\n\nTo help my husband make a home.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nThis file people and reading\n11. What did your friends and relatives think of your decision to come to Western Canada?\nMy people were not very favorable.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\nRichard & I traveled as bride and groom.\n\n13. What means of transportation did you use?\nCanadian Pacific Railway\n\n14. What incidents of the journey west do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\nMy brother William Willifly, met us at Invermora Brandon as we had an old friend that we would be passing through that day.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nFellmore\n\n16. Where did you settle or take up land?\nFellmore, near the old spring trainee & mail trail.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nRegina '14-'21\nCougard '21-1921-1932\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nI lived in my father's home and when we moved to Alberta, had a ranch in Edmonton as about in Regina my husband was in the survey business and also in George Freeman at Cougad also land at Cougad.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nMy people were not very favorable.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nBy railroad & I traveled as bride and groom.\n\n13. What means of transportation did you use?\n\nCanadian Pacific Railway.\n\n14. What incidents of the Journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nMy brother William Wissell Jr., met me at Brandon as we had arranged to meet - we would be planning to go west.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nFollows\n\n16. Where did you settle or take up land?\n\nAlberta was a good place to live and work.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nRegina '14-'21\n\nLaguna '21-'29\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI lived in my father's home and worked as a farmer in Alberta. Had a ranch in Regina as above, in Regina my husband was in the grain business and also in the grain business at Coquihalla and at Coquihalla.\n19. How often did you write to relatives or friends in your old home?\n\nEvery week\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nRICHARD M. BENNETT. MAR. 6th, 1902.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nCan not say.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nA brother W. Wright settled at Fillmore.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to recount?\n\nHad many thrilling experiences in Alberta. One experience with Indians, the offer of a real papoose for my own, and much horse-back riding, killing rattlesnakes. One very fine fellow was in behind the kitchen stove another in the milk cellar.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often, how far? by what means of travel?\n\nWe did travel to Lethbridge by wagon, to have infant son baptized, also traveled long distances on horse-back, carrying baby & violin to community gatherings.\nEvery week\n\nRichard M. Bennett. March 1902.\n\nA booklet by Wright written at Fillmore\n\nHand copy (signature in \"Allright\")\n\nWe did travel to Fillmore by way of To have walked on foot, also traveled by\n\nBaloney on horseback, carrying baby in saddle.\n\nTo community gatherings\n25. When was the first car used in the community?\n   about 1918\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   We did have Ford car 1912.\n\n27. Where was your trading center? How far from your home?\n   In Alberta, Red Deer & Edmonton, 65 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   After coming to Fillmore we traded locally at stores and food stores.\n\n29. How often did you shop in the early days?\n   Once every three months.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   We started at Fillmore in 1907 and it was then the custom for the country people to come to town Sat.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   We began ordering dry goods also dried fruits and drugs from J. Eaton Co. in 1912. This buying might have been 10% of our spending and only ordered twice a year. Very little mail order dealing at present.\n\n32. When did you first have a telephone and what company provided it?\n   1908, can't remember the company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes, we expected to make our home in Saskatchewan, as we felt the hot winds so common in Alberta would not be good for farm production.\n25. Then was the first car used in the community?\n\n26. If you owned a car before 1914, then did you buy it at that time?\n\n27. There was your earliest contact? For the town your house?\n\n28. Did you ever have Ford cars?\n\n29. How often did you shop in the nearby town?\n\n30. Have any other A.M.C. cars?\n\n31. Were (or ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and how charged in the proportion of purchases made by mail order since this date?\n\n33. When did you first hear of the automobile?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe names at Conquest were given before we moved here. We have been told that Conquest got its name when the ferry was put across the Park River and it was named for the conquest of crossing the river.\n35. Did you explore areas away from your district prior to 1924? If so, why?\n\n36. How many hours daily did you work at the job?\n\n37. If you or any members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, townships, railroad stations, creeks, hills, etc.) Try to give (1) name and occupation of person representing place-name; (2) origin and meaning of name; (3) date of the petition; (4) any changes in names since then; (5) any other facts and reasons for name.\n\nThe names of Cozyard were from before we moved here, but have been used for years. Cozyard (pot-ud-name when at Fair) was just across the back gate and it was named for the longingly craving the sled.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n39. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, mimeo books or community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (specify), or the Archives Office at the University of Saskatchewan? (indicate your preference, if any) ………………..\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nAm. G. A. Bennett - England - Canada\nAm. F. E. Bennett - England - Canada\n\nDaughters: Mrs. E. M. Ayres - England - Canada\nMrs. E. M. Ayres - England - Canada\n\nWhat do you think are the most important changes in your community since you got here?\n\nFirst House West:\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12946_1902A-D_640.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4517, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 49, 3], [49, 98, 4], [98, 1980, 5], [1980, 3662, 6], [3662, 4851, 7], [4851, 5932, 8], [5932, 7115, 9], [7115, 8292, 10], [8292, 9471, 11], [9471, 9744, 12], [9744, 11407, 13], [11407, 12041, 14], [12041, 13207, 15], [13207, 14056, 16], [14056, 15074, 17], [15074, 16249, 18], [16249, 16385, 19], [16385, 16539, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]