[{"id": "1cc36047bdc4691a31608e378ad7da0db8c263f0", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNO. 2\n\nA word of explanation to the person answering this questionnaire.\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1944, and may be answered by anyone who has personal experience of the pioneer years wherever born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nWrite them on separate sheets or apply for a separate questionnaire.\n\nWestern Canadian Pioneers' Ball\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives Questionnaire No. I, entitled \"Pioneer Ball,\" what did Saskatchewan Archives Questionnaire No. I, entitled \"Pioneer Ball,\" what did\n\nOther Questions\n\nSaskatchewan Archives Questionnaire No. I, entitled \"Pioneer Ball,\" what did\n\nAll questionnaires will be preserved in the Saskatchewan Archives Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Office's permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nPreservation of Questionnaires\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. It's easy to answer or not to answer if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1945 and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Piety: What Did Western Canadian Pioneers Pray?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer farming experience\n- Pioneer education and churchwork\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your discretion, this is quite acceptable.\n\n1. Your full name\nH.C. Young\n\n2. Your address\nR.E.D.V.E.R.S.(town) SASK\n\n3. Date\nApril 1953\n\n4. Where were you born? (Give name of place and country)\nKardon, England\n\n5. What was your father's name and occupation?\nG. Young Office Worker\n\n6. When did you come to Saskatchewan? (Give month and year)\nApril 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\nWinnipeg and Weyburn and Canada\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\nfrom the file folder\n1. Your full name: H. C. Young\n2. Your address: Redvers, Sask.\n3. Date: April 1905\n4. Where were you born? (Give name of place and country) London, England\n5. What was your father's name and occupation? J. Young, Office Worker\n6. When did you come to Saskatchewan? (Give month and year) April 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Worked at Newcastle and Redvers 1903-1904\n8. How old were you when you first came to Western Canada? (You do not need to answer this question in any teens; etc.)\n9. What were your reasons for coming West? I wanted to see the world and own of it\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nFrom other sources\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   [Signature]\n\n13. What means of transportation did you use?\n   [Signature]\n\n14. What incidents of the journey West do you remember? (People you met on the way,\n    meetings with Indians, adventures on the journey, accidents or other excitement\n    etc.)\n   [Signature]\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   [Signature]\n\n16. Where did you settle or take up land?\n   [Signature]\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   [Signature]\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   [Signature]\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThought it was crazy.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nWith a family.\n\n13. What means of transportation did you use?\n\nSteamer & Train\n\n14. What incidents of the journey do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nTravelled Car from [illegible] to Winnipeg and pulled\n\n3 days on train, bought provisions when we shipped,\n\nStay in end of car for towing mule for ten, one night\n\nOn election wrote on ad how our tickets voted there\n\nNo incident on steamer\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nOn my homestead\n\n16. Where did you settle or take up land?\n\nClaim on homestead\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nNo other place but recently\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nOffice Worker\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? For what reasons (for business, attending church, visiting friends, etc.). How often? Few first By what means of travel?\n\n3.\n3.\n\n19. How often did you write to relatives or friends in your old home?  \n   *quite often*\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.  \n   *No*\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?  \n   *No*\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.  \n   *My aunts came in 1906. They district*\n\n23. Is there any particular experiences of pioneer days that stands out in your memory which you would like to record?  \n   *No. We came by train partly from one house through yard to next house and so to town, as there used to be along on Road Allowance well graded always had in wet weather, gravel roads not thought of as more land was broken for what the land to pitch to travel allowance when too bad too make or\n\n24. Did you travel about much in the early years? (for business attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n*Not walking, ploughed a horseback homestead farm, went to school in Assiniboia and on down very far. Always worked empty days and made rent card tickets when he got a can of wheat. Farmers around living and empty days for the necessities and prices reflected an winter, no thanks are needed with them and obliged - never.*\nWe do not know how much work we had to perform. We worked hard and took care we did not have to do it ourselves, so heavy conditions... You had not heard us. Oh dear we could not have worked as hard as we did.\n\nYes, he spoke in such a way as to show that he cared very much about each other and was doing everything possible to make sure that they would be happy together. Of course, they seemed very much like family members at times.\nWinter of 1906-9. Not only grain, also cattle.\n\ndifficulty in buying corn when we can get none at all.\n\nWe had no meat and could not buy it to eat. Farmers,\n\nbluffs had no provisions so we had no wood at\n\nhome. God through 10 miles without provisions.\n\nWe worked hard and lived well we did not modify\n\nour principles on coming to a new country. Things we\n\ndid not have or did not want for our own backs nor\n\ngranted.\n\nNeed some help to move Mountain for firewood\n\nabout 40 miles ahead over rough and stopping place\n\nand then to start on floor, rain and sunshine\n\nday shades, charged 25¢ a night and me, my son\n\nthe use of wood above let h. help my own\n\nand oath and try for horses, no money, horses\n\nApril, my second winter under God's care.\n\nThis spring going over the hills in May\n\nReft camp in Mountains charged 25¢ a head from\n\nwant to stay on and good shelter for horses.\n\nGovernment charges on Cattle and make a summer\n\nfor rent for people.\n\nbut for the second many settlers made\n\ntents or cold places and we did not get the word fine\n\ngood bed in men for an old man they had about second - cont'd\n25. When was the first car used in the community?\n\n26. If you owned a car before 1944, when did you buy it? What make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to take trains (indicate any changes due to new forms of transportation)?\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\n32. What kind of articles did you buy in this way? Indicate also the proportion of purchases made by mail order compared to other methods.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently or did you make up your mind after trying it out? When did you make this decision?\n\nCan you do anything? Summer of 1942\n\nWhat could you do by the time you came into Saskatchewan?\n\nWe will have to pay costs so no knowledge required\n\n$25.00 for 13th floor $25.00 for 13rd floor only needed\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center?\n\n28. Did you continue to trade there? (Indicate any changes due to new routes & prices.)\n\n29. How often did you shop in the early days?\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogue?\n\n32. Was kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and all charges in the proportion of purchases made by mail order since the catalogue.\n\n33. When did you cease to buy from the catalogue?\n\n34. Permanent? Or did you make up your mind to stop buying?\n\n35. When did you first have a telephone and what company provided it?\n\n36. North Reeves\n\n37. When did you cease to Saskatchewan the first time was it with the idea of staying permanently? Or did you make this decision?\n\n38. Summer of 1902\n\n39. Wood could buy the house own land was obtained we were able to buy coal as we had already accumulated cash. Have the receipt for money paid for wood.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nMany took homesteads and moved away as soon as they got title, result many 1/2 section farms from selling out to those who stayed.\n\n35. Did many people move away during the 1930's? Did many return?\n\nToo poor to move out had to stay and wait for better times mostly they survived and now doing well.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nonly on School Board\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given; date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool district from supposed Silver found in creek\nFry from Mr. Fry an early settler\nRedden & Wanchope from South African War\nAulton from Aulton Creek running into Souris River\n5. Did any people leave away from your district prior to 1941? What reasons did they have for leaving?\n\nMany farm homesteads and moved away as soon as they got title; recall many who seemed from selling out to those who stayed.\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nonly on School Board\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here, giving dates wherever possible. (Such as opening the first automobile, organizing the first lodge, etc.)\n\nSchool district from without other, toward in case of\n\nfrom an early settler\n\nPeter & Wanda from South African land\n\nafter from Butler Creek running into Snake River\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNothing of interest merely dates of starting on land and dates of harvesting and freeze up from April 1909.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .....yes\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .....(indicate your preference, if any) .....yes...of...considered to be of sufficient interest\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nMechanized Farming, Larger Farms, Larger School Unit, Social life dead Country Church dead Picture shows in town Everybody has a car and many go to town Saturday night\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMrs. F M Woodward Waskada Man\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n______________________\n37. Questions regarding historical source materials:\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, old programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nNothing of interest\n\nDates of starting and ending and from April 1905.\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library? (Specify your preference, if any)\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came here?\n\nModernized farming, larger farms, larger school unit, social life dead, country church dead, picture shows in town, every body has a car and many go to town Saturday night.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\n_________________________\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_881.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 4915, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2063, 5], [2063, 3995, 6], [3995, 5072, 7], [5072, 5858, 8], [5858, 6542, 9], [6542, 7576, 10], [7576, 8272, 11], [8272, 9653, 12], [9653, 10089, 13], [10089, 11193, 14], [11193, 12217, 15], [12217, 13383, 16], [13383, 14778, 17], [14778, 15642, 18], [15642, 17041, 19], [17041, 18244, 20], [18244, 18391, 21], [18391, 18545, 22]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]