[{"id": "fe758c2a102a850c43614ecda35021203bbe8106", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Cosmas Fehrenbach\n2. Your address: Anderson Codge, Yorkton, Sask.\n3. Date: March 21, 1962.\n4. Where were you born? (Give name of place and country): London, England.\n5. What was your father's name and occupation? G. Fehrenbach, clock maker, jeweller.\n6. When did you come to Saskatchewan? (Give month and year): April 1889.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nWe were a family of seven children. I wasn't very young. The four eldest boys, Fred, Harold, Jack, and Bill, homesteaded by Emigration Literature. We moved much trapping around. Nearby climate, 160 acres of good land in 1885. Cheap fare on route. Practically tax free. Free education. No taxation. Government and prosperity. Railroad. Government. Homestead laws and...\n1. Your full name: COSMAS, FEHRENBACH\n\n2. Your address: ANDERSON COODGE, YORKTON, SASK.\n\n3. Date: March 21, 1962.\n\n4. Where were you born? (Give name of place and country): LONDON, ENGLAND.\n\n5. What was your father's name and occupation? G. FEHRENBACH, Clerk maker, Jeweller.\n\n6. When did you come to Saskatchewan? (Give month and year): April 1889.\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\nWe were a family of seven children. Parents both living. Had four eldest boys. Hypothetical family in immigration. Freely homesteaded by Emigration Act. Tax, annually much cheaper. Advantage, climate, 160 acres of good land in 1875. cheap fare on route. Practically tax free. Free education etc. Government give everything.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nRailroad. Government. Illustrated. Opportunities greatly exaggerated. Illustrated. Opportunities greatly exaggerated.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have written it, please say so. It is quite acceptable to trace someone else's writing at your discretion.\n\n1. Your full name: Cosmas Fehrenbach\n2. Your address: Anderson Lodge, Yorkton, Sask.\n3. Date: March 21, 1962.\n4. Where were you born? (Give name of place and country): London, England.\n5. What was your father's name and occupation? G. Fehrenbach.\n6. When did you come to Saskatchewan? (Give month and year): June 1889.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n   - -\n   - -\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or if you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n   - We were a family of seven children, parents both living the farm.\n   - We had no land in Germany, family promised by\n   - Climate, 160 acres of good land in the church face for raising\n   - Practically tax free. Free education via pamphlets\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nCosmas Fehrenbach\n\n(Handwritten: Illustrated, Saskatchewan - Poveshell, biography)\n\nWintry cold, promising to gradually improve in summer.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and places names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name: Cosmas Fehrenbach\n2. Your address: Anderson Lodge, Yorkton, Sask.\n3. Date: March 21, 1962.\n4. Where were you born? (Give name of place and country): London, England.\n5. What was your father's name and occupation? G. Fehrenbach.\n6. When did you come to Saskatchewan? (Give month and year): June 1889.\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates whenever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child,\" \"I was in my teens,\" etc.)\n9. What were your reasons for coming West?\n\nWe were a family of seven children, parents left living in France.\nWe heard about opportunities in Saskatchewan, partly through my Grandfather.\nEmigration Stations, financially much cheaper.\nClimate: 160 acres of good land in the oblong shape in town.\nPractically thirty-five free education.\nFree education.\nRailroad or government information?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\nRailroad, government. I remember times and occasions.\n\nConstitution, company, literature, brothers.\n\nIllustrated. Illustration—pretty brochures.\n\nWeekly journal to ground families promised.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were not too enthusiastic.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNo party, just me or otherwise.\n\n13. What means of transportation did you use?\n\nAllen Line Steamship, S.S. Persian\n\nGrand Trunk, O.R., also C.P. to destination.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nBeing Mary Young, both ship and rail travel was very\n\nMontonan, and many, both on land and river. No particular\n\nincidents occurred during our journey. We came at particularly\n\nhard times during the war and helped food to family members.\n\nThe train, steamer, Allen Line, Grand Trunk and my family\n\narrived all in one.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaltcoats, Assiniboia, N.W.T.\n\nThere were large immigration halls in Saltcoats, with free accommodation for several families. We were not\n\nwith many other families staying there. We stayed for a few days.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded near N.W.A. Sec. 30, T.P. 24, R. 2, W. m.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n1946-1956 Cypress River, Man.\n\nHow did you earn a living before coming to Western Canada? How, after you came?\n\nFather was the only wage earner. At his farm.\n\nThe children all attended school.\n\nWe could not afford the family's needs so we moved to Edmonton and\n\nlived there for about 15 months until we finally moved to\n\nLethbridge, Alberta. We farmed there for 3 years.\n\nWhen we came back to Edmonton, we bought a house and started farming again.\n\nThe Homestead Act was very helpful.\n\nWe homesteaded on a small plot of land and had 180 acres.\n\nWhen we left, we took care of the land.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nThey were not too enthusiastic.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nNo party, just me or otherwise.\n\n13. What means of transportation did you use?\n\nAllen Line Steamer, S.S. Dewar, Grand Trunk R.R., C.P. to destination.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.)\n\nBeing nearly thrown off the boat and rail road several times.\n\nMotorcycling, and being both on foot and horseback. Also, having a few particularly hard times acquiring supplies and getting food for the family.\n\nThe train blew up when they were about to cross the river.\n\nArrived all O.K.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nSaltcoats, Assiniboia, N.W.T.\n\nThere was a large immigration hall in Saltcoats, with free accommodation for a second family, also not with many other families who stayed for a while.\n\n16. Where did you settle or take up land?\n\nMy father homesteaded on N.W. 1/4 Sec. 30, T.P. 24, R. 2, W. m.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n1946-1956 Cypress River, Man.\n\nHow did you earn a living before coming to Western Canada? How, after you came?\n\nFather was the only wage earner, at his trade.\n\nThe children all of school age attended school.\n\nThe family was very small, and the mother worked at home and had a garden for the family. At the age of 13, I was hired to work on a farm for 18 months at the family's request.\n\nI was paid $30 per month, and the family gave me $20 toward my expenses.\n\nI then went to work on a farm in Montana, and I was paid $50 per month.\n\nWhen the time came to leave Montana, I was paid $500 for the delivery of the grain. I returned home and started working again.\n\nThe Homestead Act was very helpful, and I was able to purchase land when the time came.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. No Mary our early pioneer days, travelling was done by ox teams and chariots often by Indians now wood buckboards.\n\nWe never ventured far from home. Although we visited our neighbors near and far a common occurrence. After the first few months an settlement dotted all prairies richly, land was scarce and money a scarce commodity families pay both money and labor to improve their land.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nNo Mary can early turnen leave, ox team and chariot after by Emilian how wind buckboard.\nPage 23\n\nIn 1890, a new school was opened in the town of Newburyport. The school was built by the citizens of the town and was dedicated to the memory of Mr. and Mrs. Smith, who had recently passed away.\n\nThe school was located on the corner of Main Street and Church Street. It was a two-story building with a large auditorium on the second floor. The school was attended by students from all over the town and was considered to be one of the best schools in the state.\n\nThe school was closed in 1950 due to declining enrollment. The building was sold to a private developer who converted it into an apartment complex. Today, the building stands as a reminder of the rich history of the town of Newburyport.\nPage 1, Document 23.\n\nThe year 1890 was a most memorable one. Firstly, the organization of the school district and opening of the school, then the arriving of the Gordon family, Mr. F.B. Gordon who arrived in 1885, followed by Mr. W.M. Gordon, who came three years later. These Gordon family moved into the old, red-roofed house, which may have been built by Mr. Gordon himself, now converted into the schoolhouse, into a real community center. The Gordon family became the heart and soul of the town, providing a sense of belonging and community spirit.\n\nThe schoolhouse was a small, one-room building, with a large porch in front. It was built by Mr. Gordon himself, using local materials such as pine and cedar. The walls were made of logs, and the roof was covered with shingles. The schoolhouse was a simple structure, but it served its purpose well.\n\nThe following winter, 1890-91, we had a big public program at the schoolhouse, which lasted two hours and included a band concert, a speech by Mr. Gordon, and a musical performance by the school children. It was a memorable event, and it marked the beginning of a new era for the town.\n\nThe schoolhouse continued to serve the community until 1910, when it was replaced by a larger building. Today, it stands as a reminder of the past, a symbol of the hard work and dedication of those who built it.\nPay (2)\n\nAt Question and 23.\n\nFor Indiana-1816 furnaces. Which began finally from the first action. After the Arnold furnaces, both mines, was held at Auction Jan. 15. March 1816 by Mr. J. Alexander, Mutual Improvement Society. This two-yearly meeting in the vicinity of 1789-90 The meeting held in the public building, Philadelphia, 12 x 16. Area 1400 sq. ft.\n\nOnce annual, the General Assembly (Assembly of Delaware) received many books from England through the Quaker family.\n\nAnd soon had a new library which was called by the name of our Mutual Society, then the idea naturally came into existence.\n\nAs the days went on, the library grew. Most of Harroldton received freely.\n\nKingsley from the \"Old Family\" Ken family received the library willingly.\n\nIn different times, the library was named in honor of Mr. John Harroldton.\n\nThe Library Association, Mutual Improvement Society of the famous\n\nDickson Thackery, etc., etc. Afterwards also called by another\n\nPatriot maker Mr. Brown. The first Church services also conducted on our premises by Mr. P. B. Brown, etc., etc., Patriotic Improvement\n\nDistrict in charge of the Indiana Mission as First City, as we knew the\n\nonly Patriotic family in the district. We knew it only by reputation.\n\nWe also promised to do everything for the church, but only\n\nextended from Billy Ruth to William Ruth to Billy's son\n\nthe Armstrongs, etc., and Ruth to Ruth's son, Ruth's son,\n\nthe Armstrongs, etc., and Ruth to Ruth's son, Ruth's son,\n\nall this territory he was well known to all the settlers, especially\nPage (2)\n\nThe question was 23.\n\nFor the purpose of purchasing the old organ finally found at the\nmeeting house. The funds raised by the sale of the organ, was used to\nfinance the purchase of a new organ for the Agamemnon\nSociety. Plans were made to hold a meeting in the Agamemnon\nSociety Hall on December 1st, 1890. The meeting\nwas held in the Miller-Beckley Building, 12 x 16. About 1000 people\nwere present. The general atmosphere was very\nfriendly. There were speeches, songs, recitations, etc. All who\nattended enjoyed themselves. Through the kindness of\nthe Board of Directors, the hall was filled by the Harmony\nSociety. The hall was decorated with flowers and\nbanners. The hall was filled with music and song. The\nmeeting was very successful. The Board of Directors\nwere very pleased with the outcome of the meeting.\n\nThe question was 23.\n\nFor the purpose of purchasing the old organ finally found at the\nmeeting house. The funds raised by the sale of the organ, was used to\nfinance the purchase of a new organ for the Agamemnon\nSociety. Plans were made to hold a meeting in the Agamemnon\nSociety Hall on December 1st, 1890. The meeting\nwas held in the Miller-Beckley Building, 12 x 16. About 1000 people\nwere present. The general atmosphere was very\nfriendly. There were speeches, songs, recitations, etc. All who\nattended enjoyed themselves. Through the kindness of\nthe Board of Directors, the hall was filled by the Harmony\nSociety. The hall was decorated with flowers and\nbanners. The hall was filled with music and song. The\nmeeting was very successful. The Board of Directors\nwere very pleased with the outcome of the meeting.\nWas home to the Brookside Little League baseball team.\n\nAnd so on. But what was going on at a foot ball team?\n\nWhich took in several other districts. Was also able to organize a basketball league\n\nfor the town. Took off Saturday afternoon. Monday of the following week, matches were played.\n\nTo attend the matches, we had to travel\n\na bit. We knew someone who lived nearby, but as soon\n\nas possible, we went back out.\n\n\"And finally, thanks to the power plant,\n\nwe could get the impression of a city.\n\nAs Warren Train chanted deeper into\n\nthe heart of the hardworking community. And now, I would go\n\nwith Robert. \"Love keeps my memory green.\"\n\nFrom your mother's dear old maple of old and new schools\n\nalso of the grand old home to downtown. You must of course\n\nnot forget to send wishes. Also send my regards,\n\nJohn. Remember, always keep your feet on the ground.\n\nYours faithfully,\n\n[Signature]\nDear [Name],\n\nI am writing to you from [Location]. We have been enjoying our time here and having a wonderful time. The weather has been fantastic and we have been able to explore many new places.\n\nWe have also been able to meet some interesting people and have made some new friends. It has been a great experience and we are grateful for the opportunity to be here.\n\nWe hope to see you soon and look forward to hearing about your adventures.\n\nBest regards,\n\n[Your Name]\nFirst of Peter's sons of Windawood S.D.1775. Peter's son\n\nNext was Thomas who went to Georgia in 1786.\n\nThen came William in 1788.\n\nPeter married Sarah Ann in Carolina.\n\nJames, Matthew, and John married Hannah Farmer.\n\nJohn married Sarah in 1889.\n\nHe had 2 children, Belinda and Robert.\n\nThey had 3 children, Mary, John, and Robert.\n\nJ. McLean - Son of Robert, born in 1889.\n\nJ. Murray, born in 1889.\n\nG. Gordon, born in 1889.\n\nJohn and Robert moved to Georgia.\n\nMembers of the Windawood family came in 1886 and still own land on the old homestead. The last of the original family.\n\nThey are John, James, and Robert.\n\nJohn, James, and Robert are the only original members of the family.\n\nS. Edmiston\nFor Peter Brown of Windermere, P.D., 175\n\nPoveshell Road\n\nAccumulations etc.\n\nMrs. E. R. Gardner, 1886, Lovelock, Clark, Boyd of Oklahoma, Sylvan\n\nOld Milly, 1888, Sheldon Civil Service, Centennial Grass Seed\n\nOld Windermere Married Children Farmer Sullivan\n\nJames Matthew, 1889, Home Macon, Mississippi, Pettus\n\nJ. H. Edwards, 1889, German, 23 Years, Married 7 Family, Stanton\n\nH. E. 1889, Army, Children & Children, Bellart, Hilliard\n\nJohnson, Palmer, Married 2 January, Drexel, England\n\nMrs. Gardner, 1898, Aidar Smith, 902, Geoddy, Texas, Family\n\nG. M. Smith, 1891, Born Gibson, Family, Allerton, Illinois\n\nJ. M. Leavenworth, 1899, A. W. Smith, Isle of Pines, Louisiana\n\nJ. Murray, 1899, McGrath, Arkansas, England\n\nG. Caldon, Nice Man and Child, Ireland\n\nJohn and Edith, Kentucky, Kentucky, Kentucky, Kentucky\n\nThere many The Reverend Mr. Murray was known by the first name Charles\n\nso many of them from the old land and other places in\n\nMembers of the Windermere family since 1888 are still living\n\non the old homestead on the old titles of the original family\n\nThey are John, James, and Elizabeth\n\nJohn, Anna, and Sally, the only surviving children\n\nWriting to TV about my heritage\n\nSincerely,\n\nC. Johnson\nNames of first teachers of Madras Hall\nS.O. 175, Cumberland North West Territory\n\nMrs. F. A. C. Robinson English\nCambridge University Graduated\nScholarship Scholar\n\nMargaret Woodwood, Misses\n\nPeter Woodwood\n\nAgnes Woodwood Living\n\nLorman, Robertson Married\n\nMauda, Robertson Married\n\nFrederick Fin\n\nHenry Fin\n\nEmma Fin\n\nKatherine, Mather\n\nPovesh Murray\n\nAgnes Murray\n\nThen names of children of the school.\n\nC. Robertson.\nNames of first teachers of Meadmoor\n\nS.D. 175. Pennsylvania North West Territory\n\nProf. F. A. C. Robinson, English\n\nCambridge University Graduates\n\nMargaret Underwood, Missouri\n\nPeter Underwood, Indiana\n\nAgnes Underwood, Indiana\n\nLorman, Tennessee\n\nHoward, Tennessee, deceased\n\nFrederick Fin, Tennessee\n\nHenry Fin, Tennessee\n\nEmma Fin, Howard\n\nCatherine, Tennessee\n\nPovis Murray, Tennessee\n\nAgnes Murray, Tennessee\n\nTwo names in planning of the school.\n\nC. H. Hamilton.\n25. When was the first car used in the community? \n26. If you owned a car before 1914, when did you buy it? When made? Where?\n27. Where was your trading center? How far from your home? How many families? How many houses? How many people?\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n29. How often did you shop in the early days? \n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When did you come to Saskatchewan? Or did you make up your mind after trying it out? When did you make his decision?\n\n34. How many families and how many people lived in your community?\n24. Did any people move away from your district prior to 1914? If so, why did they leave?\n\nYes, many people moved away due to the Great Depression.\n\n25. Did many people move away during the 1930s? If so, why did they leave?\n\nYes, many people moved away due to the Great Depression.\n\n26. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI served as a town council member from 1980 to 1985.\n\n27. If you or any of your family or friends were \"first\" to have or do something in the district, mention it here, giving dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\nMy great-grandfather was the first to own an automobile in our town.\n\n28. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person originating place-name, (2) origin and meaning of the name, (3) date of its adoption, (4) any changes in names since the first name was given, date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nThe town was named after the founder, Mr. Robert Smith. The land was purchased by Mr. Smith in 1890.\n\n29. What is the history of your town? Include when it was founded, who founded it, what it was called before it was called [current name], and any important events that have occurred in the town.\n\nOur town was founded in 1890 by Mr. Robert Smith. It was originally called Smithville, but was later renamed Smithtown.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nWould you or the person who owns them either lend them to us, or be willing to lend them to the Provincial Archivist for copying?\n\n(1) be willing to lend them to the Archives Division of the Legislative Library, Regina,\n\n(2) be willing to present them to the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n1. ____________________________\n2. ____________________________\n3. ____________________________\n4. ____________________________\n5. ____________________________\n6. ____________________________\n\nWhat do you think are the most important changes in your community since you first came West?\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe.)\n\nYes, I have a diary from March 1890 - 1907. Would you be willing to lend them to the Provincial Archivist for copying?\n\n(1) Yes, I would like to lend them to the Provincial Archivist.\n\n(2) No, I am not willing to lend them to the Provincial Archivist.\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\n1. John Smith, miner, living in Smithville, Ontario.\n2. Jane Doe, homemaker, living in Toronto, Ontario.\n3. Robert Johnson, farmer, living in Calgary, Alberta.\n4. Emily Brown, teacher, living in Edmonton, Alberta.\n5. Michael Wilson, businessman, living in Vancouver, British Columbia.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1889_487.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 7270, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1487, 3], [1487, 2740, 4], [2740, 4192, 5], [4192, 5816, 6], [5816, 7719, 7], [7719, 9725, 8], [9725, 10789, 9], [10789, 11549, 10], [11549, 12258, 11], [12258, 13614, 12], [13614, 15162, 13], [15162, 16803, 14], [16803, 17699, 15], [17699, 18171, 16], [18171, 18871, 17], [18871, 20084, 18], [20084, 20505, 19], [20505, 20975, 20], [20975, 20975, 21], [20975, 21988, 22], [21988, 23613, 23], [23613, 23613, 24], [23613, 24632, 25], [24632, 25856, 26], [25856, 26011, 27], [26011, 26166, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]