[{"id": "80d3082bdb0962bd9ccb751f53895b60be7b0c2c", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNo. 5\n\nPIONEER RECREATION AND SOCIAL LIFE.\n\nNEIGHBORLY VISITING, PARTYING, ETC.\n\n1. In the first few years how many homes were near enough to you for visiting back and forth? One / Two / Three / Four / Five / Six / Seven / Eight / Nine.\n\nHow many of these were bachelor's homes? How many were almost deserted?\n\n2. How often did you usually visit neighbors? Usually / Occasionally / Rarely / Never.\n\n3. Did you usually visit on a Sunday, or other days? Usually / Occasionally / Rarely / Never.\n\n4. Were you often invited to other homes? Usually / Occasionally / Rarely / Never.\n\nInvitations? Yes / No.\n\nWhat about meals? Did you stay when not invited beforehand? Yes / No.\n\nDid you ever have \"tea\" in the morning and spend the day or in the afternoon? Yes / No.\n\nHow was the invitation to a meal worded when people had something prepared? (That is, was the term to \"make pot luck\" used, or was something more common?)\n\nIf normal, what other refreshments might be offered to visitors who had dropped in? (Don't forget any flour without milk or sugar.)\n\n5. Did the whole family go or did someone stay home to \"look after the place\"?\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity?\n\nTell what the \"bees\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Sometimes / Occasionally / Rarely / Never.\n\nMore those more frequent in later years? Sometimes / Occasionally / Rarely / Never.\n\nDid you follow any kind of informal schedule, such as going by turns from one home to another at definite times; every two weeks, once a month, once a year?\n\nYours a little month, etc.?\ndances were wonderful social gatherings while the young folks danced the mother and \"grammies\" and visited and watched the dances. There old names have had such big rooms there was always room in our corner for the children to play cards in and an occasional older man to play cards in and an occasional about if you wanted some from china when a child looked made if \"they never played when they played \"high five\" or \"fling fadros\". When they danced \"Old Dan Tucker\" I always had to call my father from the card room so he liked to watch it too. It took him in memory back to his boyhood days. If the dancing never provided all the lunch or there was always a brownie people came from 12 and 15 miles away. Each family brought cake cookies or sandwiches and these lunches were good. We children were not used to having all the good things we could eat, however remember having about any sugar they had at those dances. They were respectful and friendly toward just to gather. Around about 1906 one man had a birthday get-together. And was drunk and it made us feel scared.\n\nThe crackers were mostly named after places from Ontario. Some of their names were Malton, Etobicoke, Mississauga, Markham, Whitby and Richmond. A man who was quite an old man and still remembered what the crackers were like. My wife was also Bertie's friend and she really liked them.\nDances were wonderful social gatherings. While the young folks danced, the mothers and \"grannies\" sat and visited and watched the dance. These old ranch houses had such big rooms; there was always room in one corner for the children to play. There was always a room for the older men to play cards in and an occasional shout of glee would come from them when a high bidder \"made it.\" They never played whist; they played \"high five\" or \"king pedro.\" When they danced \"Old Dan Tucker\" I always had to call my father from the card room as he liked to watch it as it took him in memory back to his boyhood days. The hostess never provided all the lunch as there was always a big crowd people came from 12 and 15 miles away. Each family brought cake, cookies or sandwiches and these lunches were grand. We children were not used to having all the good things we could eat. I never remember hearing about any liquor being at these dances. They were respectable and friendly social get-togethers. Around about 1906 one man had whisky at a dance and was drunk and it made a big scandal. These ranches were mostly Scotch Canadians from Ontario. Some of their names were Maclean, Smyth, Youngs, McGinley, Websters, Duff and Andersons. A Miss Duff was quite an old maid and I still remember what a wonderful dancer she was. My father was also Scotch descent and he really liked these people.\ndances were wonderful social gatherings while the young folks danced the night away and \"grammies\" and grandpas visited and watched the dance. There was always room in one corner for the children to play cards in and an occasional chair where a child could make it. They never played what they called \"high five\" or \"ring leaders.\" When they danced \"Old Dan Tucker\" I always had to call my father from the card room so he liked to watch it too. It took time in memory back to the days when we always had around people come from 12 and 15 miles away. Each family brought cake, cookies or sandwiches and there were always games. We children were not allowed to have any bigger things than candy. They were respectful and friendly at these get-togethers. Around about 1906 one man had a band, and it made a big scandal. These bands were mostly from Ontario. Some of their names were Maloney's, Duff's and Duff's. A man named Mr. Murphy's Waltons, Duffy's and Duff's still remember what a wonderful time we spent at these parties. My father was also Bert's closest friend and he really liked them parties.\ndances were wonderful social gatherings where the young folks danced the marches and \"grammies\" and visited and watched the dance. The old named house had much big rooms there was always room in one corner for the children to play. There was always a room for the older men to play cards in and an occasional about \"if you would come from there within a high bridge made it.\" They never played which they played \"high five\" or \"ring leader\" when they danced.\n\n\"Old Dan Tucker\" always had a call my father from the card room so he liked to watch it on it took him in the morning back to his neighborhood days. The dancing music provided all the lunch as there was always a big crowd people came from 12 and 15 miles away. Each family brought cake cookies or sandwiches and there dinner was served. We children were very well behaved during all the things we attended. I remember hearing about many things being got-together. Carolyn always had a man hall which they sat a dance and were drunk and it made a big mess.\n\nThere were mostly aced Canadians from Ontario. Some of their names were Maloney, Smith, Johnson, McGee, Walberton, Duffy and Anderson. A man who was unrecognizable was also Bertie's dancing partner. He rarely asked them to join.\n8. Tell what was made of the school house for community dances, box socials, etc., and other activities. From the date of the school, Christmas trees, plantings, etc.\n\n9. How much of your social life was centered around the school, and within the school district? Describe all of our activities here and how they were organized, etc.\n\n10. When was your first community hall built? What material was it made of? How large was it? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall?\n\n11. What card games were popular in the early days? Was there card playing for a prize? What dances were popular? Was there ever any disagreement between dancing and non-dancing residents in the community? Explain. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain. Did you ever hear of the dance, \"against card playing and both ends and gaming\" used during the early days before liquor became common in the community?\n\n12. What were the activities approved by parents during the early years?\n8. Tell what use was made of the school house for community dances, box socials, and other activities. (Include also the school Christian trinity plantation, etc.)\n\n9. When was your first community hall built? How large was it? What material was it made of? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall? To what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you still continue to use the local school house for district gatherings, and did you have a hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\n10. When parties, dances, etc., were held in houses, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were they kept warm? How were horses sheltered and fed in the winter time at these parties? How were they used for transportation?\n\n11. What card games were popular in the early days? Was there card playing for a prize? What games were popular? What was the attitude toward card playing by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n12. Were there any gambling games played? If so, explain.\nalways ended with a dance but they simply sat and looked on for a while but did not join it. They did not try to make trouble.\nalways ended with a dance but they simply sat and looked on for a while but did not join it. They did not try to make trouble.\n12. What attempts at formalizing or \"swelling\" do you remember in small towns such as those mentioned? Visitors treated separately and not as individuals.\n\n13. Was the situation known in your community?\n\nDescribe what you remember about olivette selling how common they were, any incidents connected with them, etc.\n\n14. How did the situation change over time?\n\nWas there a new leader or a new group of people who came in and took charge?\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nGive the date and reason for its being organized.\n\n16. Was there a Saskatchewan Grain Growers local in your community?\n\nTell when it was organized, and what steps led to its organization.\n\nGive the date and reason for its being organized.\n\n17. Was there a Homemakers' Club in your district?\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n\nDescribe what you remember of its activities and services.\nORGANIZATION AND VESTING.\n\n15. What was the name of the first organization of any kind that you can remember being established in your community? \n\n16. Was there a Shoshone County Grange Local in your community? If so, how many members did it have?\n\n17. Was there a Homemakers' Club in your district? How many members did it have?\n\n18. Approximately how many women belonged to it?\n\n19. Describe what you remember about its activities and services.\n\n20. How many women do you know who belong to it?\n\n21. What was the name of the first organization of any kind that you can remember being established in your community?\n18. Name any churches or organizations that were in existence at your time. Mention their names, locations, and purposes.\n\n19. What were the organizations that held their meetings?\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe them.\n\n21. What games did boys play in summer? (e.g., marbles, ball, kites, etc.)\n\n22. What games did girls play in summer? (e.g., skipping rope, play house, etc.)\n18. Name any clubs or organizations that were in existence in your community before 1920.\n\n19. Where did various organizations hold their meetings?\n\n20. Were you accustomed to having general information lectures, talks on Fore-fore-\n\nlands, etc., to illustrate government? Great military or teachers' special lectures,\n\ndescribes, etc.? If so, who gave them? How many attended, and any\n\nother details you remember about them.\n\nDid you often have magic lantern shows?\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (e.g., skipping rope, ball, marbles, fly kites,\n\netc.)? Anti-war and full\n\nWhat games did girls play in summer (e.g., skipping rope, play house, etc.)?\n\nThe girls played the same as there were\n\nnot enough of each to play separately.\n22. What winter games were played outdoors? Fox and hounds, skating, etc.? \n\nWhat games were played indoors in winter—card games such as \"Happy Families,\" \"Whist,\" or other card games? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everybody usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, birch bark, gophers, or other objects or animals, or games in the snow? Describe.\n\n**PHONICS AND SPORTS**\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it? \n\nDistrict School Board\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or organization? \n\nFor the entire community\n\n28. Was it the first picnic held in the community? No\n\nIf not, do you know the date of the first one that had been held?\n\n29. What amusements at the picnic you attended (ball games, races, band, etc.)? \n\n\"Amusements included games such as 'Happy Families' and 'Whist.'\"\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups? \n\nFamilies and friends formed smaller groups.\n\n31. What did you have to eat and drink? We had every kind of good baking—cakes, sandwiches, tent—pan—sandwiches, and tea to finish.\n\n32. What time of the day did it start, and how long did it last? \n\nStarted in the afternoon and lasted until late in the afternoon. My children have never seen such a good picnic.\n22. What outdoor games were played outside? Fox and hounds, baseball, etc.\n\n23. Was there much time for games, or was everyone unusually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, bones, gophers, or other objects or animals, or games in the story books?\n\n25. What was the date of the first platoon that you attended in Saskatchewan?\n\n26. The organization met at the schoolhouse in the fall of 1908.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, or neighborhood?\n\n28. Was the first platoon held in the community? Yes.\n\n29. What were the amusements at the platoon? We had all kinds of races, band, etc.\n\n30. What arrangements were made for eating? We had a general lunch, or did we have separate meals?\n\n31. What did you have to eat and drink? We had every kind of good cake, tea, and sandwiches.\n\n32. What time of the day did it start, and how long did it last? It started in the afternoon and lasted until evening.\n6. Describe any features of this picnic which you remember as outstanding.\n\n33. Please list any other activities which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnic, family picnic, etc., when held, etc.\n\n35. What changes have been noticeable in picnics since the first year? If possible, give dates when changes became noticeable.\n\n36. How do you feel about the change from the old-fashioned outdoor picnics to the present-day indoor picnics?\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year?\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and all something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). When was the first indoor rink built, and what was it used for?\n32. Describe any features of this picnic which you remember as outstanding.\n\n33. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.). How is it now? The year?\n\n34. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centers, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates of some of these changes.\n\n36. Give sketches of any of the early picnics.\n\n37. For what game was the first team organized in your community? To play against neighboring teams?\n\n38. How long did it continue?\n\n39. Tell when the first indoor rink was built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? Did it grow out of or replace the earlier community picnic? Who was responsible for starting the first sports day?\n\nWhen was the sports day usually held (best month, or any special day such as May 24th or July 4th)?\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the titles and authors if possible. If not, tell as nearly as you can how many books you brought and what kind.) (Give extra answers if necessary.)\n\n\"The Life of Benjamin Franklin,\" \"Women of the West,\" \"The Story of the American Revolution,\" \"Pioneers of the West,\" \"The Story of the Oregon Trail,\" \"The Story of the Santa Fe Trail,\" \"The Story of the California Gold Rush,\" \"The Story of the Mexican War,\" \"The Story of the Civil War,\" \"The Story of the Spanish-American War,\" \"The Story of the World War.\"\n\n43. How many of your neighbors brought books with them? Just very many.\n\n44. To what extent did you exchange books with neighbors? For a great extent.\n\n45. Did you buy many books after you came west? Give details.\n\nMy, there was no money to buy books at first, so I couldn't buy anything. We got by without them. We all tried to read for pleasure.\n\n46. Have you ever had any \"traveling library\" books in your community or school?\n\nGive details and names.\n\nWe used Poplar Grove School coupons and got books also get some for getting subscriptions.\n\n47. Was there a school library? Yes.\n\nWhen was it begun? Soon after the school was built.\n\n48. Did parents ever use their children's school text books as additional reading material? Yes.\n\nDid you learn English + she read the whole library + all most of the way by me.\n43. When did an annual \"sports day\" become established in your community? It grew out of or replaced the earlier community picnic.\n\n44. Who was responsible for starting the first sports day?\n\n45. How was the sports day usually held (last month, or any special day, such as May 26th or July 1st)?\n\n46. Are there any from your community who have become members of well-known hockey, ball, or other teams? Give names, and dates.\n\nREADING\n\n47. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n48. What books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n49. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n50. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n51. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n52. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n53. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n54. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n55. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n56. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n57. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n58. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n59. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n60. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n61. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n62. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n63. What kind of books did you bring with you when you came west? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n64. To what extent did you exchange books with neighbors? (Give a list of the names and authors, if possible.) If not, tell us how many books you brought.\n\n65. Did you buy many books after you came west? (Give details.)\n\n66. Did you buy many books after you came west? (Give details.)\n\n67. Have you ever had any travelling library books in your community or school? (Give details and dates.)\n\n68. Was there a school library? (Give details.)\n\n69. Did parents ever use their children's school books as additional reading material? (Give details.)\n\n70. Did you learn English + she read the whole library all morning of the meeting.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? Who started it?\n\nIs it still in existence? Yes\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to this area? New York Times, National Weekly Monthly, Family Weekly, Star News, National Weekly Monthly, and local town paper. You ten children and the Northern Missouri religious children paper.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others. We still get Weekly Paper, Bunn and family Weekly, Star News, National Weekly Monthly, and local town paper. We also get the Mullins Advance weekly papers and the Mullins Advance monthly papers.\n\n53. Did you ever obtain the free monthly Lady Aberdeen magazines of reading to women? Yes, we wanted them to help us.\n\nGive dates and tell how and where you got them.\n\n54. That books or papers that you brought to the west, with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. How do you feel hardy to many who loved reading and will remember any of the above monthlies, books and gifts or premiums.\n50. Has there ever been a community library in your district, or town? If so, when was it started? Who started it?\n\nGive any other details which you can about the library—how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to press the west? How long did you continue to subscribe?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain ones and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? If so, how often and how much did they cost?\n\n54. Give dates and tell how and where you got them.\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. How do you feel now about the many who loved reading and still remember the wonderful books and gifts in premiums.\nMusical Entertainment\n\n56. What musical instruments did you bring with you?\n\n57. What musical instruments did any of your neighbors have? How did they acquire them?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainments in early years in the west? Describe.\n\n60. Was there an organ or piano in your home when church services were held in the homes?\n\nIn the community? Were there musical concerts, parties, etc.? Describe.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? Who started it? How many were in it? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\nMusical Entertainment\n\n56. What musical instruments did you bring along with you?\n\n57. What instruments did any of your neighbors bring? (List them.)\n\n58. What musical instruments have you bought since then? (List them.)\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years? Describe.\n\n60. What was the favorite song in the house? Who sang it?\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune such as \"Jingle Bells\"? Or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so:\n\n   - When was it started?\n   - How long did it continue?\n   - How many were in it?\n   - Who was bandmaster?\n   - What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music an important part of your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, autographs, etc.? If so, explain.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nI have tried to do my best with these questions into but fear that they may fall far short.\nGENERAL\n\nDescribe any outstanding features or incidents of social life, games, entertainments, reports, reading, music of pioneer days not already mentioned.\n\n(Use back of page, or extra sheets if necessary.)\n\nI have tried to do my best until these questions mind but fear that I have fallen far short.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12970_1902_1967.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 34, "total-input-tokens": 56440, "total-output-tokens": 7793, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1777, 7], [1777, 1777, 8], [1777, 3139, 9], [3139, 4521, 10], [4521, 5623, 11], [5623, 6869, 12], [6869, 8078, 13], [8078, 9557, 14], [9557, 9684, 15], [9684, 9811, 16], [9811, 10855, 17], [10855, 11473, 18], [11473, 11929, 19], [11929, 12758, 20], [12758, 14356, 21], [14356, 15400, 22], [15400, 16563, 23], [16563, 17423, 24], [17423, 19253, 25], [19253, 23090, 26], [23090, 24564, 27], [24564, 25547, 28], [25547, 26670, 29], [26670, 27677, 30], [27677, 28712, 31], [28712, 29015, 32], [29015, 29167, 33], [29167, 29318, 34]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, true, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]