[{"id": "91038be5e678d116544a8bbc4e674c991ab46bc8", "text": "PIONEER EXPERIENCES! A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n1. Your full name ............................................................ Helen Harold Latch\n2. Your address ............................................................... R.R. #2, Willow, N.W.T.\n3. Date ................................................................. 16.04.1956\n4. Where were you born? (Give name of place and country) Humboldt Rural County, Fifth Settlement, Saskatchewan\n5. What was your father's name and occupation? David Scott Robertson\n6. When did you come to Saskatchewan? (Give month and year) 1905\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Patterson Man 1903-1905\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n9. What were your reasons for coming West? You offer of 160 acres\n10. How did you learn about the West? (through other people? Reading about it? Railroad or government information?) Good information\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nFARMERS EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nRULES:\n1. Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. It is quite acceptable to have someone else do the writing at your dictation.\n\n2. Your full name ...............................................................\n3. Date ...............................................................\n4. Where were you born? (Give name of place and country) ...............................................................\n5. What was your father's name and occupation? ...............................................................\n6. When did you come to Saskatchewan? (Give month and year) ...............................................................\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. ...............................................................\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you are under 18 years of age.)\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Radio? Government information?)\n\nSignature: ___________________________ Date: ________________\n11. What did your friends and relatives think of your decision to come to Western Canada?  \n   Not very much.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?  \n   Family\n\n13. What means of transportation did you use?  \n   Allan first across the water.\n\n14. What incidents of the journey went do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).  \n   Staying in the Dormagration Hall Winnipeg\n\n15. Where did you first stay when you arrived in Saskatchewan?  \n   Sylvan Beach\n\n16. Where did you settle or take up land?  \n   18-9-5-14 W4\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada?  \n   After you came? Guard in Petichhead Prison, Scotland.\n11. What did your friends and relatives think of your decision to come to Western Canada?  \n   Not very much.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?  \n   Family group.\n\n13. What means of transportation did you use?  \n   Allen farm across the water.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).  \n   Staying in the Immigration Hall Winnipeg.\n\n15. Where did you first stay when you arrived in Saskatchewan?  \n   Lydia Park.\n\n16. Where did you settle or take up land?  \n   19-25-1N W4.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.  \n\n18. How did you earn a living before coming to Western Canada?  \n   How after you came?  \n   Field farm guard in Blackhead River, Westland.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, what was their name?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Going for the mail to town for supplies.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\n25. Going from the mail to town for supplies.\n25. When was the first car used in the community? (1912)\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? When you had too\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? (1960)\n\n33. When did you come to Saskatchewan the first time? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen they left Scotland\n25. When was the first car used in the community? (About)\n\n26. If you owned a car before 1914, then did you buy it? What makes?\n\n27. Where was your trading center? How far from your home? (About 90 miles)\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\n29. How often did you shop in the early days? When you had too.\n\n30. When did people in your district first start going to town regularly on Saturdays?\n\n31. When did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion purchased by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it? (1960)\n\n33. When did you come to Saskatchewan the first time? Was it with the idea of starting permanent? Or did you make up your mind after trying it out? When did you make this decision?\n\nWhen they left Scotland\n35. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nYes. Could it make a living?\n\n36. If you or any member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nValley became Gridlock in 1913. Held it for about 27 years.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district mention it here giving dates whenever possible. (Such as owning the first automobile, combining organizing the first school, etc.)\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person suggesting place-name; (2) date of its adoption; (3) date of its adoption; (4) any change in name since the first name was given; data and reason for change. Give facts of new name as above in (1), (2), (3).\n\nPost Office was named after Enid Cobb by George Henry (Farmer) Millwood. School was named by Henry Reed after his home in England (1911). Hasn't been changed.\n35. Did any people move away during the 1930s? Did any return?\n\nNo.\n\n36. If yes or any member of your family have held public office, or have been active in any organization, mention it here, giving dates whenever possible.\n\nWally became Emid Postmaster in 1913 held it for about 27 years.\n\n37. If you or any of your family or friends were active in any organizations, mention them here, giving dates whenever possible.\n\n(Such as raising the first automobile, organizing the River Rodeo, etc.)\n\n38. How did the places in your community get their names? (School district, post office, village, railway stations, creeks, hills, etc.) Try each place name and occupation of person suggesting it. Place name (1) name and occupation of person suggesting it; (2) date of its adoption; (3) any changes made since then; (4) new name and above in (1), (2), (3).\n\nPost Office was named after Emid Miller by Emma May Henry Read after his home in England (1911) Heavitree changed.\n6.\n\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old personal papers, old photographs, written recollections and reminiscences? (Describe)\n\nThe \"Old Touchwood Trail\" can be seen by the east of us. (Prince Albert Trail)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nModernization of farm methods & travel\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nCharlie Babbutt, Enid, P.O. Bank\nJim McQuaid, Mr. Donald Mills, Bank\nLawrence Backwell, Loyalist, Bank\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nDaughter: Mrs. F. James\nP. R. Veitch, Bank\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old personal photographs, minute books of community organizations, old newspapers, old photographs, written records, collections and records? (Describe)\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\nIf you have children or grandchildren, please give their names, where they live.\n\nModernization of farm methods & travel\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nCharlie Rockwell, Enid, P.O. Sark\nJim Ferguson, McDonald Mills, Sark\nLawrence Backwell, Loyalist, Sark\n\nIf anyone else has filled in this questionnaire for you, please have this person give name and address here!\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1905S-Z_878.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 3497, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 0, 6], [0, 1292, 7], [1292, 2650, 8], [2650, 3503, 9], [3503, 4381, 10], [4381, 5103, 11], [5103, 5811, 12], [5811, 6810, 13], [6810, 7845, 14], [7845, 8981, 15], [8981, 9949, 16], [9949, 11119, 17], [11119, 12100, 18], [12100, 12255, 19], [12255, 12406, 20]], "primary_language": ["None", "None", "en", "en", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]