[{"id": "7d13c1b2c9f8cd1fee5af23977e49daf645b22c5", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Graburn)\n\nPlease print name and address in capital letters.\n\nYour full name CATHARINE M. DOYLE.\nPresent Address LEROY, SASK.\nPioneer address MIENSTER\nYear you came to Saskatchewan 1906\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? (dozen or more.)\n\nHow many of these were bachelor's homes? Four.\n\n2. How often did you usually visit neighbors? (to see different neighbors about once a week.)\n\n3. Did you usually visit on a Sunday, or other days? (other days except when invited on Sunday because our home was filled with work.)\n\n4. Were you often invited to other homes, or was most visiting done by going out on sunday invitation? (went without invitations but was often invited on a certain day.)\n\nWhat time of the day did you go, in the morning and spend the day, or in the afternoon, etc.? (if invited usually for dinner if invited usually in the afternoon.)\n\nWhat about meals? Did you stay when not invited beforehand? Sometimes but usually had to go home for lunch and get supper.\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term to \"take potluck\" used, or was some other expression common?) Always was invited to stay and usually the expression was share what we have with us.\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? Sometimes tea & bread, butter and fruit or sometimes sandwiches or tea & cake.\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? Some times the whole family went, usually only two if it was just a neighborly afternoon call.\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? Once in a while.\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred.\n\nThe men had been to cut logs and put up our first log church. The Ladies used to have a bee once in a while to make a quilt or to clean & scrub church.\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. There were house parties, but the small houses they would clear one room of all furniture and dance always for local music. There were card parties, banded forty-fives, ladies & gents.\n\nWere these more frequent in later years? Give dates.\n\nNo, those were in the early years up to about 1909.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, - every two weeks, once a week, once a month, etc.? No, for visiting we went when we could and for parties they were at the homes that could accommodate and entertain them. Sometimes the lady of the house had a lot of extra work.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 5\nFlower Recreation and Social Life.\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth?\n\n2. How often did you usually visit neighbors? To what extent?\n\n3. Did you usually visit on a Sunday, or other days?\n\n4. Were you often invited to other homes, or was most visiting done by invitation without an actual date set?\n\nWhat about meals? Did you stay when not invited beforehand?\n\nHow was the invitation to a meal worded when people had done unexpected things (that is, was the term \"to make polite\" used, or was some other expression)?\n\nIf no meal, what other treatment might be offered to visitors who had dropped in?\n\n5. Did the whole family go, or did someone stay home to close after the place?\n\n6. Did you ever have \"tea parties\"? Usually attended by whom? Described.\n\nTell what you remember about such gatherings, stating dates if possible, telling what the \"host\" were for, and how often they occurred.\n\n7. In the earliest years that you were here, were there many parties, whilst drives or dances in homes? Describe.\n\nWere these more frequent in later years? Give dates.\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times—every two weeks, once a week, once a month, etc., etc.?\n\nand for parties they were at the homes that could accommodate and entertain them. Some time the lady of the house had a lot of extra work.\n8. Tell what use was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, picnics, etc., if you have not described these on the School Questionnaire). Give dates.\n\nHow much of your social life was centred around the school, and within the school district? Describe. There were dances a few times a year and sometimes ball games Sunday afternoon when most of the community gathered in summer.\n\n9. When was your first community hall built?\nWhat material was it made of? Lumber How large was it?\nWho built it - the community through special funds, the municipality, some organization, etc.?\n\nWas it built in the village or town, or was it a country hall? Town of LeRoy\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.?)\n\nFor the first year it made little difference to our community only for the LeRoy annual picnic but when cars became numerous. The young folks & some old ones usually attended many parties & etc.\n\n10. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? Sometimes they had to take small children or stay home.\n\nHow were babies and small children provided for?\n\nIf they went to sleep they were laid on a bed or blanket. They stayed awake until they sat up and took notice.\n\nHow were horses sheltered and fed in the winter time at these parties?\n\nSometimes as high as 20 feet and went to party in one building and to have two rooms for dance to open.\n\n11. What card games were popular in the early days?\n\nThirty-five, 14 Pedro & Euchre.\n\nWas there card playing for a prize? Sometimes,\n\nWhat dances were popular? Square dances, Polka's, two steps, French Mignonette & circle two step, waltz & Schottische.\n\nWas there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\nNone whatever.\n\nWas card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\nEveryone played cards or had some other enjoyment and no one complained. Some sang songs & some helped with lunch.\n8. Tell what use was made of the school house for community dances, box socials, etc., and other activities (include also the school Christmas tree, picnic, etc., if you have not classified these in the school questionnaire). Elsewhere.\n\n9. How much of your social life was centered around the school, and within the school district? Describe. How large was it?\n\n10. What was your first community hall built for? Who built it - the community through special funds, the municipality, some organization, etc.? How large was it?\n\n11. Was it built in the village or town, or was it a country hall? How large was it?\n\n12. To what extent did it take the place of church or the school house as a place for social gatherings? For example, if you lived in the country, did the hall serve as a substitute for the local school house for district gatherings and came to be used by the school for all functions, or were you able enough to make use of the hall for all gatherings, etc.?\n\n13. When parties, dances, etc., were held, was there any competition between the school and the hall? If so, describe.\n\n14. Was there card playing for a prize? Sometimes.\n\n15. What dances were popular? Square dances, polka's, two step, etc.\n\n16. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n17. How often?\n\n18. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n19. Everyone played cards or had some other enjoyment and no one complained. So we enjoyed ourselves very much with friends.\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nNo such things in our community.\n\n13. Was the chivaree known in your community? Yes, from our old home. Describe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\nChivarees were seldom carried on in our community because the married couples always gave dances to young folks and dinners to older people.\n\n14. Describe any other details of visiting, parties, etc., that you remember, telling of any games or amusements not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nORGANIZATIONS AND MEETINGS.\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community?\n\nSt. Patrick's Ladies Aid Society\n\nGive the date and reason for it being organized.\n\nTo get funds to build a church & furnishings\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nNearly all the farmers.\n\nHow many women belonged? None. How often did it meet? Twice once a month.\n\nWhat were some of the activities carried on by this organization? They built a grain growers store in Lanigan.\n\n17. Was there a Homemakers' Club in your district? No.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n12. What attempts at formality or \"sophistication\" do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\nNo such things in our community.\n\n13. Was the church known in your community? If so, how was it used?\n\nChurch was used by married couples always. Community center for young people and dinner to other people.\n\n14. Describe any other details of social life.\n\nDetails of any type of amusement not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life become noticeable.\n\nORGANIZATIONS AND MEETINGS\n\n15. What was the name of the first organization of any kind that you can remember being established in your community?\n\nSt. Patrick's Ladies Aid Society.\n\nGive the date and reason for its being organized.\n\nTo get funds to build a church & furnishing.\n\n16. Was there a Saskatchewan Grain Growers' local in your community?\n\nYes.\n\nTell when it was organized, and what steps led to its organization.\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nNearly all the farmers.\n\nHow many women belonged to it?\n\nA month.\n\nThat were some of the activities carried on by this organization?\n\nOther brief a grain growers store in Langley.\n\n17. Has there a Homemakers' Club in your district?\n\nYes.\n\nWhen was it organized?\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? Held they were in different school houses.\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? No\n\nDescribe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? Yes Give dates if possible.\n\nWho provided the lantern and the slides? No one.\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBall mostly.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping rope & play house. All played games like Hide & go seek, Farmer in the Dell, Hop the Handkerchief & such like. Even grown ups, on sunday afternoon, Horse shoe was played by many.\nWhat means were commonly used by organizations for raising money?\n\n19. Where did various organizations hold their meetings? (Specify location)\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? If so, describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nDid you often have magic lantern shows? If so, give dates if possible.\n\nWho provided the lantern and the slides?\n\nWhat were the slides about?\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)?\n\nBall mostly.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)?\n\nSkipping rope & play house. All played games.\n\nThe Handkerchief & such like & even grown-ups.\n\nOn Sunday afternoon, however, also was played by many.\n22. What winter games were played outside - fox and hounds, skating, etc.? What even they could do. Youngsters used to play house-a-lot. What games were played indoors in winter - card games such as \"Happy Families\", \"Authors\" or others, checkers or other games?\n\nCard games & checkers & Ten pin some times. Pool by a little pool table set out table or chairs. Did the whole family join in such games, or only the children? Explain.\n\nMostly the whole family. Some taking turns.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\nLots of time during the long cold winter nights.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe. No.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible. July 1907.\n\n26. Who organized it? St. Patrick's parish.\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.? For St. Patrick's Parish all others welcome.\n\n28. Was it the first picnic held in the community? No\n\nIf not, do you know the date of the first one that had been held? July 1906.\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)? Ball games, races, children races, lunar races, pillow fight & tug of war.\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups? All the ladies & the parish took things to eat. Like Bread, buns, butter cream, cooked chicken, salads, pies, cake & etc.\n\n31. What did you have to eat and drink? I had everything I wanted to eat & tea to drink.\n\n32. What time of the day did it start, and how long did it last? Dinner was served at noon and supper was started about six. Then there was a dance on an outdoor tower at night and lunch served at midnight.\n5. What winter games were played outside? Fox and hounds, skating, etc.? What could you do? How long would it take?\n\n21. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, small school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating—was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n\nThen there was a dance in our window forever at night and lunch served at midnight!\n33. Describe any features of this picnic which you remember as outstanding. The new built tables and covered them with poplar branches. They also built a booth and there they sold gallons of ice cream made from home cream & fresh eggs. Hot ice in Lamigon and young men & boys turned out. Ice cream purchased by lambe.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nIn the early days there were tables set and you helped yourself and mostly homemade ice cream was used. Now ice cream is always bought and lunches are served on plates and handed to you or else you just buy a hot dog or pie or coffee.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Baseball was the most popular but there were Ladies & children races also Boy race ball, Horse races, foot races, High jumps and many.\n\n37. For what game was the first team organized in your community to play against neighboring teams? Ball games\n\nWhat year? 1907 How long did it continue? For many years still goes on some times at picnics.\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nBoys Basketball was organized by Joe Anstett in 1909 or 1910 and played against Lamigon top and won.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\n35. What changes have you noticed in picnics since the first year? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people). Bear hall was the most popular for fall, November 1st was also popular for ball games.\n\n37. For what game was the first team organized in your community to play against other teams?\n\n38. Name any other sports teams that were organized before 1924, giving date of organization, if possible, and tell something of their activities—played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community? 1906\n\nDid it grow out of or replace the earlier community picnic? The annual picnic is still held at Summit each year.\n\nSt. Patrick's & St. Ignatius parishes\n\nWhen was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\nWhen time permitted in early days, now in June.\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nOnly school books & dictionary.\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details. Could not afford to buy books.\n\n46. What books were sent to you as gifts in early years? Shakespeare.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Yes. Give details and dates.\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school text books as additional reading material?\n\nI think so.\n40. When did an annual sports day become established in your community? (Give date.)\n\nDid it grow out of or replace the earlier community plan? (Give answer.)\n\nWas there any other activity during the first sports day?\n\nWhen was the sports day usually held? (What month, or any special day, such as May 2nd or July 4th?)\n\nAre there any members of your community who have been members of teams, clubs, or other teams? (Give names, and dates.)\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the books you brought, and what kind.) (The extra space is necessary.)\n\n43. How many of your neighbors brought books with them?\n\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts? In early years, Shoshone County.\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\n48. Was there a school library? When was it begun?\n\nTo what extent were books borrowed from the school library for adults to read at home?\n\n49. Did parents ever use their children's school texts as additional reading material?\n50. Has there ever been a community library in your district or town? Yes\nWhen was it started? Who started it? Cassopile S.D.\nIs it still in existence? No.\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\nFamily Herald & Weekly Star and a Winnipeg Weekly. My father also keeps taking the Grand Forks Herald from N.W.T.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\nFree Press Weekly from Winnipeg\nWestern Advocate from Regina\nRegina Leader or Saskatoon Star Phoenix for 4 months in winter and a couple Catholic papers.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material? No\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Not exactly.\n50. Has there ever been a community library in your district or town? Yes.\n\nWhen was it started? 1917\n\nIs it still in existence? No.\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, its history, who served as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the district?\n\nFamily Star and a Weekly Star and a Winning Weekly. My mother also kept taking The Grand Forks Herald from North Dakota.\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\nPrice Press Weekly from Winning Weekly\n\nPurchased Books or Magazines from Regina\n\nSubscription to the Free Monthly Lady Aberdeen's Magazine of Reading\n\n53. Did you ever obtain the free monthly Lady Aberdeen's Magazine of Reading material? No.\n\nGave dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain. Not really.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you? Organ\n\n57. What instruments did any of your neighbors have? Violins & Banjos.\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nMy father won a piano at Robin Hood Store in Laramie in 1911. Phonographs & radios have been bought since they were sold here.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe. All kinds of singing and music was in our homes. In early days from 1912 Bernard & Cutterball from England was a wonderful musician and spent many hours at our home in the community. (were there musical concerts, was there group singing at parties, etc.) Describe.\n\nYes at the concerts there was always nice singing in groups and others singing alone or with\n\n60. What were some of the favorite songs in the home?\n\nSome were easy joes, Red Wing, Under the apple tree,\n\nand one my mother sang with us, but my little ones away in the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nThe same songs were sang here as the country I came from because the music & song was always\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain. No\n\nEach nationality seemed to like different songs so they would all sang and liked by all.\n\n63. Was there a band in your community? No When was it started?\n\nWho started it? How long did it continue?\n\nHow many were in it? Who was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nFor two years about 40 chickens donated\nMusical Entertainment\n\n56. What musical instruments did you bring west with your family?\n\n57. What instruments did any of your neighbors have? (Violins & Banjos)\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\nMy father won a piano at Robin Hood's Inn in Kansas City in 1911. Other people had banjos, accordions, violins, etc., but they were not as common.\n\n59. How many did you buy? Describe.\n\nIn the early years in the West, there were no musical instruments except for stringed instruments like violins and banjos.\n\n60. What were some of the favorite songs in the town?\n\nSongs like \"Home Sweet Home,\" \"The Old Folks at Home,\" and \"Dixie\" were popular.\n\n61. Was \"folk music,\" or music of the country you came from, popular in your home or community? Explain.\n\nThe new songs became more popular than the old ones.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune?\n\nYes, I made up words to fit an old tune.\n\n63. Was there a band in your community? If so, when was it started?\n\nThere was a band in my community, and it was started by Mr. Smith.\n\nHow long did it continue?\n\nWho started it?\n\nHow many were in it?\n\nWho was bandmaster?\n\nWhat instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances. No.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nNot so much as years past. I think the radio has changed it to some extent but still there is a lot of local music.\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? No.\n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain. No.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.? Not that I know of.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nOne little incident comes to my mind in the early days was chicken raffles. The farmers wives would give two spring chickens about January and they would hold a raffle in one of the houses and play a handed forty-five costing 10 cents to each person and the two winners who won two games out of three took the chickens played for. Some were lots of fun. About 40 chickens donated.\n10. Has anyone from your community been well known or famous in the musical world? Give names and dates and places of public appearances.\n\n64. In what way important or less important is your community now as compared with the early days? What is the reason for this change?\n\n65. Have you any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a brief outline of the collection.\n\n66. Do you have any \"collections,\" such as stamps, stones, paintings, signatures, arrowheads, etc.? If so, give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a brief outline of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nKnow 98\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, pioneer days, not already mentioned. (Use back of page, or extra sheet if necessary).\n\nOne little incident came to my mind in the early days was similar to the famous lives would give two spring chickens about January and they would hold a rooster in one hand, house and play a handed foot-firing 10 o'clock each season and the two winners who won two games out of three took the dishwashers for dinner were the 8 times about Hoehlkemper's.\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1W8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12972_1906A-J_2059.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 28, "total-input-tokens": 46480, "total-output-tokens": 8384, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1216, 5], [1216, 1216, 6], [1216, 3873, 7], [3873, 5380, 8], [5380, 7908, 9], [7908, 9587, 10], [9587, 11300, 11], [11300, 12807, 12], [12807, 14312, 13], [14312, 15230, 14], [15230, 17219, 15], [17219, 18051, 16], [18051, 20062, 17], [20062, 21164, 18], [21164, 22612, 19], [22612, 23832, 20], [23832, 25066, 21], [25066, 26286, 22], [26286, 28210, 23], [28210, 29638, 24], [29638, 31290, 25], [31290, 33028, 26], [33028, 33184, 27], [33184, 33338, 28]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]