[{"id": "a15a45a48a58a9b60f252bb95a154295eccc259b", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask., where it will be preserved as part of the permanent record of our Province.\n\nName: [Signature]\nAddress: [Signature]\nBirthplace: [Signature]\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1892\nWhere did you set up housekeeping? S.E. of the 28th Rd., near the townsite of [signature]\nWhere had you been living before that? [signature]\nFor how many people did you prepare meals? [signature]\nHow far was it to your nearest store? [signature]\nHow often could a visit be made to the store? [signature]\nWhat groceries did you usually buy in those earliest years? [signature]\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? [signature]\nIn what quantities did you buy it? [signature]\nWhat was the usual price per hundred pounds of white flour? [signature]\nHow much did you use graham flour? [signature]\nWhole wheat flour? [signature]\nWas flour milled locally? [signature] How far away? [signature]\nWhat was the price for a twenty pound bag of rolled oats? [signature]\nWhat other grain products did you use? [signature]\nCornmeal? [signature] Whole Wheat? [signature] Farina? [signature]\nOther? [signature]\nDid you grind your own wheat for porridge? [signature]\nHow did you grind it? [signature]\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? We bought 10 lbs. - $1.50.\nWhat was the price for a ten pound sack of white sugar? $1.50.\nWhat brand of golden corn syrup did you use?\nWhat size of tin of syrup did you usually buy? One gallon tin.\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early years? Bought from settlers.\nButter? From cows.\nWhat was the price of butter? $2.50.\nDid you make butter? Yes.\nWhat kind of cheese? We bought small quantities ordinary in the store.\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Beef, bacon, hams, and chickens when we could get them.\nHow did you get fresh meat? Killed our own for winter after 20 year—beef and game.\nHow often did you get fresh meat? Seldom in summer.\nHow did you preserve meat? Frozen in winter.\nWas there a \"beef ring\" in your neighborhood? No.\nIf so what year was it organized? Organized about 1900.\nDid you use game? Yes, we did.\nWhat kinds? Prairie chicken and quail.\nFor how long?\nWhat part did fish play in the family diet? We were able at times to purchase fresh caught.\nWas the fish fresh, cured, or canned? Fresh and salted was.\nKinds? Sometimes shipped in to the store.\n6. BEVERAGES\n\nWhat kind of tea did you buy? Blue Ribbon. At what price? $2.00.\n\nWhat kind of coffee did you buy? (beans or ground) Ground.\n\nPrice? $1.50.\n\nWhat other beverages were used? Water.\n\nHad any strong water boiled the first year?\n\n7. VEGETABLES AND DRIED FRUITS\n\nAll kinds ordinarily after first year.\n\nWhat was the price of potatoes per bushel when you set up housekeeping? $3.00 per bu.\n\nCould you get potatoes at the store? Not regularly.\n\nIf not, where from? We never bought after the first year.\n\nWhat year did you first grow your own supply for the winter of? 1893.\n\nPotatoes 1893, Cabbage 1893, Carrots 1893, Onions 1893.\n\nTurnips 1893, Beets 1893.\n\nIn what quantities did you buy white navy beans? 400 lbs.\n\nHow did you buy prunes, (in bulk or by the box)? By box.\n\nWhat weight? 20 lbs.\n\nHow did the grocer handle prunes (by box)? ...\n\nWhat was the price of prunes? $2.00.\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, apricots, peaches, loganberries, raisins, currants or others)?\n\nApples, green and dried, raisins, saskatoons, chokecherries, and some wild strawberries, gooseberries, raspberries.\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? Yes, berries we picked in the woods.\n\nPeas? Corn? Beans? Saskatoons?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning? 1893.\n\nWhat year did you first preserve vegetables by canning? 1895.\n\nWhat year did you first preserve meat by canning? 1895.\n\nDo you still preserve foods by canning or drying? Fruit only.\n\nTo what extent? About 50 qts. each.\n\nDid you make your own vinegar? No.\n6. What kind of tea did you buy? (Specify brand) ______\n\n7. What was the price of potatoes per bushel when you got up housekeeping? ______\n\n8. What year did you first grow your own supply for the winter of 1892?\n\n   Potatoes ______\n\n   Turnips ______\n\n   Cabbage ______\n\n   Beets ______\n\n   Carrots ______\n\n   Onions ______\n\n   Apples ______\n\n   Pears ______\n\n   Peaches ______\n\n   Grapes ______\n\n   Raspberries ______\n\n   Strawberries ______\n\n   Other fruits ______\n\n   Other vegetables ______\n\n   Other foods ______\n\n   Other ______\n\n   Did you make your own vinegar? ______\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can etc. | Ant. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|--------------------------------------------------|-------------------------------------|----------------------|\n| Soda biscuits         |                                               |                                                  |                                     |                      |\n| Macaroni              |                                               |                                                  |                                     |                      |\n| Graham flour          |                                               |                                                  |                                     |                      |\n| Brown sugar           |                                               |                                                  |                                     |                      |\n| Molasses              |                                               |                                                  |                                     |                      |\n| Table salt            |                                               |                                                  |                                     |                      |\n| Common salt           |                                               |                                                  |                                     |                      |\n| Light white syrup     |                                               |                                                  |                                     |                      |\n| Toilet soap           |                                               |                                                  |                                     |                      |\n| Baking powder         |                                               |                                                  |                                     |                      |\n| Baking soda           |                                               |                                                  |                                     |                      |\n| Dried peas            |                                               |                                                  |                                     |                      |\n| Bread corn            |                                               |                                                  |                                     |                      |\n| Vinegar               |                                               |                                                  |                                     |                      |\n| Raisins - seeded      |                                               |                                                  |                                     |                      |\n| Seedless              |                                               |                                                  |                                     |                      |\n| Rice                  |                                               |                                                  |                                     |                      |\n| Currants              |                                               |                                                  |                                     |                      |\n| Store jam - kinds?    |                                               |                                                  |                                     |                      |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                  |                                     |                      |\n\n10. BAKING\n\nWhat type of yeast did you use? ........................................................\n\nDid you make yeast for your own use? ............. Using starter? .............\n\nUsing hops? .................................. Salt rising? ...........................\n\nDid you buy baking powder? ...................... Baking soda? ....................\n\nCream of tartar? .............................. Did you make your own baking powder?\n\n...........................................................................................................\n| Item                  | Quantity | Notes |\n|-----------------------|----------|-------|\n| Soda bicarbonate      | 1892     |       |\n| Sugar                 |          |       |\n| Green flour           |          |       |\n| Brown sugar           |          |       |\n| Molasses              |          |       |\n| Salt                  |          |       |\n| Cinnamon salt         |          |       |\n| Baking soda           |          |       |\n| Toilet soap           |          |       |\n| Baking powder         |          |       |\n| Baking soda           |          |       |\n| Bread mix             |          |       |\n| Yeast                 |          |       |\n| Raisins               |          |       |\n| Scallions             |          |       |\n| Nuts                  |          |       |\n| Currents              |          |       |\n| Cheese                |          |       |\n| Vanilla               |          |       |\n\n10. Baking\n\n- What type of yeast did you use?\n- Did you make yeast for your own use?\n- Using starter?\n- Using hops?\n- Salt rising?\n- Did you buy baking powder?\n- Baking soda?\n- Did you take your own baking powder?\n- Cream of tartar?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same prod. today? |\n|-----------------------------|----------------------------------------|-------------------------------|---------------------------------------------|\n| Canned salmon               |                                        |                               |                                             |\n| Canned sardines             |                                        |                               |                                             |\n| Other canned fish that appeared early - give names | | | |\n| Apples - fresh              |                                        |                               |                                             |\n|                             | dried                                  |                               |                                             |\n|                             |                                        | 25¢                           |                                             |\n| Lettuce                     |                                        |                               |                                             |\n| Tomatoes - fresh           |                                        |                               |                                             |\n|                             | canned                                 |                               |                                             |\n| Bananas                     |                                        |                               |                                             |\n| Lemons                      |                                        |                               |                                             |\n| Oranges                     |                                        |                               | 60-75                                       |\n| Cornflakes                  |                                        |                               |                                             |\n| Other prepared breakfast cereals - give names | | | |\n| Pearl tapioca               |                                        |                               |                                             |\n| Minute tapioca              |                                        |                               |                                             |\n| Sago                        |                                        |                               |                                             |\n| Dates                       |                                        |                               |                                             |\n| Walnuts                     |                                        |                               |                                             |\n| Icing sugar                 |                                        |                               |                                             |\n\n14. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (Well, river, slough, dugout) ...............................................................\n\nHow far was this water from your home? ..............................................\n\nHow was it brought to the home? (pail, barrel, tank) ..........................\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nOn the farm we drew water in barrels for 13 years then found a good well and built a new house close by it.\nCanned salmon\nCanned sardines\nOther canned fish that spoil early - give names\n\nApples - fresh\ndried\n\nLettuce\nTomatoes - fresh\ncanned\n\nBananas\nLemons\nOranges\n\nCornflakes\n\nWater prepared\nbreakfast - five cups\ncoral - five cups\nmilk\n\nPearl tapioca\nInstant tapioca\nJugo\nDr. tias\nWalnuts\n\nIcing sugar\n\n1. WATER SUPPLY\nThere did you get water for drinking and for cooking? (well, river, slough)\nIf so far was this water from your home? (well, pull, barrel, tank)\n\nHow was it brought to the house? (pail, barrel, tank)\n\nAny changes which have taken place since you began using this water supply? (giving dates where possible)\n\nFirst started housekeeping, giving dates where possible.\n\nOn the farm are sheep raised in barrels for 13 years then found agreeable and good for milk.\n13. SOAP\nDid you buy laundry soap or make your own? Bought\nIf you made your own, did you use lye? Wood ash?\nWhat kinds of laundry soap did the grocer handle? Ordinary\n\n14. FUEL\nWhat fuel did you use in the earliest days? Wood\nWhere did you get your fuel? From Luff, 3 to 8 miles away\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nAfter organization in the district about 1906 we cooperated to bring in car loads of coal after C.P.Ry was constructed from Saskatoon east.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) Bought a stove from Ontario\nDid you use an outdoor fireplace or bake oven? (Give dates)\n\nBy whom was your first cook stove made? McClure\nWhat year was it purchased? 1890\nPrice? $32\nWhat types of utensils did you use? (Iron, copper, tin, homemade)\nFor preparing food? (china, earthenware, wooden bowls, other)\nWhen did you first see enamel ware? 1895\nAluminum? 1910\n6.\n\n13. **SOMETHING**  \n   Did you buy laundry soap or make your own?  \n   If you made your own, did you use lye?  \n   What kind of laundry soap did you use?  \n   Did you use any other type of detergent?\n\n14. **FUEL**  \n   What fuel did you use in the earliest days?  \n   Did you use any other type of fuel?\n\n15. **TYPES OF UTENSILS**  \n   For cooking, did you use an iron, cast-iron, or open-hearth in the earliest days?  \n   Did you use an outdoor fireplace or bake oven?  \n   When was your first cook stove made?  \n   What year was it purchased?  \n   What types of utensils did you use? (iron, copper, clay, homemade)  \n   For preparing food? (chairs, earthenware, wooden bowls, other)  \n   What was your first stove?  \n   What was your first range?  \n   What was your first furnace?\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nPaper was used—no celophane.\n\n17. Give a typical day's meal (breakfast, dinner & supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time, show the approximate month, e.g., winter or summer.\n\nBreakfast—porridge of oats, wheat or corn meal with bacon and dried apples mostly as fruit. Always milk plentifully.\n\nDinner—meat—always fresh in winter. Salt pork in summer with potatoes, turnips & other vegetables with some dessert.\n\nMy wife & one child 2 yrs. old in 1892.\n\n18. What year did you serve your first Christmas dinner in western Canada?\n\nGive the menu. List those present and give their approximate ages at that time.\n\nRoast beef, mince pie, vegetables.\n\nSand with child and a bachelor neighbor named George Pope Clement—a brother of Judge Clement late of Vancouver.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nOnly for a short time in the spring of 1893. The train from Regina to Saskatoon ran twice weekly but the last train down for Regina left Saskatoon on Dec. 6, 1892. We had no other come north until Mar. 30, 1893. Some 50 men lived largely on chopped wheat in order that sick folk & children could have oatmeal and white bread.\n17. Give a typical dinner menu (breakfast, dinner & supper) for the earliest \n    year that you can remember. Have the names of the dishes or the really \n    good things that you ate then. Also list the times of day. Finally, \n    describe what you thought about the food.\n\n    Breakfast: \n    Dinner: \n    Supper: \n\n18. Tell me how you did your first Christmas dinner in eastern Kansas. \n    Describe the menu. List who was present and give their \n    ages. Also describe how the meal was prepared.\n\n19. Were you ever reduced to almost starvation level? Give details.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today. There is no difference, save the fact that everything is made easy by electric power, heat, etc.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible). We always when on the farm preferred our own foods from our home grown meats and vegetables.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed). This information asked for is mostly dealt with in the foregoing replies to questions asked. One of the first great detriments to early settlement was the fact that the Canadian Pacific Railway gave a monopoly of all their cars to grain companies who would not did build elevators on their sidings. This put us settlers at the mercy of the grain dealers combine or grain exchange. It is not too much to say that we settlers were robbed of several cents a bushel on every bit of grain we sold. A farmer could not get a car at any station where an elevator had been erected. The sale of cattle also was in the hands of a monopoly headed by the Gordon Brothers Co. They never got the value of our breed. We had to keep all steers till three years old and the most we got was $1.50 for an animal that would dress 800 lbs. This along with the high freight rates and high cost of alfalfa supplies made the years of early settlement a period of poverty. It has been partly overcome by organized cooperatives. But much remains to be done, but will not be done until the political parties are cleansed by the election of men of principle.\n\nJohn Evans\n20. What did you do to improve your diet?\n\n21. Did you grow your own vegetables?\n\n22. Please add other details from your early experiences of buying groceries and preparing food.\n\n23. How did you feel about the changes in the food industry?", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12935_1892_50.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 4680, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1480, 5], [1480, 1480, 6], [1480, 2696, 7], [2696, 2696, 8], [2696, 4311, 9], [4311, 4888, 10], [4888, 9640, 11], [9640, 10819, 12], [10819, 14598, 13], [14598, 15369, 14], [15369, 16430, 15], [16430, 17217, 16], [17217, 18665, 17], [18665, 19234, 18], [19234, 21163, 19], [21163, 21403, 20]], "primary_language": ["None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]