[{"id": "66276e96bf76903999ad8a130c1973502e460c5f", "text": "PIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Officer,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: William P. Smith\n\n2. Your address: Regina, Saskatchewan\n\n3. Date: October 1952\n\n4. Where were you born? (Give name of place and country): Holland\n\n5. What was your father's name and occupation?: Th. Van Oort, Cheese and Grain Business\n\n6. When did you come to Saskatchewan? (Give month and year): April 1905\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc).\n\n9. What were your reasons for coming West?\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\n13. What means of transportation did you use?\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\n16. Where did you settle or take up land?\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n25. When was the first car used in the community?\n\n26. If you owned a car before 1914, when did you buy it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in name since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\nDear Lee,\n\nIf from time to time you can find me\nthe answer to the question\nyou are well enough to use\nthem.\n\nI once needed your many\nadvice, trouble, trouble.\n\nYou may think nothing\nand pray she keep them\nyour Truly\n\nJim Cunliff\nLogs and later on we erected poles all around for warmth.\n\nThe building was not even so bad and did us until\n\n1909 when we were able with\n\nthe help of a carpenter to build\n\na more prominent 1/2 story\n\nlog house which was to be\n\nmy home for the next 35\n\nyears.\n\nOf course we were not so\n\nvery flush with money still\nwe managed to buy a team of oxen hand plow\nmanure and take from\nparty who came in 1904\nbut didn't like the look of\nthings and was glad to sell.\nMy friend was the farmer\nand did the work here at\nwhich there always was plenty.\nI went for several months\nworking on the construction\ngang building the C.R. Railway\nto make some ready cash.\nWith the time for making hay near at hand I quit\nthe road work to assist\nmy friend in putting up\nhay a bit later on eve.\n\nConcentrate to the different\nCamp\n\nThis was slow work with\none team as we mostly\nhad to stack the hay several\nmiles away along the\nrailway line at places where\nCamp would be located.\nStill it kept us at least in some money and soon we increased our pasture. We did not need two-hand plows.\n\nThe first years we got more work than we could handle by breaking 5-10 or 15 acres for new settlers. Of one party I want to mention had a homestead along the telephone track near what we called the\nSaskatchewan Archives Questions\n\nMy name is Wm VAN VLIET.\n\nI was born in Holland in\nthe year 1877. So, as Premier\nBennet remarked once, not\nlonger a young man.\n\nI came, from what you\nmay call, middle class\npeople, the youngest of\nthe family—\n\nI am not altogether from\nfarm stock—\nfrom outside points to be supplied to the settlers of this district.\n\nWe got ours, if I remember right, from some place in Manitoba and was shipped in carloads to Gowan where it was given out by the local immigration agent—payment was a first claim on grain delivered to any elevator—\nIt was in 1908 that we formed our school district.\n\nI did pass M.O.L. (more uitgebred lager, school in Holland where we got the fundamentals of one or all three of the modern languages: French, German or English).\n\nBeing in those days about the only one able to read and to write (and without mistakes) English I was elected see of the district a part of field.\nIt was in 1908 that we formed our school district.\n\nI did pass M.O.R. (more educated) lager, school in Holland where we got the fundamentals of one or all three of the modern languages (French, German or English).\n\nBeing in those days about the only one able to read and to write (not without mistakes), English I was elected secretary of the district a past of help.\nThis part was a Frenchman by the name of Fourier and an Englishman Frost by name both left but kept little during the time we cropped the few cultivated acres on the property.\n\nIt was in 1911 we got our first at least good crop that is in a northern.\n\nThat spring we exchanged our best fine wheat for an\nplenty of hard work,\nbut at the same time\nI kept my independence\nand never did look\nto any of my family\nfor any help whatsoever.\n\nVan Van Fleet\nGuardian Dask\nOne early variety called Preston.\n\nWe don't keep this lang however as it was very bad to scatter.\n\nWell that first crop gave us some extra courage.\n\nMy friend went to Holland for a visit at the same time having to attend to some financial business in Holland.\n\nI got married in 1911 to a young lady not...\nTo my son -\n\nI don't think there is very much more I might not be able to do according to some estimation but my half interest in the farm assets is not so small at present plus what little I have saved is enough to keep the kitchen flame going.\n\nI had a good life with\nLong out at Sarony\nGermany by the name\nof Freida Bannick &\nWe have by now been\nmarried for 42 years\nand are blessed with\nthree boys.\n\nI expected my friend\nto bring the girl he left\nbehind back from Holland\nbut it seem that it didn't\nclick so when he came\nback, he just lived with\nowned the property,\nrenting it to my son Otto—\nof was past 70 at that\ntime and my friend\nnot wanted to leave the\nfarm occupied the\ncottage while boarding\nwith my son and family—\nHe always got on very\nwell with my son and\nwhen he passed on with\nheart failure during 1947\nhe left all his interest in\nus and we conducted\nthe farm together owning\neverything 50-50.\nI held all small offices\nor positions like Sec at the\nGrain Growers and Cattle\nfrom the local.\nI don't do much traveling\nin the early days except\nattending the annual\nmeetings of the Grain Growers\nor yearly meetings of\nthe school trustees.\nThe department of Trade and Commerce -\n\nFor some time after my eldest son was mar\nried I was living in a\ncottage on the place -\nbut as the boy took\nover more and more\nof conducting the farm -\nI thought it best to\nleave and live in the\nvillage -\nmy friend and myself\nIt was in or during 1910 that the railway was finished and town started by the building of two stores, hotel and a livery barn.\n\nThe town was named Glenn but I don't know where this name originate.\n\nAs our house and building was near a trail going in the middle of our property used by the\nfor his Ph.D., what he still doesn't have at present, is with the faculty at Dart University.\n\nThe youngest Bill took his M.I. in 1941 and went with the first Canadian division to Crete and Italy—coming home in '46—promoted to Captain.\n\nBill is at present in Bonn, Germany engaged with\nIndians from the Poor man reservation do go to the Gordon and Anglican mission. We had many dropping in for a cup of coffee during the cold winter days, and the older ones still visit me although no longer living on the farm but residing in the village. I get many Indians to work for us either can.\nThe oldest one after leaving school stayed and worked on the place receiving wages as much as what I would have had to pay a stranger.\n\nThe other two I sent through Luther College and the University.\n\nThe one after leaving in part, went on scholarship to Madison, Wisconsin.\n66\n\nStarting clearing or\nlater in harvesting for\nworking and threshing.\n\nIt was in 1915 that we\ngot our first bumper crop\nof 475 bushels per acre.\n\nWe had by that time quite\nan acreage so that that\nput us on our feet for\nthe time being.\n\nWe bought the land.\nHalf at 24.28.18 and\npaid for the quarter acre.\none cent it was during...\nthe time it was taken over.\nThe year that followed we had our ups and downs but have had never to depend on the government for relief or anything—our first car a Ford we bought in 1926—when the boys became big enough to drive it as I do let before I have three boys.\nwe bought previously.\nFrom then on we had our\nups and downs but all\nin all we didn't do too\nbad.\n\n1915 been during the\nfirst war prices of all\nwe had to sell were good -\nOne thing I want to men\nfrom; on the advice of\nthe elevator agent we shipped\nour wheat to Fort William\nfor storage keeping it\nexpecting an increase in price.\n\nPerhaps some of you remember the then government leased 10 million bushels of grain held in storage to be sent over to Italy.\n\nWell any three ears was among this lot, although wheat advanced $5.87 during the next two weeks, I only got the price plus\nexpecting an increase in price.\n\nPerhaps some of you remember the then government released 10 million bushels of grain held in storage to be handed over to Italy.\n\nWell my three cars were among those so, although wheat advanced $5 & $6 during the next two weeks, I only got the price plus...\ncame having the prospect of a creamery in 1910 just as soon as the Railway would be open for operation.\n\nCraps kept being froze year after year so that many did get discouraged and left.\n\nAmong those leaving were the Heckmans mentioned before and two occupying the South half of 24-28-18\nThat time at Melville—\nWe bought our first quarter land in 1909 as quarter just west of our place where without clearing we could break more than a hundred acres.\nLand could be bought for as little as one dollar per acre down so that this pushed our farming ahead.\nIn the mean time our stock increased to about 10 milch\nfor 20 years when we had a bad break between R.C. and our ratepayers over the question of having the school conducted by R.C. Sisters.\n\nIn 1909 they built the first R.C. Church which soon became too small to accommodate the congregation.\n\nThe pros held monthly service conducted by Prof. Smith at the Southern College.\nWe had made up our mind to stick together as much as we could so we went to N Minnesota—a place called Hendley—where 10 years before a big bush fire destroyed timber and land and property in great number. There a big part of land was being settled with Dutch and Michigan Dutch but even my friend\nThe $5 next time you come to town when we need may not be for the next 5 or 6 months —\nOur winter and spare time was spent in clearing land as this being part land the sections —\n24, 73 and 25 had more than their share at once —\nIn fact we had no more than about 35 acres of land we could work\nwith all his desire for farming found the heavy attempt and burdens\ntimber & cattle too much for him.\n\nI never intended the farm\nstill having in mind he\nstart in the bakery business.\nwhen ever I had money\nenough saved for this venture\nIt is however a long road\nwith wages in those days\nat $1.50 for a ten hour day.\nfor our cow -\n\nThe woman said she was sorry but the boys wouldn't\nwant sell the cow for less than\n35¢. Now was a pocket,\nwe told the woman we\nhad spent all of our\nmoney but less than $1 we\nso were not able to pay.\nThe additional $5 =\nWe must have looked\npretty honest as the next\ntake the cow and bring\nas a monthly wages at $25\nin the lumber camps —\nI went back to bakery\nwork in Minneapolis where\nmy friend found work at\na summer resort near\nLake Minnetonka —\nIt was in the fall of 1904\nthat we both had work\nwith a mining surveying\nparty at Webbings &\nas I mentioned before my\nfriend was working at\na manor living about\n15 miles North of Dysart\nhad a cow she wanted to\nsell.\n\nComing at the place the cow\nwas to our liking and we\nmade the deal for $30\npaying the money but\nleaving the cow to pick\nup when returning home.\nAfter we bought our supplies\nas far as our money went,\nwe came back to Mr. Harrison.\na summer resort for a girl having big interest in\nthe Moose mining district\non his recommendation\nwe got winter work there.\nIt was when working at\nHubbing that we came\nacross a Winnipeg paper\nfrom which we found that\nthe Canadian Government\ngranted 160 acres of land to\nnew settlers.\nIt didn't take long for\nIt was during the summer of 1906 that we got our first cow.\n\nIt was very hard to get a good milk cow; you could always get one cow from the rancher but they sure were not much of pets.\n\nMy friend and myself for once went both to Lipton and on our way found that a Mrs. Harrison\nIt was during the summer of 1946 that we got our first cow.\n\nIt was very hard to get a good milk cow. You could always get one cow from the rancher but they sure were not much of pets.\n\nMy friend and myself for once went both to Lipton and on our way found that a Mrs. Harrison\nmy friend to make up his mind that this was something for him.\n\nI still had no idea for farming but after talking it over I thought it would be a short cut to get capital for my intended business.\n\nWe went to Winnipeg in the fall of 1904 and at the immigration hall where sent to a Mr. Wolf.\nObtain our water supply.\n\nThe people were there not more than about two weeks when the youngest boy at 18 got sick with diphtheria—\n\nThe nearest Dr was at Fort Cappell and by the time we got here the boy had died.\n\nWe buried him on his homestead and till this day you may still see the\nwho was in charge of settling a district along\nthe proposed new Grand Trunk or C & R Railway—\nsome 75 miles about\nnorth of Capelle Lake—\nThis Mr. Wolf of course—\nlater was given half section\nof land in that district\nso as to bring in new\nsettlers—\nLand of course was of no\nvalue along there are\nHi -\n\nIt was Mr. and Mrs. Heekman with sons and one daughter. Having to build a house we offered them our place, using their tent until they completed the house.\n\nOne thing happened while living at our shanty I am still at the time very sorry about -\n\nWe had a shallow well dug not far from the home near a slough.\none settler to buy it.\n\nSo you don't get your\n1/4 section not altogether\nfor nothing.\n\nLet that time it was very\ndifficult and expensive to\ngo to that district and have\na look yourself having\nto travel to South Cappell,\nfrom which point every\nother week you could\ntake passage with the\nmail carrier for the\nwant them to know just how I was living although for myself I was quite content.\n\nIt was in 1906 that we got new neighbors people by the name of Heckman.\n\nThey came from Belgium and seems to be better fixed financially than most.\n\nThey came with four horses and a complete outfit of machinery as required at that time.\nmounted police post at\nKuttenen on the old Prime\nAlbert Cappell Telephone\nTrack.\n\nWe waited until spring\n1905. The year the NW\nTerritories became Saskat\nChewan to take up our\nlands the NW and NE of\n84.28.13 W°\n\nIt still was not easy to\nget there, we could take\nthe train to Elkhorn and\nfrom that point a new railway line was in progress of building which was in use for work trains as far as Leptown about 50 south of the location of our homesteads. It took 8 days by train from Elkhorn to Leptown having to shift from caboose to box car several times although we paid for our tickets and there\nI know it was a very cold night but being younger as I am now it didn't hurt me any.\n\nI kept regular correspondence with my relations back home although not writing as often as the first because father died the second year as was living on the farmstead.\n\nSo far I don't have much to write about going ahead in the world and I sure don't\nwas at that time no regular service.\n\nWe were traveled light—having all our belongings in one trunk—\n\nArriving at Repton there was only a tent where served at that time for dining hall and store being closed partly kept open for business—\n\nThe morning after we came to Repton we started\nToo uncomfortable.\n\nDuring the evening I heard someone sneaking\nthe sleep and found next morning when I was\ncooking my breakfast of cornmeal, that it had\nbeen Mr. (I won't mention\nthe name) who had came\nto see how I made out.\nHe told me he had never\nbeen so worried in his\nlife.\nout on foot for our prospective new homes—\nWe were able to get some information about tracks\nto take as a party of six Hungarians had gone that\nway about two weeks before.\nWhen about 8 miles out\nof Lepton at the point where\nat present Dysart is located,\nwe saw a woman working\nin the garden near the\ntrack.\nThe new Mrs. would not have any strangers at dinner so I was out in the cold.\n\nI asked and got permission to put up in a cattle shed so I could be out of the wind and at least under a roof although the shed was open at one end.\n\nI had hay for my axes and plenty left in the sleighbox so I was out.\nTo make sure we were on\nthe right road we accosted\nthe woman.\n\nThe people's name was Mitchell.\nComing from Austria and\nhaving settled there the\nprevious year.\n\nWe were on the right trail\nbut the woman asked to\navoid till noon when\nthe husband would be\nhome it was time who\ntook that party at\nfamilies or friends\ntry to make South of\nGordons and stop at\nsome ranch house -\nOne particular trip\nI came South of Gordon\nintended to stop at a\nranch I knew several\ntimes and was told\nI could stop any time.\nThis time however it\nwas different; he was just\nback from England and\nHungarian people have weeks before the start for secular district.\n\nWith western hospitality, I don't know if that is the right name in this case, but we were asked to wait and stay for dinner.\n\nWhen Mr. Mitchell came home, he at first agreed to drive us out for a certain sum of money.\n\nHe took us back to Leptus.\nA trip in spring or early fall was not so bad—\nWith oxen it took me two days to reach Keptan No.\nI had to spend and camp one night somewhere\nhalf way preferable before.\nI came outside the park land country.\nIn winter I made my way through the Gordon\nreserve and eventually\nstop by one of the Indian\nin the afternoon to pick up our belongings and make some necessary purchases in the way of food and necessary tools.\n\nThe tracks then were no free tent days highways so it took us a long time and one half day to travel—about 45 miles to those Hungarian he brought out some time earlier—\n\nOur way went through the\nIt was not long that same inspector came out to settle; I didn't get any full amount but it sure was better as nothing.\n\nWe visited Leyton, which was growing then, twice or three times a year—making these trips was mostly left to me as my friend didn't like to travel and sure not in winter.\nIndian reserve where we stopped at one place over night.\n\nThe following noon we got as far as those Hunga main settlers who showed us what survey line to follow as we still had to go 12 miles before getting to 24.28.18.\n\nOne of us kept in the lead tracing the track only cut through the cliff.\nwas accidentally killed on the railway and his party knowing about it had applied for the land—\nhe had the quarter with\n30 acres new-breaking but\nwas in no mood to settle\nwith one for the work done\nI didn't know where to\ngo to put up a claim\nso I wrote; it may look\nfoolish now, to premise\nScot our first premier.\nfrom his railway work\nto put in his time on the\nhomestead—\n\nWhen fall came there\ncame no Simpson and\nof course no payment.\n\nThis place was about six\nmiles from our home stead,\nso it took one some time\nthat this particular question\nwas presented by some one\nelse.\n\nIt seems that Simpson\nperhaps a year ago -\nIt was evening when -\ncame to our discovery\ncornered four holes o.o with\niron stake in center showing\nthe number of our feet can\nOur first night and several\nafter were spend sleeping\nunder the stars having no\ntent or anything like that.\nMy friend and myself were\namateur if it came to building\nstill we managed to erect\nStone house occupied by a Church of England minister.\n\nThe name of the party was Simpson and he was a railway worker.\n\nI was to break 30 acres as this was a nice quarter once having been used for an permanent station.\n\nI was to be paid in the fall that was the fall of 1966 when he would return.\nA 12 x 14 log building was started two weeks ago —\nComing from Kingston we brought with several boards\nand a window, and two\nrolls of tar paper —\nHaving no other way to\nhandle if all logs were cut\nand carried to the place we\nbuilt our shanty —\nThe roofing was made from\nroofs made with a spade —\nWalls bricked between the\nMy father was a Dutchman\nliving in the whole\nDutch cheese business buying\nthe year around cheese\nfrom farmers for our own\nassortment.\n\nCheese exported extensively\nto England and the\nbig cities like Amsterdam,\nRotterdam, etc., for retail\nselling.\n\nAt the same time supplying\nThis was sooner than I first thought would be possible.\n\nThe implement business from which we had the building made us so soon we were able to get title to the land; take out a mortgage enough to settle all our outstanding debts.\n\nThe 1947 crop failure made it necessary for the government to import seed grain.\nfeed to the farms. Feed bought at the bourse from shipments of corn from either Argentina or the U.S., and also with meal feed from local flour mills and flour cakes from Russia.\n\nI always did consider father to be well off and I guess was justified in thinking this way, looking at the company we kept.\nahead improving —\nAs I mentioned the first\n1947 was a complete loss.\nThis put us back quite a little.\nI could not pay for the\nteam of horses so went to\nsee the contractor offering\npayment for the use if he\nwanted to take them back —\nhe expected it would be\nbetter for me to keep the horses\nand pay whenever I could\nbe able too —\nand our way of living in general.\n\nAfter leaving school at 16 I was apprenticed to learn the baker trade with the object of starting business for myself when coming of age.\n\nAt the age of 20 I was drafted in the army for two years having drawn a very low number with the option to serve\nUntil then there was no post office here and we had been at Kudowa where mail came from the post twice a month.\n\nNow we got a new post office at the place of the immigration agent Mr. Wolf mentioned at the beginning, called Wolfheim.\n\nThis was six miles nearer so we were quite\nMy time in the Dutch Indies at 7 cents per day which appears of displace.\n\nAt that time something happened what changed my course of life entirely.\n\nWe loved and respected father very much, my mother I don't know having died when I was very young.\nand when I went with my first load to Gavon where the elevator agent paid me 15 cents a bushel for wheat what costed me 12 cents to have it threshed alone plus taxes and the meals for the threshing crew whom came from the Gordon reserve with a horse power outfit. Well we all have to learn the hard way of equity.\nBy some unfortunate speculation father became bankrupt—\nNow that may not seem so disasters here—but in the old country (Holland) it meant a step or more down the ladder and a breaking up gradual with people you used to live with on the same footing.\nRemember when we were stacking the wheat someone drove up to the stack we were building and had a look at the grain. It was done from the open west of us and he knew more about horses and wheat than we did. So his advice was to put a watch to the whole thing to save money. Now right he was I found\nIt was then that I made up my mind to some other country to avoid being swept by former friends and acquaintances. South Africa (the Transvaal) just after the Boer War was closed for emigration to the Dutch so I had to look around for some other place.\n\nFather first was very much opposed to the idea.\ngreat acre was a complete failure although we didn't know it at the time.\n\nWe bought a binder with little down and with our team and one borrowed horse we cut our crop and several 10 and 15 acre plots from neighbors — the grain was fine and could be sold at a profit but we still thought it would be worth something.\nclaiming there was no need for any to leave Holland as the family availed me to my starting in the bakery trade when ever I was ready for it.\n\nThat being obliged to the family civil appeal to me, my elder father I wanted to see what I could do for myself before accepting the promised offer.\nThis district.\n\nWe sold one or two horses-\nharness and all for $450.\nwith not one cent down.\nbut I was supposed to\nsupply them with seed\ngrown from our growing\ncrap.\n\nNow I don't know how\nmany of you remember\nthe year 1907 -\nIt was always cold and\nwet and the crap over\nWith a friend I left Holland for the U.S. and having an uncle in Geneva that was the first place to see what to do.\n\nMy friend who left Holland with the object of starting farming for himself, even was convinced that Geneva was not the right place for him, and the land values from $15 to $20 per acre.\nwithout clearing still\nour first crop in 1907 was\n75 acres of grain wheat\nwas quite an acreage for\nthese days.\n\nAfter feeding I done my\nregular three months on\nthe railway to earn cash\nmoney.\n\nThe party or sub contractor\nfrom the East by the name\nof Cook himself bought\na half section of land in\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12948_1904S-Z_810.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 90, "total-input-tokens": 153540, "total-output-tokens": 10065, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 1932, 2], [1932, 3054, 3], [3054, 3717, 4], [3717, 4387, 5], [4387, 5371, 6], [5371, 6330, 7], [6330, 7357, 8], [7357, 7586, 9], [7586, 7901, 10], [7901, 8236, 11], [8236, 8541, 12], [8541, 8847, 13], [8847, 9127, 14], [9127, 9412, 15], [9412, 9774, 16], [9774, 10142, 17], [10142, 10446, 18], [10446, 10604, 19], [10604, 10910, 20], [10910, 11180, 21], [11180, 11460, 22], [11460, 11758, 23], [11758, 12061, 24], [12061, 12327, 25], [12327, 12617, 26], [12617, 12903, 27], [12903, 13203, 28], [13203, 13478, 29], [13478, 13784, 30], [13784, 14077, 31], [14077, 14373, 32], [14373, 14656, 33], [14656, 14948, 34], [14948, 15236, 35], [15236, 15556, 36], [15556, 15875, 37], [15875, 16172, 38], [16172, 16466, 39], [16466, 16781, 40], [16781, 17084, 41], [17084, 17383, 42], [17383, 17689, 43], [17689, 17997, 44], [17997, 18275, 45], [18275, 18553, 46], [18553, 18845, 47], [18845, 19131, 48], [19131, 19426, 49], [19426, 19741, 50], [19741, 20048, 51], [20048, 20367, 52], [20367, 20653, 53], [20653, 20962, 54], [20962, 21300, 55], [21300, 21587, 56], [21587, 21866, 57], [21866, 22173, 58], [22173, 22471, 59], [22471, 22763, 60], [22763, 23041, 61], [23041, 23356, 62], [23356, 23655, 63], [23655, 23968, 64], [23968, 24260, 65], [24260, 24554, 66], [24554, 24868, 67], [24868, 25154, 68], [25154, 25495, 69], [25495, 25791, 70], [25791, 26113, 71], [26113, 26387, 72], [26387, 26699, 73], [26699, 27003, 74], [27003, 27332, 75], [27332, 27619, 76], [27619, 27897, 77], [27897, 28145, 78], [28145, 28459, 79], [28459, 28709, 80], [28709, 29008, 81], [29008, 29310, 82], [29310, 29627, 83], [29627, 29919, 84], [29919, 30189, 85], [30189, 30492, 86], [30492, 30788, 87], [30788, 30788, 88], [30788, 30788, 89], [30788, 30788, 90]], "primary_language": ["en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "None"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]