[{"id": "7ffaf0cfc0a95113f22dcc38d0f11caf7ad8d259", "text": "SASKATOON ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering the questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another.\n\nSome of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use \"etc.\"\n\nThe sheets of paper if there is not sufficient space to answer the question, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who have lived in Western Canada before 1924, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the question, they should write them on separate sheets of paper for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 2, entitled \"Pioneer Diet: What Did Saskatchewan Archivists Eat?\" is still being completed. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nAll questionnaires\n\n() Pioneer health conditions\n() Pioneer social life, sports and recreation\n() Pioneer housing\n() Pioneer education and curriculum\n() Pioneer farming experience\n\nFilling in of questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nJordans, Mrs. Mary A.\nSt. Hubert Mission, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of introduction to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. The extra sheets of paper, if there is not sufficient space to answer the questions, don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nWestern Canadian Archives Questionnaire No. 1 entitled \"Pioneer File: West Data\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing and childcare\n( ) Pioneer education and childcare\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Centre,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. Your full name: Dana Gregory L. Jordan\n\n2. Your address: 414 W. Main Street, Saskatoon\n\n3. Date: January 19, 1954\n\n4. Where were you born? (Give name of place and country): Regina, Saskatchewan, Canada\n\n5. What was your father's name and occupation? Gregory Howard Jordan\n\n6. When did you come to Saskatchewan (Give month and year)? July 1st, 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   - From Aug. 1880 to Aug. 1881, I lived at Redcliff, Alberta\n   - From Aug. 1881 to Aug. 1882, I lived at Redcliff, Alberta\n   - From Aug. 1882 to Aug. 1883, I lived at Redcliff, Alberta\n   - From Aug. 1883 to Aug. 1884, I lived at Redcliff, Alberta\n\n8. What were your reasons for coming west? (Give reasons)\n\n   - To seek my fortune in the West\n   - To find work\n   - To escape from poverty\n   - To find a better life\n\n9. What were your reasons for coming west? (Give reasons)\n\n   - To seek my fortune in the West\n   - To find work\n   - To escape from poverty\n   - To find a better life\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n11. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n12. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n13. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n14. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n15. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n16. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n17. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n18. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n19. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\n\n20. What did you learn about the West? (Through other people? Reading about it?)\n\n    - Through other people\n    - Reading about it\nJordens, Mrs. Mary A.\nSt. Hubert Mission, Sask.\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: Jordan, Mary A., Gardiner\n2. Your address: St. Hubert Mission, Sask.\n3. Date: March 19, 1954\n4. Where were you born? (Give name of place and country): Ontario, Canada\n5. What was your father's name and occupation?: Gardiner, Farmer\n6. When did you come to Saskatchewan? (Give month and year): July 1st, 1884\n\n7. Mention any other places where you lived before coming to Saskatchewan:\n   - Family left England when I was 9 months old. Lived at St. Hubert Mission.\n   - In 1884, came to Western Canada. (You do not need to list)\n   - In 1884, came to Western Canada. (You do not need to list)\n\n8. How many children did you have? (Give number):\n   - 4 boys and 2 girls\n\n9. What were your reasons for coming West? (Give at least two reasons):\n   - To find work\n   - To start a new life\n\n10. How did you learn about the West? (Through other peoples' stories or government information?):\n    - Through other peoples' stories\n\n11. Was there anything else you would like to add about the West?\n    - Yes, I would like to add that the West was very different from what I expected.\n\n12. Any other comments:\n    - The West was very different from what I expected.\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\nCanada was a place I had never heard of before, but I knew it was somewhere far away.\n\n12. Did you travel by yourself or with a family (family, friends, or other groups)?\n\nI traveled by myself because I wanted to make my own decisions about my future.\n\n13. What means of transportation did you use?\n\nI used a horse-drawn cart to travel from town to town.\n\n14. What troubles of the journey? What do you remember (people you met on the way, meetings with Indians, encounters on the journey, accidents or other experiences)?\n\nI encountered many difficulties along the way, including hostile Indians and dangerous weather conditions.\n\n15. Where did you settle or take up land? Can you tell us how it happened?\n\nI settled in the town of Regina, where I found work as a clerk.\n\n16. Where did you settle or take up land? Can you tell us how it happened?\n\nI settled in the town of Regina, where I found work as a clerk.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nIn 1893, I moved to the town of Moose Jaw, where I worked as a clerk.\n\n18. How did you earn a living before coming to Western Canada? How did you earn a living after you came?\n\nI worked as a clerk in Regina, and then as a farmer in Moose Jaw.\n\n19. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n20. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n21. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n22. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n23. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n24. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n25. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n26. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n27. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n28. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n29. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n30. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n31. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n32. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n33. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n34. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n35. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n36. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n37. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n38. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n39. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n40. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n41. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n42. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n43. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n44. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n45. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n46. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n47. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n48. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n\n49. What did you find most difficult about living in Western Canada?\n\nThe isolation and the harsh weather conditions were challenging.\n\n50. What did you find most enjoyable about living in Western Canada?\n\nThe opportunity to start anew and build a new life was very rewarding.\n19. How often did you write to relatives or friends in your old house?\n\n20. If you got married, give the name of your husband or wife along with the date.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, please describe.\n\n22. If other members of your family (brothers, sisters) remained, who came here first?\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you ever work in the early years (for example, harvesting crops)?\n\n25. What kind of work did you do in the early years?\n\n26. Did you ever work in the mining camps?\n\n27. Did you ever work in the lumber camps?\n\n28. Did you ever work in the railway camps (for example, building camps)?\n34. Did any people move away during the 1930s? Did many return?\n\n35. Did family become old before the 1940s? Did they die young?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n37. If you or any of your family or friends were \"litter\" to have or do something in the first automobile, описание, оценивая это тогда (тогда, итак).\n\n38. How did the places in your community get their names (school district, etc.)?\n\n39. Date of this adoption (a) Any changes in names since the latest name was given (b) Any competition of person suggesting place-name (c) Origin and meaning of the name\n\n40. Dates, addresses, telephone numbers, creases, hills, etc., try to give (d) Name\n\n41. What are the main crops grown by the farmers in your town?\n\n42. What are the main crops grown by the farmers in your county?\n\n43. Jordan's Mary A.\n35. Did any people move away during the 1930s? If so, how many?\n\n36. If you or someone in your family have held public office, mention it here.\n\n37. If you or anyone in your family or friends were \"first\" to have or do something in the district, mention it here.\n\n38. How did the places in your community get their names? (School districts, townships, villages, etc.)\n\n39. Any other information about your community?\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old newspapers, written recollections and reminiscences (testo)? If so, could you please provide any additional information?\n\nWould you or the person who owns them either:\n\n(1) Be willing to lend them to the Provincial Archivist for copying?\n\n(2) Be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan...\n\n(Indicate your preferences, if any) .................. (Include your name)\n\nIf you have children or grandchildren, please give their names, titles and occupations. Also mention how many are still living.\n\nIf you do not think any of the most important changes in your community since you moved away would be of interest to others, please say so.\n\nIf you have any other comments about the changes in your community since you moved away, please add them here.\n\nIf someone else has filled in this questionnaire for you, please have this person sign here:\n\nGive name and address here:\n\nIf you have any questions regarding historical source materials,\n\n39. Questions regarding historical source materials:\nThe moment continued...\nField ventures continued\n\nThe next day we set out early to explore the area around the bridge. We walked down the river for about an hour before reaching the town of New Hope. From there, we continued on to the nearby village of Willow Creek.\n\nWe arrived in Willow Creek late afternoon and checked into the local inn. The next morning, we decided to take a leisurely stroll through the town before heading back to the river.\n\nAs we walked along the riverbank, we noticed a group of people gathered near the water's edge. They appeared to be engaged in some sort of activity, but from a distance, it was difficult to tell what they were doing.\n\nWe approached the group and found that they were setting up for a picnic. They had brought along sandwiches, salads, and drinks, and were preparing to enjoy a meal together.\n\nWe joined them for lunch and spent the afternoon enjoying each other's company. It was a beautiful day, and we all felt grateful for the opportunity to spend time outdoors.\n\nAfter lunch, we continued our walk along the river, taking in the sights and sounds of the area. We eventually made our way back to the inn, where we prepared for our return journey home.\n\nAs we packed up our belongings, we couldn't help but feel grateful for the experiences we had shared. It was a wonderful day, and we knew that we would never forget it.\nIn a dream, I saw myself as the eagle rising.\n\nAmidst chaos in 1857, my journey across the vast expanse of\n\nAmerica began. The road was long, filled with trials and tribulations.\n\nOn the way, I encountered harsh landscapes, the rugged wilderness,\n\nin its wild isolation, and the harsh reality of life's challenges.\n\nAn unwavering spirit guided me through every obstacle,\n\non my path to freedom and self-discovery. Each step forward,\n\nwas a testament to resilience and determination.\n\nThe eagle soars high above, symbolizing hope and\n\ninspiration. In the midst of adversity, there is always\n\na way to rise above, to find strength within oneself.\n\nThis journey taught me valuable lessons about\n\nperseverance and courage. Despite the difficulties,\n\nI learned to embrace each moment, to find joy\n\nin the simple things. Through it all, I remained\n\nsteadfast, determined to overcome any obstacle.\n\nIn conclusion, this experience has been\n\ntransformative. It has taught me invaluable\n\nlessons about life, about myself. I am grateful\n\nfor this opportunity to share my story, to inspire others\n\nto follow their dreams, no matter how daunting they may seem.\n\nThank you for listening.\nThis is a funny adventure of the early days.\n\nOnce upon a time in 1887, two young girls were out for a walk with their families.\n\nThe wind was blowing, the hills were green, and the trees were tall.\n\nAs they walked, they heard two young boys talking.\n\nThe boys were discussing something important.\n\nOne boy said, \"We need to find a way to get home.\"\n\nThe other boy replied, \"I have an idea! We can climb the tree and jump down.\"\n\nThe first boy thought this was a good idea, so they climbed the tree.\n\nSuddenly, a group of people appeared behind them.\n\nThey were friends who had been waiting for them.\n\nThe boys explained what they were doing, and the friends helped them get back home safely.\n\nIt was a funny adventure, but they learned an important lesson about teamwork.\nThis is a funny adventure of the early days.\n\nOne time in 1887, my younger sisters went out to visit their friends at the Black Rock, walking through the fields in the well-trodden paths through the hop field slush.\n\nOn arriving they found two young boys hiding tea by themselves. The girls met to worry that their boys wouldn't come through for their belladonna. One girl would say, \"The one worst the most things,\" hands in his pocket. The other preferred the smell worst the tiniest.\n\nAs soon as they got there, they'd come heavily to zero worth, well-known.\n\nThe girls left for home, as promised by their relatives.\n\nThey suddenly heard a noise behind them, it was their friend the Indians, gathering berries as if to catch the girls calling out to tell them hello.\n\nShe thick part of the air where the horses couldn't walk.\nThis is a funny adventure of the early days. Sometime in 1887, my younger sisters went out to visit their friends, the Blader girls, walking the half mile on the well-trodden path through the poplar bluffs. On arriving they found two young bucks having tea by themselves. The girls not knowing that these boys understood some English started to ask each other which one they'd prefer for their fellow. One girl would say, \"the one with the most rings & beads in his plaited hair,\" the other preferred the one with the tiniest as ornaments; they'd come hardly to see worth! Well, when the girls left for home, accompanied by their nieces, they suddenly heard a whoop & yelling behind them. It was their friends, the Indians, wielding lances as if to catch the girls & calling out \"I'll be your fellow, come on get on my back!\" The girls scoured stiff & through the thick part of the road where the horses couldn't roll along.\nI reached Havana safely, late, 1877. My dear daughter was heartily pleased by the way we met there after many years. She could hardly believe anyone could imagine us a team to the coming generation.\n\nShe wrote on each page in my own handwriting:\n\nthe typical old approach! Of course you can follow the general idea so far as they're written.\nX reached home safely, & later, when danger was past went part of the way with their girl relations. This cured them of making fun of anyone; it may be a lesson to the coming generations.\n\nHope this written on back pages won't inconvenience the typist too much! Of course you can follow the general idea & not do they written.", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12942_1884_433.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 26, "total-input-tokens": 43160, "total-output-tokens": 5765, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1742, 5], [1742, 3684, 6], [3684, 6196, 7], [6196, 7463, 8], [7463, 13239, 9], [13239, 13239, 10], [13239, 13992, 11], [13992, 13992, 12], [13992, 13992, 13], [13992, 13992, 14], [13992, 14922, 15], [14922, 15339, 16], [15339, 16604, 17], [16604, 16604, 18], [16604, 16628, 19], [16628, 17979, 20], [17979, 19153, 21], [19153, 19926, 22], [19926, 20755, 23], [20755, 21680, 24], [21680, 22022, 25], [22022, 22348, 26]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]