[{"id": "7501a26d467fca8ac84d4a625d59656893cfe8dc", "text": "1. **INFORMATION**\n\n   - What year did you start homesteading in eastern Canada?\n   - Where did you get your homestead?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n\n2. **FLOUR AND OTHER GRAIN PRODUCTS**\n\n   - What brand of white flour did you use in the early years?\n   - In what quantities did you buy it?\n   - How much did you use per month?\n   - What was the price per hundred pounds of white flour?\n   - Was flour milled locally?\n   - What other grain products did you use?\n   - Did you grind your own wheat for flour?\n   - How did you grind it?\n1. **GENERAL INFORMATION**\n\n   - What year did you start homesteading in Montana County?\n   - Where did you go to homestead?\n   - How many people did you bring with you?\n   - How far was it to your nearest store?\n   - How often could a visit be made to the store?\n\n2. **FLOUR AND OTHER GRAIN PRODUCTS**\n\n   - How much of white flour did you use in the early years?\n   - In what quantities did you buy it?\n   - How much did you use per month?\n   - Whole wheat flour?\n   - Was flour milled locally?\n   - Was flour milled locally?\n   - What other grain products did you use?\n   - Cornmeal\n   - Oats\n   - Did you grind your own flour for porridge?\n   - Porridge?\n3. SIGNS AND STANDS\n\nIn what quantity did you buy milk recently?\n\nAt what price?\n\n4. MILK SERVICE\n\nHow did you get a supply of fresh milk in the early days?\n\nButter?\n\nThat was the price of butter?\n\nDid you pack eggs for \"inter\"?\n\nDid you make butter?\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years?\n\nHow did you get fresh meat?\n\nHow often did you get fresh meat?\n\nHow did you grow your meat?\n\nWas there a \"bear ring\" in your neighborhood?\n\nIf so what was it organized?\n\nDid you use guns?\n\nFor how long?\n\nWas the fish fresh, cured, or canned?\n\nKind?\n6. **BUYING**\n\n   - What kind of tea did you buy?\n   - How much did you pay?\n   - What kind of coffee did you buy?\n   - How much did you pay?\n\n7. **VEGETABLES AND FRUITS**\n\n   - What was the price of potatoes per bushel?\n   - Could you get potatoes at the store?\n   - If not, where from?\n   - What year did you first grow your own supply for the winter?\n   - Potatoes:\n     - Turnips:\n     - Cabbages:\n     - Carrots:\n     - Onions:\n   - In what quantities did you buy onions every month?\n   - How did you buy onions? (in bulk or by the box)?\n   - How did the grocer handle onions (by box)?\n   - What weight?\n   - What was the price of onions?\n   - What other dried fruits did you use in the last few days? (apples, bananas, pears, raisins, currants, etc.)\n\n8. **PRESERVING**\n\n   - In the early years, did you put up any vegetables for winter?\n   - Other foods?\n   - That year did you first preserve fruit by canning?\n   - That year did you first preserve vegetables by canning?\n   - That year did you first preserve meat by canning?\n   - Do you still preserve foods by canning or drying?\n   - To what extent?\n   - Did you make any?\n9. Please fill in the following:\n\n| Item          | Price |\n|---------------|-------|\n| Soda bicarbonate |       |\n| Yeast         |       |\n| Raisins       |       |\n| Table salt    |       |\n| Baking powder |       |\n| Cream of tartar |      |\n\n10. Did you make yeast for your own use? Yes. How much did it cost?\n\nDid you buy baking powder? Yes.\n\nDid you take your own baking powder? Yes.\n\nDid you use any other type of yeast? No.\n\nDid you use any other type of flour? No.\n\nDid you use any other type of sugar? No.\n\nDid you use any other type of salt? No.\n\nDid you use any other type of cream of tartar? No.\nFOOD\n\nRemember making soda? In\nit in the store\ncandy, etc., etc.\n\nSoda Baking Soda\n\nCinnamon\nGranulated sugar\nSugar\nTable salt\nCornstarch\nLily white syrup\nRolling pin\nBaking powder\nCake flour\nDried peas\nDried corn\n\nVinegar\nButtermilk - buttermilk\nRice\nCurrants\nStore jam - honey?\nCheese (Cheddar or store cheese)\nVanilla\n\n10. BAKING\n\nWhat type of yeast did you use?\nDid you make yeast for your own use?\nUsing stationary yeast?\nUsing fresh yeast?\nSalt rising?\nDid you buy baking powder?\nDid you buy baking soda?\nGround of tartar?\n\nDid you make your own baking powder?\n| Item                  | Approximate Date | At approved price at the time |\n|-----------------------|------------------|-------------------------------|\n| Canal sugar           |                  |                               |\n| Other canned fish    |                  |                               |\n| Fish that are poured early - dried tomatoes |                  |                               |\n| Apples - fresh       |                  |                               |\n|                      |                  |                               |\n| Tomatoes - fresh     |                  |                               |\n|                      |                  |                               |\n| Bananas              |                  |                               |\n| Lemons               |                  |                               |\n| Tomatoes             |                  |                               |\n| Cornflakes           |                  |                               |\n| Other prepared breakfast - five meals |                  |                               |\n| Pearl tapioca        |                  |                               |\n| Manto tapioca        |                  |                               |\n| Sago                 |                  |                               |\n| Dates                |                  |                               |\n| Walnuts              |                  |                               |\n| Icing sugar          |                  |                               |\n\n12. WATER SUPPLY\n\nThere did you get water for drinking and for cooking? (well, river, stream, dugout) ____________________________\n\nIf or for what this water from your house? ____________________________\n\nWas it brought to the house? (pail, barrel, tank) ____________________________\n\nAny other water supply, mention any others which have taken places since you first started housekeeping, giving dates where possible.\n\nWe change. We will very well.\nThere did not get maker for drinking and for cooking? (well, river, almost, deposit) ...and I am through then have will ....right by the door.\n\nIf ever for sale this maker for your house (pull, barrel, tank) ...pack.\n\nHere was it brought to the house (pull, barrel, tank) ...pack.\n\nVery little water supply, mention any chances which have taken place since you first started housekeeping, giving date, where possible.\n\nFirst charge we will worry well.\n13. Did you buy laundry soap or make your own? If you made your own, did you use soap nuts?\n\n14. Fuel:\n   - What fuel did you use in the winter last year?\n   - Where did you get your fuel?\n\n15. Did you have any experience with the use of fuel oil? If so, what type of fuel oil did you use?\n\n16. For cooking, did you use an outdoor fireplace or open hearth in the past few years? (Give dates)\n\n17. Did you use an outdoor fireplace or bake oven? (Give dates)\n\n18. What type of utensils did you use? (Give dates)\n\n19. For preparing food (e.g., baking, roasting), did you use an outdoor fireplace or open hearth in the past few years? (Give dates)\n\n20. When did you first use natural gas?\n17. Give a typical day's menu (breakfast, dinner & supper) for the earliest year mentioned in this book. Give the date and list the number of family members present at the time. Include the approximate month, e.g., \"October.\"\n\nDinner: Ham steak, potato salad, and bread.\n\nAfter dinner, dessert was chocolate cake.\n\nIn 1914, there was a lot of world trouble going on.\n\nIn 1915, there was a lot of world trouble going on.\n\n18. What year did you serve your first Christmas dinner in Eastern Canada?\n\n19. Have you ever resorted to almost starvation level living on one or two locally obtained foods? Give details.\n\nYes, Dad had to have recourse to food scarcity in the winter of 1915.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homestead and home prepared foods? (Give as many details and dates as possible).\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above; quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12940_1914_344.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 2800, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 600, 3], [600, 1259, 4], [1259, 1847, 5], [1847, 1847, 6], [1847, 2980, 7], [2980, 2980, 8], [2980, 3590, 9], [3590, 4157, 10], [4157, 6171, 11], [6171, 6623, 12], [6623, 7308, 13], [7308, 7308, 14], [7308, 7989, 15], [7989, 7989, 16], [7989, 8586, 17], [8586, 9183, 18], [9183, 9338, 19], [9338, 9492, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, true, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]