[{"id": "67fe24ef430df5ff2f9345cb7b78dcff643e2f54", "text": "S-X2\n374. Kalbfleisch Sarah Ann (Mrs. Charles Henry)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSaskatchewan Archives No. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE PERSON COMPLETING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to you; others may apply to you in part only. It is important for you to answer so don't worry about having blank spaces. If there are blanks, fill them in. If there is not enough space to answer all the questions, describe particular events, or they may be omitted.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1 entitled \"Pioneer Days What Did You Do?\" and No. 3 entitled \"Western Canadian Pioneer Days\" will still be being collected. If you have not already answered these, and would be willing to do so, please put a check mark here ( ).\n\nWestern Canadian Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n- All questionnaires\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer housing and churchwork\n- Pioneer farming experience\n\nInstructions for Completing Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaires to:\n\nSaskatchewan Archives Office\nUniversity of Saskatchewan\nSaskatoon, Sask.\n\n[Stamp]\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name ... SARAH ANN SHEARER KAUFLEISCH\n2. Your address ... CARLTON SASKATCHEWAN\n3. Date ... DECEMBER 27, 1952\n4. Where were you born? (Give name of place and country) Peterborough, Ontario, Canada\n5. What was your father's name and occupation? John Shearer, Farmer\n6. When did you come to Saskatchewan? (Give month and year) November, 1882\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). 5 years of age\n9. What were your reasons for coming West? The land they had in Ontario was small and stony and my father wanted more land for his children.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n1. Your full name: Sarah Ann Shearer Kalbfleisch\n\n2. Your address: Carleton, Saskatchewan\n\n3. Date: November 16th\n\n4. Where were you born? (Give name of place and country)\n\n5. What was your father's name and occupation?\n\n6. How did you come to Saskatchewan? (Give month and year)\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n\n8. How old were you when you first came to Western Canada? (You do not need to sign.)\n\n9. What were your reasons for coming West?\n\nThe land they had in Ontario wasn't small and lonely and my father wanted more land for his children.\n\n10. How did you learn about the West? (Through other people? Reading about it?)\n11. What did your friends and relatives think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   I travelled with my immediate family.\n\n13. What means of transportation did you use?\n   Two oxen and a pony, drawing three red river carts.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.).\n   My brother, who was driving, accidentally slipped, frightening the pony. It ran away upsetting the cart. My mother suffered from three broken ribs and my dad a broken collarbone.\n   We camped at the site of Saskatoon on the way and it consisted only of a few buildings.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   We stayed in a tent six miles north of the present town of Carlton.\n\n16. Where did you settle or take up land?\n   On the East Half of Section 23, Township 45, Range 4 west of the 3rd.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   When I was first married I lived in Silvergrove for three years then we moved to present location one mile from where my parents took up land.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   I lived on a farm all my life.\n11. What did your friends and relations think of your decision to come to Western Canada?\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nI traveled with my immediate family.\n\n13. What means of transportation did you use?\n\nTwo oxen and a pony, meaning three and four carts.\n\n14. What incidents of the journey best do you remember? (People you met on the way, etc.)\n\nMy brother, who was driving, mistakenly slipped, frightening the pony. It ran away, upsetting the cart. My mother suffered from this collapse, and my and a friend walked. We camped at the side of a stream on the way and I crawled under a building.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nWe stayed in a tent not far from the present town of Barton.\n\n16. Where did you settle or take up land?\n\nOn the east half of section 28, Township 45, Range 3.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\nWhen I was first married I lived in a pioneer tent and then moved to a house built by my parents.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nI lived on a farm all my life.\n19. How often did you write to relatives or friends in your old home?\n\nWe wrote quite regularly in the early days; however, correspondence has dropped during the past years.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nCharles Henry Kallfleisch, February 12, 1897 at Wingard Anglican Church.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nDuring the Red Rebellion we had to close up our home and move to Fort Prince Albert, where we lived in a house with five other families. On our return home we found that the Indians had taken Mother's prize possession, her sewing machine, down into the ravine and, as we learned later from a neighbor who tried to \"make music\" with it. A doll I had left behind was minus an arm and a leg, but I had taken my favorite doll with me and I still have her although her clothing (made from goods purchased in Fort Carlton) is getting very ragged. We also found that our cows were missing, one had been butchered but the other had just been driven off and we retrieved her later on.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nWe traveled quite a bit especially after Fort Carlton was burned in the Rebellion so we had to go to Prince Albert for shopping. This trip took four days. We also took our grain to Prince Albert (a trip of fifty miles.) We traveled with horses and wagon.\n29. How often did you write to relatives or friends in your old home?\n\n30. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nCharles Henry Kalbfleisch, January 12, 1897\n\n21. Did anyone else come to Sandusky because of your recommendation? It was a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nOur family had moved to Fort Prince Albert, where we lived for several weeks until we found shelter with families who took us in. We were very poor at first, but eventually we managed to earn a living by working on farms and doing odd jobs. We also found that the people here were very friendly and helpful.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? By what means of travel?\n\nFor ten years we traveled quite a bit especially after we bought a horse and buggy. We used our buggy to go to Prince Albert for shopping. The trip took three hours each way. We also made trips to Prince Albert (a trip of fifty miles). We traveled with horses and wagons.\n25. When was the first car used in the community?\n   In September 1911.\n\n26. If you owned a car before 1912, when did you buy it? What make?\n   1912. It was a Ford.\n\n27. Where was your trading center? How far from your home?\n   After the railway came through we traded at Duck Lake and later at Carlton. Duck Lake is 16 miles. Carlton is 5.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n\n29. How often did you shop in the early days?\n   In winter we shopped about twice a week; in summer every two weeks. This was due to the fact that we bought grain in winter.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   In 1912, the Saskatchewan Govt. Telephones.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We intended to stay.\n25. What was the first car used in the community?\n   In December 1911.\n\n26. If you purchased a piano, what make?\n   It was a Ford.\n\n27. Where was your traveling done? How far from your home?\n   After the railway came through our town at 1911.\n\n28. Did you continue to travel by horse and buggy or by car?\n   Better means of travel, etc.\n\n29. How often did you shop in the early days?\n   On Sundays we shopped at the local store.\n\n30. When (if ever) did people in your district start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   In 1912, the Saskatchewan Bell Telephone Company.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   We intended to stay.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\n35. Did many people move away during the 1930's? Did many return?\nNot in this district\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nFrom the origin of the Carlton Post Office until 1914 we had it at our home. My husband was a Justice of the Peace, Municipal Councillor, Weed Inspector, Fire Arranger, and School Trustee. He was an active Mason and took great interest in Young People's organizations. I was Treasurer of our branch of the W.I. from 1915-1935. My husband also organized the Wheat Pool in this district.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nCarlton, Carlton S.D. and Carltonading S.D., after the old Fort Carlton.\n34. Did any people move away from your district prior to 1921? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? If so, why?\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention all here, giving dates wherever possible.\n\nMy uncle held office at the post office and was a Justice of the Peace, Municipal and School Trustee. He was an active Mason and Knight Templar. He was also organizer of the Young People's organization. I gave him credit for organizing the first lodge, etc., etc.\n\n37. If you or any of your family or friends were interested in having data wherever possible, do something in the district meeting in June. Giving data wherever possible, (such as owning the first automobile, building, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names since the first name was given; (5) date and reason for change. Give facts of every name as above in (1), (2), (3).\n\nBarton's Barton S.B. and Barton siding d.S., after the old Bartolom siding d.S.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? ....... (Indicate your preference, if any) ................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nChildren\n\nAnnie Lamb, Vancouver B.C., Housewife\nEthel Trude, Saskatoon, Sask., Nurse\nEarl Killibrew, Carlton, Sask., Farmer\nPaul Kinn, Edmonton, Sask., Housewife\nEva Price, Calgary, Alberta, Housewife\nCharles Killibrew, Carlton, Sask., Farmer\nDoris Killibrew, three others, Sask., Nurse\nEva Trude, Saskatoon, Sask., Housewife\nDiana Price, Calgary, Alta., Housewife\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe great improvement in Roads.\nThe coming of the railroad. The Telephone system. Our recent installation of electricity.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nLora Trude\n512 5th Ave SE\nSaskatoon, Sask.\nWould you or the person who owns the property be willing to lend them to the Provincial Archives for study?\n\n(1) Yes\n(2) No\n\nIf yes, please provide the following information:\n\nName:\nAddress:\nPhone number:\nEmail address:\n\nIf no, please explain why:\n\n45. If you have children or grandchildren, please give their names, where they live, and any other relevant information.\n\n46. What do you think are the most important changes in your community since you first came here?\n\n47. The greatest improvement in your community would have been the construction of the railroad. It has improved transportation.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below:\n\n[Signature]\n\n[Printed name]\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1882_374SarahAnnKalbfeisch.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 22, "total-input-tokens": 36520, "total-output-tokens": 5161, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 0, 5], [0, 53, 6], [53, 2029, 7], [2029, 3953, 8], [3953, 5166, 9], [5166, 5869, 10], [5869, 7225, 11], [7225, 8394, 12], [8394, 10175, 13], [10175, 11465, 14], [11465, 12810, 15], [12810, 13952, 16], [13952, 15394, 17], [15394, 16730, 18], [16730, 18292, 19], [18292, 19107, 20], [19107, 19262, 21], [19262, 19416, 22]], "primary_language": ["None", "None", "None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]