[{"id": "45d615ea9c61905682a39e1d8522ede847d52aaf", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES.\n\nNO. 4.\n\nPIONEER CHURCHES.\n\nPlease print name and address in capital letters.\n\nYour full name __________________________\n\nPresent Address __________________________\n\nPioneer Address __________________________\n\nYear you came to Saskatchewan ________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank.\n\nWe realize that anyone answering this will not be able to answer all questions accurately, but we urge you to try to answer as many as possible, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are presented in the Saskatchewan Archives as part of the permanent records of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE.\n\nNO. 4.\n\nPIONEER CHURCHES.\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\n\nPresent Address ____________________________\n\nPioneer Address ____________________________\n\nYear you came to Saskatchewan ______________\n\n(Throughout the questionnaire \"Saskatchewan\" means the area which is now Saskatchewan.)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nWe realize that any one person will not be able to answer all questions, so answer those that apply to your experience first, then go on to others.\n\nUse extra sheets of paper if there is not enough space on this questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated.\n\nTo Pioneers interested in the history of their church or congregation, this questionnaire will be of special interest.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n1. To what religious services did you go when you first settled in your district? Church and school. How did you know? As offered by Mr. Tait.\n\n2. How long was it after the first settlers came to your area before services of church worship were organized? 1905-1916.\n\n3. By whom were religious services held in your community before a regular church became established (by a clergyman from some other place, etc.)? Give details of the arrangement, telling where services were held, and give dates if possible.\n\n4. How was the clergyman supported?\n\n5. Was the school house used for church services? Yes\n\n6. Was it used by congregations of more than one denomination on alternate Sundays?\n\n7. Did the same congregation ever support both types of services and give equal financial support?\n\n8. Where did the clergyman (or clergyman) live, and how far was it from the school house?\n\n9. How did he get to the school house to conduct services?\n\n10. Was he entertained in homes or supplied with accommodation for the night? No\n\n11. Were services continued throughout the winter months, as well as other seasons of the year? Yes\n\n12. Who put on the fire for school house services in winter?\n\n13. What other charges, or appointments, did the clergyman have besides the one at your school house?\n\n14. Describe financial arrangements.\n\n15. Were homes or other buildings such as stores used for church services in your community? No\n\nDescribe the arrangements.\n1. To what religious services did you go when you first settled in your district? Where did your neighbors go to church?\n\n2. How long was it after the first settlers came to your area before services of church worship were organized? By whom were religious services held in your community before a regular church became established (by a clergyman from some other place, etc.)? Give details of the arrangement, telling where services were held, and give dates if possible.\n\n3. Was the school house used for church services? Give dates. Was it used by congregations of more than one denomination on alternate Sundays? Did the same congregation ever support both types of services and give equal financial support? Where did the clergyman (or clergymen) live, and how far was it from the school house? How did he get to the school house to conduct services? Was he entertained in homes or supplied with accommodation for the night? Were services continued throughout the winter months, as well as other seasons of the year? Who put on the fire for school house services in winter? What other charges, or appointments, did the clergyman have besides the one at your school house?\n\n4. Were houses or other buildings such as stores used for church services in your community? Describe the arrangements.\n5. If you had a church building, give the date it was built.\n\nWho designed the building?\nWho built it?\nWhat material was it made of?\nHow many people did it seat?\nWhat was the name and denomination of the church?\n\n6. Describe the steps taken in arranging for the building of the church, telling who started it, how money was secured, etc.\n\nHow many families were in the congregation?\n\n7. Describe any make-shifts or savings resorted to in the building of the church, and in securing furniture and supplies for it.\n\n8. Is this first building still in use?\nIf not, tell why it is not used now, and what happened to it.\n\n9. When did you have a resident clergyman?\nWhere did he come from?\nWhat provision was made for living quarters for him—a residence built, etc.?\n\n10. Did any other denomination use this church building for services?\nDescribe the arrangement.\n\n11. Tell what other churches were built in your community, either before your church was built, or any time since. Give dates if possible, the denomination of church, and any changes which have occurred in the use of the building; that is, if some denomination other than the one who built it is now using the church, or if it is used for some other purpose.\n\nAre all these churches in town? If not, give distances from town and from one another.\n\nIf not built in town, why were they not built there?\n5. If you had a church building, give the date it was built.\n\nWho designed the building?\nWho built it?\nWhat material was it made of?\nHow many people did it seat?\nWhat was the name and denomination of the church?\n\n6. Describe the steps taken in arranging for the building of the church, telling who started it, how money was secured, etc.\n\nHow many families were in the congregation?\nDescribe any make-shifts or savings resorted to in the building of the church, and in securing furniture and supplies for it.\n\n8. Is this first building still in use?\nIf not, tell why it is not used now, and what happened to it.\n\n9. When did you have a resident clergyman?\nWhere did he come from?\nWhat provision was made for living quarters for him—a residence built, etc.?\n\n10. Did any other denomination use this church building for services?\nDescribe the arrangement.\n\n11. Tell what other churches were built in your community, either before your church was built or at any time since. Give dates if possible. Your denomination of church, and any changes which have occurred in the use of the building, that is, if some denomination other than the one who built it is now using the church, or if it is used for some other purpose.\n\nPresbyterian—Not House New\n\nAre all these churches in town? If not, give distances from town and from one another. If not built in town, why were they not built there?\n12. Has your church established as a home mission? Describe the arrangements as to finance, student ministers, etc.\n\n13. If families did not have a church of their own denomination in the community, did they usually go to some other church, or not attend at all? Explain, work to church, what ever\n\nDid you have any special religious service of some kind in the house if they could not go to church, or if there was no public religious service?\n\nIf families had been attending and supporting a church other than their own denomination, or had not attended because their own church was not present, how well did they support their own church if it became established in their community at a later date?\n\n14. How often and at what time were services held in the church, school or other building? Every Sunday\n\n15. Did laymen conduct church services when a clergyman was not available? Describe the circumstances.\n\n16. Did you have an organ for the service? Who played it? When was it bought? How was the money raised for it? Each one donated money for\n\n17. Did you have a choir? Who started it? Were any of the persons who led the choir or sang in it trained musicians? Explain.\n\n18. Was any other kind of music or musical instrument used in the service? Describe.\n\n19. What kind of religious instruction for the young, such as Sunday School or catechism classes, were held? Give dates when they were started. How often were they held? Every Sunday\n\nHow many children attended? Who was in charge of these and helped with the teaching?\n\n20. What organization (or organizations) was formed to help with the support of the church? What year was it started? How often did it meet? How many women or men belonged to it?\n12. Has your church established as a home mission? Describe the arrangements as to finance, student ministers, etc.\n\n13. If families did not have a church of their own denomination in the community, did they usually go to some other church, or not attend at all? Explain.\n\nDid you have any special religious service of some kind in the home if they could not go to church, or if there was no public religious services?\n\nIf families had been attending and supporting a church other than their own denomination, or had not attended because their own church was not present, how well did they support their own church if it became established in their community at a later date?\n\n14. How often and at what time were services held in the church, school, or other building?\n\n15. Did laymen conduct church services when a preacher was not available? Describe the circumstances.\n\n16. Did you have an organ for the services? Who played it? When was it bought? How was the money raised for it? Were any of the persons who led the choir or sang in it trained musicians? Explain.\n\n17. Did you have a choir? Who started it? How many were in it? When?\n\n18. Was any other kind of music or musical instrument used in the service? Describe.\n\n19. What kind of religious instruction for the young, such as Sunday School or catechism classes were held? How often were they held? How many children attended? Who was in charge of these and helped with the teaching?\n\n20. What organization (or organizations) was formed to help with the support of the church? What year was it started? How often did it meet? How many women or men belonged to it?\n21. In what year was the first church picnic held? Answer 1910.\n\nWhere?\n\nDescribe the church picnics of early days, telling how many attended, what you had to eat and drink, what amusements there were, changes which occurred in later years, and any other data which you think will be of interest. Give the information here.\n\n22. In what year was the first fowl supper or bazaar held? Answer\n\nWhere?\n\nWas it held every year after that?\n\nWhat differences do you notice between the dishes served at the suppers in the early days, and those served now?\n\nWhat differences are there in serving methods (help yourself, plates served already filled, etc.)?\n\nWhat changes are there in the price of suppers?\n\nDescribe any changes which you have noticed in the needlework offered for sale, in type or articles bought, those that were most popular at various times, changes in prices, or any other details which you may remember.\n\nWas a concert of some kind held in connection with the suppers or bazaars in the first years of Deactive?\n\n23. Describe any other activities that were carried on to assist in raising money for the church.\n\n24. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n25. Was any plan of systematic giving for the support of the church and clergyman adopted?\n\nOf what nature—weekly envelopes, etc.?\n21. In what year was the first church picnic held? Answer: 1910\n\nWhere? School\n\nDescribe the church picnics of early days, telling how many attended what you had to eat and drink, what activities there were, and any other details about them which you remember.\n\nRecreation Questionnaire dealing with picnics, or if you wish to give the information there, you need not repeat it here.\n\n22. In what year was the first foul supper or bazaar held? Answer:\n\nWhere?\n\nWas it held every year after that?\n\nWhat differences do you notice between the dishes served at the suppers in the early days, and those served now?\n\nWhat differences are there in serving methods (help yourself, plates served already filled, etc.)?\n\nWhat changes are there in the price of suppers?\n\nDescribe any changes which you have noticed in the needlework offered for sale, in type or articles bought, those that were most popular at various times, changes in prices, or any other details which you may remember.\n\nWas a concert of some kind held in connection with the suppers or bazaars in the first years? Describe.\n\n23. Describe any other activities that were carried on to assist in raising money for the church.\n\n24. Name any other organizations or meetings associated with the church, telling when they were started, how often they met, and their purpose and activities.\n\n25. When was any plan of systematic giving for the support of the church and clergyman adopted?\n\nOf what nature, - weekly envelopes, etc.?\n26. What interest or activity was there in the support of home missions?\n\nForeign missions?\n\n27. How did some of the people have to travel to church service?\n\nWhat means of travel was used?\n\n28. What nationalities were represented in the congregation, and in approximately what proportion?\n\n29. Were there special revival or mission services in the early days?\n\nDescribe.\n\n30. What arrangements were there to provide for the training of clergy?\n\n31. What differences did you notice in church life on the prairies as compared with the community you came from?\n\n32. To what extent did the social life of the community centre around the church service (held in church, school or other building) in the early days?\n\n33. Is the church as important a place now of people gathering together for companionship and sociability as it was in the early years?\n\nExplain.\n\n34. Is the first membership roll of your church still in the community?\n\nIf you can, give the name of the person who has it.\n\nDo you have any pictures or photographs of your earliest church or of homes where the first services were held, or do you know of anyone who has such pictures?\n\n35. Describe any special features or unusual incidents of pioneer churches, or anything connected with it which you found interesting, not already mentioned. (Use other sheets or back of this sheet if necessary).\n26. What interest or activity was there in the support of home missions?\n\n27. How far did some of the people have to travel to church service? \n\n28. What nationalities were represented in the congregation, and in approximately what proportion? \n\n29. Were there special revival or mission services in the early days? \n\n30. What arrangements were there to provide for the training of clergy? \n\n31. What differences did you notice in church life on the prairies as compared with the community you came from? \n\n32. To what extent did the social life of the community centre around the church service (held in church, school or other building) in the early days? \n\n33. Is the church as important a place now of people gathering together for companionship and sociability as it was in the early years? Explain. \n\n34. Is the first membership roll of your church still in the community? \n\nIf you can, give the name of the person who has it. \n\nDo you have any pictures or photographs of your earliest church or of homes where the first services were held, or do you know of anyone who has such pictures? \n\n35. Describe any special features or unusual accidents or pioneer churches, or anything connected with it which you found interesting, not already mentioned. (Use other sheets or back of this sheet if necessary).\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.12-PioneerQuestionnairesMisc_Box13002_3548.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 4221, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1219, 5], [1219, 2378, 6], [2378, 3827, 7], [3827, 5125, 8], [5125, 6485, 9], [6485, 7871, 10], [7871, 9584, 11], [9584, 11209, 12], [11209, 12625, 13], [12625, 14108, 14], [14108, 15467, 15], [15467, 16777, 16], [16777, 16932, 17], [16932, 17086, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]