[{"id": "c4de30dc80f351baeae66d02918c04e77e9ab71f", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRES,\nNo. 5\nPioneer Recreation and Social Life.\n\n(Drawing by Richard Craburn)\n\nPlease print name and address in capital letters.\n\nYour full name ____________________________\nPresent Address ____________________________\nPioneer Address ____________________________\nYear you came to Saskatchewan ________\n\n(Throughout the questionnaire, \"Saskatchewan\" means the area which is now Saskatchewan)\n\nPLEASE NOTE\n\nThis questionnaire is intended for persons who came to Saskatchewan before 1914, and most of the questions are about that early period, although in a few questions information for later years is asked for.\n\nIf you cannot answer a question, leave the space blank. We realize that any one person will not be able to answer all questions, so answer those that apply to your experience and that you can remember, and leave the others.\n\nUse extra sheets of paper if there is not enough space on the questionnaire.\n\nYour co-operation in answering this questionnaire will be very much appreciated, and all questionnaires are preserved in the Saskatchewan Archives as part of the permanent record of our province.\n\nPlease send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nPioneer Recreation and Social Life\n\nNEIGHBORLY VISITING, PARTIES, ETC.\n\n1. In the first few years, how many homes were near enough to you for visiting back and forth? (3 or more—about 12 near neighbors)\n\nHow many of these were bachelor's homes? (8 of the 12 above)\n\n2. How often did you usually visit neighbors? (as often as necessary for work, or borrowing and every Sunday—wanted someone to come)\n\n3. Did you usually visit on a Sunday, or other days? (yes and we only visited during fall games etc., and in the winter parties & suppers)\n\n4. Were you often invited to other homes, or was most visiting done without an invitation? (most done without invitations but married home made special invited occasions)\n\nWhat time of the day did you go—in the morning and spend the day, or in the afternoon, etc.? (in the summer or the evening or at meal time—everyone was there except special occasions)\n\nWhat about meals? Did you stay when not invited beforehand? (you never were let go if you happened to be around meal time)\n\nHow was the invitation to a meal worded when people had come unexpectedly? (that is, was the term \"take potluck\" used, or was some other expression common?) (potluck was a common saying or welcome to what we got)\n\nIf no meal, what other refreshment might be offered to visitors who had \"dropped in\"? (American and coffee—English and tea—never saw liquor for years)\n\n5. Did the whole family go, or did someone stay home to \"look after the place\"? (no everyone was always welcome—we had no children except two families)\n\n6. Did you ever have \"bees\" when groups of neighbors came together to put up a building, make quilts, or other such activity? (yes if anyone had a misfortune or sick or a big job like log building)\n\nTell what you remember about such gatherings, giving dates if possible, telling what the \"bees\" were for, and how often they occurred. (an English family of children—a big log house—they had a fire 1907, put up the shell in two groups in two days also put in some shop—nigger got thrown from house took off his cap—later running cement for mudhouse)\n\n7. In the earliest years that you were here, were there many parties, whist drives or dances in homes? Describe. (not many home dances until homes got larger 1914 and later schools were then getting built—parties with program Committee songs recitations—plays—debate—mock trials—mock weddings—and contests—programs divided district each put on a nights entertainment)\n\nWere these more frequent in later years? Give dates. (the ones I judge the best no after 1914 more dances or card parties)\n\nDid you follow any kind of informal schedule, such as going by turn from one home to another at definite times, —every two weeks, once a week, once a month, etc.? (we usually took invitations in advance—we selected the best suitable homes—every year was open and welcome but some home too small or too far away—no need a regularly elected Committee to arrange)\n8. Tell what was made of the school house for community dances, box socials and other activities. (Include also the school Christmas tree, pionios, etc., if you have not described these on the School Questionnaire). Give dates.\n\n9. When was your first community hall built? What material was it made of? How large was it? Who built it - the community through special funds, the municipality, some organization, etc.? Was it built in the village or town, or was it a country hall?\n\nTo what extent did it take the place of homes or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, or were you close enough to make use of the hall for all gatherings, etc.) For local district things we used the school. But for Chatsworth or big things they went to the hall in town.\n\n10. When parties, dances, etc. were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend? How were babies and small children provided for? How were horses sheltered and fed in the winter time at these parties?\n\n11. What card games were popular in the early days? Was there card playing for a prize? What dances were popular? Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n2.\n\n8. Tell what was made of the school house for community dances, how and why.\n\n9. What material was it made of?\n\n10. How large was it?\n\n11. Who built it - the community through special funds, the municipality, some organization, etc.? Describe.\n\n12. Was it built in the village or town, or was it a country hall?\n\n13. To what extent did it take the place of horse or the school house as a place for social gatherings and parties? (For example, if you lived in the country, did you continue to use the local school house for district gatherings, and come to the hall in town for other functions, etc.? If so, you close enough to develop an interest in the hall, but for Christmas or other things they went to the hall in town.)\n\n14. When parties, dances, etc., were held in homes, school houses or halls (as referred to in question 8, 9, and 10) did the entire family attend?\n\n15. How were babies and small children provided for?\n\n16. How were horses sheltered and fed in the winter time at these parties?\n\n17. How much money was spent on each party?\n\n18. What card games were popular in the early days?\n\n19. Was there card playing for a prize?\n\n20. What dances were popular?\n\n21. Was there ever any disagreement between dancing and non-dancing residents in the planning of parties and social gatherings? Explain.\n\n22. Was card playing accepted by all residents in the community, or were there some who frowned upon it, either as an entertainment in the home, or for community gatherings? Explain.\n\n23. How did we conduct ourselves at parties to promote safety?\n12. What attempts at formality, or \"swank\", do you remember in small towns, such as gloves and hats when calling, calling cards, visitors treated ceremonially in parlor, etc.? \n\n13. Was the chivaree known in your community? Yes. And some real stories.\n\nDescribe what you remember about chivarees, telling how common they were, any incidents connected with them, etc.\n\n14. Describe any other details of visiting parties, etc., that you remember, telling who attended, what was done not already mentioned that were popular at parties and give approximate dates whenever you can when some changes in visiting or social life became noticeable.\n\nOrganizations and Meetings:\n\n15. What was the name of the first organization of any kind that you can remember becoming established in your community? The Valley Progress Committee.\n\nGive the date and reason for being organized.\n\n1907 we started to organize the school district and built the school in 1910.\n\n16. Was there a Saskatchewan Grain Growers local in your community? Yes.\n\nTell when it was organized, and what steps led to its organization.\n\n1915. Big thrive & Juniper\n\nApproximately what proportion of the farmers in the community belonged to it?\n\nHow many women belonged? How often did it meet?\n\nWhat were some of the activities carried on by this organization?\n\nThey finally backed a move to organize a Coop Store.\n\n17. Was there a Homemakers' Club in your district? Yes.\n\nWhen was it organized? About 6 years ago.\n\nApproximately how many women belonged to it?\n\nDescribe what you remember of its activities and services. They are quite active in sending young students to take courses and helps to different organizations. Helps pool committees. Co-ops, etc.\n12. What attempts at formality or \"snobbery\" do you remember in small towns, such as glove and hat shining, calling visits, visiting traveled ceremonially, etc.? \n\n13. Was the obverse known in your community? How did you react?\n\nDescribe what you remember about obverses, telling how common they were.\n\n14. Describe any incidents connected with them, etc.\n\n15. What was the name of the first organization of any kind that you can remember being organized in your community? Give the date and reason for its being organized.\n\n16. Has there been a Saskatchewan Grain Growers' Local in your community? If so, when was it organized, and what steps led to its organization?\n\n17. Has there been a Homemakers' Club in your district? When was it organized? How many women belonged?\n\nWhat were some of the activities carried on by this organization?\n\n18. Describe what you remember of its activities and services. They are important in describing your community's welfare and help to different organizations.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was first organized, its activities and purposes, who belonged (men, women, young people?), whether it included people only in one relatively small area (for example, within a school district), or was centred in the town or village and included the surrounding community. (There is space in the church questionnaire for organizations connected with the church, so they need not be included here).\n\nWe are only 6 miles from the town of Saskatoon and many of the undertakings there, we contribute help if we had church organization and helped with the co-op store. We also had a very active agricultural fair. We helped with a community hall memorial cairn skating rink.\n\nWhat means were commonly used by organizations for raising money? canvass by subscription.\n\n19. Where did various organizations hold their meetings?\n\nIn a hall in town\n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? Describe, telling who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\nRemember Bracken giving a good address on land culture about 1910. Held in mission hall. We had many minor talks with lantern slides etc.\n\nDid you often have magic lantern shows? Twice. Give dates if possible. 1909.\n\nWho provided the lantern and the slides? A neighbor who had been in Yukon. He borrowed the lantern from a minister and got some slides to help out.\n\nWhat were the slides about? The gold rush and the north country. Some missionary slides.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (-mumbletypeg, ball, marbles, fly kites, etc.)? We had swings + letters at school marbles ball our school was near a slough and rafts and wet clothes were common.\n\nWhat games did girls play in summer (-skipping rope, play house, etc.)? The most of the girls could do anything the boys tried. But one of them is in China as a missionary.\n18. Name any other organizations that were in existence in your community before 1914, giving the name of each, date when it was organized, original purpose, who belonged (men, women, children), approximate number of members, whether it included all races and purposes, or only in one relatively small area (for example, within a school district), or was centered in the town or village and included the surrounding community. (There is space in the church questionnaires for organizations connected with the church, so they need not be included here.)\n\nWe are only a little from the town of Ashland.\n\n19. Where did various organizations hold their meetings? In a hall, in town hall, in church, etc.? \n\n20. Were you accustomed to having general information lectures, talks on foreign lands, etc.? \n\nDescribe talking who gave them (local ministers or teachers, special lecturers, etc.), where they were held, how well they were attended, and any other details you remember about them.\n\n*Remember Broken Feather's good deed on land in town about 1910 held in town hall.*\n\nDid you often have magic lantern shows? Who provided the lantern and the slides?\n\nWhat were the slides about? The gold rush and the mule skinners.\n\nCHILDREN'S GAMES\n\n21. What games did boys play in summer (jump rope, marbles, fly kites, etc.)? We had skipping rope, marbles, and softball.\n\nWhat games did girls play in summer (jump rope, play house, etc.)?\n\nThe most of the girls could do anything the boys tried. But one of them is in church as a missionary.\n22. What winter games were played outside - fox and hounds, skating, etc.? \n\nDid the whole family join in such games, or only the children? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrowheads, gophers or other objects or animals, or games in the snow? Describe.\n\nPICNICS AND SPORTS.\n\n25. What was the date of the first picnic that you attended in Saskatchewan? Give year and month if possible.\n\n26. Who organized it?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did families and friends form smaller groups?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last?\n22. What winter games were played indoors - fox and hounds, skating, etc.\n\nDid the whole family join in such games, or only the children? Explain.\n\nWas there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n23. Was there much time for games, or was everyone usually busy with some kind of work? Explain.\n\n24. Did children invent games connected with such things as buffalo bones, arrows, beads, quillwork, or other objects or animals? Or games in this sort? Describe.\n\n25. What was the date of the first picnic that you attended in Saskatchewan?\n\nGive year and month if possible.\n\n26. Who organized it? How was it arranged?\n\n27. Was it for the entire community, or for a smaller group, such as a school district, Sunday school, some organization, etc.?\n\n28. Was it the first picnic held in the community?\n\nIf not, do you know the date of the first one that had been held?\n\n29. What were the amusements at the picnic you attended (ball games, races, band, etc.)?\n\n30. What arrangements were made for eating - was there a general lunch, or did each family bring something, and eat it together?\n\n31. What did you have to eat and drink?\n\n32. What time of the day did it start, and how long did it last? Estimate.\n33. Describe any features of this picnic which you remember as outstanding.\n\nA young English man dressed as a lady was a scream! An Indian chief was very good also & funny. The young lady from Chicago a teacher was so captivated she took pictures all afternoon and finally returned to our valley and took one of the teachers for a husband.\n\n34. Describe any different kinds of picnics which you knew of in the early days, such as the large community picnic, school or Sunday School picnics, family picnics, etc., Tell about any differences in numbers attending, activities, food and drink, when held, etc.\n\nOur picnics at first were like a big family gathering but gradually attendance increased until they became more of a sporting day. We had attractions, a walking race, obstacle race, relay race on horseback. When cars started to come, we had car driving races, cigarette races, needle thread races. We were then about 1930 when the whole school went to a resort 15 miles away for a whole day outing, new to picnics.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n1907 everybody had a good time and helped make it a good time for everyone else. 1912 cars were very popular from distance and they came to be entertained. 1930 no one bothered. 1938 - on big sport and go long distance for big advertised commercial sports.\n\n36. Describe the sports which were popular in your community in the early years, telling who took part in the various games and sports (men, women, mostly young people).\n\nIn the early days football was our game and the older men came out also the women came and visited and hollered. Then we started tennis for grown ups. Also croquet. Then we started baseball and hockey in the winter with snow skating.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1907 How long did it continue? Several years\n\n38. Name any other sports teams that were organized before 1914, giving date of organization if possible, and tell something of their activities - played against teams from neighboring towns, played at local sports days, entered in competitions in larger centres, etc.\n\nBaseball 1909, just played against neighboring team also against town team on several occasions, also played at picnics and sports days.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n\nNow has a curling rink and skating arena.\n33. Describe any features of this picnic which you remember as outstanding.\n\n34. Describe any different kinds of picnics which you know of in the early days, such as the large community picnics, school or Sunday School picnics, family picnics, etc., and tell about any differences in numbers attending, activities, etc.\n\n35. What changes have you noticed in picnics since the first years? If possible, give dates when changes became noticeable.\n\n36. Describe the sports which were popular in your community in the early years, per big advertised event commercial sports.\n\n37. For what game was the first team organized in your community to play against neighboring teams?\n\nWhat year? 1909\n\nHow long did it continue?\n\n38. Name any other sports teams that were organized before 1924, giving date of organization if possible, and tell something of their activities, played against teams from neighboring towns, played in competitions in larger centres, etc.\n\n39. Tell when the first outdoor rink was built in your community, and what it was used for (hockey, curling, etc.).\n\nWhen was the first indoor rink built, and what was it used for?\n40. When did an annual \"sports day\" become established in your community?\n   Did it grow out of or replace the earlier community picnic?\n   Who was responsible for starting the first sports day?\n   When was the sports day usually held? (what month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have become members of well-known hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many books you brought, and what kind.) (Use extra sheets if necessary)\n\nRalph Connor and the Bible\nI can not remember\n\n43. How many of your neighbors brought books with them?\n   What kind of books and how many?\n\nmost of the neighbors came west to make a home and get rich. Our reading was second or third and minor interest only.\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school? Give details and dates.\n\nyes we had a traveling library also a school library\n\n48. Was there a school library? yes When was it begun? 1910\n   To what extent were books borrowed from the school library for adults to read at home?\n   I have no records\n\n49. Did parents ever use their children's school text books as additional reading material?\n   They may have. I know I have often perused the children's text books.\n40. When did an annual \"sports day\" become established in your community?\nDid it grow out of or replace the earlier community picnic?\nWho was responsible for starting the first sports day?\nWhen was the sports day usually held? (What month, or any special day, such as May 24th or July 1st).\n\n41. Are there any from your community who have been members of hockey, ball or other teams? Give names, and dates.\n\nREADING\n\n42. What books did you bring with you when you came west? (Give a list of the names and authors if possible. If not, tell as nearly as you can how many you brought, and what kind.) (Use extra sheets if necessary)\n\n43. How many of your neighbors brought books with them?\nWhat kind of books and how many?\n\n44. To what extent did you exchange books with neighbors?\n\n45. Did you buy many books after you came west? Give details.\n\n46. What books were sent to you as gifts in early years?\n\n47. Have you ever had any \"travelling library\" books in your community or school?\nGive details and dates.\n\n48. Was there a school library? (Give dates.)\n\n49. Did parents ever use their children's school text books as additional reading material?\n50. Has there ever been a community library in your district or town?\n   When was it started? Who started it?\n   Is it still in existence?\n   If not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you stopped certain subscriptions and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n   Give dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\n50. Has there ever been a community library in your district, or town? Yes/No\n\nWhen was it started?\n\nIs it still in existence?\n\nIf not, when was it discontinued, and why?\n\nGive any other details which you can about the library - how many books it contained, how many people used it, where it was kept, who acted as librarian, and what arrangements were made for borrowing books.\n\n51. What newspapers or magazines did you subscribe to when you first came to the west?\n\n52. Describe later changes in your subscriptions, telling why you subscribed to certain publications and added others.\n\n53. Did you ever obtain the free monthly Lady Aberdeen packages of reading material?\n\nGive dates and tell how and where you got them.\n\n54. What books or papers that you brought to the west with you do you still have?\n\n55. Did you find a lack of reading material or sources of information in your early days in the west a hardship? Explain.\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   Violin, Autoharp\n\n57. What instruments did any of your neighbors have?\n   Piano, Mandolin\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   Organ, Gramophone\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   Considerable. My wife brought a wealth of singing enjoyed by all and her family has followed in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Religious and catchy songs of the early 1900s.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   Yes, in the community.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? 1948\n   Who started it? Lorne Benedictson\n   How long did it continue? 4 years\n   How many were in it? As high as 20\n   Who was bandmaster? Lorne Benedictson\n   What instruments were included? A complete brass band\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n   I have come to live in the town and I was active in getting it going. We have had several sell out concerts and it has played at outside points on occasions. But just now it is dormant for lack of time by many of the players. We only have white shirts and black bow ties.\nMusical Entertainment\n\n56. What musical instruments did you bring west with you?\n57. What instruments did any of your neighbors have?\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your house entertainment in early years in the West? Describe.\n\nIn the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home?\n\nIn the community?\n\n61. Was \"Polk music\", or music of the country you came from, popular in your house or community? Explain.\n\n62. Did you ever make up any of your own songs? Or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? If so, who started it? When was it started? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nVoices only show white shrubs and black bow. This\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n   Violin, autoharp\n\n57. What instruments did any of your neighbors have?\n   Piano, mandolin\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n   Organ, gramophone\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n   Considerable my wife brought a wealth of singing enjoyed by all and her family has followed in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n   Yes, everyone sang or played even though some of the tunes & voices were hardly good\n\n60. What were some of the favorite songs in the home? Religious and catchy songs of the early 1900s\n   Irish songs\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n   Yes, in the community\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n   Yes, we put on a darky act one night and we had a stake off on nearly every one present\n\n63. Was there a band in your community? Not really. When was it started? 1948\n   Who started it? Lorne Benedictson\n   How long did it continue? 4 years\n   How many were in it? As high as 25\n   Who was bandmaster? Lorne Benedictson\n   What instruments were included? A complete brass band\nMUSICAL ENTERTAINMENT.\n\n56. What musical instruments did you bring west with you?\n\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? Religious and catchy.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? How long did it continue? Who started it? How many were in it? How high was it? Who was bandmaster? What instruments were included?\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\nConsiderable my wife brought a wealth of singing enjoyed by all and her family has followed in the community? (were there musical concerts, was there group singing at parties, etc.) Describe.\n\n60. What were some of the favorite songs in the home? Religious and catchy songs of the early 1900s.\n\nin the community? Irish recital.\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\nYes in the community.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\nAnd we had a take off on nearly every occasion.\n\n63. Was there a band in your community? Not really. When was it started? 1948\n\nWho started it? Lorne Benedictson\n\nHow long did it continue? 4 years\n\nHow many were in it? As high as 3\n\nWho was bandmaster? Lorne Benedictson\n\nWhat instruments were included? A complete brass band\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI have come to live in the town and I was active in getting it going. We have had several outdoor concerts and it has played at our side points on occasions. But just now it is dormant for lack of time by many of the players. No they only have white shirts and black bow ties.\n57. What instruments did any of your neighbors have?\n\n58. What musical instruments have you bought since you came to the west? Give dates, prices if possible, and tell where you bought them.\n\n59. How large a part did singing and other forms of music play in your home entertainment in early years in the West? Describe.\n\n60. What were some of the favorite songs in the home? In the community?\n\n61. Was \"folk music\", or music of the country you came from, popular in your home or community? Explain.\n\n62. Did you ever make up any of your own songs, or make up words to fit an old tune as a joke on somebody, or because of some special happening in the community? Explain.\n\n63. Was there a band in your community? When was it started? Who started it? How long did it continue? How many were in it? Who was bandmaster? What instruments were included?\n\nTell what you remember of its activities, how often practice was held, where, if members had uniforms, what events the band played for.\n\nI have come to live in the town and I am active in the band. We have had several also out concerts and it has pleased at all will points on 400 miles. But just now it is dormant for lack of time by many of the players.\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHobbies and Special Interests.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nWe have a man in our vicinity who has a wonderful collection of stones and curios, several hundred and is delighted if anyone visits his collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI kept a record for several years on the earliness of spring and the crop resulting.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nSomeone who is well-known we have several who is interested to a degree.\n\nGeneral\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nWe have had a number of accidents in our district; first a pioneer shot himself while carrying a gun on a plough to scare black birds off his crop. A ladler got killed in his pasture with his bull. A young man was drowned in a swimming hole another got shot by his own and recently a man was killed when his tractor overturned on him.\n64. Has anyone from your community become well known or famous in the national world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time, or snow, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page or extra sheets if necessary).\n64. Has anyone from your community become well known or famous in the musical world? Give names and dates and places of public appearances.\n\n65. Is music as important or less important in your community now as compared with the early days? What is the reason for this change?\n\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainments, sports, reading, music, pioneer days, not already mentioned.\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? \n\nGive details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\nWe have a man in our vicinity who has a wonderful collection of stones and curios, several hundred and is delighted if anyone visits his collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\nI kept a record for several years on the earliness of spring and the crop resulting.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nNone who is well known we have several who is interested to a degree.\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music of pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\n\nWe have had a number of accidents in our district; first a pioneer shot himself while carrying a gun on a plough to scare black birds off his crop. A bachelor got killed in his pasture with his bull. A young man was drowned in a swimming hole another got shot by his churn and recently a man was killed when his tractor overturned on him.\nHOBBIES AND SPECIAL INTERESTS.\n\n66. Do you have any \"collections\", such as stamps, stones, paintings, signatures, arrowheads, etc.? Give details of this collection, telling when you started it, how you became interested in it, any outstanding events connected with it, and a description of the collection.\n\n67. Did you make notes of the weather, time of arrival of birds, blooming time of trees, etc.? Explain.\n\n68. Describe other hobbies or special interests of yours not already mentioned.\n\n69. Is there anyone in your community who is well-known for any of these hobbies, or for others such as photography, bird-watching, etc.?\n\nGENERAL\n\n70. Describe any outstanding features or incidents of social life, games, entertainment, sports, reading, music or pioneer days, not already mentioned. (Use back of page, or extra sheets if necessary).\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.5-RecreationandSocialLifeQuestionnaires_Box12971_1905F-M_2036.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 36, "total-input-tokens": 59760, "total-output-tokens": 10269, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1266, 5], [1266, 1266, 6], [1266, 4210, 7], [4210, 4210, 8], [4210, 5847, 9], [5847, 7411, 10], [7411, 9124, 11], [9124, 10124, 12], [10124, 12219, 13], [12219, 13749, 14], [13749, 14875, 15], [14875, 16119, 16], [16119, 18721, 17], [18721, 19858, 18], [19858, 21454, 19], [21454, 22601, 20], [22601, 23540, 21], [23540, 24468, 22], [24468, 26222, 23], [26222, 27449, 24], [27449, 28994, 25], [28994, 29946, 26], [29946, 31638, 27], [31638, 32843, 28], [32843, 34611, 29], [34611, 35732, 30], [35732, 36853, 31], [36853, 37922, 32], [37922, 39414, 33], [39414, 40257, 34], [40257, 40393, 35], [40393, 40547, 36]], "primary_language": ["None", "None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, true, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]