[{"id": "cc7b4647d80a08c2d7ca49193b7d290696f297e1", "text": "SASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNO. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering the questionnaire:\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences others may prove impossible for you to answer, so don't worry about leaving blank spaces. The questionnaire is intended for persons who lived in Western Canada before 1911, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Past: What Did You Do?\" is still being circulated. If you have not already answered it and would be willing to do so, please put a check mark here.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires:\n\n- Pioneer health conditions\n- Pioneer social life, sports and recreation\n- Pioneer farming and churchwork\n- Pioneer education and churchwork\n- Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the Saskatchewan Archives Board Collection. Please send your completed questionnaire to:\n\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\n\n[Signature]\n\n[Signature]\nElliott, Mrs. Emma Elizabeth\nIndian Head, Sask. 1891\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\nNO. 2\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\nA METHOD OF EXPLAINING TO THE PERSON\nANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences or may prove incapable of answering all questions. It is not possible to ask your experiences in detail, but it is possible to give them in outline form.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1917, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives No. 1, entitled \"Pioneer Life: What Did It Mean?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\nAll questionnaires\n\nPioneer health conditions\nPioneer housing\nPioneer education and churchwork\nPioneer family experiences\n\nPreservation of Questionnaire\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent records of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Signature]\nEmma Elliott\nIndian Head, Sask.\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? It as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) how often? How far? By what means of travel?\n\n25. What was your first trip by train?\n3.\n\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, who?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\n23. Is there anything you would like to add about pioneer days that stands out in your memory?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How far? By what means of travel?\n\n25. What was your occupation?\n3. How often did you write to relatives or friends in your old home?\n\n19. How long have you lived in Saskatchewan?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell when they came and where they settled.\n\n23. Is there any particular experience of pioneer life that stands out in your memory which you would like to recount?\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often?\n\n25. By what means of travel?\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with his age.\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us when they came and where they settled.\n\n23. Tell us about your particular experiences or observations which you think will be of interest to others.\n\n24. Did you travel about much in your early years? (for business, attending church, visiting friends, etc.) how far? By what means of travel?\n\n25. Were you able to send money to your parents while living in Saskatchewan?\n25. When was the first car used in the community? It was about 1904.\n\n26. If you owned a car before 1914, then did you buy it or what?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n\nThen the Shiretco was called maga\n\nThen they\n\n29. How often did you shop in the early days?\n\nOnce a month some times twice a week\n\n30. Then (if ever) did people in your district first start going to town regularly on Saturdays?\n\nWe bought our own\n\n31. What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since then.\n\nWe bought our own\n\n32. When did you first have a telephone and what company provided it?\n\nIn 1914\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came in 1914\n\nI think I wanted to buy the money\n\nI want to buy the money\n\nI want to buy the money\n\nI want to buy the money\n\nI want to buy the money\n25. When was the first car used in the community? It was about 1904.\n\n26. If you owned a car before 1914, then did you pay taxes on that make?\n\n27. Where was your trading center? How far from your house?\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing.)\n\nThen the Shire was called maga\n\nWhen they traveled by oxen\n\nOnce a month some two\n\nPlanus\n\n29. How often did you shop in the early days?\n\n30. When (if ever) did people in your district first start going to town regularly?\n\nOn Saturdays\n\n31. What kind of articles did you buy in this way? (Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order during the period?)\n\nWe didn't have much money so we\n\nany change we was a good deal\n\nVoilà the family\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n\nI came in 1914\n\nThen I knew the moment\n\nI knew quickly you'd hear from me\n\nFor June 25 to July 1st\n34. Did any people move away from your district prior to 1920? What reasons did they have for moving?\n\n35. Did many people move away during the 1920s? Did many return?\n\n36. If so, or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"firsts\" to have or do something in the district or nation it is here given dates wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes it has undergone since the first name was given; (5) date and reason for change. Give facts of new name as above in (1), (2), (3).\n\nMy father was the first to have a telephone in early days. One of my oldest memories was when he bought a Western Electric set. It was a big deal at the time.\n\nThe town was named after the mayor who gave the name to it.\n34. Did any people move away from your district prior to 1930? What reasons did they have for moving?\n\n35. Did many people move away during the 1930s? Did many return?\n\n36. If yes or some members of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving date wherever possible. (Such as owning the first automobile, combining, organizing the first lodge, etc.)\n\n38. How did the places in your community get their names? (School districts, Post offices, villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in names after the first name was given; (5) date and reason for change. Give dates of new name as above in (1), (2), (3).\n\nThe town was named after Quick to Hop Down. The meaning was given by the name of the man who bought the land where the town was built.\nQuestions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe)\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf you have children or grandchildren, please give their names, where they live and occupations.\n\nWhat do you think are the most important changes in your community since you first came West?\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire for you.\n\nIf anyone else has filled in this questionnaire for you, please have this person sign here:\n\nMy Daughter\n\nMy Daughter That Sank\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12943_1891_514.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 24, "total-input-tokens": 39840, "total-output-tokens": 3564, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1674, 5], [1674, 3443, 6], [3443, 3443, 7], [3443, 3443, 8], [3443, 3443, 9], [3443, 3443, 10], [3443, 4161, 11], [4161, 4822, 12], [4822, 5535, 13], [5535, 6246, 14], [6246, 7437, 15], [7437, 8608, 16], [8608, 9810, 17], [9810, 10912, 18], [10912, 11923, 19], [11923, 11923, 20], [11923, 11923, 21], [11923, 11923, 22], [11923, 12069, 23], [12069, 12215, 24]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "None", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]