[{"id": "44f021c4079862a2ae1346b91daa2218a1539cea", "text": "PIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\n(Instructions: Please answer as many of these questions as you can and mail it to Saskatchewan Archives Office, University of Saskatchewan, Saskatoon, Sask. where it will be preserved as part of the permanent record of our Province.\n\nName: George C. Craig\nAddress: Athabasca\nBirthplace: Birth, Ayrshire, Scotland\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? 1932\nWhere did you set up housekeeping?\nWhere had you been living before that? At home with my parents\nFor how many people did you prepare meals?\nHow far was it to your nearest store?\nHow often could a visit be made to the store?\nWhat groceries did you usually buy in those earliest years?\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? Flour made in Saskatoon by mill owned by Archie McNaughton. It was called Champion\nIn what quantities did you buy it? Usually 500 or 600 lbs.\nWhat was the usual price per hundred pounds of white flour? $2.15\nHow much did you use graham flour? Rarely if ever\nWhole wheat flour?\nWas flour milled locally? Yes How far away? 20 miles What year? About 1925\nWhat was the price for a twenty pound bag of rolled oats? Don't know now\nWhat other grain products did you use?\nCornmeal? Yes Whole Wheat? Farina?\nOther?\nDid you grind your own wheat for porridge? No\nHow did you grind it?\n\nMy mother if she was living could supply much of the information you ask for, but as I was only 18 years of age at that time, I had no interest whatever in food except to eat it so price of anything in the food line never bothered me, as that was the problem of my father's mother.\nPIONEER DIET: WHAT DID WESTERN CANADIAN PIONEERS EAT?\n\nInstructions: Please answer as many of these questions as you can and mail us to:\n\nSaskatchewan Archives Office,\nBox 9500, Station Main,\nSaskatoon, Sask., S7K 5H6.\n\nName ____________________________\n\nAddress __________________________\n\nBirthplace _________________________\n\n1. INTRODUCTORY QUESTIONS\n\nWhat year did you start housekeeping in Western Canada? ________________\n\nWhere did you set up housekeeping? _______________________________________\n\nWhere had you been living before that? ____________________________________\n\nFor how many people did you prepare meals? ________________________________\n\nHow far was it to your nearest store? ______________________________________\n\nHow often could a visit be made to the store? ________________________________\n\nWhat groceries did you usually buy in those earliest years? ____________________\n\n2. FLOUR AND OTHER GRAIN PRODUCTS\n\nWhat brand of white flour did you use in the early years? ____________________\n\nIn what quantities did you buy it? Usually _______ lbs or _______ kgs. ________\n\nWhat was the usual price per hundred pounds of white flour? _______\n\nHow much did you use graham flour? ______________________________________\n\nWhole wheat flour? _____________________________________________________\n\nWas flour milled locally? ___________________________________________________\n\nWhat was the price for a twenty pound bag of rolled oats? ______________________\n\nWhat other grain products did you use? ______________________________________\n\nCornmeal? ______________________________________________________________\n\nOther? _________________________________________________________________\n\nDid you grind your own wheat for porridge? __________________________________\n\nHow did you grind it? _____________________________________________________\n\nMy mother if she was doing cloud supply needed my help. I heard no artificial substitutes in food age at Rev. End, I heard no artificial substitutes in food except to eat it in place of anything in the food line unless bothered me, so that was the problem of my father's mother.\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? Usually 200 lbs.\n\nWhat was the price for a ten pound sack of white sugar? 60¢\n\nWhat brand of golden corn syrup did you use? Butternut Rogers\n\nWhat size of tin of syrup did you usually buy? 10 lbs.\n\nAt what price? $5.50\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days? By owning cows.\n\nButter? Made at home. Eggs? Owned chickens.\n\nWhat was the price of butter? 25¢ per lb. How many eggs? 75¢ per dozen.\n\nDid you pack eggs for winter? Yes. How? Water glass.\n\nDid you make butter? Yes. Cheese?\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Antelope, deer, ducks, geese. Winter meat was always a store (frozen).\n\nHow did you get fresh meat? Bought some, traded for some, given by neighbors.\n\nHow often did you get fresh meat? Usually in the fall weather.\n\nHow did you preserve meat? Only with a house made very strong.\n\nWas there a \"beef ring\" in your neighborhood? Yes.\n\nIf so what year was it organized? About 1918.\n\nDid you use game? Yes. What kinds? Antelope, ducks, geese.\n\nFor how long? Still going but not as much.\n\nWhat part did fish play in the family diet? None.\n\nWas the fish fresh, cured, or canned? Any we got were canned.\n\nKinds? Canned salmon only.\n2.\n\n3. SUGARS AND SYRUPS\n\nIn what quantity did you buy white sugar? 60 lbs.\n\nWhat was the price for a ten pound sack of white sugar? $1.50\n\nWhat brand of golden corn syrup did you use? Blue Heart\n\nWhat size of tin of syrup did you usually buy? No. 8\n\nAt what price?\n\n4. DAIRY PRODUCTS\n\nHow did you get a supply of fresh milk in the early days?\n\nButter? Yes\n\nWhat was the price of butter? 25¢\n\nDid you pack eggs for winter? Yes\n\nDid you make butter? Yes\n\nWhat kind of cheese?\n\n5. MEAT AND FISH\n\nWhat was your meat supply in the early years? Antelope, venison, bear, fish\n\nHow did you get fresh meat? About every two weeks\n\nHow often did you get fresh meat? About every two weeks\n\nHow did you preserve meat? Only with a brief period, very shortly\n\nWas there a \"beef ring\" in your neighborhood? Yes\n\nIf so what year was it organized? About 1918\n\nDid you use game? Yes\n\nFor how long? Still hunting but not so much\n\nWhat part did fish play in the family diet? None\n\nWas the fish fresh, cured, or canned? None\n\nKinds? Ham, salami, pork\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black At what price? 9¢\n\nWhat kind of coffee did you buy? (beans or ground) Coffee Beans\n\nPrice? What other beverages were used? None\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping? 4¢\n\nCould you get potatoes at the store? Yes\n\nIf not, where from? Usually grown at home\n\nWhat year did you first grow your own supply for the winter of:\n\nPotatoes 1909 Cabbage 1909 Carrots 1909 Onions 1909\n\nTurnips 1909 Beets 1909\n\nIn what quantities did you buy white navy beans? 2 lbs\n\nHow did you buy prunes, (in bulk or by the box)? By the box\n\nWhat weight? 20 lbs How did the grocer handle prunes (by box)? Box\n\nWhat was the price of prunes? I forget\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, peaches, loganberries, raisins, currants or others)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying? No\n\npeas? corn? beans? Saskatoons?\n\nother foods?\n\nWhat year did you first preserve fruit by canning? Not before 1915\n\nWhat year did you first preserve vegetables by canning? Didn't do it yet\n\nWhat year did you first preserve meat by canning? Not yet\n\nDo you still preserve foods by canning or drying? Some\n\nTo what extent? Very little\n\nDid you make your own vinegar? No\n6. BEVERAGES\n\nWhat kind of tea did you buy? Black tea. At what price? I think about 40¢.\n\nWhat kind of coffee did you buy? (beans or ground) Coffee beans.\n\nPrice? \n\nWhat other beverages were used?\n\n7. VEGETABLES AND DRIED FRUITS\n\nWhat was the price of potatoes per bushel when you set up housekeeping?\n\nIf not, where from? Normally grown at home.\n\nCould you get potatoes at the store?\n\nThat year did you first grow your own supply for the winter of:\n\nPotatoes 1909\n\nCabbage 1909\n\nCarrots 1909\n\nOnions 1909\n\nTurnips 1909\n\nBeets 1909\n\nIn what quantities did you buy white navy beans?\n\nHow did you buy prunes, (in bulk or by the box)? By the box.\n\nWhat weight?\n\nHow did the grocer handle prunes (by box)?\n\nWhat was the price of prunes?\n\nWhat other dried fruits did you use in the earliest days? (apples, pears, raisins)\n\n8. PRESERVING\n\nIn the early years did you preserve any foods by drying?\n\nOther foods?\n\nWhat year did you first preserve fruit by canning?\n\nWhat year did you first preserve vegetables by canning?\n\nWhat year did you first preserve meat by canning?\n\nDo you still preserve foods by canning or drying?\n\nTo what extent?\n\nDid you make your own vinegar?\n9. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                  | Year you first remember seeing it in the store | How was it sold? - In bulk, 10 lb. sack, can, etc. | Amt. you usually bought at one time | Price of this amount |\n|-----------------------|-----------------------------------------------|---------------------------------------------------|------------------------------------|---------------------|\n| Soda biscuits         | 1906                                          | Bulk                                              |                                    | I have no idea at this time as to prices we paid so many years ago except flour which was milled in Sacketown I can't recall $12.15 per hundred I was called \"Champion\" |\n| Macaroni              |                                               |                                                   |                                    |                     |\n| Graham flour          |                                               |                                                   |                                    |                     |\n| Brown sugar           |                                               |                                                   |                                    |                     |\n| Molasses              |                                               |                                                   |                                    |                     |\n| Table salt            |                                               |                                                   |                                    |                     |\n| Common salt           |                                               |                                                   |                                    |                     |\n| Lily white syrup      |                                               |                                                   |                                    |                     |\n| Toilet soap           |                                               |                                                   |                                    |                     |\n| Baking powder         |                                               |                                                   |                                    |                     |\n| Baking soda           |                                               |                                                   |                                    |                     |\n| Dried peas            |                                               |                                                   |                                    |                     |\n| Dried corn            |                                               |                                                   |                                    |                     |\n| Vinegar               |                                               |                                                   |                                    |                     |\n| Raisins - seeded      |                                               |                                                   |                                    |                     |\n| - seedless            |                                               |                                                   |                                    |                     |\n| Rice                  |                                               |                                                   |                                    |                     |\n| Currants              |                                               |                                                   |                                    |                     |\n| Store jam - kinds?    |                                               |                                                   |                                    |                     |\n| Cheese (Cheddar or store cheese) | | | | |\n| Vanilla               |                                               |                                                   |                                    |                     |\n\n10. BAKING\n\nWhat type of yeast did you use? Royal yeast Cake\n\nDid you make yeast for your own use? No Using starter?\n\nUsing hops? Salt rising?\n\nDid you buy baking powder? Yes Baking soda? Yes\n\nCream of tartar? Yes Did you make your own baking powder? No\n9. Please fill in the following to the best of your recollection:\n\n| Food          | Year you first bought it in the store | How was it paid? - In bulk, sack, can, etc. | Art. You usually bought at this amount |\n|---------------|---------------------------------------|---------------------------------------------|----------------------------------------|\n| Soda biscuits | 1906                                  | Bulk                                        |                                        |\n| Macaroni      |                                       |                                             |                                        |\n| Graham flour  |                                       |                                             |                                        |\n| Brown sugar   |                                       |                                             |                                        |\n| Molasses      |                                       |                                             |                                        |\n| Table salt    |                                       |                                             |                                        |\n| Common salt   |                                       |                                             |                                        |\n| Lily white syrup |                                   |                                             |                                        |\n| Toilet soap   |                                       |                                             |                                        |\n| Baking powder |                                       |                                             |                                        |\n| Dried peas    |                                       |                                             |                                        |\n| Dried corn    |                                       |                                             |                                        |\n| Vinegar       |                                       |                                             |                                        |\n| Raisins - seeded |                                   |                                             |                                        |\n| Raisins - seedless |                                |                                             |                                        |\n| Flies         |                                       |                                             |                                        |\n| Currants      |                                       |                                             |                                        |\n| Store jam - kinda? |                               |                                             |                                        |\n| Cheese (Cheddar or store cheese) |               |                                             |                                        |\n| Vanilla       |                                       |                                             |                                        |\n\n10. Baking\n\nWhat type of yeast did you use? Royal Yeast\nDid you make yeast for your own use? No\nUsing starter?\nUsing hops?\nSalt rising?\nDid you buy baking powder? Yes\nBaking soda?\nDid you make your own baking powder?\nCream of tartar?\nDid you make your own cream of tartar?\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD                        | Earliest date it appeared on the market | Approximate price at the time | How did it differ from the same product today? |\n|-----------------------------|----------------------------------------|-------------------------------|------------------------------------------------|\n| Canned salmon               |                                        |                               |                                                 |\n| Canned sardines             |                                        |                               |                                                 |\n| Other canned fish that appeared early - give names | |                               |                                                 |\n| Apples - fresh              |                                        |                               | Hand to Remember                                 |\n|                             | dried                                  |                               | These items                                      |\n| Lettuce                     |                                        |                               |                                                 |\n| Tomatoes - fresh            |                                        |                               |                                                 |\n|                             | canned                                 |                               |                                                 |\n| Bananas                     |                                        |                               |                                                 |\n| Lemons                      |                                        |                               |                                                 |\n| Oranges                     |                                        |                               |                                                 |\n| Cornflakes                  |                                        |                               |                                                 |\n| Other prepared breakfast cereals - give names | |                               |                                                 |\n| Pearl tapioca               |                                        |                               |                                                 |\n| Minute tapioca              |                                        |                               |                                                 |\n| Sago                        |                                        |                               |                                                 |\n| Dates                       |                                        |                               |                                                 |\n| Walnuts                     |                                        |                               |                                                 |\n| Icing sugar                 |                                        |                               |                                                 |\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your home?\n\nHow was it brought to the home? (pail, barrel, tank)\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe dug two wells, both 6 feet deep, but the water was hard / alkaline / actually unfit for human use, 1 for years / up to the present we have hauled first class water by analysis 5-7 miles for domestic use.\n11. PLEASE FILL IN THE FOLLOWING TO THE BEST OF YOUR MEMORY:\n\n| FOOD | Earliest date it appeared on the market | Approximate time at the same product from day? |\n|------|----------------------------------------|-----------------------------------------------|\n| Canned salmon | | |\n| Canned sardines | | |\n| Other canned fish that appeared early gave nausea | | |\n| Apples - fresh | | |\n| - dried | | |\n| Lettuce | | |\n| Tomatoes - fresh | | |\n| - canned | | |\n| Bananas | | |\n| Lemons | | |\n| Oranges | | |\n| Cornflakes | | |\n| Other prepared breakfast cereals - give names | | |\n| Pearl tapioca | | |\n| Minute tapioca | | |\n| Sago | | |\n| Dates | | |\n| Walnuts | | |\n| Icing sugar | | |\n\nHand to Remember\n\nThese items\n\n12. WATER SUPPLY\n\nWhere did you get water for drinking and for cooking? (well, river, slough, dugout)\n\nHow far was this water from your home? We hauled water 9 miles.\n\nRegarding water supply, mention any changes which have taken place since you first started housekeeping, giving dates where possible.\n\nWe dug two wells, both of them deep, but the water was hard, alkaline. Initially unfit for human use. For years we kept it in present use by boiling first class water, by analysis 5% milk for domestic use.\n13. SOAP\n\nDid you buy laundry soap or make your own? [Handwritten]\n\nIf you made your own, did you use lye? [Handwritten]\n\nWhat kinds of laundry soap did the grocer handle? [Handwritten]\n\nSunlight, \"Pears,\" \"Crest\"\n\n14. FUEL\n\nWhat fuel did you use in the earliest days? [Handwritten]\n\nWhere did you get your fuel? [Handwritten]\n\nMention any changes in the use of fuels which have taken place since you first started housekeeping, giving dates where possible.\n\nWhen the Railway came in 1907, we used coal/wood & brought in by the G.N.R., then oil came into use about 1948 and now in our town village of Netherhills, natural gas is the only fuel used.\n\n15. METHODS OF COOKING AND TYPES OF UTENSILS\n\nFor cooking, did you use an indoor fireplace or open hearth in the earliest days? (Give dates) [Handwritten]\n\nDid you use an outdoor fireplace or bake oven? (Give dates) [Handwritten]\n\nBy whom was your first cook stove made? [Handwritten]\n\nWhat year was it purchased? 1907 Price? [Handwritten]\n\nWhat types of utensils did you use? (Iron, copper, tin, homemade) [Handwritten]\n\nFor preparing food? (china, earthenware, wooden bowls, other) [Handwritten]\n\nWhen did you first see enamel ware? [Handwritten]\n\nAluminum? About 20 years ago (1932)\n13. **SOAP**\n   - Did you buy laundry soap or make your own?\n   - If you made your own, did you use lye?\n   - What kind of laundry soap did you use?\n\n14. **FIRE**\n   - What fuel did you use in the earliest days?\n   - Where did you get your fuel?\n   - From whom did you get your fuel?\n   - Did you have any changes in the use of fuel which have taken place since you first started homesteading?\n   - First standard homesteaders' living dates where possible.\n\n   *Notes:*\n   - The Kishmery came in 1909, but stood until 1920.\n   - It brought in by the C.N.R., then oil came into use about 1948 and now in our time (writing of 1956).\n\n   *Additional note:* In the early fuel used:\n\n15. **METHODS OF COOKING AND TYPES OF UTENSILS**\n   - For cooking, did you use an indoor fireplace or open hearth in the earliest days? *(Give dates)*\n   - Did you use an outdoor fireplace or bake oven? *(Give dates)*\n\n   *Notes:*\n   - By whom was your first cook stove made?\n   - What year was it purchased? *(Give date)*\n   - What types of utensils did you use? *(Iron, copper, tin, homestead)*\n\n   *Additional note:*\n   - They found the nearest source of water.\n   - For preparing food: *(plates, earthenware, wooden bowls, other)*\n\n   *Notes:*\n   - Was it first used inside? *(Give date)*\n   - How long did it last? *(Give date)*\n16. WRAPPINGS AND CONTAINERS\n\nMention any changes which you recall in the wrappings and containers received with the food you purchased (give dates where possible).\n\nPractically all food was wrapped by the storekeeper & he used old newspapers when his brown paper played out. Usually tied up with string and cloth or other tape were unknown in 1906.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest year you can remember. Give the year and list the members of the family with their ages at the time. State the approximate month, e.g., winter or summer.\n\n1906 Breakfast Porridge, slice of salted pork, coffee Bread, butter / jam. Syrup\n\nDinner Potatoes (if we had them) canned meat (if no fresh meat) dried apples (in pie) bread / butter / jam Possibly prunes Supper, fried potatoes (if any) baked beans, bread butter / jam Syrup dripping butter, dripping was always kept / used instead of butter\n\n18. What year did you serve your first Christmas dinner in Western Canada? ..........\n\nGive the menu. List those present and give their approximate ages at the time.\n\nI cannot recall the first Reel Family gathering for Xmas.\n\n19. Were you ever reduced to almost starvation level living on one or two locally produced foods? Give details.\n\nI remember one time when my brother left for Saskatchewan I left me in charge of the stock. There was little food left; he remained longer than expected, I was forced to subsist on Boiled Wheat / syrup for 5 or 6 days while I didn't starve, I've never had the least notion of trying that diet again.\n16. WRAPPINGS AND CONTAINERS\nMention any changes which you recall in the wrappings and containers received\nwith the food you purchased (extra those where possible).\n\nFor January all food was wrapped by the store keeper\nI do not recall any newspapers or other items being paper\npacked out. Usually they were packed with cheese and eggs.\n\n17. Give a typical day's menu (breakfast, dinner and supper) for the earliest\nyear you can remember. Give the year, and list the numbers of the family\nwithin the age at the time. State the approximate amount, e.g., \"half a\nbottle.\"\n\n1906 Breakfast Porridge, apple sauce, porridge tea\nBread, butter, jam, or applesauce\nDinner Potatoes (if we had them), canned meat (if fresh meat),\nchopped apples (in pie), bread, butter, jam\nSupper, fried potatoes (yams), brown bread, brown butter, jam,\nknocking butter, drinking chocolate, kipper, usual amount of milk.\n\n18. What year did you serve your first Christmas dinner in Western Canada?\nGive the year and list those present and give their approximate ages at the time.\n\nI cannot recall the first Reit family\ngathering for Xmas.\n\n19. Were you ever reduced to almost starvation level living on one or two locally\nproduced foods? Give details.\n\nI remember this time after my brother left for Saskatchewan.\nI left me in charge of the stock! There was little food\nleft, he remained longer than expected. I was forced\nto subsist on boiled wheat / syrup for several days\nwhile I didn't obtain, I've never had the chance before.\n\nA very hard diet again.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMaybe there's little difference except that now the housewife has so many labor-saving appliances, automatic stoves that less work is actually used in cooking a much larger meal, than would have been incurred 50 years ago when all she had was a cook stove equipped for burning wood, maybe the wood was only green poplar poles.\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWhen the Railway arrived here in 1909, we gradually lost the habit of preparing for 6 months supply, I bought in smaller quantities I had more variety; I would say the change began in 1909 but was not in full swing until after the first war, maybe 1920.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandizing, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nNot much more to add, except a word about tobacco. We used to purchase tobacco in large packages with a pipe imbedded in the mixture. This was French Canadian \"Tobac\" it wasn't nice to smoke, after being used to better prepared stuff, but when we ran out of smoking altogether we used to dry the tea leaves, mix them with the inner bark of the Red Willow (Smoke that). It smelled awful & tasted worse! Its usual name was \"Kini Kini\". Many matches were of the Sulphur variety & when ignited, you had to wait until the Sulphur burned away before lighting your pipe, as the Sulphur fumes were very powerful & not at all palatable.\n20. Mention any outstanding differences in the preparation of meals in the earliest days as compared with today.\n\nMaybe there's little difference except that now the housewife has so many labour-saving appliances, automatic stoves that less work is actually used in cooking a much larger meal, than would have been incurred 50 years ago when all she had was a coal stove equipped for burning wood, (maybe the wood was only green poplar poles).\n\n21. When did you begin to rely on purchased foods and prepared foods instead of homegrown and home prepared foods? (Give as many details and dates as possible).\n\nWhen the Railway arrived here in 1909, we gradually lost the habit of preparing for 6 months supply, I bought in smaller quantities I had more variety; I would say the change began in 1909 but was not in full swing until after the first war, maybe 1920.\n\n22. Please add other details from your early experiences of buying groceries and securing foods in other ways during pioneer days in Western Canada. Include items not mentioned above, quality, methods of merchandising, prices, problems of storage, shortages and other details. (Use back of page if more space is needed).\n\nNot much more to add, except a word about tobacco. We used to purchase tobacco in large packages with a pipe imbedded in the mixture. This was French Canadian \"Jobac\" & it wasn't nice to smoke, after being used to better prepared stuff, but when we ran out of smoking cigarettes we used to dry the tea leaves & mix them with the inner bark of the Red Willow & smoke that. It smelled awful & tasted worse! Its usual name was \"Kini Kini\". Many matches were of the Sulphur variety & when ignited, you had to wait until the Sulphur burned away before lighting your pipe, as the Sulphur fumes were very powerful & not at all palatable.\nOxford\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.1-DietQuestionnaires_Box12937_1906A-D_174.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 6619, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 1693, 3], [1693, 3830, 4], [3830, 5124, 5], [5124, 6154, 6], [6154, 7463, 7], [7463, 8627, 8], [8627, 13210, 9], [13210, 16729, 10], [16729, 20550, 11], [20550, 21780, 12], [21780, 23016, 13], [23016, 24329, 14], [24329, 25895, 15], [25895, 27422, 16], [27422, 29231, 17], [29231, 31046, 18], [31046, 31046, 19], [31046, 31200, 20]], "primary_language": ["None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, true, true, false, true, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]