[{"id": "18592f204b4f9893f46f65ae269f7c019fdc74c3", "text": "S-X2\n418. Long Mary Elizabeth (Mrs. W.J.)\nS-X2\n418. Long Mary Elizabeth (Mrs. W.J.)\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire\n\nIt is difficult to prepare a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; others may prove impossible for you to answer, so don't worry about leaving blank spaces. Use extra sheets of paper if there is not sufficient space to answer the questions. Don't hesitate to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Diet: What Did Western Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ) and one will be sent to you.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark the ones you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our Province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\nLong, Mrs. (Mary Elizabeth?)\nCarlyle.\n\nTo Sask. - May, 1882.\n\nSASKATCHEWAN ARCHIVES QUESTIONNAIRES\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nA word of explanation to the person answering this questionnaire:\n\nIt is difficult to answer a general questionnaire on pioneer life because no individual who is asked to answer it has exactly the same experiences as another. Some of the questions here will not apply to your experiences; therefore, there are blank spaces provided for you to fill in any additional information that may be relevant to your experiences. If there is not enough space to answer the question, please write an additional sheet of paper and staple it to this questionnaire.\n\nThis questionnaire is intended for persons who lived in Western Canada before 1914, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires:\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Did Saskatchewan Canadian Pioneers Eat?\" is still being circulated. If you have not already answered this, and would be willing to do so, please put a check mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please mark those you would be willing to answer.\n\n( ) All questionnaires\n( ) Pioneer health conditions\n( ) Pioneer social life, sports and recreation\n( ) Pioneer housing\n( ) Pioneer education and churchwork\n( ) Pioneer farming experience\n\nPreservation of Questionnaires:\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\n[Stamp]\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nNOTE: Please print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you'd rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name M.A.R.Y...ELIZABETH...LONG...\n\n2. Your address CARLTON...\n\n3. Date JUN. 17...1968...\n\n4. Where were you born? (Give name of place and country) WELLINGTON COUNTY ONTARIO\n\n5. What was your father's name and occupation? CHRISTOPHER BLOUGH CARPENTER\n\n6. When did you come to Saskatchewan? (Give month and year) MAY 28 - 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible. Came to in April 1882 wanted a farm for the summer but a flood came and we flooded out so then decided to go on to Moose Mountain.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc). I was married on March 9th when we came west.\n\n9. What were your reasons for coming West? Everyone at that time was talking of the advantages of the West, my husband's people had 4 sons & 4 daughters so they decided to come west and give them all a start.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?). Mostly through the people talking & the wonderful prints and the land just for the taking of a homestead.\nLong, Mrs. (Mary Elizabeth)\nCarlyle.\n\nTo Sask. - May, 1962.\n\n1. Your full name: MARY ELIZABETH KONIG\n\n2. Your address: CARLYLE\n\n3. Date: JUNE 17, 1962\n\n4. Where were you born? (Give name of place and country): WELLINGTON COUNTY ONTARIO\n\n5. What was your father's name and occupation?: CHRISTOPHER LOWE\n\n6. When did you come to Saskatchewan? (Give month and year): MAY 28, 1882\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible:\n\n   Came to Canada April 8, 1882, started a farm for the summer, but a flood came and we flooded out so then decided to go to the new mountain.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child,\" \"I was in my teens,\" etc.)\n\n9. What were your reasons for coming West?\n\n   Everyone said that there was nothing of the advantages in the west, my husband's people had 4 sons & daughters so they decided to come west and give them only a start.\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?)\n\n    Mostly through the people looking at the wonderful prairie and the land great for the raising of a family and land.\n11. What did your friends and relatives think of your decision to come to Western Canada?\nSome of the neighbors thought I was very foolish to come so far to such a wild and far away country.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)?\nThere were twelve of us in the party.\n\n13. What means of transportation did you use?\nWe came by train to Redm, and then from there to the Moose Mountains by wagon, horses and oxen. My husband Tom John Henry having the only team of horses.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\nIt had a lot of hardships on our trip west, it just seemed it was one slough after another that we had to come through. The travelling was slow with the oxen pulling the wagons. I remember I bought a new pair of shoes at Redm and I walked so much that they were worn out when we arrived here. I never saw an Indian until we arrived at Moose Mountain, it took me a few years to get used to seeing the Indians so I was quite afraid of them. We had a big blizzard on May 21st and when we settled we had no wood and had to trust grabs to burn.\n\n15. Where did you first stay when you arrived in Saskatchewan?\nAt that time this was all the North West Territories and we settled near where Carlyle is today.\n\n16. Where did you settle or take up land?\nNear Carlyle.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\nWe have always lived in this part.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\nFarming in Ontario.\n11. What did your friends and relatives think of your decision to come to Western Canada? They thought I was very foolish to come so far to work in a cold and far off country.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? You were with your family.\n\n13. What means of transportation did you use? We came by train to Regina, and then from there by bus to our new home and farm.\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other experiences etc.) We had a lot of hardships on our trip west. We lost our way several times and almost died out. However, we made it through the travelling and drew much strength from the help of the Indians. We arrived here a few days later than we had planned and when we arrived here, we found that the land was not as good as we thought it would be. We had a lot of work to do and we assisted here when possible.\n\n15. Where did you first stay when you arrived in Saskatchewan? We stayed at a small town called Willowmore.\n\n16. Where did you settle or take up land? Willowmore.\n\n17. Mention any other places where you have lived since coming to Saskatchewan. We have always lived in this place.\n\n18. How did you earn a living before coming to Western Canada? How after you came? I am now in Ontario.\n19. How often did you write to relatives or friends in your old home?\nI didn't write very much but I think I wrote once the first year, so there wasn't any place to put them.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\nWilliam John Long, March 7, 1882 at Monrofield\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\nThey all came west at the same time.\n\n23. Is there any particular experience of pioneer days that stand out in your memory which you would like to record?\nThe first few winters we used to move up to the mountain with all our stock and cattle and the men put up log cabins and we lived like a small community for the winter months, moving back to our farms in the spring. We didn't have a lot of years and my mother-in-law was on call to anyone that was sick five miles around. We were here before Massemin was started. I believe that fall of '82 Massemin started.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\nMostly by wagon and buggy. We had no minister but later in the summer the student ministers would come and hold the services in the homes. The usual way of travel was by wagon. In early years there was a stage coach from Alameda to Massemin.\n19. How often did you write to relatives or friends in your old home?\n\nI wrote very much and thought about them all year.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage.\n\nWilliam John Long, March 7, 1893 at Mansfield\n\n21. Did anyone else come to Saskatchewan because of your recommendation? If so, where did they settle?\n\nThey all came out to the same time.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West, tell us when they came and where they settled.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nThe first four months we lived in a tent put up by Mr. Calhoun and we lived like a small community. We would move the morning back to our farm in the spring, but we didn't have a lot of work and my mother was very busy. We called to anyone that was sick or needed assistance.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.)\n\nWe traveled quite a bit. We had no cars or trucks and the standard mode of transportation was by wagon. We used to travel on each year's trip using a stage coach from Edmonton to Saskatoon.\n25. When was the first car used in the community?\n   About 1905\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   None\n\n27. Where was your trading center? How far from your home?\n   Up to 1890 we went to Mowasin (6 miles then), 1890-1900 to Alameda (25 miles). Our early store started in 1900.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   \n29. How often did you shop in the early days?\n   In 1883 my husband made a trip to town in a team of horses. We loaded the grain to Mowasin.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   Our first catalogue would be at Toronto - the J. Eaton Co., and I remember sending for a hat.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Yes\n25. When was the first car used in the community?\n\n26. If you owned a car before 1947, when did you buy it? What makes it?\n\n27. Where was your trading center? How far from your home? (Indicate any changes due to new town appear-\n\ning, better means of travel, etc.)\n\n28. Did you continue to trade there? (Indicate any changes due to new town appear-\n\ning, better means of travel, etc.)\n\n29. How often did you shop in the early days? (Was my husband twice a week)\n\n30. When (if ever) did people in your district first start going to town regularly\n\non Saturdays?\n\n31. When (if ever) did you first begin to buy through the mail order catalogue?\n\nWhat kind of articles did you buy? Indicate also what proportion of your total purchases were made by mail order and what proportion of purchases were made locally.\n\nOur local catalogue would be at Brenda's.\n\n32. When did you first have a telephone and what company provided it?\n\n33. When you came to Shubuta, how did you make up your mind after looking it over? How did you make this decision?\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nNo.\n\n35. Did many people move away during the 1930's? Did many return?\n\nNot many.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nW.J. Long owned the first threshing machine in the county. Mr. Long used to thresh mostly up until times as it was stack threshing and the machine was hauled by horses every where they went.\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given. Give date and reason for change. Give facts of new name as above in (1), (2), (3).\n5. Did any people move away from your district prior to 1934? What reasons did they have for moving?\n\n36. Did many people serve away during the 1920s? Did many return?\n\n37. If you or any member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\n38. How did the citizens in your community get their names (school districts, post offices, villages, railway stations, townships, etc.)? Try to give: (1) the end occupation of person suggesting place name; (2) date of name change; (3) data of its adoption. Give name of new name as above in (1) & (2).\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon?.... (Indicate your preference, if any) ..................\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nOne son E.E. Long at Carlyle - farming.\nOne daughter MRS. JESSIE SHAW - BRANDON, MAN.\nTwo Grand children JACK SHAW, BETTY SHAW.\nThree Great Grand children: JANICE, JOAN & MARILYN SHAW.\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe important changes were very noticeable, the newer machinery - the railroad, telephone and the old gramophone & talking machines so they were better known - they came the electric age.\n\n__________________________\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nMy mother's eyesight went about 25 years ago. She can see to give a count and she bake her own pies five years ago but her health is very good but the hips never healed. Her mother's grand mother was the two and a half women landed south.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nMiss Mary E. Long\nCarlyle, Sask.\n\n$82.\n\nE.E. Long\nCarlyle, Sask.\n6.\n\n37. Questions regarding historical records material:\nDo you have any personal or do you know the whereabouts of the following:\nLetters, old photographs, old newspapers, old postcards, old telegrams, old manuscripts (if any).\n\nWould you or the person who owns them either:\n(1) be willing to lend them to the Provincial Archives for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University of Saskatchewan?\n\n(Indicate your preference, if any.)\n\n48. If you have children or grandchildren, please give their names, where they live and occupation.\n\nOne son, E. E. Long, of Carlyle—family:\nMRS. SEBASTIAN SHAW—BRANDON, MB.\nTwo grand children, Jack Shaw, Betty Shaw.\n\nThree great-grand children, Harold, Gordon & Marilyn Shaw.\n\n61. What do you think are the most important changes in your community since you\n\nThe important changes were very noticeable. The house,\nmachine—telephone and the new\nold gramophone, a talking machine so easy and\nlittle known—they came the fastest way.\n\nPlease give the names and addresses of other persons who could answer this question.\n\nMy wife is very fond of this place. She has lived here\nfor many years and has always been very fond of it.\n\nMy mother-in-law was very fond of this place.\n\nE. E. Long\nCarlyle, Sask.\n", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12941_1883M-Z_418.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5259, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 42, 3], [42, 84, 4], [84, 2059, 5], [2059, 4067, 6], [4067, 5649, 7], [5649, 6922, 8], [6922, 8584, 9], [8584, 9954, 10], [9954, 11463, 11], [11463, 12705, 12], [12705, 14027, 13], [14027, 15065, 14], [15065, 16239, 15], [16239, 16869, 16], [16869, 18605, 17], [18605, 19936, 18], [19936, 19936, 19], [19936, 19936, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "None", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]