[{"id": "968206491effb68749e3a4657ca4bacd2c759d8a", "text": "AFFLECK, WILLIAM MCKENZIE\nNaseby, 1906\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\nPlease print all proper names and place names in capital letters. If you are not sure the name is correct as you have given it, please say so. If you rather have someone else do the writing at your dictation, this is quite acceptable.\n\n1. Your full name: WILLIAM AFFLECK\n2. Your address: Naseby, Bank\n3. Date: April 15th, 1906\n4. Where were you born? (Give name of place and country)\n   Hall's Mills, Lambton County, Ontario.\n5. What was your father's name and occupation?\n   James Affleck. He was a farmer.\n6. When did you come to Saskatchewan? (Give month and year)\n   November 1st, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Hall's Mills, Ont. 1879 to 1904\n   Boissevain, Manitoba 1904 to 1906\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\")\n   I was in my teens' going to Manitoba on harvest excursion for three months\n9. What were your reasons for coming West?\n   To be a cheese & butter maker from 1897 to 1904 in Ontario but on account of poor health decided to come west to farm.\n10. How did you learn about the West? (Through other people? Reading about it?)\n    Railroad or government information.\n11. My trip west in 1896, also from visitors from the west.\n    My uncle James Rae wrote me asking me to come west to rent his 320 acre farm at Boissevain.\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name: William McKenzie Affleck\n2. Your address: Maple Park\n3. Date: April 15th, 1962\n4. Where were you born? (Give name of place and country)\n   Hall's Mill, Lambton County, Ontario\n5. What was your father's name and occupation?\n   James Affleck. He was a farmer.\n6. When did you come to Saskatchewan? (Give month and year)\n   November 1st, 1906\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Hall's Mill, Ont. 1879 to 1904\n   Roseberry, Manitoba 1904 to 1906\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may say \"I was a small child\")\n   I was in my teens, I came to Manitoba on harvest excursion for three months\n9. Was there any reason for coming West?\n   25 years old, came to Manitoba to rent farm at Roseberry.\n10. Was a cheese & butter maker from 1897 to 1904 in Ontario but on account of poor health decided to come west to farm.\n\n11. How did you learn about the West? (Through other people? Reading about it?)\n    By my trip to West in 1906, also from visitors from the West.\n    Railroad or government information.\n    My mother wrote me asking me to come west to rent his 320 acre farm at Roseberry.\n11. What did your friends and relatives think of your decision to come to Western Canada? They were quite agreeable to my coming west.\n\n12. Did you travel by yourself or with a party (family, friends or other groups)? I traveled with a group of settlers from Almonte, Ont., in a car of stills, effects from Almonte, Ont., to Souris, Man.\n\n13. What means of transportation did you use? Canadian Pacific Ry. freight train\n\n14. What incidents of the journey do you remember? Please you met on the way, meetings with Indians, accidents on the journey, sicknesses or other experiences etc.? The trip from Almonte to Winnipeg was pleasant outside of catching a severe cold. We were hardly able to attend to our horses & cattle at times. We were caught in a real western blizzard. It took me from Sunday afternoon to Tuesday morning to get to Blisserain, 152 miles. The train was stuck so badly I had to walk half a mile to a farm to get another place the locomotive was stuck in snow level with top of boiler, this was about March 20th 1904. It was two days before I could get moved out to the farm two and a half miles.\n\n15. Where did you first stay when you arrived in Saskatchewan? My first stay was at the hotel at Poveshuin for two days, during this time the snow was so bad you could not see eleven or across street. Arrived at Saskatoon in Oct. 1906 with a car of settlers which we unloaded and moved out to the homestead on Nov. 1st 1906. Some lumber along built a shelter up.\n\n16. Have lived in no other place.\n\n17. How did you earn a living before coming to Western Canada? How after you came?\n\n18. Butter and cheese making in Ontario. Farming in Saskatchewan.\n11. What did your friends and relatives think of your decision to come to Western Canada? My relatives were quite agreeable to my coming west.\n\n12. Did you travel by yourself or with a party (family, friends or other group)? I traveled by myself.\n\n13. What means of transportation did you use? Canadian Pacific Railway freight train.\n\n14. What incidents of the journey do you remember? Please you list on the way, etc., the trip from Altoona to Winnipeg was pleasant outside of catching cattle. The weather was hardly able to attend to my horses & cattle at Winnipeg. We bought in a real western blizzard. It took me from Sunday morning to Tuesday so badly I had to walk half a mile to a farm. The train was running late to arrive there was no water for my stock. Also the time the locomotive was stuck in snow level with top of boiler. The engine was about March 20th 1904. After reaching Bilsaerain it was two days before I could get moved out to the farm two and a half miles.\n\n15. How did you first stay when you arrived in Saskatchewan? My first stay was at the hotel at Fort Qu'Appelle for two days during this time the snow was bad you could not see an elevator across the street. Arrived at Saskatoon in Oct. 1906 with a case of settlers effects which we unloaded at Saskatoon and moved out to the homestead by horse team a distance of eighty miles including all expenses on Nov. 1st 1906 and some lumber along built a shelter to stay in for the first night.\n\n16. Have lived in no other place.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n\nButter and cheese making in Ontario.\n\nFarming in Saskatchewan.\n19. How often did you write to relatives or friends in your old home? About twice a month; the nearest post office was Battleford first year a distance of 48 miles.\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Was married to Minnie Ellenson on March 22nd, 1905 at Galbraith, Ontario.\n\n21. Did anyone else come to Saskatchewan because of your recommendation it as a place to settle? Yes, my father & mother & a brother came after me. One brother came at the same time.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled. Parents and brother came about 1908. They settled in the same district.\n\n23. Is there any particular experience of pioneer days that stand out in your memory? While rounding up the Herefords in the Eagle Hills 15 miles from nearest settler. In December 1906 we lost our first son born by Asquith and three weeks later our second son by the same woman. We had a team of horses and a couple of bullocks to assist over 100 miles and half rail to Tolstoi. I started on horseback carrying revolvers burnt to charcoal and half my sustenance singed lighting prairie fires to save our buildings and pastures.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel? Among the neighbors not more than ten miles as the only means of travelling in was a horse & buggy. At first church was held in houses sometimes in sod shacks, later on it was held in the school.\n19. How often did you write to relatives or friends in your old home?\n\n20. If you got married, give the name of your husband or wife along with the date and place of marriage. Was married to Minnie Johnson on March 22nd, 1905 at Galbraith, Ontario.\n\n21. Did anyone else come to Saskatchewan because of your recommendation? Yes, my father & mother & a brother came after me. One brother came at the same time.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came west tell when they came and where they settled. Parents and brother came about 1908. They settled in the same district.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount? Fill in the Eagle Hills 15 miles from nearest settlement.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means? Yes we visited more than ten miles as the only means of travelling was a horse & buggy. At first church was held in houses sometimes in sod shacks, later on it was held in the schoolhouse.\n25. When was the first car used in the community?\n   1918\n\n26. If you owned a car before 1914, when did you get it? What make?\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there? (Indicate any changes due to new terms agreed upon, better means of travel, etc.) After 1908 when the railways went through towns started at Bigger and Landis, but still used the horse & buggy.\n\n29. How often did you shop in the early days?\n   About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   People do not go to town regularly on Saturdays yet.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Initiate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\n32. When did you first have a telephone and what company provided it?\n   1918, Heeby Rural Telephone Co., Ltd.\n\n33. When you came to Saskatoon, the first time was it with the idea of staying permanently? Or did you have up your mind after trying it out? Then did you make this decision? Yes, but after coming through the bed years I considered leaving here for some better district.\n25. When was the first car used in the community?\n   1918\n\n26. If you owned a car before 1914, when did you buy it?\n   Had no car until 1926\n\n27. Where was your trading center? How far from your home?\n   Battleford was our first trading center, 48 miles.\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.) After 1906 when the railways went through towns started at Bigger and Lands, but still used the horse & buggy.\n\n29. How often did you shop in the early days?\n   About once a month.\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   People do not go to town regularly on Saturdays yet.\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any change in the proportion of purchases made by mail order since the pioneer period.\n   Started buying from mail order houses in 1909 but do not buy nearly so much now since the chain stores started doing business in town.\n\n32. When did you first have a telephone and what company provided it?\n   1918, Yaneby Rural Telephone Co., Ltd.\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? Then did you make this decision? Yes, but after coming through the bad years I considered leaving here for some better district.\n34. Did any people move away from your district prior to 1914? If so, what reasons did they have for moving? No\n\n35. Did many people move away during the 1920s? Did many return? Yes and very few ever returned.\n\n36. If you or some member of your family have held public offices, or have been active in any organizations, mention it here, giving dates whenever possible.\n\nI have been Deputy-Treasurer of Naseby Rural Telephone Co., since 1916. Was councillor of First Local Improvement District about 1908. Was councillor of R.M. Rosemount No. 378 for about 15 years between the years 1914 and 1946. Was Secretary-Treasurer of Naseby Co-operative Assn., Ltd., until it dissolved in 1960.\n\nI've been Secretary of Lett S.D. for a number of years. I've been Secretary of Naseby Red Cross Society for 35 years. I've been Secretary-Treasurer of the King George V Jubilee Medal also a Life Member and Medalist from the Society.\n\nShe also served on Board of Trustees of Lett S.D. for a number of years.\n\n37. If you or any of your family or friends were interested in having or do something in the district mention it here, giving dates wherever possible, (such as organizing the first automobile, obtaining the first telephone, etc.)\n\nAffleck Bros were the first to buy a threshing outfit in 1911.\n\nAffleck, L. Affleck was the first baby to come into the district in 1907.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name and occupation of person originating place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) extra names in names since the first name was given.\n\nThe first school district was called Northfield No. 1 (1872), on account of being built along side of the old Galt's Current Trail. About 1914 the name was changed to Lett's to correspond with the name of the siding on the railway nearest to the school.\n\nThe first post office at Naseby was called Matcham which was the name of the first post master but after the railway went through in 1908 the name of the post office was changed to Naseby same as the siding.\n\nThos. Matcham was the first store keeper and post master at Naseby.\n34. Did any people move away from your district prior to 1924? If so, how many did?\n\nYes, and very few ever returned.\n\n35. Did many people move away during the 1920s? Did many return?\n\nYes, and very few ever returned.\n\n36. If you or any members of your family have held public office or have been active in any organizations, mention it here. Include dates wherever possible.\n\nI have been Secretary-Treasurer of Massey Rural Telephone Co. since 1916. Was councillor of First Local Improvement District No. 378 for about 15 years between the Years 1914 and 1944. Was Secretary-Treasurer of Massey Co-operative Assn., Ltd., until it dissolved in 1940. My wife has been Secretary-Treasurer of Massey Red Cross Society for 35 years. She was presented with the King George V Jubilee Medal also a Life Membership Medal from the Society. She also served on Board of Trustees of Lett S.D. for a number of years.\n\n37. If you or any of your family or friends were first to have or do something in the district mention it here, giving dates whenever possible (such as owning the first automobile, combining the first tractor, etc.).\n\nAFFLECK: We were the first to buy a threshing outfit in 1911.\n\n38. How did the places in your community get their names? (School districts, post offices, villages, railway stations, creeks, hills, etc.) Try to give (1) name, (2) date of its origin, (3) origin of name, (4) reason for name, (5) other interesting facts.\n\nThe first school district was named after the old \"Bilt Curran\" Mill, on account of being built alone side of the old siding on the railway nearest to the school. The first Post Office was called Kitchen which was the name of the first Postmaster but after the railway went through in 1908 the name of the Post Office was changed to Massey since the siding. Thos. Metchen was the first store keeper and Postmaster at Massey.\n37. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, written records, pamphlets, old photographs, written records, etc.? If so, please provide details.\n\n38. Would you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n\n(2) be willing to present them to the Archives Division of the Legislative Assembly in Regina? (Indicate your preference, if any).\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\nSon, Affleck, L., Neesby, Farmer\n\nDaughter, Affleck, Emma, Neesby, Farmer\n\nGranddaughter, Affleck, Dorothy, Cumberland, Ont.\n\n41. What do you think are the most important changes in your community since you first came here? This community was known in the pioneer days as the \"Scotch Settlement\" and has more of the original settlers than elsewhere. The most important changes I would say is the change from oxen to horses and now from horses to tractors and from horse machinery to power. Also the changes from plows and binders to combines.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nJohn Yeakle 250 29th St., Saskatoon.\n\nAlex Maxwell, Nasby, Sask.\n\nTom Millen, Bathelford.\n\nAlex Atkinson, Peterboro, Ont.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nJim Affleck\n\nNeeby, Sask.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old photos, written reminiscences, etc.? (Describe)\n\n40. If you have children or grandchildren, please give their names, where they live and occupation.\n\n41. What do you think was the most important change in your community since you were a child? This community was known as the \"Pioneer Settlement\" and has more of the original settlers than elsewhere.\n\nThe most important changes I would say is the change from oxen to horses, and now from horse to tractors and from horse machinery to power. Also the change from plows and binders to ones with combines.\n\nPlease give the names and addresses of other pioneers who should answer this questionnaire.\n\nJohn Iskild 250-29th St., Saskatoon.\nAlex Maxwell, Nastby, Sask.\nJohn Millan, Nottlford.\nAlex Attenhead, Peterboro, Ont.\n\nIf someone else has filled in this questionnaire for you, please have this person sign below.\n\nJim Affleck\n\nJasbey, Sask.\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford\nNo. 613 S\nIf Slimtrim Fasteners are to be included, please specify.\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12949_1906A-C_883.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 18, "total-input-tokens": 29880, "total-output-tokens": 5221, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 1536, 5], [1536, 2855, 6], [2855, 4520, 7], [4520, 6251, 8], [6251, 7856, 9], [7856, 8973, 10], [8973, 10295, 11], [10295, 11822, 12], [11822, 14049, 13], [14049, 15917, 14], [15917, 17421, 15], [17421, 18458, 16], [18458, 18610, 17], [18610, 18761, 18]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]