[{"id": "ec111b5681fae69a3ae337300ae835637e3ca3ed", "text": "Langford, James Arthur\nGerrard.\n\nTo Sask., August, 1825.\n\nSASKATCHEWAN ARCHIVES BOARD\n\nNo. 2\n\nPIONEER ENTERPRISES: A GENERAL QUESTIONNAIRE\n\nA NOTE OF EXPLANATION TO THE READER\n\nANSWERING THIS QUESTIONNAIRE\n\nIt is difficult to imagine a general questionnaire on pioneer life because no individual who is asked to answer it can possibly give an accurate account of his experiences as he has lived. It is impossible for you to answer so that every detail may be given. It is better to give details, or describe particular events, if they help to answer the questions.\n\nThis questionnaire is intended for anyone who lived in Western Canada before 1934, and may be answered by anyone who has personal experience of the pioneer years whether born in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them on separate sheets or apply for a separate questionnaire.\n\nOther Questionnaires\n\nSaskatchewan Archives Board Questionnaire No. 1, entitled \"Pioneer Life That Has Changed,\" is still being circulated. If you have not already answered this one, and are willing to do so, please get a closer mark here ( ).\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these may be listed below. Please mark the ones you would be willing to answer.\n\n[ ] All Questionnaires\n[ ] Pioneer health conditions\n[ ] Pioneer social life, sports and recreation\n[ ] Pioneer housing\n[ ] Pioneer education and churchwork\n[ ] Pioneer farming experience\n\nEncouragement of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's collection at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Office,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nI might be able to give a little of the early pioneer education and church work but it might not be deemed of much interest.\n\n[Handwritten note]\n\nPaul [signature] and family will be grateful for your cooperation.\nLangford, James Arthur\nGermshott.\n\nTo Sask., August, 1925.\n\nPIONEER SURVEYS: A GENERAL QUESTIONNAIRE\n\nNo. 2\n\nIt is difficult to imagine a general questionnaire in pioneer life because no individual who has visited a new country can give an accurate account of his experiences. It is necessary to have some idea of what may be expected from such a visit.\n\nThis questionnaire is intended for persons who lived in Eastern Canada before coming to Saskatchewan. It is not intended for persons who have lived in this province or not.\n\nIf more than one member of the family can answer the questions, they should write them out separately and apply for a separate questionnaire.\n\nSaskatchewan Archives Questionnaire No. 1, entitled \"Pioneer Life: What Will You Remember?\" is still being circulated. If you have not already answered this questionnaire, you will be glad to do so.\n\nSaskatchewan Archives questionnaires on other subjects will be prepared at a later date. Some of these are listed below. Please carry this card with you when willing to answer.\n\n| All questionnaires |\n|-------------------|\n| Pioneer health conditions |\n| Pioneer social life, sports and recreation |\n| Pioneer housing |\n| Pioneer education and churchwork |\n\nPreservation of Questionnaires\n\nAll questionnaires will be preserved in the Saskatchewan Archives Board's Office at the University of Saskatchewan as part of the permanent record of our province. Please send your completed questionnaire to:\n\nSaskatchewan Archives Board,\nUniversity of Saskatchewan,\nSaskatoon, Sask.\n\nI might be able to give a little of the early plans of education and church work but it might not be deemed of much interest.\n\nA. O. Langford\n\n[Handwritten note:]\nPaul and I had been included in the report of the park.\nSASKATCHEWAN ARCHIVES QUESTIONNAIRE\n\nNo. 2\n\nPIONEER EXPERIENCES: A GENERAL QUESTIONNAIRE\n\n1. Your full name ... James Arthur Langford\n\n2. Your address ... Camduff, Sask.\n\n3. Date ... April 18th, 1952\n\n4. Where were you born? (Give name of place and country)\n   London, England\n\n5. What was your father's name and occupation?\n   George Langford, Tallow Chandlers Assistant\n\n6. When did you come to Saskatchewan? (Give month and year)\n   August 1895\n\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Erin Township, Wellington Co., Ont.\n\n8. How old were you when you first came to Western Canada? (You do not need to answer this question if you would rather not or you may use \"I was a small child\", \"I was in my teens\", etc.). 28 years\n\n9. What were your reasons for coming West?\n   Saw little chance of advancement in the East, thought I would come West and grow up with the country\n\n10. How did you learn about the West? (Through other people? Reading about it? Railroad or government information?).\n    Through other people\nLangford, James Arthur\nGardiner.\n\nTo Bank. - August, 1925.\n\n1. Your full name: James Arthur Langford\n2. Your address: Cluny Rd., Sask.\n3. Date: April 16th, 1903\n4. Where were you born? (Give name of place and country)\n   London, England\n5. What was your father's name and occupation?\n   George Langford, Tallow Chandler's Assistant\n6. When did you come to Saskatchewan? (Give month and year)\n   August 1895\n7. Mention any other places where you lived before coming to Saskatchewan, giving dates wherever possible.\n   Erin Township Wellington Co., Ont.\n8. How old were you when you first came to Western Canada? (You do not need to say.)\n   28 Years\n9. What were your reasons for coming West?\n   Saw little chance of advancement in the East, thought I would come west and grow up with the country\n10. How did you learn about the West? (Through other people, reading about it?)\n    Through other people\n\nINFORMATION THROUGH OTHER PEOPLE\n11. What did your friends and relatives think of your decision to come to Western Canada? My sister, father and mother died before I was eight years old leaving my brother George aged 12 in the world alone. He was put out to sea and I was shipped out to this country and taken into a home, not adopted, stayed there until I was 21, hired with him the next summer, then went to school, got a certificate, taught three years, then went back to school, took a second and came west and Normalized in Regina in the fall of 1895.\n\n12. Did you travel by yourself or with a party (family, friends or other group)?\n   Came out on the harvest excursion\n\n13. What means of transportation did you use?\n   C.P.R. Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement, etc.).\n   None until I reached Winnipeg, was walking down street and met a chap with whom I had boarded in the same house in Owen Sound when studying. We had a few minutes to chat before train moved out and we decided we would go to Regina and take Normal.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n   At a boarding house, I have forgotten the name of the Land lady, I think her name was Smith.\n\n16. Where did you settle or take up land?\n   Never took up land, Finished Normal, applied for a school in Carnduff, was accepted, started teaching Jan. 2nd 1896. Have lived in Carnduff ever since but only taught five years.\n\n17. Mention any other places where you have lived since coming to Saskatchewan.\n   None\n\n18. How did you earn a living before coming to Western Canada? How after you came?\n   Was raised on the farm, the last three years before coming West taught school. Since coming taught five years, after that worked for business men after that was Municipal Clerk for 27 years, and Sec.Treas of school Board in Carnduff 41 years and for the past few years conveyancing and Insurance.\n12. Did you travel by yourself or with a party (family, friends or other group)?\n\nDance out on the harvest excursion\n\n13. What means of transportation did you use?\n\nC.P.R. Railway\n\n14. What incidents of the journey West do you remember? (People you met on the way, meetings with Indians, adventures on the journey, accidents or other excitement etc.)\n\nNone until I reached Winnipeg, was walking down street and met a chap with whom I had boarded in the same house in Owen Sound when studying. We had a few minutes to chat before train moved out and we decided we would go to Regina and take Normal.\n\n15. Where did you first stay when you arrived in Saskatchewan?\n\nAt a boarding house, I have forgotten the name of the land lady, I think her name was Smith.\n\n16. Where did you settle or take up land?\n\nNormal, Jan. 2nd 1896, have lived in Carnduff, W.R. since then.\n\n17. How many acres have you farmed since you have lived there?\n\nNone\n\n18. How did you earn a living before coming to Western Canada? How after coming West?\n\nWas raised on the farm, the last three years before coming West taught school. Since coming taught five years after that worked for business men after that was Municipal Clerk for 27 years, and Sec. Treas. of school Board in Carnduff 41 years and for the past few years Correponding and Insurance.\n19. How often did you write to relatives or friends in your old home?\n\nMy brother wrote me from England about 1875, or I should say to the people with whom I have been living. I wrote at once in reply but have never heard of his since. My uncle Bob and the boys I have never heard of since and being only seven when XXXXX parents died I knew of his other relatives. Oldest son was in school with whom I sat with for two years. School and a year in school with whom I sat with for two years.\n\nIf you got married, give the name of your husband or wife along with the date and place of marriage.\n\nElla Margaret Richardson, Oct 31st 1900. Carnduff Sask.,\n\n21. Did anyone else come to Saskatchewan because of your recommending it as a place to settle?\n\nNot to my knowledge\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOnly had one brother left after sister Emma died and I have already mentioned about him.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to record?\n\nI can not think of any.\n\n24. Did you travel about much in the early years? (for business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nCame to Carnduff in 1896 and have not travelled but very very little. Been to Regina to the fair now and again and also Brandon\n19. How often did you write to relatives or friends in your old home?\n\nMy brother wrote me from England about 1875 or I should say to the people with whom I have been living since then. I wrote at no time have heard of him and being only seven years old and not able to read or write.\n\n20. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nNot to my knowledge.\n\n21. Did anyone else come to Saskatchewan because of your recommendation as a place to settle?\n\nNot to my knowledge.\n\n22. If other members of your family (brothers, sisters, parents, etc.) came West tell when they came and where they settled.\n\nOnly had one brother left after sister Emma died and I have already mentioned about him.\n\n23. Is there any particular experience of pioneer days that stands out in your memory which you would like to recount?\n\nI can not think of any.\n\n24. Did you travel about much in the early years? (For business, attending church, visiting friends, etc.) How often? How far? By what means of travel?\n\nCame to Caribou in 1890 and have not travelled but very little. Been to Regina to the fair now and again and also Brandon.\n25. When was the first car used in the community?\n   About 1910\n\n26. If you owned a car before 1914, when did you buy it? What make?\n   Did not own one\n\n27. Where was your trading center? How far from your home?\n   Carnduff lived there throughout the years\n\n28. Did you continue to trade there? (Indicate any changes due to new towns appearing, better means of travel, etc.).\n   Yes\n\n29. How often did you shop in the early days?\n   Whenever it was necessary\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n   About 1905\n\n31. When (if ever) did you first begin to buy through the mail order catalogues? What kind of articles did you buy in this way? Indicate also what fraction of your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n   About 1905. Articles more chiefly clothing\n   Possibly about 5% to 8%\n\n32. When did you first have a telephone and what company provided it?\n   Never had a telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Being young I tried it for a time. I might say that I applied for a school at Fort Saskatchewan the same time as I applied for Carnduff, both were accepted but as Carnduff's acceptance came first I took it.\n25. When was the first car used in the community?\n   About 1910\n   If you owned a car before 1914, when did you buy it?\n   Did not own one\n\n27. Where was your trading center? How far from your home?\n\n28. Did you continue to trade there throughout the years? (Indicate any changes due to new towns appearing, better means of travel, etc.)\n   Yes\n\n29. How often did you shop in the early days?\n   Whenever it was necessary\n\n30. When (if ever) did people in your district first start going to town regularly on Saturdays?\n\nAbout 1905\n\n31. When (if ever) did you first begin to buy through the mail order catalogues?\n   What kind of articles did you buy in this way? Indicate also what fraction or your total purchases were by mail order and any changes in the proportion of purchases made by mail order since the pioneer period.\n\nAbout 1905. Articles more chiefly clothing\n   Possibly about 5% to 8%\n\n32. Then did you first have a telephone and what company provided it?\n   Never had a telephone\n\n33. When you came to Saskatchewan the first time was it with the idea of staying permanently? Or did you make up your mind after trying it out? When did you make this decision?\n   Being young I tried it for a time. I might say that I applied for a school at Fort Saskatchewan the same time as I applied for Carnduff both were accepted but as Carnduff's acceptance came first I took it.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI can not recall of their doing so. Of course there are always odd ones who move but so far as my memory goes there was not in any way a general movement.\n\n35. Did many people move away during the 1930's? Did many return?\n\nVery few. I recall a meeting at which a representative from the party in Regina was speaker. Some had said to him before the meeting they would like to get out of here. At the meeting he asked the question where would you go. One farmer said we would go north. He smiled and said I have asked this question in the north and they say we would go south. He advised them to stay and perhaps time would change for the better which they certainly. People stayed and have no regrets they did.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here, giving dates wherever possible.\n\nI am not sure what this means but I was councillor of Carnduff 4 years mayor one, 1908 --1912 unclusive\nWas Sec Treas. 1907 to 1934 of Rural Municipality Mount Pleasant No 2\nWas Sec. Treas of Carnduff School Board 1910 to 1951.\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combine, organizing the first lodge, etc.).\n\nCan not qualify\n\n38. How did the places in your community get their names? (School districts, Post Offices, villages, railway stations, creeks, hills, etc.). Try to give: (1) name and occupation of person suggesting place-name (2) origin and meaning of the name (3) date of its adoption (4) any changes in names since the first name was given date and reason for change. Give facts of new name as above in (1); (2), (3).\n\nSchool district, Post Office, and Railway station received their name, Carnduff from one of the very earliest settlers.\n\nCan not give anything further about this.\n34. Did any people move away from your district prior to 1914? What reasons did they have for moving?\n\nI can not recall of their doing so. Of course there are always odd ones who move but so far as my memory goes there was not in any way a general movement.\n\n35. Did many people move away during the 1920s? Did many return?\n\nVery few. I recall a meeting at which a representative from the Federation in Regina was speaking. Some had said to him before the meeting they would like to get out of here. At the meeting he asked the question where would you go? One farmer said we could go north, east or south and said I have asked this question in the north and perhaps some would go south. He advised them to stay and perhaps some time would come for the better when they certainly people would and have no regrets for they did active in any organizations, mention in her giving guidance.\n\nI am not sure what this means but I was councillor of Carnduff 4 years mayor one 1908-1912 inclusive was Sec. Treas. 1907 to 1914 of Rural Municipality Mount Pleasant No. 2 was Sec. Treas. of Carnduff School Board 1910 to 1951.\n\n36. If you or some member of your family have held public office, or have been active in any organizations, mention it here giving dates:\n\nCan not qualify\n\n37. If you or any of your family or friends were \"first\" to have or do something in the district mention it here giving dates wherever possible. (Such as owning the first automobile, combining, originating the first lodge, etc.)\n\nCan not qualify\n\n38. How did the places in your community get their names? (School district, Post offices, Villages, railway stations, creeks, hills, etc.) Try to give: (1) name and occupation of person suggesting place-name; (2) origin and meaning of the name; (3) date of its adoption; (4) any changes in name since the first name was given; (5) reason for change. Give facts of new name as above in (1), (2), (3).\n\nSchool district: Post Office, and Railway station received their name, Carnuff from one of the very earliest settlers. Can not give anything further about this.\n39. Questions regarding historical source materials:\n\nDo you have in your possession or do you know the whereabouts of diaries, old letters, old posters and programs, minute books of community organizations, old pamphlets, old photographs, written recollections and reminiscences? (Describe).\n\nI know of nothing of value as to the above nor where same can be had. Really I do not think there is such in or about town.\n\nWould you or the person who owns them either\n\n(1) be willing to lend them to the Provincial Archivist for copying? .......\n\n(2) be willing to present them to the Archives Division of the Legislative Library, Regina, or the Archives Office at the University in Saskatoon? .......\n\n(indicate your preference, if any) ..................\n\nif we had such I think so but as said I know no one who has such\n\n40. If you have children or grandchildren, please give their names, where they live and occupations.\n\nLorenz Leslie Langford, Whitehorse Yukon, Druggist with army, never took Dischagre\n\nNellie Sourfield, Sutherland Sask, housekeeper,\n\nFrederick Norman Langford, Druggist, Mission City B.C.\n\nReed Jerome Langford, book keeper, at Carnduff,\n\nLouis Cavell Langford, City Policeman, Saskatoon,\n\nMarion Geraldine Mills, North Bay Ont., housekeeper\n\nShirley Sourfield, Saskatoon, Nurse, Granddaughter\n\n41. What do you think are the most important changes in your community since you first came West?\n\nThe community so far as I can see has been one of steady development. I know of no particular event which stands out in any way.\n\nPlease give the names and addresses of other pioneers who could answer this questionnaire.\n\nEdward Parson, Carnduff, (was here at least 10 years before me)\n\nThe rest of the old timers have passed on.\n\nIf someone else has filled in this questionnaire for you, please have this person give name and address here:\n\nFilled in same myself\n\nA.J. Langford\n39. Questions regarding historical records:\n\nDo you have any photographs or do you know of the existence of diaries, old letters, old papers and personal, albums, books of community organizations, old pamphlets, old newspapers, written resolutions and reminiscences (Describe).\n\nI know of nothing of value as to the above nor where same can be had. Really I do not think there is such in or about town.\n\nWould you or the person who owns them either:\n\n(1) be willing to lend them to the Provincial Archivist for copying?\n(2) be willing to present them to the Archives Division of the Legislative Library Regina, or the Archives Office at the University in Saskatoon?\n\n(Indicate your preference, if any)\n\nIf we had such I think so but as said I know no one who has such.\n\n40. If you have children or grandchildren, please give their names, where they live and occupations:\n\nLorenz Leib Langford, Whitehorse Yukon, Druggist with army, never took Lorentz Leib Langford, Whitehorse Yukon, Druggist with army, never took\n\nNellie Sourfield Sutherland Saskatchewan City B.C.,\n\nFrederick Norman Langford, Druggist at Cranbrook\n\nReedercorn Langford, City Clerk Old Strathcona\n\nLouis Gayel Langford, North Bay, Ont., housekeeper\n\nMarion Geraldine Allis, North Bay, Ont., housekeeper\n\nShirley Sourfield Gabroon, Nurse, Granddaughter\n\n41. What do you think are the most important changes in your community since you first came west?\n\nThe community so far as I can see has been one of steady development, I know of no particular event which stands out in any way.\n\nPlease give the names and addresses of other pioneers who could answer this question.\n\nEdward Farson, Cranbrook, was here at least 10 years before me.\n\nThe rest of the old timers have passed on.\n\nIf someone else has filled in this questionnaire for you, please have this person fill in name myself.\n\nA. J. Langford\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8\nOxford.\n\nNo. 613 S\n\nIf Slimtrim Fasteners are to be included, please specify.\n\nSpécifiez si vous voulez des agrafes Slimtrim.\n\nMississauga, Ontario L5T 1M8", "source": "olmocr", "added": "2025-10-03", "created": "2025-10-03", "metadata": {"Source-File": "/home/jic823/projects/def-jic823/pdfs_jessylee/PioneerQuestionnairesPDFs//PioneerQuestionnaires_No.2-GeneralExperiencesQuestionnaires_Box12944_1895_570.pdf", "olmocr-version": "0.3.4", "pdf-total-pages": 20, "total-input-tokens": 33200, "total-output-tokens": 5956, "total-fallback-pages": 0}, "attributes": {"pdf_page_numbers": [[0, 0, 1], [0, 0, 2], [0, 0, 3], [0, 0, 4], [0, 2061, 5], [2061, 3827, 6], [3827, 4913, 7], [4913, 5848, 8], [5848, 7837, 9], [7837, 9158, 10], [9158, 10568, 11], [10568, 11725, 12], [11725, 13145, 13], [13145, 14525, 14], [14525, 16539, 15], [16539, 18621, 16], [18621, 20515, 17], [20515, 22381, 18], [22381, 22528, 19], [22528, 22683, 20]], "primary_language": ["None", "None", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en", "en"], "is_rotation_valid": [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true], "rotation_correction": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], "is_table": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false], "is_diagram": [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]}}]